         MACRO                                                             
&N       ENDDO                                                             
.********************************************************************
.* 05/14/06 DSH Z390 RPI 316 UPDATED FOR COMPAT.
.********************************************************************
&N       DO    END                                                         
         MEND
