       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTCMP3.
       AUTHOR.        DON HIGGINS.
       DATE-WRITTEN.  04/15/12.
      * TEST COMPARE WITH SCALING FOR IMPLIED DECIMAL                              
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 EH1 FLOAT-HEX-7       VALUE 1.5.
       77 DH1 FLOAT-HEX-15      VALUE 1.5.
       77 LH1 FLOAT-HEX-30      VALUE 1.5.
       77 EB1 FLOAT-BINARY-7    VALUE 1.5.
       77 DB1 FLOAT-BINARY-16   VALUE 1.5.
       77 LB1 FLOAT-BINARY-34   VALUE 1.5.
       77 ED1 FLOAT-DECIMAL-7   VALUE 1.5.
       77 DD1 FLOAT-DECIMAL-16  VALUE 1.5.
       77 LD1 FLOAT-DECIMAL-34  VALUE 1.5.
       77 H1      COMP PIC S9(3)V9    VALUE 1.5.
       77 F1      COMP PIC S9(8)V9    VALUE 1.5.
       77 G1      COMP PIC S9(17)V9   VALUE 1.5.
       77 Q1      COMP PIC S9(38)V9   VALUE 1.5.
       77 P1      COMP-3 PIC S9(30)V9 VALUE 1.5.
       77 Z1             PIC S9(30)V9 VALUE 1.5.
       77 GOOD    COMP-3 PIC 9(4)   VALUE 0.
       77 BAD     COMP-3 PIC 9(4)   VALUE 0.
       PROCEDURE DIVISION.
       MAINLINE.
           DISPLAY 'TESTCMP3 TEST SCALED COMPARES'
           IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF DH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF DH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF LH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF LH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF EB1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF EB1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF DB1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF DB1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF LB1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF LB1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF ED1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF ED1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF DD1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF DD1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF LD1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF LD1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF F1  = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF F1  = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF G1  = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF G1  = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF H1  = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF H1  = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF P1  = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF P1  = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           IF Q1  = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF Q1  = Z1  PERFORM GOOD ELSE PERFORM BAD.                        
           IF Z1  = EH1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = DH1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = LH1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = EB1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = DB1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = LB1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = ED1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = DD1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = LD1 PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = F1  PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = G1  PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = H1  PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = P1  PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = Q1  PERFORM GOOD ELSE PERFORM BAD.
           IF Z1  = Z1  PERFORM GOOD ELSE PERFORM BAD.                        
           DISPLAY 'TOTAL GOOD = ' GOOD ' TOTAL BAD = ' BAD
           STOP RUN.
       GOOD.
           ADD 1 TO GOOD.
       BAD.
           DISPLAY 'BAD'
           MOVE 16 TO RETURN-CODE
           ADD 1 TO BAD.
