       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TESTFIL2.
      * THIS FAILED WITHOUT RPI 1048 FIX TO ZCOBOL\Z390\GEN_WS.MAC
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE
               ASSIGN TO 'ZCOBOL\TEST\TESTFIL2.IN'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUT-FILE
               ASSIGN TO 'ZCOBOL\TEST\TESTFIL2.OUT'
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  IN-FILE
           DATA RECORD IS IN-RECORD.
       01  IN-RECORD PIC X(80).
       FD  OUT-FILE
           DATA RECORD IS OUT-RECORD.
       01  OUT-RECORD PIC X(80).
       WORKING-STORAGE SECTION.
       01  WS-LINE PIC X(80).
       01  END-OF-FILE-FLAG PIC X.

       77  COUNTER-1 COMP-3 PIC S9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAINLINE.
           DISPLAY 'TESTFIL2 STARTED'.
           DISPLAY 'TESTFIL2 ENDED OK'.
           STOP RUN.
