       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTMPY2.
       AUTHOR.        DON HIGGINS.
       DATE-WRITTEN.  04/25/12.
      * TEST MULTIPLY  WITH SCALING FOR IMPLIED DECIMAL                              
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 EH1 FLOAT-HEX-7       VALUE 3.0.
       77 DH1 FLOAT-HEX-15      VALUE 3.0.
       77 LH1 FLOAT-HEX-30      VALUE 3.0.
       77 EB1 FLOAT-BINARY-7    VALUE 3.0.
       77 DB1 FLOAT-BINARY-16   VALUE 3.0.
       77 LB1 FLOAT-BINARY-34   VALUE 3.0.
       77 ED1 FLOAT-DECIMAL-7   VALUE 3.0.
       77 DD1 FLOAT-DECIMAL-16  VALUE 3.0.
       77 LD1 FLOAT-DECIMAL-34  VALUE 3.0.
       77 H1      COMP PIC S9(1)V9(3)    VALUE 3.0.
       77 F1      COMP PIC S9(1)V9(8)    VALUE 3.0.
       77 G1      COMP PIC S9(11)V9(7)   VALUE 3.0.
       77 Q1      COMP PIC S9(33)V9(6)   VALUE 3.0.
       77 P1      COMP-3 PIC S9(16)V(5)  VALUE 3.0.
       77 Z1             PIC S9(11)V9(4)  VALUE 3.0.
       77 EH2 FLOAT-HEX-7       VALUE 2.00.
       77 DH2 FLOAT-HEX-15      VALUE 2.00.
       77 LH2 FLOAT-HEX-30      VALUE 2.00.
       77 EB2 FLOAT-BINARY-7    VALUE 2.00.
       77 DB2 FLOAT-BINARY-16   VALUE 2.00.
       77 LB2 FLOAT-BINARY-34   VALUE 2.00.
       77 ED2 FLOAT-DECIMAL-7   VALUE 2.00.
       77 DD2 FLOAT-DECIMAL-16  VALUE 2.00.
       77 LD2 FLOAT-DECIMAL-34  VALUE 2.00.
       77 H2      COMP PIC S9(2)V99         VALUE 2.00.
       77 F2      COMP PIC S9(6)V999        VALUE 2.00.
       77 G2      COMP PIC S9(14)V9999      VALUE 2.00.
       77 Q2      COMP PIC S9(34)V99999     VALUE 2.00.
       77 P2      COMP-3 PIC S9(25)V999999  VALUE 2.00.
       77 Z2             PIC S9(24)V9999999 VALUE 2.00.
       77 EH3 FLOAT-HEX-7       VALUE 6.00.
       77 DH3 FLOAT-HEX-15      VALUE 6.00.
       77 LH3 FLOAT-HEX-30      VALUE 6.00.
       77 EB3 FLOAT-BINARY-7    VALUE 6.00.
       77 DB3 FLOAT-BINARY-16   VALUE 6.00.
       77 LB3 FLOAT-BINARY-34   VALUE 6.00.
       77 ED3 FLOAT-DECIMAL-7   VALUE 6.00.
       77 DD3 FLOAT-DECIMAL-16  VALUE 6.00.
       77 LD3 FLOAT-DECIMAL-34  VALUE 6.00.
       77 H3      COMP PIC S9(2)V99         VALUE 6.00.
       77 F3      COMP PIC S9(6)V999        VALUE 6.00.
       77 G3      COMP PIC S9(14)V9999      VALUE 6.00.
       77 Q3      COMP PIC S9(34)V99999     VALUE 6.00.
       77 P3      COMP-3 PIC S9(25)V999999  VALUE 6.00.
       77 Z3             PIC S9(24)V9999999 VALUE 6.00.
       77 G    COMP-3 PIC 9(4)   VALUE 0.
       77 B     COMP-3 PIC 9(4)   VALUE 0.
       PROCEDURE DIVISION.
       MAINLINE.
           DISPLAY 'TESTMPY2 TEST SCALED MULTIPLY'
            MULTIPLY  EH2 BY EH1 IF EH3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY DH1 IF EH3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY LH1 IF EH3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY EB1 IF EH3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY DB1 IF EH3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY LB1 IF EH3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY ED1 IF EH3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY DD1 IF EH3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY LD1 IF EH3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY F1  IF EH3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY G1  IF EH3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY H1  IF EH3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY P1  IF EH3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY Q1  IF EH3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EH2 BY Z1  IF EH3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  DH2 BY EH1 IF DH3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY DH1 IF DH3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY LH1 IF DH3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY EB1 IF DH3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY DB1 IF DH3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY LB1 IF DH3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY ED1 IF DH3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY DD1 IF DH3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY LD1 IF DH3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY F1  IF DH3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY G1  IF DH3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY H1  IF DH3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY P1  IF DH3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY Q1  IF DH3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DH2 BY Z1  IF DH3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  LH2 BY EH1 IF LH3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY DH1 IF LH3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY LH1 IF LH3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY EB1 IF LH3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY DB1 IF LH3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY LB1 IF LH3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY ED1 IF LH3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY DD1 IF LH3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY LD1 IF LH3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY F1  IF LH3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY G1  IF LH3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY H1  IF LH3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY P1  IF LH3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY Q1  IF LH3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LH2 BY Z1  IF LH3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  EB2 BY EH1 IF EB3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY DH1 IF EB3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY LH1 IF EB3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY EB1 IF EB3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY DB1 IF EB3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY LB1 IF EB3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY ED1 IF EB3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY DD1 IF EB3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY LD1 IF EB3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY F1  IF EB3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY G1  IF EB3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY H1  IF EB3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY P1  IF EB3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY Q1  IF EB3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  EB2 BY Z1  IF EB3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  DB2 BY EH1 IF DB3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY DH1 IF DB3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY LH1 IF DB3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY EB1 IF DB3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY DB1 IF DB3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY LB1 IF DB3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY ED1 IF DB3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY DD1 IF DB3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY LD1 IF DB3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY F1  IF DB3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY G1  IF DB3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY H1  IF DB3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY P1  IF DB3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY Q1  IF DB3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DB2 BY Z1  IF DB3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  LB2 BY EH1 IF LB3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY DH1 IF LB3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY LH1 IF LB3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY EB1 IF LB3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY DB1 IF LB3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY LB1 IF LB3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY ED1 IF LB3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY DD1 IF LB3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY LD1 IF LB3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY F1  IF LB3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY G1  IF LB3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY H1  IF LB3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY P1  IF LB3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY Q1  IF LB3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LB2 BY Z1  IF LB3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.       
           MULTIPLY  ED2 BY EH1 IF ED3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY DH1 IF ED3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY LH1 IF ED3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY EB1 IF ED3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY DB1 IF ED3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY LB1 IF ED3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY ED1 IF ED3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY DD1 IF ED3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY LD1 IF ED3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY F1  IF ED3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY G1  IF ED3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY H1  IF ED3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY P1  IF ED3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY Q1  IF ED3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  ED2 BY Z1  IF ED3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  DD2 BY EH1 IF DD3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY DH1 IF DD3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY LH1 IF DD3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY EB1 IF DD3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY DB1 IF DD3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY LB1 IF DD3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY ED1 IF DD3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY DD1 IF DD3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY LD1 IF DD3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY F1  IF DD3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY G1  IF DD3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY H1  IF DD3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY P1  IF DD3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY Q1  IF DD3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  DD2 BY Z1  IF DD3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  LD2 BY EH1 IF LD3 = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY DH1 IF LD3 = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY LH1 IF LD3 = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY EB1 IF LD3 = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY DB1 IF LD3 = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY LB1 IF LD3 = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY ED1 IF LD3 = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY DD1 IF LD3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY LD1 IF LD3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY F1  IF LD3 = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY G1  IF LD3 = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY H1  IF LD3 = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY P1  IF LD3 = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY Q1  IF LD3 = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  LD2 BY Z1  IF LD3 = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  F2  BY EH1 IF F3  = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY DH1 IF F3  = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY LH1 IF F3  = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY EB1 IF F3  = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY DB1 IF F3  = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY LB1 IF F3  = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY ED1 IF F3  = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY DD1 IF EH3 = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY LD1 IF EH3 = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY F1  IF F3  = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY G1  IF F3  = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY H1  IF F3  = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY P1  IF F3  = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY Q1  IF F3  = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  F2  BY Z1  IF F3  = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  G2  BY EH1 IF G3  = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY DH1 IF G3  = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY LH1 IF G3  = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY EB1 IF G3  = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY DB1 IF G3  = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY LB1 IF G3  = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY ED1 IF G3  = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY DD1 IF G3  = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY LD1 IF G3  = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY F1  IF G3  = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY G1  IF G3  = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY H1  IF G3  = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY P1  IF G3  = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY Q1  IF G3  = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  G2  BY Z1  IF G3  = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  H2  BY EH1 IF H3  = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY DH1 IF H3  = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY LH1 IF H3  = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY EB1 IF H3  = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY DB1 IF H3  = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY LB1 IF H3  = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY ED1 IF H3  = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY DD1 IF H3  = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY LD1 IF H3  = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY F1  IF H3  = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY G1  IF H3  = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY H1  IF H3  = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY P1  IF H3  = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY Q1  IF H3  = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  H2  BY Z1  IF H3  = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.      
           MULTIPLY  P2  BY EH1 IF P3  = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY DH1 IF P3  = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY LH1 IF P3  = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY EB1 IF P3  = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY DB1 IF P3  = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY LB1 IF P3  = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY ED1 IF P3  = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY DD1 IF P3  = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY LD1 IF P3  = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY F1  IF P3  = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY G1  IF P3  = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY H1  IF P3  = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY P1  IF P3  = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY Q1  IF P3  = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  P2  BY Z1  IF P3  = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.
           MULTIPLY  Q2  BY EH1 IF Q3  = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY DH1 IF Q3  = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY LH1 IF Q3  = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY EB1 IF Q3  = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY DB1 IF Q3  = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY LB1 IF Q3  = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY ED1 IF Q3  = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY DD1 IF Q3  = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY LD1 IF Q3  = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY F1  IF Q3  = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY G1  IF Q3  = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY H1  IF Q3  = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY P1  IF Q3  = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY Q1  IF Q3  = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Q2  BY Z1  IF Q3  = Z1  PERFORM G ELSE PERFORM B.          
           PERFORM INIT.       
           MULTIPLY  Z2  BY EH1 IF Z3  = EH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY DH1 IF Z3  = DH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY LH1 IF Z3  = LH1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY EB1 IF Z3  = EB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY DB1 IF Z3  = DB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY LB1 IF Z3  = LB1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY ED1 IF Z3  = ED1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY DD1 IF Z3  = DD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY LD1 IF Z3  = LD1 PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY F1  IF Z3  = F1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY G1  IF Z3  = G1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY H1  IF Z3  = H1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY P1  IF Z3  = P1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY Q1  IF Z3  = Q1  PERFORM G ELSE PERFORM B.
           MULTIPLY  Z2  BY Z1  IF Z3  = Z1  PERFORM G ELSE PERFORM B.          
           DISPLAY 'TOTAL G = ' G ' TOTAL B = ' B
           STOP RUN.
       INIT.
           DISPLAY 'INIT'
           MOVE 3.0 TO EH1.
           MOVE 3.0 TO DH1.
           MOVE 3.0 TO LH1.
           MOVE 3.0 TO EB1.
           MOVE 3.0 TO DB1.
           MOVE 3.0 TO LB1.
           MOVE 3.0 TO ED1.
           MOVE 3.0 TO DD1.
           MOVE 3.0 TO LD1.
           MOVE 3.0 TO F1.
           MOVE 3.0 TO G1.
           MOVE 3.0 TO H1.
           MOVE 3.0 TO P1.
           MOVE 3.0 TO Q1.
           MOVE 3.0 TO Z1.    
       G.
           ADD 1 TO G.
           DISPLAY 'GOOD-TEST'.
       B.
           ADD 1 TO B
           MOVE 16 TO RETURN-CODE..
           DISPLAY 'BAD-TEST'.
      *    STOP RUN.
      