*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 03/21/06 RPI 253 add test for macro labels starting with ._
* 03/21/06 RPI 257 add test for * as second operand              
* 04/07/06 RPI 274 add test for 'c''...''' sdt within strings    
*********************************************************************
TESTMAC1 SUBENTRY
         WTO   'TESTMAC1 TEST SUBSTRINGS, '''' (DOUBLE QUOTES), AND &&'
         SUBEXIT
&N       SETA  &N+1
&TEXT    SETC  'ABC'
         DC    C'ABC=&TEXT'
&A       SETC  '&TEXT'(1,1)
         DC    C'A=&A'
&BC      SETC  '&TEXT'(2,2)
         DC    C'BC=&BC'
&TWOAMP  SETC  '&&&&'
         MNOTE '&&TWOAMP=&TWOAMP'
         DC    C'TWOAMP=&TWOAMP'
&DQ      SETC  ''''''
         MNOTE '&&DQ=&DQ'
         DC    C'DQ=&DQ'
         DC     C'A',C'B',CL2'ABC',(2)C'1' TEST COMMENT, MULT FLD,
         dc     c'A',c'B',cl2'ABC',(2)c'1' EXPLICIT LEN, DUP FIELD, LC
         MACRO 
         TESTF  &A,&B
&I       SETA  (&A FIND &B)
&DA      SETC  (DOUBLE &A)
&DB      SETC  (DOUBLE &B)
         MNOTE '&A FIND &B = &I'
         MEND
         TESTF ABC,A
         TESTF ABC,B
         TESTF ABC,C
         TESTF ABC,DCB
         TESTF ABC,X
         TESTF X,
         TESTF ,X
         MACRO 
         TESTI  &A,&B
&I       SETA  (&A INDEX &B)
&DA      SETC  (DOUBLE &A)
&DB      SETC  (DOUBLE &B)
         MNOTE '&A INDEX &B = &I'
         MEND
         TESTI ABC,ABC
         TESTI ABC,AB
         TESTI ABC,BC
         TESTI ABC,ABCD
         TESTI ABC,
         TESTI ,ABC
* TEST MACRO LABELS STARTING WITH ._
         AIF   (1 EQ 1)._OK
         MNOTE 12,'AIF BRANCH TO ._OK FAILED'
         MEXIT
._OK     ANOP
         MNOTE 'BRANCH TO ._OK IS OK'
* TEST * AS SECOND OPERAND
&BC      SETC   'ABC'(2,*)
         MNOTE 'BC=&BC'
* TEST SDT WITHIN STRING
&SDT     SETC   'C''X'''
         MNOTE  'SDT=&SDT'
         END
