*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
         TITLE 'TESTTST1 TEST INTERACTIVE DEBUG COMMANDS'
*
* THIS EZ390 REGRESSION TEST PROGRAM REQUIRES THAT THE TEST REMOTE
* INPUT DDNAME BE SET TO TESTTST1.TF1 FILE WHICH CONTAINS TEST
* COMMANDS WHICH ARE VALIDATED BY THE CODE IN THIS PROGRAM
*
TESTTST1 RT1  MAIN
         EQUREGS
MEMDATA  DS   0D
         DC   F'255'    300.=F'255'
         DC   H'50'     304.=H'50'
         DC   B'1001'   306.=B'1001'
         DC   C'HELLO'  307.=C'HELLO'
         DC   X'ABCDEF' 30C.=X'ABCDEF'
LMEMDATA EQU  *-MEMDATA
         RT1  START
         WTO  'TESTTST1 VERIFY MEMORY AND REG CHANGES BY TEST CMDS'
         L    R3,=A(X'300') LOW MEMORY WORK AREA FOR TEST
         CLC  0(LMEMDATA,R3),MEMDATA  VERIFY MEMORY CHANGES
         RT1  CCE
         CL   R4,=F'123'
         RT1  CCE                     VER R4 REG CHANGE
         RT1  END
         END
