*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 11/02/05 RPI60 ADD MULT LOGICAL OPERATOR TESTS FOR AND OR NOT
*********************************************************************
TESTMAC2 SUBENTRY
         WTO   'TESTMAC2 - TEST CONDITIONAL COMPARES'
         MACRO
&N       TEST  &P1
         MNOTE 'N=&N P1=&P1'
         AIF   (&N NE &P1).SKIP
         MNOTE '&N EQ &P1'
         MEXIT
.SKIP    ANOP
         MNOTE '&N NE &P1'
         MEND
A        TEST  P1
B        TEST  P2
XYZ      TEST  XYZ
         AIF   (1 EQ 0 OR 1 EQ 1).OK1
         AGO   .ERR
.OK1     ANOP
         MNOTE 'OK1'
         AIF   (1 EQ 1 AND 1 EQ 0).ERR
         AIF   (NOT 1 EQ 0).OK2
         AGO   .ERR
.OK2     ANOP
         MNOTE 'OK2'
         AIF   (1 EQ 0 OR NOT 1 EQ 0).OK3
         AGO   .ERR
.OK3     ANOP
         MNOTE 'OK3'
* TEST AGO AND AIF LABELS WITHOUT ANOP
&I       SETA  3
.TEST    AIF   (&I EQ 0).TESTEND
&I       SETA  &I-1
         AGO   .TEST
.TESTEND WTO   'TESTEND I=&I'
         SUBEXIT
         AGO   .EXIT
.ERR     MNOTE 12,'TESTMAC2 ERROR OCCURRED'
.EXIT    ANOP
         END
