*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 03/03/06 RPI 209 TEST STIMER WAIT                                 
*********************************************************************
         TITLE 'TESTTIM1 REGRSSION TEST TIME MACRO FUNCTIONS'
*
* NOTE THIS REGRESSION TEST REQUIRES EZ390 BE RUN WITH NOTIMING
* OPTION IN ORDER FOR TIMESTAMP TO BE FORCED TO 22:33:44:567 2005.002
*
TESTIM2  RT1   MAIN
BINTVL   DC    F'300'           300 * 0.01
MICVL    DC    FL8'3000000'     3   * 1000000 
TUINTVL  DC    FL8'0'           3000000 / 26.04166
STARTED  DC    FL8'0'
ENDED    DC    FL8'0'
         EQUREGS
         RT1   START
         TIME   NS,STARTED
         STIMER WAIT,BINTVL=BINTVL 
         TIME   NS,ENDED
         LG     R3,ENDED
         SG     R3,STARTED
         DSG    R2,=FL8'1000000'
         CLG    R3,=FL8'2500'
         RT1    CCH
         CLG    R3,=FL8'3500'
         RT1    CCL
         TIME   NS,STARTED
         STIMER WAIT,MICVL=MICVL 
         TIME   NS,ENDED
         LG     R3,ENDED
         SG     R3,STARTED
         DSG    R2,=FL8'1000000'
         CLG    R3,=FL8'2500'
         RT1    CCH
         CLG    R0,=FL8'3500'
         RT1    CCL
         LG     R1,=FL8'3000000' R0 = 3 SEC IN MICROSECONDS
         MSG    R1,=FL8'100000'  SCALE UP 5 DECIMAL PLACES
         DSG    R0,=FL8'2604166'  DIVIDE BY TIMER UNITS WITH 5 DEC
         STG    R1,TUINTVL        R0=REMAINDER, R1=QUOTENT
         TIME   NS,STARTED
         STIMER WAIT,TUINTVL=TUINTVL 
         TIME   NS,ENDED
         LG     R3,ENDED
         SG     R3,STARTED
         DSG    R2,=FL8'1000000'
         CLG    R3,=FL8'2500'
         RT1    CCH
         CLG    R0,=FL8'3500'
         RT1    CCL
         WTO   'TESTTIM2 ENDED OK'
         RT1   END
         END
