*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* MAINTENANCE.
* 10/05/05 RPI5 - ADD ASCII MODE SUPPORT (SEE TESTASC2.MLC TEST ALSO)    
* 03/20/06 RPI 232 - TEST INTEGER WITH EXPONENT 1E3 = 1000    
* 04/05/06 RPI 270 - TEST CA'...' AND CE'...'  MZ390 AND AZ390 SDTS               
*********************************************************************
TESTSDT1 RT1   MAIN
         RT1   START
* TEST MZ390 SDTS
&N1      SETA  1
&N2      SETA  2
         RT1 CCL,=A(&N1),=A(&N2)   
&N1      SETA  C'B'
&N2      SETA  C'A'
         RT1 CCH,=A(&N1),=A(&N2)   
&N1      SETA  123 
&N2      SETA  123 
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  B'11'
&N2      SETA  X'3'
         RT1 CCE,=A(&N1),=A(&N2)
.START_CHAR_TEST ANOP 
         AIF   (C'A' NE X'C1').ASCII_CHAR_TEST
.EBCDIC_CHAR_TEST ANOP  
         RT1   CCL,=C'A',=C'1'     EBCDIC LETTERS < DIGITS
         RT1 CCE,=AL1(B'11000001'),=AL1(C'A')       TEST EBCDIC SDTS
         RT1 CCE,=AL1(C' '),=AL1(X'40')
         RT1 CCE,=A(C'ABCD'),=A(X'C1C2C3C4')
         RT1 CCE,=A(B'1100000111000001'),=A(C'AA')
&N1      SETA  B'11000001'
&N2      SETA  C'A'              
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  C' '
&N2      SETA  X'40'
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  C'ABCD'
&N2      SETA  X'C1C2C3C4'
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  B'1100000111000001'
&N2      SETA  C'AA'
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  C'1''2' 
&N2      SETA  X'F17DF2' 
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  C"1""2"
&N2      SETA  X'312232'
         RT1 CCE,=A(&N1),=A(&N2)
         RT1   CCE,=A(C'1''2'),=A(X'F17DF2')
         RT1   CCE,=A(C"1""2"),=A(X'312232')
* TEST CA/CE SDT'S
&CA1     SETA  CA'1'
&CE2     SETA  CE'22'
&CA3     SETA  ca'333'
&CE4     SETA  ce'4444'
         RT1   CCE,=AL1(&CA1),=X'31'
         RT1   CCE,=AL1(&CE2),=X'F2F2'
         RT1   CCE,=AL1(&ca3),=X'333333'
         RT1   CCE,=AL1(&ce4),=X'F4F4F4F4'
         RT1   CCE,=AL1(CA'1'),=X'31'
         RT1   CCE,=AL1(CE'22'),=X'F2F2'
         RT1   CCE,=AL1(ca'333'),=X'333333'
         RT1   CCE,=AL1(ce'4444'),=X'F4F4F4F4'
         AGO   .END_CHAR_TEST
.ASCII_CHAR_TEST ANOP
         RT1   CCH,=C'A',=C'1'   ASCII LETTERS > DIGITS
         RT1 CCE,=AL1(B'1000001'),=AL1(C'A')       TEST ASCII SDTS
         RT1 CCE,=AL1(C' '),=AL1(X'20')
         RT1 CCE,=A(C'ABCD'),=A(X'41424344')
         RT1 CCE,=A(B'0100000101000001'),=A(C'AA')
&N1      SETA  B'1000001'
&N2      SETA  C'A'              
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  C' '
&N2      SETA  X'20'
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  C'ABCD'
&N2      SETA  X'41424344'
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  B'0100000101000001'
&N2      SETA  C'AA'
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  C'1''2' 
&N2      SETA  X'312732' 
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  C"1""2"
&N2      SETA  X'312232'
         RT1 CCE,=A(&N1),=A(&N2)
         RT1   CCE,=A(C'1''2'),=A(X'312732')
         RT1   CCE,=A(C"1""2"),=A(X'312232')
* TEST CA/CE SDT'S
&CA1     SETA  CA'1'
&CE2     SETA  CE'22'
&CA3     SETA  ca'333'
&CE4     SETA  ce'4444'
         RT1   CCE,=AL1(&CA1),=X'31'
         RT1   CCE,=AL1(&CE2),=X'F2F2'
         RT1   CCE,=AL1(&ca3),=X'333333'
         RT1   CCE,=AL1(&ce4),=X'F4F4F4F4'
         RT1   CCE,=AL1(CA'1'),=X'31'
         RT1   CCE,=AL1(CE'22'),=X'F2F2'
         RT1   CCE,=AL1(ca'333'),=X'333333'
         RT1   CCE,=AL1(ce'4444'),=X'F4F4F4F4'
.END_CHAR_TEST ANOP
&N1      SETA  X'100'              
&N2      SETA  256
         RT1 CCE,=A(&N1),=A(&N2)   
&N1      SETA  -1              
&N2      SETA  X'FFFFFFFF'   
         RT1 CCE,=A(&N1),=A(&N2)   
* TEST AZ390 NON-CHAR SDTS
         RT1 CCL,=AL1(1),=AL1(2)
         RT1 CCE,=AL1(123),=AL1(123)
         RT1 CCE,=AL1(B'11'),=AL1(X'3')
         RT1 CCE,=A(X'100'),=A(256)
         RT1 CCE,=F'-1',=A(X'FFFFFFFF')
* TEST EXPONENTS IN INTS
         RT1 CCE,=A(1E3),=F'1000'
         RT1 CCE,=H'1E3',=H'1000'
         RT1 END
         END         
