*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 12/08/05 RPI119 ADD TESTS FOR MULT VALUE SETS
*********************************************************************
TESTSET1 SUBENTRY
         WTO   'TESTSET1 - TEST SUBSCRIPTED VARIABLES'
*
* TEST SETA
*
         LCLA  &A(10),&B(10)
&A(1)    SETA  1
&A(2)    SETA  2
&B(1)    SETA  1
&B(2)    SETA  2
         MNOTE 'A(1)=&A(1) A(2)=&A(2)'
         MNOTE 'B(1)=&B(1) B(2)=&B(2)'
         AIF   (&A(1) NE &B(1)).ERR
         AIF   (&A(2) EQ &B(1)).ERR
*
* TEST SETB
*
         LCLB  &C(10),&D(10)
&C(1)    SETB  0
&C(2)    SETB  1
&D(1)    SETB  0
&D(2)    SETB  1
         MNOTE 'C(1)=&C(1) C(2)=&C(2)'
         MNOTE 'D(1)=&D(1) D(2)=&D(2)'
         AIF   (&C(1) NE &D(1)).ERR
         AIF   (&C(2) EQ &D(1)).ERR
*
* TEST SETC
*
         LCLC  &T1(2),&T2(2)
&T1(1)   SETC  'A'
&T2(2)   SETC  '&T1(1).B'
&TEXT    SETC  'X'
&TEXT    SETC  '&TEXT.&T2(2).C'
         MNOTE 'T1(1)=&T1(1). T2(2)=&T2(2).'
         MNOTE 'TEXT=Z&TEXT.Z'
         AIF   (&TEXT NE 'XABC').ERR
.*
.*  test lower case var and opcode
.*
&N       seta  1
         aif   (&n eq 1).ok
         mnote 12,'n ne 1 error'
         b     1
.OK      anop
&n1      seta  1
         aif   (&N1 eq 1).OK1
         mnote 12,'n ne 1 error'
         b     1
.ok1     anop
*
* test upper and lower case ordinary symbols
*
         b     ok2
         wto   'LC label error'
OK2      equ   *
         b     OK3
         wto   'LC label error'
ok3      equ   *
*
* TEST MULT VALUE SETS
*
         LCLA  &LA(3)
         LCLB  &LB(3)
         LCLC  &LC(3)
         GBLA  &GA(3)
         GBLB  &GB(3)
         GBLC  &GC(3)
&LA(2)   SETA  2,3
         AIF   (&LA(2) NE 2 OR &LA(3) NE 3).ERR
&LB(2)   SETB  2,3
         AIF   (&LB(2) NE 2 OR &LB(3) NE 3).ERR
&LC(2)   SETC  '2','3'
         AIF   (&LC(2) NE '2' OR &LC(3) NE '3').ERR
&GA(2)   SETA  2,3
         AIF   (&GA(2) NE 2 OR &GA(3) NE 3).ERR
&GB(2)   SETB  2,3
         AIF   (&GB(2) NE 2 OR &GB(3) NE 3).ERR
&GC(2)   SETC  '2','3'
         AIF   (&GC(2) NE '2' OR &GC(3) NE '3').ERR
* TEST UNARY +- IN PARENS
&X       SETA  -1
         AIF   (&X NE -1).ERR
&X       SETA  --1
         AIF   (&X NE 1).ERR
&X       SETA  -1*-1
         AIF   (&X NE 1).ERR
&X       SETA  -1*(-1+2)
         AIF   (&X NE -1).ERR
&X       SETA  +1
         AIF   (&X NE 1).ERR
&X       SETA  +1*+1
         AIF   (&X NE 1).ERR
&X       SETA  +1*(+1+2)
         AIF   (&X NE 3).ERR
         WTO   'TESTSET1 ENDED OK'
         SUBEXIT
         AGO   .EXIT
.ERR     MNOTE 12,'TESTSET1 ERROR - ABORTING'
.EXIT    END
