*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
         TITLE 'TESTERR2 - TEST AZ390 ERRORS'
TESTERR2 CSECT
         USING *,15
* BLANK, LABEL ONLY, INVALID CHAR FOR LABEL, OPER

LABEL
;
;       ;
* UNDEFINED OPCODE FOR AZ390
        JUNK
* INVALID PARMS
        WTO  'HELLO
        WTO  HELLO'
        WTO  MF=(E,X
        END 
