.* MVS 3.8J PUBLIC DOMAIN
         MACRO
&NAME    ASMTRTAB   &TABLE
.*00011298001400,003600-004000,004800-005200,006200,042400,046200, 000B
.*00011298050000,053800,057600,061400,065200,069000,072800         000B
.*CC271800001400,003800,004000,005000,005200,006200,046010         000G
.*CC271800046140-046190,046200,050000,053800,057600,061400         000G
.*CC271800065200,069000,072800,076410,076600                       000G
.**********************************************************************
.*       AZ11040  (05/18/76)                                   @ZA11040
.**********************************************************************
.*
         LCLA       &LPCTL         LOOP CONTROL, SETB INDEX
         LCLA       &NDX           SYSLIST INDEX
.*
         LCLB  &TABS(30)      TABLE INCLUSION SWITCHES
.*
         LCLA  &NR                 NUMBER OF RCV CODES
&NR      SETA  17
.*
         AIF        (N'&SYSLIST NE 0).CKNAME
         MNOTE 12,'***  IHB004  REQUIRED OPERAND(S) NOT SPECIFIED'
         MEXIT
.CKNAME  AIF        (T'&NAME EQ 'O').SETSYM
         MNOTE      0,'LABEL=&NAME, IGNORED'
.SETSYM  ANOP
&NDX     SETA       1
.LOOP    ANOP
&LPCTL   SETA       &LPCTL+1
         AIF   ('&SYSLIST(&NDX)' EQ '*** RC30 RC50 RF50 RC60 RC40 RF40 -
               RASA RSCI RCT1 RCT2 RC80 RCTW RCT3 RC41 RF41 RB40 RU40 '-
               (5*&LPCTL,4)).TABLECK
         AIF   (&LPCTL LT &NR).LOOP
&LPCTL   SETA  0   RESET LOOP CONTROL COUNTER
.LOOPA   ANOP
&LPCTL   SETA  &LPCTL+1   STEP CODE NAME POINTER
         AIF   ('&SYSLIST(&NDX)' EQ '*** SD30 SD50 SD60 SD40 SASA SSCI -
               SCT1 SCT2 SD80 SCTW SCT3 SD41 SB40                     '-
               (5*&LPCTL,4)).ADJUST
         AIF   (&LPCTL LT 13).LOOPA
         MNOTE 12,'***  IHB002  INVALID TABLENAME OPERAND SPECIFIED-&SYX
               SLIST(&NDX)'
         AGO        .STEPNDX
.ADJUST  ANOP
&LPCTL   SETA  &LPCTL+&NR ADJUST SETB INDEX
.TABLECK AIF        (&TABS(&LPCTL) NE 1).TBLSET
         MNOTE *,'***  IHB075  TABLENAME OPERAND REPEATED-&SYSLIST(&NDXX
               )'
.TBLSET  ANOP
&TABS(&LPCTL) SETB 1
.STEPNDX AIF   (&NDX EQ N'&SYSLIST).CODEGEN CHECK END OF PARAMETER LST
&NDX     SETA       &NDX+1
&LPCTL   SETA  0
         AGO        .LOOP
.CODEGEN AIF   (&TABS(1) NE 1).CKRC50
IECTRC30 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93F3F7B3F3F3F3F3F3F3F3F37'  1
         DC    X'F03F3F613FE2E33F3FE4E53FE63F3FE7'  2
         DC    X'3FE8E93F3F3F3F6B3F3F3F3F3F263F3F'  3
         DC    X'603F3FD13FD2D33F3FD4D53FD63F3FD7'  4
         DC    X'3FD8D93F3F3F3F5B3F3F3F3F3F3F3F3F'  5
         DC    X'3F50C13FC23F3FC3C43F3FC53FC6C73F'  6
         DC    X'C83F3FC93F3F4B3F3F3F3F3F3F3F3F07'  7
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  8
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  9
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  A
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  B
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  C
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  D
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  E
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  F
.CKRC50  AIF   (&TABS(2) NE 1).CKRF50
IECTRC50 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93FF07B3F3F34353F363F3F37'  1
         DC    X'7C3F3F613FA2A33F3FA4A53FA63F3FA7'  2
         DC    X'3FA8A93FE03F3F6B243F3F253F26273F'  3
         DC    X'603F3F913F92933F3F94953F963F3F97'  4
         DC    X'3F98993FD03F3F5B143F3F153F16173F'  5
         DC    X'3F50813F823F3F83843F3F853F86873F'  6
         DC    X'883F3F893FC04B3F3F04053F063F3F07'  7
         DC    X'3F407E3F4C3F3F5E7A3F3F6C3F7D6E3F'  8
         DC    X'5C3F3F4D3F5D7F3F3F34353F363F3F3F'  9
         DC    X'4A3F3F6F3FE2E33F3FE4E53FE63F3FE7'  A
         DC    X'3FE8E93F3F3F3F4F243F3F253F26273F'  B
         DC    X'6D3F3FD13FD2D33F3FD4D53FD63F3FD7'  C
         DC    X'3FD8D93F3F3F3F5A143F3F153F16173F'  D
         DC    X'3F4EC13FC23F3FC3C43F3FC53FC6C73F'  E
         DC    X'C83F3FC93F3F5F3F3F04053F063F3F07'  F
.CKRF50  AIF   (&TABS(3) NE 1).CKRC60
IECTRF50 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93FF07B3F3F34353F363F3F37'  1
         DC    X'7C3F3F613FE2E33F3FE4E53FE63F3FE7'  2
         DC    X'3FE8E93FE03F3F6B243F3F253F26273F'  3
         DC    X'603F3FD13FD2D33F3FD4D53FD63F3FD7'  4
         DC    X'3FD8D93FD03F3F5B143F3F153F16173F'  5
         DC    X'3F50C13FC23F3FC3C43F3FC53FC6C73F'  6
         DC    X'C83F3FC93FC04B3F3F04053F063F3F07'  7
         DC    X'3F407E3F4C3F3F5E7A3F3F6C3F7D6E3F'  8
         DC    X'5C3F3F4D3F5D7F3F3F34353F363F3F3F'  9
         DC    X'4A3F3F6F3FE2E33F3FE4E53FE63F3FE7'  A
         DC    X'3FE8E93F3F3F3F4F243F3F253F26273F'  B
         DC    X'6D3F3FD13FD2D33F3FD4D53FD63F3FD7'  C
         DC    X'3FD8D93F3F3F3F5A143F3F153F16173F'  D
         DC    X'3F4EC13FC23F3FC3C43F3FC53FC6C73F'  E
         DC    X'C83F3FC93F3F5F3F3F04053F063F3F07'  F
.CKRC60  AIF   (&TABS(4) NE 1).CKRC40
IECTRC60 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93FF07B3F3F3F3F3F3F3F3F3F'  1
         DC    X'3F3F3F613F3F3F3F3F3F3F3F3F3F3F3F'  2
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F263F3F'  3
         DC    X'3F3F3FD13FD23F3F3F3F3F3F3F3F3F3F'  4
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  5
         DC    X'3F3FC13FC23F3F3F3F3F3FC53FC63F3F'  6
         DC    X'3F3F3FC93F3F3F3F3F3F3F3F3F3F3F07'  7
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  8
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  9
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  A
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  B
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  C
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  D
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  E
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  F
.CKRC40  AIF   (&TABS(5) NE 1).CKRF40
IECTRC40 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93FF07B3F3F3F353F363F3F37'  1
         DC    X'7C3F3F613FA2A33F3FA4A53FA63F3FA7'  2
         DC    X'3FA8A93F3F3F3F6B3F3F3F253F263F3F' 3
         DC    X'603F3F913F92933F3F94953F963F3F97'  4
         DC    X'3F98993F3F3F3F5B3F3F3F153F16173F'  5
         DC    X'3F50813F823F3F83843F3F853F86873F'  6
         DC    X'883F3F893F3F4B3F3F3F053F063F3F07'  7
         DC    X'3F407E3F4C3F3F5E7A3F3F6C3F7D6E3F'  8
         DC    X'5C3F3F4D3F5D7F3F3F3F353F363F3F3F'  9
         DC    X'4A3F3F6F3FE2E33F3FE4E53FE63F3FE7'  A
         DC    X'3FE8E93F3F3F3F4F3F3F3F253F263F3F'  B
         DC    X'6D3F3FD13FD2D33F3FD4D53FD63F3FD7'  C
         DC    X'3FD8D93F3F3F3F5A3F3F3F153F16173F'  D
         DC    X'3F4EC13FC23F3FC3C43F3FC53FC6C73F'  E
         DC    X'C83F3FC93F3F5F3F3F3F053F063F3F07'  F
.CKRF40  AIF   (&TABS(6) NE 1).CKRASA
IECTRF40 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93FF07B3F3F3F353F363F3F37'  1
         DC    X'7C3F3F613FE2E33F3FE4E53FE63F3FE7'  2
         DC    X'3FE8E93F3F3F3F6B3F3F3F253F263F3F'  3
         DC    X'603F3FD13FD2D33F3FD4D53FD63F3FD7'  4
         DC    X'3FD8D93F3F3F3F5B3F3F3F153F16173F'  5
         DC    X'3F50C13FC23F3FC3C43F3FC53FC6C73F'  6
         DC    X'C83F3FC93F3F4B3F3F3F053F063F3F07'  7
         DC    X'3F407E3F4C3F3F5E7A3F3F6C3F7D6E3F'  8
         DC    X'5C3F3F4D3F5D7F3F3F3F353F363F3F3F'  9
         DC    X'4A3F3F6F3FE2E33F3FE4E53FE63F3FE7'  A
         DC    X'3FE8E93F3F3F3F4F3F3F3F253F263F3F'  B
         DC    X'6D3F3FD13FD2D33F3FD4D53FD63F3FD7'  C
         DC    X'3FD8D93F3F3F3F5A3F3F3F153F16173F'  D
         DC    X'3F4EC13FC23F3FC3C43F3FC53FC6C73F'  E
         DC    X'C83F3FC93F3F5F3F3F3F053F063F3F07'  F
.CKRASA  AIF   (&TABS(7) NE 1).CKRSCI
IECTRASA EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'00010203372D2E2F1605250B0C0D0E0F' 0
         DC    X'101112133C3D322618193F271C1D1E1F' 1
         DC    X'404F7F7B5B6C507D4D5D5C4E6B604B61' 2             A29569
         DC    X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F' 3
         DC    X'7CC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6' 4
         DC    X'D7D8D9E2E3E4E5E6E7E8E94AE05A5F6D' 5             A29569
         DC    X'79818283848586878889919293949596' 6             A29569
         DC    X'979899A2A3A4A5A6A7A8A9C06AD0A107' 7             A29569
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 8
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 9
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' A
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' B
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' C
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' D
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' E
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' F
.CKRSCI  AIF   (&TABS(8) NE 1).CKRCT1
IECTRSCI EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F3F0203373F2E3F3F3F153F3F3F3F3F'  0
         DC    X'3F3F3F3F3F3D3F3F183F3F3F3F3F3F3F'  1
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  2
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  3
         DC    X'406A1A7B5B6C507D4D5D5C4E6B604B61'  4
         DC    X'F0F1F2F3F4F5F6F7F8F97A5E4C7E6E6F'  5
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  6
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  7
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  8
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  9
         DC    X'3FC1C2C3C4C5C6C7C8C9D1D2D3D4D5D6'  A
         DC    X'D7D8D9E2E3E4E5E6E7E8E93F3F0A3F6D'  B            A28624
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  C            A28624
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  D
         DC    X'7C3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  E
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F5F3F4F3F'  F
.CKRCT1  AIF   (&TABS(9) NE 1).CKRCT2
IECTRCT1 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3FE326D640C8D5D415D3D9C7C9D7C3E5'  0
         DC    X'C5E9C4C2E2E8C6E7C1E6D136E4D8D206'  1
         DC    X'3FF526F9403F6B4B155DF450F8F07A5E'  2
         DC    X'F37F5B6F7DF65A6160F22F36F7F14D06'  3
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  4
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  5
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  6
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  7
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  8
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  9
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  A
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  B
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  C
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  D
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  E
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  F
.CKRCT2  AIF   (&TABS(10) NE 1).CKRC80
IECTRCT2 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F3F3F7C3F403F3F3F3FD7D7F0F03F3F'  0
         DC    X'3F3FC8C84D4D3F3F3F3F3FE73FF83F3F'  1
         DC    X'3F37C4C45B5B3F3F04043FE33FF43F3F'  2
         DC    X'0C0C3FD33F6B3F3F3F3FE1E14C4C3F3F'  3
         DC    X'3F3FC2C27F7F3F3F343F3FD93FF23F3F'  4
         DC    X'15153FD13F5C3F3F3F3FE9E97A7A3F3F'  5
         DC    X'3F3F3FC63F503F3F3F3FE5E5F6F63F3F'  6
         DC    X'3F0ED5D54B4B3F3F3F3F3F4F3F6E3F3F'  7
         DC    X'3F3FC1C15A5A3F3F11113FD83FF13F3F'  8
         DC    X'05053FC93F5D3F3F3F3FE8E8F9F93F3F'  9
         DC    X'2D2D3FC53F6C3F3F3F3FE4E4F5F53F3F'  A
         DC    X'3F26D4D460603F3F3F3F3F493F7E3F3F'  B
         DC    X'3F3F3FC33F7B3F3F3F3CE2E2F3F33F3F'  C
         DC    X'3F0BD2D24E4E3F3F3F3F3F793F5E3F3F'  D
         DC    X'3F2FC7C77D7D3F3F3F3F3FE63FF73F3F'  E
         DC    X'0F0F3FD63F613F3F3F3F6D6D6F6F3F07'  F
.CKRC80  AIF   (NOT &TABS(11)).CKRCTW                              000G
IECTRC80 EQU   *    TRANSCODE TO EBCDIC
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'01C1C2C3C4C5C6C7C8C9024B4C2F3F26'  0
         DC    X'50D1D2D3D4D5D6D7D8D9405B5C1F3710'  1
         DC    X'6061E2E3E4E5E6E7E8E9276B6C2D0305'  2
         DC    X'F0F1F2F3F4F5F6F7F8F9327B7C3D1907'  3
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  4
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  5
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  6
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  7
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  8
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  9
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  A
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  B
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  C
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  D
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  E
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  F
.CKRCTW  AIF   (NOT &TABS(12)).CKRCT3                              000G
IECTRCTW EQU   *  ITA2 CODE TO EBCDIC                              000G
         SPACE 1                                                   000G
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                  000G
         DC    X'3FE315D640C8D5D425D3D9C7C9D7C3E5' 0               000G
         DC    X'C5E9C4C2E2E8C6E7C1E6D136E4D8D206' 1               000G
         DC    X'3FF515F9403F6B4B255DF43FF8F07A7E' 2               000G
         DC    X'F34E266F7DF63F6160F22A36F7F14D06' 3               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 4               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 5               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 6               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 7               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 8               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 9               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' A               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' B               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' C               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' D               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' E               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' F               000G
         SPACE 2                                                   000G
.CKRCT3  AIF   (NOT &TABS(13)).CKRC41
IECTRCT3 EQU   *  ZSC3 CODE TO EBCDIC                              000G
         SPACE 1                                                   000G
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                  000G
         DC    X'3FE315D640C8D5D425D3D9C7C9D7C3E5' 0               000G
         DC    X'C5E9C4C2E2E8C6E7C1E6D136E4D8D206' 1               000G
         DC    X'3F4B157A406F6BF7255D61F02AF9F87E' 2               000G
         DC    X'603F26F67DF5F43F4EF3F236F13F4D06' 3               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 4               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 5               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 6               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 7               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 8               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' 9               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' A               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' B               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' C               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' D               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' E               000G
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F' F               000G
         SPACE 2                                                   000G
.CKRC41  AIF   (NOT &TABS(14)).CKRF41
IECTRC41 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F53F3FF73FF6F83F'  0
         DC    X'F43F3FF03FA9F93F3F34353F363F3F37'  1
         DC    X'A33F3FA73F95A43F3F85843F923F3F83'  2
         DC    X'3F93883F3F3F3F82243F3F253F263F3F'  3
         DC    X'5A3F3F943F4BA53F3F7D993F893F3F81'  4
         DC    X'3F96A23F3F3F3FA6143F3F153F16173F'  5
         DC    X'3F91873F7E3F3F86973F3F5E3F986B3F'  6
         DC    X'613F3FA83F3F603F3F04053F063F3F07'  7
         DC    X'3F403F3F7C3F3F7B6C3F3F503F4A5C3F'  8
         DC    X'5B3F3F5D3FE94D3F3F3F3F3F363F3F37'  9
         DC    X'E33F3FE73FD5E43F3FC5C43FD23F3FC3'  A
         DC    X'3FD3C83F3F3F3FC23F3F3F253F3F3F3F'  B
         DC    X'3F3F3FD43F4BE53F3F7FD93FC93F3FC1'  C
         DC    X'3FD6E23F3F3F3FE63F3F3F153F163F3F'  D
         DC    X'3FD1C73F4E3F3FC6D73F3F7A3FD86B3F'  E
         DC    X'6F3F3FE83F3F6D3F3F3F053F063F3F3F'  F
          SPACE 2
.CKRF41  AIF   (NOT &TABS(15)).CKRB40
IECTRF41 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F53F3FF73FF6F83F'  0
         DC    X'F43F3FF03FE9F93F3F34353F363F3F37'  1
         DC    X'E33F3FE73FD5E43F3FC5C43FD23F3FC3'  2
         DC    X'3FD3C83F3F3F3FC2243F3F253F263F3F'  3
         DC    X'5A3F3FD43F4BE53F3F7DD93FC93F3FC1'  4
         DC    X'3FD6E23F3F3F3FE6143F3F153F16173F'  5
         DC    X'3FD1C73F7E3F3FC6D73F3F5E3FD86B3F'  6
         DC    X'613F3FE83F3F603F3F04053F063F3F07'  7
         DC    X'3F403F3F7C3F3F7B6C3F3F503F4A5C3F'  8
         DC    X'5B3F3F5D3FE94D3F3F3F3F3F363F3F37'  9
         DC    X'E33F3FE73FD5E43F3FC5C43FD23F3FC3'  A
         DC    X'3FD3C83F3F3F3FC23F3F3F253F3F3F3F'  B
         DC    X'3F3F3FD43F4BE53F3F7FD93FC93F3FC1'  C
         DC    X'3FD6E23F3F3F3FE63F3F3F153F163F3F'  D
         DC    X'3FD1C73F4E3F3FC6D73F3F7A3FD86B3F'  E
         DC    X'6F3F3FE83F3F6D3F3F3F053F063F3F3F'  F
          SPACE 2
.CKRB40  AIF   (NOT &TABS(16)).CKRU40
IECTRB40 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93FF07B3F3F3F353F363F3F37'  1
         DC    X'7C3F3F613FA2A33F3FA4A53FA63F3FA7'  2
         DC    X'3FA8A93F3F3F3F6B3F3F3F253F263F3F'  3
         DC    X'603F3F913F92933F3F94953F963F3F97'  4
         DC    X'3F98993F3F3F3F5B3F3F3F153F16173F'  5
         DC    X'3F50813F823F3F83843F3F853F86873F'  6
         DC    X'883F3F893F3F4B3F3F3F053F063F3F07'  7
         DC    X'3F407E3F4C3F3F5E7A3F3F6C3F7D7F3F'  8
         DC    X'5C3F3F4D3F5D9E3F3F3F353F363F3F3F'  9
         DC    X'4A3F3F6F3FE2E33F3FE4E53FE63F3FE7'  A
         DC    X'3FE8E93F3F3F3F6B3F3F3F253F263F3F'  B
         DC    X'6D3F3FD13FD2D33F3FD4D53FD63F3FD7'  C
         DC    X'3FD8D93F3F3F3F5A3F3F3F153F16173F'  D
         DC    X'3F4EC13FC23F3FC3C43F3FC53FC6C73F'  E
         DC    X'C83F3FC93F3F4B3F3F3F053F063F3F07'  F
          SPACE 2
.CKRU40  AIF   (NOT &TABS(17)).CKSD30
IECTRU40 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93FF07B3F3F3F353F363F3F37'  1
         DC    X'7C3F3F613FE2E33F3FE4E53FE63F3FE7'  2
         DC    X'3FE8E93F3F3F3F6B3F3F3F253F263F3F'  3
         DC    X'603F3FD13FD2D33F3FD4D53FD63F3FD7'  4
         DC    X'3FD8D93F3F3F3F5B3F3F3F153F16173F'  5
         DC    X'3F50C13FC23F3FC3C43F3FC53FC6C73F'  6
         DC    X'C83F3FC93F3F4B3F3F3F053F063F3F07'  7
         DC    X'3F407E3F4C3F3F5E7A3F3F6C3F7D7F3F'  8
         DC    X'5C3F3F4D3F5D9E3F3F3F353F363F3F3F'  9
         DC    X'4A3F3F6F3FE2E33F3FE4E53FE63F3FE7'  A
         DC    X'3FE8E93F3F3F3F6B3F3F3F253F263F3F'  B
         DC    X'6D3F3FD13FD2D33F3FD4D53FD63F3FD7'  C
         DC    X'3FD8D93F3F3F3F5A3F3F3F153F16173F'  D
         DC    X'3F4EC13FC23F3FC3C43F3FC53FC6C73F'  E
         DC    X'C83F3FC93F3F4B3F3F3F053F063F3F07'  F
          SPACE 2
.CKSD30  AIF   (NOT &TABS(&NR+01)).CKSD50
IECTSD30 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'DF37163D237ADF7F23232323235B2323' 0
         DC    X'23232323235B23DF2323232323232323' 1
         DC    X'23232323233B3D232323232323232323' 2
         DC    X'2323DF232323231F2323232323232323' 3
         DC    X'01232323232323232323237623232323' 4
         DC    X'61232323232323232323235723232323' 5
         DC    X'40232323232323232323233723232323' 6
         DC    X'23232323232323232323231620232323' 7
         DC    X'23626467686B6D6E7073232323232323' 8
         DC    X'23434546494A4C4F5152232323232323' 9
         DC    X'23232526292A2C2F3132232323232323' A
         DC    X'23232323232323232323232323232323' B
         DC    X'23626467686B6D6E7073232323232323' C
         DC    X'23434546494A4C4F5152232323232323' D
         DC    X'23232526292A2C2F3132232323232323' E
         DC    X'15020407080B0D0E1013232323232323' F
.CKSD50  AIF   (NOT &TABS(&NR+02)).CKSD60
IECTSD50 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'5E88163D797A7C7F88888888885B3858' 0
         DC    X'88888888585B5D5E8888888888888888' 1
         DC    X'88888888383B3D3E8888888888888888' 2
         DC    X'88885E88191A1C1F8888888888888888' 3
         DC    X'01888888888888888888A0768493E1B7' 4
         DC    X'61888888888888888888D757909587F6' 5
         DC    X'4023888888888888888888378BC08EA3' 6
         DC    X'888888888888888888888816208D8296' 7
         DC    X'88626467686B6D6E7073888888888888' 8
         DC    X'88434546494A4C4F5152888888888888' 9
         DC    X'88882526292A2C2F3132888888888888' A
         DC    X'88888888888888888888888888888888' B
         DC    X'75E2E4E7E8EBEDEEF0F3888888888888' C
         DC    X'54C3C5C6C9CACCCFD1D2888888888888' D
         DC    X'3488A5A6A9AAACAFB1B2888888888888' E
         DC    X'15020407080B0D0E1013888888888888' F
.CKSD60  AIF   (NOT &TABS(&NR+03)).CKSD40
IECTSD60 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'5E23163D797A5E7F23232323235B2323' 0
         DC    X'23232323585B235E2323232323232323' 1
         DC    X'23232323233B3D232323232323232323' 2
         DC    X'23235E232323231F2323232323232323' 3
         DC    X'01232323232323232323237623232323' 4
         DC    X'61232323232323232323235723232323' 5
         DC    X'40232323232323232323233723232323' 6
         DC    X'23232323232323232323231620232323' 7
         DC    X'23626467686B6D6E7073232323232323' 8
         DC    X'23434546494A4C4F5152232323232323' 9
         DC    X'23232526292A2C2F3132232323232323' A
         DC    X'23232323232323232323232323232323' B
         DC    X'75626467686B6D6E7073232323232323' C
         DC    X'54434546494A4C4F5152232323232323' D
         DC    X'23232526292A2C2F3132232323232323' E
         DC    X'15020407080B0D0E1013232323232323' F
.CKSD40  AIF   (NOT &TABS(&NR+04)).CKSASA
IECTSD40 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'5E37163D887A7C7F88888888885B8888' 0
         DC    X'88888888885B5D5E8888888888888888' 1
         DC    X'88888888883B3D888888888888888888' 2
         DC    X'88885E8888881C1F8888888888888888' 3
         DC    X'01888888888888888888A0768493E1B7' 4
         DC    X'61888888888888888888D757909587F6' 5
         DC    X'4023888888888888888888378BC08EA3' 6
         DC    X'888888888888888888888816208D8296' 7
         DC    X'88626467686B6D6E7073888888888888' 8
         DC    X'88434546494A4C4F5152888888888888' 9
         DC    X'88882526292A2C2F3132888888888888' A
         DC    X'88888888888888888888888888888888' B
         DC    X'88E2E4E7E8EBEDEEF0F3888888888888' C
         DC    X'88C3C5C6C9CACCCFD1D2888888888888' D
         DC    X'8888A5A6A9AAACAFB1B2888888888888' E
         DC    X'15020407080B0D0E1013888888888888' F
.CKSASA  AIF   (NOT &TABS(&NR+05)).CKSSCI
IECTSASA EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'000102031A091A7F1A1A1A0B0C0D0E0F' 0
         DC    X'101112131A0A080018191A1A1C1D1E1F' 1
         DC    X'1A1A1A1A1A0A171B1A1A1A1A1A050607' 2
         DC    X'1A1A161A1A1A1A041A1A1A1A14151A1A' 3
         DC    X'201A1A1A1A1A1A1A1A1A5B2E3C282B21' 4           @ZA11040
         DC    X'261A1A1A1A1A1A1A1A1A5D242A293B5E' 5             A29569
         DC    X'2D2F1A1A1A1A1A1A1A1A7C2C255F3E3F' 6             A29569
         DC    X'1A1A1A1A1A1A1A1A1A603A2340273D22' 7             A29569
         DC    X'1A6162636465666768691A1A1A1A1A1A' 8           @ZA11040
         DC    X'1A6A6B6C6D6E6F7071721A1A1A1A1A1A' 9           @ZA11040
         DC    X'1A7E737475767778797A1A1A1A1A1A1A' A           @ZA11040
         DC    X'1A1A1A1A1A1A1A1A1A1A1A1A1A1A1A1A' B           @ZA11040
         DC    X'7B4142434445464748491A1A1A1A1A5C' C             A29569
         DC    X'7D4A4B4C4D4E4F5051521A1A1A1A1A1A' D             A29569
         DC    X'5C1A535455565758595A1A1A1A1A1A1A' E           @ZA11040
         DC    X'303132333435363738391A1A1A1A1A1A' F
.CKSSCI  AIF   (NOT &TABS(&NR+06)).CKSCT1
IECTSSCI EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'5A5A02035A5A5A5A5A5ABD5A5A0A5A5A' 0               3899
         DC    X'5A5A5A5A5A0A5A5A5A5A425A5A5A5A5A' 1
         DC    X'5A5A5A5A5A5A035A5A5A5A5A5A5A065A' 2
         DC    X'5A5A5A5A5A5A5A045A5A5A5A5A155A5A' 3
         DC    X'405A5A5A5A5A5A5A5A5A5A4E5C484BFE' 4
         DC    X'465A5A5A5A5A5A5A5A5A5A444A495BFC' 5
         DC    X'4D4F5A5A5A5A5A5A5A5A414C45BF5E5F' 6
         DC    X'5A5A5A5A5A5A5A5A5A5A5A43E0475D5A' 7
         DC    X'5AA1A2A3A4A5A6A7A8A95A5A5A5A5A5A' 8
         DC    X'5AAAABACADAEAFB0B1B25A5A5A5A5A5A' 9
         DC    X'5A5AB3B4B5B6B7B8B9BA5A5A5A5A5A5A' A
         DC    X'5A5A5A5A5A5A5A5A5A5A5A5A5A5A5A5A' B
         DC    X'5AA1A2A3A4A5A6A7A8A95A5A5A5A5A5A' C
         DC    X'5AAAABACADAEAFB0B1B25A5A5A5A5A5A' D
         DC    X'5A5AB3B4B5B6B7B8B9BA5A5A5A5A5A5A' E
         DC    X'505152535455565758595A5A5A5A5A5A' F
.CKSCT1  AIF   (NOT &TABS(&NR+07)).CKSCT2
IECTSCT1 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'1F37370237371F1F3737373737023737' 0
         DC    X'373737373708371F3737373737373737' 1               000E
         DC    X'3737373737080237373737373737373A' 2               000E
         DC    X'37371F3737371B253737373737373737' 3
         DC    X'043737373737373737373727373E3737' 4
         DC    X'2B373737373737373737363237292F37' 5
         DC    X'38373737373737373737372637373733' 6
         DC    X'373737373737373737372E0237343731' 7
         DC    X'3718130E1210160B050C373737373737' 8
         DC    X'371A1E090706030D1D0A373737373737' 9
         DC    X'373714011C0F19171511373737373737' A
         DC    X'37373737373737373737373737373737' B
         DC    X'3718130E1210160B050C373737373737' C
         DC    X'371A1E090706030D1D0A373737373737' D
         DC    X'373714011C0F19171511373737373737' E
         DC    X'2D3D39302A21353C2C23373737373737' F
.CKSCT2  AIF   (NOT &TABS(&NR+08)).CKSD80
IECTSCT2 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'FF5C5CB128905CFF5C5C5CD130B171F0' 0
         DC    X'5C885C5C5C505CFF5C5C5C5C5C5C5C5C' 1               000E
         DC    X'5C5C5C5C5C50B15C5C5C5C5C5CA05CE1' 2               000E
         DC    X'5C5CFF5C485C5C215C5C5C5CC95C5C5C' 3
         DC    X'055C5C5C5C5C5C5C5CBB5C743C14D47B' 4
         DC    X'655C5C5C5C5C5C5C5C5C84245595DD5C' 5
         DC    X'B4F55C5C5C5C5C5C5C5C5C35A5FA7DFC' 6
         DC    X'5C5C5C5C5C5C5C5C5CDB5CC503E4BD44' 7
         DC    X'5C8242C322A363E212935C5C5C5C5C5C' 8
         DC    X'5C53D233B272F30A8B4B5C5C5C5C5C5C' 9
         DC    X'5C5CCA2BAA6AEB1B9A5A5C5C5C5C5C5C' A
         DC    X'5C5C5C5C5C5C5C5C5C5C5C5C5C5C5C5C' B
         DC    X'5C8242C322A363E212935C5C5C5C5C5C' C
         DC    X'5C53D233B272F30A8B4B5C5C5C5C5C5C' D
         DC    X'5C3ACA2BAA6AEB1B9A5A5C5C5C5C5C5C' E
         DC    X'0C8D4DCC2DAC6CED1D9C5C5C5C5C5C5C' F
.CKSD80  AIF   (NOT &TABS(&NR+09)).CKSCTW
IECTSD80 EQU   *    EBCDIC TO TRANSCODE
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F000A2E0E2F0E3F0E0E0E0E0E0E0E0E'  0
         DC    X'1F0E0E0E0E0E3F0E0E3E0E0E0E0E0E1D'  1
         DC    X'0E0E0E0E0E0E0F2A0E0E0E0E0E2D0E0D'  2
         DC    X'0E0E3A0E0E0E0E1E0E0E0E0E0E3D0E0E'  3
         DC    X'1A0E0E0E0E0E0E0E0E0E0E0B0C0E0E0E'  4
         DC    X'100E0E0E0E0E0E0E0E0E0E1B1C0E0E0E'  5
         DC    X'20210E0E0E0E0E0E0E0E0E2B2C0E0E0E'  6
         DC    X'0E0E0E0E0E0E0E0E0E0E0E3B3C0E0E0E'  7
         DC    X'0E0102030405060708090E0E0E0E0E0E'  8
         DC    X'0E1112131415161718190E0E0E0E0E0E'  9
         DC    X'0E0E22232425262728290E0E0E0E0E0E'  A
         DC    X'0E0E0E0E0E0E0E0E0E0E0E0E0E0E0E0E'  B
         DC    X'0E0102030405060708090E0E0E0E0E0E'  C
         DC    X'0E1112131415161718190E0E0E0E0E0E'  D
         DC    X'0E0E22232425262728290E0E0E0E0E0E'  E
         DC    X'303132333435363738390E0E0E0E0E0E'  F
.CKSCTW  AIF   (NOT &TABS(&NR+10)).CKSCT3
IECTSCTW EQU   *  EBCDIC TO ITA2 CODE                              000G
         SPACE 1                                                   000G
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                  000G
         DC    X'1F37370237371F1F3737373737023737' 0               000G
         DC    X'373737373702371F3737373737373737' 1               000G
         DC    X'373737373708083737373A3737373737' 2               000G
         DC    X'37371F3737373B083737373737373737' 3               000G
         DC    X'043737373737373737373727373E3137' 4               000G
         DC    X'37373737373737373737373737293737' 5               000G
         DC    X'38373737373737373737372637373733' 6               000G
         DC    X'373737373737373737372E3737342F37' 7               000G
         DC    X'3718130E1210160B050C373737373737' 8               000G
         DC    X'371A1E090706030D1D0A373737373737' 9               000G
         DC    X'373714011C0F19171511373737373737' A               000G
         DC    X'37373737373737373737373737373737' B               000G
         DC    X'3718130E1210160B050C373737373737' C               000G
         DC    X'371A1E090706030D1D0A373737373737' D               000G
         DC    X'373714011C0F19171511373737373737' E               000G
         DC    X'2D3D39302A21353C2C23373737373737' F               000G
         SPACE 2                                                   000G
.CKSCT3  AIF   (NOT &TABS(&NR+11)).CKSD41
IECTSCT3 EQU   *  EBCDIC TO ZSC3 CODE                              000G
         SPACE 1                                                   000G
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                  000G
         DC    X'1F2A2A022A2A1F1F2A2A2A2A2A022A2A' 0               000G
         DC    X'2A2A2A2A2A022A1F2A2A2A2A2A2A2A2A' 1               000G
         DC    X'2A2A2A2A2A08082A2A2A2C2A2A2A2A2A' 2               000G
         DC    X'2A2A1F2A2A2A3B082A2A2A2A2A2A2A2A' 3               000G
         DC    X'042A2A2A2A2A2A2A2A2A2A212A3E382A' 4               000G
         DC    X'2A2A2A2A2A2A2A2A2A2A2A2A2A292A2A' 5               000G
         DC    X'302A2A2A2A2A2A2A2A2A2A262A2A2A25' 6               000G
         DC    X'2A2A2A2A2A2A2A2A2A2A232A2A342F2A' 7               000G
         DC    X'2A18130E1210160B050C2A2A2A2A2A2A' 8               000G
         DC    X'2A1A1E090706030D1D0A2A2A2A2A2A2A' 9               000G
         DC    X'2A2A14011C0F191715112A2A2A2A2A2A' A               000G
         DC    X'2A2A2A2A2A2A2A2A2A2A2A2A2A2A2A2A' B               000G
         DC    X'2A18130E1210160B050C2A2A2A2A2A2A' C               000G
         DC    X'2A1A1E090706030D1D0A2A2A2A2A2A2A' D               000G
         DC    X'2A2A14011C0F191715112A2A2A2A2A2A' E               000G
         DC    X'2B3C3A39363533272E2D2A2A2A2A2A2A' F               000G
          SPACE 2
.CKSD41  AIF   (NOT &TABS(&NR+12)).CKSB40
IECTSD41 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'5EEB163D797A7C7FEBEBEBEBEB5BEBEB'  0
         DC    X'EBEBEBEB585B5D5EEBEBEBEBEBEBEBEB'  1
         DC    X'EBEBEBEB383B3D3EEBEBEBEBEBEBEBEB'  2
         DC    X'EBEBEBEB191A1C1FEBEBEBEBEBEBEBEB'  3
         DC    X'01EBEBEBEBEBEBEBEBEB8D45EB96E4EB'  4
         DC    X'8BEBEBEBEBEBEBEBEBEB40908E936BEB'  5
         DC    X'7670EBEBEBEBEBEBEBEBEBEE88F6EBF0'  6
         DC    X'EBEBEBEBEBEBEBEBEBEBEB87844964C9'  7
         DC    X'EB4F372F2A296762324CEBEBEBEBEBEB'  8
         DC    X'EB612C31432551686D4AEBEBEBEBEBEB'  9
         DC    X'EBEB5220264657237315EBEBEBEBEBEB'  A
         DC    X'EBEBEBEBEBEBEBEBEBEBEBEBEBEBEBEB'  B
         DC    X'EBCFB7AFAAA9E7E2B2CCEBEBEBEBEBEB'  C
         DC    X'EBE1ACB1C3A5D1E8EDCAEBEBEBEBEBEB'  D
         DC    X'EBEBD2A0A6C6D7A3F395EBEBEBEBEBEB'  E
         DC    X'1302040710080D0B0E16EBEBEBEBEBEB'  F
          SPACE 2
.CKSB40  AIF   (NOT &TABS(&NR+13)).END
IECTSB40 EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'5E37163D887A7C7F88888888885B8888' 0
         DC    X'88888888885B5D5E8888888888888888' 1
         DC    X'88888888883B3D888888888888888888' 2
         DC    X'88885E8888881C1F8888888888888888' 3
         DC    X'01888888888888888888A0768493E1B7' 4
         DC    X'61888888888888888888D757909587F6' 5
         DC    X'4023888888888888888888378BC08EA3'  6
         DC    X'888888888888888888888816208D828E' 7
         DC    X'88626467686B6D6E7073888888888888' 8
         DC    X'88434546494A4C4F5152888888889688'  9
         DC    X'88882526292A2C2F3132888888888888' A
         DC    X'88888888888888888888888888888888' B
         DC    X'88E2E4E7E8EBEDEEF0F3888888888888' C
         DC    X'88C3C5C6C9CACCCFD1D2888888888888' D
         DC    X'8888A5A6A9AAACAFB1B2888888888888' E
         DC    X'15020407080B0D0E1013888888888888' F
         SPACE 2                                                   000G
.END     ANOP                                                      000G
         MEND

