.* MVS 3.8J PUBLIC DOMAIN
         MACRO
&NAME    GMVA  &ADDR,&GROUP,&BADDR=0    MOVE IMMEDIATE ADDRESS 2AEB
&NAME    IHBGAM1 10987,&ADDR,&GROUP
        IHBGAM1 ,&BADDR(1),&BADDR(2)
         MEND

