.* MVS 3.8J PUBLIC DOMAIN
         MACRO
&NAME    GMVD  &ADDR,&GROUP,&BDATA=0    MOVE IMMEDIATE DATA 2AEC
         GBLA  &IHBBLC,&IHBBLIM
&IHBBLC  SETA  &IHBBLC+2
&NAME    IHBGAM1 10988,&ADDR,&GROUP
         DC    XL2'&BDATA'
         MEND

