.* MVS 3.8J PUBLIC DOMAIN
         MACRO
&NAME    GSXY  &ADDR,&GROUP        STORE X-Y POSITION REGISTERS 2AEA
&NAME    IHBGAM1 10986,&ADDR,&GROUP
         MEND

