.* MVS 3.8J PUBLIC DOMAIN
         MACRO
&NAME    GTDD  &ADDR,&GROUP        TRANSFER ON DEFERRED DETECT 2AFC
&NAME    IHBGAM1 11004,&ADDR,&GROUP
         MEND

