.* MVS 3.8J PUBLIC DOMAIN
         MACRO
&NAME    IHBGAM2 &CODE
         GBLA  &IHBBLC,&IHBBLIM,&IHBSMSW
         IHBGAM3
&IHBBLC    SETA  &IHBBLC+2              UPDATE BUFFER-LOC COUNTER
&NAME    DC    H'&CODE'
         AIF   (&IHBBLIM GE &IHBBLC).OK
         IHBERMAC 182
.OK      MEND

