.* MVS 3.8J PUBLIC DOMAIN
         MACRO
&NAME    LCI   &C,&I                    MOVE IMMED.DATA TO COUNTER
         LCLA  &CT,&V
&V       SETA  &I
         AIF   (&V LE 65535).LC0
         MNOTE 8,'***  IHB421 IMMEDIATE VALUE EXCEEDS ALLOWED MAXIMUM'
.LC0     ANOP
&CT      SETA  16*&C
         AIF   ('&C' LE '15').LC1
         MNOTE 8,'***  IHB416  COUNTER VALUE MUST BE 0-15'
&CT      SETA  0
.LC1     ANOP
&NAME    DC    0H'0',X'AB',AL1(&CT),AL2(&I)
         MEND

