.* MVS 3.8J PUBLIC DOMAIN
         MACRO
&NAME    RENAME &LIST,&DUMMY=
         AIF   (T'&LIST EQ 'O').E1
&NAME    IHBINNRA &LIST                 LOAD REG 1
         SVC   30                       ISSUE RENAME SVC
         MEXIT
.E1      IHBERMAC 34                    LIST ADDR MISSING
         MEND

