         TITLE 'FIXFILE - EDIT SOURCE FILES'
         ACTR  100000
&TOT     SETA  0
.READ_REC ANOP
&TEXT    AREAD DDNAME=SYSUT1
         AIF   (&TEXT EQ '').END_FILE
&TOT     SETA  &TOT+1
         AIF   (&TOT GT 1).SKIP_MVS
         PUNCH '.* MVS 3.8J PUBLIC DOMAIN',DDNAME=SYSUT2
.SKIP_MVS ANOP
         AIF   ('&TEXT'(1,1) NE '*' AND '&TEXT'(1,2) NE '.*').COPY_REC
&IC      SETA  (&TEXT INDEX 'COPYRIGHT')                            
         AIF   (&IC GT 0).DROP_REC
&IC      SETA  (&TEXT INDEX 'LICENSED')                            
         AIF   (&IC GT 0).DROP_REC
&IC      SETA  (&TEXT INDEX 'PROPERTY OF')                            
         AIF   (&IC GT 0).DROP_REC
         AGO   .COPY_REC
.DROP_REC ANOP
&TEXT    SETC  (DOUBLE &TEXT)
         MNOTE 'DROPING &TEXT'
         AGO   .READ_REC
.COPY_REC  ANOP
&TEXT    SETC  '&TEXT'(1,72)
&TEXT    SETC  (DOUBLE &TEXT)
         PUNCH '&TEXT',DDNAME=SYSUT2
         AGO   .READ_REC
.END_FILE ANOP
         MNOTE 'TESTFIX PROCESSED &TOT LINES OK'
TESTFIX1 CSECT
         SR    15,15
         BR    14
         END 
