TESTCVTX CSECT
*********************************************************************
* 03/14/06 RPI 223 ADD IEAQTE00 AND IEAQTD00 REQUIRED AFTER FIX TO
*          CORRECT HANDLING OF &OPTIONS=(X,INTERVAL,Y) TYPE PARMS
*********************************************************************
         SR    15,15
         BR    14
         ENTRY IEAQTE00  RPI 223
         ENTRY IEAQTD00  RPI 223
         ENTRY IEATCBP     
         ENTRY IEA0EF00    
         ENTRY IEFLINK     
         ENTRY IECXAPG     
         ENTRY IEA0VL00    
         ENTRY IECPCNVT    
         ENTRY IECPRLTV    
         ENTRY IECILK1     
         ENTRY IECILK2     
         ENTRY IECXTLER    
         ENTRY IEAVTRT1    
         ENTRY IEEMSER     
         ENTRY IECZDTAB    
         ENTRY IECXITP     
         ENTRY IEASVDCB    
         ENTRY IEATPC      
         ENTRY IEECUCB     
         ENTRY IECSTB      
         ENTRY IFBDCB      
         ENTRY IECIXAVL    
         ENTRY IEA0DS      
         ENTRY IECILCH     
         ENTRY IEA0PT01    
         ENTRY IEFQMWR     
         ENTRY IEAQCDSR    
         ENTRY IEAQLPAQ    
         ENTRY IEABEND     
         ENTRY IEAPATCH    
         ENTRY IGFRVT      
         ENTRY AHLHEAD     
         ENTRY IEAQMSGS    
         ENTRY IEAPTRV     
         ENTRY IEFJESCT    
         ENTRY IEAVTEST    
         ENTRY IEAVVMSR    
         ENTRY CSECPVT     
         ENTRY IGFPSAD0    
         ENTRY IGFPSAE0    
         ENTRY IEEVLDWT    
         ENTRY IEEVEXSN    
         ENTRY IEATRSCN    
         ENTRY IEA0VL01    
         ENTRY IEAPPGMX    
         ENTRY IEAPDSRT    
         ENTRY IFDOLT0A    
         ENTRY IEASMFEX    
         ENTRY IEAVBLDP    
         ENTRY IEAVGTCL    
         ENTRY IEAVFRCL    
         ENTRY IEAVDELP    
         ENTRY CRBRANCH    
         ENTRY IEAVGCAS    
         ENTRY IEAQSPET    
         ENTRY IEAVGFAS    
         ENTRY IGC043BR    
         ENTRY IEAVAR02    
         ENTRY IRARMI00    
         ENTRY IEFAQTOP    
         ENTRY IEAMASCB    
         ENTRY IEAVTSDX    
         ENTRY IEAVTSBP    
         ENTRY IRARMCNS    
         ENTRY IEAVEXPR    
         ENTRY IEAGSMQ     
         ENTRY IEALSMQ     
         ENTRY IEAGSPL     
         ENTRY IEAVWAIT    
         ENTRY IEAPPGMA    
         ENTRY IEAQCS01    
         ENTRY IEAVENQ2    
         ENTRY IEAVELRM    
         ENTRY IEADQIQE    
         ENTRY IEARPOST    
         ENTRY IGC062R1    
         ENTRY IEAVEAC0    
         ENTRY GLBRANCH    
         ENTRY IEAVGWSA    
         ENTRY IEAVWSAL    
         ENTRY IEAVWSAG    
         ENTRY IEAVWSAC    
         ENTRY IEAVTRER    
         ENTRY ASMVT       
         ENTRY IDA121CV    
         ENTRY IEASPOST    
         ENTRY IEWMSEPT    
         ENTRY IGC044R2    
         ENTRY IEAVEDR     
         ENTRY IEAVERI     
         ENTRY IEAVERP     
         ENTRY IEAVPSIB    
         ENTRY IEAVAMSI    
         ENTRY IEAVFP1     
         ENTRY IEAVPIOP    
         ENTRY RMBRANCH    
         ENTRY FMBRANCH    
         ENTRY GMBRANCH    
         ENTRY IEAVESPR    
         ENTRY IEAVEMS0    
         ENTRY IEA0PT02    
         ENTRY IEESTPRS    
         ENTRY IEAWTCB     
         ENTRY AHLVCCR8    
         ENTRY IEEVSTOP    
         ENTRY IEAVEXP1    
         ENTRY IGC07903    
         ENTRY IEAVEQV1    
         ENTRY IEAVEQV2    
         ENTRY IEAVEQV3    
         ENTRY IEAVEADV    
         ENTRY IGC124      
         ENTRY IEAVEVT0    
         ENTRY CBBRANCH    
         ENTRY IEAVCKEY    
         ENTRY IEA0PT0E    
         ENTRY IEA0PT03    
         ENTRY ILRTERMR    
         ENTRY ILRJTERM    
         ENTRY IEAVRSME    
         ENTRY IEAVTCTL    
         ENTRY IEAVET6E    
         ENTRY IEAVSPND    
         ENTRY IEAIHASU    
         ENTRY IEEVDCCR    
         ENTRY IQADSV00    
         ENTRY IFGDEBVR    
IEAQTE00    DS A  RPI 223
IEAQTD00    DS A  RPI 223
IEATCBP     DS A
IEA0EF00    DS A
IEFLINK     DS A
IECXAPG     DS A
IEA0VL00    DS A
IECPCNVT    DS A
IECPRLTV    DS A
IECILK1     DS A
IECILK2     DS A
IECXTLER    DS A
IEAVTRT1    DS A
IEEMSER     DS A
IECZDTAB    DS A
IECXITP     DS A
IEASVDCB    DS A
IEATPC      DS A
IEECUCB     DS A
IECSTB      DS A
IFBDCB      DS A
IECIXAVL    DS A
IEA0DS      DS A
IECILCH     DS A
IEA0PT01    DS A
IEFQMWR     DS A
IEAQCDSR    DS A
IEAQLPAQ    DS A
IEABEND     DS A
IEAPATCH    DS A
IGFRVT      DS A
AHLHEAD     DS A
IEAQMSGS    DS A
IEAPTRV     DS A
IEFJESCT    DS A
IEAVTEST    DS A
IEAVVMSR    DS A
CSECPVT     DS A
IGFPSAD0    DS A
IGFPSAE0    DS A
IEEVLDWT    DS A
IEEVEXSN    DS A
IEATRSCN    DS A
IEA0VL01    DS A
IEAPPGMX    DS A
IEAPDSRT    DS A
IFDOLT0A    DS A
IEASMFEX    DS A
IEAVBLDP    DS A
IEAVGTCL    DS A
IEAVFRCL    DS A
IEAVDELP    DS A
CRBRANCH    DS A
IEAVGCAS    DS A
IEAQSPET    DS A
IEAVGFAS    DS A
IGC043BR    DS A
IEAVAR02    DS A
IRARMI00    DS A
IEFAQTOP    DS A
IEAMASCB    DS A
IEAVTSDX    DS A
IEAVTSBP    DS A
IRARMCNS    DS A
IEAVEXPR    DS A
IEAGSMQ     DS A
IEALSMQ     DS A
IEAGSPL     DS A
IEAVWAIT    DS A
IEAPPGMA    DS A
IEAQCS01    DS A
IEAVENQ2    DS A
IEAVELRM    DS A
IEADQIQE    DS A
IEARPOST    DS A
IGC062R1    DS A
IEAVEAC0    DS A
GLBRANCH    DS A
IEAVGWSA    DS A
IEAVWSAL    DS A
IEAVWSAG    DS A
IEAVWSAC    DS A
IEAVTRER    DS A
ASMVT       DS A
IDA121CV    DS A
IEASPOST    DS A
IEWMSEPT    DS A
IGC044R2    DS A
IEAVEDR     DS A
IEAVERI     DS A
IEAVERP     DS A
IEAVPSIB    DS A
IEAVAMSI    DS A
IEAVFP1     DS A
IEAVPIOP    DS A
RMBRANCH    DS A
FMBRANCH    DS A
GMBRANCH    DS A
IEAVESPR    DS A
IEAVEMS0    DS A
IEA0PT02    DS A
IEESTPRS    DS A
IEAWTCB     DS A
AHLVCCR8    DS A
IEEVSTOP    DS A
IEAVEXP1    DS A
IGC07903    DS A
IEAVEQV1    DS A
IEAVEQV2    DS A
IEAVEQV3    DS A
IEAVEADV    DS A
IGC124      DS A
IEAVEVT0    DS A
CBBRANCH    DS A
IEAVCKEY    DS A
IEA0PT0E    DS A
IEA0PT03    DS A
ILRTERMR    DS A
ILRJTERM    DS A
IEAVRSME    DS A
IEAVTCTL    DS A
IEAVET6E    DS A
IEAVSPND    DS A
IEAIHASU    DS A
IEEVDCCR    DS A
IQADSV00    DS A
IFGDEBVR    DS A
         END
