       MACRO
       TESTOPT
&TOTSIZE SETA   5
&RESID   SETA  (&TOTSIZE-(&TOTSIZE/4)*4)	   
&RESID SETA  4-&RESID
       MNOTE 8,'TESTOPT RESID=&RESID'
       MEND