TEST  CSECT
      USING *,15
* convert from packed
VNOT_P_E76B VNOT V1,V2
         BR    14
F0       EQU   0
V1 EQU 21
V2 EQU 2
         LTORG
         END