TEST  CSECT
      USING *,15
* CC6 BRCTH
         LFH    R1,=F'3'
         SR     R1,R1
CC6_LOOP EQU    *
         LA     R1,1(R1)
         BRCTH  R1,CC6_LOOP
         CH     R1,=H'3'
         BNE    ABORT
         BR     R14
ABORT    ABEND  111,DUMP
         EQUREGS
         LTORG
         END