*******************************************************
* 2020-12-20 DSH TEST ACALL PARM SUPPORT
*******************************************************
       MACRO
       TSTACALL
       ACALL SUB1(A)
       ACALL SUB2(F1,F2)
       AENTRY SUB1
&N     SETA N'&SUB1
       MNOTE 'TSTACALL SUB1 N=&N P1=&SUB1(1)'
       AEND
       AENTRY SUB2
&N     SETA N'&SUB2
       MNOTE 'TSTACALL SUB2 N=&N P1=&SUB2(1) P2=&SUB2(2)'
       AEND
       MEND
       TSTACALL
       END