       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMOCMGR.
       COPY SOACMGR1.
       77  SOA-HOST-NAME PIC X(24) VALUE z'DSH3'.
       77  SOA-HOST-PORT PIC S9(9) COMP VALUE 3900.
       COPY SOACMGR2.
       LINKAGE SECTION.
       01  SOA-MSG.
           05  SOA-MSG-PFX.
               10  SOA-MSG-LEN  PIC S9(8) COMP.
               10  SOA-MSG-TIME PIC S9(18) COMP.
               10  SOA-MSG-SVC-NAME PIC X(8).
               10  SOA-MSG-SVC-RC   PIC S9(8) COMP.
           05  SOA-MSG-PARMS        PIC X(135).
       COPY SOACMGR3.
