       data division.
       working-storage section.
       77  FIRST-CALL       PIC X VALUE 'T'.
       77  micro-start      pic 9(18) comp.
       77  micro-end        pic 9(18) comp.
       77  micro-sec        pic 9(18) comp.
