       data division.
       working-storage section.
       77  FIRST-CALL  PIC X VALUE 'T'.
      ***************************************************************
      * SOACMGR1.CPY - from ID to WORKING-STORAGE                   
      ***************************************************************
