      ****************************************************************
      * SOASTUB1.CPY from ID to WORKING-STORAGE.                        
      ****************************************************************
       DATA DIVISION.
       WORKING-STORAGE SECTION.
