* open source z390 regression test of opcodes
* 2019/11/07 dsh TESTINS6.MAC macros for TESTINS6.MLC
* 2020/01/03 DSH USE TEST_OP TO CALL TYPE_??? TO GEN TESTS
* 2020/01/23 DSH SUPRESS OP GEN IF UNDEFINED
*************************************************************
* COPYRIGHT 2019 DON HIGGINS
************************************************************
        GBLA &TOT_OPS,&TOT_MASK,&TOT_DUP,&TOT_UND
        gbla &TOT_PROB,&TOT_SUPR
        GBLC &LAB_OP,&OP_LAB
        MACRO
&LAB    TEST_OP &TYPE,&OP,&P1,&P2,&P3,&P4,&P5,&P6,&P7,&P8
        GBLA &TOT_OPS,&TOT_DUP,&TOT_UND
        GBLA &TOT_PROB,&TOT_SUPR
        GBLC &LAB_OP,&OP_LAB,&LAST_OP
        AIF  ('&LAB'(1,1) EQ 'P')
&TOT_PROB SETA &TOT_PROB+1
        AEND
        AIF  ('&LAB'(1,1) EQ 'S')
&TOT_SUPR SETA &TOT_SUPR+1
        AEND
&NP     SETC  ''
&I      SETA  3
        AWHILE (&I LE N'&SYSLIST)
&NP       SETC '&NP.,&SYSLIST(&I)'
&I        SETA &I+1
        AEND
&OP_LAB SETC    '&OP._&LAB'
&LAB_OP SETC    '&LAB._&OP'
&TOT_OPS SETA &TOT_OPS+1
      BALR R10,0
      USING *,R10
      B   OP&TOT_OPS+32  
OP&TOT_OPS DC  0XL16,32X'FF'
      ORG *-32 
&TESTOP SETC '&OP'
      AIF (T'&OP EQ 'I')
&LAB    TYPE_&TYPE &OP&NP
      AELSEIF ('&OP' EQ '&LAST_OP')
&TOT_DUP SETA &TOT_DUP+1
      AELSE
&TOT_UND SETA &TOT_UND+1
        MNOTE 12,'UNDEFINED OP &OP  &LAB &TOT_UND'
      AEND
&LAST_OP SETC '&OP'
LOPEND&TOT_OPS EQU *
           ORG OP&TOT_OPs+32
        CLC OP&TOT_OPS.(16),OP&TOT_OPS+16
        BE     *+10
        L      R15,ASNAP
        BALR   R14,R15
        MEND 
	MACRO 
&LAB	TYPE_DM	&OP,&P1
        GBLC &LAB_OP,&OP_LAB
      AIF (N'&SYSLIST EQ 1)		
&OP_LAB     &OP
&HEX	SETC	'&LAB_OP'(3,2)
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',X'000000'
      AELSE
        MNOTE 12,'DM INVALID OPERAND COUNT &LAB_OP'
      AEND    
        MEND
	MACRO
&LAB	TYPE_E	&OP
        GBLC &LAB_OP,&OP_LAB
      AIF (N'&SYSLIST EQ 1)		
&OP_LAB   &OP 
&HEX	SETC	'&LAB'(3,4)
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX'
      AELSE
&NP     SETA  N'&SYSLIST
        MNOTE 12,'E INVALID OPERAND COUNT &LAB_OP &NP'
      AEND        
        MEND
	MACRO
&LAB	TYPE_I	&OP,&P1
        GBLC &LAB_OP,&OP_LAB
      AIF (N'&SYSLIST EQ 2) 	
&OP_LAB   &OP	&P1
&HEX	SETC	'&LAB'(3,2)
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1)
      AELSE
        MNOTE 12,'I INVALID OPERAND COUNT &LAB_OP  '
      AEND        
        MEND
	MACRO
&LAB	TYPE_IE	&OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB
      AIF (N'&SYSLIST EQ 3) NIAI	
&OP_LAB   &OP &P1,&P2
&HEX	SETC	'&LAB'(3,4)
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX.00',AL1(&P1*16+&P2)
      AELSE
        MNOTE 12,'IE INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
        MACRO
&LAB	TYPE_MII &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB 	
&HEX	SETC	'&LAB'(3,2)
      AIF (N'&SYSLIST EQ 4)  BPRP
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL2(&P1*16*16*16+&P2),AL3(&P3)
      AELSE
        MNOTE 12,'MII INVALID OPERAND COUNT &LAB_OP  '
      AEND    
        MEND 
	MACRO
&LAB	TYPE_R	&OP,&P1
        GBLC &LAB_OP,&OP_LAB
      AIF (N'&SYSLIST EQ 2)	
&OP_LAB     &OP     &P1
&HEX	SETC	'&LAB'(3,2)
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16)
      AELSE
        MNOTE 12,'R INVALID OPERAND COUNT &LAB_OP  '
      AEND        
        MEND
	MACRO
&LAB	TYPE_RI	&OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB 
&HEX	SETC	'&LAB_OP'(3,2)
&HEX2   SETC    '&LAB_OP'(5,1)
      AIF (N'&SYSLIST EQ 3 AND '&HEX2' EQ '_')
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+0),AL2(&P2)
      AELSE
&HEX2A  SETA    X2A('&HEX2')
&HEX3   SETC    '&LAB_OP'(6,1)
        AIF (N'&SYSLIST EQ 3 AND '&HEX3' EQ '_')
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&HEX2A),AL2(&P2)
        AELSEIF (N'&SYSLIST EQ 2 AND '&HEX3' NE '_')
        GBLA    &TOT_MASK
&TOT_MASK SETA &TOT_MASK+1
&HEX3A  SETA    X2A('&HEX3')
&OP_LAB     &OP     &P1
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&HEX3A*16+&HEX2A),AL2(&P1)
        AELSE
          MNOTE 12,'RI INVALID OPERAND COUNT &LAB_OP  '
        AEND    
      AEND             
        MEND
	MACRO
&LAB	TYPE_RIE &OP,&P1,&P2,&P3,&P4,&P5,&I345=
        GBLC &LAB_OP,&OP_LAB 	
&HEX	SETC	'&LAB_OP'(3,2)
&HEX2   SETC    '&LAB_OP'(5,2)
      AIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
        AIF (N'&I345 EQ 3) 
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL1&I345,X'&HEX2'
        AELSEIF ('&LAB_OP'(7,1) NE '_') 
        GBLA    &TOT_MASK
&TOT_MASK SETA &TOT_MASK+1
&M3       SETC '&LAB_OP'(7,1)
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+0),AL2(&P2),X'&M3.0&HEX2' 
        AELSE
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+0),AL2(&P2),X'&P3.0&HEX2'
        AEND
      AELSEIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
&M3      SETC   '&LAB_OP'(7,1)
        AIF ('&M3' NE '_') 
        GBLA    &TOT_MASK
&TOT_MASK SETA &TOT_MASK+1
&M3A     SETA X2A('&M3')
         AIF ('&LAB_OP'(3,4) EQ 'EC76')
&LAB_OP ORG &OP_LAB+16
         DC  X'&HEX',AL1(&P1*16+&P2),AL2(&P3),X'&M3.0&HEX2'
         AELSEIF ('&LAB_OP'(3,4) EQ 'EC77')
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL2(&P3),X'&M3.0&HEX2'
         AELSEIF ('&LAB_OP'(3,3) EQ 'EC7')
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&M3A),AL2(&P3),AL1(&P2),X'&HEX2'
         AELSE
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL2(&P3),X'&M3.0&HEX2'
         AEND
        AELSEIF ('&LAB_OP'(3,3) EQ 'EC7')
&LAB_OP ORG &OP_LAB+16
  DC  X'&HEX',AL1(&P1*16+0),AL2(&P2),AL1(&P3*16+0),X'&HEX2'
        AELSE
&LAB_OP ORG &OP_LAB+16
  DC  X'&HEX',AL1(&P1*16+&P2),AL2(&P3),X'00&HEX2'
        AEND
      AELSEIF (N'&SYSLIST EQ 5)  RI?/RN?/RO? WITH 4 PARMS
&OP_LAB   &OP     &P1,&P2,&P3,&P4    
&LASTOPC SETC '&OP'(K'&OP,1)
        AIF ('&LAB_OP'(3,3) EQ 'EC6') EC64,EC65,EC67
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL2(&P4),AL1(&P3*16+0),X'&HEX2'
        AELSEIF ('&LAB_OP'(3,4) EQ 'EC76')
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL2(&P4),AL1(&P3*16+0),X'&HEX2'
        AELSEIF ('&LAB_OP'(3,4) EQ 'EC77')
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL2(&P4),AL1(&P3*16+0),X'&HEX2'
        AELSEIF ('&LAB_OP'(3,4) GE 'EC7C') CGIJ ETC.
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P3),AL2(&P4),AL1(&P2),X'&HEX2'
        AELSEIF ('&LAB_OP'(3,3) EQ 'EC7') EC74
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL2(&P4),AL1(&P3*16+0),X'&HEX2'
        AELSEIF ('&LASTOPC' EQ 'Z')
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL1(&P3,&P4+X'80'),X'00&HEX2'
        AELSEIF ('&LASTOPC' EQ 'T')
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL1(&P3+X'80',&P4),X'00&HEX2'
        AELSE 
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL1(&P3,&P4),X'00&HEX2'	
        AEND
      AELSEIF (N'&SYSLIST EQ 6)  RI?/RN?/RO? WITH 5 PARMS
&OP_LAB     &OP     &P1,&P2,&P3,&P4,&P5
&LASTOPC SETC '&OP'(K'&OP,1)
        AIF ('&LASTOPC' EQ 'Z')
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL1(&P3,&P4+X'80',&P5),X'&HEX2'
        AELSEIF ('&LASTOPC' EQ 'T')
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL1(&P3+X'80',&P4,&P5),X'&HEX2'
        AELSE
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2),AL1(&P3,&P4,&P5),X'&HEX2'
        AEND
      AELSE
        MNOTE 12,'RIE INVALID OPERAND COUNT &LAB_OP  '
      AEND               
        MEND
	MACRO
&LAB	TYPE_RIL &OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB_OP'(3,2)
&HEX2   SETC    '&LAB_OP'(5,1)
&HEX3   SETC    '&LAB_OP'(6,1)
      AIF (N'&SYSLIST EQ 3 AND '&HEX3' EQ '_')
&OP_LAB     &OP     &P1,&P2
&HEX2A  SETA    X2A('&HEX2')
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&HEX2A),AL4(&P2)
      AELSEIF (N'&SYSLIST EQ 2 AND '&HEX3' NE '_')
        GBLA    &TOT_MASK
&TOT_MASK SETA &TOT_MASK+1
&HEX2A  SETA    X2A('&HEX2')
&HEX3A  SETA    X2A('&HEX3')
&OP_LAB     &OP     &P1
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&HEX2A*16+&HEX3A),AL4(&P1)
      AELSE
        MNOTE 12,'RIL INVALID OPERAND COUNT &LAB_OP  '   
      AEND              
        MEND
	MACRO
&LAB	TYPE_RIS &OP,&P1,&P2,&P3,&P4
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
&HEX3   SETC    '&LAB_OP'(7,1)
&M3     SETA    X2A('&HEX3')
      AIF (N'&SYSLIST EQ 4 AND '&HEX3' NE '_')
        GBLA    &TOT_MASK
&TOT_MASK SETA &TOT_MASK+1
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&M3),S(&P3),AL1(&P2),X'&HEX2'
      AELSEIF (N'&SYSLIST EQ 5)
&OP_LAB     &OP     &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P3),S(&P4),AL1(&P2),X'&HEX2'
      AELSE
        MNOTE 12,'RIS INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
	MACRO
&LAB	TYPE_RR	&OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
     AIF (N'&SYSLIST EQ 3 AND K'&LAB EQ 4)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16 
 DC      X'&HEX',AL1(&P1*16+&P2)
     AELSEIF (N'&SYSLIST EQ 2 AND K'&LAB EQ 5)
&OP_LAB     &OP     &P1
&ACC    SETA    X2A('&LAB'(5,1))
&LAB_OP ORG &OP_LAB+16 
 DC      X'&HEX',AL1(&ACC*16+&P1)
      AELSE
        MNOTE 12,'RR INVALID OPERAND COUNT &LAB_OP  '
      AEND      
        MEND
	MACRO
&LAB	TYPE_RRD &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,4)
     AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16  
 DC      X'&HEX',AL1(&P1*16+0,&P2*16+&P3)
      AELSE
        MNOTE 12,'RRD INVALID OPERAND COUNT &LAB_OP  '
      AEND   
        MEND 
	MACRO
&LAB	TYPE_RRE &OP,&P1,&P2,&P3,&P4
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,4)
     AIF (N'&SYSLIST EQ 5)
&OP_LAB      &OP     &P1,&P2,&P3,&P4
        AIF     ('&HEX'(3,2) EQ '44')
&LAB_OP ORG &OP_LAB+16  
 DC      X'&HEX',AL1(&P2*16+&P4,&P1*16+&P3)
        AELSE
&LAB_OP ORG &OP_LAB+16  
 DC      X'&HEX',AL1(&P1*16+&P2,&P3*16+&P4)
        AEND
     AELSEIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16 
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
     AELSEIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16 
 DC      X'&HEX',AL1(0,&P1*16+&P2)
     AELSEIF (N'&SYSLIST EQ 2)
&OP_LAB     &OP     &P1
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(0,&P1*16+0)
     AELSEIF (N'&SYSLIST EQ 1)
&OP_LAB     &OP    
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL2(0)
      AELSE
        MNOTE 12,'RRE INVALID OPERAND COUNT &LAB_OP  '
      AEND     
        MEND
	MACRO
&LAB	TYPE_RRF &OP,&P1,&P2,&P3,&P4
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,4)
      AIF (N'&SYSLIST EQ 5) 
&OP_LAB     &OP     &P1,&P2,&P3,&P4
        AIF ('&HEX'(1,2) EQ 'B2')
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)		
        AELSEIF ('&HEX'(1,3) EQ 'B3D') 
          AIF ('&HEX'(4,1) EQ '0') MDTRA
&LAB_OP ORG &OP_LAB+16 
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '1') DDTRA
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '2') ADTRA
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '3') SDTRA
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '8') MXTRA
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '9')
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ 'A') AXTR 
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ 'B') SXTRA
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2) LEDTR 00003412
          AELSE
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P2*16+&P4,&P1*16+&P3) LEDTR 00002413
          AEND
        AELSE
         AIF ('&HEX' EQ 'B9C0') SELFHR R1,R2,R3,M4 00003412
&LAB_OP ORG &OP_LAB+16 
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2) 
         AELSEIF ('&HEX' EQ 'B9E3') SELGR R1,R2,R3,M4 00003412
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)
         AELSEIF ('&HEX' EQ 'B9F0') SELR R1,R2,R3,M4 00003412
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P3*16+&P4,&P1*16+&P2)  
         AELSE
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P2*16+&P4,&P1*16+&P3) LEDBRA R1,M3,R2,M4
         AEND
        AEND
      AELSEIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
        AIF ('&HEX'(1,3) EQ 'B3D') DDTR R1,R2,R3 OOOO3012
          AIF ('&HEX'(4,1) EQ '0') MDTR 		
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '1') DDTR
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '2') ADTR 
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '3') SDTR
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2
          AELSEIF ('&HEX'(4,1) EQ '4') 
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3,&P1*16+&P2) LDETR,LXDTR
          AELSEIF ('&HEX'(4,1) EQ '8') MXTR 
&LAB_OP ORG &OP_LAB+16 
DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ '9') DXTR
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
          AELSEIF ('&HEX'(4,1) EQ 'C') OOOOO312
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3,&P1*16+&P2) LDETR,LXDTR
          AEND 
        AELSEIF ('&HEX'(1,4) EQ 'B221' OR '&HEX'(1,4) EQ 'B2A7')                                 
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)		 
         AELSEIF ('&HEX'(1,4) EQ 'B2E8') PPA
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
          AELSEIF ('&HEX'(1,4) EQ 'B929') KMA
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P2*16+0,&P1*16+&P3)
          AELSEIF ('&HEX'(1,4) EQ 'B960') CGRT
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
          AELSEIF ('&HEX'(1,4) EQ 'B98E') IDTE
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P2*16+0,&P1*16+&P3)
           AELSEIF ('&HEX'(1,4) EQ 'B98F') CRDTE
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P2*16+0,&P1*16+&P3)
        AELSEIF ('&HEX'(1,4) EQ 'B3E3') CSDTR OOOOO312
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3,&P1*16+&P2) 
        AELSEIF ('&HEX'(1,4) EQ 'B3EB') CSXTR OOOOO312
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3,&P1*16+&P2) 
        AELSEIF ('&HEX'(1,2) EQ 'B3') TBEDR R1,M3,R2 OOOO3012
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P2*16+0,&P1*16+&P3) 
      AELSEIF ('&LAB_OP'(7,1) NE '_') SELGR R1,R2,R3 OOOO3M12
        GBLA    &TOT_MASK
&TOT_MASK SETA &TOT_MASK+1
&M3       SETA    X2A('&LAB_OP'(7,1))
&LAB_OP ORG &OP_LAB+16 
 DC      X'&HEX',AL1(&P3*16+&M3,&P1*16+&P2)
        AELSEIF ('&HEX'(1,2) EQ 'B9')
          AIF ('&HEX'(3,2) EQ '2D') KMCTR R1,M3,R2 OOOO3012
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P2*16+0,&P1*16+&P3) 
          AELSE
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2) R1,R2,M3
          AEND
        AEND
      AELSEIF (N'&SYSLIST EQ 3 AND '&LAB_OP'(7,1) NE '_')
&OP_LAB     &OP     &P1,&P2
&HEXCC  SETC    '&LAB'(7,1)
&ACC    SETA    X2A('&HEXCC')
&LAB_OP ORG &OP_LAB+16 
 DC      X'&HEX',AL1(&ACC*16+0,&P1*16+&P2)
      AELSEIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(0,&P1*16+&P2)
      AELSE
        MNOTE 12,'RRF INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
	MACRO
&LAB	TYPE_RRR &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,4)
      AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+0,&P1*16+&P2)
      AELSE
        MNOTE 12,'RRR INVALID OPERAND COUNT &LAB_OP  '
      AEND         
        MEND
	MACRO
&LAB	TYPE_RRS &OP,&P1,&P2,&P3,&P4
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
&HEX3   SETC    '&LAB_OP'(7,1)
      AIF (N'&SYSLIST EQ 4 AND '&HEX3' NE '_')
        GBLA    &TOT_MASK
&TOT_MASK SETA &TOT_MASK+1
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2),S(&P3),X'&HEX3.0&HEX2'
      AELSEIF (N'&SYSLIST EQ 5)
&OP_LAB     &OP     &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16 
 DC X'&HEX',AL1(&P1*16+&P2),S(&P4),AL1(&P3*16+0),X'&HEX2'
      AELSE
        MNOTE 12,'RRS INVALID OPERAND COUNT &LAB_OP  '
      AEND     
        MEND
	MACRO
&LAB	TYPE_RS	&OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
      AIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+0),AL2(B2*256*16+D2)
      AELSEIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P2),AL2(B2*256*16+D2)
      AELSE
        MNOTE 12,'RS INVALID OPERAND COUNT &LAB_OP  '
      AEND      
        MEND
	MACRO
&LAB	TYPE_RSI	&OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
      AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P2),AL2(&P3)
      AELSE
        MNOTE 12,'RSI INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
	MACRO
&LAB	TYPE_RSL &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
      AIF (N'&SYSLIST EQ 4)  CDPT
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16 
 DC      X'&HEX',AL1(L2-1),X'C0C0',AL1(&P1*16+&P3),X'&HEX2'
      AELSEIF (N'&SYSLIST EQ 2) EBC0 TP RSLa
&OP_LAB     &OP     &P1
&LAB_OP ORG &OP_LAB+16 
 DC      X'&HEX',AL1((LP1-1)*16+0),X'B0B0',AL1(DH1),X'&HEX2'
      AELSE
        MNOTE 12,'RSL INVALID OPERAND COUNT &LAB_OP  '
      AEND         
        MEND
	MACRO
&LAB	TYPE_RSY &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
      AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
        AIF ('&HEX2' EQ 'E2')  LOCG R1,D2(B2),M3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P3),S(&P2),AL1(DH2),X'&HEX2'
        AELSEIF ('&HEX2' EQ 'E3')  STOCG
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P3),S(&P2),AL1(DH2),X'&HEX2'
        AELSEIF ('&HEX2' EQ 'F2')  LOCR R1,D2(B2),M3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P3),S(&P2),AL1(DH2),X'&HEX2'
         AELSEIF ('&HEX2' EQ 'E0')  LOCFH R1,D2(B2),M3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P3),S(&P2),AL1(DH2),X'&HEX2'
         AELSEIF ('&HEX2' EQ 'E1')  STOCFH R1,D2(B2),M3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P3),S(&P2),AL1(DH2),X'&HEX2'
        AELSEIF ('&HEX2' EQ 'F3')  STOC R1,D2(B2),M3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P3),S(&P2),AL1(DH2),X'&HEX2'
        AELSE
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+&P2),S(&P3),AL1(DH2),X'&HEX2'
        AEND
      AELSE
        MNOTE 12,'RSY INVALID OPERAND COUNT &LAB_OP  '
      AEND      
        MEND
	MACRO
&LAB	TYPE_RX	&OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
     AIF (N'&SYSLIST EQ 3 AND K'&LAB EQ 4)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+X2),AL2(B2*256*16+D2)
     AELSEIF (N'&SYSLIST EQ 2 AND K'&LAB EQ 5)
&OP_LAB     &OP     &P1
&HEXCC  SETC    '&LAB'(5,1)
&ACC    SETA    X2A('&HEXCC')
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&ACC*16+X2),AL2(B2*256*16+D2)
      AELSE
        MNOTE 12,'RX INVALID OPERAND COUNT &LAB_OP  '
      AEND         
        MEND
	MACRO
&LAB	TYPE_RXE &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
     AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+X2)
 DC AL2(B2*256*16+D2),AL1(&P3*16+0),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 3 AND K'&LAB EQ 6)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+X2)
 DC      AL2(B2*256*16+D2),X'00&HEX2'
      AELSE
        MNOTE 12,'RXE INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
	MACRO
&LAB	TYPE_RXF &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
     AIF (N'&SYSLIST EQ 4 AND K'&LAB EQ 6)
&OP_LAB     &OP     &P1,&P2,&P3
.*34567890123456789012345678901234567890123456789012345678901234567890
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P2*16+X2)
 DC AL2(B2*256*16+D2),AL1(&P1*16+0),X'&HEX2'
      AELSE
        MNOTE 12,'RXF INVALID OPERAND COUNT &LAB_OP  '
      AEND         
        MEND
	MACRO
&LAB	TYPE_RXY &OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
     AIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC   X'&HEX',AL1(&P1*16+X2),AL2(B2*256*16+D2),AL1(DH2),X'&HEX2'
      AELSE
        MNOTE 12,'RXY INVALID OPERAND COUNT &LAB_OP  '
      AEND        
        MEND
	MACRO
&LAB	TYPE_S	&OP,&P1
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,4)
     AIF (N'&SYSLIST EQ 2)
&OP_LAB     &OP     &P1
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL2(B2*256*16+D2)
     AELSEIF (N'&SYSLIST EQ 1)
&OP_LAB     &OP     
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL2(0)
      AELSE
        MNOTE 12,'S INVALID OPERAND COUNT &LAB_OP  '
      AEND      
        MEND
	MACRO
&LAB	TYPE_SI	&OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
      AIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P2),S(&P1)
      AELSEIF (N'&SYSLIST EQ 2)
&OP_LAB     &OP     &P1
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',X'00',S(&P1)
      AELSE
        MNOTE 12,'SI INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
	MACRO
&LAB	TYPE_SIL &OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,4)
      AIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',S(&P1),AL2(&P2)
      AELSE
        MNOTE 12,'SIL INVALID OPERAND COUNT &LAB_OP  '
      AEND        
        MEND
	MACRO
&LAB	TYPE_SIY &OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
      AIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P2),S(&P1),AL1(DH1),X'&HEX2'
      AELSE
        MNOTE 12,'SIY INVALID OPERAND COUNT &LAB_OP  '
      AEND    
        MEND 
        MACRO
&LAB	TYPE_SMI &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB	
&HEX	SETC	'&LAB'(3,2)
      AIF (N'&SYSLIST EQ 4)  BPP
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P1*16+0),S(&P3),AL2(&P2)
      AELSE
        MNOTE 12,'SMI INVALID OPERAND COUNT &LAB_OP  '
      AEND      
        MEND 
        MACRO
&LAB	TYPE_SS	&OP,&P1,&P2,&P3,&P4
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB_OP'(3,2)	
      AIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
        AIF ('&HEX' EQ 'E1')
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(L2-1),S(&P1),X'C0C0'
        AELSEIF ('&HEX'(1,1) EQ 'F') AP ETC.
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1((LP1-1)*16+LP2-1),X'B0B0',X'C0C0'
        AELSE
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(L1-1),X'B0B0',S(&P2)
        AEND
      AELSEIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP   &P1,&P2,&P3
        AIF ('&HEX' EQ 'F0') SRP
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1((LP1-1)*16+&P3),X'B0B0',S(&P2)
        AELSEIF ('&HEX' EQ 'D9') MVCK
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(R1*16+&P3),X'B0B0',S(&P2)
        AELSE
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(LP1*16+LP2),X'B0B0',X'C0C0'
        AEND
      AELSEIF (N'&SYSLIST EQ 5)
&OP_LAB     &OP   &P1,&P2,&P3,&P4
        AIF ('&HEX' EQ 'EE')  PLO
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P1*16+&P3),S(&P2,&P4)
        AELSE
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P1*16+&P2),S(&P3,&P4)
        AEND
      AELSE
        MNOTE 12,'SS INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
        MACRO
&LAB	TYPE_SSD &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB_OP'(3,2)
      AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP     &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(R1*16+&P3),X'B0B0',S(&P2)
      AELSE
        MNOTE 12,'SSD INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
        MACRO
&LAB	TYPE_SSE &OP,&P1,&P2
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB_OP'(3,4)	
      AIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',S(&P1,&P2)
      AELSE
        MNOTE 12,'SSE INVALID OPERAND COUNT &LAB_OP  '
      AEND       
        MEND
	MACRO
&LAB	TYPE_SSF &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB_OP'(3,2)
&HEX2   SETC    '&LAB_OP'(5,1)
      AIF (N'&SYSLIST EQ 4 AND '&HEX2' NE '_')
        GBLA    &TOT_MASK
&TOT_MASK SETA &TOT_MASK+1
&OP_LAB     &OP     &P1,&P2,&P3
&HEX2A  SETA    X2A('&HEX2')
        AIF ('&HEX2' EQ '4' OR '&HEX2' EQ '5')
&LAB_OP ORG &OP_LAB+16
 DC    X'&HEX',AL1(&P1*16+&HEX2A),S(&P2,&P3)  LPD OR LPDG
        AELSE
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(&P3*16+&HEX2A),S(&P1,&P2)
        AEND
      AELSEIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP     &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC      X'&HEX',AL1(L2-1),S(&P1),X'C0C0' PKU OR PKA
      AELSE
        MNOTE 12,'SSF INVALID OPERAND COUNT &LAB_OP  '
      AEND        
        MEND 
        MACRO
&LAB	TYPE_VRI &OP,&P1,&P2,&P3,&P4,&P5
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)

     AIF (N'&SYSLIST EQ 6 AND '&HEX&HEX2' EQ 'E772') VERIM
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL1(&P3*16+0,&P4,&P5*16+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 6 AND '&HEX&HEX2' EQ 'E659') VSRP
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL3(((&P4*16+&P5)*256+&P3)*16+RXB),X'&HEX2'
      AELSEIF (N'&SYSLIST EQ 6 AND '&HEX&HEX2' EQ 'E65B') VPSOP
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL3(((&P4*16+&P5)*256+&P3)*16+RXB),X'&HEX2'
       AELSEIF (N'&SYSLIST EQ 6 AND '&HEX&HEX2' EQ 'E74A') VFTCI VRIe
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL2(&P3*16+&P4),AL1(&P5*16+RXB),X'&HEX2'

           AELSEIF (N'&SYSLIST EQ 6) VAP VRIf
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5
&LAB_OP ORG &OP_LAB+16
  DC X'&HEX',AL1(&P1*16+&P2)
  DC AL1(&P3*16+0),AL2((&P5*256+&P4)*16+RXB),X'&HEX2'
 
     AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E772') VERIM VRId
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
&M5 SETA X2A('&LAB'(7,1))
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL1(&P3*16+0,&P4,&M5*16+RXB),X'&HEX2'
       AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E786') VSLD VRId
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL1(&P3*16+0,&P4,0+RXB),X'&HEX2'
        AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E787') VSRD VRId
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL1(&P3*16+0,&P4,0+RXB),X'&HEX2'
      AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E777') VSLDB VRId
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL1(&P3*16+0,&P4,0+RXB),X'&HEX2'
      AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E746') VGM VRIb
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+0)
 DC AL1(&P2,&P3,&P4*16+RXB),X'&HEX2'
       AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E74D') VREP VRIc
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL2(&P3),AL1(&P4*16+RXB),X'&HEX2'
         AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E772') VERIM VRId
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
&M5     SETA X2A('&LAB'(7,1))
 DC X'&HEX',AL1(&P1*16+&P2,&P3*16+0,&P4,&M5*16+RXB),X'&HEX2'
      AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E658') VCVD
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
  DC AL3((&P4*256+&P3)*16+RXB),X'&HEX2'
        AELSEIF (N'&SYSLIST EQ 5 AND '&HEX&HEX2' EQ 'E65A') VCVDG
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2)
  DC AL3((&P4*256+&P3)*16+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 5)
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+X2)
 DC AL1(&P3*16+0),S(&P4),AL1(0+RXB),X'&HEX2'
       AELSEIF (N'&SYSLIST EQ 4 AND '&HEX&HEX2' EQ 'E746') VGM VRIb
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
&M4     SETA X2A('&LAB'(7,1))
 DC X'&HEX',AL1(&P1*16+0)
 DC AL1(&P2,&P3,&M4*16+RXB),X'&HEX2'
        AELSEIF (N'&SYSLIST EQ 4 AND '&HEX&HEX2' EQ 'E74A') VFTCI VRIe
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
&M4     SETA X2A('&LAB'(7,1))
&M5     SETA X2A('&LAB'(8,1))
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL2(&P3*16+&M4),AL1(&M5*16+RXB),X'&HEX2'
        AELSEIF (N'&SYSLIST EQ 4 AND '&HEX&HEX2' EQ 'E74D') VREP VRIc
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
&M4     SETA X2A('&LAB'(7,1))
 DC X'&HEX',AL1(&P1*16+&P2)
 DC AL2(&P3),AL1(&M4*16+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+0)
 DC AL2(&P2),AL1(&P3*16+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP &P1,&P2
&LAB_OP ORG &OP_LAB+16
     AIF (K'&LAB EQ 7)
&M3     SETA X2A('&LAB'(7,1))
     AELSE
&M3     SETA 0
     AEND
 DC X'&HEX',AL1(&P1*16+0)
 DC AL2(&P2),AL1(&M3*16+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 2 AND '&OP' EQ 'VZERO')  VGBM V1,0
&OP_LAB     &OP &P1
&VR2 SETA  X2A('&LAB_OP'(5,1))
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+0)
 DC AL2(0),AL1(0+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 2 AND '&OP' EQ 'VONE')  VGBM V1,X'FFFF'
&OP_LAB     &OP &P1
&VR2 SETA  X2A('&LAB_OP'(5,1))
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+0)
 DC XL2'FFFF',AL1(0+RXB),X'&HEX2'
      AELSE
        MNOTE 12,'VRI INVALID OPERAND COUNT &LAB_OP  '
      AEND     
        MEND
	MACRO
&LAB	TYPE_VRR &OP,&P1,&P2,&P3,&P4,&P5,&P6
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
&H2     SETC    '&LAB'(5,2)

  AIF ('&LAB_OP'(3,4) EQ 'E780') VFEE VRRb
     AIF (N'&SYSLIST EQ 6) VFEE
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2,&P3*16+0,&P5*16+0,&P4*16+RXB),X'&H2'
     AELSEIF (N'&SYSLIST EQ 5)
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
       AIF (K'&LAB GE 7 AND '&LAB'(7,1) NE '_')	     
&M5     SETA X2A('&LAB'(7,1))
 DC X'&HEX',AL1(&P1*16+&P2,&P3*16+0,&P4*16+0,&M5*16+RXB),X'&H2'
       AELSE
&M5     SETA 0
 DC X'&HEX',AL1(&P1*16+&P2,&P3*16+0,&M5*16+0,&P4*16+RXB),X'&H2'	   
	   AEND
     AELSEIF (N'&SYSLIST EQ 4)
       AIF (K'&LAB_OP GE 8 AND '&LAB_OP'(8,1) NE '_')
&M4     SETA X2A('&LAB'(7,1))
&M5     SETA X2A('&LAB'(8,1))
     AELSEIF (K'&LAB_OP GE 7 AND '&LAB_OP'(7,1) NE '_')
&M4     SETA X2A('&LAB'(7,1))
&M5     SETA 0
       AELSE
&M4     SETA 0
&M5     SETA 0	   
       AEND
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2,&P3*16+0,&M5*16+0,&M4*16+RXB),X'&H2'


     AELSEIF (N'&SYSLIST EQ 7) E78B VRR VSTRS
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5,&P6
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2,&P3*16+&P4)
 DC AL1(&P6,&P5*16+&P4,RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 6 AND '&LAB_OP'(3,4) EQ 'E75C')
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2,0,&P4*16+0),&P4*16+RXB),X'&H2'
     AELSEIF (N'&SYSLIST EQ 6) E78B VRR VSTRS
&OP_LAB     &OP &P1,&P2,&P3,&P4,&P5
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2,&P3*16+0,&P5,&P4*16+RXB),X'&H2'
     AELSEIF (N'&SYSLIST EQ 5 AND K'&LAB EQ 8) OP+2
&OP_LAB     &OP &P1,&P2,&P3,&P4
&M5     SETA X2A('&LAB'(7,1))
&M6     SETA X2A('&LAB'(8,1))
&LAB_OP ORG &OP_LAB+16
 DC  X'&HEX',AL1(&P1*16+&P2,&P3*16+&P4,&M5,&M6,RXB),X'&H2'
     AELSEIF (N'&SYSLIST EQ 5 AND K'&LAB EQ 7) OP+1
&OP_LAB     &OP &P1,&P2,&P3,&P4
&M3     SETA X2A('&LAB'(7,1))
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2,0,&P4*16+&P3,&M3*16+RXB),X'&H2'
     AELSEIF (N'&SYSLIST EQ 5)
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2,0,&P3*16+&P4,0+RXB),X'&H2'
     AELSEIF (N'&SYSLIST EQ 4) VCP VRRh V1,V2,M3
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(0+&P1,&P2*16+0,&P3*16+0,0+RXB),X'&H2'
     AELSEIF (N'&SYSLIST EQ 3) VLR
&OP_LAB     &OP &P1,&P2
&LAB_OP ORG &OP_LAB+16
        AIF (K'&LAB EQ 7)
&M3       SETA X2A('&LAB'(7,1))
        AELSE
&M3       SETA 0
        AEND
 DC X'&HEX',AL1(&P1*15+&P2,0,0,&M3*16+RXB),X'&H2'
     AELSEIF (N'&SYSLIST EQ 2) VTP
&OP_LAB     &OP &P1
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(0+&P1,0,0,0+RXB),X'&HEX2'
     AELSE
        MNOTE 12,'VRR INVALID OPERAND COUNT &LAB_OP  '
     AEND 
 
  AEND
     
        MEND
        MACRO
&LAB	TYPE_VRS &OP,&P1,&P2,&P3,&P4
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
     AIF (N'&SYSLIST EQ 5) VSTM P4
&OP_LAB     &OP &P1,&P2,&P3,&P4
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2),S(&P3),AL1(&P4*16+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 4) VSTM P3
&OP_LAB     &OP &P1,&P2,&P3
 	           AIF ('&LAB'(3,4) EQ 'E721' OR '&LAB'(3,4) EQ 'E722')
&M3 SETA X2A('&LAB'(7,1))
&LAB_OP&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2),S(&P3),AL1(&M3*16+RXB),X'&HEX2'
  	         AELSEIF ('&LAB'(3,4) EQ 'E733' OR '&LAB'(3,4) EQ 'E736')
&M3 SETA X2A('&LAB'(7,1))
&LAB_OP&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2),S(&P3),AL1(&M3*16+RXB),X'&HEX2'
   	         AELSEIF ('&LAB'(3,4) EQ 'E738' OR '&LAB'(3,4) EQ 'E73A')
&M3 SETA X2A('&LAB'(7,1))
&LAB_OP&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2),S(&P3),AL1(&M3*16+RXB),X'&HEX2'
    	     AELSEIF ('&LAB'(3,4) EQ 'E73F') VSTL NO M3
&LAB_OP&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2),S(&P3),AL1(RXB),X'&HEX2'
     	         AELSEIF ('&LAB'(3,4) EQ 'E73E')
&M3 SETA X2A('&LAB'(7,1))
&LAB_OP&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+&P2),S(&P3),AL1(&M3*16+RXB),X'&HEX2'
			   AELSE   
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P2),S(&P3),AL1(&P1*16+RXB),X'&HEX2'
               AEND
     AELSEIF (N'&SYSLIST EQ 3 AND K'&LAB EQ 7)
&OP_LAB     &OP &P1,&P2
&M3 SETA X2A('&LAB'(7,1))
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P2),S(&P3),AL1(&P1*16+RXB),X'&HEX2'
      AELSE
        MNOTE 12,'VRS INVALID OPERAND COUNT &LAB_OP  '
      AEND      
        MEND
        MACRO
&LAB	TYPE_VRV &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
     AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+V2),X'C0C0',AL1(&P3*16+RXB),X'&HEX2'
      AELSE
        MNOTE 12,'VRV INVALID OPERAND COUNT &LAB_OP  '
      AEND     
        MEND
	MACRO
&LAB	TYPE_VRX &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
     AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+X2),X'C0C0',AL1(&P3*16+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 3 AND K'&LAB EQ 7)
&OP_LAB     &OP &P1,&P2
&M3 SETA X2A('&LAB'(7,1))
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+X2),X'C0C0',AL1(&M3*16+RXB),X'&HEX2'
     AELSEIF (N'&SYSLIST EQ 3)
&OP_LAB     &OP &P1,&P2
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P1*16+X2),X'C0C0',AL1(0+RXB),X'&HEX2'
      AELSE
        MNOTE 12,'VRX INVALID OPERAND COUNT &LAB_OP  '
      AEND     
        MEND
	MACRO
&LAB	TYPE_VSI &OP,&P1,&P2,&P3
        GBLC &LAB_OP,&OP_LAB
&HEX	SETC	'&LAB'(3,2)
&HEX2   SETC    '&LAB'(5,2)
     AIF (N'&SYSLIST EQ 4)
&OP_LAB     &OP &P1,&P2,&P3
&LAB_OP ORG &OP_LAB+16
 DC X'&HEX',AL1(&P3),S(&P2),AL1(&P1*16+RXB),X'&HEX2'
      AELSE
        MNOTE 12,'VSI INVALID OPERAND COUNT &LAB_OP  '
      AEND     
        MEND
* END OF INS6MACS.CPY BY TESTINS6.MLC