         DC    C' ΅Ά£¤¥¦§¨©ª«¬­®―'
         DC    C'°±²³΄µ¶·ΈΉΊ»Ό½ΎΏ'
         DC    C'ΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟ'
         DC    C'ΠΡÒΣΤΥΦΧΨΩΪΫάέήί'
         DC    C'ΰαβγδεζηθικλμνξο'
         DC    C'πρςστυφχψωϊϋόύώÿ'
