T1P#451  CSECT
         DC    C'¦'

         PUNCH '         DC    C'' ΅Ά£¤¥¦§¨©ª«¬­®―''     A0-AF'
         PUNCH '         DC    C''°±²³΄µ¶·ΈΉΊ»Ό½ΎΏ''    B0-BF'
         PUNCH '         DC    C''ΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟ''    C0-CF'
         PUNCH '         DC    C''ΠΡÒΣΤΥΦΧΨΩΪΫάέήί''    D0-DF'
         PUNCH '         DC    C''ΰαβγδεζηθικλμνξο''    E0-EF'
         PUNCH '         DC    C''πρςστυφχψωϊϋόύώÿ''    F0-FF'
*
         END
