* Z390ECOB GENERATED Z390 ASSEMBLER SOURCE PROGRAM
* Z390ECOB DATE=2008-04-24 15:08:47.514000
PACVT    CSECT
CVTSTRT  DC    A(LINE_000051)
CVTEND   DC    A(LINE_000052)
CVTLDSA  DC     A(X'000052')
CVTCGT   DC    A(CGT)
DAB      DC    A(0)
CVTPAINT DC    V(PAOSINT)
         END
