*********************************************************************
* Copyright 2007 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 04/23/07                                                 *
*********************************************************************
* 08/30/07 INITIAL CODING OF ESDS VAR LENGTH RECORD TESTS           
* 09/07/07 RPI 688 CHANGE RBA/XRBA SEQUENCE TO 2, 1, 3 TO VERIFY RANDOM     
* 09/09/07 RPI 672 CHANGE RBA/XRBA VALUES TO VES RECORD ADDRESSES         
*********************************************************************
ESV1TEST RT1   MAIN 
QDCBIN   DCB   DDNAME=QFILE,RECFM=V,LRECL=304,MACRF=GM,EODAD=EOF
QDCBOUT  DCB   DDNAME=QFILE,RECFM=V,LRECL=304,MACRF=PM
VACBOUT  ACB   DDNAME=VFILE,MACRF=(SEQ,OUT)
VACBINS  ACB   DDNAME=VFILE,MACRF=(SEQ,IN)
VACBINR  ACB   DDNAME=VFILE,MACRF=(ADR)
VRPLOUTS RPL   ACB=VACBOUT,AREA=RECORD+4,OPTCD=(SEQ)
VRPLINS  RPL   ACB=VACBINS,AREA=RECORD+4,OPTCD=(SEQ)
VRPLRBA  RPL   ACB=VACBINR,AREA=RECORD+4,OPTCD=(ADR),ARG=RBA
VRPLXRBA RPL   ACB=VACBINR,AREA=RECORD+4,OPTCD=(ADR,XRBA),ARG=XRBA
RECORD   DC    0XL304,XL4'00',300C' '
VREC1    DC    H'104,0',100C'1'
VREC2    DC    H'204,0',200C'2'
VREC3    DC    H'304,0',300C'3'
RBA      DC    XL4'00'
RBA1     DC    XL4'00'
RBA2     DC    XL4'00'
RBA3     DC    XL4'00'
XRBA     DC    XL8'00'
XRBA1    DC    XL8'00'
XRBA2    DC    XL8'00'
XRBA3    DC    XL8'00'
VRBA1    DC    AL4(0)   4,100,4  ESDS VAR RECORD FORMAT (LEN,REC,LEN)
VRBA2    DC    AL4(108) 4,200,4  USED TO SUPPORT READING BACKWARDS
VRBA3    DC    AL4(316)
VXRBA1   DC    AL8(0) 
VXRBA2   DC    AL8(108)
VXRBA3   DC    AL8(316)
         LTORG
         EQUREGS
         RT1   START
         WTO   'ESV1TEST TEST ESDS VARIABLE LENGTH RECORD I/O'   
*
* CREATE QSAM FILE WITH 3 VAR LENGTH RECORDS 
*
         WTO   'ESV1TEST CREATE QFILE'
         OPEN  (QDCBOUT,(OUTPUT))
         PUT   QDCBOUT,VREC1
         PUT   QDCBOUT,VREC2
         PUT   QDCBOUT,VREC3
         CLOSE (QDCBOUT)
*
* BUILD VSAM VARIABLE LENGTH ESDS FILE FROM QSAME FILE WITH 3 RECORDS
*
         WTO   'ESV1TEST CREATE VFILE'
         OPEN  (QDCBIN,(INPUT),VACBOUT,(OUTPUT))
         LTR   R15,R15
         RT1   CC0
LOOP     EQU   *
         GET   QDCBIN,RECORD
         LH    R2,RECORD
         AHI   R2,-4
         MODCB RPL=VRPLOUTS,RECLEN=(R2)
         PUT   RPL=VRPLOUTS
         LTR   R15,R15
         RT1   CC0
         B     LOOP
EOF      CLOSE (QDCBIN,,VACBOUT)
         LTR   R15,R15
         RT1   CC0
*
* READ AND VERIFY 3 VSAM VARIABLE LENGTH RECORDS AND RBA'S 
* (NOTE RBA'S POINT TO VX0 XRBA'S TO ACTUAL RECORDS IN VES)
*
         WTO   'ESV1TEST READ AND VERIFY VFILE SEQUENTIALLY'
         OPEN  (VACBINS)
         LTR   R15,R15
         RT1   CC0
         GET   RPL=VRPLINS
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(100),=100C'1'
         RT1   CC0
         SHOWCB RPL=VRPLINS,AREA=RBA1,LENGTH=4,FIELDS=(RBA)
         CLC   RBA1,VRBA1
         RT1   CC0
         SHOWCB RPL=VRPLINS,AREA=XRBA1,LENGTH=8,FIELDS=(XRBA)
         CLC   XRBA1,VXRBA1  
         RT1   CC0
         GET   RPL=VRPLINS  
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(200),=200C'2'
         RT1   CC0
         SHOWCB RPL=VRPLINS,AREA=RBA2,LENGTH=4,FIELDS=(RBA)
         CLC   RBA2,VRBA2
         RT1   CC0
         SHOWCB RPL=VRPLINS,AREA=XRBA2,LENGTH=8,FIELDS=(XRBA)
         CLC   XRBA2,VXRBA2 
         RT1   CC0
         GET   RPL=VRPLINS
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(200),=200C'3'
         RT1   CC0
         CLC   RECORD+204(100),=100C'3'
         RT1   CC0
         SHOWCB RPL=VRPLINS,AREA=RBA3,LENGTH=4,FIELDS=(RBA)
         CLC   RBA3,VRBA3
         RT1   CC0
         SHOWCB RPL=VRPLINS,AREA=XRBA3,LENGTH=8,FIELDS=(XRBA)
         CLC   XRBA3,VXRBA3
         RT1   CC0
         GET   RPL=VRPLINS
         CHI   R15,8             VERIFY LOGIC ERROR AT EOD
         RT1   CC0
         TESTCB RPL=VRPLINS,FDBK=4 VERIFY EOD REASON CODE 
         RT1   CC0
         CLOSE (VACBINS)
         LTR   R15,R15
         RT1   CC0
*
* READ AND VERIFY 3 RECORDS BY RBA AND BY XRBA ADDRESS
*
         WTO   'ESV1TEST READ AND VERIFY VFILE BY RBA AND XRBA'
         OPEN  (VACBINR)
         LTR   R15,R15
         RT1   CC0
         MVC   RBA,RBA2
         GET   RPL=VRPLRBA
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(200),=200C'2'
         RT1   CC0
         MVC   RBA,RBA1
         GET   RPL=VRPLRBA
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(100),=100C'1'
         RT1   CC0
         MVC   RBA,RBA3
         GET   RPL=VRPLRBA
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(200),=200C'3'
         RT1   CC0
         CLC   RECORD+204(100),=100C'3'
         RT1   CC0
         MVC   XRBA,XRBA2
         GET   RPL=VRPLXRBA
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(200),=200C'2'
         RT1   CC0
         MVC   XRBA,XRBA1
         GET   RPL=VRPLXRBA
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(100),=100C'1'
         RT1   CC0
         MVC   XRBA,XRBA3
         GET   RPL=VRPLXRBA
         LTR   R15,R15
         RT1   CC0
         CLC   RECORD+4(200),=200C'3'
         RT1   CC0
         CLC   RECORD+204(100),=100C'3'
         RT1   CC0
         CLOSE (VACBINR)
         LTR   R15,R15
         RT1   CC0
         RT1   END
         END
