*********************************************************************
* Copyright 2007 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 04/23/07                                                 *
*********************************************************************
* 08/31/07 INITIAL CODING OF RRDS VARIABLE LENGTH RECORD TESTS           
*********************************************************************
RRV1SP   RT1   MAIN 
VACBOUT  ACB   DDNAME=VFILE,MACRF=(DIR,OUT)
VACBIN   ACB   DDNAME=VFILE,MACRF=(DIR,IN)
VRPLOUT  RPL   ACB=VACBOUT,AREA=RECORD,OPTCD=(DIR),ARG=REC#
VRPLIN   RPL   ACB=VACBIN,AREA=RECORD,OPTCD=(DIR),ARG=REC#
RECORD   DC    CL400' '
REC#     DC    F'0'
         LTORG
         EQUREGS
         RT1   START
*
* BUILD VSAM RRDS VARIABLE LENGTH FILE WITH 3 RECORDS
*
         WTO   'RRV1TEST CREATE RRDS VFILE WITH 3 RECORDS'
         OPEN  (VACBOUT,(OUTPUT))
         LTR   R15,R15
         RT1   CC0
         MVC   RECORD(100),=100C'0'
         MVC   REC#,=F'0'
         MODCB RPL=VRPLOUT,RECLEN=100
         PUT   RPL=VRPLOUT
         LTR   R15,R15
         RT1   CC0
         MVC   RECORD(200),=200C'4'
         MVC   RECORD+200(200),=200C'4'
         MVC   REC#,=F'4'
         MODCB RPL=VRPLOUT,RECLEN=400
         PUT   RPL=VRPLOUT
         LTR   R15,R15
         RT1   CC0
         MVC   RECORD(200),=200C'2'
         MVC   REC#,=F'2'
         MODCB RPL=VRPLOUT,RECLEN=200
         PUT   RPL=VRPLOUT
         LTR   R15,R15
         RT1   CC0
         CLOSE (VACBOUT)
         LTR   R15,R15
         RT1   CC0
*
* READ AND VERIFY 3 VSAM RRDS VARIABLE LENGTH RECORDS 
*
         WTO   'RRV1TEST READ AND VERIFY VFILE RECORDS'
         OPEN  (VACBIN)
         LTR   R15,R15
         RT1   CC0
         MVC   REC#,=F'0'
         GET   RPL=VRPLIN
         LTR   R15,R15
         RT1   CC0
         TESTCB RPL=VRPLIN,RECLEN=100
         RT1   CC0
         CLC   RECORD(100),=100C'0'
         RT1   CC0
         MVC   REC#,=F'2'
         GET   RPL=VRPLIN
         LTR   R15,R15
         RT1   CC0
         TESTCB RPL=VRPLIN,RECLEN=200
         RT1   CC0
         CLC   RECORD(200),=200C'2'
         RT1   CC0
         MVC   REC#,=F'4'
         GET   RPL=VRPLIN
         LTR   R15,R15
         RT1   CC0
         TESTCB RPL=VRPLIN,RECLEN=400
         RT1   CC0
         CLC   RECORD(200),=200C'4'
         RT1   CC0
         CLC   RECORD+200(200),=200C'4'
         RT1   CC0
         CLOSE (VACBIN)
         LTR   R15,R15
         RT1   CC0
         RT1   END
         END
