         AGO   .SKIP                                                    00010007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00020007
*   Copyright (C) <2021>  Daniel H. Snyder                              00030019
*   Structured Programming Macros for the IBM High Level Assembler      00040007
*   Daniel.H.Snyder@protonmail.com                                      00050007
*                                                                       00060007
* This program is free software: you can redistribute it and/or modify  00070007
* it under the terms of the GNU General Public License as published by  00080007
* the Free Software Foundation, either version 3 of the License, or     00090007
* any later version.                                                    00100007
*                                                                       00110007
* This program is distributed in the hope that it will be useful,       00120007
* but WITHOUT ANY WARRANTY; without even the implied warranty of        00130007
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         00140007
* GNU General Public License for more details.                          00150007
*                                                                       00160007
* You should have received a copy of the GNU General Public License     00170007
* along with this program. See <https://www.gnu.org/licenses/>.         00180007
*                                                                       00190007
.SKIP    ANOP                                                           00200007
IFTEST   TITLE 'EXAMPLES OF "IF" LOGIC MACRO INSTRUCTIONS'              00210007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00220007
*                                                                     * 00230007
*      THESE FOLLOWING STATEMENTS ARE NORMAL zOS INITIALIZATION       * 00240007
*                                                                     * 00250007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00260007
*                                                                       00270007
R0       EQU   0                                                        00280007
R1       EQU   1       STANDARD                                         00290007
R2       EQU   2        EQUATES                                         00300007
R3       EQU   3         FOR                                            00310007
R4       EQU   4          GENERAL                                       00320007
R5       EQU   5           PURPOSE                                      00330007
R6       EQU   6            REGISTERS.                                  00340007
R7       EQU   7             YOU                                        00350007
R8       EQU   8              MIGHT                                     00360007
R9       EQU   9               AS                                       00370007
R10      EQU   10               WELL                                    00380007
R11      EQU   11                JUST                                   00390007
R12      EQU   12                 GET                                   00400007
R13      EQU   13                  USED                                 00410007
R14      EQU   14                   TO                                  00420007
R15      EQU   15                    IT.                                00430007
*                                                                       00440007
IFTEST   CSECT                                                          00450007
*                                                                       00460007
         STM   R14,R12,12(R13)     SAVE REGS IN CALLER'S SAVE AREA      00470007
         LR    R12,R15             PRIME BASE REG                       00480007
         USING IFTEST,R12          SET BASE REGISTER FOR PROGRAM        00490007
         LR    R1,R13              COPY THE CALLER'S SAVEAREA POINTER   00500007
         L     R13,VCON$WA$        ADDRESS OF MY SAVE/WORK AREA         00510007
         IF    (CLR,R1,R1,NE)                                           00520007
VCON$WA$ DC    V($$WA$$)                                                00530007
         ENDIF                                                          00540007
         USING $$WA$$,R13          SEPARATE CSECT FOR REENTRANCY        00550007
         ST    R1,SAVEAREA+4       BACK LINK TO CALLER'S SAVE AREA      00560007
         ST    R13,8(,R1)          FORWARD LINK TO MY SAVE AREA         00570007
*                                                                       00580007
$$WA$$   CSECT                                                          00590007
SAVEAREA DC    18F'0'              MY SAVE AREA                         00600007
IFTEST   CSECT                                                          00610007
*                                                                       00620007
         OPEN  (SYSPRINT,OUTPUT)                                        00630007
*                                                                       00640007
         PRINT GEN                                                      00650007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00660007
*                                                                     * 00670007
* TEST SHOWING WHAT HAPPENS WHEN THE RESULT OF THE "IF" CREATES TRUE  * 00680007
*                                                                     * 00690007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00700007
*                                                                       00710007
         MVI   VARBL1,C'A'         SET TO PASS                          00720007
         MVC   PREDOUT,=C'TRUE '                                        00730007
         MVC   TESTNBR,=C'TEST010A'                                     00740007
*                                                                       00750007
TEST010A IF    (CLI,VARBL1,C'A',E)                                      00760007
           MVC   ACTOUT,=C'TRUE '                                       00770007
         ELSE                                                           00780007
           MVC   ACTOUT,=C'FALSE'                                       00790007
         ENDIF                                                          00800007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  00810007
           MVC   ERROR,=C'<=== ERROR'                                   00820007
         ENDIF                                                          00830007
         PUT   SYSPRINT,OUTPUT                                          00840007
         MVC   ERROR,=CL10' '                                           00850007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 00860007
         MVI   VARBL1,C'Z'         SET TO FAIL                          00870007
         MVC   PREDOUT,=C'FALSE'                                        00880007
         MVC   TESTNBR,=C'TEST010B'                                     00890007
*                                                                       00900007
TEST010B IF    (CLI,VARBL1,C'A',E)                                      00910007
           MVC   ACTOUT,=C'TRUE '                                       00920007
         ELSE                                                           00930007
           MVC   ACTOUT,=C'FALSE'                                       00940007
         ENDIF                                                          00950007
          IF    (CLC,PREDOUT,ACTOUT,NE)                                 00960007
           MVC   ERROR,=C'<=== ERROR'                                   00970007
         ENDIF                                                          00980007
         PUT   SYSPRINT,OUTPUT                                          00990007
         MVC   ERROR,=CL10' '                                           01000007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01010007
*                                                                     * 01020007
* PREDICTED RESULT IS TRUE                                            * 01030007
*                                                                     * 01040007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01050007
*                                                                       01060007
         MVI   VARBL1,C'A'         SET TO PASS                          01070007
         MVI   VARBL2,C'B'         SET TO PASS                          01080007
         MVC   PREDOUT,=C'TRUE '                                        01090007
         MVC   TESTNBR,=C'TEST030A'                                     01100007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01110007
TEST030A IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E)              01120007
           MVC   ACTOUT,=C'TRUE '                                       01130007
         ELSE                                                           01140007
           MVC   ACTOUT,=C'FALSE'                                       01150007
         ENDIF                                                          01160007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  01170007
           MVC   ERROR,=C'<=== ERROR'                                   01180007
         ENDIF                                                          01190007
         PUT   SYSPRINT,OUTPUT                                          01200007
         MVC   ERROR,=CL10' '                                           01210007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01220007
*                                                                     * 01230007
* PREDICTED RESULT IS FALSE                                           * 01240007
*                                                                     * 01250007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01260007
*                                                                       01270007
         MVI   VARBL1,C'Z'         SET TO FAIL                          01280007
         MVI   VARBL2,C'B'         SET TO PASS                          01290007
         MVC   PREDOUT,=C'FALSE'                                        01300007
         MVC   TESTNBR,=C'TEST030B'                                     01310007
*                                                                       01320007
TEST030B IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E)              01330007
           MVC   ACTOUT,=C'TRUE '                                       01340007
         ELSE                                                           01350007
           MVC   ACTOUT,=C'FALSE'                                       01360007
         ENDIF                                                          01370007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  01380007
           MVC   ERROR,=C'<=== ERROR'                                   01390007
         ENDIF                                                          01400007
         PUT   SYSPRINT,OUTPUT                                          01410007
         MVC   ERROR,=CL10' '                                           01420007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01430007
         MVI   VARBL1,C'A'         SET TO PASS                          01440007
         MVI   VARBL2,C'Z'         SET TO FAIL                          01450007
         MVC   PREDOUT,=C'FALSE'                                        01460007
         MVC   TESTNBR,=C'TEST030C'                                     01470007
*                                                                       01480007
TEST030C IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E)              01490007
           MVC   ACTOUT,=C'TRUE '                                       01500007
         ELSE                                                           01510007
           MVC   ACTOUT,=C'FALSE'                                       01520007
         ENDIF                                                          01530007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  01540007
           MVC   ERROR,=C'<=== ERROR'                                   01550007
         ENDIF                                                          01560007
         PUT   SYSPRINT,OUTPUT                                          01570007
         MVC   ERROR,=CL10' '                                           01580007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01590007
         MVI   VARBL1,C'Z'         SET TO FAIL                          01600007
         MVI   VARBL2,C'Z'         SET TO FAIL                          01610007
         MVC   PREDOUT,=C'FALSE'                                        01620007
         MVC   TESTNBR,=C'TEST030D'                                     01630007
*                                                                       01640007
TEST030D IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E)              01650007
           MVC   ACTOUT,=C'TRUE '                                       01660007
         ELSE                                                           01670007
           MVC   ACTOUT,=C'FALSE'                                       01680007
         ENDIF                                                          01690007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  01700007
           MVC   ERROR,=C'<=== ERROR'                                   01710007
         ENDIF                                                          01720007
         PUT   SYSPRINT,OUTPUT                                          01730007
         MVC   ERROR,=CL10' '                                           01740007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01750007
*                                                                     * 01760007
* TEST "IF" MACRO USING "OR" CONJUNCTION                              * 01770007
*                                                                     * 01780007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01790007
*                                                                       01800007
         MVI   VARBL1,C'A'         SET TO PASS                          01810007
         MVI   VARBL2,C'B'         SET TO PASS                          01820007
         MVC   PREDOUT,=C'TRUE '                                        01830007
         MVC   TESTNBR,=C'TEST040A'                                     01840007
*                                                                       01850007
TEST040A IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E)               01860007
           MVC   ACTOUT,=C'TRUE '                                       01870007
         ELSE                                                           01880007
           MVC   ACTOUT,=C'FALSE'                                       01890007
         ENDIF                                                          01900007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  01910007
           MVC   ERROR,=C'<=== ERROR'                                   01920007
         ENDIF                                                          01930007
         PUT   SYSPRINT,OUTPUT                                          01940007
         MVC   ERROR,=CL10' '                                           01950007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 01960007
         MVI   VARBL1,C'Z'         SET TO FAIL                          01970007
         MVI   VARBL2,C'B'         SET TO PASS                          01980007
         MVC   PREDOUT,=C'TRUE '                                        01990007
         MVC   TESTNBR,=C'TEST040B'                                     02000007
*                                                                       02010007
TEST040B IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E)               02020007
           MVC   ACTOUT,=C'TRUE '                                       02030007
         ELSE                                                           02040007
           MVC   ACTOUT,=C'FALSE'                                       02050007
         ENDIF                                                          02060007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  02070007
           MVC   ERROR,=C'<=== ERROR'                                   02080007
         ENDIF                                                          02090007
         PUT   SYSPRINT,OUTPUT                                          02100007
         MVC   ERROR,=CL10' '                                           02110007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 02120007
         MVI   VARBL1,C'A'         SET TO PASS                          02130007
         MVI   VARBL2,C'Z'         SET TO FAIL                          02140007
         MVC   PREDOUT,=C'TRUE '                                        02150007
         MVC   TESTNBR,=C'TEST040C'                                     02160007
*                                                                       02170007
TEST040C IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E)               02180007
           MVC   ACTOUT,=C'TRUE '                                       02190007
         ELSE                                                           02200007
           MVC   ACTOUT,=C'FALSE'                                       02210007
         ENDIF                                                          02220007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  02230007
           MVC   ERROR,=C'<=== ERROR'                                   02240007
         ENDIF                                                          02250007
         PUT   SYSPRINT,OUTPUT                                          02260007
         MVC   ERROR,=CL10' '                                           02270007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 02280007
         MVI   VARBL1,C'Z'         SET TO FAIL                          02290007
         MVI   VARBL2,C'Z'         SET TO FAIL                          02300007
         MVC   PREDOUT,=C'FALSE'                                        02310007
         MVC   TESTNBR,=C'TEST040D'                                     02320007
*                                                                       02330007
TEST040D IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E)               02340007
           MVC   ACTOUT,=C'TRUE '                                       02350007
         ELSE                                                           02360007
           MVC   ACTOUT,=C'FALSE'                                       02370007
         ENDIF                                                          02380007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  02390007
           MVC   ERROR,=C'<=== ERROR'                                   02400007
         ENDIF                                                          02410007
         PUT   SYSPRINT,OUTPUT                                          02420007
         MVC   ERROR,=CL10' '                                           02430007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 02440007
*                                                                     * 02450007
* THREE "AND" CONJUNCTIONS                                            * 02460007
*                                                                     * 02470007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 02480007
*                                                                       02490007
         MVI   VARBL1,C'A'         SET TO PASS                          02520007
         MVI   VARBL2,C'B'         SET TO PASS                          02530007
         MVI   VARBL3,C'C'         SET TO PASS                          02540007
         MVC   PREDOUT,=C'TRUE '                                        02550007
         MVC   TESTNBR,=C'TEST050A'                                     02560007
*                                                                       02570007
TEST050A IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C02580007
               AND,(CLI,VARBL3,C'C',E)                                  02590007
           MVC   ACTOUT,=C'TRUE '                                       02600007
         ELSE                                                           02610007
           MVC   ACTOUT,=C'FALSE'                                       02620007
         ENDIF                                                          02630007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  02640007
           MVC   ERROR,=C'<=== ERROR'                                   02650007
         ENDIF                                                          02660007
         PUT   SYSPRINT,OUTPUT                                          02670007
         MVC   ERROR,=CL10' '                                           02680007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 02690007
         MVI   VARBL1,C'Z'         SET TO FAIL                          02700007
         MVI   VARBL2,C'B'         SET TO PASS                          02710007
         MVI   VARBL3,C'C'         SET TO PASS                          02720007
         MVC   PREDOUT,=C'FALSE'                                        02730007
         MVC   TESTNBR,=C'TEST050B'                                     02740007
*                                                                       02750007
TEST050B IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C02760007
               AND,(CLI,VARBL3,C'C',E)                                  02770007
           MVC   ACTOUT,=C'TRUE '                                       02780007
         ELSE                                                           02790007
           MVC   ACTOUT,=C'FALSE'                                       02800007
         ENDIF                                                          02810007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  02820007
           MVC   ERROR,=C'<=== ERROR'                                   02830007
         ENDIF                                                          02840007
         PUT   SYSPRINT,OUTPUT                                          02850007
         MVC   ERROR,=CL10' '                                           02860007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 02870007
         MVI   VARBL1,C'A'         SET TO PASS                          02880007
         MVI   VARBL2,C'Z'         SET TO FAIL                          02890007
         MVI   VARBL3,C'C'         SET TO PASS                          02900007
         MVC   PREDOUT,=C'FALSE'                                        02910007
         MVC   TESTNBR,=C'TEST050C'                                     02920007
*                                                                       02930007
TEST050C IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C02940007
               AND,(CLI,VARBL3,C'C',E)                                  02950007
           MVC   ACTOUT,=C'TRUE '                                       02960007
         ELSE                                                           02970007
           MVC   ACTOUT,=C'FALSE'                                       02980007
         ENDIF                                                          02990007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  03000007
           MVC   ERROR,=C'<=== ERROR'                                   03010007
         ENDIF                                                          03020007
         PUT   SYSPRINT,OUTPUT                                          03030007
         MVC   ERROR,=CL10' '                                           03040007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 03050007
         MVI   VARBL1,C'Z'         SET TO FAIL                          03060007
         MVI   VARBL2,C'Z'         SET TO FAIL                          03070007
         MVI   VARBL3,C'C'         SET TO PASS                          03080007
         MVC   PREDOUT,=C'FALSE'                                        03090007
         MVC   TESTNBR,=C'TEST050D'                                     03100007
*                                                                       03110007
TEST050D IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C03120007
               AND,(CLI,VARBL3,C'C',E)                                  03130007
           MVC   ACTOUT,=C'TRUE '                                       03140007
         ELSE                                                           03150007
           MVC   ACTOUT,=C'FALSE'                                       03160007
         ENDIF                                                          03170007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  03180007
           MVC   ERROR,=C'<=== ERROR'                                   03190007
         ENDIF                                                          03200007
         PUT   SYSPRINT,OUTPUT                                          03210007
         MVC   ERROR,=CL10' '                                           03220007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 03230007
         MVI   VARBL1,C'A'         SET TO PASS                          03240007
         MVI   VARBL2,C'B'         SET TO PASS                          03250007
         MVI   VARBL3,C'Z'         SET TO FAIL                          03260007
         MVC   PREDOUT,=C'FALSE'                                        03270007
         MVC   TESTNBR,=C'TEST050E'                                     03280007
*                                                                       03290007
TEST050E IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C03300007
               AND,(CLI,VARBL3,C'C',E)                                  03310007
           MVC   ACTOUT,=C'TRUE '                                       03320007
         ELSE                                                           03330007
           MVC   ACTOUT,=C'FALSE'                                       03340007
         ENDIF                                                          03350007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  03360007
           MVC   ERROR,=C'<=== ERROR'                                   03370007
         ENDIF                                                          03380007
         PUT   SYSPRINT,OUTPUT                                          03390007
         MVC   ERROR,=CL10' '                                           03400007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 03410007
         MVI   VARBL1,C'Z'         SET TO FAIL                          03420007
         MVI   VARBL2,C'B'         SET TO PASS                          03430007
         MVI   VARBL3,C'Z'         SET TO FAIL                          03440007
         MVC   PREDOUT,=C'FALSE'                                        03450007
         MVC   TESTNBR,=C'TEST050F'                                     03460007
*                                                                       03470007
TEST050F IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C03480007
               AND,(CLI,VARBL3,C'C',E)                                  03490007
           MVC   ACTOUT,=C'TRUE '                                       03500007
         ELSE                                                           03510007
           MVC   ACTOUT,=C'FALSE'                                       03520007
         ENDIF                                                          03530007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  03540007
           MVC   ERROR,=C'<=== ERROR'                                   03550007
         ENDIF                                                          03560007
         PUT   SYSPRINT,OUTPUT                                          03570007
         MVC   ERROR,=CL10' '                                           03580007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 03590007
         MVI   VARBL1,C'A'         SET TO PASS                          03600007
         MVI   VARBL2,C'Z'         SET TO FAIL                          03610007
         MVI   VARBL3,C'Z'         SET TO FAIL                          03620007
         MVC   PREDOUT,=C'FALSE'                                        03630007
         MVC   TESTNBR,=C'TEST050G'                                     03640007
*                                                                       03650007
TEST050G IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C03660007
               AND,(CLI,VARBL3,C'C',E)                                  03670007
           MVC   ACTOUT,=C'TRUE '                                       03680007
         ELSE                                                           03690007
           MVC   ACTOUT,=C'FALSE'                                       03700007
         ENDIF                                                          03710007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  03720007
           MVC   ERROR,=C'<=== ERROR'                                   03730007
         ENDIF                                                          03740007
         PUT   SYSPRINT,OUTPUT                                          03750007
         MVC   ERROR,=CL10' '                                           03760007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 03770007
         MVI   VARBL1,C'Z'         SET TO FAIL                          03780007
         MVI   VARBL2,C'Z'         SET TO FAIL                          03790007
         MVI   VARBL3,C'Z'         SET TO FAIL                          03800007
         MVC   PREDOUT,=C'FALSE'                                        03810007
         MVC   TESTNBR,=C'TEST050H'                                     03820007
*                                                                       03830007
TEST050H IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C03840007
               AND,(CLI,VARBL3,C'C',E)                                  03850007
           MVC   ACTOUT,=C'TRUE '                                       03860007
         ELSE                                                           03870007
           MVC   ACTOUT,=C'FALSE'                                       03880007
         ENDIF                                                          03890007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  03900007
           MVC   ERROR,=C'<=== ERROR'                                   03910007
         ENDIF                                                          03920007
         PUT   SYSPRINT,OUTPUT                                          03930007
         MVC   ERROR,=CL10' '                                           03940007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 03950007
*                                                                     * 03960007
* THREE "OR" CONJUNCTIONS                                             * 03970007
*                                                                     * 03980007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 03990007
*                                                                       04000007
         MVI   VARBL1,C'A'         SET TO PASS                          04030007
         MVI   VARBL2,C'B'         SET TO PASS                          04040007
         MVI   VARBL3,C'C'         SET TO PASS                          04050007
         MVC   PREDOUT,=C'TRUE '                                        04060007
         MVC   TESTNBR,=C'TEST060A'                                     04070007
*                                                                       04080007
TEST060A IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E),             C04090007
               OR,(CLI,VARBL3,C'C',E)                                   04100007
           MVC   ACTOUT,=C'TRUE '                                       04110007
         ELSE                                                           04120007
           MVC   ACTOUT,=C'FALSE'                                       04130007
         ENDIF                                                          04140007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  04150007
           MVC   ERROR,=C'<=== ERROR'                                   04160007
         ENDIF                                                          04170007
         PUT   SYSPRINT,OUTPUT                                          04180007
         MVC   ERROR,=CL10' '                                           04190007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 04200007
         MVI   VARBL1,C'Z'         SET TO FAIL                          04210007
         MVI   VARBL2,C'B'         SET TO PASS                          04220007
         MVI   VARBL3,C'C'         SET TO PASS                          04230007
         MVC   PREDOUT,=C'TRUE '                                        04240007
         MVC   TESTNBR,=C'TEST060B'                                     04250007
*                                                                       04260007
TEST060B IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E),             C04270007
               OR,(CLI,VARBL3,C'C',E)                                   04280007
           MVC   ACTOUT,=C'TRUE '                                       04290007
         ELSE                                                           04300007
           MVC   ACTOUT,=C'FALSE'                                       04310007
         ENDIF                                                          04320007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  04330007
           MVC   ERROR,=C'<=== ERROR'                                   04340007
         ENDIF                                                          04350007
         PUT   SYSPRINT,OUTPUT                                          04360007
         MVC   ERROR,=CL10' '                                           04370007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 04380007
         MVI   VARBL1,C'A'         SET TO PASS                          04390007
         MVI   VARBL2,C'Z'         SET TO FAIL                          04400007
         MVI   VARBL3,C'C'         SET TO PASS                          04410007
         MVC   PREDOUT,=C'TRUE '                                        04420007
         MVC   TESTNBR,=C'TEST060C'                                     04430007
*                                                                       04440007
TEST060C IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E),             C04450007
               OR,(CLI,VARBL3,C'C',E)                                   04460007
           MVC   ACTOUT,=C'TRUE '                                       04470007
         ELSE                                                           04480007
           MVC   ACTOUT,=C'FALSE'                                       04490007
         ENDIF                                                          04500007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  04510007
           MVC   ERROR,=C'<=== ERROR'                                   04520007
         ENDIF                                                          04530007
         PUT   SYSPRINT,OUTPUT                                          04540007
         MVC   ERROR,=CL10' '                                           04550007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 04560007
         MVI   VARBL1,C'Z'         SET TO FAIL                          04570007
         MVI   VARBL2,C'Z'         SET TO FAIL                          04580007
         MVI   VARBL3,C'C'         SET TO PASS                          04590007
         MVC   PREDOUT,=C'TRUE '                                        04600007
         MVC   TESTNBR,=C'TEST060D'                                     04610007
*                                                                       04620007
TEST060D IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E),             C04630007
               OR,(CLI,VARBL3,C'C',E)                                   04640007
           MVC   ACTOUT,=C'TRUE '                                       04650007
         ELSE                                                           04660007
           MVC   ACTOUT,=C'FALSE'                                       04670007
         ENDIF                                                          04680007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  04690007
           MVC   ERROR,=C'<=== ERROR'                                   04700007
         ENDIF                                                          04710007
         PUT   SYSPRINT,OUTPUT                                          04720007
         MVC   ERROR,=CL10' '                                           04730007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 04740007
         MVI   VARBL1,C'A'         SET TO PASS                          04750007
         MVI   VARBL2,C'B'         SET TO PASS                          04760007
         MVI   VARBL3,C'Z'         SET TO FAIL                          04770007
         MVC   PREDOUT,=C'TRUE '                                        04780007
         MVC   TESTNBR,=C'TEST060E'                                     04790007
*                                                                       04800007
TEST060E IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E),             C04810007
               OR,(CLI,VARBL3,C'C',E)                                   04820007
           MVC   ACTOUT,=C'TRUE '                                       04830007
         ELSE                                                           04840007
           MVC   ACTOUT,=C'FALSE'                                       04850007
         ENDIF                                                          04860007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  04870007
           MVC   ERROR,=C'<=== ERROR'                                   04880007
         ENDIF                                                          04890007
         PUT   SYSPRINT,OUTPUT                                          04900007
         MVC   ERROR,=CL10' '                                           04910007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 04920007
         MVI   VARBL1,C'Z'         SET TO FAIL                          04930007
         MVI   VARBL2,C'B'         SET TO PASS                          04940007
         MVI   VARBL3,C'Z'         SET TO FAIL                          04950007
         MVC   PREDOUT,=C'TRUE '                                        04960007
         MVC   TESTNBR,=C'TEST060F'                                     04970007
*                                                                       04980007
TEST060F IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E),             C04990007
               OR,(CLI,VARBL3,C'C',E)                                   05000007
           MVC   ACTOUT,=C'TRUE '                                       05010007
         ELSE                                                           05020007
           MVC   ACTOUT,=C'FALSE'                                       05030007
         ENDIF                                                          05040007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  05050007
           MVC   ERROR,=C'<=== ERROR'                                   05060007
         ENDIF                                                          05070007
         PUT   SYSPRINT,OUTPUT                                          05080007
         MVC   ERROR,=CL10' '                                           05090007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 05100007
         MVI   VARBL1,C'A'         SET TO PASS                          05110007
         MVI   VARBL2,C'Z'         SET TO FAIL                          05120007
         MVI   VARBL3,C'Z'         SET TO FAIL                          05130007
         MVC   PREDOUT,=C'TRUE '                                        05140007
         MVC   TESTNBR,=C'TEST060G'                                     05150007
*                                                                       05160007
TEST060G IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E),             C05170007
               OR,(CLI,VARBL3,C'C',E)                                   05180007
           MVC   ACTOUT,=C'TRUE '                                       05190007
         ELSE                                                           05200007
           MVC   ACTOUT,=C'FALSE'                                       05210007
         ENDIF                                                          05220007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  05230007
           MVC   ERROR,=C'<=== ERROR'                                   05240007
         ENDIF                                                          05250007
         PUT   SYSPRINT,OUTPUT                                          05260007
         MVC   ERROR,=CL10' '                                           05270007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 05280007
         MVI   VARBL1,C'Z'         SET TO FAIL                          05290007
         MVI   VARBL2,C'Z'         SET TO FAIL                          05300007
         MVI   VARBL3,C'Z'         SET TO FAIL                          05310007
         MVC   PREDOUT,=C'FALSE'                                        05320007
         MVC   TESTNBR,=C'TEST060H'                                     05330007
*                                                                       05340007
TEST060H IF    (CLI,VARBL1,C'A',E),OR,(CLI,VARBL2,C'B',E),             C05350007
               OR,(CLI,VARBL3,C'C',E)                                   05360007
           MVC   ACTOUT,=C'TRUE '                                       05370007
         ELSE                                                           05380007
           MVC   ACTOUT,=C'FALSE'                                       05390007
         ENDIF                                                          05400007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  05410007
           MVC   ERROR,=C'<=== ERROR'                                   05420007
         ENDIF                                                          05430007
         PUT   SYSPRINT,OUTPUT                                          05440007
         MVC   ERROR,=CL10' '                                           05450007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 05460007
*                                                                     * 05470007
* IF (A) AND (B) OR (C)                                               * 05480007
*                                                                     * 05490007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 05500007
*                                                                       05510007
         MVI   VARBL1,C'A'         SET TO PASS                          05540007
         MVI   VARBL2,C'B'         SET TO PASS                          05550007
         MVI   VARBL3,C'C'         SET TO PASS                          05560007
         MVC   PREDOUT,=C'TRUE '                                        05570007
         MVC   TESTNBR,=C'TEST070A'                                     05580007
*                                                                       05590007
TEST070A IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C05600007
               OR,(CLI,VARBL3,C'C',E)                                   05610007
           MVC   ACTOUT,=C'TRUE '                                       05620007
         ELSE                                                           05630007
           MVC   ACTOUT,=C'FALSE'                                       05640007
         ENDIF                                                          05650007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  05660007
           MVC   ERROR,=C'<=== ERROR'                                   05670007
         ENDIF                                                          05680007
         PUT   SYSPRINT,OUTPUT                                          05690007
         MVC   ERROR,=CL10' '                                           05700007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 05710007
         MVI   VARBL1,C'Z'         SET TO FAIL                          05720007
         MVI   VARBL2,C'B'         SET TO PASS                          05730007
         MVI   VARBL3,C'C'         SET TO PASS                          05740007
         MVC   PREDOUT,=C'TRUE '                                        05750007
         MVC   TESTNBR,=C'TEST070B'                                     05760007
*                                                                       05770007
TEST070B IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C05780007
               OR,(CLI,VARBL3,C'C',E)                                   05790007
           MVC   ACTOUT,=C'TRUE '                                       05800007
         ELSE                                                           05810007
           MVC   ACTOUT,=C'FALSE'                                       05820007
         ENDIF                                                          05830007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  05840007
           MVC   ERROR,=C'<=== ERROR'                                   05850007
         ENDIF                                                          05860007
         PUT   SYSPRINT,OUTPUT                                          05870007
         MVC   ERROR,=CL10' '                                           05880007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 05890007
         MVI   VARBL1,C'A'         SET TO PASS                          05900007
         MVI   VARBL2,C'Z'         SET TO FAIL                          05910007
         MVI   VARBL3,C'C'         SET TO PASS                          05920007
         MVC   PREDOUT,=C'TRUE '                                        05930007
         MVC   TESTNBR,=C'TEST070C'                                     05940007
*                                                                       05950007
TEST070C IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C05960007
               OR,(CLI,VARBL3,C'C',E)                                   05970007
           MVC   ACTOUT,=C'TRUE '                                       05980007
         ELSE                                                           05990007
           MVC   ACTOUT,=C'FALSE'                                       06000007
         ENDIF                                                          06010007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  06020007
           MVC   ERROR,=C'<=== ERROR'                                   06030007
         ENDIF                                                          06040007
         PUT   SYSPRINT,OUTPUT                                          06050007
         MVC   ERROR,=CL10' '                                           06060007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 06070007
         BALR  R12,0                                                    06071016
         USING *,R12                                                    06072016
         MVI   VARBL1,C'Z'         SET TO FAIL                          06080007
         MVI   VARBL2,C'Z'         SET TO FAIL                          06090007
         MVI   VARBL3,C'C'         SET TO PASS                          06100007
         MVC   PREDOUT,=C'TRUE '                                        06110007
         MVC   TESTNBR,=C'TEST070D'                                     06120007
*                                                                       06130007
TEST070D IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C06140007
               OR,(CLI,VARBL3,C'C',E)                                   06150007
           MVC   ACTOUT,=C'TRUE '                                       06160007
         ELSE                                                           06170007
           MVC   ACTOUT,=C'FALSE'                                       06180007
         ENDIF                                                          06190007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  06200007
           MVC   ERROR,=C'<=== ERROR'                                   06210007
         ENDIF                                                          06220007
         PUT   SYSPRINT,OUTPUT                                          06230007
         MVC   ERROR,=CL10' '                                           06240007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 06250007
         MVI   VARBL1,C'A'         SET TO PASS                          06260007
         MVI   VARBL2,C'B'         SET TO PASS                          06270007
         MVI   VARBL3,C'Z'         SET TO FAIL                          06280007
         MVC   PREDOUT,=C'TRUE '                                        06290007
         MVC   TESTNBR,=C'TEST070E'                                     06300007
*                                                                       06310007
TEST070E IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C06320007
               OR,(CLI,VARBL3,C'C',E)                                   06330007
           MVC   ACTOUT,=C'TRUE '                                       06340007
         ELSE                                                           06350007
           MVC   ACTOUT,=C'FALSE'                                       06360007
         ENDIF                                                          06370007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  06380007
           MVC   ERROR,=C'<=== ERROR'                                   06390007
         ENDIF                                                          06400007
         PUT   SYSPRINT,OUTPUT                                          06410007
         MVC   ERROR,=CL10' '                                           06420007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 06430007
         MVI   VARBL1,C'Z'         SET TO FAIL                          06440007
         MVI   VARBL2,C'B'         SET TO PASS                          06450007
         MVI   VARBL3,C'Z'         SET TO FAIL                          06460007
         MVC   PREDOUT,=C'FALSE'                                        06470007
         MVC   TESTNBR,=C'TEST070F'                                     06480007
*                                                                       06490007
TEST070F IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C06500007
               OR,(CLI,VARBL3,C'C',E)                                   06510007
           MVC   ACTOUT,=C'TRUE '                                       06520007
         ELSE                                                           06530007
           MVC   ACTOUT,=C'FALSE'                                       06540007
         ENDIF                                                          06550007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  06560007
           MVC   ERROR,=C'<=== ERROR'                                   06570007
         ENDIF                                                          06580007
         PUT   SYSPRINT,OUTPUT                                          06590007
         MVC   ERROR,=CL10' '                                           06600007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 06610007
         MVI   VARBL1,C'A'         SET TO PASS                          06620007
         MVI   VARBL2,C'Z'         SET TO FAIL                          06630007
         MVI   VARBL3,C'Z'         SET TO FAIL                          06640007
         MVC   PREDOUT,=C'FALSE'                                        06650007
         MVC   TESTNBR,=C'TEST070G'                                     06660007
*                                                                       06670007
TEST070G IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C06680007
               OR,(CLI,VARBL3,C'C',E)                                   06690007
           MVC   ACTOUT,=C'TRUE '                                       06700007
         ELSE                                                           06710007
           MVC   ACTOUT,=C'FALSE'                                       06720007
         ENDIF                                                          06730007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  06740007
           MVC   ERROR,=C'<=== ERROR'                                   06750007
         ENDIF                                                          06760007
         PUT   SYSPRINT,OUTPUT                                          06770007
         MVC   ERROR,=CL10' '                                           06780007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 06790007
         MVI   VARBL1,C'Z'         SET TO FAIL                          06800007
         MVI   VARBL2,C'Z'         SET TO FAIL                          06810007
         MVI   VARBL3,C'Z'         SET TO FAIL                          06820007
         MVC   PREDOUT,=C'FALSE'                                        06830007
         MVC   TESTNBR,=C'TEST070H'                                     06840007
*                                                                       06850007
TEST070H IF    (CLI,VARBL1,C'A',E),AND,(CLI,VARBL2,C'B',E),            C06860007
               OR,(CLI,VARBL3,C'C',E)                                   06870007
           MVC   ACTOUT,=C'TRUE '                                       06880007
         ELSE                                                           06890007
           MVC   ACTOUT,=C'FALSE'                                       06900007
         ENDIF                                                          06910007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  06920007
           MVC   ERROR,=C'<=== ERROR'                                   06930007
         ENDIF                                                          06940007
         PUT   SYSPRINT,OUTPUT                                          06950007
         MVC   ERROR,=CL10' '                                           06960007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 06970007
*                                                                     * 06980007
* IF (A) AND ((B) OR (C))                                             * 06990007
*                                                                     * 07000007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 07010007
*                                                                       07020007
         MVI   VARBL1,C'A'         SET TO PASS                          07050007
         MVI   VARBL2,C'B'         SET TO PASS                          07060007
         MVI   VARBL3,C'C'         SET TO PASS                          07070007
         MVC   PREDOUT,=C'TRUE '                                        07080007
         MVC   TESTNBR,=C'TEST080A'                                     07090007
*                                                                       07100007
TEST080A IF    (CLI,VARBL1,C'A',E),AND,                                C07110007
               ((CLI,VARBL2,C'B',E),OR,(CLI,VARBL3,C'C',E))             07120007
           MVC   ACTOUT,=C'TRUE '                                       07130007
         ELSE                                                           07140007
           MVC   ACTOUT,=C'FALSE'                                       07150007
         ENDIF                                                          07160007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  07170007
           MVC   ERROR,=C'<=== ERROR'                                   07180007
         ENDIF                                                          07190007
         PUT   SYSPRINT,OUTPUT                                          07200007
         MVC   ERROR,=CL10' '                                           07210007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 07220007
         MVI   VARBL1,C'Z'         SET TO FAIL                          07230007
         MVI   VARBL2,C'B'         SET TO PASS                          07240007
         MVI   VARBL3,C'C'         SET TO PASS                          07250007
         MVC   PREDOUT,=C'FALSE'                                        07260007
         MVC   TESTNBR,=C'TEST080B'                                     07270007
*                                                                       07280007
TEST080B IF    (CLI,VARBL1,C'A',E),AND,                                C07290007
               ((CLI,VARBL2,C'B',E),OR,(CLI,VARBL3,C'C',E))             07300007
           MVC   ACTOUT,=C'TRUE '                                       07310007
         ELSE                                                           07320007
           MVC   ACTOUT,=C'FALSE'                                       07330007
         ENDIF                                                          07340007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  07350007
           MVC   ERROR,=C'<=== ERROR'                                   07360007
         ENDIF                                                          07370007
         PUT   SYSPRINT,OUTPUT                                          07380007
         MVC   ERROR,=CL10' '                                           07390007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 07400007
         MVI   VARBL1,C'A'         SET TO PASS                          07410007
         MVI   VARBL2,C'Z'         SET TO FAIL                          07420007
         MVI   VARBL3,C'C'         SET TO PASS                          07430007
         MVC   PREDOUT,=C'TRUE '                                        07440007
         MVC   TESTNBR,=C'TEST080C'                                     07450007
*                                                                       07460007
TEST080C IF    (CLI,VARBL1,C'A',E),AND,                                C07470007
               ((CLI,VARBL2,C'B',E),OR,(CLI,VARBL3,C'C',E))             07480007
           MVC   ACTOUT,=C'TRUE '                                       07490007
         ELSE                                                           07500007
           MVC   ACTOUT,=C'FALSE'                                       07510007
         ENDIF                                                          07520007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  07530007
           MVC   ERROR,=C'<=== ERROR'                                   07540007
         ENDIF                                                          07550007
         PUT   SYSPRINT,OUTPUT                                          07560007
         MVC   ERROR,=CL10' '                                           07570007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 07580007
         MVI   VARBL1,C'Z'         SET TO FAIL                          07590007
         MVI   VARBL2,C'Z'         SET TO FAIL                          07600007
         MVI   VARBL3,C'C'         SET TO PASS                          07610007
         MVC   PREDOUT,=C'FALSE'                                        07620007
         MVC   TESTNBR,=C'TEST080D'                                     07630007
*                                                                       07640007
TEST080D IF    (CLI,VARBL1,C'A',E),AND,                                C07650007
               ((CLI,VARBL2,C'B',E),OR,(CLI,VARBL3,C'C',E))             07660007
           MVC   ACTOUT,=C'TRUE '                                       07670007
         ELSE                                                           07680007
           MVC   ACTOUT,=C'FALSE'                                       07690007
         ENDIF                                                          07700007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  07710007
           MVC   ERROR,=C'<=== ERROR'                                   07720007
         ENDIF                                                          07730007
         PUT   SYSPRINT,OUTPUT                                          07740007
         MVC   ERROR,=CL10' '                                           07750007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 07760007
         MVI   VARBL1,C'A'         SET TO PASS                          07770007
         MVI   VARBL2,C'B'         SET TO PASS                          07780007
         MVI   VARBL3,C'Z'         SET TO FAIL                          07790007
         MVC   PREDOUT,=C'TRUE '                                        07800007
         MVC   TESTNBR,=C'TEST080E'                                     07810007
*                                                                       07820007
TEST080E IF    (CLI,VARBL1,C'A',E),AND,                                C07830007
               ((CLI,VARBL2,C'B',E),OR,(CLI,VARBL3,C'C',E))             07840007
           MVC   ACTOUT,=C'TRUE '                                       07850007
         ELSE                                                           07860007
           MVC   ACTOUT,=C'FALSE'                                       07870007
         ENDIF                                                          07880007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  07890007
           MVC   ERROR,=C'<=== ERROR'                                   07900007
         ENDIF                                                          07910007
         PUT   SYSPRINT,OUTPUT                                          07920007
         MVC   ERROR,=CL10' '                                           07930007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 07940007
         MVI   VARBL1,C'Z'         SET TO FAIL                          07950007
         MVI   VARBL2,C'B'         SET TO PASS                          07960007
         MVI   VARBL3,C'Z'         SET TO FAIL                          07970007
         MVC   PREDOUT,=C'FALSE'                                        07980007
         MVC   TESTNBR,=C'TEST080F'                                     07990007
*                                                                       08000007
TEST080F IF    (CLI,VARBL1,C'A',E),AND,                                C08010007
               ((CLI,VARBL2,C'B',E),OR,(CLI,VARBL3,C'C',E))             08020007
           MVC   ACTOUT,=C'TRUE '                                       08030007
         ELSE                                                           08040007
           MVC   ACTOUT,=C'FALSE'                                       08050007
         ENDIF                                                          08060007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  08070007
           MVC   ERROR,=C'<=== ERROR'                                   08080007
         ENDIF                                                          08090007
         PUT   SYSPRINT,OUTPUT                                          08100007
         MVC   ERROR,=CL10' '                                           08110007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 08120007
         MVI   VARBL1,C'A'         SET TO PASS                          08130007
         MVI   VARBL2,C'Z'         SET TO FAIL                          08140007
         MVI   VARBL3,C'Z'         SET TO FAIL                          08150007
         MVC   PREDOUT,=C'FALSE'                                        08160007
         MVC   TESTNBR,=C'TEST080G'                                     08170007
*                                                                       08180007
TEST080G IF    (CLI,VARBL1,C'A',E),AND,                                C08190007
               ((CLI,VARBL2,C'B',E),OR,(CLI,VARBL3,C'C',E))             08200007
           MVC   ACTOUT,=C'TRUE '                                       08210007
         ELSE                                                           08220007
           MVC   ACTOUT,=C'FALSE'                                       08230007
         ENDIF                                                          08240007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  08250007
           MVC   ERROR,=C'<=== ERROR'                                   08260007
         ENDIF                                                          08270007
         PUT   SYSPRINT,OUTPUT                                          08280007
         MVC   ERROR,=CL10' '                                           08290007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 08300007
         MVI   VARBL1,C'Z'         SET TO FAIL                          08310007
         MVI   VARBL2,C'Z'         SET TO FAIL                          08320007
         MVI   VARBL3,C'Z'         SET TO FAIL                          08330007
         MVC   PREDOUT,=C'FALSE'                                        08340007
         MVC   TESTNBR,=C'TEST080H'                                     08350007
*                                                                       08360007
TEST080H IF    (CLI,VARBL1,C'A',E),AND,                                C08370007
               ((CLI,VARBL2,C'B',E),OR,(CLI,VARBL3,C'C',E))             08380007
           MVC   ACTOUT,=C'TRUE '                                       08390007
         ELSE                                                           08400007
           MVC   ACTOUT,=C'FALSE'                                       08410007
         ENDIF                                                          08420007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  08430007
           MVC   ERROR,=C'<=== ERROR'                                   08440007
         ENDIF                                                          08450007
         PUT   SYSPRINT,OUTPUT                                          08460007
         MVC   ERROR,=CL10' '                                           08470007
*                                                                       08480007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 08490007
*                                                                     * 08500007
* IF (A) AND (B) OR (C) AND (D)                                       * 08510007
*                                                                     * 08520007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 08530007
*                                                                       08540007
         BALR  R12,0                                                    08550016
         USING *,R12                                                    08560016
         MVI   VARBL1,C'A'         SET TO PASS                          08570007
         LA    R15,0               SET TO PASS                          08580007
         MVI   VARBL3,X'00'        SET TO PASS                          08590007
         PACK  PACK1,=Z'1'         SET TO PASS                          08600007
         MVC   PREDOUT,=C'TRUE '                                        08610007
         MVC   TESTNBR,=C'TEST090A'                                     08620007
*                                                                       08630007
TEST090A IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C08640007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               08650007
           MVC   ACTOUT,=C'TRUE '                                       08660007
         ELSE                                                           08670007
           MVC   ACTOUT,=C'FALSE'                                       08680007
         ENDIF                                                          08690007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  08700007
           MVC   ERROR,=C'<=== ERROR'                                   08710007
         ENDIF                                                          08720007
         PUT   SYSPRINT,OUTPUT                                          08730007
         MVC   ERROR,=CL10' '                                           08740007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 08750007
         MVI   VARBL1,C'Z'         SET TO FAIL                          08760007
         LA    R15,0               SET TO PASS                          08770007
         MVI   VARBL3,X'00'        SET TO PASS                          08780007
         PACK  PACK1,=Z'1'         SET TO PASS                          08790007
         MVC   PREDOUT,=C'TRUE '                                        08800007
         MVC   TESTNBR,=C'TEST090B'                                     08810007
*                                                                       08820007
TEST090B IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C08830007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               08840007
           MVC   ACTOUT,=C'TRUE '                                       08850007
         ELSE                                                           08860007
           MVC   ACTOUT,=C'FALSE'                                       08870007
         ENDIF                                                          08880007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  08890007
           MVC   ERROR,=C'<=== ERROR'                                   08900007
         ENDIF                                                          08910007
         PUT   SYSPRINT,OUTPUT                                          08920007
         MVC   ERROR,=CL10' '                                           08930007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 08940007
         MVI   VARBL1,C'A'         SET TO PASS                          08950007
         LA    R15,4               SET TO FAIL                          08960007
         MVI   VARBL3,X'00'        SET TO PASS                          08970007
         PACK  PACK1,=Z'1'         SET TO PASS                          08980007
         MVC   PREDOUT,=C'TRUE '                                        08990007
         MVC   TESTNBR,=C'TEST090C'                                     09000007
*                                                                       09010007
TEST090C IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C09020007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               09030007
           MVC   ACTOUT,=C'TRUE '                                       09040007
         ELSE                                                           09050007
           MVC   ACTOUT,=C'FALSE'                                       09060007
         ENDIF                                                          09070007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  09080007
           MVC   ERROR,=C'<=== ERROR'                                   09090007
         ENDIF                                                          09100007
         PUT   SYSPRINT,OUTPUT                                          09110007
         MVC   ERROR,=CL10' '                                           09120007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 09130007
         MVI   VARBL1,C'Z'         SET TO FAIL                          09140007
         LA    R15,4               SET TO FAIL                          09150007
         MVI   VARBL3,X'00'        SET TO PASS                          09160007
         PACK  PACK1,=Z'1'         SET TO PASS                          09170007
         MVC   PREDOUT,=C'TRUE '                                        09180007
         MVC   TESTNBR,=C'TEST090D'                                     09190007
*                                                                       09200007
TEST090D IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C09210007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               09220007
           MVC   ACTOUT,=C'TRUE '                                       09230007
         ELSE                                                           09240007
           MVC   ACTOUT,=C'FALSE'                                       09250007
         ENDIF                                                          09260007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  09270007
           MVC   ERROR,=C'<=== ERROR'                                   09280007
         ENDIF                                                          09290007
         PUT   SYSPRINT,OUTPUT                                          09300007
         MVC   ERROR,=CL10' '                                           09310007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 09320007
         MVI   VARBL1,C'A'         SET TO PASS                          09330007
         LA    R15,0               SET TO PASS                          09340007
         MVI   VARBL3,X'01'        SET TO FAIL                          09350007
         PACK  PACK1,=Z'1'         SET TO PASS                          09360007
         MVC   PREDOUT,=C'TRUE '                                        09370007
         MVC   TESTNBR,=C'TEST090E'                                     09380007
*                                                                       09390007
TEST090E IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C09400007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               09410007
           MVC   ACTOUT,=C'TRUE '                                       09420007
         ELSE                                                           09430007
           MVC   ACTOUT,=C'FALSE'                                       09440007
         ENDIF                                                          09450007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  09460007
           MVC   ERROR,=C'<=== ERROR'                                   09470007
         ENDIF                                                          09480007
         PUT   SYSPRINT,OUTPUT                                          09490007
         MVC   ERROR,=CL10' '                                           09500007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 09510007
         MVI   VARBL1,C'Z'         SET TO FAIL                          09520007
         LA    R15,0               SET TO PASS                          09530007
         MVI   VARBL3,X'01'        SET TO FAIL                          09540007
         PACK  PACK1,=Z'1'         SET TO PASS                          09550007
         MVC   PREDOUT,=C'FALSE'                                        09560007
         MVC   TESTNBR,=C'TEST090F'                                     09570007
*                                                                       09580007
TEST090F IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C09590007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               09600007
           MVC   ACTOUT,=C'TRUE '                                       09610007
         ELSE                                                           09620007
           MVC   ACTOUT,=C'FALSE'                                       09630007
         ENDIF                                                          09640007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  09650007
           MVC   ERROR,=C'<=== ERROR'                                   09660007
         ENDIF                                                          09670007
         PUT   SYSPRINT,OUTPUT                                          09680007
         MVC   ERROR,=CL10' '                                           09690007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 09700007
         MVI   VARBL1,C'A'         SET TO PASS                          09710007
         LA    R15,4               SET TO FAIL                          09720007
         MVI   VARBL3,X'01'        SET TO FAIL                          09730007
         PACK  PACK1,=Z'1'         SET TO PASS                          09740007
         MVC   PREDOUT,=C'FALSE'                                        09750007
         MVC   TESTNBR,=C'TEST090G'                                     09760007
*                                                                       09770007
TEST090G IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C09780007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               09790007
           MVC   ACTOUT,=C'TRUE '                                       09800007
         ELSE                                                           09810007
           MVC   ACTOUT,=C'FALSE'                                       09820007
         ENDIF                                                          09830007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  09840007
           MVC   ERROR,=C'<=== ERROR'                                   09850007
         ENDIF                                                          09860007
         PUT   SYSPRINT,OUTPUT                                          09870007
         MVC   ERROR,=CL10' '                                           09880007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 09890007
         MVI   VARBL1,C'Z'         SET TO FAIL                          09900007
         LA    R15,4               SET TO FAIL                          09910007
         MVI   VARBL3,X'01'        SET TO FAIL                          09920007
         PACK  PACK1,=Z'1'         SET TO PASS                          09930007
         MVC   PREDOUT,=C'FALSE'                                        09940007
         MVC   TESTNBR,=C'TEST090H'                                     09950007
*                                                                       09960007
TEST090H IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C09970007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               09980007
           MVC   ACTOUT,=C'TRUE '                                       09990007
         ELSE                                                           10000007
           MVC   ACTOUT,=C'FALSE'                                       10010007
         ENDIF                                                          10020007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  10030007
           MVC   ERROR,=C'<=== ERROR'                                   10040007
         ENDIF                                                          10050007
         PUT   SYSPRINT,OUTPUT                                          10060007
         MVC   ERROR,=CL10' '                                           10070007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 10080007
         MVI   VARBL1,C'A'         SET TO PASS                          10090007
         LA    R15,0               SET TO PASS                          10100007
         MVI   VARBL3,X'00'        SET TO PASS                          10110007
         PACK  PACK1,=Z'2'         SET TO FAIL                          10120007
         MVC   PREDOUT,=C'TRUE '                                        10130007
         MVC   TESTNBR,=C'TEST090I'                                     10140007
*                                                                       10150007
TEST090I IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C10160007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               10170007
           MVC   ACTOUT,=C'TRUE '                                       10180007
         ELSE                                                           10190007
           MVC   ACTOUT,=C'FALSE'                                       10200007
         ENDIF                                                          10210007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  10220007
           MVC   ERROR,=C'<=== ERROR'                                   10230007
         ENDIF                                                          10240007
         PUT   SYSPRINT,OUTPUT                                          10250007
         MVC   ERROR,=CL10' '                                           10260007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 10270007
         MVI   VARBL1,C'Z'         SET TO FAIL                          10280007
         LA    R15,0               SET TO PASS                          10290007
         MVI   VARBL3,X'00'        SET TO PASS                          10300007
         PACK  PACK1,=Z'2'         SET TO FAIL                          10310007
         MVC   PREDOUT,=C'FALSE'                                        10320007
         MVC   TESTNBR,=C'TEST090J'                                     10330007
*                                                                       10340007
TEST090J IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C10350007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               10360007
           MVC   ACTOUT,=C'TRUE '                                       10370007
         ELSE                                                           10380007
           MVC   ACTOUT,=C'FALSE'                                       10390007
         ENDIF                                                          10400007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  10410007
           MVC   ERROR,=C'<=== ERROR'                                   10420007
         ENDIF                                                          10430007
         PUT   SYSPRINT,OUTPUT                                          10440007
         MVC   ERROR,=CL10' '                                           10450007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 10460007
         MVI   VARBL1,C'A'         SET TO PASS                          10470007
         LA    R15,4               SET TO FAIL                          10480007
         MVI   VARBL3,X'00'        SET TO PASS                          10490007
         PACK  PACK1,=Z'2'         SET TO FAIL                          10500007
         MVC   PREDOUT,=C'FALSE'                                        10510007
         MVC   TESTNBR,=C'TEST090K'                                     10520007
*                                                                       10530007
TEST090K IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C10540007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               10550007
           MVC   ACTOUT,=C'TRUE '                                       10560007
         ELSE                                                           10570007
           MVC   ACTOUT,=C'FALSE'                                       10580007
         ENDIF                                                          10590007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  10600007
           MVC   ERROR,=C'<=== ERROR'                                   10610007
         ENDIF                                                          10620007
         PUT   SYSPRINT,OUTPUT                                          10630007
         MVC   ERROR,=CL10' '                                           10640007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 10650007
         MVI   VARBL1,C'Z'         SET TO FAIL                          10660007
         LA    R15,4               SET TO FAIL                          10670007
         MVI   VARBL3,X'00'        SET TO PASS                          10680007
         PACK  PACK1,=Z'2'         SET TO FAIL                          10690007
         MVC   PREDOUT,=C'FALSE'                                        10700007
         MVC   TESTNBR,=C'TEST090L'                                     10710007
*                                                                       10720007
TEST090L IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C10730007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               10740007
           MVC   ACTOUT,=C'TRUE '                                       10750007
         ELSE                                                           10760007
           MVC   ACTOUT,=C'FALSE'                                       10770007
         ENDIF                                                          10780007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  10790007
           MVC   ERROR,=C'<=== ERROR'                                   10800007
         ENDIF                                                          10810007
         PUT   SYSPRINT,OUTPUT                                          10820007
         MVC   ERROR,=CL10' '                                           10830007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 10840007
         MVI   VARBL1,C'A'         SET TO PASS                          10850007
         LA    R15,0               SET TO PASS                          10860007
         MVI   VARBL3,X'01'        SET TO FAIL                          10870007
         PACK  PACK1,=Z'2'         SET TO FAIL                          10880007
         MVC   PREDOUT,=C'TRUE '                                        10890007
         MVC   TESTNBR,=C'TEST090M'                                     10900007
*                                                                       10910007
TEST090M IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C10920007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               10930007
           MVC   ACTOUT,=C'TRUE '                                       10940007
         ELSE                                                           10950007
           MVC   ACTOUT,=C'FALSE'                                       10960007
         ENDIF                                                          10970007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  10980007
           MVC   ERROR,=C'<=== ERROR'                                   10990007
         ENDIF                                                          11000007
         PUT   SYSPRINT,OUTPUT                                          11010007
         MVC   ERROR,=CL10' '                                           11020007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 11030007
         MVI   VARBL1,C'Z'         SET TO FAIL                          11040007
         LA    R15,0               SET TO PASS                          11050007
         MVI   VARBL3,X'01'        SET TO FAIL                          11060007
         PACK  PACK1,=Z'2'         SET TO FAIL                          11070007
         MVC   PREDOUT,=C'FALSE'                                        11080007
         MVC   TESTNBR,=C'TEST090N'                                     11090007
*                                                                       11100007
TEST090N IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C11110007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               11120007
           MVC   ACTOUT,=C'TRUE '                                       11130007
         ELSE                                                           11140007
           MVC   ACTOUT,=C'FALSE'                                       11150007
         ENDIF                                                          11160007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  11170007
           MVC   ERROR,=C'<=== ERROR'                                   11180007
         ENDIF                                                          11190007
         PUT   SYSPRINT,OUTPUT                                          11200007
         MVC   ERROR,=CL10' '                                           11210007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 11220007
         MVI   VARBL1,C'A'         SET TO PASS                          11230007
         LA    R15,4               SET TO FAIL                          11240007
         MVI   VARBL3,X'01'        SET TO FAIL                          11250007
         PACK  PACK1,=Z'2'         SET TO FAIL                          11260007
         MVC   PREDOUT,=C'FALSE'                                        11270007
         MVC   TESTNBR,=C'TEST090O'                                     11280007
*                                                                       11290007
TEST090O IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C11300007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               11310007
           MVC   ACTOUT,=C'TRUE '                                       11320007
         ELSE                                                           11330007
           MVC   ACTOUT,=C'FALSE'                                       11340007
         ENDIF                                                          11350007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  11360007
           MVC   ERROR,=C'<=== ERROR'                                   11370007
         ENDIF                                                          11380007
         PUT   SYSPRINT,OUTPUT                                          11390007
         MVC   ERROR,=CL10' '                                           11400007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 11410007
         MVI   VARBL1,C'Z'         SET TO FAIL                          11420007
         LA    R15,4               SET TO FAIL                          11430007
         MVI   VARBL3,X'01'        SET TO FAIL                          11440007
         PACK  PACK1,=Z'2'         SET TO FAIL                          11450007
         MVC   PREDOUT,=C'FALSE'                                        11460007
         MVC   TESTNBR,=C'TEST090P'                                     11470007
*                                                                       11480007
TEST090P IF    (CLI,VARBL1,C'A',E),AND,(LTR,R15,R15,Z),OR,             C11490007
               (TM,VARBL3,X'01',Z),AND,(SP,PACK1,=P'1',Z)               11500007
           MVC   ACTOUT,=C'TRUE '                                       11510007
         ELSE                                                           11520007
           MVC   ACTOUT,=C'FALSE'                                       11530007
         ENDIF                                                          11540007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  11550007
           MVC   ERROR,=C'<=== ERROR'                                   11560007
         ENDIF                                                          11570007
         PUT   SYSPRINT,OUTPUT                                          11580007
         MVC   ERROR,=CL10' '                                           11590007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 11600007
*                                                                     * 11610007
* IF (A) AND ((B) OR (C)) AND (D)                                     * 11620007
*                                                                     * 11630007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 11640007
*                                                                       11650007
         BALR  R12,0                                                    11660016
         USING *,R12                                                    11670016
         MVI   VARBL1,C'A'         SET TO PASS                          11680007
         LA    R15,0               SET TO PASS                          11690007
         MVI   VARBL3,X'00'        SET TO PASS                          11700007
         PACK  PACK1,=Z'1'         SET TO PASS                          11710007
         MVC   PREDOUT,=C'TRUE '                                        11720007
         MVC   TESTNBR,=C'TEST100A'                                     11730007
*                                                                       11740007
TEST100A IF    (CLI,VARBL1,C'A',E),AND,                                C11750007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C11760007
               (SP,PACK1,=P'1',Z)                                       11770007
           MVC   ACTOUT,=C'TRUE '                                       11780007
         ELSE                                                           11790007
           MVC   ACTOUT,=C'FALSE'                                       11800007
         ENDIF                                                          11810007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  11820007
           MVC   ERROR,=C'<=== ERROR'                                   11830007
         ENDIF                                                          11840007
         PUT   SYSPRINT,OUTPUT                                          11850007
         MVC   ERROR,=CL10' '                                           11860007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 11870007
         MVI   VARBL1,C'Z'         SET TO FAIL                          11880007
         LA    R15,0               SET TO PASS                          11890007
         MVI   VARBL3,X'00'        SET TO PASS                          11900007
         PACK  PACK1,=Z'1'         SET TO PASS                          11910007
         MVC   PREDOUT,=C'FALSE'                                        11920007
         MVC   TESTNBR,=C'TEST100B'                                     11930007
*                                                                       11940007
TEST100B IF    (CLI,VARBL1,C'A',E),AND,                                C11950007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C11960007
               (SP,PACK1,=P'1',Z)                                       11970007
           MVC   ACTOUT,=C'TRUE '                                       11980007
         ELSE                                                           11990007
           MVC   ACTOUT,=C'FALSE'                                       12000007
         ENDIF                                                          12010007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  12020007
           MVC   ERROR,=C'<=== ERROR'                                   12030007
         ENDIF                                                          12040007
         PUT   SYSPRINT,OUTPUT                                          12050007
         MVC   ERROR,=CL10' '                                           12060007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 12070007
         MVI   VARBL1,C'A'         SET TO PASS                          12080007
         LA    R15,4               SET TO FAIL                          12090007
         MVI   VARBL3,X'00'        SET TO PASS                          12100007
         PACK  PACK1,=Z'1'         SET TO PASS                          12110007
         MVC   PREDOUT,=C'TRUE '                                        12120007
         MVC   TESTNBR,=C'TEST100C'                                     12130007
*                                                                       12140007
TEST100C IF    (CLI,VARBL1,C'A',E),AND,                                C12150007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C12160007
               (SP,PACK1,=P'1',Z)                                       12170007
           MVC   ACTOUT,=C'TRUE '                                       12180007
         ELSE                                                           12190007
           MVC   ACTOUT,=C'FALSE'                                       12200007
         ENDIF                                                          12210007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  12220007
           MVC   ERROR,=C'<=== ERROR'                                   12230007
         ENDIF                                                          12240007
         PUT   SYSPRINT,OUTPUT                                          12250007
         MVC   ERROR,=CL10' '                                           12260007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 12270007
         MVI   VARBL1,C'Z'         SET TO FAIL                          12280007
         LA    R15,4               SET TO FAIL                          12290007
         MVI   VARBL3,X'00'        SET TO PASS                          12300007
         PACK  PACK1,=Z'1'         SET TO PASS                          12310007
         MVC   PREDOUT,=C'FALSE'                                        12320007
         MVC   TESTNBR,=C'TEST100D'                                     12330007
*                                                                       12340007
TEST100D IF    (CLI,VARBL1,C'A',E),AND,                                C12350007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C12360007
               (SP,PACK1,=P'1',Z)                                       12370007
           MVC   ACTOUT,=C'TRUE '                                       12380007
         ELSE                                                           12390007
           MVC   ACTOUT,=C'FALSE'                                       12400007
         ENDIF                                                          12410007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  12420007
           MVC   ERROR,=C'<=== ERROR'                                   12430007
         ENDIF                                                          12440007
         PUT   SYSPRINT,OUTPUT                                          12450007
         MVC   ERROR,=CL10' '                                           12460007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 12470007
         MVI   VARBL1,C'A'         SET TO PASS                          12480007
         LA    R15,0               SET TO PASS                          12490007
         MVI   VARBL3,X'01'        SET TO FAIL                          12500007
         PACK  PACK1,=Z'1'         SET TO PASS                          12510007
         MVC   PREDOUT,=C'TRUE '                                        12520007
         MVC   TESTNBR,=C'TEST100E'                                     12530007
*                                                                       12540007
TEST100E IF    (CLI,VARBL1,C'A',E),AND,                                C12550007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C12560007
               (SP,PACK1,=P'1',Z)                                       12570007
           MVC   ACTOUT,=C'TRUE '                                       12580007
         ELSE                                                           12590007
           MVC   ACTOUT,=C'FALSE'                                       12600007
         ENDIF                                                          12610007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  12620007
           MVC   ERROR,=C'<=== ERROR'                                   12630007
         ENDIF                                                          12640007
         PUT   SYSPRINT,OUTPUT                                          12650007
         MVC   ERROR,=CL10' '                                           12660007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 12670007
         MVI   VARBL1,C'Z'         SET TO FAIL                          12680007
         LA    R15,0               SET TO PASS                          12690007
         MVI   VARBL3,X'01'        SET TO FAIL                          12700007
         PACK  PACK1,=Z'1'         SET TO PASS                          12710007
         MVC   PREDOUT,=C'FALSE'                                        12720007
         MVC   TESTNBR,=C'TEST100F'                                     12730007
*                                                                       12740007
TEST100F IF    (CLI,VARBL1,C'A',E),AND,                                C12750007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C12760007
               (SP,PACK1,=P'1',Z)                                       12770007
           MVC   ACTOUT,=C'TRUE '                                       12780007
         ELSE                                                           12790007
           MVC   ACTOUT,=C'FALSE'                                       12800007
         ENDIF                                                          12810007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  12820007
           MVC   ERROR,=C'<=== ERROR'                                   12830007
         ENDIF                                                          12840007
         PUT   SYSPRINT,OUTPUT                                          12850007
         MVC   ERROR,=CL10' '                                           12860007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 12870007
         MVI   VARBL1,C'A'         SET TO PASS                          12880007
         LA    R15,4               SET TO FAIL                          12890007
         MVI   VARBL3,X'01'        SET TO FAIL                          12900007
         PACK  PACK1,=Z'1'         SET TO PASS                          12910007
         MVC   PREDOUT,=C'FALSE'                                        12920007
         MVC   TESTNBR,=C'TEST100G'                                     12930007
*                                                                       12940007
TEST100G IF    (CLI,VARBL1,C'A',E),AND,                                C12950007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C12960007
               (SP,PACK1,=P'1',Z)                                       12970007
           MVC   ACTOUT,=C'TRUE '                                       12980007
         ELSE                                                           12990007
           MVC   ACTOUT,=C'FALSE'                                       13000007
         ENDIF                                                          13010007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  13020007
           MVC   ERROR,=C'<=== ERROR'                                   13030007
         ENDIF                                                          13040007
         PUT   SYSPRINT,OUTPUT                                          13050007
         MVC   ERROR,=CL10' '                                           13060007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 13070007
         MVI   VARBL1,C'Z'         SET TO FAIL                          13080007
         LA    R15,4               SET TO FAIL                          13090007
         MVI   VARBL3,X'01'        SET TO FAIL                          13100007
         PACK  PACK1,=Z'1'         SET TO PASS                          13110007
         MVC   PREDOUT,=C'FALSE'                                        13120007
         MVC   TESTNBR,=C'TEST100H'                                     13130007
*                                                                       13140007
TEST100H IF    (CLI,VARBL1,C'A',E),AND,                                C13150007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C13160007
               (SP,PACK1,=P'1',Z)                                       13170007
           MVC   ACTOUT,=C'TRUE '                                       13180007
         ELSE                                                           13190007
           MVC   ACTOUT,=C'FALSE'                                       13200007
         ENDIF                                                          13210007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  13220007
           MVC   ERROR,=C'<=== ERROR'                                   13230007
         ENDIF                                                          13240007
         PUT   SYSPRINT,OUTPUT                                          13250007
         MVC   ERROR,=CL10' '                                           13260007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 13270007
         MVI   VARBL1,C'A'         SET TO PASS                          13280007
         LA    R15,0               SET TO PASS                          13290007
         MVI   VARBL3,X'00'        SET TO PASS                          13300007
         PACK  PACK1,=Z'2'         SET TO FAIL                          13310007
         MVC   PREDOUT,=C'FALSE'                                        13320007
         MVC   TESTNBR,=C'TEST100I'                                     13330007
*                                                                       13340007
TEST100I IF    (CLI,VARBL1,C'A',E),AND,                                C13350007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C13360007
               (SP,PACK1,=P'1',Z)                                       13370007
           MVC   ACTOUT,=C'TRUE '                                       13380007
         ELSE                                                           13390007
           MVC   ACTOUT,=C'FALSE'                                       13400007
         ENDIF                                                          13410007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  13420007
           MVC   ERROR,=C'<=== ERROR'                                   13430007
         ENDIF                                                          13440007
         PUT   SYSPRINT,OUTPUT                                          13450007
         MVC   ERROR,=CL10' '                                           13460007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 13470007
         MVI   VARBL1,C'Z'         SET TO FAIL                          13480007
         LA    R15,0               SET TO PASS                          13490007
         MVI   VARBL3,X'00'        SET TO PASS                          13500007
         PACK  PACK1,=Z'2'         SET TO FAIL                          13510007
         MVC   PREDOUT,=C'FALSE'                                        13520007
         MVC   TESTNBR,=C'TEST100J'                                     13530007
*                                                                       13540007
TEST100J IF    (CLI,VARBL1,C'A',E),AND,                                C13550007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C13560007
               (SP,PACK1,=P'1',Z)                                       13570007
           MVC   ACTOUT,=C'TRUE '                                       13580007
         ELSE                                                           13590007
           MVC   ACTOUT,=C'FALSE'                                       13600007
         ENDIF                                                          13610007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  13620007
           MVC   ERROR,=C'<=== ERROR'                                   13630007
         ENDIF                                                          13640007
         PUT   SYSPRINT,OUTPUT                                          13650007
         MVC   ERROR,=CL10' '                                           13660007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 13670007
         MVI   VARBL1,C'A'         SET TO PASS                          13680007
         LA    R15,4               SET TO FAIL                          13690007
         MVI   VARBL3,X'00'        SET TO PASS                          13700007
         PACK  PACK1,=Z'2'         SET TO FAIL                          13710007
         MVC   PREDOUT,=C'FALSE'                                        13720007
         MVC   TESTNBR,=C'TEST100K'                                     13730007
*                                                                       13740007
TEST100K IF    (CLI,VARBL1,C'A',E),AND,                                C13750007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C13760007
               (SP,PACK1,=P'1',Z)                                       13770007
           MVC   ACTOUT,=C'TRUE '                                       13780007
         ELSE                                                           13790007
           MVC   ACTOUT,=C'FALSE'                                       13800007
         ENDIF                                                          13810007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  13820007
           MVC   ERROR,=C'<=== ERROR'                                   13830007
         ENDIF                                                          13840007
         PUT   SYSPRINT,OUTPUT                                          13850007
         MVC   ERROR,=CL10' '                                           13860007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 13870007
         MVI   VARBL1,C'Z'         SET TO FAIL                          13880007
         LA    R15,4               SET TO FAIL                          13890007
         MVI   VARBL3,X'00'        SET TO PASS                          13900007
         PACK  PACK1,=Z'2'         SET TO FAIL                          13910007
         MVC   PREDOUT,=C'FALSE'                                        13920007
         MVC   TESTNBR,=C'TEST100L'                                     13930007
*                                                                       13940007
TEST100L IF    (CLI,VARBL1,C'A',E),AND,                                C13950007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C13960007
               (SP,PACK1,=P'1',Z)                                       13970007
           MVC   ACTOUT,=C'TRUE '                                       13980007
         ELSE                                                           13990007
           MVC   ACTOUT,=C'FALSE'                                       14000007
         ENDIF                                                          14010007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  14020007
           MVC   ERROR,=C'<=== ERROR'                                   14030007
         ENDIF                                                          14040007
         PUT   SYSPRINT,OUTPUT                                          14050007
         MVC   ERROR,=CL10' '                                           14060007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 14070007
         MVI   VARBL1,C'A'         SET TO PASS                          14080007
         LA    R15,0               SET TO PASS                          14090007
         MVI   VARBL3,X'01'        SET TO FAIL                          14100007
         PACK  PACK1,=Z'2'         SET TO FAIL                          14110007
         MVC   PREDOUT,=C'FALSE'                                        14120007
         MVC   TESTNBR,=C'TEST100M'                                     14130007
*                                                                       14140007
TEST100M IF    (CLI,VARBL1,C'A',E),AND,                                C14150007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C14160007
               (SP,PACK1,=P'1',Z)                                       14170007
           MVC   ACTOUT,=C'TRUE '                                       14180007
         ELSE                                                           14190007
           MVC   ACTOUT,=C'FALSE'                                       14200007
         ENDIF                                                          14210007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  14220007
           MVC   ERROR,=C'<=== ERROR'                                   14230007
         ENDIF                                                          14240007
         PUT   SYSPRINT,OUTPUT                                          14250007
         MVC   ERROR,=CL10' '                                           14260007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 14270007
         MVI   VARBL1,C'Z'         SET TO FAIL                          14280007
         LA    R15,0               SET TO PASS                          14290007
         MVI   VARBL3,X'01'        SET TO FAIL                          14300007
         PACK  PACK1,=Z'2'         SET TO FAIL                          14310007
         MVC   PREDOUT,=C'FALSE'                                        14320007
         MVC   TESTNBR,=C'TEST100N'                                     14330007
*                                                                       14340007
TEST100N IF    (CLI,VARBL1,C'A',E),AND,                                C14350007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C14360007
               (SP,PACK1,=P'1',Z)                                       14370007
           MVC   ACTOUT,=C'TRUE '                                       14380007
         ELSE                                                           14390007
           MVC   ACTOUT,=C'FALSE'                                       14400007
         ENDIF                                                          14410007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  14420007
           MVC   ERROR,=C'<=== ERROR'                                   14430007
         ENDIF                                                          14440007
         PUT   SYSPRINT,OUTPUT                                          14450007
         MVC   ERROR,=CL10' '                                           14460007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 14470007
         MVI   VARBL1,C'A'         SET TO PASS                          14480007
         LA    R15,4               SET TO FAIL                          14490007
         MVI   VARBL3,X'01'        SET TO FAIL                          14500007
         PACK  PACK1,=Z'2'         SET TO FAIL                          14510007
         MVC   PREDOUT,=C'FALSE'                                        14520007
         MVC   TESTNBR,=C'TEST100O'                                     14530007
*                                                                       14540007
TEST100O IF    (CLI,VARBL1,C'A',E),AND,                                C14550007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C14560007
               (SP,PACK1,=P'1',Z)                                       14570007
           MVC   ACTOUT,=C'TRUE '                                       14580007
         ELSE                                                           14590007
           MVC   ACTOUT,=C'FALSE'                                       14600007
         ENDIF                                                          14610007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  14620007
           MVC   ERROR,=C'<=== ERROR'                                   14630007
         ENDIF                                                          14640007
         PUT   SYSPRINT,OUTPUT                                          14650007
         MVC   ERROR,=CL10' '                                           14660007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 14670007
         MVI   VARBL1,C'Z'         SET TO FAIL                          14680007
         LA    R15,4               SET TO FAIL                          14690007
         MVI   VARBL3,X'01'        SET TO FAIL                          14700007
         PACK  PACK1,=Z'2'         SET TO FAIL                          14710007
         MVC   PREDOUT,=C'FALSE'                                        14720007
         MVC   TESTNBR,=C'TEST100P'                                     14730007
*                                                                       14740007
TEST100P IF    (CLI,VARBL1,C'A',E),AND,                                C14750007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z)),AND,           C14760007
               (SP,PACK1,=P'1',Z)                                       14770007
           MVC   ACTOUT,=C'TRUE '                                       14780007
         ELSE                                                           14790007
           MVC   ACTOUT,=C'FALSE'                                       14800007
         ENDIF                                                          14810007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  14820007
           MVC   ERROR,=C'<=== ERROR'                                   14830007
         ENDIF                                                          14840007
         PUT   SYSPRINT,OUTPUT                                          14850007
         MVC   ERROR,=CL10' '                                           14860007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 14870007
*                                                                     * 14880007
* IF (A) OR (B) AND (C) OR (D)                                        * 14890007
*                                                                     * 14900007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 14910007
*                                                                       14920007
         BALR  R12,0                                                    14930016
         USING *,R12                                                    14940016
         MVI   VARBL1,C'A'         SET TO PASS                          14950007
         LA    R15,0               SET TO PASS                          14960007
         MVI   VARBL3,X'00'        SET TO PASS                          14970007
         PACK  PACK1,=Z'1'         SET TO PASS                          14980007
         MVC   PREDOUT,=C'TRUE '                                        14990007
         MVC   TESTNBR,=C'TEST110A'                                     15000007
*                                                                       15010007
TEST110A IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C15020007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                15030007
           MVC   ACTOUT,=C'TRUE '                                       15040007
         ELSE                                                           15050007
           MVC   ACTOUT,=C'FALSE'                                       15060007
         ENDIF                                                          15070007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  15080007
           MVC   ERROR,=C'<=== ERROR'                                   15090007
         ENDIF                                                          15100007
         PUT   SYSPRINT,OUTPUT                                          15110007
         MVC   ERROR,=CL10' '                                           15120007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 15130007
         MVI   VARBL1,C'Z'         SET TO FAIL                          15140007
         LA    R15,0               SET TO PASS                          15150007
         MVI   VARBL3,X'00'        SET TO PASS                          15160007
         PACK  PACK1,=Z'1'         SET TO PASS                          15170007
         MVC   PREDOUT,=C'TRUE '                                        15180007
         MVC   TESTNBR,=C'TEST110B'                                     15190007
*                                                                       15200007
TEST110B IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C15210007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                15220007
           MVC   ACTOUT,=C'TRUE '                                       15230007
         ELSE                                                           15240007
           MVC   ACTOUT,=C'FALSE'                                       15250007
         ENDIF                                                          15260007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  15270007
           MVC   ERROR,=C'<=== ERROR'                                   15280007
         ENDIF                                                          15290007
         PUT   SYSPRINT,OUTPUT                                          15300007
         MVC   ERROR,=CL10' '                                           15310007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 15320007
         MVI   VARBL1,C'A'         SET TO PASS                          15330007
         LA    R15,4               SET TO FAIL                          15340007
         MVI   VARBL3,X'00'        SET TO PASS                          15350007
         PACK  PACK1,=Z'1'         SET TO PASS                          15360007
         MVC   PREDOUT,=C'TRUE '                                        15370007
         MVC   TESTNBR,=C'TEST110C'                                     15380007
*                                                                       15390007
TEST110C IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C15400007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                15410007
           MVC   ACTOUT,=C'TRUE '                                       15420007
         ELSE                                                           15430007
           MVC   ACTOUT,=C'FALSE'                                       15440007
         ENDIF                                                          15450007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  15460007
           MVC   ERROR,=C'<=== ERROR'                                   15470007
         ENDIF                                                          15480007
         PUT   SYSPRINT,OUTPUT                                          15490007
         MVC   ERROR,=CL10' '                                           15500007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 15510007
         MVI   VARBL1,C'Z'         SET TO FAIL                          15520007
         LA    R15,4               SET TO FAIL                          15530007
         MVI   VARBL3,X'00'        SET TO PASS                          15540007
         PACK  PACK1,=Z'1'         SET TO PASS                          15550007
         MVC   PREDOUT,=C'TRUE '                                        15560007
         MVC   TESTNBR,=C'TEST110D'                                     15570007
*                                                                       15580007
TEST110D IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C15590007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                15600007
           MVC   ACTOUT,=C'TRUE '                                       15610007
         ELSE                                                           15620007
           MVC   ACTOUT,=C'FALSE'                                       15630007
         ENDIF                                                          15640007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  15650007
           MVC   ERROR,=C'<=== ERROR'                                   15660007
         ENDIF                                                          15670007
         PUT   SYSPRINT,OUTPUT                                          15680007
         MVC   ERROR,=CL10' '                                           15690007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 15700007
         MVI   VARBL1,C'A'         SET TO PASS                          15710007
         LA    R15,0               SET TO PASS                          15720007
         MVI   VARBL3,X'01'        SET TO FAIL                          15730007
         PACK  PACK1,=Z'1'         SET TO PASS                          15740007
         MVC   PREDOUT,=C'TRUE '                                        15750007
         MVC   TESTNBR,=C'TEST110E'                                     15760007
*                                                                       15770007
TEST110E IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C15780007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                15790007
           MVC   ACTOUT,=C'TRUE '                                       15800007
         ELSE                                                           15810007
           MVC   ACTOUT,=C'FALSE'                                       15820007
         ENDIF                                                          15830007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  15840007
           MVC   ERROR,=C'<=== ERROR'                                   15850007
         ENDIF                                                          15860007
         PUT   SYSPRINT,OUTPUT                                          15870007
         MVC   ERROR,=CL10' '         PUT   SYSPRINT,OUTPUT             15880007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 15890007
         MVI   VARBL1,C'Z'         SET TO FAIL                          15900007
         LA    R15,0               SET TO PASS                          15910007
         MVI   VARBL3,X'01'        SET TO FAIL                          15920007
         PACK  PACK1,=Z'1'         SET TO PASS                          15930007
         MVC   PREDOUT,=C'TRUE '                                        15940007
         MVC   TESTNBR,=C'TEST110F'                                     15950007
*                                                                       15960007
TEST110F IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C15970007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                15980007
           MVC   ACTOUT,=C'TRUE '                                       15990007
         ELSE                                                           16000007
           MVC   ACTOUT,=C'FALSE'                                       16010007
         ENDIF                                                          16020007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  16030007
           MVC   ERROR,=C'<=== ERROR'                                   16040007
         ENDIF                                                          16050007
         PUT   SYSPRINT,OUTPUT                                          16060007
         MVC   ERROR,=CL10' '                                           16070007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 16080007
         MVI   VARBL1,C'A'         SET TO PASS                          16090007
         LA    R15,4               SET TO FAIL                          16100007
         MVI   VARBL3,X'01'        SET TO FAIL                          16110007
         PACK  PACK1,=Z'1'         SET TO PASS                          16120007
         MVC   PREDOUT,=C'TRUE '                                        16130007
         MVC   TESTNBR,=C'TEST110G'                                     16140007
*                                                                       16150007
TEST110G IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C16160007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                16170007
           MVC   ACTOUT,=C'TRUE '                                       16180007
         ELSE                                                           16190007
           MVC   ACTOUT,=C'FALSE'                                       16200007
         ENDIF                                                          16210007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  16220007
           MVC   ERROR,=C'<=== ERROR'                                   16230007
         ENDIF                                                          16240007
         PUT   SYSPRINT,OUTPUT                                          16250007
         MVC   ERROR,=CL10' '                                           16260007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 16270007
         MVI   VARBL1,C'Z'         SET TO FAIL                          16280007
         LA    R15,4               SET TO FAIL                          16290007
         MVI   VARBL3,X'01'        SET TO FAIL                          16300007
         PACK  PACK1,=Z'1'         SET TO PASS                          16310007
         MVC   PREDOUT,=C'TRUE '                                        16320007
         MVC   TESTNBR,=C'TEST110H'                                     16330007
*                                                                       16340007
TEST110H IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C16350007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                16360007
           MVC   ACTOUT,=C'TRUE '                                       16370007
         ELSE                                                           16380007
           MVC   ACTOUT,=C'FALSE'                                       16390007
         ENDIF                                                          16400007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  16410007
           MVC   ERROR,=C'<=== ERROR'                                   16420007
         ENDIF                                                          16430007
         PUT   SYSPRINT,OUTPUT                                          16440007
         MVC   ERROR,=CL10' '                                           16450007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 16460007
         MVI   VARBL1,C'A'         SET TO PASS                          16470007
         LA    R15,0               SET TO PASS                          16480007
         MVI   VARBL3,X'00'        SET TO PASS                          16490007
         PACK  PACK1,=Z'2'         SET TO FAIL                          16500007
         MVC   PREDOUT,=C'TRUE '                                        16510007
         MVC   TESTNBR,=C'TEST110I'                                     16520007
*                                                                       16530007
TEST110I IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C16540007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                16550007
           MVC   ACTOUT,=C'TRUE '                                       16560007
         ELSE                                                           16570007
           MVC   ACTOUT,=C'FALSE'                                       16580007
         ENDIF                                                          16590007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  16600007
           MVC   ERROR,=C'<=== ERROR'                                   16610007
         ENDIF                                                          16620007
         PUT   SYSPRINT,OUTPUT                                          16630007
         MVC   ERROR,=CL10' '                                           16640007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 16650007
         MVI   VARBL1,C'Z'         SET TO FAIL                          16660007
         LA    R15,0               SET TO PASS                          16670007
         MVI   VARBL3,X'00'        SET TO PASS                          16680007
         PACK  PACK1,=Z'2'         SET TO FAIL                          16690007
         MVC   PREDOUT,=C'TRUE '                                        16700007
         MVC   TESTNBR,=C'TEST110J'                                     16710007
*                                                                       16720007
TEST110J IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C16730007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                16740007
           MVC   ACTOUT,=C'TRUE '                                       16750007
         ELSE                                                           16760007
           MVC   ACTOUT,=C'FALSE'                                       16770007
         ENDIF                                                          16780007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  16790007
           MVC   ERROR,=C'<=== ERROR'                                   16800007
         ENDIF                                                          16810007
         PUT   SYSPRINT,OUTPUT                                          16820007
         MVC   ERROR,=CL10' '                                           16830007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 16840007
         MVI   VARBL1,C'A'         SET TO PASS                          16850007
         LA    R15,4               SET TO FAIL                          16860007
         MVI   VARBL3,X'00'        SET TO PASS                          16870007
         PACK  PACK1,=Z'2'         SET TO FAIL                          16880007
         MVC   PREDOUT,=C'TRUE '                                        16890007
         MVC   TESTNBR,=C'TEST110K'                                     16900007
*                                                                       16910007
TEST110K IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C16920007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                16930007
           MVC   ACTOUT,=C'TRUE '                                       16940007
         ELSE                                                           16950007
           MVC   ACTOUT,=C'FALSE'                                       16960007
         ENDIF                                                          16970007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  16980007
           MVC   ERROR,=C'<=== ERROR'                                   16990007
         ENDIF                                                          17000007
         PUT   SYSPRINT,OUTPUT                                          17010007
         MVC   ERROR,=CL10' '                                           17020007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 17030007
         MVI   VARBL1,C'Z'         SET TO FAIL                          17040007
         LA    R15,4               SET TO FAIL                          17050007
         MVI   VARBL3,X'00'        SET TO PASS                          17060007
         PACK  PACK1,=Z'2'         SET TO FAIL                          17070007
         MVC   PREDOUT,=C'FALSE'                                        17080007
         MVC   TESTNBR,=C'TEST110L'                                     17090007
*                                                                       17100007
TEST110L IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C17110007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                17120007
           MVC   ACTOUT,=C'TRUE '                                       17130007
         ELSE                                                           17140007
           MVC   ACTOUT,=C'FALSE'                                       17150007
         ENDIF                                                          17160007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  17170007
           MVC   ERROR,=C'<=== ERROR'                                   17180007
         ENDIF                                                          17190007
         PUT   SYSPRINT,OUTPUT                                          17200007
         MVC   ERROR,=CL10' '                                           17210007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 17220007
         MVI   VARBL1,C'A'         SET TO PASS                          17230007
         LA    R15,0               SET TO PASS                          17240007
         MVI   VARBL3,X'01'        SET TO FAIL                          17250007
         PACK  PACK1,=Z'2'         SET TO FAIL                          17260007
         MVC   PREDOUT,=C'TRUE '                                        17270007
         MVC   TESTNBR,=C'TEST110M'                                     17280007
*                                                                       17290007
TEST110M IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C17300007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                17310007
           MVC   ACTOUT,=C'TRUE '                                       17320007
         ELSE                                                           17330007
           MVC   ACTOUT,=C'FALSE'                                       17340007
         ENDIF                                                          17350007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  17360007
           MVC   ERROR,=C'<=== ERROR'                                   17370007
         ENDIF                                                          17380007
         PUT   SYSPRINT,OUTPUT                                          17390007
         MVC   ERROR,=CL10' '                                           17400007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 17410007
         MVI   VARBL1,C'Z'         SET TO FAIL                          17420007
         LA    R15,0               SET TO PASS                          17430007
         MVI   VARBL3,X'01'        SET TO FAIL                          17440007
         PACK  PACK1,=Z'2'         SET TO FAIL                          17450007
         MVC   PREDOUT,=C'FALSE'                                        17460007
         MVC   TESTNBR,=C'TEST110N'                                     17470007
*                                                                       17480007
TEST110N IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C17490007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                17500007
           MVC   ACTOUT,=C'TRUE '                                       17510007
         ELSE                                                           17520007
           MVC   ACTOUT,=C'FALSE'                                       17530007
         ENDIF                                                          17540007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  17550007
           MVC   ERROR,=C'<=== ERROR'                                   17560007
         ENDIF                                                          17570007
         PUT   SYSPRINT,OUTPUT                                          17580007
         MVC   ERROR,=CL10' '                                           17590007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 17600007
         MVI   VARBL1,C'A'         SET TO PASS                          17610007
         LA    R15,4               SET TO FAIL                          17620007
         MVI   VARBL3,X'01'        SET TO FAIL                          17630007
         PACK  PACK1,=Z'2'         SET TO FAIL                          17640007
         MVC   PREDOUT,=C'TRUE '                                        17650007
         MVC   TESTNBR,=C'TEST110O'                                     17660007
*                                                                       17670007
TEST110O IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C17680007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                17690007
           MVC   ACTOUT,=C'TRUE '                                       17700007
         ELSE                                                           17710007
           MVC   ACTOUT,=C'FALSE'                                       17720007
         ENDIF                                                          17730007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  17740007
           MVC   ERROR,=C'<=== ERROR'                                   17750007
         ENDIF                                                          17760007
         PUT   SYSPRINT,OUTPUT                                          17770007
         MVC   ERROR,=CL10' '                                           17780007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 17790007
         MVI   VARBL1,C'Z'         SET TO FAIL                          17800007
         LA    R15,4               SET TO FAIL                          17810007
         MVI   VARBL3,X'01'        SET TO FAIL                          17820007
         PACK  PACK1,=Z'2'         SET TO FAIL                          17830007
         MVC   PREDOUT,=C'FALSE'                                        17840007
         MVC   TESTNBR,=C'TEST110P'                                     17850007
*                                                                       17860007
TEST110P IF    (CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z),AND,             C17870007
               (TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z)                17880007
           MVC   ACTOUT,=C'TRUE '                                       17890007
         ELSE                                                           17900007
           MVC   ACTOUT,=C'FALSE'                                       17910007
         ENDIF                                                          17920007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  17930007
           MVC   ERROR,=C'<=== ERROR'                                   17940007
         ENDIF                                                          17950007
         PUT   SYSPRINT,OUTPUT                                          17960007
         MVC   ERROR,=CL10' '                                           17970007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 17980007
*                                                                     * 17990007
* IF ((A) OR (B)) AND ((C) OR (D))                                    * 18000007
*                                                                     * 18010007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 18020007
*                                                                       18030007
         BALR  R12,0                                                    18040016
         USING *,R12                                                    18050016
         MVI   VARBL1,C'A'         SET TO PASS                          18060007
         LA    R15,0               SET TO PASS                          18070007
         MVI   VARBL3,X'00'        SET TO PASS                          18080007
         PACK  PACK1,=Z'1'         SET TO PASS                          18090007
         MVC   PREDOUT,=C'TRUE '                                        18100007
         MVC   TESTNBR,=C'TEST120A'                                     18110007
*                                                                       18120007
TEST120A IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C18130007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              18140007
           MVC   ACTOUT,=C'TRUE '                                       18150007
         ELSE                                                           18160007
           MVC   ACTOUT,=C'FALSE'                                       18170007
         ENDIF                                                          18180007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  18190007
           MVC   ERROR,=C'<=== ERROR'                                   18200007
         ENDIF                                                          18210007
         PUT   SYSPRINT,OUTPUT                                          18220007
         MVC   ERROR,=CL10' '                                           18230007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 18240007
         MVI   VARBL1,C'Z'         SET TO FAIL                          18250007
         LA    R15,0               SET TO PASS                          18260007
         MVI   VARBL3,X'00'        SET TO PASS                          18270007
         PACK  PACK1,=Z'1'         SET TO PASS                          18280007
         MVC   PREDOUT,=C'TRUE '                                        18290007
         MVC   TESTNBR,=C'TEST120B'                                     18300007
*                                                                       18310007
TEST120B IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C18320007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              18330007
           MVC   ACTOUT,=C'TRUE '                                       18340007
         ELSE                                                           18350007
           MVC   ACTOUT,=C'FALSE'                                       18360007
         ENDIF                                                          18370007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  18380007
           MVC   ERROR,=C'<=== ERROR'                                   18390007
         ENDIF                                                          18400007
         PUT   SYSPRINT,OUTPUT                                          18410007
         MVC   ERROR,=CL10' '                                           18420007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 18430007
         MVI   VARBL1,C'A'         SET TO PASS                          18440007
         LA    R15,4               SET TO FAIL                          18450007
         MVI   VARBL3,X'00'        SET TO PASS                          18460007
         PACK  PACK1,=Z'1'         SET TO PASS                          18470007
         MVC   PREDOUT,=C'TRUE '                                        18480007
         MVC   TESTNBR,=C'TEST120C'                                     18490007
*                                                                       18500007
TEST120C IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C18510007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              18520007
           MVC   ACTOUT,=C'TRUE '                                       18530007
         ELSE                                                           18540007
           MVC   ACTOUT,=C'FALSE'                                       18550007
         ENDIF                                                          18560007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  18570007
           MVC   ERROR,=C'<=== ERROR'                                   18580007
         ENDIF                                                          18590007
         PUT   SYSPRINT,OUTPUT                                          18600007
         MVC   ERROR,=CL10' '                                           18610007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 18620007
         MVI   VARBL1,C'Z'         SET TO FAIL                          18630007
         LA    R15,4               SET TO FAIL                          18640007
         MVI   VARBL3,X'00'        SET TO PASS                          18650007
         PACK  PACK1,=Z'1'         SET TO PASS                          18660007
         MVC   PREDOUT,=C'FALSE'                                        18670007
         MVC   TESTNBR,=C'TEST120D'                                     18680007
*                                                                       18690007
TEST120D IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C18700007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              18710007
           MVC   ACTOUT,=C'TRUE '                                       18720007
         ELSE                                                           18730007
           MVC   ACTOUT,=C'FALSE'                                       18740007
         ENDIF                                                          18750007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  18760007
           MVC   ERROR,=C'<=== ERROR'                                   18770007
         ENDIF                                                          18780007
         PUT   SYSPRINT,OUTPUT                                          18790007
         MVC   ERROR,=CL10' '                                           18800007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 18810007
         MVI   VARBL1,C'A'         SET TO PASS                          18820007
         LA    R15,0               SET TO PASS                          18830007
         MVI   VARBL3,X'01'        SET TO FAIL                          18840007
         PACK  PACK1,=Z'1'         SET TO PASS                          18850007
         MVC   PREDOUT,=C'TRUE '                                        18860007
         MVC   TESTNBR,=C'TEST120E'                                     18870007
*                                                                       18880007
TEST120E IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C18890007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              18900007
           MVC   ACTOUT,=C'TRUE '                                       18910007
         ELSE                                                           18920007
           MVC   ACTOUT,=C'FALSE'                                       18930007
         ENDIF                                                          18940007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  18950007
           MVC   ERROR,=C'<=== ERROR'                                   18960007
         ENDIF                                                          18970007
         PUT   SYSPRINT,OUTPUT                                          18980007
         MVC   ERROR,=CL10' '         PUT   SYSPRINT,OUTPUT             18990007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 19000007
         MVI   VARBL1,C'Z'         SET TO FAIL                          19010007
         LA    R15,0               SET TO PASS                          19020007
         MVI   VARBL3,X'01'        SET TO FAIL                          19030007
         PACK  PACK1,=Z'1'         SET TO PASS                          19040007
         MVC   PREDOUT,=C'TRUE '                                        19050007
         MVC   TESTNBR,=C'TEST120F'                                     19060007
*                                                                       19070007
TEST120F IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C19080007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              19090007
           MVC   ACTOUT,=C'TRUE '                                       19100007
         ELSE                                                           19110007
           MVC   ACTOUT,=C'FALSE'                                       19120007
         ENDIF                                                          19130007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  19140007
           MVC   ERROR,=C'<=== ERROR'                                   19150007
         ENDIF                                                          19160007
         PUT   SYSPRINT,OUTPUT                                          19170007
         MVC   ERROR,=CL10' '                                           19180007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 19190007
         MVI   VARBL1,C'A'         SET TO PASS                          19200007
         LA    R15,4               SET TO FAIL                          19210007
         MVI   VARBL3,X'01'        SET TO FAIL                          19220007
         PACK  PACK1,=Z'1'         SET TO PASS                          19230007
         MVC   PREDOUT,=C'TRUE '                                        19240007
         MVC   TESTNBR,=C'TEST120G'                                     19250007
*                                                                       19260007
TEST120G IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C19270007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              19280007
           MVC   ACTOUT,=C'TRUE '                                       19290007
         ELSE                                                           19300007
           MVC   ACTOUT,=C'FALSE'                                       19310007
         ENDIF                                                          19320007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  19330007
           MVC   ERROR,=C'<=== ERROR'                                   19340007
         ENDIF                                                          19350007
         PUT   SYSPRINT,OUTPUT                                          19360007
         MVC   ERROR,=CL10' '                                           19370007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 19380007
         MVI   VARBL1,C'Z'         SET TO FAIL                          19390007
         LA    R15,4               SET TO FAIL                          19400007
         MVI   VARBL3,X'01'        SET TO FAIL                          19410007
         PACK  PACK1,=Z'1'         SET TO PASS                          19420007
         MVC   PREDOUT,=C'FALSE'                                        19430007
         MVC   TESTNBR,=C'TEST120H'                                     19440007
*                                                                       19450007
TEST120H IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C19460007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              19470007
           MVC   ACTOUT,=C'TRUE '                                       19480007
         ELSE                                                           19490007
           MVC   ACTOUT,=C'FALSE'                                       19500007
         ENDIF                                                          19510007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  19520007
           MVC   ERROR,=C'<=== ERROR'                                   19530007
         ENDIF                                                          19540007
         PUT   SYSPRINT,OUTPUT                                          19550007
         MVC   ERROR,=CL10' '                                           19560007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 19570007
         MVI   VARBL1,C'A'         SET TO PASS                          19580007
         LA    R15,0               SET TO PASS                          19590007
         MVI   VARBL3,X'00'        SET TO PASS                          19600007
         PACK  PACK1,=Z'2'         SET TO FAIL                          19610007
         MVC   PREDOUT,=C'TRUE '                                        19620007
         MVC   TESTNBR,=C'TEST120I'                                     19630007
*                                                                       19640007
TEST120I IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C19650007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              19660007
           MVC   ACTOUT,=C'TRUE '                                       19670007
         ELSE                                                           19680007
           MVC   ACTOUT,=C'FALSE'                                       19690007
         ENDIF                                                          19700007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  19710007
           MVC   ERROR,=C'<=== ERROR'                                   19720007
         ENDIF                                                          19730007
         PUT   SYSPRINT,OUTPUT                                          19740007
         MVC   ERROR,=CL10' '                                           19750007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 19760007
         MVI   VARBL1,C'Z'         SET TO FAIL                          19770007
         LA    R15,0               SET TO PASS                          19780007
         MVI   VARBL3,X'00'        SET TO PASS                          19790007
         PACK  PACK1,=Z'2'         SET TO FAIL                          19800007
         MVC   PREDOUT,=C'TRUE '                                        19810007
         MVC   TESTNBR,=C'TEST120J'                                     19820007
*                                                                       19830007
TEST120J IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C19840007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              19850007
           MVC   ACTOUT,=C'TRUE '                                       19860007
         ELSE                                                           19870007
           MVC   ACTOUT,=C'FALSE'                                       19880007
         ENDIF                                                          19890007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  19900007
           MVC   ERROR,=C'<=== ERROR'                                   19910007
         ENDIF                                                          19920007
         PUT   SYSPRINT,OUTPUT                                          19930007
         MVC   ERROR,=CL10' '                                           19940007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 19950007
         MVI   VARBL1,C'A'         SET TO PASS                          19960007
         LA    R15,4               SET TO FAIL                          19970007
         MVI   VARBL3,X'00'        SET TO PASS                          19980007
         PACK  PACK1,=Z'2'         SET TO FAIL                          19990007
         MVC   PREDOUT,=C'TRUE '                                        20000007
         MVC   TESTNBR,=C'TEST120K'                                     20010007
*                                                                       20020007
TEST120K IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C20030007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              20040007
           MVC   ACTOUT,=C'TRUE '                                       20050007
         ELSE                                                           20060007
           MVC   ACTOUT,=C'FALSE'                                       20070007
         ENDIF                                                          20080007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  20090007
           MVC   ERROR,=C'<=== ERROR'                                   20100007
         ENDIF                                                          20110007
         PUT   SYSPRINT,OUTPUT                                          20120007
         MVC   ERROR,=CL10' '                                           20130007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 20140007
         MVI   VARBL1,C'Z'         SET TO FAIL                          20150007
         LA    R15,4               SET TO FAIL                          20160007
         MVI   VARBL3,X'00'        SET TO PASS                          20170007
         PACK  PACK1,=Z'2'         SET TO FAIL                          20180007
         MVC   PREDOUT,=C'FALSE'                                        20190007
         MVC   TESTNBR,=C'TEST120L'                                     20200007
*                                                                       20210007
TEST120L IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C20220007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              20230007
           MVC   ACTOUT,=C'TRUE '                                       20240007
         ELSE                                                           20250007
           MVC   ACTOUT,=C'FALSE'                                       20260007
         ENDIF                                                          20270007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  20280007
           MVC   ERROR,=C'<=== ERROR'                                   20290007
         ENDIF                                                          20300007
         PUT   SYSPRINT,OUTPUT                                          20310007
         MVC   ERROR,=CL10' '                                           20320007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 20330007
         MVI   VARBL1,C'A'         SET TO PASS                          20340007
         LA    R15,0               SET TO PASS                          20350007
         MVI   VARBL3,X'01'        SET TO FAIL                          20360007
         PACK  PACK1,=Z'2'         SET TO FAIL                          20370007
         MVC   PREDOUT,=C'FALSE'                                        20380007
         MVC   TESTNBR,=C'TEST120M'                                     20390007
*                                                                       20400007
TEST120M IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C20410007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              20420007
           MVC   ACTOUT,=C'TRUE '                                       20430007
         ELSE                                                           20440007
           MVC   ACTOUT,=C'FALSE'                                       20450007
         ENDIF                                                          20460007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  20470007
           MVC   ERROR,=C'<=== ERROR'                                   20480007
         ENDIF                                                          20490007
         PUT   SYSPRINT,OUTPUT                                          20500007
         MVC   ERROR,=CL10' '                                           20510007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 20520007
         MVI   VARBL1,C'Z'         SET TO FAIL                          20530007
         LA    R15,0               SET TO PASS                          20540007
         MVI   VARBL3,X'01'        SET TO FAIL                          20550007
         PACK  PACK1,=Z'2'         SET TO FAIL                          20560007
         MVC   PREDOUT,=C'FALSE'                                        20570007
         MVC   TESTNBR,=C'TEST120N'                                     20580007
*                                                                       20590007
TEST120N IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C20600007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              20610007
           MVC   ACTOUT,=C'TRUE '                                       20620007
         ELSE                                                           20630007
           MVC   ACTOUT,=C'FALSE'                                       20640007
         ENDIF                                                          20650007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  20660007
           MVC   ERROR,=C'<=== ERROR'                                   20670007
         ENDIF                                                          20680007
         PUT   SYSPRINT,OUTPUT                                          20690007
         MVC   ERROR,=CL10' '                                           20700007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 20710007
         MVI   VARBL1,C'A'         SET TO PASS                          20720007
         LA    R15,4               SET TO FAIL                          20730007
         MVI   VARBL3,X'01'        SET TO FAIL                          20740007
         PACK  PACK1,=Z'2'         SET TO FAIL                          20750007
         MVC   PREDOUT,=C'FALSE'                                        20760007
         MVC   TESTNBR,=C'TEST120O'                                     20770007
*                                                                       20780007
TEST120O IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C20790007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              20800007
           MVC   ACTOUT,=C'TRUE '                                       20810007
         ELSE                                                           20820007
           MVC   ACTOUT,=C'FALSE'                                       20830007
         ENDIF                                                          20840007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  20850007
           MVC   ERROR,=C'<=== ERROR'                                   20860007
         ENDIF                                                          20870007
         PUT   SYSPRINT,OUTPUT                                          20880007
         MVC   ERROR,=CL10' '                                           20890007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 20900007
         MVI   VARBL1,C'Z'         SET TO FAIL                          20910007
         LA    R15,4               SET TO FAIL                          20920007
         MVI   VARBL3,X'01'        SET TO FAIL                          20930007
         PACK  PACK1,=Z'2'         SET TO FAIL                          20940007
         MVC   PREDOUT,=C'FALSE'                                        20950007
         MVC   TESTNBR,=C'TEST120P'                                     20960007
*                                                                       20970007
TEST120P IF    ((CLI,VARBL1,C'A',E),OR,(LTR,R15,R15,Z)),AND,           C20980007
               ((TM,VARBL3,X'01',Z),OR,(SP,PACK1,=P'1',Z))              20990007
           MVC   ACTOUT,=C'TRUE '                                       21000007
         ELSE                                                           21010007
           MVC   ACTOUT,=C'FALSE'                                       21020007
         ENDIF                                                          21030007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  21040007
           MVC   ERROR,=C'<=== ERROR'                                   21050007
         ENDIF                                                          21060007
         PUT   SYSPRINT,OUTPUT                                          21070007
         MVC   ERROR,=CL10' '                                           21080007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 21090007
*                                                                     * 21100007
* TWO LEVELS OF RECURSION ARE REQUIRED:                               * 21110007
*                                                                     * 21120007
* IF (A) AND ((B) OR (C) AND ((D) OR (E)))                            * 21130007
*                                                                     * 21140007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 21150007
*                                                                       21160007
         MVI   VARBL1,C'A'         SET TO PASS                          21190007
         LA    R15,0               SET TO PASS                          21200007
         MVI   VARBL3,X'00'        SET TO PASS                          21210007
         PACK  PACK1,=Z'1'         SET TO PASS                          21220007
         MVI   TSWITCH,X'10'       SET TO PASS                          21230007
         MVC   PREDOUT,=C'TRUE '                                        21240007
         MVC   TESTNBR,=C'TEST130A'                                     21250007
*                                                                       21260007
TEST130A IF    (CLI,VARBL1,C'A',E),AND,                                C21270007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C21280007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           21290009
           MVC   ACTOUT,=C'TRUE '                                       21300007
         ELSE                                                           21310007
           MVC   ACTOUT,=C'FALSE'                                       21320007
         ENDIF                                                          21330007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  21340007
           MVC   ERROR,=C'<=== ERROR'                                   21350007
         ENDIF                                                          21360007
         PUT   SYSPRINT,OUTPUT                                          21370007
         MVC   ERROR,=CL10' '                                           21380007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 21390007
         MVI   VARBL1,C'Z'         SET TO FAIL                          21400007
         LA    R15,0               SET TO PASS                          21410007
         MVI   VARBL3,X'00'        SET TO PASS                          21420007
         PACK  PACK1,=Z'1'         SET TO PASS                          21430007
         MVI   TSWITCH,X'10'       SET TO PASS                          21440007
         MVC   PREDOUT,=C'FALSE'                                        21450007
         MVC   TESTNBR,=C'TEST130B'                                     21460007
TEST130B IF    (CLI,VARBL1,C'A',E),AND,                                C21480007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C21490007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           21500009
           MVC   ACTOUT,=C'TRUE '                                       21510007
         ELSE                                                           21520007
           MVC   ACTOUT,=C'FALSE'                                       21530007
         ENDIF                                                          21540007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  21550007
           MVC   ERROR,=C'<=== ERROR'                                   21560007
         ENDIF                                                          21570007
         PUT   SYSPRINT,OUTPUT                                          21580007
         MVC   ERROR,=CL10' '                                           21590007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 21600007
         MVI   VARBL1,C'A'         SET TO PASS                          21610007
         LA    R15,1               SET TO FAIL                          21620007
         MVI   VARBL3,X'00'        SET TO PASS                          21630007
         PACK  PACK1,=Z'1'         SET TO PASS                          21640007
         MVI   TSWITCH,X'10'       SET TO PASS                          21650007
         MVC   PREDOUT,=C'TRUE '                                        21660007
         MVC   TESTNBR,=C'TEST130C'                                     21670007
*                                                                       21680007
TEST130C IF    (CLI,VARBL1,C'A',E),AND,                                C21690007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C21700007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           21710009
           MVC   ACTOUT,=C'TRUE '                                       21720007
         ELSE                                                           21730007
           MVC   ACTOUT,=C'FALSE'                                       21740007
         ENDIF                                                          21750007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  21760007
           MVC   ERROR,=C'<=== ERROR'                                   21770007
         ENDIF                                                          21780007
         PUT   SYSPRINT,OUTPUT                                          21790007
         MVC   ERROR,=CL10' '                                           21800007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 21810007
         MVI   VARBL1,C'Z'         SET TO FAIL                          21820007
         LA    R15,1               SET TO FAIL                          21830007
         MVI   VARBL3,X'00'        SET TO PASS                          21840007
         PACK  PACK1,=Z'1'         SET TO PASS                          21850007
         MVI   TSWITCH,X'10'       SET TO PASS                          21860007
         MVC   PREDOUT,=C'FALSE'                                        21870007
         MVC   TESTNBR,=C'TEST130D'                                     21880007
*                                                                       21890007
TEST130D IF    (CLI,VARBL1,C'A',E),AND,                                C21900007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C21910007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           21920009
           MVC   ACTOUT,=C'TRUE '                                       21930007
         ELSE                                                           21940007
           MVC   ACTOUT,=C'FALSE'                                       21950007
         ENDIF                                                          21960007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  21970007
           MVC   ERROR,=C'<=== ERROR'                                   21980007
         ENDIF                                                          21990007
         PUT   SYSPRINT,OUTPUT                                          22000007
         MVC   ERROR,=CL10' '                                           22010007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 22020007
         MVI   VARBL1,C'A'         SET TO PASS                          22030007
         LA    R15,0               SET TO PASS                          22040007
         MVI   VARBL3,X'01'        SET TO FAIL                          22050007
         PACK  PACK1,=Z'1'         SET TO PASS                          22060007
         MVI   TSWITCH,X'10'       SET TO PASS                          22070007
         MVC   PREDOUT,=C'TRUE '                                        22080007
         MVC   TESTNBR,=C'TEST130E'                                     22090007
*                                                                       22100007
TEST130E IF    (CLI,VARBL1,C'A',E),AND,                                C22110007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C22120007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           22130009
           MVC   ACTOUT,=C'TRUE '                                       22140007
         ELSE                                                           22150007
           MVC   ACTOUT,=C'FALSE'                                       22160007
         ENDIF                                                          22170007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  22180007
           MVC   ERROR,=C'<=== ERROR'                                   22190007
         ENDIF                                                          22200007
         PUT   SYSPRINT,OUTPUT                                          22210007
         MVC   ERROR,=CL10' '                                           22220007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 22230007
         MVI   VARBL1,C'Z'         SET TO FAIL                          22240007
         LA    R15,0               SET TO PASS                          22250007
         MVI   VARBL3,X'01'        SET TO FAIL                          22260007
         PACK  PACK1,=Z'1'         SET TO PASS                          22270007
         MVI   TSWITCH,X'10'       SET TO PASS                          22280007
         MVC   PREDOUT,=C'FALSE'                                        22290007
         MVC   TESTNBR,=C'TEST130F'                                     22300007
*                                                                       22310007
TEST130F IF    (CLI,VARBL1,C'A',E),AND,                                C22320007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C22330007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           22340009
           MVC   ACTOUT,=C'TRUE '                                       22350007
         ELSE                                                           22360007
           MVC   ACTOUT,=C'FALSE'                                       22370007
         ENDIF                                                          22380007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  22390007
           MVC   ERROR,=C'<=== ERROR'                                   22400007
         ENDIF                                                          22410007
         PUT   SYSPRINT,OUTPUT                                          22420007
         MVC   ERROR,=CL10' '                                           22430007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 22440007
         MVI   VARBL1,C'A'         SET TO PASS                          22450007
         LA    R15,1               SET TO FAIL                          22460007
         MVI   VARBL3,X'01'        SET TO FAIL                          22470007
         PACK  PACK1,=Z'1'         SET TO PASS                          22480007
         MVI   TSWITCH,X'10'       SET TO PASS                          22490007
         MVC   PREDOUT,=C'FALSE'                                        22500007
         MVC   TESTNBR,=C'TEST130G'                                     22510007
TEST130G IF    (CLI,VARBL1,C'A',E),AND,                                C22520007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C22530007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           22540009
           MVC   ACTOUT,=C'TRUE '                                       22550007
         ELSE                                                           22560007
           MVC   ACTOUT,=C'FALSE'                                       22570007
         ENDIF                                                          22580007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  22590007
           MVC   ERROR,=C'<=== ERROR'                                   22600007
         ENDIF                                                          22610007
         PUT   SYSPRINT,OUTPUT                                          22620007
         MVC   ERROR,=CL10' '                                           22630007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 22640007
         MVI   VARBL1,C'Z'         SET TO FAIL                          22650007
         LA    R15,1               SET TO FAIL                          22660007
         MVI   VARBL3,X'01'        SET TO FAIL                          22670007
         PACK  PACK1,=Z'1'         SET TO PASS                          22680007
         MVI   TSWITCH,X'10'       SET TO PASS                          22690007
         MVC   PREDOUT,=C'FALSE'                                        22700007
         MVC   TESTNBR,=C'TEST130H'                                     22710007
*                                                                       22720007
TEST130H IF    (CLI,VARBL1,C'A',E),AND,                                C22730007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C22740007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           22750009
           MVC   ACTOUT,=C'TRUE '                                       22760007
         ELSE                                                           22770007
           MVC   ACTOUT,=C'FALSE'                                       22780007
         ENDIF                                                          22790007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  22800007
           MVC   ERROR,=C'<=== ERROR'                                   22810007
         ENDIF                                                          22820007
         PUT   SYSPRINT,OUTPUT                                          22830007
         MVC   ERROR,=CL10' '                                           22840007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 22850007
         MVI   VARBL1,C'A'         SET TO PASS                          22860007
         LA    R15,0               SET TO PASS                          22870007
         MVI   VARBL3,X'00'        SET TO PASS                          22880007
         PACK  PACK1,=Z'2'         SET TO FAIL                          22890007
         MVI   TSWITCH,X'10'       SET TO PASS                          22900007
         MVC   PREDOUT,=C'TRUE '                                        22910007
         MVC   TESTNBR,=C'TEST130I'                                     22920007
*                                                                       22930007
TEST130I IF    (CLI,VARBL1,C'A',E),AND,                                C22940007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C22950007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           22960009
           MVC   ACTOUT,=C'TRUE '                                       22970007
         ELSE                                                           22980007
           MVC   ACTOUT,=C'FALSE'                                       22990007
         ENDIF                                                          23000007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  23010007
           MVC   ERROR,=C'<=== ERROR'                                   23020007
         ENDIF                                                          23030007
         PUT   SYSPRINT,OUTPUT                                          23040007
         MVC   ERROR,=CL10' '                                           23050007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 23060007
         MVI   VARBL1,C'Z'         SET TO FAIL                          23070007
         LA    R15,0               SET TO PASS                          23080007
         MVI   VARBL3,X'00'        SET TO PASS                          23090007
         PACK  PACK1,=Z'2'         SET TO FAIL                          23100007
         MVI   TSWITCH,X'10'       SET TO PASS                          23110007
         MVC   PREDOUT,=C'FALSE'                                        23120007
         MVC   TESTNBR,=C'TEST130J'                                     23130007
*                                                                       23140007
TEST130J IF    (CLI,VARBL1,C'A',E),AND,                                C23150007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C23160007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           23170009
           MVC   ACTOUT,=C'TRUE '                                       23180007
         ELSE                                                           23190007
           MVC   ACTOUT,=C'FALSE'                                       23200007
         ENDIF                                                          23210007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  23220007
           MVC   ERROR,=C'<=== ERROR'                                   23230007
         ENDIF                                                          23240007
         PUT   SYSPRINT,OUTPUT                                          23250007
         MVC   ERROR,=CL10' '                                           23260007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 23270007
         MVI   VARBL1,C'A'         SET TO PASS                          23280007
         LA    R15,1               SET TO FAIL                          23290007
         MVI   VARBL3,X'00'        SET TO PASS                          23300007
         PACK  PACK1,=Z'2'         SET TO FAIL                          23310007
         MVI   TSWITCH,X'10'       SET TO PASS                          23320007
         MVC   PREDOUT,=C'TRUE '                                        23330010
         MVC   TESTNBR,=C'TEST130K'                                     23340007
*                                                                       23350007
TEST130K IF    (CLI,VARBL1,C'A',E),AND,                                C23360007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C23370007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           23380009
           MVC   ACTOUT,=C'TRUE '                                       23390007
         ELSE                                                           23400007
           MVC   ACTOUT,=C'FALSE'                                       23410007
         ENDIF                                                          23420007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  23430007
           MVC   ERROR,=C'<=== ERROR'                                   23440007
         ENDIF                                                          23450007
         PUT   SYSPRINT,OUTPUT                                          23460007
         MVC   ERROR,=CL10' '                                           23470007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 23480007
         MVI   VARBL1,C'Z'         SET TO FAIL                          23490007
         LA    R15,1               SET TO FAIL                          23500007
         MVI   VARBL3,X'00'        SET TO PASS                          23510007
         PACK  PACK1,=Z'2'         SET TO FAIL                          23520007
         MVI   TSWITCH,X'10'       SET TO PASS                          23530007
         MVC   PREDOUT,=C'FALSE'                                        23540007
         MVC   TESTNBR,=C'TEST130L'                                     23550007
*                                                                       23560007
TEST130L IF    (CLI,VARBL1,C'A',E),AND,                                C23570007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C23580007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           23590009
           MVC   ACTOUT,=C'TRUE '                                       23600007
         ELSE                                                           23610007
           MVC   ACTOUT,=C'FALSE'                                       23620007
         ENDIF                                                          23630007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  23640007
           MVC   ERROR,=C'<=== ERROR'                                   23650007
         ENDIF                                                          23660007
         PUT   SYSPRINT,OUTPUT                                          23670007
         MVC   ERROR,=CL10' '                                           23680007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 23690007
         MVI   VARBL1,C'A'         SET TO PASS                          23700007
         LA    R15,0               SET TO PASS                          23710007
         MVI   VARBL3,X'01'        SET TO FAIL                          23720007
         PACK  PACK1,=Z'2'         SET TO FAIL                          23730007
         MVI   TSWITCH,X'10'       SET TO PASS                          23740007
         MVC   PREDOUT,=C'TRUE '                                        23750011
         MVC   TESTNBR,=C'TEST130M'                                     23760007
*                                                                       23770007
TEST130M IF    (CLI,VARBL1,C'A',E),AND,                                C23780007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C23790007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           23800009
           MVC   ACTOUT,=C'TRUE '                                       23810007
         ELSE                                                           23820007
           MVC   ACTOUT,=C'FALSE'                                       23830007
         ENDIF                                                          23840007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  23850007
           MVC   ERROR,=C'<=== ERROR'                                   23860007
         ENDIF                                                          23870007
         PUT   SYSPRINT,OUTPUT                                          23880007
         MVC   ERROR,=CL10' '                                           23890007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 23900007
         BALR  R12,0                                                    23901017
         USING *,R12                                                    23902017
         MVI   VARBL1,C'Z'         SET TO FAIL                          23910007
         LA    R15,0               SET TO PASS                          23920007
         MVI   VARBL3,X'01'        SET TO FAIL                          23930007
         PACK  PACK1,=Z'2'         SET TO FAIL                          23940007
         MVI   TSWITCH,X'10'       SET TO PASS                          23950007
         MVC   PREDOUT,=C'FALSE'                                        23960007
         MVC   TESTNBR,=C'TEST130N'                                     23970007
*                                                                       23980007
TEST130N IF    (CLI,VARBL1,C'A',E),AND,                                C23990007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C24000007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           24010009
           MVC   ACTOUT,=C'TRUE '                                       24020007
         ELSE                                                           24030007
           MVC   ACTOUT,=C'FALSE'                                       24040007
         ENDIF                                                          24050007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  24060007
           MVC   ERROR,=C'<=== ERROR'                                   24070007
         ENDIF                                                          24080007
         PUT   SYSPRINT,OUTPUT                                          24090007
         MVC   ERROR,=CL10' '                                           24100007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 24110007
         MVI   VARBL1,C'A'         SET TO PASS                          24120007
         LA    R15,1               SET TO FAIL                          24130007
         MVI   VARBL3,X'01'        SET TO FAIL                          24140007
         PACK  PACK1,=Z'2'         SET TO FAIL                          24150007
         MVI   TSWITCH,X'10'       SET TO PASS                          24160007
         MVC   PREDOUT,=C'FALSE'                                        24170007
         MVC   TESTNBR,=C'TEST130O'                                     24180007
*                                                                       24190007
TEST130O IF    (CLI,VARBL1,C'A',E),AND,                                C24200007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C24210007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           24220009
           MVC   ACTOUT,=C'TRUE '                                       24230007
         ELSE                                                           24240007
           MVC   ACTOUT,=C'FALSE'                                       24250007
         ENDIF                                                          24260007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  24270007
           MVC   ERROR,=C'<=== ERROR'                                   24280007
         ENDIF                                                          24290007
         PUT   SYSPRINT,OUTPUT                                          24300007
         MVC   ERROR,=CL10' '                                           24310007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 24320007
         MVI   VARBL1,C'Z'         SET TO FAIL                          24330007
         LA    R15,1               SET TO FAIL                          24340007
         MVI   VARBL3,X'01'        SET TO FAIL                          24350007
         PACK  PACK1,=Z'2'         SET TO FAIL                          24360007
         MVI   TSWITCH,X'10'       SET TO PASS                          24370007
         MVC   PREDOUT,=C'FALSE'                                        24380007
         MVC   TESTNBR,=C'TEST130P'                                     24390007
*                                                                       24400007
TEST130P IF    (CLI,VARBL1,C'A',E),AND,                                C24410007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C24420007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           24430009
           MVC   ACTOUT,=C'TRUE '                                       24440007
         ELSE                                                           24450007
           MVC   ACTOUT,=C'FALSE'                                       24460007
         ENDIF                                                          24470007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  24480007
           MVC   ERROR,=C'<=== ERROR'                                   24490007
         ENDIF                                                          24500007
         PUT   SYSPRINT,OUTPUT                                          24510007
         MVC   ERROR,=CL10' '                                           24520007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 24530007
         MVI   VARBL1,C'A'         SET TO PASS                          24560007
         LA    R15,0               SET TO PASS                          24570007
         MVI   VARBL3,X'00'        SET TO PASS                          24580007
         PACK  PACK1,=Z'1'         SET TO PASS                          24590007
         MVI   TSWITCH,X'00'       SET TO FAIL                          24600007
         MVC   PREDOUT,=C'TRUE '                                        24610007
         MVC   TESTNBR,=C'TEST130Q'                                     24620007
*                                                                       24630007
TEST130Q IF    (CLI,VARBL1,C'A',E),AND,                                C24640007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C24650007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           24660009
           MVC   ACTOUT,=C'TRUE '                                       24670007
         ELSE                                                           24680007
           MVC   ACTOUT,=C'FALSE'                                       24690007
         ENDIF                                                          24700007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  24710007
           MVC   ERROR,=C'<=== ERROR'                                   24720007
         ENDIF                                                          24730007
         PUT   SYSPRINT,OUTPUT                                          24740007
         MVC   ERROR,=CL10' '                                           24750007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 24760007
         MVI   VARBL1,C'Z'         SET TO FAIL                          24770007
         LA    R15,0               SET TO PASS                          24780007
         MVI   VARBL3,X'00'        SET TO PASS                          24790007
         PACK  PACK1,=Z'1'         SET TO PASS                          24800007
         MVI   TSWITCH,X'00'       SET TO FAIL                          24810007
         MVC   PREDOUT,=C'FALSE'                                        24820007
         MVC   TESTNBR,=C'TEST230R'                                     24830007
*                                                                       24840007
TEST130R IF    (CLI,VARBL1,C'A',E),AND,                                C24850007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C24860007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           24870009
           MVC   ACTOUT,=C'TRUE '                                       24880007
         ELSE                                                           24890007
           MVC   ACTOUT,=C'FALSE'                                       24900007
         ENDIF                                                          24910007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  24920007
           MVC   ERROR,=C'<=== ERROR'                                   24930007
         ENDIF                                                          24940007
         PUT   SYSPRINT,OUTPUT                                          24950007
         MVC   ERROR,=CL10' '                                           24960007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 24970007
         MVI   VARBL1,C'A'         SET TO PASS                          24980007
         LA    R15,1               SET TO FAIL                          24990007
         MVI   VARBL3,X'00'        SET TO PASS                          25000007
         PACK  PACK1,=Z'1'         SET TO PASS                          25010007
         MVI   TSWITCH,X'00'       SET TO FAIL                          25020007
         MVC   PREDOUT,=C'TRUE '                                        25030007
         MVC   TESTNBR,=C'TEST130S'                                     25040007
*                                                                       25050007
TEST130S IF    (CLI,VARBL1,C'A',E),AND,                                C25060007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C25070007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           25080009
           MVC   ACTOUT,=C'TRUE '                                       25090007
         ELSE                                                           25100007
           MVC   ACTOUT,=C'FALSE'                                       25110007
         ENDIF                                                          25120007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  25130007
           MVC   ERROR,=C'<=== ERROR'                                   25140007
         ENDIF                                                          25150007
         PUT   SYSPRINT,OUTPUT                                          25160007
         MVC   ERROR,=CL10' '                                           25170007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 25180007
         MVI   VARBL1,C'Z'         SET TO FAIL                          25190007
         LA    R15,1               SET TO FAIL                          25200007
         MVI   VARBL3,X'00'        SET TO PASS                          25210007
         PACK  PACK1,=Z'1'         SET TO PASS                          25220007
         MVI   TSWITCH,X'00'       SET TO FAIL                          25230007
         MVC   PREDOUT,=C'FALSE'                                        25240007
         MVC   TESTNBR,=C'TEST130T'                                     25250007
*                                                                       25260007
TEST130T IF    (CLI,VARBL1,C'A',E),AND,                                C25270007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C25280007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           25290009
           MVC   ACTOUT,=C'TRUE '                                       25300007
         ELSE                                                           25310007
           MVC   ACTOUT,=C'FALSE'                                       25320007
         ENDIF                                                          25330007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  25340007
           MVC   ERROR,=C'<=== ERROR'                                   25350007
         ENDIF                                                          25360007
         PUT   SYSPRINT,OUTPUT                                          25370007
         MVC   ERROR,=CL10' '                                           25380007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 25390007
         MVI   VARBL1,C'A'         SET TO PASS                          25400007
         LA    R15,0               SET TO PASS                          25410007
         MVI   VARBL3,X'01'        SET TO FAIL                          25420007
         PACK  PACK1,=Z'1'         SET TO PASS                          25430007
         MVI   TSWITCH,X'00'       SET TO FAIL                          25440007
         MVC   PREDOUT,=C'TRUE '                                        25450007
         MVC   TESTNBR,=C'TEST130U'                                     25460007
*                                                                       25470007
TEST130U IF    (CLI,VARBL1,C'A',E),AND,                                C25480007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C25490007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           25500009
           MVC   ACTOUT,=C'TRUE '                                       25510007
         ELSE                                                           25520007
           MVC   ACTOUT,=C'FALSE'                                       25530007
         ENDIF                                                          25540007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  25550007
           MVC   ERROR,=C'<=== ERROR'                                   25560007
         ENDIF                                                          25570007
         PUT   SYSPRINT,OUTPUT                                          25580007
         MVC   ERROR,=CL10' '                                           25590007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 25600007
         MVI   VARBL1,C'Z'         SET TO FAIL                          25610007
         LA    R15,0               SET TO PASS                          25620007
         MVI   VARBL3,X'01'        SET TO FAIL                          25630007
         PACK  PACK1,=Z'1'         SET TO PASS                          25640007
         MVI   TSWITCH,X'00'       SET TO FAIL                          25650007
         MVC   PREDOUT,=C'FALSE'                                        25660007
         MVC   TESTNBR,=C'TEST130V'                                     25670007
*                                                                       25680007
TEST130V IF    (CLI,VARBL1,C'A',E),AND,                                C25690007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C25700007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           25710009
           MVC   ACTOUT,=C'TRUE '                                       25720007
         ELSE                                                           25730007
           MVC   ACTOUT,=C'FALSE'                                       25740007
         ENDIF                                                          25750007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  25760007
           MVC   ERROR,=C'<=== ERROR'                                   25770007
         ENDIF                                                          25780007
         PUT   SYSPRINT,OUTPUT                                          25790007
         MVC   ERROR,=CL10' '                                           25800007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 25810007
         MVI   VARBL1,C'A'         SET TO PASS                          25820007
         LA    R15,1               SET TO FAIL                          25830007
         MVI   VARBL3,X'01'        SET TO FAIL                          25840007
         PACK  PACK1,=Z'1'         SET TO PASS                          25850007
         MVI   TSWITCH,X'00'       SET TO FAIL                          25860007
         MVC   PREDOUT,=C'FALSE'                                        25870007
         MVC   TESTNBR,=C'TEST230W'                                     25880007
*                                                                       25890007
TEST130W IF    (CLI,VARBL1,C'A',E),AND,                                C25900007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C25910007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           25920009
           MVC   ACTOUT,=C'TRUE '                                       25930007
         ELSE                                                           25940007
           MVC   ACTOUT,=C'FALSE'                                       25950007
         ENDIF                                                          25960007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  25970007
           MVC   ERROR,=C'<=== ERROR'                                   25980007
         ENDIF                                                          25990007
         PUT   SYSPRINT,OUTPUT                                          26000007
         MVC   ERROR,=CL10' '                                           26010007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 26020007
         MVI   VARBL1,C'Z'         SET TO FAIL                          26030007
         LA    R15,1               SET TO FAIL                          26040007
         MVI   VARBL3,X'01'        SET TO FAIL                          26050007
         PACK  PACK1,=Z'1'         SET TO PASS                          26060007
         MVI   TSWITCH,X'00'       SET TO FAIL                          26070007
         MVC   PREDOUT,=C'FALSE'                                        26080007
         MVC   TESTNBR,=C'TEST130X'                                     26090007
*                                                                       26100007
TEST130X IF    (CLI,VARBL1,C'A',E),AND,                                C26110007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C26120007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           26130009
           MVC   ACTOUT,=C'TRUE '                                       26140007
         ELSE                                                           26150007
           MVC   ACTOUT,=C'FALSE'                                       26160007
         ENDIF                                                          26170007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  26180007
           MVC   ERROR,=C'<=== ERROR'                                   26190007
         ENDIF                                                          26200007
         PUT   SYSPRINT,OUTPUT                                          26210007
         MVC   ERROR,=CL10' '                                           26220007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 26230007
         MVI   VARBL1,C'A'         SET TO PASS                          26240007
         LA    R15,0               SET TO PASS                          26250007
         MVI   VARBL3,X'00'        SET TO PASS                          26260007
         PACK  PACK1,=Z'2'         SET TO FAIL                          26270007
         MVI   TSWITCH,X'00'       SET TO FAIL                          26280007
         MVC   PREDOUT,=C'TRUE '                                        26290007
         MVC   TESTNBR,=C'TEST130Y'                                     26300007
*                                                                       26310007
TEST130Y IF    (CLI,VARBL1,C'A',E),AND,                                C26320007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C26330007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           26340009
           MVC   ACTOUT,=C'TRUE '                                       26350007
         ELSE                                                           26360007
           MVC   ACTOUT,=C'FALSE'                                       26370007
         ENDIF                                                          26380007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  26390007
           MVC   ERROR,=C'<=== ERROR'                                   26400007
         ENDIF                                                          26410007
         PUT   SYSPRINT,OUTPUT                                          26420007
         MVC   ERROR,=CL10' '                                           26430007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 26440007
         MVI   VARBL1,C'Z'         SET TO FAIL                          26450007
         LA    R15,0               SET TO PASS                          26460007
         MVI   VARBL3,X'00'        SET TO PASS                          26470007
         PACK  PACK1,=Z'2'         SET TO FAIL                          26480007
         MVI   TSWITCH,X'00'       SET TO FAIL                          26490007
         MVC   PREDOUT,=C'FALSE'                                        26500007
         MVC   TESTNBR,=C'TEST130Z'                                     26510007
*                                                                       26520007
TEST130Z IF    (CLI,VARBL1,C'A',E),AND,                                C26530007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C26540007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           26550009
           MVC   ACTOUT,=C'TRUE '                                       26560007
         ELSE                                                           26570007
           MVC   ACTOUT,=C'FALSE'                                       26580007
         ENDIF                                                          26590007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  26600007
           MVC   ERROR,=C'<=== ERROR'                                   26610007
         ENDIF                                                          26620007
         PUT   SYSPRINT,OUTPUT                                          26630007
         MVC   ERROR,=CL10' '                                           26640007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 26650007
         MVI   VARBL1,C'A'         SET TO PASS                          26660007
         LA    R15,1               SET TO FAIL                          26670007
         MVI   VARBL3,X'00'        SET TO PASS                          26680007
         PACK  PACK1,=Z'2'         SET TO FAIL                          26690007
         MVI   TSWITCH,X'00'       SET TO FAIL                          26700007
         MVC   PREDOUT,=C'FALSE'                                        26710007
         MVC   TESTNBR,=C'TEST1300'                                     26720007
*                                                                       26730007
TEST1300 IF    (CLI,VARBL1,C'A',E),AND,                                C26740007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C26750007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           26760009
           MVC   ACTOUT,=C'TRUE '                                       26770007
         ELSE                                                           26780007
           MVC   ACTOUT,=C'FALSE'                                       26790007
         ENDIF                                                          26800007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  26810007
           MVC   ERROR,=C'<=== ERROR'                                   26820007
         ENDIF                                                          26830007
         PUT   SYSPRINT,OUTPUT                                          26840007
         MVC   ERROR,=CL10' '                                           26850007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 26860007
         MVI   VARBL1,C'Z'         SET TO FAIL                          26870007
         LA    R15,1               SET TO FAIL                          26880007
         MVI   VARBL3,X'00'        SET TO PASS                          26890007
         PACK  PACK1,=Z'2'         SET TO FAIL                          26900007
         MVI   TSWITCH,X'00'       SET TO FAIL                          26910007
         MVC   PREDOUT,=C'FALSE'                                        26920007
         MVC   TESTNBR,=C'TEST1301'                                     26930007
*                                                                       26940007
TEST1301 IF    (CLI,VARBL1,C'A',E),AND,                                C26950007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C26960007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           26970009
           MVC   ACTOUT,=C'TRUE '                                       26980007
         ELSE                                                           26990007
           MVC   ACTOUT,=C'FALSE'                                       27000007
         ENDIF                                                          27010007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  27020007
           MVC   ERROR,=C'<=== ERROR'                                   27030007
         ENDIF                                                          27040007
         PUT   SYSPRINT,OUTPUT                                          27050007
         MVC   ERROR,=CL10' '                                           27060007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 27070007
         MVI   VARBL1,C'A'         SET TO PASS                          27080007
         LA    R15,0               SET TO PASS                          27090007
         MVI   VARBL3,X'01'        SET TO FAIL                          27100007
         PACK  PACK1,=Z'2'         SET TO FAIL                          27110007
         MVI   TSWITCH,X'00'       SET TO FAIL                          27120007
         MVC   PREDOUT,=C'TRUE '                                        27130007
         MVC   TESTNBR,=C'TEST1302'                                     27140007
*                                                                       27150007
TEST1302 IF    (CLI,VARBL1,C'A',E),AND,                                C27160007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C27170007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           27180009
           MVC   ACTOUT,=C'TRUE '                                       27190007
         ELSE                                                           27200007
           MVC   ACTOUT,=C'FALSE'                                       27210007
         ENDIF                                                          27220007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  27230007
           MVC   ERROR,=C'<=== ERROR'                                   27240007
         ENDIF                                                          27250007
         PUT   SYSPRINT,OUTPUT                                          27260007
         MVC   ERROR,=CL10' '                                           27270007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 27280007
         MVI   VARBL1,C'Z'         SET TO FAIL                          27290007
         LA    R15,0               SET TO PASS                          27300007
         MVI   VARBL3,X'01'        SET TO FAIL                          27310007
         PACK  PACK1,=Z'2'         SET TO FAIL                          27320007
         MVI   TSWITCH,X'00'       SET TO FAIL                          27330007
         MVC   PREDOUT,=C'FALSE'                                        27340007
         MVC   TESTNBR,=C'TEST1303'                                     27350007
*                                                                       27360007
TEST1303 IF    (CLI,VARBL1,C'A',E),AND,                                C27370007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C27380007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           27390009
           MVC   ACTOUT,=C'TRUE '                                       27400007
         ELSE                                                           27410007
           MVC   ACTOUT,=C'FALSE'                                       27420007
         ENDIF                                                          27430007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  27440007
           MVC   ERROR,=C'<=== ERROR'                                   27450007
         ENDIF                                                          27460007
         PUT   SYSPRINT,OUTPUT                                          27470007
         MVC   ERROR,=CL10' '                                           27480007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 27490007
         MVI   VARBL1,C'A'         SET TO PASS                          27500007
         LA    R15,1               SET TO FAIL                          27510007
         MVI   VARBL3,X'01'        SET TO FAIL                          27520007
         PACK  PACK1,=Z'2'         SET TO FAIL                          27530007
         MVI   TSWITCH,X'00'       SET TO FAIL                          27540007
         MVC   PREDOUT,=C'FALSE'                                        27550007
         MVC   TESTNBR,=C'TEST1304'                                     27560007
*                                                                       27570007
TEST1304 IF    (CLI,VARBL1,C'A',E),AND,                                C27580007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C27590007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           27600009
           MVC   ACTOUT,=C'TRUE '                                       27610007
         ELSE                                                           27620007
           MVC   ACTOUT,=C'FALSE'                                       27630007
         ENDIF                                                          27640007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  27650007
           MVC   ERROR,=C'<=== ERROR'                                   27660007
         ENDIF                                                          27670007
         PUT   SYSPRINT,OUTPUT                                          27680007
         MVC   ERROR,=CL10' '                                           27690007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 27700007
         MVI   VARBL1,C'Z'         SET TO FAIL                          27710007
         LA    R15,1               SET TO FAIL                          27720007
         MVI   VARBL3,X'01'        SET TO FAIL                          27730007
         PACK  PACK1,=Z'2'         SET TO FAIL                          27740007
         MVI   TSWITCH,X'00'       SET TO FAIL                          27750007
         MVC   PREDOUT,=C'FALSE'                                        27760007
         MVC   TESTNBR,=C'TEST1305'                                     27770007
*                                                                       27780007
TEST1305 IF    (CLI,VARBL1,C'A',E),AND,                                C27790007
               ((LTR,R15,R15,Z),OR,(TM,VARBL3,X'01',Z),AND,            C27800007
               ((SP,PACK1,=P'1',Z),OR,(CLI,TSWITCH,X'10',E)))           27810009
           MVC   ACTOUT,=C'TRUE '                                       27820007
         ELSE                                                           27830007
           MVC   ACTOUT,=C'FALSE'                                       27840007
         ENDIF                                                          27850007
         IF    (CLC,PREDOUT,ACTOUT,NE)                                  27860007
           MVC   ERROR,=C'<=== ERROR'                                   27870007
         ENDIF                                                          27880007
         PUT   SYSPRINT,OUTPUT                                          27890007
         MVC   ERROR,=CL10' '                                           27900007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 27910007
*                                                                     * 27920007
*      THESE FOLLOWING STATEMENTS ARE NORMAL zOS TERMINATION.         * 27930007
*                                                                     * 27940007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 27950007
*                                                                       27960007
         BALR  R12,0                                                    27961015
         USING *,R12                                                    27962015
         CLOSE SYSPRINT                                                 27970007
*                                                                       27980007
         L     R13,SAVEAREA+4      ADDRESS OF CALLER'S SAVE AREA        27990007
         DROP  R13                                                      28000007
         LM    R14,R12,12(R13)     RESTORE R14 WRAPPED AROUND TO R12    28010007
         DROP  R12                 NO LONGER VALID                      28020007
         SLR   R15,R15             SET RETURN CODE TO ZERO              28030007
         BR    R14                 RETURN TO CALLER                     28040007
*                                                                       28050007
$$WA$$   CSECT                                                          28060007
         LTORG                                                          28070007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 28080007
*                                                                     * 28090007
*      THESE FOLLOWING STATEMENTS DEFINE VARIABLES REQUIRED.          * 28100007
*                                                                     * 28110007
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=* 28120007
PACK1    DC    PL4'0'                                                   28130007
OUTPUT   DC    CL133' '                                                 28140007
         ORG   OUTPUT                                                   28150007
         DC    C' '                                                     28160007
TESTNBR  DC    CL8' '                                                   28170007
         DC    C' PREDICTED OUTCOME: '                                  28180007
PREDOUT  DC    CL5' '                                                   28190007
         DC    C'; ACTUAL OUTCOME: '                                    28200007
ACTOUT   DC    CL5' ',C' '                                              28210007
ERROR    DC    CL10' '                                                  28220007
         ORG   OUTPUT+133                                               28230007
VARBL1   DC    C' '                                                     28240007
VARBL2   DC    C' '                                                     28250007
VARBL3   DC    C' '                                                     28260007
VARBL4   DC    C' '                                                     28270007
TSWITCH  DC    X'00'                                                    28280007
         PUSH  PRINT                                                    28290007
         PRINT NOGEN                                                    28300007
SYSPRINT DCB   DDNAME=SYSPRINT,    DEFAULT DDNAME                      C28310007
               LRECL=133,          LOGICAL RECORD LENGTH               C28320007
               RECFM=FBA,DSORG=PS,MACRF=PM                              28330007
         POP   PRINT                                                    28340007
IFTEST   CSECT                                                          28350007
         END   IFTEST                                                   28360007