         MACRO                                                          00050000
         IHBERMAC &A,&B,&D,&E,&F,&H                                     00100000
.***** START OF SPECIFICATIONS **************************************** 00150000
.*                                                                      00192300
.*01*  MODULE-NAME = IHBERMAC                                           00234600
.*                                                                      00276900
.*01*  DESCRIPTIVE-NAME = ERROR MESSAGE MACRO                           00319200
.*                                                                      00361500
.*01*  COPYRIGHT =                                                 @L1C 00403800
.*                                                                      00446100
.*      5685-001                                                        00488400
.*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                     00530700
.*      (C)COPYRIGHT IBM CORP. 1980, 1988                               00573000
.*      LICENSED MATERIALS - PROPERTY OF IBM                            00615300
.*                                                                      00742200
.*01*  STATUS = HBB3310                                            @L1C 00784500
.*                                                                      00826800
.*01*  FUNCTION = GENERATES ERROR MESSAGES DURING MACRO PROCESSING.     00869100
.*                                                                      00911400
.*01*  MODULE-TYPE = MACRO                                              00953700
.*                                                                      00996000
.*01*  PROCESSOR = ASSEMBLER-H                                          01038300
.*                                                                      01080600
.*01*  MACROS = NONE                                                    01122900
.*                                                                      01165200
.*01*  COMPONENT = SC1CL (TASK MANAGEMENT)                              01173600
.*                                                                      01182000
.*01*  MACLIB = AMACLIB                                                 01190400
.*                                                                      01198800
.*01*  CHANGE ACTIVITY =                                                01207500
.* UPDATED FOR OS/VS2 JBB1226. (PC/AUTH SERVICES) SUPPORT CODE=@G382PXX 01250000
.*                                                                      01300000
.*  $L1=AR       HBB3310  850828  PD16H4: ACCESS REGISTER SUPPORT       01350000
.*                                                                      01400000
.***** END OF SPECIFICATIONS ****************************************** 01450000
.*                                                                      01466600
.*                                                                      01483200
         LCLA  &H1                                                      01500000
         LCLC  &G(14)                                                   01550000
         LCLC  &C                                                       01600000
&C       SETC  '***  IHB'                                               01650000
         AIF   (&A GT 1000).OS1000                                      01700000
         AIF   (&A GT 288).INVALID                             @ZMC2855 01750000
         AIF   (&A GT 279).ARG                                 @Z40MP9B 01800000
         AIF   (&A GT 274).INVALID                               YM2157 01850000
         AIF   (&A GT 266).SHARK4                                YM2157 01900000
         AIF   (&A GT 264).SHARK3                                YM2157 01950000
         AIF   (&A GT 261).INVALID                               YM2157 02000000
         AIF   (&A GT 259).SHARK1                                YM2157 02050000
         AIF   (&A GT 254).INVALID                               YM2157 02100000
         AIF   (&A GT 249).SHARK2                                YM2157 02150000
         AIF   (&A GT 232).NEXT3                                  20202 02200000
         AIF   (&A GE 202).OCR                                    20202 02250000
         AIF   (&A GT 197).NEXT2                                  19033 02300000
.*0824                                                             LC0A 02350000
         AIF   (&A GT 179).GRAP                                         02400000
         AIF   (&A GT 99).NEXT                                          02450000
         AIF   (&A EQ 1).E24                                            02500000
         AIF   (&A LE 13).E13                                           02550000
         AIF   (&A EQ 24).E24                                           02600000
         AIF   (&A LE 25).E25                                           02650000
         AIF   (&A EQ 26).E26                                           02700000
         AIF   (&A EQ 27).E27                                           02750000
         AIF   (&A EQ 31).E31                                           02800000
         AIF   (&A LE 34).E34                                           02850000
         AIF   (&A EQ 42).E42                                           02900000
         AIF   (&A LE 46).E46                                           02950000
         AIF   (&A EQ 47).E47                                           03000000
         AIF   (&A EQ 52).E52                                           03050000
         AIF   (&A LE 57).E57                                           03100000
         AIF   (&A EQ 60).E60                                           03150000
         AIF   (&A EQ 61).E61                                           03200000
         AIF   (&A LE 67).E67                                           03250000
         AIF   (&A EQ 69).E69                                           03300000
         AIF   (&A EQ 71).E71                                           03350000
         AIF   (&A EQ 72).E72                                           03400000
         AIF   (&A EQ 73).E73                                           03450000
         AIF   (&A EQ 74).E74                                           03500000
         AIF   (&A EQ 75).E75                                           03550000
         AIF   (&A EQ 78).E78                                           03600000
         AIF   (&A EQ 84).E84                                           03650000
         AIF   (&A EQ 87).E87                                           03700000
         AIF   (&A EQ 88).E88                                           03750000
         AIF   (&A EQ 89).E89                                           03800000
         AIF   (&A EQ 90).E90                                           03850000
         AIF   (&A EQ 91).E91                                           03900000
         AIF   (&A EQ 92).E92                                           03950000
         AIF   (&A EQ 93).E93                                           04000000
         AIF   (&A EQ 94).E94                                           04050000
         AIF   (&A EQ 95).E95                                           04100000
.NEXT    AIF   (&A LE 147).DCBA                                         04150000
         AIF   (&A LE 157).DCBB                                         04200000
         AIF   (&A EQ 158).DCBC                                         04250000
         AIF   (&A EQ 159).DCBD                                         04300000
         AIF   (&A EQ 160).DCBE                                         04350000
         AIF   (&A EQ 161).DCBF                                         04400000
         AIF   (&A EQ 162).DCBG                                         04450000
         AIF   (&A EQ 163).DCBH                                         04500000
         AIF   (&A EQ 164).DCBI                                         04550000
         AIF   (&A EQ 165).DCBJ                                         04600000
         AIF   (&A EQ 166).DCBK                                         04650000
         AIF   (&A EQ 167).DCBQ                                         04700000
         AIF   (&A EQ 168).DCBR                                         04750000
         AIF   (&A EQ 169).DCBS                                         04800000
         AIF   (&A EQ 170).DCBL                                         04850000
         AIF   (&A EQ 171).DCBM                                         04900000
         AIF   (&A EQ 172).DCBN                                         04950000
         AIF   (&A EQ 173).DCBO                                         05000000
         AIF   (&A EQ 174).DCBP                                         05050000
         AIF   (&A EQ 175).DCBAE                                        05100000
         AIF   (&A EQ 176).DCBAA                                        05150000
         AIF   (&A EQ 177).DCBAB                                        05200000
         AIF   (&A EQ 178).DCBAC                                        05250000
         AIF   (&A EQ 179).DCBAD                                        05300000
.GRAP    AIF   (&A EQ 180).E180                                         05350000
         AIF   (&A EQ 181).E181                                         05400000
         AIF   (&A EQ 182).E182                                         05450000
         AIF   (&A EQ 183).E183                                         05500000
         AIF   (&A EQ 184).E184                                         05550000
         AIF   (&A EQ 185).E185                                         05600000
         AIF   (&A EQ 186).E186                                         05650000
         AIF   (&A EQ 187).E187                                         05700000
         AIF   (&A EQ 188).E188                                         05750000
         AIF   (&A EQ 189).E189                                         05800000
         AIF   (&A EQ 190).SETPRA                                  UCSA 05850000
         AIF   (&A EQ 191).SETPRB                                  UCSA 05900000
         AIF   (&A EQ 192).SETPRC                                  UCSA 05950000
         AIF   (&A EQ 193).SETPRD                                  UCSA 06000000
         AIF   (&A EQ 194).SETPRE                                  UCSA 06050000
         AIF   (&A EQ 195).LCSERR                                  LC0A 06100000
         AIF   (&A EQ 196).E196                                    SD0A 06150000
         AIF   (&A EQ 197).E197                                         06200000
.NEXT2   ANOP                                                     19033 06250000
         AIF   (&A EQ 198).E198                                   19033 06300000
         AIF   (&A EQ 199).E199                                   19033 06350000
         AIF   (&A EQ 200).E200                                   19033 06400000
         AIF   (&A EQ 201).E201                                   19033 06450000
.OCR     AIF   (&A EQ 202).OCR120                                 19017 06500000
         AIF   (&A EQ 203).OCR121                                 19017 06550000
         AIF   (&A EQ 204).OCR122                                 19017 06600000
         AIF   (&A EQ 205).OCR123                                 19017 06650000
         AIF   (&A EQ 206).OCR124                                 19017 06700000
         AIF   (&A EQ 207).OCR125                                 19017 06750000
         AIF   (&A EQ 208).OCR126                                 19017 06800000
         AIF   (&A EQ 209).OCR127                                 19017 06850000
         AIF   (&A EQ 210).OCR128                                 19017 06900000
         AIF   (&A EQ 211).OCR129                                 19017 06950000
         AIF   (&A EQ 212).OCR130                                 19017 07000000
         AIF   (&A EQ 213).OCR131                                 19017 07050000
         AIF   (&A EQ 214).OCR132                                 19017 07100000
         AIF   (&A EQ 215).OCR133                                 19017 07150000
         AIF   (&A EQ 216).OCR134                                 19017 07200000
         AIF   (&A EQ 217).OCR135                                 19017 07250000
         AIF   (&A EQ 218).OCR136                                 19017 07300000
         AIF   (&A EQ 219).OCR137                                 19017 07350000
         AIF   (&A EQ 220).OCR138                                 19017 07400000
         AIF   (&A EQ 221).OCR139                                 19017 07450000
         AIF   (&A EQ 222).OCR140                                 19017 07500000
         AIF   (&A EQ 223).OCR141                                 19017 07550000
         AIF   (&A EQ 224).OCR142                                 19017 07600000
         AIF   (&A EQ 225).OCR143                                 19017 07650000
         AIF   (&A EQ 226).OCR144                                 19017 07700000
         AIF   (&A EQ 227).OCR145                                 19017 07750000
         AIF   (&A EQ 228).OCR146                                 19017 07800000
         AIF   (&A EQ 229).OCR147                                X02959 07850000
.NEXT3   ANOP                                                     20202 07900000
         AIF   (&A EQ 236).TOD236                                 20071 07950000
         AIF   (&A EQ 237).SETPRF                                 20202 08000000
         AIF   (&A EQ 238).A027                                  A28592 08050000
         AIF   (&A EQ 240).REDPIKE                                      08100000
         AIF   (&A EQ 241).PIKERED                                      08150000
         AIF   (&A EQ 242).M1428A                                       08200000
         AIF   (&A EQ 243).M1428B                                       08250000
         AIF   (&A EQ 244).M1428C                                       08300000
         AIF   (&A EQ 245).M1428D                                       08350000
         AIF   (&A EQ 246).M1428E                                       08400000
         AIF   (&A EQ 247).INNER                                        08450000
         AIF   (&A EQ 248).HDCY1                                        08500000
.ARG     ANOP                                                  @Z40MP9B 08550000
         AIF   (&A EQ 280).ARG282                              @Z40MP9B 08600000
         AIF   (&A EQ 281).ARG283                              @Z40MP9B 08650000
         AIF   (&A EQ 282).ARG284                              @Z40MP9B 08700000
         AIF   (&A EQ 283).ARG285                              @Z40MP9B 08750000
         AIF   (&A EQ 284).ARG286                              @Z40MP9B 08800000
         AIF   (&A EQ 285).ARG287                              @Z40MP9B 08850000
         AIF   (&A EQ 286).ARG288                              @Z40MP9B 08900000
         AIF   (&A EQ 287).ARG289                              @Z40MP9B 08950000
         AIF   (&A EQ 288).ARG290                              @Z40MP9B 09000000
         AGO   .INVALID                                                 09350000
.HDCY1   MNOTE 16,'&C.375 MCSFLAG=HRDCPY INVALID FOR MLWTO - GENERATIONX09400000
                TERMINATED'                                      X02037 09450000
         MEXIT                                                          09500000
.INNER   MNOTE 12,'&C.084 IPLTXID OPERAND EXCEEDS 7 CHARACTERS.'        09550000
         MEXIT                                                          09600000
.DCBA    MNOTE 4,'&C.050  &B OPERAND INCONSISTENT-IGNORED'              09650000
         MEXIT                                                          09700000
.DCBB    MNOTE 8,'&C.051  &D INVALID CODE FOR &B-IGNORED'               09750000
         MEXIT                                                          09800000
.DCBC    MNOTE 12,'&C.052  DSORG OMITTED'                               09850000
         MEXIT                                                          09900000
.DCBD    MNOTE 12,'&C.053  &D INVALID CODE FOR DSORG'                   09950000
         MEXIT                                                          10000000
.DCBE    MNOTE 8,'&C.054  &D INVALID DSORG QUALIFIER-IGNORED'           10050000
         MEXIT                                                          10100000
.DCBF    MNOTE 8,'&C.055  MACRF NOT SPECIFIED-EXCP ASSUMED'             10150000
         MEXIT                                                          10200000
.DCBG    MNOTE 8,'&C.056  &D OF MACRF INVALID WITH DSORG=&E-IGNORED'    10250000
         MEXIT                                                          10300000
.DCBH    MNOTE 8,'&C.057  &D INVALID QUALIFIER FOR &E OF MACRF IF DSORGX10350000
               =&F-IGNORED'                                             10400000
         MEXIT                                                          10450000
.DCBI    MNOTE 8,'&C.058  &D OF RECFM INVALID WITH DSORG=&E-IGNORED'    10500000
         MEXIT                                                          10550000
.DCBJ    MNOTE 8,'&C.059  &D OF OPTCD INVALID WITH DSORG=&E-IGNORED'    10600000
         MEXIT                                                          10650000
.DCBK    MNOTE 8,'&C.060  &D INVALID CODE FOR DEVD WITH DSORG=&E-IGNOREX10700000
               D'                                                       10750000
         MEXIT                                                          10800000
.DCBL    MNOTE 8,'&C.065  MACRF=&D INVALID-EXCP ASSUMED'                10850000
         MEXIT                                                          10900000
.DCBM    MNOTE 12,'&C.066  INCONSISTENT OPERAND'                        10950000
         MEXIT                                                          11000000
.DCBN    MNOTE 4,'&C.067  DCBD MACRO PREVIOUSLY USED'                   11050000
         MEXIT                                                          11100000
.DCBO    MNOTE *,'&C.068  NO VALID DSORG SPECIFIED-EXCP ASSUMED'        11150000
         MEXIT                                                          11200000
.DCBP    MNOTE *,'&C.069  DEVD NOT SPECIFIED-ALL ASSUMED'               11250000
         MEXIT                                                          11300000
.DCBQ    MNOTE *,'&C.061  DDNAME NOT SPECIFIED'                         11350000
         MEXIT                                                          11400000
.DCBR    MNOTE 4,'&C.062  DDNAME LONG-TRUNCATED TO 8 CHAR'              11450000
         MEXIT                                                          11500000
.DCBS    MNOTE *,'&C.250  DDNAME SHORT-PADDED TO 8 CHAR'         X02959 11550000
         MEXIT                                                          11600000
.DCBAA   MNOTE *,'&C.252  &D TOO LONG FOR &B-TRUNCATED TO 2 CHAR'       11650000
         MEXIT                                                          11700000
.DCBAB   MNOTE *,'&C.253  &D TOO SHORT FOR &B-PADDED TO 2 CHAR'  X02959 11750000
         MEXIT                                                          11800000
.DCBAC   MNOTE *,'&C.254  &B NOT SPECIFIED-PRESET TO &D'         X02959 11850000
         MEXIT                                                          11900000
.DCBAD   MNOTE 4,'&C.073  AERR OPERAND REQUIRES UMSK OPERAND'    X02959 11950000
         MEXIT                                                   X02959 12000000
.DCBAE   MNOTE 8,'&C.064  UMSK OPERAND REQUIRES AERR OPERAND'    X02959 12050000
         MEXIT                                                   X02959 12100000
.E13     ANOP                                                           12150000
&G(1)    SETC 'FIRST'                                                   12200000
&G(2)    SETC 'SECOND'                                                  12250000
&G(3)    SETC 'THIRD'                                                   12300000
&G(4)    SETC 'FOURTH'                                                  12350000
&G(5)    SETC 'DCB'                                                     12400000
&G(6)    SETC 'DECB'                                                    12450000
&G(7)    SETC 'KEY'                                                     12500000
&G(8)    SETC 'SEEKADDR'                                                12550000
&G(9)    SETC  'LOW.LIM.'                                               12600000
&G(10)   SETC  'ECB'                                                    12650000
&G(11)   SETC  'BLKREF'                                                 12700000
&G(12)   SETC  'AREA'                                                   12750000
         MNOTE 12,'&C.001  &G(&A-1) OPERAND REQ''D-NOT SPECIFIED'       12800000
         MEXIT                                                          12850000
.E25     ANOP                                                           12900000
&G(1)    SETC  'LENGTH'                                                 12950000
&G(2)    SETC  'VALUE'                                                  13000000
&G(3)    SETC  'QCB'                                                    13050000
&G(4)    SETC  'MODE'                                                   13100000
&G(5)    SETC  'REGISTER'                                               13150000
&G(6)    SETC  'MESSAGE'                                                13200000
&G(7)    SETC  'ABEXR'                                                  13250000
&G(8)    SETC  'LABEL'                                                  13300000
&G(9)    SETC  'TBLOC'                                                  13350000
&G(10)   SETC  'FIELDS'                                                 13400000
&G(12)   SETC  'TYPE'                                                   13450000
         MNOTE 12,'&C.001  &G(&A-13) OPERAND REQ''D-NOT SPECIFIED'      13500000
         MEXIT                                                          13550000
.E24     MNOTE 12,'&C.004  REQUIRED OPERAND(S) NOT SPECIFIED'           13600000
         MEXIT                                                          13650000
.E26     MNOTE 12,'&C.001  ENTRY SYMBOL OPERAND REQ''D-NOT SPECIFIED'   13700000
         MEXIT                                                          13750000
.E27     MNOTE 12,'&C.001  ENTRY PT. ADR. OPERAND REQ''D-NOT SPECIFIED' 13800000
         MEXIT                                                          13850000
.E31     MNOTE 12,'&C.001  EP,EPLOC,OR DE OPERAND REQ''D-NOT SPECIFIED' 13900000
         MEXIT                                                          13950000
.E34     ANOP                                                           14000000
&G(1)    SETC  'CODE'                                                   14050000
&G(2)    SETC  'COUNT'                                                  14100000
&G(3)    SETC  'QEL'                                                    14150000
&G(5)    SETC  'TERMINAL'                                               14200000
&G(6)    SETC  'LINE'                                                   14250000
&G(7)    SETC  'LIST'                                                   14300000
&G(12)   SETC  'LIST'                                                   14350000
&G(13)   SETC  'NUMBER'                                                 14400000
         MNOTE 12,'&C.001  &G(&A-27) &G(&A-20) OPERAND REQ''D-NOT SPECIX14450000
               FIED'                                                    14500000
         MEXIT                                                          14550000
.E42     MNOTE 12,'&C.002  INVALID EP OR EPLOC OPERAND SPECIFIED-&D'    14600000
         MEXIT                                                          14650000
.E46     ANOP                                                           14700000
&G(1)    SETC  'MF'                                                     14750000
&G(2)    SETC  'FIRST'                                                  14800000
&G(3)    SETC  'SECOND'                                                 14850000
&G(4)    SETC  'THIRD'                                                  14900000
&G(5)    SETC  'FOURTH'                                                 14950000
&G(6)    SETC  'IOB'                                                    15000000
&G(7)    SETC  'SF'                                                     15050000
&G(9)    SETC  'FUNCTION'                                               15100000
&G(10)   SETC  'LENGTH'                                                 15150000
&G(11)   SETC  'MODE'                                                   15200000
&G(12)   SETC  'TYPE'                                             19015 15250000
&G(13)   SETC  'SP'                                                     15300000
         AIF   (T'&H EQ 'O').E4601                                      15350000
&H1      SETA  &H                                                       15400000
.E4601   ANOP                                                           15450000
         MNOTE 12,'&C.002  INVALID &G(&A+&H1-34) OPERAND SPECIFIED-&D'  15500000
         MEXIT                                                          15550000
.E47     MNOTE 12,'&C.002  INVALID AREA OR LENGTH OPERAND SPECIFIED-&D' 15600000
         MEXIT                                                          15650000
.E52     MNOTE 12,'&C.001  OPTION THREE OPERAND REQ''D-NOT SPECIFIED'   15700000
         MEXIT                                                          15750000
.E57     ANOP                                                           15800000
&G(1)    SETC  'TYPE'                                                   15850000
&G(2)    SETC  'OPTION'                                                 15900000
&G(3)    SETC  'OPTION 1'                                               15950000
&G(4)    SETC  'OPTION 2'                                               16000000
&G(6)    SETC  'OPTION 3'                                               16050000
&G(7)    SETC  'KEYWORD'                                                16100000
         MNOTE 12,'&C.002  INVALID &G(&A-47) OPERAND SPECIFIED-&D'      16150000
         MEXIT                                                          16200000
.E60     MNOTE 12,'&C.023 THIRD OPERAND INVALID WITH SCRATCH-SPECIFIED C16250000
               AS - &D'                                                 16300000
         MEXIT                                                          16350000
.E61     MNOTE 12,'&C.005  INVALID REGISTER NOTATION IN RC OPERAND-&D'  16400000
         MEXIT                                                          16450000
.E67     ANOP                                                           16500000
&G(1)    SETC  'OP CODE'                                                16550000
&G(2)    SETC  'TYPE'                                                   16600000
&G(3)    SETC  'TYPE'                                                   16650000
&G(4)    SETC  'TYPE'                                                   16700000
&G(5)    SETC  'TYPE'                                                   16750000
&G(6)    SETC  'FIELDS'                                                 16800000
         MNOTE 12,'&C.002  INVALID &G(&A-61) OPERAND SPECIFIED-&D'      16850000
         MEXIT                                                          16900000
.E69     MNOTE 12,'&C.006  INVALID REGISTER NOTATION WITH MF=L FORM.'   16950000
         MEXIT                                                          17000000
.E71     MNOTE 12,'&C.007  PARAM= OPERAND INVALID WITH SF=L FORM.'      17050000
         MEXIT                                                          17100000
.E72     MNOTE 12,'&C.008  INVALID REGISTER NOTATION WITH SF=L FORM.'   17150000
         MEXIT                                                          17200000
.E73     MNOTE 12,'&C.009  ENTRY SYMBOL NOT ALLOWED WITH MF=L FORM.'    17250000
         MEXIT                                                          17300000
.E74     MNOTE 12,'&C.010  ID= OPERAND INVALID WITH MF=L FORM.'         17350000
         MEXIT                                                          17400000
.E75     MNOTE 12,'&C.011  INVALID OPERAND SPECIFIED WITH SF=L FORM.'   17450000
         MEXIT                                                          17500000
.E78     MNOTE 4,'&C.024  CSECT NAME OMITTED. MACRO NAME FIELD BLANK'   17550000
         MEXIT                                                          17600000
.E84     MNOTE 12,'&C.013  MF=L NOT ALLOWED'                            17650000
         MEXIT                                                          17700000
.E87     MNOTE 12,'&C.014  DECB NOT SPECIFIED AS SYMBOL'                17750000
         MEXIT                                                          17800000
.E88     MNOTE 12,'&C.015  MORE THAN ONE OF EP,EPLOC OR DE PRESENT'     17850000
         MEXIT                                                          17900000
.E89     MNOTE 12,'&C.016  LV OPERAND NOT ALLOWED WITH SPECIFIED MODE'  17950000
         MEXIT                                                          18000000
.E90     MNOTE 12,'&C.017  LA OPERAND NOT ALLOWED WITH SPECIFIED MODE'  18050000
         MEXIT                                                          18100000
.E91     MNOTE 12,'&C.018  BOTH LV AND LA OPERANDS SPECIFIED'           18150000
         MEXIT                                                          18200000
.E92     MNOTE 12,'&C.019  SP NOT ALLOWED WITH LV SPECIAL REG. NOTATIONC18250000
               '                                                        18300000
         MEXIT                                                          18350000
.E93     MNOTE 12,'&C.020  A= OPERAND NOT ALLOWED IN R-TYPE MACRO'      18400000
         MEXIT                                                          18450000
.E94     MNOTE 12,'&C.021  MORE THAN MAXIMUM VALUE IN FIELDS OPERAND'   18500000
         MEXIT                                                          18550000
.E95     MNOTE 12,'&C.012  PARAM OR VL ALLOWED ONLY WITH MF=(E,ADDR)'   18600000
         MEXIT                                                          18650000
.E180    MNOTE 4,'&C.256  &B OPERAND INVALID OR NOT SPECIFIED-SET TO &D'18700000
               '                                                        18750000
         MEXIT                                                          18800000
.E181    MNOTE 4,'&C.257  BPX COUNTER INDICATES WRAP AROUND TO TOP OF CR18850000
               RT'                                                      18900000
         MEXIT                                                          18950000
.E182    MNOTE 4,'&C.258  BLC GREATER THAN OR EQUAL TO BLIM'            19000000
         MEXIT                                                          19050000
.E183    MNOTE 4,'&C.077  &B INVALID-SET TO &D'                         19100000
         MEXIT                                                          19150000
.E184    MNOTE *,'&C.259  CURRENT BUFFER &B = &D'                X02959 19200000
         MEXIT                                                          19250000
.E185    MNOTE *,'&C.260  CURRENT BEAM POSITION COUNTER IS X=&B, Y=&D'  19300000
         MEXIT                                                          19350000
.E186    MNOTE 4,'&C.261  &B COUNTER EXCEEDS CRT LIMITS'                19400000
         MEXIT                                                          19450000
.E187    MNOTE 4,'&C.262  LOAD VARIABLE SPACE ORDER MAY HAVE NOT BEEN SP19500000
               PECIFIED PRIOR TO ENTERING STROKE MODE'                  19550000
         MEXIT                                                          19600000
.E188    MNOTE 8,'&C.263  INVALID &B ADDRX-&D'                          19650000
         MEXIT                                                          19700000
.E189    MNOTE 7,'&C.083  STORAGE/LIST FORMAT INCORRECT'                19750000
         MEXIT                                                     UCSA 19800000
.SETPRA MNOTE 12,'&C.092 DCB IS MISSING OR INVALID'                UCSA 19850000
         MEXIT                                                     UCSA 19900000
.SETPRB MNOTE 12,'&C.093  UCS SUBLIST IS INVALID'                  UCSA 19950000
         MEXIT                                                     UCSA 20000000
.SETPRC MNOTE 12,'&C.094  MACRO-FORM IS INVALID'                   UCSA 20050000
         MEXIT                                                     UCSA 20100000
.SETPRD MNOTE 12,'&C.095  OPTCD IS INVALID'                        UCSA 20150000
         MEXIT                                                     UCSA 20200000
.SETPRE MNOTE 12,'&C.096 INSUFFICIENT PARAMETERS SPECIFIED'    @Z40MP9B 20250000
         MEXIT                                                    20202 20300000
.SETPRF MNOTE 12,'&C.026  FCB SUBLIST IS INVALID'                 20202 20350000
         MEXIT                                                     LC0A 20400000
.LCSERR  MNOTE 12,'&C.025  INVALID HIARCHY OPERAND SPECIFIED'      LC0A 20450000
         MEXIT                                                     SD0A 20500000
.E196    MNOTE 12,'&C.264  MORE THAN 5 POSITIONAL OPERANDS'        SD0A 20550000
         MEXIT                                                          20600000
.E197    MNOTE 12,'&C.097  TCB OPERAND INVALID WITH MF=L FORM.'         20650000
         MEXIT                                                    19033 20700000
.E198    MNOTE *,'&C.098  BUFNO LESS THAN 12--12 ASSUMED'         19033 20750000
         MEXIT                                                    19033 20800000
.E199    MNOTE *,'&C.099  BUFL AND BLKSIZE UNEQUAL-BUFL ASSUMED'  19033 20850000
         MEXIT                                                    19033 20900000
.E200    MNOTE *,'&C.102 LREC PLUS 6 IS GREATER THAN BUFL-BUFL ASSUMED' 20950000
         MEXIT                                                    19033 21000000
.E201    MNOTE 4,'&C.101  SSRTN TOO LONG--TRUNCATED TO 8 CHAR'    19033 21050000
         MEXIT                                                    19017 21100000
.OCR120  MNOTE 16,'&C.120  DCB ADDRESS MISSING OR INVALID. GENERATION TC21150000
               ERMINATED'                                         19017 21200000
         MEXIT                                                    19017 21250000
.OCR121  MNOTE 16,'&C.121  REGISTER SPECIFICATION INVALID. GENERATION TC21300000
               ERMINATED.'                                        19017 21350000
         MEXIT                                                    19017 21400000
.OCR122  MNOTE 16,'&C.122  REGISTER SPECIFICATIONS NOT PAIRED. GENERATIC21450000
               ON TERMINATED'                                     19017 21500000
         MEXIT                                                    19017 21550000
.OCR123  MNOTE 4,'&C.123  NUMBER OF RETRIES EXCEEDS 9, 9 ASSUMED.'     C21600000
                                                                  19017 21650000
         MEXIT                                                    19017 21700000
.OCR124  MNOTE 4,'&C.124  NUMBER OF RETRIES INVALID, 1 ASSUMED.'  19017 21750000
         MEXIT                                                    19017 21800000
.OCR125  MNOTE 8,'&C.125  UNRECOGNIZABLE PARAMETER. PARAMETER IGNORED.' 21850000
         MEXIT                                                    19017 21900000
.OCR126  MNOTE 4,'&C.126  PARAMETER PREVIOUSLY DEFINED. FIRST DEFINITIOC21950000
               N ASSUMED.'                                        19017 22000000
         MEXIT                                                    19017 22050000
.OCR127  MNOTE 16,'&C.127  LABEL PREFIX MISSING OR INVALID. GENERATION C22100000
               TERMINATED.'                                       19017 22150000
         MEXIT                                                    19017 22200000
.OCR128  MNOTE 16,'&C.128  UNRECOGNIZABLE PARAMETER SPECIFIED. GENERATIC22250000
               ON TERMINATED.'                                    19017 22300000
         MEXIT                                                    19017 22350000
.OCR129  MNOTE 16,'&C.129  TIMES NOT PRECEDED BY FIELD LENGTH. GENERATIC22400000
               ON TERMINATED.'                                    19017 22450000
         MEXIT                                                    19017 22500000
.OCR130  MNOTE 16,'&C.130  TIMES NOT FOLLOWED BY NUMBER. GENERATION TERC22550000
               MINATED.'                                          19017 22600000
         MEXIT                                                    19017 22650000
.OCR131  MNOTE 4,'&C.131  OPTIONAL PARAMETER SPECIFIED AFTER FIELD DEFIC22700000
               NITION. PARAMETER IGNORED.'                        19017 22750000
         MEXIT                                                    19017 22800000
.OCR132  MNOTE 16,'&C.132  LABEL FOR LOAD FORMAT DATA MISSING OR INVALIC22850000
               D. GENERATION TERMINATED.'                         19017 22900000
         MEXIT                                                    19017 22950000
.OCR133  MNOTE 16,'&C.133  LABEL PREFIX FOR DEFAREA MISSING OR INVALID.C23000000
                GENERATION TERMINATED.'                           19017 23050000
         MEXIT                                                    19017 23100000
.OCR134  MNOTE 4,'&C.134  REFMARK OR UNFORMAT NOT SPECIFIED PRIOR TO DEC23150000
               FINITION OF FIRST FIELD. FORMATTED MODE ASSUMED.'  19017 23200000
         MEXIT                                                    19017 23250000
.OCR135  MNOTE 16,'&C.135  REFMARK SPECIFIED WHEN PROCESSING IN UNFORMAC23300000
               TTED MODE. GENERATION TERMINATED.'                 19017 23350000
         MEXIT                                                    19017 23400000
.OCR136  MNOTE 16,'&C.136  THRU NOT PRECEDED BY FIELD NUMBER. GENERATIOC23450000
               N TERMINATED.'                                     19017 23500000
         MEXIT                                                    19017 23550000
.OCR137  MNOTE 16,'&C.137  THRU NOT FOLLOWED BY FIELD NUMBER. GENERATIOC23600000
               N TERMINATED.'                                     19017 23650000
         MEXIT                                                    19017 23700000
.OCR138  MNOTE 16,'&C.138  ENDING VALUE IN THRU LESS THAN STARTING VALUC23750000
               E. GENERATION TERMINATED.'                         19017 23800000
         MEXIT                                                    19017 23850000
.OCR139  MNOTE 8,'&C.139  LAST CCW GENERATED USES COMMAND CHAINING. POSC23900000
               SIBLE ERROR.'                                            23950000
         MEXIT                                                    19017 24000000
.OCR140  MNOTE 16,'&C.140  SYMBOL WITH LABEL PARAMETER MISSING OR INVALC24050000
               ID. GENERATION TERMINATED.'                        19017 24100000
         MEXIT                                                    19017 24150000
.OCR141  MNOTE 16,'&C.141  FIELD NUMBER FOR RBT/RFT MISSING OR INVALID.C24200000
                GENERATION TERMINATED.'                           19017 24250000
         MEXIT                                                    19017 24300000
.OCR142  MNOTE 16,'&C.142  SYMBOL FOR RBT/RFT MISSING OR INVALID. GENERC24350000
               ATION TERMINATED.'                                 19017 24400000
         MEXIT                                                    19017 24450000
.OCR143  MNOTE 16,'&C.143  SYMBOL(S) FOR COMPARE MISSING OR INVALID. GEC24500000
               NERATION TERMINATED.'                              19017 24550000
         MEXIT                                                    19017 24600000
.OCR144  MNOTE 16,'&C.144  SYMBOL FOR BRANCH MISSING OR INVALID. GENERAC24650000
               TION TERMINATED.'                                  19017 24700000
         MEXIT                                                    19017 24750000
.OCR145  MNOTE 16,'&C.145  STACKER NUMBER FOR ESD MISSING OR INVALID. GC24800000
               ENERATION TERMINATED.'                             19017 24850000
         MEXIT                                                    19017 24900000
.OCR146  MNOTE 16,'&C.146  SYMBOL FOLLOWING REFMARK MISSING OR INVALID.C24950000
                GENERATION TERMINATED.'                           19017 25000000
         MEXIT                                                   A28592 25050000
.OCR147  MNOTE 4,'&C.147  ID= OPERAND EXCEEDS MAXIMUM ALLOWED,ID=1 ASSUX25100000
               MED'                                              X02959 25150000
         MEXIT                                                   X02959 25200000
.A027    MNOTE 12,'&C.027 EXCESSIVE POSITIONAL PARAMETERS SPECIFIED'    25250000
.*                                                               A28592 25300000
         MEXIT                                                    20071 25350000
.TOD236  MNOTE 4,'&C.236 SECOND OPERAND NOT ALLOWED -- IGNORED'   20071 25400000
         MEXIT                                                          25450000
.REDPIKE MNOTE 12,'&C.150 INVALID COMBINATION OF CHARACTERS IN &B OPERA*25500000
               ND - &D.'                                                25550000
         MEXIT                                                          25600000
.PIKERED MNOTE 12,'&C.151 INVALID CHARACTER IN &B OPERAND - &D.'        25650000
         MEXIT                                                          25700000
.M1428A  MNOTE *,'&C.147 GENERATION TERMINATED BY E OR DE LINE TYPE.'   25750000
         MEXIT                                                          25800000
.M1428B  MNOTE 4,'&C.148 INVALID LINE TYPE, E OR DE ASSUMED.'           25850000
         MEXIT                                                          25900000
.M1428C  MNOTE 12,'&C.149 INVALID C OR L LINETYPE, DE ASSUMED--GENERATI*25950000
               ON TERMINATED.'                                          26000000
         MEXIT                                                          26050000
.M1428D  MNOTE 12,'&C.152 NUMBER OF LINES REQUESTED IS 0 OR GREATER THA*26100000
               N 10 -- GENERATION TERMINATED.'                          26150000
         MEXIT                                                          26200000
.M1428E  MNOTE 12,'&C.153 MLWTO/WTOR MUTUALLY EXCLUSIVE--GENERATION TER826250000
               MINATED.'                                                26300000
         MEXIT                                                          26350000
.OS1000  AIF   (&A NE 1001).AOS1002                                     26400000
          MNOTE 12,'&C.002 INVALID &B OPERAND SPECIFIED-&D.'            26450000
          MEXIT                                                         26500000
.AOS1002  AIF     (&A NE 1002).AOS1003                                  26550000
          MNOTE   12,'&C.237 &B SPECIFIED WITH OTHER OPERAND(S).'       26600000
          MEXIT                                                         26650000
.AOS1003  AIF     (&A NE 1003).AOS1004                                  26700000
          MNOTE   12,'&C.238 &B AND/OR &D PARAMETER(S) INCORRECT.'      26750000
          MEXIT                                                         26800000
.AOS1004  AIF     (&A NE 1004).AOS1005                                  26850000
          MNOTE   12,'&C.239 MORE THAN ONE &B PARM LIST ADDRESS.'       26900000
          MEXIT                                                         26950000
.AOS1005  AIF     (&A NE 1005).AOS1006                                  27000000
          MNOTE   12,'&C.240 &B.=&D INVALID WITH LSQA.'                 27050000
          MEXIT                                                         27100000
.AOS1006  AIF     (&A NE 1006).AOS1007                                  27150000
          MNOTE   12,'&C.001 &B OPERAND REQUIRED, NOT SPECIFIED.'       27200000
          MEXIT                                                         27250000
.AOS1007  AIF   (&A NE 1007).AOS1008                                    27300000
          MNOTE   12,'&C.243 INVALID OPERAND FOR &B OPTION.'            27350000
          MEXIT                                                         27400000
.AOS1008  AIF   (&A NE 1008).AOS1009                                    27450000
&G(1)     SETC  'POSIT-NL'                                              27500000
&G(2)     SETC  'KEYWORD'                                               27550000
          MNOTE   12,'&C.244 INVALID &G(&D) &B OPERAND.'                27600000
          MEXIT                                                         27650000
.AOS1009  AIF  (&A NE 1009).AOS1010                                     27700000
         MNOTE   12,'&C.245 COMPLETION CODE CANNOT APPEAR IN LIST FORM' 27750000
          MEXIT                                                         27800000
.AOS1010  AIF  (&A NE 1010).AOS1011                                     27850000
          MNOTE  12,'&C.246 &B OPERAND SPECIFIED WITHOUT &D OPERAND.'   27900000
          MEXIT                                                         27950000
.AOS1011  AIF   (&A NE 1011).AOS1012                                    28000000
          MNOTE  12,'&C.241 &B OR &D INVALID WITH ECB.'                 28050000
          MEXIT                                                         28100000
.AOS1012  AIF  (&A NE 1012).AOS1013                                     28150000
         MNOTE 12,'&C.247 INCORRECT NUMBER OF &B VALUES.'               28200000
          MEXIT                                                         28250000
.AOS1013  AIF   (&A NE 1013).AOS1014                                    28300000
        MNOTE  12,'&C.248 &B SPECIFICATIONS NOT PAIRED.'                28350000
          MEXIT                                                         28400000
.AOS1014  AIF   (&A NE 1014).AOS1015                                    28450000
         MNOTE 12,'&C.249 INVALID &B PARAMETER SPECIFIED.'              28500000
          MEXIT                                                         28550000
.AOS1015  AIF   (&A NE 1015).AOS1016                                    28600000
         MNOTE 4,'&C.242 &B INVALID FOR &D, &E ASSUMED.'                28650000
         MEXIT                                                          28700000
.AOS1016  AIF   (&A NE 1016).AOS1017                                    28750000
         MNOTE 4,'&C.276 &B INCOMPATIBLE WITH &D--IGNORED.'             28800000
          MEXIT                                                         28850000
.AOS1017  AIF   (&A NE 1017).AOS1018                                    28900000
         MNOTE 12,'&C.001 &B OPERAND REQ''D-NOT SPECIFIED.'             28950000
          MEXIT                                                         29000000
.AOS1018  AIF   (&A NE 1018).AOS1020                                    29050000
      MNOTE  4,'&C.278 ''AREAID'' PARAMETER NOT ALPHABETIC CHARACTER.'  29100000
          MEXIT                                                         29150000
.AOS1020  AIF   (&A NE 1020).AOS1021                                    29200000
          MNOTE  12,'&C.280 &B INVALID WITH &D.'                        29250000
          MEXIT                                                         29300000
.AOS1021  AIF   (&A NE 1021).AOS1300                                    29350000
          MNOTE  12,'&C.281 &B NOT SPECIFIED WITH MF=L FORM.'           29400000
          MEXIT                                                         29450000
.AOS1300 AIF   (&A NE 1300).AOS1301                            @G382PXX 29500000
         MNOTE 12,'&C.300 INVALID POSITIONAL PARAMETER -&B.'   @G382PXX 29550000
         MEXIT                                                 @G382PXX 29600000
.AOS1301 AIF   (&A NE 1301).AOS1302                            @G382PXX 29650000
         MNOTE 12,'&C.301 - ''&B'' IS INVALID WITH &D REQUEST.'         29700000
         MEXIT                                                 @G382PXX 29750000
.AOS1302 AIF   (&A NE 1302).AOS1303                            @G382PXX 29800000
         MNOTE 12,'&C.302 - ''&B'' IS INVALID WITH &D.'        @G382PXX 29850000
         MEXIT                                                 @G382PXX 29900000
.AOS1303 AIF   (&A NE 1303).AOS1304                            @G382PXX 29950000
         MNOTE 12,'&C.303 &B MUST BE &D OR &E WHEN USED WITH &F.'       30000000
         MEXIT                                                 @G382PXX 30050000
.AOS1304 AIF   (&A NE 1304).AOS1305                            @G382PXX 30100000
         MNOTE 12,'&C.304 &B AND &D OPTIONS ARE MUTUALLY EXCLUSIVE.'    30150000
         MEXIT                                                 @G382PXX 30200000
.AOS1305 AIF   (&A NE 1305).AOS1306                            @G382PXX 30250000
         MNOTE 12,'&C.305 &B, &D OR &E MUST BE SPECIFIED WITH &F.'      30300000
         MEXIT                                                 @G382PXX 30350000
.AOS1306 AIF   (&A NE 1306).AOS1307                            @G382PXX 30400000
&G(1)    SETC  'A TOKEN'                                       @G382PXX 30450000
&G(2)    SETC  'A DATA VALUE KEYWORD'                          @G382PXX 30500000
         MNOTE 12,'&C.306 &G(&B) IS REQUIRED WITH THE &D OPTION.'       30550000
         MEXIT                                                 @G382PXX 30600000
.AOS1307 AIF   (&A NE 1307).AOS1308                            @G382PXX 30650000
&G(1)    SETC  'DATA VALUE KEYWORD'                            @G382PXX 30700000
         MNOTE 12,'&C.307 SPECIFY ONLY ONE &G(&B) PER &D REQUEST.'      30750000
         MEXIT                                                 @G382PXX 30800000
.AOS1308 AIF   (&A NE 1308).AOS1309                                @L1C 30850000
         MNOTE 12,'&C.308 A REQUIRED POSITIONAL PARAMETER WAS NOT SPECIX30900000
               FIED.'                                          @G382PXX 30950000
         MEXIT                                                 @G382PXX 31000000
.AOS1309 AIF   (&A NE 1309).INVALID                                @L1A 31012500
         MNOTE 12,'&C.309 - ''&B'' IS REQUIRED WITH THE &D OPTION.'     31025000
         MEXIT                                                     @L1A 31037500
.SHARK1  ANOP                                                    YM2157 31050000
&G(1)    SETC  'DEVT'                                            YM2157 31100000
&G(2)    SETC  'FRID'                                            YM2157 31150000
         MNOTE 12,'&C.001  &G(&A-259) OPERAND REQ''D-NOT SPECIFIED'     31200000
.*                                                               YM2157 31250000
         MEXIT                                                   YM2157 31300000
.SHARK2  ANOP                                                    YM2157 31350000
&G(1)    SETC  'LINENO'                                          YM2157 31400000
&G(2)    SETC  'LINEFMAT'                                        YM2157 31450000
&G(3)    SETC  'DCB'                                             YM2157 31500000
&G(4)    SETC  'DEVT'                                            YM2157 31550000
&G(5)    SETC  'FRID'                                            YM2157 31600000
         MNOTE 12,'&C.002  INVALID &G(&A-249) OPERAND SPECIFIED-&D'     31650000
.*                                                               YM2157 31700000
         MEXIT                                                   YM2157 31750000
.SHARK3  ANOP                                                    YM2157 31800000
&G(1)    SETC  'MKCODE'                                          YM2157 31850000
&G(2)    SETC  'MKCODEA'                                         YM2157 31900000
         MNOTE 12,'&C.001  &G(&A-264) OPERAND REQ''D-NOT SPECIFIED'     31950000
.*                                                               YM2157 32000000
         MEXIT                                                   YM2157 32050000
.SHARK4  ANOP                                                    YM2157 32100000
&G(1)    SETC  'LNNUM'                                           YM2157 32150000
&G(2)    SETC  'LNNUMA'                                          YM2157 32200000
&G(3)    SETC  'LFMATNO'                                         YM2157 32250000
&G(4)    SETC  'LFMATNOA'                                        YM2157 32300000
&G(5)    SETC  'MKCODE'                                          YM2157 32350000
&G(6)    SETC  'MKCODEA'                                         YM2157 32400000
&G(7)    SETC  'NTMKS'                                           YM2157 32450000
&G(8)    SETC  'NTMKSA'                                          YM2157 32500000
         MNOTE 12,'&C.002  INVALID &G(&A-266) OPERAND SPECIFIED-&D'     32550000
.*                                                               YM2157 32600000
         MEXIT                                                   YM2157 32650000
.ARG282  MNOTE 12,'&C.282 COPIES IS INVALID.'                  @Z40MP9B 32700000
         MEXIT                                                 @Z40MP9B 32750000
.ARG283  MNOTE 12,'&C.283 BURST IS INVALID.'                   @Z40MP9B 32800000
         MEXIT                                                 @Z40MP9B 32850000
.ARG284  MNOTE 12,'&C.284 FLASH SUBLIST IS INVALID.'           @Z40MP9B 32900000
         MEXIT                                                 @Z40MP9B 32950000
.ARG285  MNOTE 12,'&C.285 MODIFY SUBLIST IS INVALID.'          @Z40MP9B 33000000
         MEXIT                                                 @Z40MP9B 33050000
.ARG286  MNOTE 12,'&C.286 CHARS SUBLIST IS INVALID.'           @Z40MP9B 33100000
         MEXIT                                                 @Z40MP9B 33150000
.ARG287  MNOTE 12,'&C.287 COPYNR IS INVALID.'                  @Z40MP9B 33200000
         MEXIT                                                 @Z40MP9B 33250000
.ARG288  MNOTE 12,'&C.288 INIT IS INVALID.'                    @Z40MP9B 33300000
         MEXIT                                                 @Z40MP9B 33350000
.ARG289  MNOTE 12,'&C.293 REXMIT IS INVALID.'                  @Z40MP9B 33400000
         MEXIT                                                 @Z40MP9B 33450000
.ARG290  MNOTE *,'&C.294 ONLY COPIES, COPYNR AND FLASH KEYWORDS ARE PRO*33500000
               CESSED WITH REXMIT=Y.'                          @Z40MP9B 33550000
         MEXIT                                                 @Z40MP9B 33600000
.INVALID MNOTE 12,'&C.087 INVALID OPERAND &A PASSED TO SYSTEM MACRO IHB*34500000
               ERMAC.'                                                  34550000
         MEND                                                           34600000
