*###VERIFY TO DO
*###   NEED A SEVERELY DAMAGED DATASET TO SHOW THAT VERIFY WORKS
*###   MAYBE A VERIFY0 TO TURN OFF VERCOUNT
*###   WHY DON'T I VERIFY THE AIX'S ?
*
*###   VALIDATE THE STCKS BY FINDING 01/01/2021 00:00+1USEC
*###      PFX AND CTR STCKS MUST BE BIGGER
*###      D94BF424B2988000 19/ 2/2021 11:44:29.125000 UTC
*###      =3822723869.125000
*###      -48DAYS -11:44:29.125000=  -4147200 -42269.125 = -4189469.125
*###      =3818534400=X'E39A3600'*1000000=X'D90EFD2798000'
*###      D90EFD2798001000 (+1 USEC)
*
*   ALSO DOC IN D&L, NEW SECTION DEFINING CTR, ALSO SAY INIT IN ZREPRO
*   CTRAVGRL.....FIXED AND INDEX=RECSIZE, BUT CALC ANYWAY
*                VARIABLE=AVG EXCLUDING SPX, INCLUDING RLF
*                FOR VAR RRDS, EXCLUDING ENPTIES
*   CTRAVSPAC....TOTAL FREESPACE IN DATA/INDEX BLOCKS
*   CTRHALCRBA...DATA...BLOCKRBA+1 OF HIGHEST DATA BLOCK WITH DATA
*                INDEX..BLOCKRBA+1 OF HIGHEST L0 BLOCK WITH INDEX
*                IF ALL HAVE DATA/INDEX, HALCRBA=ENDRBA
*                IF EMPTY, HALCRBA=0
*                BECAUSE OF EMBEDDED SEGMENTS AND SPACEMAPS ANY CALCS
*                ARE MEANINGLESS
*   CTRHLRBA.....BLOCK RBA OF PFXROOT
*   CTRENDRBA....DATA...BLOCKRBA+1 OF HIGHEST DATA BLOCK
*                       INITIALLY=PFXEDATA+1 BUT NOT AFTER
*                INDEX..BLOCKRBA+1 OF HIGHEST L0 BLOCK
*                       INITIALLY=PFXELVL0+1 BUT NOT AFTER
*                BECAUSE OF EMBEDDED SEGMENTS AND SPACEMAPS ANY CALCS
*                ARE MEANINGLESS
*   CTRNLOGR.....DATA, NO. OF RECORDS WRITTEN (INC. RRDS EMPTIES)
*                INDEX, NO. OF RECORDS WRITTEN FOR ALL LEVELS
*   CTRSDTASZ....DATASET SIZE AS WTO'D
***********************************************************************
* Copyright 2007 Automated Software Tools Corporation                 *
* This source code is part of z390 assembler/emulator package         *
* The z390 package is distributed under GNU general public license    *
*                                                                     *
* Author - Melvyn Maltz                                               *
* Date   - 4th January 2016                                           *
*                                                                     *
* Rewrite for zVSAM V2                                                *
***********************************************************************
* zREPRO SPECIFICATION:
*
* THE QSAM FILE MAY HAVE OVERRIDE RECFM, ONLY [RECFM=FT] OR [RECFM=VT]
* ARE ALLOWED
* RECFM=F OR RECFM=V ARE THE DEFAULTS BASED ON THE VSAM FILE DEFINITION
* THE QSAM OVERRIDE MUST BE CONSISTENT WITH THE VSAM RECORD FORMAT
*
* THE VSAM FILE MUST SPECIFY THE CATALOG WITH A FILE SUFFIX
* EACH CATALOG MUST HAVE ITS OWN PATH EG. SET Z390CAT2=
*
* zREPRO FUNCTIONS:
*    LOAD
*       INQSAM  = QSAM INPUT FILE
*       OUTVSAM = VSAM OUTPUT FILE
*       SET INQSAM=%ZVSMDATA%\MYFILE2F.TXT[RECFM=FT]
*       SET OUTVSAM=%ZVSMDATA%\Z390CAT2.MYFILE02
*       SET Z390CAT2=%ZVSMCATG%
*
*    UNLOAD
*       INVSAM  = VSAM INPUT FILE
*       OUTQSAM = QSAM OUTPUT FILE
*       SET INVSAM=%ZVSMDATA%\Z390CAT2.MYFILE02
*       SET OUTQSAM=%ZVSMDATA%\MYFILE2F.TXT[RECFM=FT]
*       SET Z390CAT2=%ZVSMCATG%
*
*    VERIFY
*       INVSAM  = VSAM INPUT FILE
*       SET INVSAM=%ZVSMDATA%\Z390CAT2.MYFILE02
*       SET Z390CAT2=%ZVSMCATG%
*
*    BUILDAIX
*       INVSAM  = VSAM INPUT FILE
*       OUTVSAM = VSAM OUTPUT FILE
*       SET INVSAM=%ZVSMDATA%\Z390CAT2.MYFILE09
*       SET OUTVSAM=%ZVSMDATA%\Z390CAT2.MYAIXWD
*       SET Z390CAT2=%ZVSMCATG%
*       INVSAM MUST BE A KSDS OR ESDS, AND OUTVSAM AN AIX
*       BOTH INVSAM AND OUTVSAM MUST SPECIFY THE SAME CATALOG
*********************************************************************
ZREPRO   SUBENTRY BASES=(R13,R10,R11)
         LARL  R12,DATAAREA       ESTABLISH DATA AREA BASE
         USING DATAAREA,R12
         L     R3,0(R1)           R3=PARM POINTER
         TIME  BIN
         ST    R0,BEGTIME         SAVE TIME IN 0.01 SECS
* WTO zREPRO UTILITY V1
******** SYSTRACE ' '             ###TRACE OFF DESTROYS R1
         WTO   MF=(E,WTOHEAD)     SHOW IT
************************************************
* PROCESS PARM AND CHECK ENVIRONMENT VARIABLES *
************************************************
         CHHSI 0(R3),4            4-BYTE PARM ?
         JNE   PARMNOT4           EXIT IF NOT
         CLC   2(4,R3),CNSTLOAD   IS IT LOAD ?
         JNE   BADWPARM           ERROR IF NOT
* LOAD
         GETENV INQSAMDD          GET INQSAMDD
         LTR   R15,R15            OK ?
         JNZ   BADINPUT           ERROR IF NOT
         ST    R2,GETENVI         SAVE INQSAM PATH ADDRESS
         GETENV OUTVSMDD          GET OUTVSMDD
         LTR   R15,R15            OK ?
         JNZ   BADOUTPT           ERROR IF NOT
         ST    R2,GETENVO         SAVE OUTVSAM PATH ADDRESS
* WTO zREPRO LOAD
         WTO   MF=(E,WTOLOAD)     SHOW IT
         MVC   WTOENTYP(4),CNSTLOAD SET TYPE FOR ENDED OK
         J     LOAD               EXIT
*
PARMNOT4 DS    0H
         CHHSI 0(R3),6            6-BYTE PARM ?
         JNE   PARMNOT6           EXIT IF NOT
         CLC   2(6,R3),CNSTVERF   IS IT VERIFY ?
         JE    PARMVER            EXIT IF IT IS
         CLC   2(6,R3),CNSTUNLD   IS IT UNLOAD ?
         JNE   BADWPARM           ERROR IF NOT
* UNLOAD
         GETENV INVSAMDD          GET INVSAMDD
         LTR   R15,R15            OK ?
         JNZ   BADINPUT           ERROR IF NOT
         ST    R2,GETENVI         SAVE INVSAM PATH ADDRESS
         GETENV OUTQSMDD          GET OUTQSMDD
         LTR   R15,R15            OK ?
         JNZ   BADOUTPT           ERROR IF NOT
         ST    R2,GETENVO         SAVE OUTQSAM PATH ADDRESS
* WTO zREPRO UNLOAD
         WTO   MF=(E,WTOUNLOD)    SHOW IT
         MVC   WTOENTYP(6),CNSTUNLD SET TYPE FOR ENDED OK
         J     UNLOAD             EXIT
*
PARMVER  DS    0H
* VERIFY
         GETENV INVSAMDD          GET INVSAMDD
         LTR   R15,R15            OK ?
         JNZ   BADINPUT           ERROR IF NOT
         ST    R2,GETENVI         SAVE INVSAM PATH ADDRESS
* WTO zREPRO VERIFY
         WTO   MF=(E,WTOVERFY)    SHOW IT
         MVC   WTOENTYP(6),CNSTVERF SET TYPE FOR ENDED OK
         MVI   ITYPE,C'I'         SET INPUT PROCESSING
         LR    R5,R2              R5=INPUT VSAM PATH ADDRESS
         JAS   R14,PROCVSAM       PROCESS VSAM, LOAD CAT, BUILD DSN
         J     VERIFY             EXIT
*
PARMNOT6 DS    0H
         CHHSI 0(R3),8            8-BYTE PARM ?
         JNE   BADWPARM           ERROR IF NOT
         CLC   2(8,R3),CNSTBDAX   IS IT BUILDAIX ?
         JNE   BADWPARM           ERROR IF NOT
* BUILDAIX
         GETENV INVSAMDD          GET INVSAMDD
         LTR   R15,R15            OK ?
         JNZ   BADINPUT           ERROR IF NOT
         ST    R2,GETENVI         SAVE INVSAM PATH ADDRESS
         GETENV OUTVSMDD          GET OUTVSMDD
         LTR   R15,R15            OK ?
         JNZ   BADOUTPT           ERROR IF NOT
         ST    R2,GETENVO         SAVE OUTVSAM PATH ADDRESS
* WTO zREPRO BUILDAIX
         WTO   MF=(E,WTOBDAIX)    SHOW IT
         MVC   WTOENTYP,CNSTBDAX  SET TYPE FOR ENDED OK
         J     BUILDAIX           EXIT
*
BADWPARM DS    0H
* zREPRO PARM NOT LOAD, UNLOAD, BUILDAIX OR VERIFY
         WTO   MF=(E,WTOBADPM)    SHOW IT
         J     BADRETN            EXIT
*
BADINPUT DS    0H
* zREPRO NO INPUT FILE
         WTO   MF=(E,WTOBADIN)    SHOW IT
         J     BADRETN            EXIT
*
BADOUTPT DS    0H
* zREPRO NO OUTPUT FILE
         WTO   MF=(E,WTOBADOT)    SHOW IT
         J     BADRETN            EXIT
*
WTOBADIN DC    AL2(WTOBDIEN-*,0)
         DC    C'zREPRO NO INPUT FILE'
WTOBDIEN EQU   *
*
WTOBADOT DC    AL2(WTOBDOEN-*,0)
         DC    C'zREPRO NO OUTPUT FILE'
WTOBDOEN EQU   *
*
WTOBADPM DC    AL2(WTOBDPEN-*,0)
         DC    C'zREPRO PARM NOT LOAD, UNLOAD, BUILDAIX OR VERIFY'
WTOBDPEN EQU   *
*
BUILDAIX DS    0H
************
* BUILDAIX *
************
         MVI   ITYPE,C'I'         SET INPUT PROCESSING
         L     R5,GETENVI         R5=INPUT VSAM PATH ADDRESS
         JAS   R14,PROCVSAM       PROCESS VSAM, LOAD CAT, BUILD DSN
         MVI   ITYPE,C'A'         SET AIX PROCESSING
         L     R5,GETENVO         R5=OUTPUT VSAM PATH ADDRESS
         JAS   R14,PROCVSAM       PROCESS VSAM, LOAD CAT, BUILD DSN
* OPEN INPUT DATA FILE
         OPEN  (DTAIN),(INPUT))   OPEN VSAM INPUT DATA DCB
* SHOW INPUT FILE OPENED: PATH
         MVC   OPENMSG,WTOINP     MOVE 'INPUT OPENED' MSG
         L     R1,GETENVI         R1=VSAM INPUT PATH ADDRESS
         JAS   R14,OPENWTO        WTO OPEN FILE
         LHI   R2,4096            R2=PREFIX BLOCKSIZE
         GETMAIN RU,LV=(R2)
         ST    R1,VSAMPRFX        SAVE VSAM DATA PREFIX ADDRESS
         LR    R6,R1              R6=VSAM DATA PREFIX ADDRESS
* GET DATA PREFIX BLOCK
         ST    R2,DTAIN+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAIN+DCBLRECLF-IHADCB SAVE LRECL
         GET   DTAIN,(R6)         GET DATA PREFIX BLOCK
         USING ZVSAMHDR,R6
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         LG    R2,PFXBDATA        R2=FIRST DATA XLRA
         MVC   TRUDBKSZ,PFXBLKSZ  SET DATA BLKSIZE
         MVC   PXXFFLGS,PFXFFLGS  COPY DATA PFXFFLGS
         MVC   PXXRFLGS,PFXRFLGS  COPY DATA PFXRFLGS
         DROP  R6
* GETMAIN DATA BLOCK
         L     R6,TRUDBKSZ        R6=(ADJUSTED) DATA BLKSIZE
         ST    R6,DTAIN+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R6,DTAIN+DCBLRECLF-IHADCB SAVE LRECL
         GETMAIN RU,LV=(R6)
         ST    R1,VSAMDATA        SAVE VSAM DATA BLOCK ADDRESS
         LR    R6,R1              R6=VSAM DATA BLOCK ADDRESS
         SR    R8,R8              CLEAR R8
         L     R3,VSAMCADI        R3=INPUT CLUSTER ADDRESS
         USING IHAVCLR,R3
         L     R7,VSAMCADO        R7=OUTPUT CLUSTER ADDRESS (AIX)
         USING IHAVAIX,R7
         L     R5,VAIXKLEN        R5=AIX KEY LENGTH
         LR    R0,R5              R0=AIX KEY LENGTH
         AHI   R0,-1              -1 FOR EXECUTE
         ST    R0,AIXNKEYL        SAVE IT
         CLI   PXXFFLGS,PFX_ESDS  ESDS ?
         JNE   AIXNESDS           EXIT IF NOT
* AIX OVER ESDS
         AHI   R5,8               +XLRA LENGTH=RECORD LENGTH
         MVHI  AIXNBSXL,8         SAVE IT
         J     AIXLMAX            EXIT
*
AIXNESDS DS    0H
* AIX OVER KSDS
         A     R5,VCLRKLEN        +BASE KEY LENGTH=RECORD LENGTH
         MVC   AIXNBSXL,VCLRKLEN  SAVE L'BASEKEY
AIXLMAX  DS    0H
         ST    R5,VXXXLMAX        SAVE AS AIX RECORD LENGTH
         MVHHI RECFMOVF,C'F '     SET AIX AS FIXED
         CVD   R5,WORK3           CONVERT LRECL
         LR    R1,R5              R1=AIX RECORD LENGTH
         GETMAIN RU,LV=(R1)
         ST    R1,WORK1           SAVE ADDRESS
* SORT WHOLE AIX RECORD, THIS WILL ALSO SORT BASE KEYS/XLRAS WHEN
* AIX IS NON-UNIQUE
         ZSORT ISORT,LRECL=(R5),FIELDS=(1,(R5),BI,A),MEMORY=1000000
         L     R5,WORK1           R5=AIX RECORD ADDRESS
AIXDLOOP DS    0H
* AIX RECORD OVER KSDS IS AIX KEY,BASE KEY
* AIX RECORD OVER ESDS IS AIX KEY,XLRA
         SRLG  R2,R2,8            SHIFT OUT RECORD NUMBER
         MSGF  R2,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R2,4096            + PREFIX SIZE
         STG   R2,WORK1           SAVE IT
         POINT DTAIN,RBA=WORK1    POINT TO DATA BLOCK
         GET   DTAIN,(R6)         GET DATA BLOCK
         USING ZVSAMHDR,R6
         AHIK  R9,R6,BHDRLENG     R9=DATA RPTR POINTER
         USING ZVSAMRPT,R9
         LG    R4,BHDRSELF        R4=TRACKER FOR
         AGHI  R4,1                              ESDS XLRA
AIXRLOOP DS    0H
* LOOP WITHIN DATA BLOCK
         L     R7,VSAMCADO        R7=OUTPUT CLUSTER ADDRESS (AIX)
         CLI   RPTRFLGS,RPTR_END  END OF DATA RPTR'S ?
         JE    AIXDEND            EXIT IF IT IS
         L     R8,RPTRREC@        R8=OFFSET TO RECORD
         AR    R8,R6              R8=RECORD ADDRESS
         TM    RPTRFLGS,RPTR_SEG  FIRST SEGMENT ?
         JNO   AIXNTSPN           EXIT IF NOT
* SPANNED
         JAS   R14,UNSPAN         RECONSTRUCT A SPANNED RECORD
AIXNTSPN DS    0H
         LR    R0,R8              R0=SAVED RECORD ADDRESS
         TM    PXXRFLGS,PFX_RFIX  VARIABLE ?
         JO    AIXNTVAR           EXIT IF NOT
* VARIABLE, CHECK IF RECORD LENGTH BIG ENOUGH FOR THE AIX KEY
         L     R1,0(R8)           R1=RECORD LENGTH INCLUDING RLF
         AHI   R8,4               BUMP PAST THE RLF-AIX KEY
         LR    R0,R8              SAVE FOR AIX KEY EXTRACT
         AHI   R1,-5              R1=MAXIMUM OFFSET
         L     R2,VAIXKOFF        CALC OFFSET OF
         A     R2,VAIXKLEN                       LAST AIX KEY
         AHI   R2,-1                                          BYTE
         CR    R2,R1              CAN WE EXTRACT THE AIX KEY ?
         JH    BADVREC            ERROR IF NOT
AIXNTVAR DS    0H
* EXTRACT THE AIX KEY
         A     R8,VAIXKOFF        R8=AIX KEY START
         L     R1,VAIXKLEN        R1=AIX KEY LENGTH
         DROP  R7
         AHI   R1,-1              -1 FOR EXECUTE
         EXRL  R1,MOVEAIX         MOVE AIX KEY
         LA    R7,1(R5,R1)        R7=BYTE AFTER AIX KEY
         CLI   PXXFFLGS,PFX_ESDS  ESDS ?
         JNE   AIXEXTBK           EXIT IF NOT
* AIX OVER ESDS, ADD XLRA
         STG   R4,0(R7)           SAVE XLRA OF ESDS RECORD
         J     AIXZSORT           EXIT
*
AIXEXTBK DS    0H
* KSDS, EXTRACT THE BASE KEY
         LR    R8,R0              R8=RECORD ADDRESS
         A     R8,VCLRKOFF        R8=KEY START
         L     R1,VCLRKLEN        R1=KEY LENGTH
         AHI   R1,-1              -1 FOR EXECUTE
         EXRL  R1,MOVEBASE        MOVE BASE KEY
AIXZSORT DS    0H
         ZSORT PUT,REC=(R5)       SEND AIX REC TO ZSORT
         ASI   AIXNTRAK,1         COUNT BASE RECORDS
         AHI   R9,RPTRLENG        BUMP DATA RPTR POINTER
         AGHI  R4,1               BUMP ESDS XLRA
         J     AIXRLOOP           LOOP
*
AIXDEND  DS    0H
         LG    R2,BHDRNEXT        R2=NEXT DATA BLOCK
         CGHI  R2,-1              ANY NEXT DATA BLOCK ?
         JNE   AIXDLOOP           LOOP IF THERE IS
* WTO BASE CLUSTER RECORDS
         L     R1,AIXNTRAK        R1=NO. OF BASE CLUSTER RECORDS
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    BASERECS,WORK1+2   EDIT NO. OF BASE CLUSTER RECORDS
         WTO   MF=(E,WTOBASRC)    SHOW IT
         CLOSE DTAIN              CLOSE INPUT VSAM DCB
         J     BUILDDTA           EXIT
         DROP  R3,R6,R9
*
MOVEAIX  MVC   0(0,R5),0(R8)      MOVE AIX KEY
MOVEBASE MVC   0(0,R7),0(R8)      MOVE BASE KEY
*
LOAD     DS    0H
********
* LOAD *
********
         L     R5,GETENVI         R5=INPUT QSAM PATH ADDRESS
* PROCESS QSAM ENVIRONMENT VARIABLE
*
* FORM THE DSN IN THE ENVIRONMENT VARIABLE
* SET INQSAM=E:\Z390\CICS\VSAM\MYFILE8F.TXT[RECFM=FT]
         MVI   FINDDOT,0          DON'T FIND DOT
         TRT   0(128,R5),FINDSTOP FIND X'00' [
         MVI   FINDDOT,C'.'       RESET DOT
         CLI   0(R1),C'['         GOT AN OVERRIDE ?
         JNE   PROCQEND           EXIT IF NOT
         MVI   0(R1),0            TERMINATE QSAM DSNAME FOR OPEN
* E:\Z390\ZVSAM\MYFILE8F.TXT X'00' RECFM=FT]
         CLC   1(6,R1),QVSAM+7    ANY RECFM= OVERRIDE ?
         JNE   BADQSAMO           ERROR IF NOT
* RECFM OVERRIDE VALIDATION
         CHHSI 7(R1),C'VT'        VARIABLE TRANSLATE ?
         JNE   QSAMNVT            EXIT IF NOT
         MVHHI RECFMOVF,C'VT'     SET IT FOR WTO
         J     PROCQEND           EXIT
*
QSAMNVT  DS    0H
         CHHSI 7(R1),C'FT'        FIXED TRANSLATE ?
         JNE   BADQSAMO           ERROR IF NOT
         MVHHI RECFMOVF,C'FT'     SET IT FOR WTO
PROCQEND DS    0H
         ST    R5,INFILEQ+DCBDSNAM-IHADCB SET DSNAME
         MVI   ITYPE,C'O'         SET OUTPUT PROCESSING
         L     R5,GETENVO         R5=OUTPUT VSAM PATH ADDRESS
         JAS   R14,PROCVSAM       PROCESS VSAM, LOAD CAT, BUILD DSN
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   QVSETFIX           EXIT IF NOT
* VARIABLE VSAM
         CLI   RECFMOVF,C'F'      FIXED QSAM ?
         JE    BADRECFM           ERROR IF IT IS
         MVI   INFILEQ+DCBRECFM-IHADCB,DCBRECFM_V SET IN DCB (DEFAULT)
         CHHSI RECFMOVF,C'XX'     IS RECFM SET FROM OVERRIDE ?
         JE    SETVARLN           EXIT IF NOT
* SET RECFM FROM OVERRIDE
         CHHSI RECFMOVF,C'VT'     VARIABLE TRANSLATE ?
         JNE   BADSETVR           ERROR IF NOT
         MVI   INFILEQ+DCBRECFM-IHADCB,DCBRECFM_VT SET VT IN DCB
SETVARLN DS    0H
         L     R2,VXXXLMAX        R2=MAXIMUM RECORD LENGTH
         AHI   R2,4               +4 FOR RLF
         TM    VXXXFLG1,VCLRRRDS  VARIABLE RRDS ?
         JNO   SETNRRDS           EXIT IF NOT
         AHI   R2,10              +10 FOR RRN
SETNRRDS DS    0H
         ST    R2,INFILEQ+DCBBLKSIF-IHADCB SAVE VARIABLE BLKSIZE
         ST    R2,INFILEQ+DCBLRECLF-IHADCB SAVE VARIABLE LRECL
         GETMAIN RU,LV=(R2)
         ST    R1,VSAMINBF        SAVE INPUT BLOCK ADDRESS
         J     QVTYPE             EXIT
*
QVSETFIX DS    0H
* FIXED VSAM
         CLI   RECFMOVF,C'V'      VARIABLE QSAM ?
         JE    BADRECFM           ERROR IF IT IS
         MVI   INFILEQ+DCBRECFM-IHADCB,DCBRECFM_F SET DCB (DEFAULT)
         CHHSI RECFMOVF,C'XX'     IS RECFM SET FROM OVERRIDE ?
         JE    SETFIXLN           EXIT IF NOT
* SET RECFM FROM OVERRIDE
         CHHSI RECFMOVF,C'FT'     FIXED TRANSLATE ?
         JNE   BADSETFX           ERROR IF NOT
         MVI   INFILEQ+DCBRECFM-IHADCB,DCBRECFM_FT SET FT IN DCB
SETFIXLN DS    0H
         L     R2,VXXXLMAX        R2=MAXIMUM RECORD LENGTH
         ST    R2,INFILEQ+DCBBLKSIF-IHADCB SAVE FIXED BLKSIZE
         ST    R2,INFILEQ+DCBLRECLF-IHADCB SAVE FIXED LRECL
         TM    VXXXFLG1,VCLRSPAN  FIXED SPANNED ?
         JNO   QVTYPE             EXIT IF NOT
* GETMAIN A BLOCK FOR THE FIXED SPANNED RECORD
         L     R6,VXXXLMAX        R6=MAXIMUM RECORD SIZE
         GETMAIN RU,LV=(R6)
         ST    R1,VSAMINBF        SAVE FIXED SPANNED BLOCK ADDRESS
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JNO   QVTYPE             EXIT IF NOT
* FIXED SPANNED RRDS
* GETMAIN AND CLEAR BLOCK FOR EMPTIES
         GETMAIN RU,LV=(R6)
         ST    R1,VSAMNULL        SAVE RRDS NULL BLOCK
         LR    R4,R1              R4=RRDS NULL BLOCK ADDRESS
         LR    R5,R6              LENGTH TO CLEAR
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR RRDS NULL BLOCK
QVTYPE   DS    0H
*****************************************
* QSAM AND VSAM ARE BOTH FIXED/VARIABLE *
*****************************************
         OPEN  (INFILEQ,(INPUT))  OPEN QSAM INPUT
         LTR   R15,R15            OK ?
         JNZ   BADOPENQ           ERROR IF NOT
* SHOW INPUT FILE OPENED: PATH
         MVC   OPENMSG,WTOINP     MOVE 'INPUT OPENED' MSG
         L     R1,GETENVI         R1=QSAM INPUT PATH ADDRESS
         JAS   R14,OPENWTO        WTO OPEN FILE
         CVD   R2,WORK3           CONVERT LRECL
BUILDDTA DS    0H
* OPEN OUTPUT VSAM DTA
         OPEN  (DTAINOUT,(UPDATE)) OPEN VSAM DATA OUTPUT DCB
         LTR   R15,R15            OK ?
         JNZ   BADOPEND           ERROR IF NOT
* SHOW OUTPUT DTA FILE OPENED: PATH
         MVC   OPENMSG,WTOOUTDT   MOVE 'OUTPUT DTA OPENED' MSG
         LA    R1,VSAMDTAO        R1=VSAM OUTPUT PATH
         JAS   R14,OPENWTO        WTO OPEN FILE
* SET UP THE INFO LINE AND DISPLAY IT
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   SETNAIX            EXIT IF NOT
* AIX
         MVI   QVSAM,C'V'         SET VSAM INPUT
         MVC   XXDS(4),CNSTAIXU   SET AIX UNIQUE
         TM    VXXXFLG1,VAIXUKEY  UNIQUE ?
         JO    SETSPAN            EXIT IF IT IS
* AIX NON-UNIQUE
         MVHHI RECFMOVF,C'V '     SET AIX AS VARIABLE
         MVI   XXDS+3,C'N'        SET AIX NON-UNIQUE
         MVC   VARFIX(8),CNSTVARB SET VARIABLE
         MVC   NSPAN(10),CNSTSPAN SET SPANNED
         J     SETSPAN            EXIT
*
SETNAIX  DS    0H
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JO    SETXXDS            EXIT IF IT IS
         MVHHI XXDS,C'RR'         SET RRDS
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JO    SETXXDS            EXIT IF IT IS
         MVHHI XXDS,C'ES'         SET ESDS
SETXXDS  DS    0H
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   SETNVAR            EXIT IF NOT
         MVC   VARFIX(8),CNSTVARB SET VARIABLE
SETNVAR  DS    0H
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   SETSPAN            EXIT IF IT IS
         MVC   NSPAN(10),CNSTSPAN SET SPANNED
SETSPAN  DS    0H
         ED    DLRECL,WORK3+4     EDIT LRECL
         MVI   DLRECL,C'='        SET =
         WTO   MF=(E,WTOINFO)     DISPLAY INFO LINE
* GETMAIN 4K FOR DATA PREFIX BLOCK
         LHI   R5,4096            R5=PREFIX BLOCKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMPRFX        SAVE ADDRESS
* CLEAR DATA PREFIX BLOCK
         LR    R4,R1              R4=DATA PREFIX BLOCK ADDRESS
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR DATA PREFIX BLOCK
         LR    R4,R1              R4=RESTORE DATA PREFIX BLOCK ADDRESS
* INITIALISE DATA PREFIX BLOCK
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
         USING ZVSAMHDR,R4
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_PFX  SET PREFIX BLOCK
* BUILD DATA PREFIX BLOCK
         AHIK  R5,R4,PFXLENG+BHDRLENG+CTRLENG R5=TRACKER FOR
*                                                         VARIABLE DATA
         LA    R9,PFXLENG+BHDRLENG R9=OFFSET OF ZVSAMCTR
* CTREYE
         IILF  R0,CTRZCTR         INSERT EYECATCHER
         ST    R0,CTREYE          SAVE IT
* CTRLOKEY@ (SET IN KSDS/AIX DATA LATER)
         MVHHI CTRLOKEY@,-1       SET CTRLOKEY@ TO FOXES
         AHI   R9,CTRLENG         R9=TRACKER AS OFFSET
* PFXEYE
         IILF  R1,PFXZPFX         INSERT EYECATCHER
         ST    R1,PFXEYE          SAVE IT
* ADD DATA VOL/NAME/PATH FOR DATA BLOCK
* PFXDVOL@
         MVHHI PFXDVOL@,-1        SET TO FOXES
* PFXDNAM@
         JAS   R14,DODNAM         DATA FILE.SFX INT0 PREFIX BLOCK
* PFXDPAT@
         JAS   R14,DODPAT         DATA PATH INT0 PREFIX BLOCK
* ADD INDEX VOL/NAME/PATH FOR DATA BLOCK
* PFXXVOL@
         MVHHI PFXXVOL@,-1        SET TO FOXES
* PFXXNAM@
         JAS   R14,DOXNAM         INDEX FILE.SFX INT0 PREFIX BLOCK
* PFXXPAT@
         JAS   R14,DOXPAT         INDEX PATH INT0 PREFIX BLOCK
* PFXAIXN
         MVC   PFXAIXN,VXXXAIXN   MOVE NO. OF AIX'S ON UPGRADE SET
* SET THESE CONSECUTIVE FIELDS TO FOXES
*    PFXHXLRA, PFXBMAP, PFXEMAP, PFXMAPNW, PFXBDATA, PFXEDATA
*    PFXBSEGM, PFXESEGM, PFXROOT, PFXBLVLn/ELVLn(32)
         LR    R1,R4              SAVE HEADER BASE
         LR    R0,R9              SAVE TRACKER OFFSET
         LA    R4,PFXHXLRA        R4=BLOCK ADDRESS
         LA    R5,(9*8)+(32*8)    R5=LENGTH TO SET
         LR    R8,R4              AREA TO SET
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'FF'        SET FOXES TO AREA
         LR    R9,R0              RESTORE TRACKER OFFSET
         LR    R4,R1              RESTORE HEADER BASE
* PFXDTSKC, PFXIXSKC, PFXDTSKU, PFXIXSKU, PFXDTMAP, CTRSTMST
         STCK  STCK               SAVE STCK FOR INDEX
         MVC   PFXDTSKC,STCK      MOVE TO PFXDTSKC
         MVC   PFXIXSKC,STCK      MOVE TO PFXIXSKC
         MVC   PFXDTSKU,STCK      MOVE TO PFXDTSKU
         MVC   PFXIXSKU,STCK      MOVE TO PFXIXSKU
         MVC   PFXDTMAP,STCK      MOVE TO PFXDTMAP
         AHI   R1,BHDRLENG+PFXLENG+(CTRSTMST-ZVSAMCTR) ADDRESS OF FIELD
         MVC   0(8,R1),STCK       MOVE TO CTRSTMST
* PFXFRSPC
         MVC   PFXFRSPC,VXXXDFS   MOVE DATA FREESPACE %
* PFXFRBLK
         MVC   PFXFRBLK,VXXXDNB   MOVE DATA FREEBLOCK NUMBER
* PFXFRINT
         MVC   PFXFRINT,VXXXDFB   MOVE DATA FREEBLOCK INTERVAL
* PFXFFLGS
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   PFXKSDS            EXIT IF NOT
         OI    PFXFFLGS,PFX_KSDS+PFX_AIX SET KSDS+AIX FLAGS
         J     PFXDORFG           EXIT
*
PFXKSDS  DS    0H
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JNO   PFXNKSD2           EXIT IF NOT
         OI    PFXFFLGS,PFX_KSDS  SET IT
         J     PFXDORFG           EXIT
*
PFXNKSD2 DS    0H
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JNO   PFXNRRDS           EXIT IF NOT
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    PFXRRDS            EXIT IF IT IS
* GETMAIN A BLOCK FOR THE FIXED RRDS RECORD
         L     R6,VXXXLMAX        R6=MAXIMUM RECORD SIZE
         AHI   R6,10              +10 FOR RRN
         GETMAIN RU,LV=(R6)
         ST    R1,VSAMINBF        SAVE RRDS BLOCK ADDRESS
PFXRRDS  DS    0H
         OI    PFXFFLGS,PFX_RRDS  SET IT
         J     PFXDORFG           EXIT
*
PFXNRRDS DS    0H
         TM    VXXXFLG1,VCLRESDS  ESDS ?
         JNO   PFXNESDS           EXIT IF NOT
         OI    PFXFFLGS,PFX_ESDS  SET IT
         J     PFXDORFG           EXIT
*
PFXNESDS DS    0H
         TM    VXXXFLG1,VCLRLDS   LDS ?
         JNO   PFXDORFG           EXIT IF NOT
         OI    PFXFFLGS,PFX_LDS   SET IT
PFXDORFG DS    0H
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    PFXDOSPN           EXIT IF IT IS
         OI    PFXRFLGS,PFX_RFIX  SET FIXED
PFXDOSPN DS    0H
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   PFXDOUNQ           EXIT IF NOT
         OI    PFXRFLGS,PFX_RSPN  SET SPANNED
PFXDOUNQ DS    0H
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   PFXDOLEN           EXIT IF NOT
         OI    PFXRFLGS,PFX_KUNQ  SET AIX UNIQUE
         TM    VXXXFLG1,VAIXUKEY  AIX UNIQUE ?
         JO    PFXDOAIX           EXIT IF IT IS
         NI    PFXRFLGS,255-PFX_KUNQ SET NON-UNIQUE
         NI    PFXRFLGS,255-PFX_RFIX SET VARIABLE
         OI    PFXRFLGS,PFX_RSPN  SET SPANNED
PFXDOAIX DS    0H
         CLI   PXXFFLGS,PFX_ESDS  AIX ON ESDS ?
         JE    PFXDOLEN           EXIT IF IT IS
         OI    PFXRFLGS,PFX_AIXT  SET AIX ON KSDS
PFXDOLEN DS    0H
* PFXRCLEN
         MVC   PFXRCLEN,VXXXLMAX  MOVE (MAX) RECORD LENGTH
* PFXKYLEN
         MVC   PFXKYLEN,VXXXKLEN  MOVE KEY LENGTH
* PFXKYOFF
* FOR AN AIX DTA, THE KEY OFFSET IS ZERO
* VCLRKOFF IS THE OFFSET INTO THE BASE RECORD
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    PFXNKOFF           EXIT IF IT IS
* NOT AIX
         MVC   PFXKYOFF,VXXXKOFF  MOVE KEY OFFSET
PFXNKOFF DS    0H
* BHDRFRE@
         ST    R9,BHDRFRE@        SAVE FREESPACE OFFSET
* BHDRFREE
         LHI   R5,4096            R5=PREFIX BLOCKSIZE
         AHI   R5,-BFTRLENG       -FTR
         SR    R5,R9              -TOTAL PREFIX LENGTH
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         LHI   R5,4096            R5=PREFIX BLOCKSIZE
         JAS   R14,BUILDFTR       BUILD DATA PREFIX FTR BLOCK
         DROP  R4
         MVC   TRUDBKSZ,VXXXDBS   SET DEFAULT DATA BLKSIZE
* WTO DATA BLKSIZE
         L     R4,VXXXDBS         R4=DATA BLKSIZE
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    DBLKSIZE,WORK1+4   EDIT DATA BLKSIZE
         WTO   MF=(E,WTODBKSZ)    SHOW IT
* NO ADJUST/LOADED RECORDS WTO FOR VARIABLE OR SPANNED
         TM    VXXXFLG1,VCLRVREC+VCLRSPAN VARIABLE OR SPANNED ?
         JNZ   DFREESPC           EXIT IF EITHER
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   DATAADJ            EXIT IF NOT
* AIX
         TM    VXXXFLG1,VAIXUKEY  AIX UNIQUE ?
         JO    DATAADJ            EXIT IF IT IS
* AIX NON-UNIQUE
         CHSI  VXXXMAXE,0         ANY MAXELEMENTS ?
         JE    DATANUBF           EXIT IF NONE
* AIX NON-UNIQUE BLOCKSIZE OPTIMISATION
*
* ELIX BLOCK HAS HDR, COUNT(4), ENTRIES OF ELEMENT+XLRA
* FREESPACE (IF ANY), FTR
         LA    R2,1024            START FROM 1K
         SR    R3,R3              CLEAR R3
ELIXOPTL DS    0H
         JAS   R14,ELIXCALC       CALC NO. OF ELEMENTS FOR THIS BLKSIZE
         C     R8,VXXXMAXE        OPTIMAL BLKSIZE ?
         JNL   ELIXOPTK           EXIT IF IT IS
         AHI   R2,1024            NEXT K
         CFI   R2,2147481599      GOT TO UPPER LIMIT (2GB-2K-1) ?
         JNH   ELIXOPTL           LOOP IF NOT
* CANNOT GET HERE
         DC    H'0',C'BAD1'       LOGIC ERROR
ELIXOPTK DS    0H
* R2=OPTIMAL BLKSIZE IN BYTES
* USE IT IF LARGER THAN DEFAULT
         C     R2,TRUDBKSZ        LARGER THAN DEFAULT ?
         JNH   ELIXLOWB           EXIT IF NOT
         ST    R2,TRUDBKSZ        SAVE OPTIMAL DATA BLKSIZE
ELIXLOWB DS    0H
* WTO OPTIMAL BLKSIZE IN K
         LR    R3,R2              R3=OPTIMAL BLKSIZE
         SR    R2,R2              PREPARE FOR DIVIDE
         D     R2,CNST1024        R3=BLKSIZE IN K
         CVD   R3,WORK1           CONVERT TO DECIMAL
         ED    AIXJSIZE,WORK1+4   EDIT OPTIMAL BLKSIZE
         WTO   MF=(E,WTOAIXAJ)    SHOW IT
* WTO MAXELEMENTS AND MAXELEMENT LIMIT
         L     R2,VXXXMAXE        R2=MAXELEMENTS
         CVD   R2,WORK1           CONVERT TO DECIMAL
         ED    MAXELEM,WORK1+2    EDIT MAXELEMENTS
         WTO   MF=(E,WTOMXEAJ)    SHOW IT
DATANUBF DS    0H
         L     R2,TRUDBKSZ        R2=CHOSEN BLKSIZE
         JAS   R14,ELIXCALC       CALC NO. OF ELEMENTS FOR THIS BLKSIZE
         CVD   R8,WORK1           CONVERT MAXELEMENT LIMIT TO DECIMAL
         ED    MAXLIMIT,WORK1+2   EDIT MAXELEMENT LIMIT
         WTO   MF=(E,WTOMXAAJ)    SHOW IT
* BUFFER TO HOLD NON-UNIQUE AIX ENTRIES
* SIZE MUST BE BIG ENOUGH TO HOLD A MIDDLE SEGMENT (FULL BLOCK)
*
* CALC SIZE OF NON-UNIQUE BUFFER
*   (BLKSIZE/ELEMENT SIZE)*(L'AIXKEY+ELEMENT SIZE)
*    4096/21=195         )*(13+21=34)=6630=7K
*   BOILS DOWN TO ((BLKSIZE*L'AIXKEY)/ELEMENT SIZE)+BLKSIZE
*                  (4096*13=53248   )/21=2535+4096=6631=7K
         L     R1,TRUDBKSZ        R1=(ADJUSTED) AIX DATA BLKSIZE
         MS    R1,VXXXKLEN        *L'AIXKEY
         SR    R0,R0              PREPARE FOR DIVIDE
         D     R0,AIXNBSXL        /ELEMENT SIZE
         A     R1,TRUDBKSZ        +(ADJUSTED) AIX DATA BLKSIZE
         SRL   R1,10              /1024=K-BYTES
         AHI   R1,1               ROUND UP
* WTO NON-UNIQUE BUFFER SIZE
         LR    R0,R1              SAVE R1
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    AIXBUFSZ,WORK1+5   EDIT NON-UNIQUE BUFFER SIZE
         WTO   MF=(E,WTOAIXBF)    SHOW IT
         LR    R1,R0              RESTORE R1
         SLL   R1,10              BACK TO BYTES
         ST    R1,AIXNBFSZ        SAVE IT
         ST    R1,AIXNLENG        SAVE IT FOR REMAINING LENGTH
         GETMAIN RU,LV=(R1)
         ST    R1,VSAMAIXN        SAVE AIX NON-UNIQUE BUFFER ADDRESS
         ST    R1,AIXNBFIL        SAVE AIX NON-UNIQUE FILL POINT ADDR
* BUFFER TO HOLD AIX VARIABLE RECORD
         L     R1,TRUDBKSZ        R6=(ADJUSTED) AIX DATA BLKSIZE
         GETMAIN RU,LV=(R1)
         ST    R1,VSAMINBF        SAVE INPUT BUFFER
         J     DFREESPC           EXIT
*
WTOAIXBF DC    AL2(WTOAXFEN-*,0)
         DC    C'zREPRO AIX NON-UNIQUE BUFFER SIZE   '
AIXBUFSZ DC    X'402020202120'
         DC    C'K'
WTOAXFEN EQU   *
*
WTOMXEAJ DC    AL2(WTOMXEEN-*,0)
         DC    C'zREPRO AIX MAXELEMENTS        '
MAXELEM  DC    X'402020202020202020202020'
WTOMXEEN EQU   *
*
WTOAIXAJ DC    AL2(WTOAIXEN-*,0)
         DC    C'zREPRO AIX OPTIMAL BLKSIZE        '
AIXJSIZE DC    X'4020202020202020'
         DC    C'K'
WTOAIXEN EQU   *
*
WTOMXAAJ DC    AL2(WTOMXAEN-*,0)
         DC    C'zREPRO AIX MAX ELEMENT LIMIT  '
MAXLIMIT DC    X'402020202020202020202020'
WTOMXAEN EQU   *
*
WTODBKSZ DC    AL2(WTODBKEN-*,0)
         DC    C'zREPRO DATA BLKSIZE               '
DBLKSIZE DC    X'4020202020202020'
WTODBKEN EQU   *
*
DATAADJ  DS    0H
* AIX UNIQUE
* FIXED NON-SPANNED
* CALC MAX RECORDS/BLOCK
         SR    R4,R4              CLEAR R4
         L     R5,VXXXDBS         R5=DATA BLKSIZE
         AHI   R5,-(BHDRLENG+BFTRLENG+RPTRLENG) -(HDR+FTR+RPTREND)
         L     R6,VXXXLMAX        R6=RECORD LENGTH
         AHI   R6,RPTRLENG        R6=RECORD LENGTH+RPTR
         DR    R4,R6              / (RECORD LENGTH+RPTR)
         LTR   R5,R5              CAN WE FIT A FIXED RECORD ?
         JZ    BADFIT             ERROR IF NOT
         STRL  R5,WORK6           SAVE MAX RECORDS/BLOCK
         TM    VXXXFLG2,VCLRDADJ  DATAADJUST=YES ?
         JNO   NODADJ             EXIT IF NONE
* DATAADJUST=YES
* ADJUST DATA BLKSIZE
         MSR   R5,R6              * (RECORD LENGTH+RPTR)
         AHI   R5,BHDRLENG+BFTRLENG+RPTRLENG HDR+FTR+RPTREND
* ADDITIONAL REDUCTION IF TOTAL RECORDS IN BLOCK > 255
         LRL   R0,WORK6           R0=MAX RECORDS
         CFI   R0,255             > 255 RECS ?
         JNH   DTANOMAX           EXIT IF NOT
* BLKSIZE WAY TOO BIG
         AHI   R0,-255            R0=EXCESS RECORDS
         MSR   R0,R6              * (RECORD LENGTH+RPTR)
         SR    R5,R0              R5=FURTHER REDUCED BLKSIZE
DTANOMAX DS    0H
         ST    R5,TRUDBKSZ        SAVE ADJUSTED DATA BLKSIZE
* WTO ADJUSTED DATA BLKSIZE
         CVD   R5,WORK1           CONVERT TO DECIMAL
         ED    DBAJSIZE,WORK1+4   EDIT ADJUSTED DATA BLKSIZE
         WTO   MF=(E,WTODBKAJ)    SHOW IT
NODADJ   DS    0H
* WTO MAXIMUM DATA RECORDS/BLOCK
         L     R5,WORK6           R5=MAX RECORDS
         CVD   R5,WORK1           CONVERT TO DECIMAL
         ED    DMAXRECS,WORK1+4   EDIT MAXIMUM DATA RECORDS/BLOCK
         WTO   MF=(E,WTODMXRC)    SHOW IT
         L     R5,VSAMPRFX        R5=DATA PREFIX BLOCK ADDRESS
         USING ZVSAMHDR,R5
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
* PFXBLKSZ
         MVC   PFXBLKSZ,TRUDBKSZ  SET (ADJUSTED) DATA BLOCKSIZE
         DROP  R5
DFREESPC DS    0H
* WTO DATA FREESPACE %
         LLC   R4,VXXXDFS         R4=DATA FREESPACE %
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    DFSPERCT,WORK1+6   EDIT DATA FREESPACE %
         WTO   MF=(E,WTODCIPC)    SHOW IT
* WTO DATA FREEBLOCKS
         CHHSI VXXXDNB,0          ANY DATA FREEBLOCKS ?
         JE    NODFB              EXIT IF NONE
         LH    R4,VXXXDNB         R4=DATA FREEBLOCK NUMBER
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    DFREENUM,WORK1+5   EDIT DATA FREEBLOCK NUMBER
         LH    R4,VXXXDFB         R4=DATA FREEBLOCK AFTER EVERY
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    DFREEBLK,WORK1+5   EDIT DATA FREEBLOCK NUMBER
         WTO   MF=(E,WTODFBLK)    SHOW IT
NODFB    DS    0H
* CALC DATA FREESPACE
         SR    R5,R5              CLEAR R5
         ICM   R5,B'0001',VXXXDFS R5=DATA FREESPACE%
         JZ    DSPACPRO           EXIT IF ZERO
         L     R6,TRUDBKSZ        R6=(ADJUSTED) DATA BLKSIZE
         AHI   R6,-(BHDRLENG+BFTRLENG+RPTRLENG) -(HDR+FTR+RPTREND)
         MSR   R5,R6              * FREESPACE %
         SR    R4,R4              CLEAR R4
         D     R4,CNST0100        / 100
         ST    R5,MINSPACD        SAVE MINIMUM DATA FREESPACE
* NO RECS/BLOCK WTO FOR VARIABLE, SPANNED OR AIX NON-UNIQUE
         TM    VXXXFLG1,VCLRVREC+VCLRSPAN VARIABLE OR SPANNED ?
         JNZ   DSPACPRO           EXIT IF EITHER
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   RECADJ             EXIT IF NOT
* AIX
         TM    VXXXFLG1,VAIXUKEY  AIX UNIQUE ?
         JNO   DSPACPRO           EXIT IF NOT
* AIX UNIQUE
RECADJ   DS    0H
* FIXED NON-SPANNED
* ADJUST TO EXACT NO. OF RECORDS
         LR    R5,R6              R5=TOTAL FREESPACE
         S     R5,MINSPACD        R5=USABLE SPACE
         LR    R0,R5              SAVE IT
         L     R6,VXXXLMAX        R6=RECORD LENGTH
         AHI   R6,RPTRLENG        R6=RECORD LENGTH+RPTR
         SR    R4,R4              CLEAR R4
         DR    R4,R6              /RECORD LENGTH+RPTR=NO. OF RECORDS
* WTO LOADED DATA RECORDS/BLOCK
         CVD   R5,WORK1           CONVERT TO DECIMAL
         ED    DLODRECS,WORK1+4   EDIT LOADED DATA RECORDS/BLOCK
         WTO   MF=(E,WTODLDRC)    SHOW IT
         MSR   R5,R6              R5=USABLE SPACE
         SR    R0,R5              R0=EXTRA FREESPACE
         A     R0,MINSPACD        ADD IT IN
         ST    R0,MINSPACD        SAVE IT
DSPACPRO DS    0H
* SET UP DCB
         L     R2,TRUDBKSZ        R2=(ADJUSTED) DATA BLKSIZE
         ST    R2,DTAINOUT+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAINOUT+DCBLRECLF-IHADCB SAVE LRECL
****************************
* DATA SPACEMAP PROCESSING *
****************************
* GETMAIN FOR ANY PREVIOUS DATA BLOCK
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMPREV        SAVE PREVIOUS BLOCK ADDRESS
* GETMAIN FOR DATA SPACEMAP BLOCK
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMSPCE        SAVE SPACEMAP BLOCK ADDRESS
* CLEAR DATA SPACEMAP BLOCK
         LR    R4,R1              R4=BLOCK ADDRESS
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR SPACEMAP BLOCK
         LR    R4,R1              R4=RESTORE SPACEMAP BLOCK ADDRESS
         USING ZVSAMHDR,R4
* INITIALISE DATA SPACEMAP BLOCK
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_MAP  SET SPACEMAP BLOCK
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         JAS   R14,BUILDFTR       BUILD DATA SPACEMAP FTR BLOCK
         AHI   R5,-(BFTRLENG+1)   ALLOW SPACE FOR THE SPACEMAP ITSELF
         AR    R5,R4              R5=ADDRESS OF FOOTER-1
         ST    R5,SPCEEND         SAVE END OF SPACEMAP ADDRESS
**********************
* CREATE DATA BLOCKS *
**********************
* GETMAIN DATA BLOCK
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMDATA        SAVE DATA BLOCK ADDRESS
DATACRET DS    0H
* CLEAR DATA BLOCK
         LR    R4,R1              R4=DATA BLOCK ADDRESS
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR DATA BLOCK
         LR    R4,R1              R4=RESTORE DATA BLOCK ADDRESS
* INITIALISE DATA BLOCK
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_DTA  SET DATA BLOCK
* BHDRPREV
         MVC   BHDRPREV,VSAMDTAX  SET PREVIOUS DATA XLRA
* BHDRFRE@
         MVHI  BHDRFRE@,BHDRLENG  SET FREESPACE OFFSET AFTER HEADER
* BHDRFREE
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         AHI   R5,-(BHDRLENG+BFTRLENG) -(HDR+FTR)
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
* PROCESS FREEBLOCKS IF REQUESTED
         CHHSI VXXXDNB,0          ANY FREEBLOCKS REQUIRED ?
         JE    DATALOOP           EXIT IF NONE
* FREEBLOCKS REQUESTED
         CLC   DBINSERT+2(2),VXXXDFB REACHED NO. OF DATA BLOCKS ?
         JNE   DATALOOP           EXIT IF NOT
* TREAT VXXXDFB=0 AS A SPECIAL CASE
* THIS WILL ONLY INSERT VXXXDNB BLOCKS BEFORE THE FIRST BLOCK
         LH    R6,VXXXDNB         R6=NO. OF EMPTY BLOCKS TO INSERT
         CHHSI VXXXDFB,0          VXXXDFB=0 ?
         JNE   DATASPFB           EXIT IF NOT
         MVHHI VXXXDNB,0          KILL ANY MORE FREEBLOCKS
DATASPFB DS    0H
* ADJUST BHDRFRE@ AND BHDRFREE FOR RPTR_END
         L     R9,BHDRFRE@        R9=FREESPACE OFFSET
         ARK   R5,R4,R9           R5=OLD FREESPACE ADDRESS
         MVI   0(R5),RPTR_END     SET
         MVHI  1(R5),-1               ENDING RPTR
         AHI   R9,RPTRLENG        +RPTR
         ST    R9,BHDRFRE@        SAVE FREESPACE OFFSET
         L     R9,BHDRFREE        R9=TOTAL FREESPACE
         AHI   R9,-RPTRLENG       -RPTR
         ST    R9,BHDRFREE        SAVE TOTAL FREESPACE
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         JAS   R14,BUILDFTR       BUILD FTR BLOCK
DATAFBLP DS    0H
* THESE ARE SEQUENTIAL, SO ENSURE BHDRPREV IS SET
         CGHSI DTIXXLRA,0         IS THERE A PREVIOUS DATA BLOCK ?
         JE    DATABLK0           EXIT IF NOT
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         AGHI  R1,-256            CALC PREVIOUS
         STG   R1,BHDRPREV        SAVE PREVIOUS
DATABLK0 DS    0H
         JAS   R14,DATAWRIT       UPDATE PREV/WRITE NEW DATA BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
* PREPARE FOR NEXT DATA/SEGMENT BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
         L     R1,VSAMDATA        R1=DATA BLOCK ADDRESS
         JCT   R6,DATAFBLP        LOOP
*
         MVHI  DBINSERT,0         CLEAR DATA COUNT FOR FREEBLOCKS
         J     DATACRET           EXIT
*
WTODFBLK DC    AL2(WTODFBEN-*,0)
         DC    C'zREPRO DATA FREE BLOCKS:  '
DFREENUM DC    X'402020202120'
         DC    C' AFTER EVERY'
DFREEBLK DC    X'402020202120'
WTODFBEN EQU   *
*
WTODLDRC DC    AL2(WTODLDEN-*,0)
         DC    C'zREPRO LOADED DATA RECORDS/BLOCK  '
DLODRECS DC    X'4020202020202020'
WTODLDEN EQU   *
*
WTODMXRC DC    AL2(WTODMXEN-*,0)
         DC    C'zREPRO MAXIMUM DATA RECORDS/BLOCK '
DMAXRECS DC    X'4020202020202020'
WTODMXEN EQU   *
*
WTODCIPC DC    AL2(WTODCIEN-*,0)
         DC    C'zREPRO DATA FREESPACE %               '
DFSPERCT DC    X'40202120'
         DC    C'%'
WTODCIEN EQU   *
*
WTODBKAJ DC    AL2(WTODBJEN-*,0)
         DC    C'zREPRO ADJUSTED DATA BLKSIZE      '
DBAJSIZE DC    X'4020202020202020'
WTODBJEN EQU   *
*
DATALOOP DS    0H
* NON-UNIQUE AIX DETECTS EOF BUT STILL HAS TO PROCESS THE LAST RECORDS
*    EOFFLAG=X'FE' ALL RECORDS READ, CONTINUE PROCESSING
*    EOFFLAG=X'FF' COMPLETED PROCESSING
         CLI   EOFFLAG,X'FF'      HAS EOF OCCURRED ?
         JE    EOFDTA             EXIT IF IT HAS
         CLI   RECDEFER,X'FA'     RE-ENTER SPANNED AFTER FIRST WRITE ?
         JE    SPANCRET           EXIT IF IT IS
* BUILD ESDS/KSDS/RRDS
         SR    R5,R5              CLEAR R5
         SR    R6,R6              CLEAR R6
         SR    R8,R8              CLEAR R8
         SR    R9,R9              CLEAR R9
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   NOTAIXN            EXIT IF NOT
* AIX BUILD
         TM    VXXXFLG1,VAIXUKEY  UNIQUE KEY ?
         JO    NOTAIXN            EXIT IF IT IS
**********************************
* AIX BUILD WITH NON-UNIQUE KEYS *
**********************************
******** LARL  R1,EGQTV           ###
******** SYSTRACE (R1)            ###TRACE ON DESTROYS R1
******** SYSTRACE 'EGQTV '        ###TRACE ON DESTROYS R1
         MVI   VXXXFLG1,VAIXVREC+VAIXSPAN SET AS VARIABLE SPANNED
         ICM   R1,15,VSAMSEGM     SEGMENT AND ELIX BLOCKS GETMAINED ?
         JNZ   AIXNRUSE           EXIT IF THEY HAVE BEEN
* GETMAIN SEGMENT BLOCK AND CLEAR
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMSEGM        SAVE SEGMENT BLOCK ADDRESS
         LR    R4,R1              R4=SEGMENT BLOCK ADDRESS
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR SEGMENT BLOCK
         LR    R4,R1              R4=SEGMENT BLOCK ADDRESS
* INITIALISE SEGMENT BLOCK
* THERE CAN ONLY BE 1 RECORD IN IT
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_DTA+BHDR_SEG SET DATA+SEGMENT BLOCK
* BHDR#REC
         MVI   BHDR#REC,X'01'     SET 1 RECORD
* BHDRFRE@
         MVHI  BHDRFRE@,BHDRLENG+RPTRLENG*2
*                                 SET OFFSET AFTER HDR+RPTR+RPTREND
         AHIK  R6,R4,BHDRLENG     R6=CURRENT RPTR ADDRESS
         USING ZVSAMRPT,R6
         MVI   RPTRFLGS,RPTR_ACT+RPTR_SEG SET ACTIVE AND SEGMENT
         MVI   RPTRLENG(R6),RPTR_END SET
         MVHI  RPTRLENG+1(R6),-1         ENDING RPTR
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         JAS   R14,BUILDFTR       BUILD FTR BLOCK
* GETMAIN ELIX BLOCK AND CLEAR
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMELIX        SAVE ELIX BLOCK ADDRESS
         LR    R4,R1              R4=ELIX BLOCK ADDRESS
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR ELIX BLOCK
         LR    R4,R1              R4=ELIX BLOCK ADDRESS
* INITIALISE ELIX BLOCK
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_DTA  SET DATA BLOCK
* BHDRFLG2
         MVI   BHDRFLG2,BHDR_ELX  SET ELIX BLOCK
* BHDRNEXT (BHDRPREV WILL POINT TO FIRST SEGMENT)
         MVGHI BHDRNEXT,-1        NO NEXT SEGMENT
* BHDRFRE@
         MVHI  BHDRFRE@,BHDRLENG  SET FREESPACE OFFSET
* BHDRFREE
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         AHI   R5,-(BHDRLENG+BFTRLENG+4) -(HDR+FTR+COUNT)
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         AHIK  R6,R4,BHDRLENG     R6=COUNT ADDRESS
         MVHI  0(R6),1            SET TO 1 (FIRST)
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         JAS   R14,BUILDFTR       BUILD FTR BLOCK
AIXNRUSE DS    0H
         L     R4,VSAMSEGM        R4=SEGMENT BLOCK ADDRESS
* BHDRFREE
         L     R8,TRUDBKSZ        R8=(ADJUSTED) DATA BLKSIZE
         AHI   R8,-(BHDRLENG+BFTRLENG+RPTRLENG*2)
*                                 -HDR-FTR-RPTR-RPTREND
         ST    R8,BHDRFREE        SAVE TOTAL FREESPACE
         L     R4,VSAMDATA        RESTORE DATA BLOCK ADDRESS
         CLI   RECDEFER,X'FD'     RE-ENTER NON-UNIQUE AFTER WRITE ?
         JE    AIXNNEWB           EXIT IF IT IS
         CLI   RECDEFER,X'FB'     RE-ENTER NON-UNIQUE AFT FIRST WRITE ?
         JE    AIXNELX1           EXIT IF IT IS
         CLI   RECDEFER,X'F9'     RE-ENTER NON-UNQ AFT WRITE FST UNKN ?
         JE    AIXNELX2           EXIT IF IT IS
AIXNFILL DS    0H
* FILL THE BUFFER FROM FILL POINT UNTIL NO MORE WILL FIT OR EOF
*    EOFFLAG=X'00'  BUFFER FILL COMPLETED
*    EOFFLAG=X'FE'  NO MORE DATA, BUFFER HAS REMAINING ENTRIES
*    R2=NEW BUFFER FILL POINT
         L     R2,AIXNBFIL        R2=AIX NON-UNIQUE FILL POINT ADDRESS
         L     R3,AIXNLENG        R3=REMAINING LENGTH
BUFFLOOP DS    0H
         C     R3,VXXXLMAX        ENOUGH ROOM FOR A RECORD ?
         JL    BUFFEOF2           EXIT IF NOT
         CLI   EOFFLAG,X'FE'      GOT ALL THE RECS ?
         JE    BUFFEOF2           EXIT IF WE HAVE
         ZSORT GET,REC=(R2)       GET SORTED AIX REC FROM ZSORT
         CHI   R15,4              EOF ?
         JE    BUFFEOF            EXIT IF IT IS
         ST    R2,LOKEYPTR        SAVE POINTER TO AIX KEY
         JAS   R14,DOLOWKEY       SET LOW KEY IN CTRLOKEY@
         A     R2,VXXXLMAX        BUMP POINTER
         S     R3,VXXXLMAX        R3=REMAINING LENGTH
         J     BUFFLOOP           LOOP
*
BUFFEOF  DS    0H
         MVI   EOFFLAG,X'FE'      SET AIX INPUT EOF BUT BUFFER HAS RECS
BUFFEOF2 DS    0H
* AIXNTRAK NOT REDUCED UNTIL I BUILD THE RECORD OR SEGMENT
         CLI   EOFFLAG,0          FILL SUCCESSFUL ?
         JE    AIXNFULL           EXIT IF IT WAS
         CHSI  AIXNTRAK,0         ANY RECORDS LEFT ?
         JE    EOFDTA             EXIT IF NONE
AIXNFULL DS    0H
* SOME RECORDS LEFT
         ST    R2,AIXNBFIL        SAVE AS BUFFER FILL POINT
         ST    R2,AIXNBEND        SAVE BUFFER END POINT
* NOTE: THE BUFFER IS LARGE ENOUGH TO CONTAIN MORE DUPLICATES THAN
*       WILL FIT IN A BLOCK
*
* DUPLICATE COUNT:
* SCAN THE AIX RECORDS AND COUNT THE DUPLICATES
*
* AN ELEMENT IS EITHER BASEKEY(KSDS) OR XLRA(8 FOR ESDS)
* RECORD=4(RLF)+L'AIXKEY+4(COUNT)+COUNT*L'ELEMENT
*
* WE WILL NEVER SPLIT BASEKEY OR XLRA
*
* IF THE RECORD CAN FIT IN VSAMINBF...
*    BUILD THE RECORD
*    SHIFT THE BUFFER UP AND READ MORE
*
* FIT TEST:
* IF THIS RECORD CAN FIT INTO A BLOCK, INSERT IT AND RESTART THE
* DUPLICATE COUNT
*
* IF THE RECORD CAN'T FIT IN THE BLOCK AND IT'S NOT THE FIRST RECORD,
* WRITE BLOCK, START A NEW ONE AND REPEAT THE FIT TEST
*
* IF THE RECORD CAN'T FIT IN THE BLOCK AND IT IS THE FIRST RECORD...
*    (BIG RECORD, KNOWN SIZE)
*    CALCULATE THE SIZE OF THE SEGMENT...
*       12(SPX)+4(RLF)+L'AIXKEY+4(COUNT)+COUNT*L'ELEMENT
*    BUILD FIRST SEGMENT, SAVE ITS SPX ADDRESS
*    AFTER EACH SEGMENT BUILD, SHIFT THE BUFFER UP AND READ MORE
*
*    BUILD LAST SEGMENT, SPXBNEXT WILL BE UPDATED, WRITE IT
*    RESTART THE DUPLICATE TEST
*
* IF THE DUPLICATE SCAN HITS END OF BUFFER...(BIG RECORD, UNKNOWN SIZE)
*    IF IT'S NOT THE FIRST RECORD, WRITE BLOCK AND START A NEW ONE
*    BUILD FIRST SEGMENT, SAVE ITS SPX ADDRESS
*    WRITE MIDDLES AS NEEDED, SPXBNEXT WILL BE UPDATED, WRITE THEM
*    AFTER EACH SEGMENT BUILD, SHIFT THE BUFFER UP AND READ MORE
*    WHEN THE LAST SEGMENT IS WRITTEN WE WILL KNOW HOW MANY
*    ELEMENTS THERE ARE AND CAN UPDATE THE RLF AND COUNT IN THE FIRST
*    SEGMENT AND WRITE IT
*    RESTART THE DUPLICATE TEST
         L     R2,VSAMAIXN        R2=START ADDRESS FOR PAIRING
         L     R3,VXXXLMAX        R3=L'AIXREC
         AR    R3,R2              R3=ADDRESS OF NEXT AIX RECORD
         MVHI  AIXNDCNT,0         RESET DUPLICATE COUNT
AIXNLOPP DS    0H
         L     R5,AIXNKEYL        R5=L'AIXKEY-1
         EXRL  R5,AIXNCLCP        DUPLICATE ?
         JNE   AIXNPREN           EXIT IF DUPLICATES ENDED
* DUPLICATE
         ASI   AIXNDCNT,1         COUNT DUPLICATES
         A     R2,VXXXLMAX        BUMP FIRST PAIR POINTER
         A     R3,VXXXLMAX        BUMP SECOND PAIR POINTER
         C     R3,AIXNBEND        END OF BUFFER ?
         JNE   AIXNLOPP           LOOP
* END OF BUFFER
* EVEN IF WE EXACTLY FILL THE BUFFER WITH THE LAST RECORD
* WE STILL HAVE TO CONTINUE UNTIL AIXNTRAK=0
         MVI   AIXNMEGA,X'FF'     MARK BIG RECORD, UNKNOWN SIZE
AIXNPREN DS    0H
* UNEQUAL PAIR OR BUFFER END
         ASI   AIXNDCNT,1         COUNT LAST DUPLICATE
* WE HAVE AIXNDCNT DUPLICATES
* ELEMENTS ARE BASEKEYS/XLRAS
         CLI   RECDEFER,X'FC'     RE-ENTER NON-UNIQUE AFTER FIRST ?
         JE    AIXNDMOR           EXIT IF IT IS
* CALCULATE VARIABLE RECORD LENGTH
* KNOWN SIZE
*    VARIABLE RECORD LENGTH=4(RLF)+L'AIXKEY+4(COUNT)+COUNT*L'ELEMENT
* UNKNOWN SIZE
*    VARIABLE RECORD LENGTH=X'7FFFFFFF'
         CLI   AIXNMEGA,X'FF'     BIG RECORD, UNKNOWN SIZE ?
         JNE   AIXNKNW1           EXIT IF NOT
         IILF  R1,X'7FFFFFFF'     R1=MAXIMUM SIZE
         J     AIXNUNK1           EXIT
*
AIXNKNW1 DS    0H
         L     R1,AIXNKEYL        R1=L'AIXKEY-1
         AHI   R1,1+4+4           +1+RLF+ELEMENT COUNT
         L     R0,AIXNBSXL        R0=L'ELEMENT
         MS    R0,AIXNDCNT        * NO. OF ELEMENTS
         AR    R1,R0              R1=VARIABLE RECORD LENGTH
AIXNUNK1 DS    0H
         L     R5,BHDRFREE        R5=TOTAL FREESPACE
         AHI   R5,-(RPTRLENG*2)   -RPTR-RPTREND
         S     R5,MINSPACD        -MINIMUM DATA FREESPACE
* NOTE: R5 COULD TURN -VE
         CR    R1,R5              ROOM FOR REC+RPTR+RPTREND IN BLOCK ?
         JNH   AIXNBLDV           EXIT IF THERE IS
* NOT ENOUGH SPACE IN BLOCK
         CLI   BHDR#REC,0         IS THIS THE FIRST RECORD ?
         JE    AIXN2SPN           EXIT IF IT IS
* RE-ESTABLISH RPTR POINTER
         L     R4,VSAMDATA        R4=DATA BLOCK ADDRESS
         L     R6,BHDRFRE@        R6=CURRENT FREESPACE OFFSET
         AR    R6,R4              R6=RPTREND POSITION
* WE SET THE DEFERRAL FLAG, GO WRITE THE DATA BLOCK, INITIALISE AND
* RETURN TO AIXNNEWB
         MVI   RECDEFER,X'FD'     SET RE-ENTER NON-UNIQUE AFTER WRITE
         STM   R1,R2,AIXNRECL     SAVE RECORD LENGTH AND AIXKEY PTR
         J     DODTAWRT           EXIT
*
AIXNNEWB DS    0H
* WE NOW HAVE AN EMPTY DATA BLOCK
         MVI   RECDEFER,0         RESET RE-ENTER NON-UNIQUE AIX
         LM    R1,R2,AIXNRECL     RESTORE RECORD LENGTH AND AIXKEY PTR
         L     R5,BHDRFREE        R5=TOTAL FREESPACE
         AHI   R5,-(RPTRLENG*2)   -RPTR-RPTREND
         S     R5,MINSPACD        -MINIMUM DATA FREESPACE
         CR    R1,R5              ROOM IN BLOCK FOR WHOLE RECORD ?
         JNH   AIXNBLDV           EXIT IF THERE IS
AIXN2SPN DS    0H
* BIG RECORD, (UN)KNOWN SIZE AND NOT ENOUGH SPACE IN EMPTY DATA BLOCK
* KNOWN.....WE MUST SEGMENT INTO FIRST AND LAST
*           NO MIDDLE BECAUSE THE BUFFER WON'T BE BIG ENOUGH,
*           BUT WE'LL PUT IN A PROTECTIVE TEST ANYWAY
*           FIRST (DATA) AND LAST (SEGMENT) CAN BE WRITTEN IMMEDIATELY
*
* UNKNOWN...WE MUST SEGMENT INTO FIRST, MIDDLE(S) AND LAST
*
* CALCULATE SEGCOUNT AND THE SIZE OF THE SEGMENT
*    SEGCOUNT IS THE NO. OF ELEMENTS WE ARE PUTTING INTO THIS SEGMENT
*    COUNT IS THE TOTAL NUMBER OF ELEMENTS THAT IS (KNOWN) OR WILL BE
*    (UNKNOWN) PLACED HERE
*
* BUILD FIRST SEGMENT (DATA) (KNOWN/UNKNOWN)
*    12(SPX)+4(RLF)+L'AIXKEY+4(COUNT)+SEGCOUNT*L'ELEMENT
*    WRITE IT IF KNOWN
*
* BUILD MIDDLE SEGMENTS (UNKNOWN), WRITE THEM
*    12(SPX)+SEGCOUNT*L'ELEMENT
*
* BUILD LAST SEGMENT (KNOWN/UNKNOWN), WRITE IT
*    12(SPX)+SEGCOUNT*L'ELEMENT
*
* WRITE THE FIRST SEGMENT (DATA) (UNKNOWN)
*
* RESTART THE DUPLICATE TEST
         L     R9,BHDRFREE        R9=TOTAL DATA FREESPACE
         S     R9,AIXNKEYL        -L'AIXKEY-1
         AHI   R9,-(1+RPTRLENG*2+8+SPXLENG+4+4)
*                 -(1+RPTR+RPTREND+ELIX XLRA+SPXLENG+RLF+COUNT
         S     R9,MINSPACD        -MINIMUM DATA FREESPACE
         SR    R8,R8              PREPARE FOR DIVIDE
         D     R8,AIXNBSXL        R9=NO. OF ELEMENTS TO USE
* FEED TOTAL NO. OF ELEMENTS VIA R0
* IF UNKNOWN SIZE WE PUT FOXES INTO COUNT ANYWAY
         L     R0,AIXNDCNT        R0=KNOWN NO. OF ELEMENTS
         ST    R9,AIXNDCNT        SAVE NO. OF ELEMENTS TO USE
* CALC SEGMENT LENGTH
         MS    R9,AIXNBSXL        R9=COUNT*ELEMENT SIZE
         A     R9,AIXNKEYL        +L'AIXKEY-1
         AHI   R9,1+SPXLENG+4+4   +1+SPXLENG+RLF+COUNT
* ADJUST FREESPACE AND BUILD RPTR
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         AHI   R5,-(BHDRLENG+RPTRLENG+8+BFTRLENG)
*                                 -(HDR+RPTR1+ELIX XLRA+FTR)
         SR    R5,R9              -SEGMENT LENGTH
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         L     R6,BHDRFRE@        R6=CURRENT FREESPACE OFFSET
         AR    R6,R4              R6=CURRENT RPTR ADDRESS
         ASI   BHDRFRE@,RPTRLENG  SET NEW FREESPACE OFFSET
         MVI   RPTRFLGS,RPTR_ACT+RPTR_SEG SET ACTIVE AND SEGMENT
* CALC RECORD OFFSET
         L     R8,BHDRFRE@        R8=CURRENT FREESPACE OFFSET
         AR    R8,R5              R8=BYTE AFTER FREESPACE
         ST    R8,RPTRREC@        SET RECORD OFFSET
         LR    R14,R8             R14=RECORD OFFSET
         AR    R8,R4              R8=DATA BLOCK RECORD POSITION
* BUILD SEGMENT PREFIX
         USING ZVSAMSPX,R8
* SPXSEGCC
         MVI   SPXSEGCC,SPXSFRST  SET FIRST SEGMENT
         ASI   RDCOUNT,1          COUNT DATA RECORDS PROCESSED
* SPXSEGLN
         ST    R9,SPXSEGLN        SAVE LENGTH (INC. SPX)
         ST    R8,SEGDTSPX        SAVE DATA BLOCK SPX ADDRESS
         MVI   SEGDTUPD,0         DATA BLOCK SPXBNEXT NOT SET
         AHI   R8,SPXLENG         SEGMENT MOVED AFTER SPX
         MVI   SEGTYPE,SEGFRST    SET FIRST SEGMENT BLOCK
* BHDR#REC
         MVI   BHDR#REC,X'01'     SET 1 RECORD
         JAS   R14,AIXNINST       INSERT NON-UNIQUE RECORD
* GO AND FILL AND COUNT, RETURN TO AIXNDMOR
         MVI   RECDEFER,X'FC'     SET RE-ENTER NON-UNIQUE AFTER FIRST
         J     AIXNFILL           EXIT
*
AIXNDMOR DS    0H
         MVI   RECDEFER,0         RESET RECORD DEFERRED FLAG
         CLI   AIXNMEGA,X'FF'     BIG RECORD, UNKNOWN SIZE ?
         JE    AIXNUNK2           EXIT IF IT IS
* BIG RECORD, KNOWN SIZE
* SET SPXBNEXT (LAST)
* INSERT ELIX XLRA INTO FIRST SEGMENT
* WRITE FIRST SEGMENT (DATA), ELIX BLOCK AND LAST SEGMENT
* INSERT THE ELIX XLRA AFTER THE ENDING RPTR
         LG    R15,DTIXXLRA       R15=CURRENT BLOCK NUMBER
         ALGFI R15,256            R14=NEXT BLOCK NUMBER (ELIX)
         STG   R15,BHDRLENG+RPTRLENG*2(R4) SAVE ELIX XLRA
* ADJUST FREESPACE AND POINTER FOR ELIX XLRA
         ASI   BHDRFREE,-8        -ELIX XLRA=TOTAL FREESPACE
         ASI   BHDRFRE@,8         SET NEW FREESPACE OFFSET
         L     R8,SEGDTSPX        RESTORE DATA BLOCK SPX ADDRESS
* SPXBNEXT
         LG    R14,DTIXXLRA       R14=CURRENT BLOCK NUMBER
         ALGFI R14,512            R14=NEXT BLOCK NUMBER+1
         STG   R14,SPXBNEXT       SAVE IT
         MVI   SPXBNEXT+7,X'01'   SET RECORD NUMBER 1
         DROP  R8
         MVI   SEGDTUPD,X'FF'     MARK DATA BLOCK SPXBNEXT SET
* GO AND WRITE FIRST SEGMENT BLOCK
* RETURN TO AIXNELX1
         MVI   RECDEFER,X'FB'     SET RE-ENTER NON-UNQ AFT WRT FST KNWN
         AHI   R6,RPTRLENG        R6=RPTREND POSITION
         J     DODTAWRT           EXIT
*
AIXNELX1 DS    0H
* UPDATE THE ELIX BLOCK FIRST ENTRY WITH XLRA AND BHDRPREV
* UPDATE THE ELIX BLOCK WITH THE LAST ELEMENT AND XLRA THAT WILL BE IN
* THE LAST SEGMENT
*
* BHDRPREV (ELIX)
         MVI   RECDEFER,0         RESET RE-ENTER NON-UNQ AFT WT FST KNW
         L     R5,VSAMELIX        R5=ELIX BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         SLGFI R1,256             XLRA OF DATA BLOCK WRITTEN
         STG   R1,BHDRPREV-ZVSAMHDR(R5) MOVE DATA BHDRSELF TO ELIX PREV
* BHDRSELF (ELIX)
         ALGFI R1,256             XLRA OF ELIX
         STG   R1,BHDRSELF-ZVSAMHDR(R5) SAVE ELIX BHDRSELF
         AHI   R5,BHDRLENG        POINT TO ELIX COUNT
         ASI   0(R5),1            ELIX COUNT=2
* XLRA FOR FIRST DATA BLOCK IN ELIX
         AHI   R5,4               POINT TO FIRST ELEMENT
         A     R5,AIXNBSXL        POINT AFTER THE ELEMENT
         SLGFI R1,256             XLRA OF DATA BLOCK WRITTEN
         STG   R1,0(R5)           SAVE THE XLRA
         MVI   7(R5),X'01'        SET REC=01
         L     R9,AIXNDCNT        R9=NO. OF ELEMENTS WILL BE MOVED
         MS    R9,VXXXLMAX        R9=COUNT*AIX RECORD SIZE
         A     R9,VSAMAIXN        R9 POINTS AFTER LAST ELEMENT
* ELEMENT AND XLRA FOR LAST DATA BLOCK IN ELIX
         S     R9,AIXNBSXL        POINT TO LAST ELEMENT
         AHI   R5,8               POINT TO NEXT ELIX ENTRY
         L     R14,AIXNBSXL       R14=L'ELEMENT (BASEKEY/XLRA)
         AHI   R14,-1             -1 FOR EXECUTE
         EXRL  R14,AIXNMOV1       MOVE LAST ELEMENT INTO ELIX
         A     R5,AIXNBSXL        POINT AFTER THE ELEMENT
         ALGFI R1,512             XLRA OF LAST SEGMENT TO BE WRITTEN
         STG   R1,0(R5)           SAVE THE XLRA
         MVI   7(R5),X'01'        SET REC=01
         MVI   SEGELIXL,X'FF'     ELIX FOR LAST SEGMENT HAS BEEN SET
* WRITE AND RESET ELIX BLOCK
         SLGFI R1,256             XLRA OF ELIX BLOCK
         JAS   R14,ELIXWRIT       WRITE AND RESET ELIX BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
* PREPARE FOR NEXT DATA/SEGMENT BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
         J     AIXNDLST           EXIT
AIXNMOV1 MVC   0(0,R5),0(R9)      MOVE LAST ELEMENT INTO ELIX
*
         DROP  R13                DROP 1ST MAINLINE BASE
*
AIXNUNK2 DS    0H
* BIG RECORD, UNKNOWN SIZE
         L     R4,VSAMSEGM        R4=SEGMENT BLOCK ADDRESS
         L     R9,BHDRFREE        R9=TOTAL SEGMENT FREESPACE
         S     R9,MINSPACD        -MINIMUM DATA FREESPACE
         AHI   R9,-SPXLENG        -SPXLENG
         SR    R8,R8              PREPARE FOR DIVIDE
         D     R8,AIXNBSXL        R9=NO. OF ELEMENTS WE CAN FIT
* IF THE NUMBER OF DUPLICATES IS GREATER THAN THE NUMBER WE CAN FIT
* THEN WE MUST CREATE A MIDDLE, OTHERWISE CREATE A LAST
         C     R9,AIXNDCNT        NEED A MIDDLE ?
         JNL   AIXNDLST           EXIT IF WE DON'T
* CREATE A MIDDLE
         ST    R9,AIXNDCNT        SAVE AS NUMBER WE WILL USE
* CALC SEGMENT LENGTH
         MS    R9,AIXNBSXL        R9=COUNT*ELEMENT SIZE
         AHI   R9,SPXLENG         +SPXLENG
* ADJUST FREESPACE AND BUILD RPTR
* BHDRFREE
         L     R5,BHDRFREE        R5=TOTAL FREESPACE
         S     R5,MINSPACD        -MINIMUM DATA FREESPACE
         SR    R5,R9              -SEGMENT LENGTH (INC. SPX)
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         LA    R6,BHDRLENG(R4)    R6=RPTR ADDRESS
* CALC RECORD OFFSET
         L     R8,BHDRFRE@        R8=CURRENT FREESPACE OFFSET
         AR    R8,R5              R8=BYTE AFTER FREESPACE
         ST    R8,RPTRREC@        SET RECORD OFFSET
         AR    R8,R4              R8=SEGMENT BLOCK RECORD POSITION
* BUILD SEGMENT PREFIX
         USING ZVSAMSPX,R8
* SPXSEGCC
         MVI   SPXSEGCC,SPXSMIDL  SET MIDDLE SEGMENT
* SPXSEGLN
         ST    R9,SPXSEGLN        SAVE LENGTH (INC. SPX)
* SPXBNEXT
         LG    R1,DTIXXLRA        R1=CURRENT BLOCK NUMBER
         ALGFI R1,256             R1=NEXT BLOCK NUMBER
         STG   R1,SPXBNEXT        SAVE IT
         MVI   SPXBNEXT+7,X'01'   SET RECORD NUMBER 1
         AHI   R8,SPXLENG         SEGMENT MOVED AFTER SPX
         MVI   SEGTYPE,SEGMIDL    SET MIDDLE SEGMENT BLOCK
         LR    R1,R9              R1=SEGMENT LENGTH
         JAS   R14,AIXNINST       INSERT NON-UNIQUE RECORD
         JAS   R14,SEGMWRIT       UPDATE PREV/WRITE NEW SEGMENT BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
* BHDRFREE RESET
         L     R8,TRUDBKSZ        R8=(ADJUSTED) DATA BLKSIZE
         AHI   R8,-(BHDRLENG+BFTRLENG+RPTRLENG*2)
*                                 -HDR-FTR-RPTR-RPTREND
         ST    R8,BHDRFREE        SAVE TOTAL FREESPACE
* GO AND FILL AND COUNT, RETURN TO AIXNDMOR
         MVI   RECDEFER,X'FC'     SET RE-ENTER NON-UNIQUE AFTER MIDDLE
         J     AIXNFILL           EXIT
*
AIXNDLST DS    0H
* BUILD LAST SEGMENT BLOCK AND WRITE IT
*
* ENTRY HERE IS :
*    KNOWN SIZE AFTER WRITING FIRST DATA BLOCK
*    UNKNOWN SIZE AFTER CREATING FIRST DATA BLOCK AND WRITING MIDDLES
*
* FOR UNKNOWN SIZE, SET RLF AND COUNT IN FIRST DATA BLOCK AND WRITE IT
         L     R4,VSAMSEGM        R4=SEGMENT BLOCK ADDRESS
         L     R9,AIXNDCNT        R9=RESIDUAL COUNT
* CALC SEGMENT LENGTH
         MS    R9,AIXNBSXL        R9=COUNT*ELEMENT SIZE
         AHI   R9,SPXLENG         +SPXLENG
* ADJUST FREESPACE AND BUILD RPTR
* BHDRFREE
         L     R5,BHDRFREE        R5=TOTAL FREESPACE
         S     R5,MINSPACD        -MINIMUM DATA FREESPACE
         SR    R5,R9              -SEGMENT LENGTH (INC. SPX)
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         LA    R6,BHDRLENG(R4)    R6=RPTR ADDRESS
* CALC RECORD OFFSET
         L     R8,BHDRFRE@        R8=CURRENT FREESPACE OFFSET
         AR    R8,R5              R8=BYTE AFTER FREESPACE
         ST    R8,RPTRREC@        SET RECORD OFFSET
         DROP  R6
         AR    R8,R4              R8=SEGMENT BLOCK RECORD POSITION
* BUILD SEGMENT PREFIX
* SPXSEGCC
         MVI   SPXSEGCC,SPXSLAST  SET LAST SEGMENT
* SPXSEGLN
         ST    R9,SPXSEGLN        SAVE LENGTH (INC. SPX)
* SPXBNEXT
         MVGHI SPXBNEXT,-1        NO NEXT SEGMENT
         DROP  R8
         AHI   R8,SPXLENG         SEGMENT MOVED AFTER SPX
         MVI   SEGTYPE,SEGLAST    SET LAST SEGMENT BLOCK
         LR    R1,R9              R1=SEGMENT LENGTH
         JAS   R14,AIXNINST       INSERT NON-UNIQUE RECORD
         JAS   R14,SEGMWRIT       UPDATE PREV/WRITE NEW SEGMENT BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
* BHDRFREE RESET
         L     R8,TRUDBKSZ        R8=(ADJUSTED) DATA BLKSIZE
         AHI   R8,-(BHDRLENG+BFTRLENG+RPTRLENG*2)
*                                 -HDR-FTR-RPTR-RPTREND
         ST    R8,BHDRFREE        SAVE TOTAL FREESPACE
         CLI   AIXNMEGA,X'FF'     BIG RECORD, UNKNOWN SIZE ?
         JNE   AIXNKNO1           EXIT IF NOT
* BIG RECORD, UNKNOWN SIZE, JUST WRITTEN LAST
* INSERT THE ELIX XLRA AFTER THE ENDING RPTR INTO FIRST SEGMENT
         L     R14,VSAMDATA       R14=DATA BLOCK ADDRESS
         LG    R15,DTIXXLRA       R15=CURRENT BLOCK NUMBER
         ALGFI R15,512            R14=NEXT BLOCK NUMBER+1 (ELIX)
         STG   R15,BHDRLENG+RPTRLENG*2(R14) SAVE ELIX XLRA
* ADJUST FREESPACE AND POINTER FOR ELIX XLRA
         ASI   BHDRFREE-ZVSAMHDR(R14),-8 -ELIX XLRA=TOTAL FREESPACE
         ASI   BHDRFRE@-ZVSAMHDR(R14),8 SET NEW FREESPACE OFFSET
* CALC AND SAVE RLF, AND SAVE ELEMENT COUNT IN FIRST SEGMENT (DATA)
         L     R0,AIXNMEGC        R0=TOTAL ELEMENT COUNT
         MVHI  AIXNMEGC,0         RESET CURRENT ELEMENT COUNT
         L     R1,SEGDTSPX        R1=DATA BLOCK SPX ADDRESS
* CALC AND SAVE RLF
         LR    R9,R0              SAVE COUNT
         MS    R9,AIXNBSXL        R9=LENGTH OF ELEMENTS
         A     R9,AIXNKEYL        +L'AIXKEY-1
         AHI   R9,1+4+4           +1+RLF+COUNT=TOTAL VARIABLE LENGTH
         ST    R9,SPXLENG(R1)     SAVE IN RLF
* POINT TO ELEMENT COUNT AND SAVE
         A     R1,AIXNKEYL        +L'AIXKEY-1
         AHI   R1,SPXLENG+1+4     +1+SPX+RLF=COUNT ADDRESS
         ST    R0,0(R1)           SAVE COUNT
         C     R9,MAXVARSZ        BIGGEST MAXIMUM VARIABLE LENGTH ?
         JNH   AIXNKNO1           EXIT IF NOT
         ST    R9,MAXVARSZ        SAVE IT
AIXNKNO1 DS    0H
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
         L     R4,VSAMDATA        R4=DATA BLOCK ADDRESS
* POINT TO BYTE AFTER RPTR FOR RPTREND
         AHIK  R6,R4,BHDRLENG+RPTRLENG R6=CURRENT RPTR ADDRESS+RPTRLENG
* FOR BIG RECORD, UNKNOWN SIZE WE HAVE DEFERRED THE FIRST SEGMENT WRITE
         CLI   AIXNMEGA,X'FF'     BIG RECORD, UNKNOWN SIZE ?
         JNE   AIXNKNWN           EXIT IF NOT
* BIG RECORD, UNKNOWN SIZE
         MVI   AIXNMEGA,0         RESET BIG RECORD INDICATOR
* GO AND WRITE FIRST SEGMENT BLOCK
* RETURN TO AIXNELX2
         MVI   RECDEFER,X'F9'     SET RE-ENTER NON-UNQ AFT WRT FST UNKN
         J     DODTAWRT           EXIT
*
AIXNELX2 DS    0H
* UPDATE THE ELIX BLOCK FIRST ENTRY WITH XLRA AND BHDRPREV
* WRITE ELIX BLOCK
* BHDRPREV (ELIX)
         MVI   RECDEFER,0         RESET RE-ENTER NON-UNQ AFT WT FST UNK
         L     R5,VSAMELIX        R5=ELIX BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         SLGFI R1,256             XLRA OF DATA BLOCK JUST WRITTEN
         STG   R1,BHDRPREV-ZVSAMHDR(R5) MOVE DATA BHDRSELF TO ELIX PREV
* BHDRSELF (ELIX)
         ALGFI R1,256             XLRA OF ELIX
         STG   R1,BHDRSELF-ZVSAMHDR(R5) SAVE ELIX BHDRSELF
* XLRA FOR FIRST DATA BLOCK IN ELIX
         AHI   R5,BHDRLENG+4      POINT TO FIRST ELEMENT
         A     R5,AIXNBSXL        POINT AFTER THE ELEMENT
         SLGFI R1,256             XLRA OF DATA BLOCK WRITTEN
         STG   R1,0(R5)           SAVE THE XLRA
         MVI   7(R5),X'01'        SET REC=01
* WRITE AND RESET ELIX BLOCK
         ALGFI R1,256             XLRA OF ELIX
         JAS   R14,ELIXWRIT       WRITE AND RESET ELIX BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
* PREPARE FOR NEXT DATA/SEGMENT BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
         J     AIXNFILL           EXIT
*
AIXNKNWN DS    0H
* BIG RECORD, KNOWN SIZE
         MVI   AIXNMEGA,0         RESET BIG RECORD INDICATOR
         J     AIXNFILL           EXIT
*
AIXNBLDV DS    0H
* INSERT WHOLE NON-UNIQUE VARIABLE RECORD INTO BLOCK
* ADJUST FREESPACE AND BUILD RPTR
         ASI   RDCOUNT,1          COUNT DATA RECORDS PROCESSED
* BHDR#REC
         IC    R6,BHDR#REC        R6=NO. OF RECORDS
         AHI   R6,1               +1
         STC   R6,BHDR#REC        SAVE NO. OF RECORDS
         AHI   R5,RPTRLENG        R5=TRUE FREESPACE WITHOUT %FREESPACE
         A     R5,MINSPACD        R5=TRUE FREESPACE WITH %FREESPACE
         SR    R5,R1              -RECORD LENGTH
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         L     R6,BHDRFRE@        R6=CURRENT FREESPACE OFFSET
         AR    R6,R4              R6=CURRENT RPTR ADDRESS
         ASI   BHDRFRE@,RPTRLENG  SET NEW FREESPACE OFFSET
         USING ZVSAMRPT,R6
         MVI   RPTRFLGS,RPTR_ACT  SET ACTIVE RECORD
* CALC RECORD OFFSET
         L     R8,BHDRFRE@        R8=CURRENT FREESPACE OFFSET
         AR    R8,R5              R8=BYTE AFTER FREESPACE
         ST    R8,RPTRREC@        SET RECORD OFFSET
         DROP  R6
         AR    R8,R4              R8=DATA BLOCK RECORD POSITION
* FEED NO. OF ELEMENTS VIA R0
         L     R0,AIXNDCNT        R0=KNOWN NO. OF ELEMENTS
         MVI   SEGTYPE,SEGWHOLE   SET WHOLE NON-UNIQUE RECORD
         JAS   R14,AIXNINST       INSERT WHOLE NON-UNIQUE RECORD
         J     AIXNFILL           EXIT
*
AIXNCLCP CLC   0(0,R2),0(R3)      COMPARE AIX KEY DUPLICATE
*
NOTAIXN  DS    0H
******************************
* NOT AN AIX                 *
* --OR--                     *
* AIX BUILD WITH UNIQUE KEYS *
******************************
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JO    RECSPAN            EXIT IF IT IS
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   DATAFIXL           EXIT IF NOT
RECSPAN  DS    0H
* FIXED SPANNED
* VARIABLE NON-SPANNED
* VARIABLE SPANNED (NOT AIX NON-UNIQUE)
*
* FOR A VARIABLE, VSAMINBF CAN CONTAIN...
*    A COMPLETE VARIABLE RECORD
*    IF THE RECORD IS TOO LARGE FOR THE BLOCK AND NOT SPANNED...ABORT
*    IF THE RECORD IS TOO LARGE FOR THE BLOCK, IT WILL BE SEGMENTED
         L     R6,BHDRFRE@        R6=CURRENT FREESPACE OFFSET
         L     R9,VSAMINBF        R9=VARIABLE BLOCK ADDRESS
         MVI   RRDSNFLG,0         RESET NULL RECORD FLAG
         CLI   RECDEFER,X'FE'     IS EMPTY DEFERRED FLAG SET ?
         JNE   RECNDEFR           EXIT IF NOT
* EMPTY DEFERRED FLAG SET
         LA    R9,RRDSNULL        R9=NULL RECORD ADDRESS
         MVI   RECDEFER,0         RESET EMPTY DEFERRED FLAG
         MVI   RRDSNFLG,X'FF'     SET NULL RECORD FLAG
         J     RECGOT             EXIT
*
RECNDEFR DS    0H
         CLI   RECDEFER,X'FF'     IS RECORD DEFERRED FLAG SET ?
         MVI   RECDEFER,0         RESET RECORD DEFERRED FLAG
         JE    RECGOT             EXIT IF IT IS
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JNO   RRNGETRV           EXIT IF NOT
         CLI   RRDSFLAG,X'FF'     HAS RRDS RECORD BEEN WRITTEN ?
         MVI   RRDSFLAG,0         RESET FLAG
         JE    RRNGETRV           EXIT IF IT WAS
         CGHSI RRDSEMTY,0         ANY MORE EMPTIES NEEDED ?
         JNE   RRNEMPTV           EXIT IF THERE ARE
         J     RRNNOEMT           EXIT TO INSERT RRDS RECORD
*
RRNGETRV DS    0H
*************************************
* NOT RRDS                          *
* --OR--                            *
* RRDS AND LAST RECORD WAS INSERTED *
*************************************
* NEED RPTR LOCATION FOR EOF PROCESSING
         AR    R6,R4              R6=CURRENT RPTR ADDRESS
* RECORD IS READ INTO BLOCK:
*    AS RDW,DATA     (KSDS,ESDS)
*    AS RDW,RRN,DATA (RRDS)
*    AS DATA         (FIXED SPANNED KSDS,ESDS)
*    AS RRN,DATA     (FIXED SPANNED RRDS)
*    RDW IS CONVERTED TO RLF
         GET   INFILEQ,(R9)       GET QSAM INPUT RECORD
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JNO   LOKEYNO1           EXIT IF NOT
* KSDS
         LR    R0,R9              R0=RECORD POINTER
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   LOKEYFX1           EXIT IF NOT
* KSDS VARIABLE
         AHI   R0,4               MISS RDW
LOKEYFX1 DS    0H
         L     R5,VSAMPRFX        R5=DATA PREFIX BLOCK ADDRESS
         AHI   R5,BHDRLENG        R5=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R5
         A     R0,PFXKYOFF        +KEY OFFSET
         DROP  R5
         ST    R0,LOKEYPTR        SAVE POINTER TO AIX KEY
         JAS   R14,DOLOWKEY       SET LOW KEY IN CTRLOKEY@
LOKEYNO1 DS    0H
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   RECNVAR            EXIT IF NOT
* VARIABLE, CONVERT RDW TO RLF
         LLH   R0,0(R9)           R0=RECORD LENGTH (INC. RDW)
         ST    R0,0(R9)           SAVE AS RLF
         LG    R1,TOTRCSZD        R1=TOTAL DATA RECORD LENGTHS
         AGFR  R1,R0              +THIS ONE
         STG   R1,TOTRCSZD        SAVE IT
         LR    R1,R0              R1=RECORD LENGTH (INC. RLF)
         TM    VXXXFLG1,VCLRRRDS  RRDS VARIABLE ?
         JNO   RECNRRVR           EXIT IF NOT
* RRDS VARIABLE
         AHIK  R1,R0,-10          R1=RECORD LENGTH-RRN (RLF+RECORD)
RECNRRVR DS    0H
* SAVE MAXIMUM VARIABLE SIZE
         C     R1,MAXVARSZ        BIGGEST MAXIMUM VARIABLE LENGTH ?
         JNH   RECNVAR            EXIT IF NOT
         ST    R1,MAXVARSZ        SAVE NEW MAXIMUM
RECNVAR  DS    0H
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JNO   RECNRRD1           EXIT IF NOT
* RRDS
*    CALCULATE NO. OF EMPTY SLOTS NEEDED
         ASI   0(R9),-10          RLF-10 FOR RRN
         AGSI  TOTRCSZD,-10       ADJUST TOTAL DATA RECORD LENGTHS
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   RECNRRD1           EXIT IF NOT
* RRDS VARIABLE
         MVI   WORK1,C'0'         MOVE RRN
         MVC   WORK1+1(10),4(R9)           AS 0NNNNNNNNNN
         ZAP   WORK7,CNSTP000     INITIALISE PACKED RRN
         PACK  WORK7+10(6),WORK1(11) PACK RRN
         CP    WORK7,CNSTP4G      > 4G ?
         JH    BADSLOT            ERROR IF IT IS
         CVBG  R5,WORK7           R5=RRN (64-BIT)
         CG    R5,RRDSSLOT        GOOD SEQUENCE ?
         JNH   BADRRNSQ           EXIT IF NOT
         LGR   R0,R5              SAVE NEXT RRN
         SG    R5,RRDSSLOT        CALC NO. OF
         AGHI  R5,-1                          EMPTY SLOTS NEEDED
         STG   R5,RRDSEMTY        SAVE NO. OF EMPTY SLOTS
         STG   R0,RRDSSLOT        SAVE NEXT RRN
         MVI   RRDSNFLG,0         RESET NULL RECORD FLAG
         CGHSI RRDSEMTY,0         ANY EMPTIES NEEDED ?
         JE    RRNNOEMT           EXIT IF NOT
RRNEMPTV DS    0H
* VARIABLE EMPTY SLOT WRITTEN AS NULL RLF X'00000004'
* FIXED SPANNED EMPTY SLOT, THE NULL RECORD IS WRITTEN
         LA    R9,RRDSNULL        R9=NULL RECORD
         MVI   RRDSNFLG,X'FF'     SET NULL RECORD FLAG
         ASI   RRCOUNT,1          COUNT EMPTIES
         J     RECNRRD2           EXIT
*
RRNNOEMT DS    0H
* PREPARE TO INSERT RRDS RECORD, SHIFT IT UP FIRST
         L     R8,VSAMINBF        R8=VARIABLE BLOCK ADDRESS
         L     R9,0(R8)           R9=LENGTH OF RLF+DATA
         AHI   R9,-4              R9=LENGTH OF DATA
         AHI   R8,4               MISS RLF
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    RECFIX2            EXIT IF IT IS
         L     R9,VXXXLMAX        R9=RECORD LENGTH
RECFIX2  DS    0H
         AHIK  R2,R8,10           MISS RRN
         LR    R3,R9              R3=LENGTH TO MOVE
         MVCL  R8,R2              SHIFT RECORD
         MVI   RRDSFLAG,X'FF'     SET RRDS WRITTEN FLAG
RECNRRD1 DS    0H
         L     R9,VSAMINBF        R9=RESTORE BLOCK ADDRESS
RECNRRD2 DS    0H
         L     R6,BHDRFRE@        R6=CURRENT FREESPACE OFFSET
RECGOT   DS    0H
         L     R5,BHDRFREE        R5=TOTAL FREESPACE
         AHI   R5,-(RPTRLENG*2)   -RPTR-RPTREND
         S     R5,MINSPACD        -MINIMUM DATA FREESPACE
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   RECFIX3            EXIT IF NOT
* VARIABLE
         L     R8,0(R9)           R8=RLF LENGTH
         LTR   R5,R5              VERY FEW BYTES LEFT ?
         JNP   RECFULL            EXIT IF TRUE
         CR    R5,R8              ROOM FOR RECORD+RPTR+RPTREND ?
         JNL   RECLENOK           EXIT IF THERE IS
         J     RECOFLOW           EXIT
*
RECFIX3  DS    0H
* FIXED
         LG    R0,TOTRCSZD        R0=TOTAL DATA RECORD LENGTHS
         AGF   R0,VXXXLMAX        +THIS ONE
         STG   R0,TOTRCSZD        SAVE IT
         C     R5,VXXXLMAX        ROOM FOR RECORD+RPTR+RPTREND ?
         JNL   RECLENOK           EXIT IF THERE IS
RECOFLOW DS    0H
* WE CAN'T FIT THE WHOLE RECORD
*
* IF NOT THE FIRST RECORD:
*    MUST WRITE THE BLOCK AND START A NEW ONE
*
* IF IT IS THE FIRST RECORD:
*    IF NOT SPANNED, THE BLKSIZE IS TOO SMALL...ABORT
*    IF SPANNED, FILL THE BLOCK WITH FIRST SEGMENT, THEN CREATE
*    MIDDLES AND LAST AS NEEDED
         CLI   BHDR#REC,0         IS THIS THE FIRST RECORD ?
         JNE   RECFULL            EXIT IF NOT
* FIRST RECORD AND WE CAN'T FIT IT
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   BADFIT             ERROR IF NOT
* FIRST RECORD AND SPANNED
         LR    R0,R5              R0=CURRENT FREESPACE
         MVC   SEGLEFT,0(R9)      SAVE RECORD LENGTH (INC. RLF)
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    RECLENSG           EXIT IF IT IS
* FIXED SPANNED
         MVC   SEGLEFT,VXXXLMAX   SAVE RECORD LENGTH
         J     RECLENSG           EXIT
*
RECFULL  DS     0H
**********************************************
* NON-SPANNED AND NOT ENOUGH ROOM FOR RECORD *
* --OR--                                     *
* SPANNED AND NOT FIRST RECORD               *
**********************************************
         AR    R6,R4              R6=RPTREND POSITION
         MVI   RECDEFER,X'FF'     SET RECORD DEFERRED INSERT FLAG
         MVHI  SEGLEFT,0          CLEAR SEGLEFT, NOT SEGMENTING NOW
         CLI   RRDSNFLG,X'FF'     ARE WE DEFERRING AN RRDS EMPTY ?
         JNE   DODTAWRT           EXIT IF NOT
         MVI   RECDEFER,X'FE'     SET EMPTY DEFERRED INSERT FLAG
         J     DODTAWRT           EXIT
*
RECLENOK DS    0H
* RECORD WILL FIT
* FOR SPANNED, NO SPX IS PREFIXED
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    RECVAR             EXIT IF IT IS
* FIXED AND WILL FIT
         L     R0,VXXXLMAX        R0=LENGTH OF DATA
         J     RECLENSG           EXIT
*
RECVAR   DS    0H
* VARIABLE AND WILL FIT
         L     R0,0(R9)           R0=LENGTH OF RLF+DATA
RECLENSG DS    0H
* SOURCES OF R0:
*    FIXED AND FIT    - LENGTH
*    VARIABLE AND FIT - LENGTH INCLUDING RLF
*    SPANNED TYPES FIXED AND VARIABLE - LENGTH OF SEGMENT
         AHI   R5,RPTRLENG        R5=TRUE FREESPACE WITHOUT %FREESPACE
         A     R5,MINSPACD        R5=TRUE FREESPACE WITH %FREESPACE
         SR    R5,R0              -RECORD LENGTH
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         ASI   BHDRFRE@,RPTRLENG  SET NEW FREESPACE OFFSET
         AR    R6,R4              R6=CURRENT RPTR ADDRESS
         USING ZVSAMRPT,R6
* CREATE DATA RPTR
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   NOTSPAN2           EXIT IF NOT
* SPANNED
         CHSI  SEGLEFT,0          ARE WE SEGMENTING ?
         JNE   VARMVRDY           EXIT IF WE ARE
NOTSPAN2 DS    0H
******************************
* NOT SPANNED                *
* -- OR --                   *
* SPANNED BUT NOT SEGMENTING *
******************************
         MVI   RPTRFLGS,RPTR_ACT  SET ACTIVE RECORD
         CGHSI RRDSEMTY,0         CREATING AN EMPTY SLOT ?
         JE    VARMVRDY           EXIT IF NOT
* EMPTY SLOT
         MVI   RPTRFLGS,RPTR_MTY  SET INACTIVE RECORD
         AGSI  RRDSEMTY,-1        DECREMENT EMPTIES NEEDED
VARMVRDY DS    0H
* CALC RECORD OFFSET
         L     R8,BHDRFRE@        R8=CURRENT FREESPACE OFFSET
         AR    R8,R5              R8=BYTE AFTER FREESPACE
         ST    R8,RPTRREC@        SET RECORD OFFSET
         AR    R8,R4              R8=DATA BLOCK RECORD POSITION
         TM    VXXXFLG1,VCLRKSDS+VCLRVREC VARIABLE KSDS ?
         JNO   RECNTKSD           EXIT IF NOT
* VARIABLE KSDS, CHECK IF RECORD LENGTH BIG ENOUGH FOR THE BASE KEY
         L     R1,0(R9)           R1=RECORD LENGTH INCLUDING RLF
         AHI   R1,-5              R1=MAXIMUM OFFSET
         L     R2,VXXXKOFF        CALC OFFSET OF
         A     R2,VXXXKLEN                       LAST BASE KEY
         AHI   R2,-1                                           BYTE
         CR    R2,R1              BAD VARIABLE RECORD ?
         JH    BADVREC            ERROR IF IT IS
RECNTKSD DS    0H
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   NOTSPAN3           EXIT IF NOT
* SPANNED
         CHSI  SEGLEFT,0          ARE WE SEGMENTING ?
         JE    NOTSPAN3           EXIT IF NOT
* SPANNED AND SEGMENTING, BUILD SPX AND ADJUST POINTERS FOR DATA MOVE
         USING ZVSAMSPX,R8
* SPXSEGCC
         MVI   SPXSEGCC,SPXSFRST  SET FIRST SEGMENT
         ASI   RDCOUNT,1          COUNT DATA RECORDS PROCESSED
* SPXSEGLN
         ST    R0,SPXSEGLN        SAVE LENGTH (INC. SPX)
* SPXBNEXT
         LG    R14,DTIXXLRA       R14=CURRENT BLOCK NUMBER
         ALGFI R14,256            R14=NEXT BLOCK NUMBER
         STG   R14,SPXBNEXT       SAVE IT
         MVI   SPXBNEXT+7,X'01'   SET RECORD NUMBER 1
         DROP  R8
         MVI   SEGDTUPD,X'FF'     MARK DATA BLOCK SPXBNEXT SET
         AHI   R8,SPXLENG         SEGMENT MOVED AFTER SPX
         AHI   R0,-SPXLENG        AND IS SPXLENG FEWER
         L     R2,SEGLEFT         R2=REMAINING RECORD LENGTH
         SR    R2,R0              REDUCE BY CURRENT SEGMENT
         ST    R2,SEGLEFT         SAVE REMAINING RECORD LENGTH
NOTSPAN3 DS    0H
* MOVE WHOLE RECORD INTO THE DATA BLOCK (SPANNED OR NON-SPANNED)
* --OR--
* MOVE FIRST SEGMENT RECORD INTO THE DATA BLOCK
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    RECFIX6            EXIT IF IT IS
* FIXED
* IF RRDS EMPTY, WE INSERT THE NULL RECORD (RECSIZE)X'00'
         CLI   RRDSNFLG,X'FF'     ARE WE INSERTING AN RRDS EMPTY ?
         JNE   RECFIX6            EXIT IF NOT
         L     R9,VSAMNULL        R9=NULL RECORD ADDRESS
RECFIX6  DS    0H
         LR    R2,R9              R2=BLOCK ADDRESS
         LR    R3,R0              R3=LENGTH TO MOVE
         LR    R9,R0              R9=LENGTH TO MOVE
         MVCL  R8,R2              MOVE RECORD INTO DATA BLOCK
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   DODTA              EXIT IF NOT
* SPANNED
         CHSI  SEGLEFT,0          ARE WE SEGMENTING ?
         JE    DODTA              EXIT IF NOT
         MVI   RPTRFLGS,RPTR_ACT+RPTR_SEG SET ACTIVE AND SEGMENT
* BHDR#REC
         MVI   BHDR#REC,X'01'     SET 1 RECORD
* SPANNED AND WE ARE SEGMENTING
* GO AND WRITE FIRST SEGMENT BLOCK
* RETURN TO SPANCRET
         MVI   RECDEFER,X'FA'     SET RE-ENTER SPANNED AFT FIRST WRITE
         AHI   R6,RPTRLENG        R6=RPTREND POSITION
         J     DODTAWRT           EXIT
*
************************
* CREATE SEGMENT BLOCK *
************************
SPANCRET DS    0H
         MVI   RECDEFER,0         RESET RECORD DEFERRED FLAG
         ICM   R1,15,VSAMSEGM     SEGMENT BLOCK GETMAINED ?
         JNZ   SPANRUSE           EXIT IF IT HAS BEEN
* GETMAIN SEGMENT BLOCK AND CLEAR
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMSEGM        SAVE SEGMENT BLOCK ADDRESS
         LR    R4,R1              R4=SEGMENT BLOCK ADDRESS
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR SEGMENT BLOCK
         LR    R4,R1              R4=SEGMENT BLOCK ADDRESS
* INITIALISE SEGMENT BLOCK
* THERE CAN ONLY BE 1 RECORD IN IT
* THE ONLY DIFFERENCES BETWEEN LAST AND MIDDLE ARE:
*    BHDRFREE (MIDDLE=0), RPTRREC@ AND THE SPX+DATA
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_DTA+BHDR_SEG SET DATA+SEGMENT BLOCK
* BHDR#REC
         MVI   BHDR#REC,X'01'     SET 1 RECORD
* BHDRFRE@
         MVHI  BHDRFRE@,BHDRLENG+RPTRLENG*2
*                                 SET OFFSET AFTER HDR+RPTR+RPTREND
         AHIK  R6,R4,BHDRLENG     R6=CURRENT RPTR ADDRESS
         MVI   RPTRFLGS,RPTR_ACT+RPTR_SEG SET ACTIVE AND SEGMENT
         MVI   RPTRLENG(R6),RPTR_END SET
         MVHI  RPTRLENG+1(R6),-1         ENDING RPTR
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         JAS   R14,BUILDFTR       BUILD FTR BLOCK
SPANRUSE DS    0H
* CALC MAX AVAILABLE SEGMENT SIZE
*
* IF ALL REMAINING BYTES ARE LARGER THAN FREESPACE...
*    MARK MIDDLE SEGMENT, MOVE ENOUGH DATA TO FILL BLOCK
*    MARK BLOCK AS PARTIALLY FULL
*    WRITE IT
*    LOOP TO FILL A MIDDLE SEGMENT BLOCK UNTIL WE CAN'T FILL IT
*
*    LAST SEGMENT IS IN A BLOCK ON IT'S OWN
         L     R4,VSAMSEGM        R4=SEGMENT BLOCK ADDRESS
* BHDRFREE
         L     R8,TRUDBKSZ        R8=(ADJUSTED) DATA BLKSIZE
         AHI   R8,-(BHDRLENG+BFTRLENG+RPTRLENG*2)
*                                 -HDR-FTR-RPTR-RPTREND
         ST    R8,BHDRFREE        SAVE TOTAL FREESPACE
         L     R9,TRUDBKSZ        R9=(ADJUSTED) DATA BLKSIZE
         AHI   R9,-(BHDRLENG+BFTRLENG+RPTRLENG*2+SPXLENG)
*                                 -HDR-FTR-RPTR-RPTREND-SPX
         S     R9,MINSPACD        -MINIMUM DATA FREESPACE
         C     R9,SEGLEFT         REMAINING RECORD > FREESPACE ?
         JL    SPANMIDL           EXIT IF IT IS
* WE CANNOT FILL A MIDDLE SEGMENT BLOCK
* REMAINING BYTES MUST GO IN A LAST SEGMENT BLOCK ON ITS OWN
         S     R8,MINSPACD        -MINIMUM DATA FREESPACE
         AHI   R8,-SPXLENG        -SPX
         S     R8,SEGLEFT         -LAST SEGMENT
         ST    R8,BHDRFREE        SAVE TOTAL FREESPACE LEFT
         LA    R6,BHDRLENG(R4)    R6=RPTR ADDRESS
         LA    R9,BHDRLENG+RPTRLENG*2(R8) R9=OFFSET AFTER FREESPACE
         ST    R9,RPTRREC@        SET RECORD OFFSET
         AR    R9,R4              R9=RECORD POSITION
         USING ZVSAMSPX,R9
* SPXSEGCC
         MVI   SPXSEGCC,SPXSLAST  SET LAST SEGMENT
* SPXSEGLN
         L     R0,SEGLEFT         R0=REMAINING SEGMENT LENGTH
         AHI   R0,SPXLENG         +SPX
         ST    R0,SPXSEGLN        SAVE LENGTH (INC. SPX)
* SPXBNEXT
         MVGHI SPXBNEXT,-1        NO NEXT SEGMENT
         DROP  R9
         AHIK  R8,R9,SPXLENG      R8=ADDRESS OF SEGMENT TO BE MOVED
         AHI   R0,-SPXLENG        AND IS SPXLENG FEWER
* MOVE LAST SEGMENT INTO THE SEGMENT BLOCK
         L     R2,VSAMINBF        R2=VARIABLE BLOCK ADDRESS
         SR    R9,R9              ZERO OFFSET FOR BIG RECORD LAST SEG
         L     R9,0(R2)           R9=RECORD LENGTH INC. RLF
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    RECFIX7            EXIT IF IT IS
* FIXED
         L     R9,VXXXLMAX        R9=RECORD LENGTH
         CLI   RRDSNFLG,X'FF'     ARE WE WRITING AN RRDS EMPTY ?
         JNE   RECFIX7            EXIT IF NOT
         L     R2,VSAMNULL        R2=NULL BLOCK ADDRESS
RECFIX7  DS    0H
         S     R9,SEGLEFT         R9=OFFSET TO REMAINING RECORD
         AR    R2,R9              R2=ADDRESS OF REMAINING RECORD
         LR    R3,R0              R3=LENGTH TO MOVE
         LR    R9,R0              R9=LENGTH TO MOVE
         MVCL  R8,R2              MOVE REMAINING RECORD
         MVHI  SEGLEFT,0          NO MORE SEGMENTS FOR THIS RECORD
* CALC POINT POSITION AND WRITE LAST SEGMENT BLOCK
         MVI   SEGTYPE,SEGLAST    SET LAST SEGMENT BLOCK
         JAS   R14,SEGMWRIT       UPDATE PREV/WRITE NEW SEGMENT BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
         L     R4,VSAMDATA        RESTORE DATA BLOCK ADDRESS
         J     DATALOOP           EXIT
*
SPANMIDL DS    0H
* REMAINING BYTES WON'T FIT, CREATE MIDDLE SEGMENT
* PREVIOUS BLOCK COULD BE DATA OR ANOTHER MIDDLE
*
* R9=ACTUAL DATA LENGTH TO MOVE (SPX ALLOWED FOR)
* BHDRFREE
         MVC   BHDRFREE,MINSPACD  MOVE FREESPACE
         LA    R6,BHDRLENG(R4)    R6=RPTR ADDRESS
         LA    R8,BHDRLENG+RPTRLENG*2 R8=RECORD OFFSET
         A     R8,MINSPACD        +MINIMUM DATA FREESPACE
         ST    R8,RPTRREC@        SET RECORD OFFSET
         AR    R8,R4              R8=RECORD POSITION
         USING ZVSAMSPX,R8
* SPXSEGCC
         MVI   SPXSEGCC,SPXSMIDL  SET MIDDLE SEGMENT
* SPXSEGLN
         AHIK  R5,R9,SPXLENG      R5=ACTUAL DATA LENGTH TO MOVE+SPX
         ST    R5,SPXSEGLN        SAVE LENGTH (INC. SPX)
* SPXBNEXT
         LG    R1,DTIXXLRA        R1=CURRENT BLOCK NUMBER
         ALGFI R1,256             R1=NEXT BLOCK NUMBER
         STG   R1,SPXBNEXT        SAVE IT
         MVI   SPXBNEXT+7,X'01'   SET RECORD NUMBER 1
         AHI   R5,-SPXLENG        -SPX TO RESTORE ACTUAL DATA LENGTH
         DROP  R8
         AHI   R8,SPXLENG         SEGMENT MOVED AFTER SPX
* MOVE MIDDLE SEGMENT INTO THE SEGMENT BLOCK
         L     R2,VSAMINBF        R2=VARIABLE BLOCK ADDRESS
         L     R9,0(R2)           R9=RECORD LENGTH INC. RLF
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    RECFIX8            EXIT IF IT IS
* FIXED
         L     R9,VXXXLMAX        R9=RECORD LENGTH
         CLI   RRDSNFLG,X'FF'     ARE WE WRITING AN RRDS EMPTY ?
         JNE   RECFIX8            EXIT IF NOT
         L     R2,VSAMNULL        R2=NULL BLOCK ADDRESS
RECFIX8  DS    0H
         S     R9,SEGLEFT         R9=OFFSET TO NEXT RECORD SEGMENT
         AR    R2,R9              R2=ADDRESS OF NEXT RECORD SEGMENT
         LR    R3,R5              R3=LENGTH TO MOVE
         LR    R9,R5              R9=LENGTH TO MOVE
         MVCL  R8,R2              MOVE NEXT RECORD SEGMENT
         L     R2,SEGLEFT         R2=CURRENT REMAINING LENGTH
         SR    R2,R5              LESS SEGMENT JUST MOVED
         ST    R2,SEGLEFT         SAVE REMAINING SEGMENT LENGTH
* CALC POINT POSITION AND WRITE MIDDLE SEGMENT BLOCK
         MVI   SEGTYPE,SEGMIDL    SET MIDDLE SEGMENT BLOCK
         JAS   R14,SEGMWRIT       UPDATE PREV/WRITE NEW SEGMENT BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
         LG    R1,DTIXXLRA        R1=CURRENT SEGMENT XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT SEGMENT XLRA
         J     SPANCRET           LOOP
*
BADVREC  DS    0H
* VARIABLE RECORD TOO SHORT FOR KSDS/AIX KEY
         L     R1,RDCOUNT         R1=DATA RECORD COUNT
         AHI   R1,1               +1
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    BADVRECN,WORK1+2   EDIT RECORD NUMBER
         WTO   MF=(E,WTOBADV)     SHOW IT
         J     BADRETN            EXIT
*
WTOBADV  DC    AL2(WTOBDVEN-*,0)
         DC    C'zREPRO VARIABLE RECORD TOO SHORT FOR BASE/AIX KEY'
         DC    C' AT RECORD NO. '
BADVRECN DC    X'402020202020202020202120'
WTOBDVEN EQU   *
*
DATAFIXL DS    0H
* FIXED LENGTH RECORDS
         L     R5,BHDRFREE        R5=TOTAL FREESPACE
         AHI   R5,-RPTRLENG       -RPTR
         S     R5,VXXXLMAX        -RECORD LENGTH
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         L     R6,BHDRFRE@        R6=CURRENT FREESPACE OFFSET
         AR    R6,R4              R6=CURRENT RPTR ADDRESS
         ASI   BHDRFRE@,RPTRLENG  SET NEW FREESPACE OFFSET
* CREATE DATA RPTR
         MVI   RPTRFLGS,RPTR_ACT  SET ACTIVE RECORD
* CALC RECORD OFFSET
         L     R9,BHDRFRE@        R9=CURRENT FREESPACE OFFSET
         AR    R9,R5              R9=BYTE AFTER FREESPACE
         ST    R9,RPTRREC@        SET RECORD OFFSET
         AR    R9,R4              R9=RECORD POSITION
* GET RECORD INTO THE DATA BLOCK
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   QSAMGET            EXIT IF NOT
* AIX UNIQUE BUILD
* AIXKEY,XLRA (ESDS) OR AIXKEY,BASE KEY (KSDS)
         LG    R1,TOTRCSZD        R1=TOTAL DATA RECORD LENGTHS
         AGF   R1,VXXXLMAX        +THIS ONE
         STG   R1,TOTRCSZD        SAVE IT
         ZSORT GET,REC=(R9)       GET SORTED AIX REC FROM ZSORT
         CHI   R15,4              EOF ?
         JE    EOFDTA             EXIT IF IT IS
         ST    R9,LOKEYPTR        SAVE POINTER TO AIX KEY
         JAS   R14,DOLOWKEY       SET LOW KEY IN CTRLOKEY@
         J     DODTA              EXIT
*
QSAMGET  DS    0H
         TM    VXXXFLG1,VCLRRRDS  RRDS FIXED ?
         JNO   DOESKS             EXIT IF NOT
* RRDS FIXED PROCESSING
* GET THE RECORD
* BUILD AS MANY EMPTY RPTR'S/NULL RECORDS AS NEEDED
* MOVE THE RECORD INTO THE DATA BLOCK
         L     R5,VXXXLMAX        R5=MAXIMUM RECORD LENGTH
         AHI   R5,10              +10 FOR RRN
         ST    R5,INFILEQ+DCBBLKSIF-IHADCB SAVE FIXED BLKSIZE
         ST    R5,INFILEQ+DCBLRECLF-IHADCB SAVE FIXED LRECL
RRNEMTST DS    0H
         CLI   RRDSFLAG,X'FF'     HAS RRDS RECORD BEEN WRITTEN ?
         MVI   RRDSFLAG,0         RESET FLAG
         JE    RRNGETRC           EXIT IF IT WAS
         CGHSI RRDSEMTY,0         ANY MORE EMPTIES NEEDED ?
         JNE   RRNEMPTY           EXIT IF THERE ARE
* NO MORE EMPTIES
* MOVE RECORD INTO THE DATA BLOCK
         LR    R8,R9              R8=BLOCK ADDRESS
         L     R2,VSAMINBF        R2=RRDS RECORD BLOCK
         AHI   R2,10              POINT PAST RRN
         L     R3,VXXXLMAX        R3=LENGTH TO MOVE
         LG    R9,TOTRCSZD        R9=TOTAL DATA RECORD LENGTHS
         AGFR  R9,R3              +THIS ONE
         STG   R9,TOTRCSZD        SAVE IT
         LR    R9,R3              R9=LENGTH TO MOVE
         MVCL  R8,R2              MOVE RECORD
         MVI   RRDSFLAG,X'FF'     SET RRDS WRITTEN FLAG
         J     DODTA              EXIT
*
RRNGETRC DS    0H
         L     R5,VSAMINBF        R5=RECORD BLOCK
         GET   INFILEQ,(R5)       GET RECORD
         MVI   WORK1,C'0'         MOVE RRN
         MVC   WORK1+1(10),0(R5)           AS 0NNNNNNNNNN
         ZAP   WORK7,CNSTP000     INITIALISE PACKED RRN
         PACK  WORK7+10(6),WORK1(11) PACK RRN
         CP    WORK7,CNSTP4G      > 4G ?
         JH    BADSLOT            ERROR IF IT IS
         CVBG  R5,WORK7           R5=RRN (64-BIT)
         CG    R5,RRDSSLOT        GOOD SEQUENCE ?
         JNH   BADRRNSQ           EXIT IF NOT
         LGR   R0,R5              R0=NEXT RRN
         SG    R5,RRDSSLOT        CALC NO. OF
         AGHI  R5,-1                          EMPTY SLOTS NEEDED
         STG   R5,RRDSEMTY        SAVE NO. OF EMPTY SLOTS NEEDED
         STG   R0,RRDSSLOT        SAVE NEXT RRN
         LGR   R0,R5              R0=NO. OF EMPTY SLOTS
         A     R0,RRCOUNT         BUMP COUNT
         ST    R0,RRCOUNT         SAVE NO. OF EMPTY SLOTS
         J     RRNEMTST           LOOP
*
RRNEMPTY DS    0H
* IT'S AN EMPTY SLOT, NO RECORD WRITTEN, SET RPTR
         MVI   RPTRFLGS,RPTR_MTY  SET INACTIVE RECORD
         AGSI  RRDSEMTY,-1        DECREMENT EMPTIES NEEDED
         J     DODTA              EXIT
*
DOESKS   DS    0H
         GET   INFILEQ,(R9)       GET QSAM INPUT RECORD INTO DATA BLOCK
         LG    R1,TOTRCSZD        R1=TOTAL DATA RECORD LENGTHS
         AGF   R1,VXXXLMAX        +THIS ONE
         STG   R1,TOTRCSZD        SAVE IT
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JNO   DODTA              EXIT IF NOT
* KSDS
         LR    R0,R9              R0=RECORD POINTER
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   LOKEYFX2           EXIT IF NOT
* KSDS VARIABLE
         AHI   R0,4               MISS RDW
LOKEYFX2 DS    0H
         L     R5,VSAMPRFX        R5=DATA PREFIX BLOCK ADDRESS
         AHI   R5,BHDRLENG        R5=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R5
         A     R0,PFXKYOFF        +KEY OFFSET
         DROP  R5
         ST    R0,LOKEYPTR        SAVE POINTER TO AIX KEY
         JAS   R14,DOLOWKEY       SET LOW KEY IN CTRLOKEY@
DODTA    DS    0H
         ASI   RDCOUNT,1          COUNT DATA RECORDS PROCESSED
* BHDR#REC
         IC    R1,BHDR#REC        R1=NO. OF RECORDS
         AHI   R1,1               +1
         STC   R1,BHDR#REC        SAVE NO. OF RECORDS
* FOR VARIABLE OR SPANNED, CONTINUE FILLING DATA BLOCK
* FOR FIXED, WE TEST HERE FOR SPACE TO ADD ANOTHER RECORD
         TM    VXXXFLG1,VCLRVREC+VCLRSPAN VARIABLE OR SPANNED ?
         JNZ   DATALOOP           LOOP IF IT IS
* FIXED NON-SPANNED
         L     R5,BHDRFREE        R5=TOTAL FREESPACE
         L     R7,VXXXLMAX        R7=RECORD LENGTH
         AHI   R7,RPTRLENG*2      R7=RECORD LENGTH+RPTR+RPTREND
         SR    R5,R7              R5=FREESPACE AFTER NEXT RECORD
         LTR   R5,R5              ENOUGH SPACE FOR ANOTHER FIXED REC ?
         JNM   DATALOOP           LOOP IF THERE IS
         AHI   R6,RPTRLENG        R6=NEXT RPTR POINTER
DODTAWRT DS    0H
         MVI   0(R6),RPTR_END     SET
         MVHI  1(R6),-1               ENDING RPTR
         ASI   BHDRFREE,-RPTRLENG SET TOTAL FREESPACE
         ASI   BHDRFRE@,RPTRLENG  SET NEW FREESPACE OFFSET
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         JAS   R14,BUILDFTR       BUILD DATA FTR BLOCK
         JAS   R14,DATAWRIT       UPDATE PREV/WRITE NEW DATA BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
* PREPARE FOR NEXT DATA/SEGMENT BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
         L     R1,VSAMDATA        R1=DATA BLOCK ADDRESS
         J     DATACRET           LOOP
*
EOFDTA   DS    0H
* END-OF-FILE INVOKED
         MVI   EOFFLAG,X'FF'      MARK EOF HAS OCCURRED
* RE-ESTABLISH RPTR POINTER AND SET RPTR_END
         L     R4,VSAMDATA        R4=DATA BLOCK ADDRESS
         SR    R6,R6              CLEAR R6
         AHIK  R6,R4,BHDRLENG     R6=DATA RPTR POINTER
         LLC   R5,BHDR#REC        R5=NO. OF RECORDS
         MHI   R5,RPTRLENG        *RPTR'S
         AR    R6,R5              R6=ADDRESS OF RPTREND
         MVI   0(R6),RPTR_END     SET
         MVHI  1(R6),-1               ENDING RPTR
         DROP  R6                 DROP ZVSAMRPT BASE
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    EOFVAR             EXIT IF IT IS
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JO    EOFVAR             EXIT IF IT IS
* ADJUST FIXED NON-SPANNED FREESPACE
* NEXT RPTR AND RECORD HAVE BEEN CREATED AND FREESPACE ADJUSTED
* WE MUST BACK OFF THESE
         L     R5,BHDRFREE        R5=TOTAL FREESPACE
         A     R5,VXXXLMAX        +RECORD LENGTH
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         JAS   R14,BUILDFTR       BUILD DATA FTR BLOCK
         J     EOFPROC            EXIT
*
EOFVAR   DS    0H
* ADJUST VARIABLE OR SPANNED
         ASI   BHDRFREE,-RPTRLENG SET TOTAL FREESPACE
         ASI   BHDRFRE@,RPTRLENG  SET NEW FREESPACE OFFSET
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         JAS   R14,BUILDFTR       BUILD DATA FTR BLOCK
EOFPROC  DS    0H
* END-OF-FILE PROCESSING
         MVI   EOFFLAG,0          DON'T WRITE SPACEMAP BLOCK
* 1) DATA BLOCK
         JAS   R14,DATAWRIT       UPDATE PREV/WRITE NEW DATA BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
* 2) SPACEMAP BLOCK, NO BITS JUST WRITE
         MVI   EOFFLAG,X'FF'      SET EOF TO WRITE SPACEMAP BLOCK
         LLIHF R0,C'DDDD'         FLAG IT AS DATA
         L     R0,TRUDBKSZ        R0=(ADJUSTED) DATA BLKSIZE
         JAS   R14,SPACEMAP       WRITE SPACEMAP BLOCK
* 3) UPDATE AND REWRITE THE DATA PREFIX BLOCK
         L     R8,VSAMPRFX        R8=DATA PREFIX BLOCK ADDRESS
         AHI   R8,BHDRLENG        R8=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R8
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
* PFXBLKSZ
         MVC   PFXBLKSZ,TRUDBKSZ  SET DATA BLOCKSIZE
* PFXHXLRA
         MVC   PFXHXLRA,DTIXXLRA  SET XLRA OF HIGHEST ALLOC DATA BLOCK
* PFXMAPOF
         L     R1,SPCEHIGH        R1=HIGHEST SPACEMAP ADDRESS
         S     R1,VSAMSPCE        -BLOCK START=OFFSET TO BLOCK
         ST    R1,PFXMAPOF        SAVE SPACEMAP OFFSET
* CTRAVGRL -- AVERAGE DATA RECORD LENGTH EXCLUDING VARIABLE EMPTIES
         SGR   R0,R0              PREPARE FOR DIVIDE
         LG    R1,TOTRCSZD        R1=TOTAL DATA RECORD LENGTHS
         LGF   R2,RDCOUNT         R2=DATA RECORD COUNT
         SGF   R2,RRCOUNT         -EMPTIES=ACTIVES
         JZ    EOFNORR            EXIT IF NONE
         DLGR  R0,R2              /RECORD COUNT
         ST    R1,CTRAVGRL        SET CTRAVGRL
EOFNORR  DS    0H
* CTRAVSPAC -- TOTAL DATA FREESPACE
         MVC   CTRAVSPAC,TOTFREED SET CTRAVSPAC
* CTRSDTASZ....DATASET SIZE AS WTO'D
         LGF   R1,DBCOUNT         R1=NO. OF DATA BLOCKS
         AGF   R1,SGCOUNT         + NO. OF SEGMENT BLOCKS
         AGF   R1,SMCOUNT         + NO. OF SPACEMAP BLOCKS=TOTAL BLOCKS
         M     R0,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         SLLG  R0,R0,32           FORM 64-BIT
         AGFR  R0,R1                          PRODUCT
         AGHI  R0,4096            + PREFIX BLKSIZE
         STG   R0,CTRSDTASZ       SET CTRSDTASZ
         DROP  R8
* REWRITE DATA PREFIX BLOCK
         POINT DTAINOUT,RBA==XL8'00' POINT TO DATA PREFIX BLOCK
         LHI   R5,4096            R5=4K FOR PREFIX BLOCK
         ST    R5,DTAINOUT+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R5,DTAINOUT+DCBLRECLF-IHADCB SAVE LRECL
         L     R5,VSAMPRFX        R5=DATA PREFIX BLOCK ADDRESS
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,DTAINOUT,(R5) REWRITE DATA PREFIX BLOCK
         CHECK (R1)               CHECK
*******************
* WTO DATA COUNTS *
*******************
* WTO DATA BLOCK COUNT
         L     R1,DBCOUNT         R1=DATA BLOCK COUNT
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    DBLOCKS,WORK1+4    EDIT NO. OF DATA BLOCKS
         WTO   MF=(E,WTODBLOK)    SHOW IT
* WTO SEGMENT BLOCK COUNT IF NOT ZERO
         ICM   R1,15,SGCOUNT      R1=SEGMENT BLOCK COUNT
         JZ    NOSEGCNT           EXIT IF ZERO
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    SGBLOCKS,WORK1+4   EDIT NO. OF SEGMENT BLOCKS
         WTO   MF=(E,WTOSGBLK)    SHOW IT
NOSEGCNT DS    0H
* WTO ELIX BLOCK COUNT IF NOT ZERO
         ICM   R1,15,EXCOUNT      R1=ELIX BLOCK COUNT
         JZ    NOEXLCNT           EXIT IF ZERO
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    EXBLOCKS,WORK1+4   EDIT NO. OF ELIX BLOCKS
         WTO   MF=(E,WTOEXBLK)    SHOW IT
NOEXLCNT DS    0H
* WTO DATA SPACEMAP BLOCK COUNT
         L     R1,SMCOUNT         R1=DATA SPACEMAP BLOCK COUNT
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    DSBLOCKS,WORK1+4   EDIT NO. OF DATA SPACEMAP BLOCKS
         WTO   MF=(E,WTODSBLK)    SHOW IT
* CALC AND WTO DATA FILE SIZE
         L     R2,DBCOUNT         R2=NO. OF DATA BLOCKS
         A     R2,SGCOUNT         + NO. OF SEGMENT BLOCKS
         A     R2,SMCOUNT         + NO. OF SPACEMAP BLOCKS=TOTAL BLOCKS
         MS    R2,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         AHI   R2,4096            + PREFIX BLKSIZE
         CVD   R2,WORK1           CONVERT TO DECIMAL
         ED    DTASIZE,WORK1+2    EDIT DATA FILE SIZE
         WTO   MF=(E,WTODTSIZ)    SHOW IT
* WTO ACTIVE RRDS SLOT COUNT IF NOT ZERO AND NOT AIX
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JNO   NORRCNT            EXIT IF NOT
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    NORRCNT            EXIT IF IT IS
         L     R2,RDCOUNT         R2=TOTAL DATA RECORDS
         S     R2,RRCOUNT         -EMPTIES=ACTIVES
         JZ    NOACCNT            EXIT IF NONE
         CVD   R2,WORK1           CONVERT TO DECIMAL
         ED    ATOTREC,WORK1+4    EDIT NO. OF ACTIVE SLOTS
         WTO   MF=(E,WTOACTOT)    SHOW IT
NOACCNT  DS    0H
* WTO EMPTY RRDS SLOT COUNT IF NOT ZERO
         ICM   R2,15,RRCOUNT      R2=TOTAL EMPTY RRDS SLOT COUNT
         JZ    NORRCNT            EXIT IF NONE
         CVD   R2,WORK1           CONVERT TO DECIMAL
         ED    RTOTREC,WORK1+4    EDIT NO. OF EMPTY SLOTS
         WTO   MF=(E,WTORTOT)     SHOW IT
NORRCNT  DS    0H
* WTO RECORD COUNT
         L     R2,RDCOUNT         R2=TOTAL DATA RECORDS
         CVD   R2,WORK1           CONVERT TO DECIMAL
         ED    DTOTREC,WORK1+4    EDIT NO. OF RECORDS
         WTO   MF=(E,WTOTOT)      SHOW IT
* WTO MAXIMUM VARIABLE RECORD SIZE
         ICM   R2,15,MAXVARSZ     R2=MAXIMUM VARIABLE RECORD SIZE
         JZ    NOMAXVAR           EXIT IF NONE
         CVD   R2,WORK1           CONVERT TO DECIMAL
         ED    MAXVAR,WORK1+2     EDIT MAXIMUM VARIABLE RECORD SIZE
         WTO   MF=(E,WTOMAXVR)    SHOW IT
NOMAXVAR DS    0H
         CLOSE DTAINOUT           CLOSE VSAM OUTPUT FILE
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    DOIDX              EXIT IF IT IS
         CLOSE INFILEQ            CLOSE QSAM INPUT FILE
DOIDX    DS    0H
         MVI   EOFFLAG,0          RESET EOF MARKER
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   TESTVCLR           EXIT IF NOT
* FOR AIX INDEX BUILD, THE AIX KEY IS AT OFFSET ZERO
         MVHI  VXXXKOFF,0         SET OFFSET TO ZERO
         J     BUILDIDX           EXIT
*
TESTVCLR DS    0H
* .IDX WILL BE BUILT FOR ALL FILE TYPES
*    KSDS: KEY,XLRA
*    ESDS: XRBA,XLRA (DATA AS CONTINUOUS STRING OF BYTES WITH RLF)
*    RRDS: RRN(8),XLRA
         TM    VXXXFLG1,VCLRLDS   LDS ?
         JO    PROGEND            EXIT IF IT IS
BUILDIDX DS    0H
********************
* BUILD INDEX FILE *
********************
         MVGHI SPCEADJ,0          RESET SPACEMAP ADJUST FACTOR
* OPEN INPUT VSAM DTA
         OPEN  (DTAINOUT,(UPDATE)) OPEN VSAM DATA INPUT DCB
         LTR   R15,R15            OK ?
         JNZ   BADOPENI           EXIT IF NOT
* GET DATA PREFIX BLOCK FOR FIRST DATA BLOCK POINTER
         POINT DTAINOUT,RBA==XL8'00' POINT TO DATA PREFIX BLOCK
         LHI   R2,4096            R2=4K FOR PREFIX BLOCK
         ST    R2,DTAINOUT+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAINOUT+DCBLRECLF-IHADCB SAVE LRECL
         MVC   DTAINOUT+DCBREC-IHADCB(4),VSAMPRFX SAVE DTA PFX BLK ADDR
         JAS   R14,READDTIO       READ DATA PREFIX BLOCK
         L     R2,TRUDBKSZ        R2=(ADJUSTED) DATA BLKSIZE
         ST    R2,DTAINOUT+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAINOUT+DCBLRECLF-IHADCB SAVE LRECL
         L     R8,VSAMPRFX        R8=DATA PREFIX BLOCK ADDRESS
         AHI   R8,BHDRLENG        R8=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R8
         LG    R1,PFXBDATA        R1=XLRA OF FIRST DATA BLOCK
         DROP  R8
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R1,4096            + PREFIX SIZE
         STG   R1,WORK3           SAVE IT
         MVHI  SMCOUNT,0          CLEAR SPACEMAP BLOCK COUNT
         MVGHI DTIXXLRA,0         RESET INDEX XLRA TRACKER
         L     R1,VSAMPRFX        R2=INDEX PREFIX BLOCK ADDRESS
* CLEAR INDEX PREFIX BLOCK
         LR    R4,R1              R4=INDEX PREFIX BLOCK ADDRESS
         LHI   R5,4096            LENGTH TO CLEAR
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR INDEX PREFIX BLOCK
         LR    R4,R1              R4=RESTORE INDEX PREFIX BLOCK ADDR
* OPEN INOUT VSAM INDEX
         OPEN  (IDXINOUT,(UPDATE)) OPEN INOUT VSAM INDEX
         LTR   R15,R15            OK ?
         JNZ   BADOPENX           EXIT IF NOT
* SHOW OUTPUT IDX FILE OPENED: PATH
         MVC   OPENMSG,WTOOUTIX   MOVE 'INPUT OPENED' MSG
         LA    R1,VSAMIDXO        R1=VSAM OUTPUT IDX ADDRESS
         JAS   R14,OPENWTO        WTO OPEN FILE
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* INITIALISE INDEX LEVEL 0 BLOCK
         USING ZVSAMHDR,R4
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_PFX  SET PREFIX BLOCK
* BUILD INDEX PREFIX BLOCK
         AHIK  R5,R4,PFXLENG+BHDRLENG+CTRLENG R5=TRACKER FOR
*                                                         VARIABLE DATA
         LA    R9,PFXLENG+BHDRLENG R9=OFFSET OF ZVSAMCTR
* CTREYE
         IILF  R0,CTRZCTR         INSERT EYECATCHER
         ST    R0,CTREYE          SAVE IT
* CTRLOKEY@
         MVHHI CTRLOKEY@,-1       SET CTRLOKEY@ TO FOXES
         AHI   R9,CTRLENG         R9=TRACKER AS OFFSET
* PFXEYE
         IILF  R1,PFXZPFX         INSERT EYECATCHER
         ST    R1,PFXEYE          SAVE IT
* ADD DATA VOL/NAME/PATH FOR INDEX BLOCK
* PFXDVOL@
         MVHHI PFXDVOL@,-1        SET TO FOXES
* PFXDNAM@
         JAS   R14,DODNAM         DATA FILE.SFX INT0 PREFIX BLOCK
* PFXDPAT@
         JAS   R14,DODPAT         DATA PATH INT0 PREFIX BLOCK
* ADD INDEX VOL/NAME/PATH FOR INDEX BLOCK
* PFXXVOL@
         MVHHI PFXXVOL@,-1        SET TO FOXES
* PFXXNAM@
         JAS   R14,DOXNAM         INDEX FILE.SFX INT0 PREFIX BLOCK
* PFXXPAT@
         JAS   R14,DOXPAT         INDEX PATH INT0 PREFIX BLOCK
* SET THESE CONSECUTIVE FIELDS TO FOXES
*    PFXHXLRA, PFXBMAP, PFXEMAP, PFXMAPNW, PFXBDATA, PFXEDATA
*    PFXBSEGM, PFXESEGM, PFXROOT, PFXBLVLn/ELVLn(32)
         LR    R1,R4              SAVE HEADER BASE
         LR    R0,R9              SAVE TRACKER OFFSET
         LA    R4,PFXHXLRA        R4=BLOCK ADDRESS
         LA    R5,(9*8)+(32*8)    R5=LENGTH TO SET
         LR    R8,R4              AREA TO SET
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'FF'        SET FOXES TO AREA
         LR    R9,R0              RESTORE TRACKER OFFSET
         LR    R4,R1              RESTORE HEADER BASE
* PFXDTSKC, PFXIXSKC, PFXDTSKU, PFXIXSKU, PFXDTMAP, CTRSTMST
         MVC   PFXDTSKC,STCK      MOVE TO PFXDTSKC
         MVC   PFXIXSKC,STCK      MOVE TO PFXIXSKC
         MVC   PFXDTSKU,STCK      MOVE TO PFXDTSKU
         MVC   PFXIXSKU,STCK      MOVE TO PFXIXSKU
         MVC   PFXDTMAP,STCK      MOVE TO PFXDTMAP
         MVC   CTRSTMST,STCK      MOVE TO CTRSTMST
* PFXFRSPC
         MVC   PFXFRSPC,VXXXIFS   MOVE INDEX FREESPACE %
* PFXFRBLK
         MVC   PFXFRBLK,VXXXINB   MOVE INDEX FREEBLOCK NUMBER
* PFXFRINT
         MVC   PFXFRINT,VXXXIFB   MOVE INDEX FREEBLOCK INTERVAL
* PFXFFLGS
         OI    PFXFFLGS,PFX_KSDS+PFX_INDX SET FLAGS
* PFXRFLGS
         OI    PFXRFLGS,PFX_RFIX  SET FIXED
         LHI   R5,8+8             ASSUME ESDS/RRDS (XRBA/RRN+XLRA)
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    IDXAIX1            EXIT IF IT IS
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JNO   IDXNKSD1           EXIT IF NOT
IDXAIX1  DS    0H
* KSDS/AIX
* PFXRCLEN
*    KSDS: KEYLENGTH+XLRA
*    ESDS: XRBA+XLRA
*    RRDS: RRN +XLRA
         L     R5,VXXXKLEN        R5=KEYLENGTH
         AHI   R5,8               +8 FOR XLRA
IDXNKSD1 DS    0H
         ST    R5,PFXRCLEN        SAVE RECORD LENGTH
* PFXKYLEN
         MVC   PFXKYLEN,VXXXKLEN  MOVE KEY LENGTH
* PFXKYOFF
         MVC   PFXKYOFF,VXXXKOFF  MOVE KEY OFFSET
* BHDRFRE@
         ST    R9,BHDRFRE@        SAVE FREESPACE OFFSET
* BHDRFREE
         LHI   R5,4096            R5=PREFIX BLOCKSIZE
         AHI   R5,-BFTRLENG       -FTR
         SR    R5,R9              -TOTAL PREFIX LENGTH
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         LHI   R5,4096            R5=PREFIX BLOCKSIZE
         JAS   R14,BUILDFTR       BUILD INDEX PREFIX FTR BLOCK
* WRITE INDEX PREFIX BLOCK
         LHI   R2,4096            R2=4K FOR INDEX PREFIX BLOCK
         ST    R2,IDXINOUT+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,IDXINOUT+DCBLRECLF-IHADCB SAVE LRECL
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,IDXINOUT,(R4) WRITE INDEX PREFIX BLOCK
         CHECK (R1)               CHECK
         DROP  R10                DROP 2ND BASE
         MVC   TRUIBKSZ,VXXXIBS   SET DEFAULT INDEX BLKSIZE
* WTO INDEX BLKSIZE
         DROP  R4                 DROP ZVSAMHDR BASE
         L     R4,VXXXIBS         R4=INDEX BLKSIZE
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    IBLKSIZE,WORK1+4   EDIT INDEX BLKSIZE
         WTO   MF=(E,WTOIBKSZ)    SHOW IT
* CALCULATE MAXIMUM INDEX RECORDS/BLOCK
         SR    R4,R4              CLEAR R4
         L     R5,VXXXIBS         R5=INDEX BLKSIZE
         AHI   R5,-(BHDRLENG+BFTRLENG+RPTRLENG) -(HDR+FTR+RPTREND)
         L     R6,VXXXKLEN        R6=KEYLENGTH
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    IDXKSDS1           EXIT IF IT IS
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JO    IDXKSDS1           EXIT IF IT IS
* ESDS/RRDS
         LHI   R6,8               R6=LENGTH OF XRBA/RRN
IDXKSDS1 DS    0H
         AHI   R6,RPTRLENG+8      +RPTR+XLRA
         DR    R4,R6              / KEYLEN+RPTR+XLRA
         LTR   R5,R5              CAN WE FIT A RECORD ?
         JZ    BADFITX            ERROR IF NOT
         ST    R5,WORK6           SAVE IT FOR WTO AND ADJUST CALCS
         CHI   R5,255             > 255 RECORDS ?
         JNH   IDXMAXOK           EXIT IF NOT
         MVI   MAXIDX,255         SET MAXIMUM 255
         J     IDXMAXWT           EXIT
*
IDXMAXOK DS    0H
         STC   R5,MAXIDX          SAVE IT FOR BLOCK FULL TEST
IDXMAXWT DS    0H
         LR    R0,R5              SAVE IT
* WTO MAXIMUM INDEX RECORDS/BLOCK
         CVD   R5,WORK1           CONVERT TO DECIMAL
         ED    IMAXRECS,WORK1+4   EDIT MAXIMUM INDEX RECORDS/BLOCK
         WTO   MF=(E,WTOIMXRC)    SHOW IT
* WTO INDEX FREESPACE %
         LLC   R4,VXXXIFS         R4=INDEX FREESPACE %
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    IFSPERCT,WORK1+6   EDIT INDEX FREESPACE %
         WTO   MF=(E,WTOIFSPC)    SHOW IT
* WTO INDEX FREEBLOCKS IF NOT ZERO
         CHHSI VXXXINB,0          ANY DATA FREEBLOCKS ?
         JE    NOIFB              EXIT IF NONE
         LH    R4,VXXXINB         R4=INDEX FREEBLOCK NUMBER
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    IFREENUM,WORK1+5   EDIT INDEX FREEBLOCK NUMBER
         LH    R4,VXXXIFB         R4=INDEX FREEBLOCK AFTER EVERY
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    IFREEBLK,WORK1+5   EDIT INDEX FREEBLOCK NUMBER
         WTO   MF=(E,WTOIFBLK)    SHOW IT
NOIFB    DS    0H
* CALC FREESPACE
         SR    R4,R4              CLEAR R4
         LLC   R5,VXXXIFS         R5=INDEX FREESPACE %
         MS    R5,VXXXIBS         * INDEX BLKSIZE
         D     R4,CNST0100        / 100
* CALC RECORDS IN FREESPACE
         SR    R4,R4              CLEAR R4
         DR    R4,R6              / KEYLEN OR XRBA/RRN +RPTR+XLRA
* CALC RECORDS IN USED SPACE, MINIMUM IS 1, MAXIMUM IS 255
         SR    R0,R5              R0=RECS IN USED SPACE
         CHI   R0,1               ENOUGH ROOM FOR 1 RECORD ?
         JNL   ISPACMIN           EXIT IF THERE IS
         LHI   R0,1               MAKE MINIMUM 1 RECORD
         J     ISPACMAX           EXIT
*
ISPACMIN DS    0H
         CHI   R0,255             MAXIMUM 255+ ?
         JNH   ISPACMAX           EXIT IF NOT
         LHI   R0,255             MAKE MAXIMUM 255
ISPACMAX DS    0H
         STC   R0,RECIDX          SAVE INDEX RECORDS
         TM    VXXXFLG2,VCLRIADJ  INDEXADJUST=YES ?
         JNO   NOIADJ             EXIT IF NONE
* ADJUST INDEX BLKSIZE
         SR    R4,R4              CLEAR R4
         L     R5,VXXXIBS         R5=INDEX BLKSIZE
         AHI   R5,-(BHDRLENG+BFTRLENG+RPTRLENG) -(HDR+FTR+RPTREND)
         MSR   R0,R6              * (KEYLEN OR XRBA/RRN +RPTR+XLRA)
         SR    R5,R0              R5=FREESPACE
         DR    R4,R6              / (KEYLEN OR XRBA/RRN +RPTR+XLRA)
         LNR   R4,R4              PREPARE FOR SUBTRACT
         A     R4,VXXXIBS         +DEFAULT INDEX BLKSIZE
* ADDITIONAL REDUCTION IF TOTAL RECORDS IN BLOCK > 255
         L     R0,WORK6           R0=MAX RECORDS
         CFI   R0,255             > 255 RECS ?
         JNH   IDXNOMAX           EXIT IF NOT
* BLKSIZE WAY TOO BIG
         AHI   R0,-255            -255
         MSR   R0,R6              * (RECORD LENGTH+RPTR)
         SR    R4,R0              R4=FURTHER REDUCED BLKSIZE
IDXNOMAX DS    0H
         ST    R4,TRUIBKSZ        SAVE ADJUSTED INDEX BLKSIZE
* WTO ADJUSTED INDEX BLKSIZE IF WE HAVE DONE
         CVD   R4,WORK1           CONVERT TO DECIMAL
         ED    IBAJSIZE,WORK1+4   EDIT ADJUSTED INDEX BLKSIZE
         WTO   MF=(E,WTOIBKAJ)    SHOW IT
NOIADJ   DS    0H
* SET UP ALL DCBS
         L     R2,TRUIBKSZ        R2=(ADJUSTED) INDEX BLKSIZE
         ST    R2,IDXINOUT+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,IDXINOUT+DCBLRECLF-IHADCB SAVE LRECL
* WTO LOADED INDEX RECORDS/BLOCK
         LLC   R0,RECIDX          R0=INDEX RECORDS
         CVD   R0,WORK1           CONVERT TO DECIMAL
         ED    ILODRECS,WORK1+4   EDIT LOADED INDEX RECORDS/BLOCK
         WTO   MF=(E,WTOILDRC)    SHOW IT
*****************************
* INDEX SPACEMAP PROCESSING *
*****************************
* GETMAIN FOR INDEX SPACEMAP BLOCK (MIGHT BE DIFFERENT SIZE FROM DATA)
         L     R5,TRUIBKSZ        R5=(ADJUSTED) INDEX BLKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMSPCE        SAVE SPACEMAP BLOCK ADDRESS
         MVHI  SPCEHIGH,0         CLEAR HIGHEST SPACEMAP ADDRESS
* CLEAR INDEX SPACEMAP BLOCK
         LR    R4,R1              R4=INDEX SPACEMAP BLOCK ADDRESS
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR INDEX SPACEMAP BLOCK
         LR    R4,R1              R4=RESTORE SPACEMAP BLOCK ADDRESS
         USING ZVSAMHDR,R4
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
* INITIALISE INDEX SPACEMAP BLOCK
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_MAP  SET SPACEMAP BLOCK
         L     R5,TRUIBKSZ        R5=(ADJUSTED) INDEX BLKSIZE
         JAS   R14,BUILDFTR       BUILD INDEX SPACEMAP FTR BLOCK
         AHI   R5,-(BFTRLENG+1)   ALLOW SPACE FOR THE SPACEMAP ITSELF
         AR    R5,R4              R5=ADDRESS OF FOOTER-1
         ST    R5,SPCEEND         SAVE END OF SPACEMAP ADDRESS
         L     R4,VSAMPRFX        R4=INDEX PREFIX BLOCK ADDRESS
* PFXBLVL0
         MVC   PFXBLVL0,DTIXXLRA  SET XLRA OF FIRST LEV 0 INDEX BLOCK
         MVC   WORK7(8),DTIXXLRA  SAVE XLRA OF FIRST LEV 0 INDEX BLOCK
*********************************
* CREATE INDEX BLOCKS (LEVEL 0) *
*********************************
* GETMAIN FOR ANY PREVIOUS INDEX BLOCK
* CANNOT USE PREVIOUS DATA BLOCK AS INDEX BLOCK MAY BE BIGGER
         L     R5,TRUIBKSZ        R5=(ADJUSTED) INDEX BLKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMPREV        SAVE PREVIOUS BLOCK ADDRESS
* GETMAIN INDEX BLOCK
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMIDXN        SAVE INDEX BLOCK ADDRESS
         SR    R0,R0              CLEAR R0
         SR    R2,R2              CLEAR R2
         SR    R5,R5              CLEAR R5
         SR    R8,R8              CLEAR R8
         IIHF  R10,0              CLEAR R10 HIGH
         OI    IDXSTATE,IDXDBLOK  FAKE END OF DATA BLOCK
INDXCRET DS    0H
* NEW INDEX RECORD
         ST    R9,WORK1           SAVE DATA RPTR POINTER
* CLEAR INDEX BLOCK
         LR    R4,R1              R4=INDEX BLOCK ADDRESS
         L     R5,TRUIBKSZ        R5=LENGTH TO CLEAR
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR INDEX BLOCK
         LR    R4,R1              R4=RESTORE INDEX BLOCK ADDRESS
* INITIALISE INDEX BLOCK
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
         L     R9,WORK1           RESTORE DATA RPTR POINTER
         L     R6,VSAMDATA        RESTORE DATA BLOCK ADDRESS
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_IDX+BHDR_LEF SET INDEX AND LEAF BLOCK
* BHDRSELF
         MVC   BHDRSELF,DTIXXLRA  SET CURRENT INDEX XLRA
* BHDRPREV
         MVC   BHDRPREV,VSAMIDXX  SET PREVIOUS INDEX XLRA
* BHDRFRE@
         MVHI  BHDRFRE@,BHDRLENG  SET FREESPACE OFFSET
* BHDRFREE
         L     R5,TRUIBKSZ        R5=ADJUSTED INDEX BLKSIZE
         AHI   R5,-(BHDRLENG+BFTRLENG) -(HDR+FTR)
         ST    R5,BHDRFREE        SAVE TOTAL FREESPACE
         MVHHI SPCEDATA,X'0080'   BYTE FOR SHIFTING B'10' (ALLOCATED)
* PROCESS FREEBLOCKS IF REQUESTED
         CHHSI VXXXINB,0          ANY FREEBLOCKS REQUIRED ?
         JE    INDXPREP           EXIT AS NO FREEBLOCKS REQUIRED
* FREEBLOCKS REQUESTED
         CLC   IXINSERT+2(2),VXXXIFB REACHED NO. OF INDEX BLOCKS ?
         JNE   INDXPREP           EXIT IF NOT
* TREAT VXXXIFB=0 AS A SPECIAL CASE
* THIS WILL ONLY INSERT VXXXINB BLOCKS BEFORE THE FIRST BLOCK
         LH    R6,VXXXINB         R6=NO. OF EMPTY BLOCKS TO INSERT
         CHHSI VXXXIFB,0          VXXXIFB=0 ?
         JNE   INDXSPFB           EXIT IF NOT
         MVHHI VXXXINB,0          KILL ANY MORE FREEBLOCKS
INDXSPFB DS    0H
* ADJUST BHDRFRE@ AND BHDRFREE FOR RPTR_END
         L     R0,BHDRFRE@        R0=FREESPACE OFFSET
         ARK   R5,R4,R0           R5=OLD FREESPACE ADDRESS
         MVI   0(R5),RPTR_END     SET
         MVHI  1(R5),-1               ENDING RPTR
         AHI   R0,RPTRLENG        +RPTR
         ST    R0,BHDRFRE@        SAVE FREESPACE OFFSET
         ASI   BHDRFREE,-RPTRLENG SET TOTAL FREESPACE
         L     R5,TRUIBKSZ        R5=(ADJUSTED) INDEX BLKSIZE
         JAS   R14,BUILDFTR       BUILD FTR BLOCK
INDXFBLP DS    0H
* THESE ARE SEQUENTIAL, SO ENSURE BHDRPREV IS SET
         CGHSI DTIXXLRA,0         IS THERE A PREVIOUS INDEX BLOCK ?
         JE    INDXBLK0           EXIT IF NOT
         LG    R1,DTIXXLRA        R1=CURRENT INDEX XLRA
         AGHI  R1,-256            CALC PREVIOUS
         STG   R1,BHDRPREV        SAVE PREVIOUS
INDXBLK0 DS    0H
         JAS   R14,INDXWRIT       UPDATE PREV/WRITE NEW INDEX BLOCK
         MVC   SPCEBITS,SPCEDATA  SET SPACEMAP BITS
         LLIHF R0,C'IIII'         FLAG IT AS INDEX
         L     R0,TRUIBKSZ        R0=(ADJUSTED) INDEX BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
* PREPARE FOR NEXT DATA/SEGMENT BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT INDEX XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT INDEX XLRA
         L     R1,VSAMIDXN        R1=INDEX BLOCK ADDRESS
         JCT   R6,INDXFBLP        LOOP
*
         MVHI  IXINSERT,0         CLEAR INDEX COUNT FOR FREEBLOCKS
         MVI   IDXFLAG,X'FF'      SET FLAG TO BUILD ANOTHER LEVEL
         J     INDXCRET           EXIT
*
INDXPREP DS    0H
         TM    IDXSTATE,IDXDBLOK  END OF DATA BLOCK ?
         JNO   DTABLOOP           EXIT IF NOT
* BUILD THE INDEX BLOCKS
INDXLOOP DS    0H
* LOOP THROUGH DATA BLOCKS
*
* WORK3 TRACKS THE DATA BLOCK XLRA
*
* REG USAGE:
*    R2=POINTER TO NEXT INDEX RPTR
*    R4=ZVSAMHDR BASE OF INDEX BLOCK
*    R6=ZVSAMHDR BASE OF DATA BLOCK
*    R8=POINTER TO KEY IN DATA RECORD
*    R9=ZVSAMRPT BASE OF DATA RPTR'S
*    R10 HIGH=INDEX BLOCK FREESPACE
         POINT DTAINOUT,RBA=WORK3 POINT TO NEXT DATA BLOCK
         L     R6,VSAMDATA        R6=DATA BLOCK ADDRESS
DATABHDR USING ZVSAMHDR,R6
         MVGHI IDXXRBA,0          RESET BASE XRBA FOR ESDS
         ST    R6,DTAINOUT+DCBREC-IHADCB SAVE DATA BLOCK ADDRESS
         JAS   R14,READDTIO       READ DATA PREFIX BLOCK
         AHIK  R9,R6,BHDRLENG     R9=DATA RPTR POINTER
         MVHI  DATA#REC,X'01'     RESET DATA RECORD NUMBER
DATARPTR USING ZVSAMRPT,R9
* HANDLE EMPTY OR INSERTED FREEBLOCK
         CLI   DATARPTR.RPTRFLGS,RPTR_END END OF DATA RPTR'S ?
         JE    IDXSETSF           EXIT IF IT IS
DTABLOOP DS    0H
* LOOP WITHIN DATA BLOCK
         LFH   R10,BHDRFREE       R10 HIGH=TOTAL INDEX FREESPACE
         AIH   R10,-(8+RPTRLENG)  -XLRA-RPTR
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    IDXAIX2            EXIT IF IT IS
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JNO   IDXNKSD2           EXIT IF NOT
IDXAIX2  DS    0H
* KSDS/AIX
         L     R2,VXXXKLEN        R2=KEY LENGTH
         SHHLR R10,R10,R2         -KEY LENGTH
         J     IDXFSPAC           EXIT
*
WTODBLOK DC    AL2(WTODBNEN-*,0)
         DC    C'zREPRO DATA BLOCKS                '
DBLOCKS  DC    X'4020202020202120'
WTODBNEN EQU   *
*
WTOSGBLK DC    AL2(WTOSGBEN-*,0)
         DC    C'zREPRO SEGMENT BLOCKS             '
SGBLOCKS DC    X'4020202020202120'
WTOSGBEN EQU   *
*
WTOEXBLK DC    AL2(WTOEXBEN-*,0)
         DC    C'zREPRO ELIX BLOCKS                '
EXBLOCKS DC    X'4020202020202120'
WTOEXBEN EQU   *
*
WTODSBLK DC    AL2(WTODSBEN-*,0)
         DC    C'zREPRO DATA SPACEMAP BLOCKS       '
DSBLOCKS DC    X'4020202020202120'
WTODSBEN EQU   *
*
WTODTSIZ DC    AL2(WTODTZEN-*,0)
         DC    C'zREPRO DATA FILE SIZE         '
DTASIZE  DC    X'402020202020202020202120'
WTODTZEN EQU   *
*
WTOACTOT DC    AL2(WTOATTEN-*,0)
         DC    C'zREPRO TOTAL ACTIVE RRDS SLOTS    '
ATOTREC  DC    X'4020202020202020'
WTOATTEN EQU   *
*
WTORTOT  DC    AL2(WTORTTEN-*,0)
         DC    C'zREPRO TOTAL EMPTY RRDS SLOTS     '
RTOTREC  DC    X'4020202020202020'
WTORTTEN EQU   *
*
WTOTOT   DC    AL2(WTOTOTEN-*,0)
         DC    C'zREPRO TOTAL RECORDS              '
DTOTREC  DC    X'4020202020202120'
WTOTOTEN EQU   *
*
WTOMAXVR DC    AL2(WTOMXVEN-*,0)
         DC    C'zREPRO MAX VARIABLE RECSIZE   '
MAXVAR   DC    X'402020202020202020202120'
WTOMXVEN EQU   *
*
IDXNKSD2 DS    0H
* ESDS/RRDS
         AIH   R10,-8             -8 FOR XRBA/RRN
IDXFSPAC DS    0H
         STFH  R10,BHDRFREE       SAVE TOTAL FREESPACE
         L     R2,BHDRFRE@        R2=CURRENT FREESPACE OFFSET
         ASI   BHDRFRE@,RPTRLENG  SET NEW FREESPACE OFFSET
         A     R2,VSAMIDXN        R2=CURRENT INDEX RPTR ADDRESS
INDXRPTR USING ZVSAMRPT,R2
* CREATE INDEX RPTR
         MVI   INDXRPTR.RPTRFLGS,RPTR_ACT SET ACTIVE RECORD
* CALC RECORD OFFSET
         L     R5,BHDRFRE@        R5=CURRENT FREESPACE OFFSET
         AHHLR R5,R10,R5          R5=BYTE AFTER FREESPACE
         SRLG  R5,R5,32           SHIFT TO LOW
         ST    R5,INDXRPTR.RPTRREC@ SET RECORD OFFSET
         A     R5,VSAMIDXN        R5=INDEX RECORD POSITION
* CONSTRUCT INDEX RECORD
         L     R8,DATARPTR.RPTRREC@ R8=OFFSET TO RECORD
         AR    R8,R6              R8=RECORD ADDRESS
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    IDXAIX4            EXIT IF IT IS
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JO    IDXKSDS2           EXIT IF IT IS
* ESDS/RRDS
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JO    IDXRRDS1           EXIT IF IT IS
* ESDS
* XRBA IS XLRA*BLKSIZE + XRBA OFFSET OF RECORD WITHIN A BLOCK
* FOR VARIABLE, THE RLF IS INCLUDED
         LG    R1,DATABHDR.BHDRSELF R1=XLRA OF DATA BLOCK
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         LG    R0,IDXXRBA         R0=CURRENT XRBA
         AGR   R1,R0              + XRBA OFFSET
         STG   R1,0(R5)           SAVE XRBA FOR ESDS IDX
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    IDXVESDS           EXIT IF IT IS
* FIXED ESDS
         AGF   R0,VXXXLMAX        +FIXED RECORD LENGTH
         J     IDXSVRBA           EXIT
*
IDXVESDS DS    0H
* VARIABLE ESDS
         L     R1,0(R8)           R1=LENGTH FROM RLF
         TM    DATARPTR.RPTRFLGS,RPTR_SEG SEGMENT ?
         JNO   IDXNTSEG           EXIT IF NOT
* VARIABLE SPANNED ESDS
         L     R1,SPXLENG(R8)     R1=LENGTH FROM RLF (AFTER SPX)
IDXNTSEG DS    0H
         AGFR  R0,R1              +ACTUAL LENGTH OF VARIABLE RECORD
IDXSVRBA DS    0H
         STG   R0,IDXXRBA         SAVE NEXT XRBA
         J     IDXSTREC           EXIT
*
IDXRRDS1 DS    0H
* RRDS
         MVC   0(8,R5),IDXRRN     MOVE RRN FOR RRDS IDX
         AGSI  IDXRRN,1           NEXT SLOT NUMBER
IDXSTREC DS    0H
         LG    R0,DATABHDR.BHDRSELF R0=XLRA OF DATA BLOCK
         IC    R0,DATA#REC+3      INSERT RECORD NUMBER
         STG   R0,8(R5)           SAVE XLRA OF DATA BLOCK
         J     IDXDONE            EXIT
*
IDXKSDS2 DS    0H
* KSDS (NOT AIX)
* LOCATED A RECORD, EXTRACT THE KEY
         TM    DATARPTR.RPTRFLGS,RPTR_SEG SEGMENT ?
         JNO   IDXNSPAN           EXIT IF NOT
         JAS   R14,UNSPAN         RECONSTRUCT A SPANNED RECORD
IDXNSPAN DS    0H
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   IDXAIX4            EXIT IF NOT
* VARIABLE FORMAT IS RLF,DATA
         AHI   R8,4               R8=VARIABLE RECORD START
         A     R8,VXXXKOFF        R8=KEY START (ZERO FOR AIX)
         J     IDXAIX5            EXIT
*
IDXAIX4  DS    0H
* FIXED OR AIX
         A     R8,VXXXKOFF        R8=KEY START (ZERO FOR AIX)
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   IDXAIX5            EXIT IF NOT
* AIX
         TM    VXXXFLG1,VAIXUKEY  AIX UNIQUE ?
         JO    IDXAIX5            EXIT IF IT IS
* NON-UNIQUE AIX
         AHI   R8,4               R8=VARIABLE RECORD START
         TM    DATARPTR.RPTRFLGS,RPTR_SEG SEGMENT ?
         JNO   IDXAIX5            EXIT IF NOT
* NON-UNIQUE AIX SEGMENTED
         AHI   R8,SPXLENG         R8=SEGMENTED RECORD START
IDXAIX5  DS    0H
         L     R1,VXXXKLEN        R1=KEY LENGTH
         AHI   R1,-1              -1 FOR EXECUTE
         EXRL  R1,MOVEKEY         MOVE KEY
         LG    R0,DATABHDR.BHDRSELF R0=XLRA OF DATA BLOCK
         IC    R0,DATA#REC+3      INSERT RECORD NUMBER
         LA    R5,1(R1,R5)        BUMP AFTER KEY
         STG   R0,0(R5)           SAVE XLRA OF DATA BLOCK
         CLI   KEY1IND,X'FF'      FIRST KEY PROCESSED ?
         MVI   KEY1IND,0          RESET FIRST KEY INDICATOR
         JNE   NOTKEY1            EXIT IF NOT
* FIRST KEY PROCESSED
         EXRL  R1,MVNEXTKY        SAVE NEXT KEY
         J     IDXDONE            EXIT
*
NOTKEY1  DS    0H
         MVC   KEYPREV,KEYNEXT    MOVE PREV KEY
         EXRL  R1,MVNEXTKY        SAVE NEXT KEY
         EXRL  R1,COMPKEYS        GOOD SEQUENCE ?
         JL    IDXDONE            EXIT IF IT IS
* BAD KEY SEQUENCE
         LR    R2,R1              SAVE LENGTH-1
         WTO   MF=(E,WTOSEQ)      SHOW IT
         EXRL  R2,SETWTOFS        SET PREV KEY FOR WTO
         WTO   MF=(E,WTOBADKY)    SHOW PREVIOUS KEY
         EXRL  R2,SETWTONX        SET NEXT KEY FOR WTO
         WTO   MF=(E,WTOBADKY)    SHOW NEXT KEY
         J     BADRETN            EXIT
*
MOVEKEY  MVC   0(0,R5),0(R8)      MOVE KEY
MVNEXTKY MVC   KEYNEXT(0),0(R8)   MOVE NEXT KEY
COMPKEYS CLC   KEYPREV(0),KEYNEXT COMPARE KEYS
SETWTOFS MVC   WTOKEY(0),KEYPREV  SET PREV KEY FOR WTO
SETWTONX MVC   WTOKEY(0),KEYNEXT  SET NEXT KEY FOR WTO
*
IDXDONE  DS    0H
         AHI   R9,RPTRLENG        BUMP DATA RPTR POINTER
         ASI   DATA#REC,1         BUMP DATA RECORD NUMBER
* BHDR#REC
         IC    R0,BHDR#REC        R0=NO. OF RECORDS
         AHI   R0,1               +1
         STC   R0,BHDR#REC        SAVE NO. OF RECORDS
         L     R1,VSAMPRFX        R1=INDEX PREFIX BLOCK ADDRESS
         AHI   R1,BHDRLENG        R1=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R1
         LG    R0,TOTRCSZI        R0=TOTAL INDEX RECORD LENGTHS
         AGF   R0,PFXRCLEN        +THIS ONE
         DROP  R1
         STG   R0,TOTRCSZI        SAVE IT
         ASI   RICOUNT,1          COUNT INDEX RECORDS PROCESSED
IDXSETSF DS    0H
* SET INDEX STATUS FLAGS
         MVI   IDXSTATE,0         CLEAR INDEX STATUS FLAG
         CLC   BHDR#REC,RECIDX    REACHED LIMIT ?
         JNE   IDXNEXT1           EXIT IF NOT
         OI    IDXSTATE,IDXLIMIT  SET LIMIT FLAG
         CLC   BHDR#REC,MAXIDX    REACHED MAXIMUM LIMIT ?
         JNE   IDXNEXT1           EXIT IF NOT
         OI    IDXSTATE,IDXFULL   SET INDEX FULL FLAG
IDXNEXT1 DS    0H
         CLI   DATARPTR.RPTRFLGS,RPTR_END END OF DATA RPTR'S ?
         JNE   IDXNEXT2           EXIT IF NOT
* END OF DATA RPTR'S
         OI    IDXSTATE,IDXDBLOK  SET END OF DATA BLOCK FLAG
         CGHSI DATABHDR.BHDRNEXT,-1 ANY NEXT DATA BLOCK ?
         JNE   IDXNEXT2           EXIT IF THERE IS
         OI    IDXSTATE,IDXDEOF   SET END OF DATA FLAG
IDXNEXT2 DS    0H
* IDXSTATE BIT SETTINGS...
*    0000 NOTHING ENDED
*    1000 INDEX ENDED, NOT FULL
*    1100 INDEX ENDED AND FULL
*    0010 INDEX NOT ENDED, DATA BLOCK ENDED
*    1010 INDEX ENDED, NOT FULL AND DATA BLOCK ENDED
*    1110 INDEX ENDED AND FULL AND DATA BLOCK ENDED
*    0011 INDEX NOT ENDED AND DATA BLOCK EOF
*    1011 INDEX ENDED, NOT FULL AND DATA BLOCK EOF
*    1111 INDEX ENDED AND FULL AND DATA BLOCK EOF
* 0000 IF ALL BITS OFF, NOTHING HAS ENDED
         TM    IDXSTATE,IDXLIMIT+IDXFULL+IDXDBLOK+IDXDEOF ALL BITS OFF?
         JZ    DTABLOOP           LOOP THRU DATA BLOCK IF THEY ARE
         TM    IDXSTATE,IDXFULL   INDEX BLOCK FULL ?
         JNO   IDXNEXT3           EXIT IF NOT
* .1.. INDEX BLOCK FULL, SET CORRECT SPACEMAP BITS
         MVHHI SPCEDATA,X'00C0'   BYTE FOR SHIFTING B'11' (BLOCK FULL)
IDXNEXT3 DS    0H
         TM    IDXSTATE,IDXDEOF   END OF DATA FILE ?
         JO    IDXNEXT4           EXIT IF IT IS
         TM    IDXSTATE,IDXDBLOK  END OF DATA BLOCK ?
         JNO   IDXNEXT4           EXIT IF NOT
* ..1. END OF DATA BLOCK, PREPARE FOR ANOTHER DATA BLOCK
         LG    R0,DATABHDR.BHDRNEXT R0=XLRA OF NEXT DATA BLOCK
         DROP  DATABHDR
         SRLG  R0,R0,8            SHIFT OUT RECORD NUMBER
         MSGF  R0,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R0,4096            + PREFIX SIZE
         STG   R0,WORK3           SAVE IT
* 0.1. INDEX BLOCK NOT ENDED+END OF DATA BLOCK,
*      GET ANOTHER DATA BLOCK AND CONTINUE FILLING THE INDEX
         TM    IDXSTATE,IDXLIMIT  AND ROOM IN INDEX BLOCK ?
         JNO   INDXLOOP           LOOP WITH NEW DATA BLOCK IF THERE IS
IDXNEXT4 DS    0H
* 1.1. INDEX BLOCK ENDED+END OF DATA BLOCK,
*      WRITE INDEX BLOCK AND GET NEXT DATA BLOCK
* ..11 END OF DATA FILE,
*      WRITE INDEX BLOCK AND TERMINATE
* R2 CAN BE ZERO IF THERE ARE NO RECORDS IN THE DATA BLOCKS
         LTR   R2,R2              R2=0 ?
         JNZ   IDXPTROK           EXIT IF NOT
         L     R2,BHDRFRE@        R0=CURRENT FREESPACE OFFSET
         AHI   R2,-RPTRLENG       SET FAKE CURRENT RPTR
         A     R2,VSAMIDXN        R2=CURRENT INDEX RPTR ADDRESS
IDXPTROK DS    0H
         MVI   INDXRPTR.RPTRFLGS+RPTRLENG,RPTR_END SET
         MVHI  INDXRPTR.RPTRFLGS+RPTRLENG+1,-1         ENDING RPTR
         DROP  INDXRPTR
         ASI   BHDRFREE,-RPTRLENG SET TOTAL FREESPACE
         ASI   BHDRFRE@,RPTRLENG  SET NEW FREESPACE OFFSET
         L     R5,TRUIBKSZ        R5=(ADJUSTED) INDEX BLKSIZE
         JAS   R14,BUILDFTR       BUILD INDEX FTR BLOCK
* THERE IS MORE DATA
         JAS   R14,INDXWRIT       UPDATE PREV/WRITE NEW INDEX BLOCK
         MVC   SPCEBITS,SPCEDATA  SET SPACEMAP BITS
         LLIHF R0,C'IIII'         FLAG IT AS INDEX
         L     R0,TRUIBKSZ        R0=(ADJUSTED) INDEX BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
* INDEX BLOCK FULL CAN COINCIDE WITH END OF DATA BLOCK/FILE
         TM    IDXSTATE,IDXDEOF   END OF DATA FILE ?
         JO    ALLDONEX           EXIT IF IT IS
* PREPARE FOR NEXT INDEX BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT INDEX XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT INDEX XLRA
         L     R1,VSAMIDXN        R1=INDEX BLOCK ADDRESS
         MVI   IDXFLAG,X'FF'      SET FLAG TO BUILD ANOTHER LEVEL
         J     INDXCRET           LOOP
*
ALLDONEX DS    0H
* LEVEL 0 COMPLETE
* UPDATE THE INDEX PREFIX BLOCK
         L     R8,VSAMPRFX        R8=INDEX PREFIX BLOCK ADDRESS
         AHI   R8,BHDRLENG        R8=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R8
* PFXBLKSZ
         MVC   PFXBLKSZ,TRUIBKSZ  SET INDEX BLOCKSIZE
* PFXHXLRA
         MVC   PFXHXLRA,DTIXXLRA  SET XLRA OF HIGHEST ALLOC INDEX BLOCK
* PFXELVL0
         MVC   PFXELVL0,DTIXXLRA  SET XLRA OF LAST LEVEL 0 INDEX BLOCK
********************
* WTO INDEX COUNTS *
********************
* WTO INDEX BLOCK COUNT
         LLC   R1,BHDRXLVL        R1=INDEX LEVEL
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    ILEVEL,WORK1+6     EDIT INDEX LEVEL
         L     R1,IXCOUNT         R0=TOTAL NO. OF INDEX BLOCKS AT LEVEL
         CVD   R1,WORK1           CONVERT TO DECIMAL
         L     R0,TXCOUNT         R0=CURRENT NO. OF INDEX BLOCKS
         AR    R0,R1              +INDEX BLOCKS AT LEVEL
         ST    R0,TXCOUNT         SAVE NO. OF INDEX BLOCKS
         MVHI  IXCOUNT,0          CLEAR INDEX COUNT AT LEVEL
         ED    IBLOCKS,WORK1+4    EDIT NO. OF INDEX BLOCKS
         WTO   MF=(E,WTOIBLOK)    SHOW IT
         CLOSE DTAINOUT           CLOSE DATA FILE
         CLI   IDXFLAG,X'FF'      NEED ANOTHER LEVEL ?
         JNE   INDXEND            EXIT IF NONE
         MVI   IDXFLAG,0          RESET NEW LEVEL INDICATOR
         LG    R1,DTIXXLRA        R1=CURRENT INDEX XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT INDEX XLRA
***************************
* BUILD NEXT INDEX LEVELS *
***************************
* SET WORK7 TO INITIAL SOURCE START
         MVC   WORK7(8),PFXBLVL0  SET FIRST INDEX LEVEL 0 XLRA
         DROP  R8
* GETMAIN BLOCK FOR SOURCE INDEX BLOCK
         L     R5,TRUIBKSZ        R5=(ADJUSTED) INDEX BLKSIZE
         GETMAIN RU,LV=(R5)
         ST    R1,VSAMIDXP        SAVE SOURCE INDEX BLOCK ADDRESS
LEVLNEW  DS    0H
* CLOSE AND REOPEN INDEX
         CLOSE IDXINOUT           CLOSE INDEX FILE
         OPEN  (IDXINOUT,(UPDATE)) OPEN INOUT INDEX DCB
         IC    R5,IDXLEVEL        R5=CURRENT INDEX LEVEL
         AHI   R5,1               +1
         STC   R5,IDXLEVEL        SAVE NEXT INDEX LEVEL
         MVGHI VSAMIDXX,-1        RESET PREVIOUS XLRA
         L     R3,VSAMIDXP        R3=SOURCE INDEX BLOCK
         MVC   WORK8,DTIXXLRA     SAVE FIRST DEST XLRA FOR PFXBLVLn
* WORK7 HAS PFXBLVLn OF SOURCE LEVEL (TRACKER THROUGH SOURCE)
* WORK8 HAS PFXBLVLn OF DEST LEVEL
LEVLLOOP DS    0H
* BUILD INDEX LEVEL
* CLEAR DEST INDEX BLOCK
         L     R4,VSAMIDXN        R4=DEST INDEX BLOCK ADDRESS
         L     R5,TRUIBKSZ        R5=LENGTH TO CLEAR
         LR    R8,R4              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR DEST INDEX BLOCK
         L     R4,VSAMIDXN        RESTORE DEST INDEX BLOCK ADDRESS
* INITIALISE DEST INDEX BLOCK
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_IDX  SET INDEX
* BHDRXLVL
         MVC   BHDRXLVL,IDXLEVEL  SET INDEX LEVEL
* SET BHDR_INT
* WHEN WE SET PFXROOT, WE'LL SET BHDR_ROT AND TURN OFF BHDR_INT
         OI    BHDRFLG1,BHDR_INT  SET INTERMEDIATE BLOCK
* BHDRSELF
         MVC   BHDRSELF,DTIXXLRA  CHAIN WITHIN LEVEL
* BHDRPREV
         MVC   BHDRPREV,VSAMIDXX  SET PREVIOUS INDEX XLRA
         L     R5,TRUIBKSZ        R5=(ADJUSTED) INDEX BLKSIZE
         JAS   R14,BUILDFTR       BUILD INDEX LEVEL FTR BLOCK
         MVHHI SPCEDATA,X'0080'   BYTE FOR SHIFTING B'10' (ALLOCATED)
         LG    R5,WORK7           R5=SOURCE XLRA
         LG    R7,DTIXXLRA        R7=DEST XLRA
* R2        TRACKER FOR DEST DATA
* R3        POINTER TO SOURCE INDEX BLOCK
* R4        POINTER TO DEST INDEX BLOCK
* R5        SOURCE XLRA
* R6        RPTR POINTER
* R7        DEST XLRA
* R8        POINTER TO KEY/XRBA/RRN+XLRA
* R9        WORK
* R10 HIGH  LENGTH OF KEY/XRBA/RRN+XLRA
* WORK1 TRACKER FOR DEST RPTR'S
* WORK3 DEST BLOCK LOCATION
SRCEHDR  USING ZVSAMHDR,R3
DESTHDR  USING ZVSAMHDR,R4
         SRLG  R7,R7,8            SHIFT OUT RECORD NUMBER
         MSGF  R7,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         ALGFI R7,4096            + PREFIX SIZE
         STG   R7,WORK3           SAVE IT
         POINT IDXINOUT,RBA=WORK3 POINT TO DEST INDEX BLOCK
* BHDRFRE@
         MVHI  DESTHDR.BHDRFRE@,BHDRLENG SET FREESPACE OFFSET
         AHIK  R9,R4,BHDRLENG     R9=DEST ADDRESS AFTER HEADER
         ST    R9,WORK1           SAVE DEST RPTR TRACKER
* BHDRFREE
         L     R9,TRUIBKSZ        R9=(ADJUSTED) INDEX BLKSIZE
         AHI   R9,-(BHDRLENG+BFTRLENG) -(HDR+FTR)
         ST    R9,DESTHDR.BHDRFREE SAVE TOTAL FREESPACE
         L     R1,VSAMPRFX        R1=INDEX PREFIX BLOCK ADDRESS
         AHI   R1,BHDRLENG        R1=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R1
         LFH   R10,PFXKYLEN       R10 HIGH=KEYLENGTH
         DROP  R1
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    IDXKSDS3           EXIT IF IT IS
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JO    IDXKSDS3           EXIT IF IT IS
* ESDS/RRDS
         IIHF  R10,8              R10 HIGH=8 (XRBA/RRN)
IDXKSDS3 DS    0H
         AIH   R10,8              R10 HIGH=KEY/XRBA/RRN+XLRA LENGTH
         LR    R2,R4              R2=DEST BLOCK
         A     R2,TRUIBKSZ        +BLKSIZE
         AHI   R2,-BFTRLENG       -FTR
         SLLG  R2,R2,32           SHIFT TO HIGH
         SHHHR R2,R2,R10          -KEY/XRBA/RRN+XLRA=TRACKER DEST DATA
         SRLG  R2,R2,32           SHIFT TO LOW
         AHIK  R9,R4,BHDRLENG     R9=DEST RPTR POINTER
NEXTSRCE DS    0H
* GET A SOURCE BLOCK
         SRLG  R5,R5,8            SHIFT OUT RECORD NUMBER
         MSGF  R5,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         ALGFI R5,4096            + PREFIX SIZE
         STG   R5,WORK2           SAVE IT
         POINT IDXINOUT,RBA=WORK2 POINT TO INDEX BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         READ  (R1),,IDXINOUT,(R3) READ SOURCE INDEX BLOCK
         CHECK (R1)               CHECK
* SEARCH FOR RPTR_END
         AHIK  R6,R3,BHDRLENG     R6=SOURCE RPTR POINTER
         USING ZVSAMRPT,R6
         CLI   RPTRFLGS,RPTR_END  EMPTY OR INSERTED FREEBLOCK ?
         JE    SRCEEMTY           EXIT IF IT IS
SRCELOOP DS    0H
         CLI   RPTRFLGS,RPTR_END  RPTREND ?
         JE    SRCEEND            EXIT IF NOT
         AHI   R6,RPTRLENG        BUMP POINTER
         J     SRCELOOP           LOOP
*
SRCEEND  DS    0H
* FOUND RPTR_END, BACK OFF 1
         AHI   R6,-RPTRLENG       BACK OFF TO LAST ONE
         L     R8,RPTRREC@        R8=OFFSET TO LAST INDEX IN BLOCK
         AR    R8,R3              R8=POINTER TO KEY/XRBA/RRN+XLRA
         LGR   R14,R10            SHIFT INTO
         SRLG  R14,R14,32                    R14
         AHI   R14,-1             -1 FOR EXECUTE
         EXRL  R14,MOVESCDS       MOVE KEY/XRBA/RRN+XLRA TO DEST
         AIH   R10,-8             R10 HIGH=KEY/XRBA/RRN LENGTH
         AHHLR R9,R10,R2          R9=POINTER TO DEST XLRA
         SRLG  R9,R9,32           SHIFT TO LOW
         AIH   R10,8              RESTORE KEY/XRBA/RRN+XLRA LENGTH
         MVC   0(8,R9),SRCEHDR.BHDRSELF MOVE SOURCE XLRA
* BHDR#REC
         IC    R9,DESTHDR.BHDR#REC R9=CURRENT NO. OF RECORDS
         AHI   R9,1               +1
         STC   R9,DESTHDR.BHDR#REC SAVE NO. OF RECORDS
         L     R9,WORK1           R9=DEST RPTR TRACKER
         SR    R2,R4              R2=DEST DATA OFFSET
         MVI   0(R9),RPTR_ACT     SET ACTIVE DEST RPTR
         ST    R2,1(R9)           SAVE OFFSET IN DEST RPTR
         AHI   R9,RPTRLENG        POINT TO NEXT DEST RPTR
         ST    R9,WORK1           SAVE IT
         AR    R2,R4              RESTORE DEST DATA POINTER
         SLLG  R2,R2,32           SHIFT TO HIGH
         SHHHR R2,R2,R10          BACK OFF BY KEY/XRBA/RRN+XLRA LENGTH
         SRLG  R2,R2,32           SHIFT TO LOW
* BHDRFRE@
         SR    R9,R4              R9=FREESPACE OFFSET
         ST    R9,DESTHDR.BHDRFRE@ SAVE NEW FREESPACE OFFSET
* BHDRFREE
         L     R9,DESTHDR.BHDRFREE R9=TOTAL DEST FREESPACE
         AHI   R9,-RPTRLENG       -RPTR
         SLLG  R9,R9,32           SHIFT TO HIGH
         SHHHR R9,R9,R10          -KEY/XRBA/RRN+XLRA LENGTH
         SRLG  R9,R9,32           SHIFT TO LOW
         ST    R9,DESTHDR.BHDRFREE R9=SAVE TOTAL DEST FREESPACE
SRCEEMTY DS    0H
         CLC   DESTHDR.BHDR#REC,RECIDX REACHED LIMIT ?
         JE    LEVLFULX           EXIT IF WE HAVE
         CGHSI SRCEHDR.BHDRNEXT,-1 ANY MORE SOURCE ?
         JE    NOTFULLV           EXIT IF NONE
         LG    R5,SRCEHDR.BHDRNEXT R5=NEXT SOURCE XLRA
         J     NEXTSRCE           LOOP
*
MOVESCDS MVC   0(0,R2),0(R8)      MOVE TO DEST
*
LEVLFULX DS    0H
* REACHED NO. OF RECORDS (MAX OR BLKSIZE-FREESPACE%)
         MVI   IDXLEVFL,X'FF'     INDICATE FULL DEST BLOCK
         CLC   DESTHDR.BHDR#REC,MAXIDX REACHED MAXIMUM LIMIT ?
         JNE   NOTFULLV           EXIT IF NOT
* BLOCK REALLY IS FULL
         MVHHI SPCEDATA,X'00C0'   BYTE FOR SHIFTING B'11' (BLOCK FULL)
NOTFULLV DS    0H
* SET END RPTR
         L     R9,WORK1           R9=NEXT RPTR POINTER
         MVI   0(R9),RPTR_END     SET
         MVHI  1(R9),-1               ENDING RPTR
* BHDRNEXT
         MVGHI DESTHDR.BHDRNEXT,-1 ASSUME NO NEXT
* BHDRFRE@
         ASI   DESTHDR.BHDRFRE@,RPTRLENG SET NEW DEST FREESPACE OFFSET
* BHDRFREE
         ASI   DESTHDR.BHDRFREE,-RPTRLENG SET TOTAL DEST FREESPACE
         JAS   R14,INDXWRIT       UPDATE PREV/WRITE NEW INDEX BLOCK
         MVC   SPCEBITS,SPCEDATA  SET SPACEMAP BITS
         LLIHF R0,C'IIII'         FLAG IT AS INDEX
         L     R0,TRUIBKSZ        R0=(ADJUSTED) INDEX BLKSIZE
         JAS   R14,SPACEMAP       SET SPACEMAP BITS
         CLI   IDXLEVFL,X'FF'     NEED ANOTHER DEST BLOCK ?
         MVI   IDXLEVFL,0         RESET INDICATOR
         JNE   DESTEND            EXIT IF NOT
* BUILD ANOTHER INDEX DEST BLOCK
         MVI   IDXFLAG,X'FF'      SET FLAG TO BUILD ANOTHER LEVEL
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
         MVHHI SPCEDATA,X'0080'   BYTE FOR SHIFTING B'10' (ALLOCATED)
         MVC   WORK7(8),SRCEHDR.BHDRNEXT SET NEXT SOURCE XLRA
         DROP  SRCEHDR
         J     LEVLLOOP           LOOP
*
DESTEND  DS    0H
* NO MORE DEST BLOCKS NEEDED, BUT MIGHT NEED ANOTHER LEVEL
* WTO INDEX BLOCK COUNT
         LLC   R1,DESTHDR.BHDRXLVL R1=DEST INDEX LEVEL
         CVD   R1,WORK1           CONVERT TO DECIMAL
         MVC   ILEVEL,CNSTEDW1    RESET EDIT WORD
         ED    ILEVEL,WORK1+6     EDIT INDEX LEVEL
         L     R1,IXCOUNT         R0=TOTAL NO. OF INDEX BLOCKS AT LEVEL
         CVD   R1,WORK1           CONVERT TO DECIMAL
         L     R0,TXCOUNT         R0=CURRENT NO. OF INDEX BLOCKS
         AR    R0,R1              +INDEX BLOCKS AT LEVEL
         ST    R0,TXCOUNT         SAVE NO. OF INDEX BLOCKS
         MVHI  IXCOUNT,0          CLEAR INDEX COUNT AT LEVEL
         MVC   IBLOCKS,CNSTEDW2   RESET EDIT WORD
         ED    IBLOCKS,WORK1+4    EDIT NO. OF INDEX BLOCKS
         WTO   MF=(E,WTOIBLOK)    SHOW IT
* UPDATE THE PFXBLVLn/ELVLn
         L     R8,VSAMPRFX        R8=INDEX PREFIX BLOCK ADDRESS
         AHI   R8,BHDRLENG        R8=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R8
         LLC   R1,DESTHDR.BHDRXLVL R1=DEST LEVEL NUMBER
         SLL   R1,4               * 16
         LA    R1,PFXBLVL0(R1)    R1=ADDRESS OF LVL PAIR
* PFXBLVLn
         MVC   0(8,R1),WORK8      SET START OF INDEX LEVEL n
* PFXELVLn
         MVC   8(8,R1),DTIXXLRA   SET END OF INDEX LEVEL n
         DROP  R8
         CLI   IDXFLAG,X'FF'      NEED ANOTHER LEVEL ?
         JNE   INDXEND            EXIT IF NONE
* CREATE ANOTHER LEVEL
         MVI   IDXFLAG,0          RESET NEW LEVEL INDICATOR
         MVC   WORK7(8),WORK8     SET SOURCE PFXBLVLn
         LG    R1,DTIXXLRA        R1=CURRENT DATA XLRA
         ALGFI R1,256             CALC NEXT
         STG   R1,DTIXXLRA        SAVE NEXT DATA XLRA
         J     LEVLNEW            LOOP
*
INDXEND  DS    0H
         MVC   WORK7(8),DTIXXLRA  SAVE LAST INDEX BLOCK
* WRITE SPACEMAP BLOCK, NO BITS JUST WRITE
         MVI   EOFFLAG,X'FF'      SET EOF TO WRITE SPACEMAP BLOCK
         LLIHF R0,C'IIII'         FLAG IT AS INDEX
         L     R0,TRUIBKSZ        R0=(ADJUSTED) INDEX BLKSIZE
         JAS   R14,SPACEMAP       WRITE SPACEMAP BLOCK
         L     R8,VSAMPRFX        R8=INDEX PREFIX BLOCK ADDRESS
         AHI   R8,BHDRLENG        R8=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R8
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
* PFXROOT
         MVC   PFXROOT,WORK7      SET HIGHEST LEVEL INDEX BLOCK
* PFXIXLVL
         MVC   PFXIXLVL,DESTHDR.BHDRXLVL SET NO. OF INDEX LEVELS
* TURN OFF BHDR_INT, SET BHDR_ROT
         NI    DESTHDR.BHDRFLG1,255-BHDR_INT UNSET INTERMEDIATE BLOCK
         OI    DESTHDR.BHDRFLG1,BHDR_ROT  SET ROOT BLOCK
* REWRITE ROOT INDEX BLOCK
         L     R5,VSAMIDXN        R5=DEST INDEX BLOCK ADDRESS
         LG    R1,DESTHDR.BHDRSELF R1=CURRENT XLRA
         DROP  DESTHDR
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
         POINT IDXINOUT,RBA=WORK1 POINT TO INDEX BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,IDXINOUT,(R5) WRITE INDEX BLOCK
         CHECK (R1)               CHECK
* PFXHXLRA
         MVC   PFXHXLRA,DTIXXLRA  SET TO HIGHEST ALLOC INDEX BLOCK
* PFXMAPOF
         L     R1,SPCEHIGH        R1=HIGHEST SPACEMAP ADDRESS
         S     R1,VSAMSPCE        -BLOCK START=OFFSET TO BLOCK
         ST    R1,PFXMAPOF        SAVE SPACEMAP OFFSET
* CTRAVGRL -- AVERAGE DATA RECORD LENGTH
         SGR   R0,R0              CLEAR R0
         LG    R1,TOTRCSZI        R1=TOTAL INDEX RECORD LENGTHS
         LGF   R2,RICOUNT         R2=INDEX RECORD COUNT
         LTGR  R2,R2              ANY RECORDS ?
         JZ    INDXNORC           EXIT IF NONE
         DLGR  R0,R2              /RECORD COUNT
         ST    R1,CTRAVGRL        SET CTRAVGRL
INDXNORC DS    0H
* CTRAVSPAC -- TOTAL INDEX FREESPACE
         MVC   CTRAVSPAC,TOTFREEI SET CTRAVSPAC
* CTRHLRBA.....BLOCK RBA OF PFXROOT
         LG    R1,PFXROOT         R1=PFXROOT
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         STG   R1,CTRHLRBA        SET CTRHLRBA
* CTRSDTASZ....DATASET SIZE AS WTO'D
         LGF   R1,TXCOUNT         R1=NO. OF INDEX BLOCKS
         A     R1,SMCOUNT         + NO. OF SPACEMAP BLOCKS=TOTAL BLOCKS
         M     R0,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         SLLG  R0,R0,32           FORM 64-BIT
         AGFR  R0,R1                          PRODUCT
         AGHI  R0,4096            + PREFIX BLKSIZE
         STG   R0,CTRSDTASZ       SET CTRSDTASZ
         DROP  R8
* REWRITE INDEX PREFIX BLOCK
         POINT IDXINOUT,RBA==XL8'00' POINT TO PREFIX BLOCK
         LHI   R5,4096            R5=4K FOR PREFIX BLOCK
         ST    R5,DCBBLKSIF-IHADCB(R1) SAVE BLKSIZE
         ST    R5,DCBLRECLF-IHADCB(R1) SAVE LRECL
         L     R5,VSAMPRFX        R5=INDEX PREFIX BLOCK ADDRESS
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,IDXINOUT,(R5) WRITE INDEX PREFIX BLOCK
         CHECK (R1)               CHECK
* WTO INDEX SPACEMAP BLOCK COUNT
         L     R1,SMCOUNT         R1=INDEX SPACEMAP BLOCK COUNT
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    ISBLOCKS,WORK1+4   EDIT NO. OF INDEX SPACEMAP BLOCKS
         WTO   MF=(E,WTOISBLK)    SHOW IT
* CALC AND WTO INDEX FILE SIZE
         L     R2,TXCOUNT         R2=NO. OF INDEX BLOCKS
         A     R2,SMCOUNT         + NO. OF SPACEMAP BLOCKS=TOTAL BLOCKS
         MS    R2,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         AHI   R2,4096            + PREFIX BLKSIZE
         CVD   R2,WORK1           CONVERT TO DECIMAL
         ED    IDXSIZE,WORK1+2    EDIT INDEX FILE SIZE
         WTO   MF=(E,WTOIXSIZ)    SHOW IT
         CLOSE IDXINOUT           CLOSE INDEX FILE
PROGEND  DS    0H
* WTO ELAPSED TIME
         TIME  BIN
         S     R0,BEGTIME         R0=ELAPSED TIME (0.01 SECS)
         LLGFR R3,R0              R3=ELAPSED TIME (0.01 SECS)
         LHI   R14,6000           60.00 SECS
         DSGFR R2,R14             / 60.00 SECS
         CVD   R3,WORK1           CONVERT MINUTES TO DECIMAL
         ED    MINEDIT,WORK1+6    EDIT MINUTES
         MVC   ELAPSED(3),MINEDIT+1 MOVE TO WTO
         CVD   R2,WORK1           CONVERT SECONDS TO DECIMAL
         ED    SECEDIT,WORK1+5    EDIT SECONDS
         MVC   ELAPSED+4(5),SECEDIT+2 MOVE TO WTO
         WTO   MF=(E,WTOTIME)     SHOW IT
         LARL  R1,VERCOUNT        BASE-FREE
         CHSI  0(R1),0            ANY VERIFY ERRORS ?
         JNE   BADRETN            EXIT IF THERE ARE
* WTO zREPRO XXXXXXXX ENDED OK
         WTO   MF=(E,WTOENDOK)    SHOW IT
         SUBEXIT
*
**************************************
* SUBROUTINES - WITHIN PROGRAM USING *
**************************************
OPENWTO  DS    0H
* WTO OPEN MESSAGE
*
* INPUT: R1 POINTS TO PATH,X'00'
*
* DESTROYS: R0 R1 R5
         LA    R5,FILEDSN         R5=WTO INPUT PATH
         XC    FILEDSN,FILEDSN    CLEAR PATH NAME
         SR    R0,R0              X'00' IS STOPPER
         MVST  R5,R1              MOVE PATH NAME
         WTO   MF=(E,WTOOPEND)    SHOW IT
         BR    R14                RETURN
*
DODNAM   DS    0H
* PUT DATA FILE.SFX INTO PREFIX BLOCK
*
* INPUT: R5=POSITION ADDRESS
*        R9=CLUSTER NAME OFFSET
*        WORK4=LENGTH INCLUDING LENGTH FIELD, FILE.SFX
*
* DESTROYS: R0 R1 R5 R6 R9
         L     R6,VSAMPRFX        R6=PREFIX BLOCK ADDRESS
         AHI   R6,BHDRLENG        R6=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R6
         STH   R9,PFXDNAM@        SAVE OFFSET TO CLUSTER NAME
         DROP  R6
         MVC   0(2,R5),WORK4      MOVE LENGTH
         AHI   R5,2               R5=FILE.SFX
         LA    R6,WORK4+2         R6=ADDRESS OF DATA FILE.SFX
         SR    R0,R0              X'00' IS STOPPER
         LR    R1,R5              SAVE START ADDRESS
         MVST  R5,R6              MOVE DATA FILE.SFX
         LR    R5,R1              RESTORE START ADDRESS
         AHI   R5,-2              RESET TRACKER
         LH    R6,WORK4           R6=LENGTH
         AR    R5,R6              BUMP TRACKER
         AR    R9,R6              BUMP TRACKER OFFSET
         BR    R14                RETURN
*
DODPAT   DS    0H
* PUT DATA PATH INTO PREFIX BLOCK
*
* INPUT: R5=POSITION ADDRESS
*        R9=CLUSTER NAME OFFSET
*
* DESTROYS: R1 R2 R5 R9
         L     R2,VSAMPRFX        R2=PREFIX BLOCK ADDRESS
         AHI   R2,BHDRLENG        R2=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R2
         STH   R9,PFXDPAT@        SAVE OFFSET TO DATA PATH
         DROP  R2
         LA    R2,VSAMDTAO        R2=OUTPUT DATA CLUSTER PATH
         TRT   0(128,R2),FINDSTOP FIND X'00' [ .
         CLI   0(R1),C'.'         DOT ?
         JNE   DODPTERR           ERROR IF NOT
BSLOOP1  DS    0H
         AHI   R1,-1              SCAN BACK
         CLI   0(R1),C'\'         BACKSLASH ?
         JNE   BSLOOP1            LOOP IF NOT
         LA    R2,VSAMDTAO        R2=OUTPUT DATA CLUSTER PATH
         SR    R1,R2              R1=CLUSTER PATH LENGTH
         AHI   R1,2               +2 FOR LENGTH
         STH   R1,0(R5)           SAVE PATH LENGTH (INC. ITSELF)
         AHI   R1,-3              -2(LL) -1 FOR EXECUTE = -3
         EXRL  R1,PFXPATH         MOVE PATH NAME
         LA    R5,3(R1,R5)        BUMP TRACKER
         LA    R9,3(R1,R9)        BUMP TRACKER OFFSET
         BR    R14                RETURN
*
DODPTERR DS    0H
         MVI   BADFMCDE,C'A'      CODE=A ERROR IN DPAT/XPAT EXTRACTION
         J     BADVSAM            EXIT
PFXPATH  MVC   2(0,R5),0(R2)      MOVE OUTPUT DATA/INDEX PATH
*
DOXNAM   DS    0H
* PUT INDEX FILE.SFX INTO PREFIX BLOCK
*
* INPUT: R5=POSITION ADDRESS
*        R9=CLUSTER NAME OFFSET
*        WORK5=LENGTH INCLUDING LENGTH FIELD, FILE.SFX
*
* DESTROYS: R0 R1 R5 R6 R9
         L     R6,VSAMPRFX        R6=PREFIX BLOCK ADDRESS
         AHI   R6,BHDRLENG        R6=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R6
         STH   R9,PFXXNAM@        SAVE OFFSET TO INDEX NAME
         DROP  R6
         MVC   0(2,R5),WORK5      MOVE LENGTH
         AHI   R5,2               R5=FILE.SFX
         LA    R6,WORK5+2         R6=ADDRESS OF INDEX FILE.SFX
         SR    R0,R0              X'00' IS STOPPER
         LR    R1,R5              SAVE START ADDRESS
         MVST  R5,R6              MOVE INDEX FILE.SFX
         LR    R5,R1              RESTORE START ADDRESS
         AHI   R5,-2              RESET TRACKER
         LH    R6,WORK5           R6=LENGTH
         AR    R5,R6              BUMP TRACKER
         AR    R9,R6              BUMP TRACKER OFFSET
         BR    R14                RETURN
*
DOXPAT   DS    0H
* PUT INDEX PATH INTO PREFIX BLOCK
*
* INPUT: R5=POSITION ADDRESS
*        R9=CLUSTER NAME OFFSET
*
* DESTROYS: R1 R2 R5 R9
         L     R2,VSAMPRFX        R2=PREFIX BLOCK ADDRESS
         AHI   R2,BHDRLENG        R2=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R2
         STH   R9,PFXXPAT@        SAVE OFFSET TO INDEX PATH
         DROP  R2
         LA    R2,VSAMIDXO        R2=OUTPUT INDEX PATH
         TRT   0(128,R2),FINDSTOP FIND X'00' [ .
         CLI   0(R1),C'.'         DOT ?
         JNE   DOXPTERR           ERROR IF NOT
BSLOOP4  DS    0H
         AHI   R1,-1              SCAN BACK
         CLI   0(R1),C'\'         BACKSLASH ?
         JNE   BSLOOP4            LOOP IF NOT
         LA    R2,VSAMIDXO        R2=OUTPUT INDEX PATH
         SR    R1,R2              R1=INDEX PATH LENGTH
         AHI   R1,2               +2 FOR LENGTH
         STH   R1,0(R5)           SAVE PATH LENGTH (INC. ITSELF)
         AHI   R1,-3              -2(LL) -1 FOR EXECUTE = -3
         EXRL  R1,PFXPATH         MOVE PATH NAME
         LA    R5,3(R1,R5)        BUMP TRACKER
         LA    R9,3(R1,R9)        BUMP TRACKER OFFSET
         BR    R14                RETURN
*
DOXPTERR DS    0H
         MVI   BADFMCDE,C'A'      CODE=A ERROR IN DPAT/XPAT EXTRACTION
         J     BADVSAM            EXIT
*
BUILDHDR DS    0H
* BUILD HDR BLOCK
* FIELD  BHDRFLG1 NOT BUILT HERE, DEPENDANT ON BLOCK TYPE
* FIELDS BHDRFRE@ AND BHDRFREE NOT BUILT HERE, DYNAMIC
*
* INPUT: R4=BLOCK ADDRESS
         USING ZVSAMHDR,R4
* BHDREYE
         MVC   BHDREYE,CNSTHDR    MOVE EYECATCHER
* BHDRVER
         MVI   BHDRVER,BHDR_V2    MOVE VERSION
* BHDRSEQ#
         MVI   BHDRSEQ#,X'01'     SET WRITE SEQ
* BHDRSELF, BHDRNEXT, BHDRPREV
         MVI   BHDRSELF,X'FF'     INITIAL
         MVC   BHDRSELF+1(23),BHDRSELF    SELF, NEXT, PREV
         BR    R14                RETURN
         DROP  R4
*
BUILDFTR DS    0H
* BUILD FTR BLOCK
*
* INPUT: R4=BLOCK ADDRESS
*        R5=BLOCK SIZE
*
* DESTROYS: R1
         LR    R1,R5              SAVE R5
         AHI   R5,-BFTRLENG       -FOOTER LENGTH
         AR    R5,R4              R5=ADDRESS OF FOOTER
         USING ZVSAMFTR,R5
* BFTREYE
         MVC   BFTREYE,CNSTFTR    MOVE EYECATCHER
* BFTRSEQ#
         MVI   BFTRSEQ#,X'01'     SET WRITE SEQ
         LR    R5,R1              RESTORE R5
         BR    R14                RETURN
         DROP  R5
*
PROCVSAM DS    0H
* PROCESS VSAM ENVIRONMENT VARIABLE AND DTADSN/IDXDSN OVERRIDES
*
* INPUT : ITYPE=I(INPUT) O(OUTPUT) A(AIX)
*       : R5 POINTS TO VSAM ENVIRONMENT VARIABLE
*         ITYPE=I  R5>GETENVI
*         ITYPE=A  R5>GETENVO
*         ITYPE=O  R5>GETENVO
*
* DESTROYS: R0 R1 R2 R5 R6 R7 R8 R15
*
* THE ENVIRONMENT VARIABLES ARE USED TO LOCATE THE CLUSTER AND FORM THE
* CATALOG DSN
* USE THE ENVIRONMENT VARIABLES FOR THE OPEN AND PREFIX BLOCK UNLESS
* THERE ARE OVERRIDES, IN WHICH CASE USE THEM
*
* EXTRACT THE CATALOG NAME, BUILD THE CATALOG DSN AND LOAD IT
*    SET INVSAM=E:\Z390\ZVSAM\DATA\Z390CAT2.MYFILE08
*    SET Z390CAT2=E:\Z390\ZVSAM\CODE
*    E:\Z390\ZVSAM\CODE\Z390CAT2.390
*
* BUILD THE DTA/IDX DSN'S (LOAD)
*    SET INQSAM=%ZVSMDATA%\MYFILE8F.TXT[RECFM=FT]
*    SET OUTVSAM=%ZVSMDATA%\Z390CAT2.MYFILE08
*    E:\Z390\ZVSAM\DATA\MYFILE08.DTA
*    E:\Z390\ZVSAM\DATA\MYFILE08.IDX
*
* BUILD THE DTA/IDX DSN'S (BUILDAIX)
*    SET INVSAM=%ZVSMDATA%\Z390CAT2.MYFILE09
*    E:\Z390\ZVSAM\DATA\MYFILE09.DTA
*
*    SET OUTVSAM=E:\Z390\CICS\VSAM\Z390CAT2.MYAIXWD
*    E:\Z390\ZVSAM\DATA\MYAIXWD.DTA
*    E:\Z390\ZVSAM\DATA\MYAIXWD.IDX
*
* BUILD WORK4/5 FROM THE ENVIRONMENT VARIABLES OR FROM DTADSN/IDXDSN
*    WORK4=DATA  LL,FILE.SFX X'00'
*    WORK5=INDEX LL,FILE.SFX X'00'
         SLLG  R14,R14,32         SAVE RETURN ADDRESS IN R14 HIGH
* EXTRACT FIRST CATALOG NAME
* ALL VALUES OF ITYPE
         TRT   0(128,R5),FINDSTOP FIND X'00' DOT
         MVI   BADFMCDE,C'1'      CODE=1 CANNOT FIND DOT SEPARATOR
         CLI   0(R1),C'.'         GOT DOT ?
         JNE   PROCERR            ERROR IF NOT
         LR    R15,R1             R15=DOT ADDRESS
PROCVLP2 DS    0H
         AHI   R15,-1             SCAN BACK
         CLI   0(R15),C'\'        BACKSLASH ?
         JNE   PROCVLP2           LOOP IF NOT
         AHI   R15,1              R15 POINTS TO CATALOG NAME
         LR    R8,R15             SAVE IT
         SR    R1,R15             R1=LENGTH OF CATALOG NAME
         MVI   BADFMCDE,C'2'      CODE=2 CATALOG NAME LENGTH ERROR
         CHI   R1,8               GOOD LENGTH ?
         JH    PROCERR            ERROR IF NOT
         LR    R6,R1              SAVE LENGTH
         AHI   R1,-1              -1 FOR EXECUTE
* FOR VSAM-TO-VSAM, CHECK IF THE CATALOG NAMES ARE THE SAME
         CLI   VSAMCATG,0         CATALOG ALREADY LOADED ?
         JE    VSAMFRMC           EXIT IF NOT
* CATALOG ALREADY LOADED MEANS VSAM INPUT AND OUTPUT
* CHECK THAT NAMES AND LENGTHS ARE EQUAL
         MVI   BADFMCDE,C'3'      CODE=3 INPUT CATALOG NAME<>OUTPUT
         EXRL  R1,VSAMCATC        ARE CATALOG NAMES THE SAME ?
         JNE   PROCERR            ERROR IF NOT
         CH    R1,VSAMCATL        ARE CATALOG NAME LENGTHS THE SAME ?
         JNE   PROCERR            ERROR IF NOT
         J     VSAMGOTC           EXIT
*
VSAMCATC CLC   VSAMCATG(0),0(R8)  COMPARE CATALOG NAMES
*
VSAMFRMC DS    0H
         STH   R1,VSAMCATL        SAVE CATALOG NAME LENGTH-1
         EXRL  R1,VSAMMCAT        MOVE CATALOG NAME
         MVI   BADFMCDE,C'4'      CODE=4 CATALOG PATH MISSING
         GETENV VSAMCATG          GET CATALOG PATH
         LTR   R15,R15            OK ?
         JNZ   PROCERR            EXIT IF NOT
* FORM CATALOG DSN AND LOAD IT
         LA    R1,VSAMDSN         R1=CATALOG PATH ADDRESS
         LR    R8,R2              R8=ENVIRONMENT VARIABLE ADDRESS
VSAMCATM DS    0H
         MVC   0(1,R1),0(R8)      MOVE IT
         AHI   R8,1               BUMP ENV VARIABLE POINTER
         AHI   R1,1               BUMP OUTPUT POINTER
         CLI   0(R8),0            STOPPER ?
         JNE   VSAMCATM           LOOP IF NOT
         MVI   0(R1),C'\'         APPEND \
         MVC   1(8,R1),VSAMCATG   APPEND CATALOG NAME
         LA    R1,1(R1,R6)        BUMP TO END
         IIHF  R1,C!.390!         R1 HIGH=EBCDIC .390
         STFH  R1,0(R1)           APPEND IT
* VSAMDSN=E:\Z390\ZVSAM\CODE\Z390CAT2.390 X'00'
         MVI   BADFMCDE,C'5'      CODE=5 CATALOG LOAD FAILED
         LOAD  DSNAME=VSAMDSN     LOAD CATALOG
         LTR   R15,R15            OK ?
         JNZ   PROCERR            EXIT IF NOT
* CATALOG LOAD OK
         LR    R1,R0              R1=CATALOG LOAD ADDRESS
         ST    R0,VCDTADDR        SAVE CATALOG ADDRESS
         USING IHAVCDT,R1
         MVI   BADFMCDE,C'6'      CODE=6 CATALOG VERSION ERROR
         IIHF  R1,C'VCD2'         RIGHT
         CHF   R1,VCDTID                CATALOG ?
         JNE   PROCERR            EXIT IF NOT
         DROP  R1
VSAMGOTC DS    0H
* EXTRACT CLUSTER NAME AND FORM DSN
* SET INVSAM=E:\Z390\ZVSAM\DATA\Z390CAT2.MYFILE09
* --OR--
* SET OUTVSAM=E:\Z390\ZVSAM\DATA\Z390CAT2.MYAIXWD
         TRT   0(128,R5),FINDSTOP FIND X'00' DOT
         MVI   BADFMCDE,C'1'      CODE=1 CANNOT FIND DOT SEPARATOR
         CLI   0(R1),C'.'         GOT DOT ?
         JNE   PROCERR            ERROR IF NOT
* EXTRACT CLUSTER PATH
         LR    R15,R1             R15=DOT ADDRESS
         LR    R8,R1              R8=DOT ADDRESS
         LR    R1,R5              R1=ENVIRONMENT VARIABLE ADDRESS
PROCVLP3 DS    0H
         AHI   R15,-1             SCAN BACK
         CLI   0(R15),C'\'        BACKSLASH ?
         JNE   PROCVLP3           LOOP IF NOT
         SR    R15,R1             R15=LENGTH OF CLUSTER PATH-1
         LA    R6,VSAMDTAI        R6=INPUT DATA CLUSTER PATH
         L     R9,GETENVI         R9=INPUT ENVIRONMENT VARIABLE
         LA    R14,VSAMCLSI       R14=INPUT CLUSTER NAME/ADDR IN CAT.
         CLI   ITYPE,C'I'         INPUT ?
         JE    VSAMTISI           EXIT IF IT IS
* OUTPUT OR AIX
         LA    R6,VSAMDTAO        R6=OUTPUT DATA CLUSTER PATH
         L     R9,GETENVO         R9=OUTPUT ENVIRONMENT VARIABLE
         LA    R14,VSAMCLSO       R14=OUTPUT CLUSTER NAME/ADDR IN CAT.
VSAMTISI DS    0H
         EXRL  R15,VSAMMVEP       MOVE CLUSTER PATH
         LA    R6,1(R6,R15)       BUMP CLUSTER PATH POINTER
* EXTRACT THE CLUSTER NAME
         TRT   1(128,R8),FINDSTOP FIND X'00' DOT
         MVI   BADFMCDE,C'7'      CODE=7 CLUSTER EXTRACTION FAILED
         CLI   0(R1),0            END OF ENVIRONMENT VARIABLE ?
         JNE   PROCERR            ERROR IF NOT
         AHI   R8,1               R8=CLUSTER NAME
         SR    R1,R8              R1=LENGTH OF CLUSTER NAME
         MVI   BADFMCDE,C'8'      CODE=8 CLUSTER NAME LENGTH ERROR
         CHI   R1,8               VALID ?
         JH    PROCERR            ERROR IF NOT
         STH   R1,VSAMCLSL        SAVE FOR PREFIX BLOCK
         AHI   R1,-1              -1 FOR EXECUTE
         EXRL  R1,VSAMMVN1        MOVE CLUSTER NAME INTO PATH
         EXRL  R1,VSAMMVN2        SAVE CLUSTER NAME
* FORM THE CLUSTER PATH
         LA    R6,1(R1,R6)        R6=ADDRESS AFTER CLUSTER NAME
         MVC   0(5,R6),DOTDTA     MOVE .DTA,X'00'
* SET INPUT IDX (FOR VERIFY)
         MVC   VSAMIDXI,VSAMDTAI  COPY INPUT DTA TO IDX VSAM PATH
         MVC   128(5,R6),DOTIDX   MOVE .IDX,X'00'
* SET OUTPUT/AIX IDX
         MVC   VSAMIDXO,VSAMDTAO  COPY OUTPUT DTA TO IDX VSAM PATH
         MVC   128(5,R6),DOTIDX   MOVE .IDX,X'00'
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    FINDAIX            EXIT IF IT IS
* SEARCH CATALOG FOR A BASE CLUSTER NAME
         L     R2,VCDTADDR        R2=CATALOG ADDRESS
         USING IHAVCDT,R2
         L     R5,VCDTCLRT        R5=NO. OF BASE CLUSTERS TO SCAN
         L     R7,VCDTCLRA        R7=POINTER TO BASE CLUSTERS
         USING IHAVCLR,R7
FINDCLST DS    0H
         CLC   VCLRNAME,0(R14)    OUR CLUSTER ?
         JE    VSAMGTCL           EXIT IF IT IS
         AHI   R7,VCLRLEN         POINT TO NEXT CLUSTER
         JCT   R5,FINDCLST        LOOP
         J     BADCLUST           ERROR IF NOT FOUND
*
VSAMGTCL DS    0H
* FOUND CLUSTER NAME
* SAVE VCLR FIELDS
         MVC   VXXXFLG1,VCLRFLG1  SAVE VCLRFLG1
         MVC   VXXXFLG2,VCLRFLG2  SAVE VCLRFLG2
         MVC   VXXXDFS,VCLRDFS    SAVE VCLRDFS
         MVC   VXXXIFS,VCLRIFS    SAVE VCLRIFS
         MVC   VXXXLMAX,VCLRLMAX  SAVE VCLRLMAX
         MVC   VAXXLMAX,VCLRLMAX  SAVE VCLRLMAX FOR AIX ON SPANNED
         MVC   VXXXKLEN,VCLRKLEN  SAVE VCLRKLEN
         MVC   VXXXKOFF,VCLRKOFF  SAVE VCLRKOFF
         MVC   VXXXDTAA,VCLRDTAA  SAVE VCLRDTAA
         MVC   VXXXIDXA,VCLRIDXA  SAVE VCLRIDXA
         MVC   VXXXDBS,VCLRDBS    SAVE VCLRDBS
         MVC   VXXXIBS,VCLRIBS    SAVE VCLRIBS
         MVC   VXXXDNB,VCLRDNB    SAVE VCLRDNB
         MVC   VXXXDFB,VCLRDFB    SAVE VCLRDFB
         MVC   VXXXINB,VCLRINB    SAVE VCLRINB
         MVC   VXXXIFB,VCLRIFB    SAVE VCLRIFB
         MVC   VXXXAIXN,VCLRAIXN  SAVE VCLRAIXN
         J     VSAMCADR           EXIT
         DROP  R7
*
FINDAIX  DS    0H
* SEARCH CATALOG FOR A AIX CLUSTER NAME
         L     R2,VCDTADDR        R2=CATALOG ADDRESS
         USING IHAVCDT,R2
         L     R5,VCDTAIXT        R5=NO. OF AIX'S TO SCAN
         L     R7,VCDTAIXA        R7=POINTER TO AIX'S
         USING IHAVAIX,R7
         DROP  R2
FINDAIXO DS    0H
         CLC   VAIXNAME,VSAMCLSO  OUR AIX ?
         JE    VSAMGTAX           EXIT IF IT IS
         AHI   R7,VAIXLEN         POINT TO NEXT AIX
         JCT   R5,FINDAIXO        LOOP
         J     BADCLUST           ERROR IF NOT FOUND
*
VSAMGTAX DS    0H
* AIX CLUSTER FOUND
         CLC   VAIXRELA,VSAMCADI  RELATE CLUSTER SAME AS INPUT ?
         JNE   BADRELAT           ERROR IF NOT
* SAVE VAIX FIELDS
         MVC   VXXXFLG1,VAIXFLG1  SAVE VAIXFLG1
         MVC   VXXXFLG2,VAIXFLG2  SAVE VAIXFLG2
         MVC   VXXXDFS,VAIXDFS    SAVE VAIXDFS
         MVC   VXXXIFS,VAIXIFS    SAVE VAIXIFS
         MVC   VXXXKLEN,VAIXKLEN  SAVE VAIXKLEN
         MVC   VXXXKOFF,VAIXKOFF  SAVE VAIXKOFF
         MVC   VXXXDTAA,VAIXDTAA  SAVE VAIXDTAA
         MVC   VXXXIDXA,VAIXIDXA  SAVE VAIXIDXA
         MVC   VXXXDBS,VAIXDBS    SAVE VAIXDBS
         MVC   VXXXIBS,VAIXIBS    SAVE VAIXIBS
         MVC   VXXXDNB,VAIXDNB    SAVE VAIXDNB
         MVC   VXXXDFB,VAIXDFB    SAVE VAIXDFB
         MVC   VXXXINB,VAIXINB    SAVE VAIXINB
         MVC   VXXXIFB,VAIXIFB    SAVE VAIXIFB
         MVC   VXXXMAXE,VAIXMAXE  SAVE VAIXMAXE
         DROP  R7
VSAMCADR DS    0H
* FORM THE DTA PATH\CLUSTER.DTA
         LA    R5,VSAMDTAI        R5=INPUT DATA CLUSTER PATH
         CLI   ITYPE,C'I'         INPUT ?
         JE    VSAMOVDT           EXIT IF IT IS
* OUTPUT OR AIX
         LA    R5,VSAMDTAO        R5=OUTPUT DATA CLUSTER PATH
VSAMOVDT DS    0H
         L     R1,VXXXDTAA        R1=ADDR OF OVERRIDE DTADSN
         CLI   0(R1),0            ANY OVERRIDE ?
         JNE   VSAMDODT           EXIT IF THERE IS
         LR    R1,R5              CAUSE MVST TO DO NOTHING
VSAMDODT DS    0H
* PROCESS DTA INPUT/OUTPUT DSN OVERRIDE
         SR    R0,R0              X'00' IS STOPPER
         MVST  R5,R1              MOVE PATH\FILE.SFX
         LR    R1,R5              R1=STOPPER ADDRESS
VSAMBSLD DS    0H
         AHI   R5,-1              SCAN BACK
         CLI   0(R5),C'\'         BACKSLASH ?
         JNE   VSAMBSLD           LOOP IF NOT
         AHI   R5,1               R5=FIRST BYTE OF DATA FILE.SFX
         SR    R1,R5              R1=LENGTH
         MVI   BADFMCDE,C'9'      CODE=9 CLUSTER.SUFFIX LENGTH ERROR
         CFI   R1,12              MAXIMUM 8.3 ?
         JH    PROCERR            EXIT IF TOO BIG
         AHI   R1,2               +2 FOR LENGTH
         STH   R1,WORK4           SAVE LENGTH
         AHI   R1,-2              -2(LL) +1 FOR NULL -1 FOR EXECUTE
         EXRL  R1,VSAMDTOV        MOVE DATA FILE.SFX
* FORM THE IDX PATH\CLUSTER.DTA
         LA    R5,VSAMIDXI        R5=INPUT INDEX CLUSTER PATH
         CLI   ITYPE,C'I'         INPUT ?
         JE    VSAMOVIX           EXIT IF IT IS
* OUTPUT OR AIX
         LA    R5,VSAMIDXO        R5=OUTPUT INDEX CLUSTER PATH
VSAMOVIX DS    0H
* PROCESS IDX INPUT/OUTPUT DSN OVERRIDE
         L     R1,VXXXIDXA        R1=ADDR OF OVERRIDE IDXDSN
         CLI   0(R1),0            ANY OVERRIDE ?
         JNE   VSAMDOIX           EXIT IF NONE
         LR    R1,R5              CAUSE MVST TO DO NOTHING
VSAMDOIX DS    0H
         SR    R0,R0              X'00' IS STOPPER
         MVST  R5,R1              MOVE OVERRIDE
         LR    R1,R5              R1=STOPPER ADDRESS
VSAMBSLI DS    0H
         AHI   R5,-1              SCAN BACK
         CLI   0(R5),C'\'         BACKSLASH ?
         JNE   VSAMBSLI           LOOP IF NOT
         AHI   R5,1               R5=FIRST BYTE OF INDEX FILE.SFX
         SR    R1,R5              R1=LENGTH
         MVI   BADFMCDE,C'9'      CODE=9 CLUSTER.SUFFIX LENGTH ERROR
         CFI   R1,12              MAXIMUM 8.3 ?
         JH    PROCERR            EXIT IF TOO BIG
         AHI   R1,2               +2 FOR LENGTH
         STH   R1,WORK5           SAVE LENGTH
         AHI   R1,-3              -2(LL) -1 FOR EXECUTE
         EXRL  R1,VSAMIXOV        MOVE INDEX FILE.SFX
         ST    R7,8(R14)          SAVE CLUSTER/AIX CATALOG ADDRESS
         SRLG  R14,R14,32         RESTORE RETURN ADDRESS
         BR    R14                RETURN
*
PROCERR  DS    0H
         J     BADVSAM            EXIT
*
BADCLUST DS    0H
* WTO CLUSTER NOT FOUND IN CATALOG
         WTO   MF=(E,WTOBADCL)    SHOW IT
         J     BADRETN            EXIT
*
BADRELAT DS    0H
         WTO   'zREPRO AIX BUILD, INVSAM AND AIX RELATE MISMATCH'
         J     BADRETN            EXIT
*
VSAMMCAT MVC   VSAMCATG(0),0(R8)  MOVE CATALOG NAME
VSAMMVEP MVC   0(0,R6),0(R9)      MOVE CLUSTER PATH
VSAMMVN1 MVC   0(0,R6),0(R8)      MOVE CLUSTER NAME INTO PATH
VSAMMVN2 MVC   0(0,R14),0(R8)     SAVE CLUSTER NAME
VSAMDTOV MVC   WORK4+2(0),0(R5)   MOVE DATA FILE.SFX
VSAMIXOV MVC   WORK5+2(0),0(R5)   MOVE INDEX FILE.SFX
*
         LTORG
*
READDTIO DS    0H
* READ BLOCK
* I/O AREA IS SAVED IN THE DCB
*
* DESTROYS: R0 R1 R15
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         READ  (R1),,DTAINOUT     READ BLOCK
         CHECK (R1)               CHECK
         BR    R14                RETURN
*
SPACEMAP DS    0H
* SET SPACEMAP BITS
*
* AFTER BLOCK WRITE, WE UPDATE THE SPACEMAP BITS
* WHEN WE HAVE SET BITS IN THE LAST BYTE, BLOCK FULL IS RAISED
* THIS GIVES US ENOUGH ROOM TO SET BITS FOR THE SPACEMAP BLOCK WE ARE
* ABOUT TO WRITE
* IT MEANS THAT THE LAST 4 BITS WILL NEVER BE USED...TOO BAD
*
* INPUT: R0 UPPER/LOWER FULLWORD=DDDD/TRUDBKSZ
*        --OR--
*        R0 UPPER/LOWER FULLWORD=IIII/TRUIBKSZ
*
*        DTIXXLRA HAS THE DATA/INDEX XLRA JUST WRITTEN
*
* DESTROYS: R0 R1 R2 R4 R5 R6 R7 R8 R9 R14 R15
         STM   R0,R15,SPCEREGS    SAVE REGS
         LGR   R7,R0              R7=(ADJUSTED) DATA/INDEX BLKSIZE
         CLI   EOFFLAG,X'FF'      HAS EOF OCCURRED ?
         JE    SPCEEOF            EXIT IF IT HAS
         JAS   R14,SPCESET        SET THE BITS
         C     R5,SPCEEND         HAVE WE FILLED THE SPACEMAP ?
         JNE   SPCEDUN            EXIT IF NOT
SPCEEOF  DS    0H
* THE LAST BLOCK WRITTEN HAS DETECTED A FULL SPACEMAP BLOCK
* --OR--
* EOF HAS OCCURRED (IT WON'T MATTER IF THE SPACEMAP BLOCK IS ALSO FULL)
*
* WE HAVE SET THE BITS FOR THIS BLOCK
*
* JUST WRITTEN BLOCK N, SO LAST/FULL SPACEMAP IS AT N+1
         LG    R2,DTIXXLRA        R2=CURRENT DATA/INDEX XLRA
         ALGFI R2,256             CALC NEXT (SPACEMAP)
         STG   R2,DTIXXLRA        SAVE NEXT SPACEMAP XLRA
         MVHHI SPCEBITS,X'00C0'   BYTE FOR SHIFTING B'11' (BLOCK FULL)
         JAS   R14,SPCESET        SET THE SPACEMAP BLOCK BITS
         L     R4,VSAMSPCE        R4=SPACEMAP BLOCK ADDRESS
         USING ZVSAMHDR,R4
         CGHSI BHDRPREV,-1        IS THERE A PREVIOUS SPACEMAP BLOCK ?
         JE    SPCENPRV           EXIT IF NONE
* READ THE PREVIOUS SPACEMAP BLOCK AND UPDATE BHDRNEXT
         LG    R1,BHDRPREV        R1=XLRA OF PREVIOUS SPACEMAP BLOCK
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGFR R1,R7              * (ADJUSTED) DATA/INDEX BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
         CIH   R7,C'IIII'         INDEX SPACEMAP ?
         JE    SPCEIDX1           EXIT IF IT IS
* REWRITE PREVIOUS DATA SPACEMAP BLOCK
         POINT DTAINOUT,RBA=WORK1 POINT TO PREVIOUS SPACEMAP BLOCK
         L     R4,VSAMPREV        R4=PREVIOUS BLOCK ADDRESS
         MVC   DTAINOUT+DCBREC-IHADCB(4),VSAMPREV SAVE PRV SPC BLK ADDR
         JAS   R14,READDTIO       READ PREVIOUS SPACEMAP BLOCK
         MVC   BHDRNEXT,DTIXXLRA  SET PREVIOUS NEXT
         POINT DTAINOUT,RBA=WORK1 POINT TO PREVIOUS DATA BLOCK
         MVC   DTAINOUT+DCBREC-IHADCB(4),VSAMPREV SAVE PRV DTA BLK ADDR
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,DTAINOUT     REWRITE PREVIOUS DATA BLOCK
         CHECK (R1)               CHECK
         J     SPCEDOLD           EXIT
*
SPCEIDX1 DS    0H
* REWRITE PREVIOUS INDEX SPACEMAP BLOCK
         LARL  R1,IDXINOUT        BASE-FREE
         POINT IDXINOUT,RBA=WORK1 POINT TO PREV INDEX SPACEMAP BLOCK
         L     R4,VSAMPREV        R4=PREVIOUS BLOCK ADDRESS
         LR    R0,R1              BASE-FREE
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         READ  (R1),,(R0),(R4)    READ PREVIOUS INDEX BLOCK
         CHECK (R1)               CHECK
         MVC   BHDRNEXT,DTIXXLRA  SET PREVIOUS NEXT
         POINT IDXINOUT,RBA=WORK1 POINT TO PREVIOUS INDEX BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,IDXINOUT,(R4) WRITE INDEX PREFIX BLOCK
         CHECK (R1)               CHECK
SPCEDOLD DS    0H
         LG    R1,BHDRSELF        R1=PREVIOUS XLRA
* BHDRPREV
         L     R4,VSAMSPCE        BASE FOR HDR
         STG   R1,BHDRPREV        SAVE PREVIOUS XLRA
SPCENPRV DS    0H
* CALC POINT POSITION AND WRITE SPACEMAP BLOCK
* BHDRSELF
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         STG   R1,BHDRSELF        R1=OUR XLRA
         STG   R1,WORK6           SAVE IT FOR NEXT BHDRPREV
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGFR R1,R7              * (ADJUSTED) DATA/INDEX BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
         CIH   R7,C'IIII'         INDEX SPACEMAP ?
         JE    SPCEIDX2           EXIT IF IT IS
* WRITE DATA SPACEMAP BLOCK
         POINT DTAINOUT,RBA=WORK1 POINT TO DATA SPACEMAP BLOCK
         ST    R7,WORK1+8         SAVE LENGTH
         L     R5,VSAMSPCE        R5=DATA SPACEMAP BLOCK ADDRESS
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,DTAINOUT,(R5) WRITE DATA SPACEMAP BLOCK
         CHECK (R1)               CHECK
         J     SPCENEW            EXIT
*
SPCEIDX2 DS    0H
* WRITE INDEX SPACEMAP BLOCK
         POINT IDXINOUT,RBA=WORK1 POINT TO INDEX SPACEMAP BLOCK
         ST    R7,WORK1+8         SAVE LENGTH
         L     R5,VSAMSPCE        R5=INDEX SPACEMAP BLOCK ADDRESS
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,IDXINOUT,(R5) WRITE INDEX SPACEMAP BLOCK
         CHECK (R1)               CHECK
SPCENEW  DS    0H
         AGSI  SPCEADJ,2          COMPENSATE FOR LAST 4 MAPBITS
         ASI   SMCOUNT,1          COUNT DATA SPACEMAP BLOCKS
* UPDATE THE DATA/INDEX PREFIX BLOCK
         L     R5,VSAMPRFX        R5=PREFIX BLOCK ADDRESS
         AHI   R5,BHDRLENG        R5=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R5
* PFXBMAP
         CGHSI PFXBMAP,-1         FIRST SPACEMAP BLOCK SET ?
         JNE   SPCENFST           EXIT IF SET
         MVC   PFXBMAP,DTIXXLRA   SET FIRST SPACEMAP BLOCK
SPCENFST DS    0H
* PFXEMAP
         MVC   PFXEMAP,DTIXXLRA   SET LAST SPACEMAP BLOCK
* PFXMAPNW
         MVC   PFXMAPNW,DTIXXLRA  SET LAST SPACEMAP USED
         DROP  R5
         CLI   EOFFLAG,X'FF'      HAS EOF OCCURRED ?
         JE    SPCEDUN            EXIT IF IT HAS
* BUILD NEW SPACEMAP BLOCK
         MVHI  SPCEHIGH,0         CLEAR HIGHEST SPACEMAP ADDRESS
* CLEAR SPACEMAP BLOCK
         L     R6,VSAMSPCE        R6=SPACEMAP BLOCK ADDRESS
         LR    R8,R1              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R6,R8,X'00'        CLEAR SPACEMAP BLOCK
         L     R4,VSAMSPCE        R4=SPACEMAP BLOCK ADDRESS
* INITIALISE SPACEMAP BLOCK
         JAS   R14,BUILDHDR       BUILD HDR BLOCK
* BHDRFLG1
         MVI   BHDRFLG1,BHDR_MAP  SET SPACEMAP BLOCK
* BHDRPREV
         MVC   BHDRPREV,WORK6     SET PREV BLOCK XLRA
* MAPXLRA
* ORIGIN IS THE NEXT BLOCK WRITTEN
         AHIK  R5,R4,BHDRLENG     R5=ADDRESS AFTER HEADER
         USING ZVSAMMAP,R5
         LG    R9,DTIXXLRA        R9=SPACEMAP ORIGIN XLRA
         ALGFI R9,256             R9=NEXT BLOCK NUMBER
         STG   R9,MAPXLRA         NEXT BLOCK BEGINS THIS SPACEMAP
         DROP  R5
         L     R4,WORK1+8         R4=BLKSIZE
         L     R5,VSAMSPCE        R5=SPACEMAP START ADDRESS
         JAS   R14,BUILDFTR       BUILD SPACEMAP FTR BLOCK
SPCEDUN  DS    0H
         LM    R0,R15,SPCEREGS    RESTORE REGS
         BR    R14                RETURN
*
SPCESET  DS    0H
* SET THE BITS IN THE CURRENT SPACEMAP
*
* INPUT: SPCEBITS HAVE THE BIT SETTINGS
*
* RETURNS: R5=ADDRESS OF BYTE LAST SET
*
* DESTROYS: R0 R1 R2 R5
         LGF   R5,VSAMSPCE        R5=SPACEMAP BLOCK
         AGHI  R5,BHDRLENG        R5=START OF ZVSAMMAP
         USING ZVSAMMAP,R5
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         SG    R1,MAPXLRA         -SPACEMAP ORIGIN BLOCK NUMBER
         DROP  R5
         SRLG  R1,R1,8+2          SHIFT OUT RECORD NO., /4 FOR BYTE NO.
         AGHI  R5,L'MAPXLRA       R5=START OF MAPBITS
         AGR   R5,R1              R5=CORRECT BYTE
         C     R5,SPCEHIGH        HIGHEST SPACEMAP BYTE ?
         JNH   SPCENH             EXIT IF NOT
         ST    R5,SPCEHIGH        SAVE HIGHER ONE
SPCENH   DS    0H
         LG    R2,DTIXXLRA        R2=CURRENT XLRA
         SRLG  R2,R2,8            SHIFT OUT RECORD NUMBER
         AG    R2,SPCEADJ         ADJUST BY 2 FOR EACH WRITTEN SPACEMAP
         NG    R2,SPCE2BIT        LEAVE LAST 2 BITS
         AGR   R2,R2              *2 FOR BIT SHIFT
         IC    R0,0(R5)           R0=ORIGINAL BYTE
         LHI   R1,X'FF3F'         R1=LOW BYTE FOR SHIFTING 'AND'
         SRA   R1,0(R2)           SHIFT TO CORRECT POSITION
         NR    R0,R1              KILL ANY EXISTING BITS
         LH    R1,SPCEBITS        R1=LOW BYTE FOR SHIFTING 'OR'
         SRL   R1,0(R2)           SHIFT TO CORRECT POSITION
         OR    R0,R1              'OR' NEW BITS
         STC   R0,0(R5)           SAVE IN SPACEMAP
         BR    R14                RETURN
*
ELIXCALC DS    0H
* CALC MAX NO. OF ELEMENTS FOR A GIVEN BLKSIZE
*
* INPUT: R2=BLKSIZE
*
* DESTROYS: R3 R4 R5 R6 R7 R8
*
* RETURNS: R8=MAX NO. OF ELEMENTS
         LR    R5,R2              R5=CURRENT BLKSIZE
         AHI   R5,-(BHDRLENG+4+BFTRLENG) -HDR-COUNT-FTR
         LR    R7,R5              SAVE IT
         SR    R3,R3              CLEAR R3
         ICM   R3,B'0001',VXXXDFS R5=DATA FREESPACE%
         JZ    ELIXNFS1           EXIT IF ZERO
         MSR   R5,R3              * FREESPACE %
         SR    R4,R4              PREPARE FOR DIVIDE
         D     R4,CNST0100        / 100
         SR    R7,R5              R7=AVAILABLE SPACE
ELIXNFS1 DS    0H
         L     R5,AIXNBSXL        R5=ELEMENT LENGTH
         AHI   R5,8               +XLRA LENGTH
         SR    R6,R6              PREPARE FOR DIVIDE
         DR    R6,R5              R7=NO. OF ELIX ENTRIES IN BLKSIZE
         LR    R8,R7              SAVE IT
* CALC NO. OF AIX ELEMENTS IN A MIDDLE BLOCK
         LR    R5,R2              R5=CURRENT BLKSIZE
         AHI   R5,-(BHDRLENG+RPTRLENG*2+SPXLENG+BFTRLENG)
*                                  -(HDR+RPTR+RPTREND+SPXLENG+BFTRLENG)
         LR    R7,R5              SAVE IT
         LTR   R3,R3              ANY DATA FREESPACE% ?
         JZ    ELIXNFS2           EXIT IF ZERO
         MSR   R5,R3              * FREESPACE %
         SR    R4,R4              PREPARE FOR DIVIDE
         D     R4,CNST0100        / 100
         SR    R7,R5              R7=AVAILABLE SPACE
ELIXNFS2 DS    0H
         SR    R6,R6              PREPARE FOR DIVIDE
         D     R6,AIXNBSXL        R7=NO. OF ELEMENTS WE CAN FIT
         MSR   R8,R7              R8=MAX. ELEMENTS FOR AN ELIX
         BR    R14                RETURN
*
AIXNINST DS    0H
* INSERT NON-UNIQUE RECORD INTO A BLOCK, THEN SHIFT BUFFER UP
*
* FOR FIRST, MIDDLE AND LAST AN ENTRY IS PUT IN THE ELIX BLOCK WHICH
* IS LAST ELEMENT+XLRA. NOT DONE FOR KNOWN SIZE
*
* SPX IS BUILT BEFORE IF NEEDED
*
* WHOLE RECORD
*    RLF+AIXKEY+COUNT+COUNT*ELEMENTS
*
* FIRST SEGMENT
*    SPX+RLF+AIXKEY+COUNT+SEGCOUNT*ELEMENTS
*
* MIDDLE AND LAST SEGMENTS
*    SPX+SEGCOUNT*ELEMENTS
*
* INPUT: R0=KNOWN NO. OF ELEMENTS (RUBBISH IF UNKNOWN SIZE)
*        R1=RECORD LENGTH(KNOWN SIZE) OR X'7FFFFFFF'(UNKNOWN SIZE)
*        R2 POINTS TO AIXKEY
*        R8 IS INSERT POINT
*        SEGTYPE   W, F, M, L
*        AIXNDCNT  NO. OF ELEMENTS TO MOVE AND SHIFT
*        VSAMAIXN  ORIGIN OF NON-UNIQUE BUFFER
*        VXXXLMAX  L'AIXKEY+L'ELEMENT
*
* OUTPUT:AIXNBFIL  ORIGIN OF FILL POINT
*        AIXNLENG  SPACE AVAILABLE FOR NEW RECORDS=AIXNDCNT*VXXXLMAX
*
* DESTROYS: R0 R1 R2 R3 R5 R7 R8 R9 R10
         STRL  R14,AIXNSV14       SAVE R14
         CLI   SEGTYPE,SEGFRST    FIRST SEGMENT ?
         JNE   AIXNNFST           EXIT IF NOT
* FIRST SEGMENT
         MVHI  AIXNMEGC,0         CLEAR UNKNOWN SIZE COUNT
AIXNNFST DS    0H
* SAVE MAXIMUM VARIABLE SIZE
         CFI   R1,X'7FFFFFFF'     SPECIAL VALUE FOR UNKNOWN SIZE ?
         JE    AIXNNTMX           EXIT IF IT IS
         C     R1,MAXVARSZ        BIGGEST MAXIMUM VARIABLE LENGTH ?
         JNH   AIXNAVRL           EXIT IF NOT
         ST    R1,MAXVARSZ        SAVE IT
AIXNAVRL DS    0H
         LG    R7,TOTRCSZD        R7=TOTAL DATA RECORD LENGTHS
         AGFR  R7,R1              +THIS ONE
         STG   R7,TOTRCSZD        SAVE IT
AIXNNTMX DS    0H
* DON'T PUT RLF, AIXKEY OR COUNT INTO MIDDLE OR LAST SEGMENTS
         L     R7,AIXNDCNT        R7=NO. OF ELEMENTS TO MOVE
         CLI   SEGTYPE,SEGMIDL    MIDDLE SEGMENT ?
         JE    AIXNNRAC           EXIT IF IT IS
         CLI   SEGTYPE,SEGLAST    LAST SEGMENT ?
         JE    AIXNNRAC           EXIT IF IT IS
* RLF
         ST    R1,0(R8)           SAVE AS RLF
         AHI   R8,4               BUMP INPUT BUFFER POINTER
* AIXKEY
         L     R1,AIXNKEYL        R1=L'AIXKEY-1
         EXRL  R1,AIXNMOVX        MOVE AIX KEY
         A     R8,AIXNKEYL        BUMP INPUT
         AHI   R8,1                          BUFFER POINTER
* COUNT
         ST    R0,0(R8)           SAVE COUNT (BASEKEYS/XLRAS)
         CLI   AIXNMEGA,X'FF'     BIG RECORD, UNKNOWN SIZE ?
         JNE   AIXNKNW2           EXIT IF NOT
* BIG RECORD, UNKNOWN SIZE
         MVHI  0(R8),-1           SET COUNT TO FOXES
AIXNKNW2 DS    0H
         AHI   R8,4               BUMP INPUT BUFFER POINTER
AIXNNRAC DS    0H
* ACCUMULATE COUNT AND DECREMENT FROM TOTAL
         L     R5,AIXNTRAK        R5=NO. OF ELEMENTS LEFT
         SR    R5,R7              -USED ELEMENTS
         ST    R5,AIXNTRAK        SAVE REMAINING NO. OF ELEMENTS
         A     R7,AIXNMEGC        ADD FOR UNKNOWN SIZE
         ST    R7,AIXNMEGC        SAVE RUNNING TOTAL
* MOVE CALCULATED NO. OF ELEMENTS
         L     R7,VSAMAIXN        R7=AIX NON-UNIQUE BUFFER ADDRESS
         A     R7,AIXNKEYL        R7=ADDRESS OF
         AHI   R7,1                             ELEMENT (BASEKEY/XLRA)
         L     R5,AIXNDCNT        R8=NO. OF ELEMENTS
         L     R14,AIXNBSXL       R14=L'ELEMENT (BASEKEY/XLRA)
         AHI   R14,-1             -1 FOR EXECUTE
AIXNLOPD DS    0H
         EXRL  R14,AIXNMOVT       MOVE ELEMENT
         A     R8,AIXNBSXL        BUMP OVER INPUT ELEMENT
         A     R7,VXXXLMAX        NEXT BUFFER ELEMENT (BASEKEY/XLRA)
         JCT   R5,AIXNLOPD        LOOP
*
         CLI   SEGTYPE,SEGWHOLE   WHOLE ?
         JE    AIXNSHFT           EXIT IF IT IS
         CLI   SEGELIXL,X'FF'     HAS ELIX FOR LAST SEGMENT BEEN DONE ?
         MVI   SEGELIXL,0         RESET INDICATOR
         JE    AIXNSHFT           EXIT IF IT HAS
* INSERT ENTRY INTO ELIX BLOCK
* ONLY THE ELEMENT IS INSERTED HERE, XLRA DONE ELSEWHERE
         S     R8,AIXNBSXL        POINT TO LAST ELEMENT
         L     R2,VSAMELIX        R2=ELIX BLOCK
         L     R3,BHDRLENG(R2)    R3=COUNT
         CLI   SEGTYPE,C'F'       FIRST ?
         JNE   AIXNNTFS           EXIT IF NOT
         LA    R1,BHDRLENG+4(R2)  R1=FIRST ELEMENT POSITION
         J     AIXNELXM           EXIT
*
AIXNNTFS DS    0H
* ELIX ENTRY IS MIDDLE OR LAST
         L     R1,AIXNBSXL        R1=ELEMENT LENGTH
         AHI   R1,8               +XLRA LENGTH
         MSR   R1,R3              R1=OFFSET OF NEXT ELEMENT
         AR    R1,R2              R1=ADDRESS OF
         AHI   R1,BHDRLENG+4                    NEXT ELEMENT
AIXNELXM DS    0H
         EXRL  R14,AIXNMOV2       MOVE LAST ELEMENT INTO ELIX
AIXNSHFT DS    0H
* SHIFT BUFFER UP
         L     R2,VSAMAIXN        DESTINATION POINT
         L     R3,AIXNDCNT        R3=NO. OF AIX RECORDS
         MS    R3,VXXXLMAX        R3=LENGTH OF N AIX RECORDS
         ST    R3,AIXNLENG        SAVE AS REMAINING LENGTH
         ARK   R8,R2,R3           R8=SOURCE POINT
         L     R1,AIXNBFSZ        R1=NON-UNIQUE BUFFER SIZE
         SR    R0,R0              PREPARE FOR DIVIDE
         D     R0,VXXXLMAX        /L'AIXREC R1=AIXRECS IN BUFFER
         S     R1,AIXNDCNT        -NO. USED
         MS    R1,VXXXLMAX        *L'AIXREC=BYTES TO MOVE
         LR    R3,R1              SET FIRST LENGTH
         LR    R9,R1              SET SECOND LENGTH
         MVCL  R2,R8              SHIFT BUFFER UP
         A     R1,VSAMAIXN        CALC BUFFER ORIGIN FOR LOAD
         ST    R1,AIXNBFIL        SAVE IT
         LRL   R14,AIXNSV14       RESTORE R14
         BR    R14                RETURN
AIXNMOVX MVC   0(0,R8),0(R2)      MOVE AIX KEY
AIXNMOVT MVC   0(0,R8),0(R7)      MOVE ELEMENT
AIXNMOV2 MVC   0(0,R1),0(R8)      MOVE LAST ELEMENT INTO ELIX
AIXNSV14 DS    F                  R14 SAVE
*
DATAWRIT DS    0H
* ABOUT TO WRITE DATA BLOCK
* READ THE PREVIOUS ONE (IF PRESENT) AND UPDATE BHDRNEXT
*
* INPUT: R4 POINTS TO DATA BLOCK
*
* DESTROYS R1,R5
         SLLG  R14,R14,32         SAVE RETURN ADDRESS IN R14 HIGH
         JAS   R14,SETSBITS       SET SPCEBITS
         CLOSE DTAINOUT           CLOSE DATA FILE
         OPEN  (DTAINOUT,(UPDATE)) OPEN VSAM INPUT DATA DCB
         LG    R1,BHDRPREV        R1=XLRA OF PREVIOUS DATA BLOCK
         CGFI  R1,-1              IS THERE A PREVIOUS DATA BLOCK ?
         JE    DATANPRV           EXIT IF NONE
* READ THE PREVIOUS DATA BLOCK AND UPDATE BHDRNEXT
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
         POINT DTAINOUT,RBA=WORK1 POINT TO PREVIOUS DATA BLOCK
         L     R4,VSAMPREV        R5=PREVIOUS BLOCK ADDRESS
         MVC   DTAINOUT+DCBREC-IHADCB(4),VSAMPREV SAVE PRV DTA BLK ADDR
         JAS   R14,READDTIO       READ PREVIOUS DATA BLOCK
         MVC   BHDRNEXT,DTIXXLRA  SET PREVIOUS NEXT
* WRITE PREVIOUS DATA BLOCK
         POINT DTAINOUT,RBA=WORK1 POINT TO PREVIOUS DATA BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,DTAINOUT,(R4) WRITE PREVIOUS DATA BLOCK
         CHECK (R1)               CHECK
DATANPRV DS    0H
* CALC POINT POSITION AND WRITE DATA BLOCK
* BHDRSELF
         L     R4,VSAMDATA        R4=DATA BLOCK ADDRESS
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         STG   R1,BHDRSELF        SAVE CURRENT XLRA
         STG   R1,VSAMDTAX        SAVE NEW PREVIOUS DATA BLOCK
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
* SUM FREESPACE FOR CTRAVSPAC
         LG    R1,TOTFREED        R1=TOTAL DATA FREESPACE
         AGF   R1,BHDRFREE        +THIS ONE
         STG   R1,TOTFREED        SAVE IT
         DROP  R4
         L     R5,VSAMPRFX        R5=DATA PREFIX BLOCK ADDRESS
         USING ZVSAMHDR,R5
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
         CLI   BHDR#REC-ZVSAMHDR(R4),0 EMPTY BLOCK ?
         JE    DATAENRB           EXIT IF IT IS
* CTRHALCRBA...TAKEN AS BLOCKRBA+1 OF HIGHEST DATA BLOCK WITH DATA
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         AGHI  R1,1               +1 BLOCK
         MSGF  R1,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         STG   R1,CTRHALCRBA      SET CTRHALCRBA SO FAR
DATAENRB DS    0H
* CTRENDRBA....DATA...BLOCKRBA+1 OF HIGHEST DATA BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         AGHI  R1,1               +1 BLOCK
         MSGF  R1,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         STG   R1,CTRENDRBA       SET CTRENDRBA SO FAR
* CTRNLOGR.....NO. OF RECORDS WRITTEN
         LG    R1,CTRNLOGR        R1=NO. OF RECORDS
         LLGC  R0,BHDR#REC-ZVSAMHDR(R4) R0=NO. OF RECORDS THIS BLOCK
         AGR   R1,R0              R1=NO. OF RECORDS SO FAR
         STG   R1,CTRNLOGR        SET CTRNLOGR SO FAR
* WRITE CURRENT DATA BLOCK
         POINT DTAINOUT,RBA=WORK1 POINT TO DATA BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,DTAINOUT,(R4) WRITE DATA BLOCK
         CHECK (R1)               CHECK
         ASI   DBCOUNT,1          COUNT DATA BLOCKS
         ASI   DBINSERT,1         COUNT DATA BLOCKS FOR FREEBLOCKS
* UPDATE THE DATA PREFIX BLOCK
* PFXBDATA
         CGHSI PFXBDATA,-1        FIRST DATA BLOCK SET ?
         JNE   DATANFST           EXIT IF SET
         MVC   PFXBDATA,DTIXXLRA  SET XLRA OF FIRST DATA BLOCK
DATANFST DS    0H
* PFXEDATA
         MVC   PFXEDATA,DTIXXLRA  SET XLRA OF HIGHEST DATA BLOCK
         DROP  R5
         USING ZVSAMHDR,R4
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
         SRLG  R14,R14,32         RESTORE R14
         BR    R14                RETURN
*
INDXWRIT DS    0H
* ABOUT TO WRITE DEST INDEX BLOCK
* READ THE PREVIOUS ONE (IF PRESENT) AND UPDATE BHDRNEXT
*
* DESTROYS R1,R5
         CLOSE IDXINOUT           CLOSE INDEX FILE
         OPEN  (IDXINOUT,(UPDATE)) OPEN VSAM INOUT INDEX DCB
         LG    R1,BHDRPREV        R1=XLRA OF PREVIOUS INDEX BLOCK
         CGFI  R1,-1              IS THERE A PREVIOUS INDEX BLOCK ?
         JE    INDXNPRV           EXIT IF NONE
* READ THE PREVIOUS DEST INDEX BLOCK AND UPDATE BHDRNEXT
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
         POINT IDXINOUT,RBA=WORK1 POINT TO PREVIOUS INDEX BLOCK
         L     R4,VSAMPREV        R4=PREVIOUS BLOCK ADDRESS
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         READ  (R1),,IDXINOUT,(R4) READ PREVIOUS INDEX BLOCK
         CHECK (R1)               CHECK
         MVC   BHDRNEXT,DTIXXLRA  SET PREVIOUS NEXT
         POINT IDXINOUT,RBA=WORK1 POINT TO PREVIOUS INDEX BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,IDXINOUT,(R4) WRITE PREVIOUS INDEX BLOCK
         CHECK (R1)               CHECK
INDXNPRV DS    0H
* CALC POINT POSITION AND WRITE DEST INDEX BLOCK
* BHDRSELF
         L     R4,VSAMIDXN        R4=DEST INDEX BLOCK ADDRESS
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         STG   R1,BHDRSELF        SAVE CURRENT XLRA
         STG   R1,VSAMIDXX        SAVE NEW PREVIOUS INDEX BLOCK
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
* SUM FREESPACE FOR CTRAVSPAC
         LG    R1,TOTFREEI        R1=TOTAL INDEX FREESPACE
         AGF   R1,BHDRFREE        +THIS ONE
         STG   R1,TOTFREEI        SAVE IT
         DROP  R4
         L     R5,VSAMPRFX        R5=INDEX PREFIX BLOCK ADDRESS
         USING ZVSAMHDR,R5
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
         CLI   BHDR#REC-ZVSAMHDR(R4),0 EMPTY BLOCK ?
         JE    INDXENRB           EXIT IF IT IS
* CTRHALCRBA...TAKEN AS BLOCKRBA+1 OF HIGHEST INDEX BLOCK WITH INDEX
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         AGHI  R1,1               +1 BLOCK
         MSGF  R1,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         STG   R1,CTRHALCRBA      SET CTRHALCRBA SO FAR
INDXENRB DS    0H
* CTRENDRBA....INDEX...BLOCKRBA+1 OF HIGHEST INDEX BLOCK
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         AGHI  R1,1               +1 BLOCK
         MSGF  R1,TRUIBKSZ        * (ADJUSTED) INDEX BLKSIZE
         STG   R1,CTRENDRBA       SET CTRENDRBA SO FAR
* CTRNLOGR.....NO. OF RECORDS WRITTEN
         LG    R1,CTRNLOGR        R1=NO. OF RECORDS
         LLGC  R0,BHDR#REC-ZVSAMHDR(R4) R0=NO. OF RECORDS THIS BLOCK
         AGR   R1,R0              R1=NO. OF RECORDS SO FAR
         STG   R1,CTRNLOGR        SET CTRNLOGR SO FAR
         DROP  R5
         USING ZVSAMHDR,R4
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
         POINT IDXINOUT,RBA=WORK1 POINT TO INDEX BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,IDXINOUT,(R4) WRITE INDEX BLOCK
         CHECK (R1)               CHECK
         ASI   IXCOUNT,1          COUNT INDEX BLOCKS
         ASI   IXINSERT,1         COUNT INDEX BLOCKS FOR FREEBLOCKS
         BR    R14                RETURN
*
SEGMWRIT DS    0H
* ABOUT TO WRITE A SEGMENT BLOCK
*
* IF THE PREVIOUS BLOCK IS A DATA BLOCK IN STORAGE, UPDATE SPXBNEXT
*
* READ THE PREVIOUS ONE (IF PRESENT) AND UPDATE BHDRNEXT
*
* IF THERE IS AN ELIX BLOCK (NON-UNIQUE AIX) THEN UPDATE IT WITH THE
* LAST ELEMENT
*
* AFTER WRITE, RESET THE BLOCK TO EMPTY
*
* DESTROYS: R0 R1 R5
         SLLG  R14,R14,32         SAVE RETURN ADDRESS IN R14 HIGH
         CLOSE DTAINOUT           CLOSE DATA FILE
         OPEN  (DTAINOUT,(UPDATE)) OPEN VSAM INPUT DATA DCB
         L     R4,VSAMSEGM        R4=SEGMENT BLOCK
         JAS   R14,SETSBITS       SET SPCEBITS
         CLI   SEGDTUPD,0         DATA BLOCK SPXBNEXT NOT SET ?
         JNE   SEGMDTOK           EXIT IF SET
* PREVIOUS SEGMENT IS IN A DATA BLOCK IN STORAGE (FIRST)
* UPDATE SPXBNEXT
         L     R1,SEGDTSPX        R1=DATA BLOCK SPX ADDRESS
         USING ZVSAMSPX,R1
         MVC   SPXBNEXT,DTIXXLRA  SET SPXBNEXT
         MVI   SPXBNEXT+7,X'01'   SET RECORD NUMBER 1
         DROP  R1
         MVI   SEGDTUPD,X'FF'     MARK DATA BLOCK SPXBNEXT SET
SEGMDTOK DS    0H
* MAINTAIN CHAIN OF ALL SEGMENT BLOCKS (MIDDLES/LASTS)
* BHDRPREV
         LG    R1,VSAMSEGX        R1=PREVIOUS SEGMENT XLRA
         STG   R1,BHDRPREV        SET PREVIOUS SEGMENT XLRA
         CGFI  R1,-1              ANY PREVIOUS SEGMENT BLOCK ?
         JE    SEGMNPRV           EXIT IF NOT
* READ THE PREVIOUS SEGMENT BLOCK AND UPDATE BHDRNEXT
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
         POINT DTAINOUT,RBA=WORK1 POINT TO PREVIOUS SEGMENT BLOCK
         L     R4,VSAMPREV        R4=PREVIOUS SEGMENT BLOCK ADDRESS
         MVC   DTAINOUT+DCBREC-IHADCB(4),VSAMPREV SAVE PRV SEG BLK ADDR
         JAS   R14,READDTIO       READ PREVIOUS SEGMENT BLOCK
* BHDRNEXT (PREVIOUS SEGMENT BLOCK)
         MVC   BHDRNEXT,DTIXXLRA  SET PREVIOUS NEXT
* WRITE PREVIOUS SEGMENT BLOCK
         L     R4,VSAMPREV        R4=PREVIOUS SEGMENT BLOCK ADDRESS
         POINT DTAINOUT,RBA=WORK1 POINT TO PREVIOUS SEGMENT BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,DTAINOUT,(R4) WRITE PREVIOUS SEGMENT BLOCK
         CHECK (R1)               CHECK
SEGMNPRV DS    0H
         L     R4,VSAMSEGM        R4=SEGMENT BLOCK
* CALC POINT POSITION AND WRITE SEGMENT BLOCK
* BHDRSELF
         LG    R1,DTIXXLRA        R1=CURRENT XLRA
         STG   R1,BHDRSELF        SAVE CURRENT XLRA
         STG   R1,VSAMSEGX        SAVE NEW PREVIOUS SEGMENT BLOCK
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R1,4096            + PREFIX BLKSIZE
         STG   R1,WORK1           SAVE IT
         POINT DTAINOUT,RBA=WORK1 POINT TO SEGMENT BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,DTAINOUT,(R4) WRITE SEGMENT BLOCK
         CHECK (R1)               CHECK
         ASI   SGCOUNT,1          COUNT SEGMENT BLOCKS
         ICM   R5,15,VSAMELIX     ANY ELIX BLOCK ?
         JZ    SEGMNOEX           EXIT IF NONE
* ELIX BLOCK EXISTS
         CLI   AIXNMEGA,X'FF'     BIG RECORD, UNKNOWN SIZE ?
         JNE   SEGMNOEX           EXIT IF NOT
* ELIX BLOCK EXISTS AND UNKNOWN SIZE
* UPDATE THE ELIX BLOCK ENTRY WITH XLRA
         L     R0,BHDRLENG(R5)    R0=COUNT
         L     R1,AIXNBSXL        R1=ELEMENT LENGTH
         AHI   R1,8               +XLRA LENGTH
         MSR   R1,R0              R1=OFFSET OF NEXT ELEMENT
         AR    R1,R5              R1=ADDRESS OF
         AHI   R1,BHDRLENG+4                    NEXT ELEMENT
         A     R1,AIXNBSXL        POINT AFTER THE ELEMENT
         MVC   0(8,R1),BHDRSELF   MOVE THE XLRA
         MVI   7(R1),X'01'        SET REC=01
         AHI   R0,1               ELIX COUNT+1
         ST    R0,BHDRLENG(R5)    SAVE IT
SEGMNOEX DS    0H
* UPDATE THE DATA PREFIX BLOCK
         L     R5,VSAMPRFX        R5=DATA PREFIX BLOCK ADDRESS
         AHI   R5,BHDRLENG        R5=BASE OF PREFIX BLOCK
         USING ZVSAMPFX,R5
* PFXBSEGM
         CGHSI PFXBSEGM,-1        FIRST SEGMENT BLOCK SET ?
         JNE   SEGMNFST           EXIT IF SET
         MVC   PFXBSEGM,DTIXXLRA  SET XLRA OF FIRST SEGMENT BLOCK
SEGMNFST DS    0H
* PFXESEGM
         MVC   PFXESEGM,DTIXXLRA  SET XLRA OF HIGHEST SEGMENT BLOCK
         DROP  R5
         SRLG  R14,R14,32         RESTORE R14
         BR    R14                RETURN
*
ELIXWRIT DS    0H
* WRITE ELIX BLOCK THEN RESET IT
*
* INPUT: R1=CURRENT XLRA
*
* DESTROYS: R1 R4 R5 R8 R9
         SLLG  R14,R14,32         SAVE RETURN ADDRESS IN R14 HIGH
         LGR   R8,R1              R8=CURRENT XLRA
         CLOSE DTAINOUT           CLOSE DATA FILE
         OPEN  (DTAINOUT,(UPDATE)) OPEN VSAM INPUT DATA DCB
         L     R4,VSAMELIX        R4=ELIX BLOCK
         JAS   R14,SETSBITS       SET SPCEBITS
         SRLG  R8,R8,8            SHIFT OUT RECORD NUMBER
         MSGF  R8,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R8,4096            + PREFIX BLKSIZE
         STG   R8,WORK1           SAVE IT
* WRITE ELIX BLOCK
         POINT DTAINOUT,RBA=WORK1 POINT TO ELIX BLOCK
         LA    R1,ZREPDECB        R1=DECB ADDRESS
         WRITE (R1),,DTAINOUT,(R4) WRITE ELIX BLOCK
         CHECK (R1)               CHECK
         ASI   EXCOUNT,1          COUNT ELIX BLOCKS
* RESET ELIX BLOCK
         L     R5,TRUDBKSZ        R5=(ADJUSTED) DATA BLKSIZE
         AHI   R4,BHDRLENG        POINT TO ELIX COUNT
         MVHI  0(R4),1            SET TO 1 (FIRST)
         AHI   R4,4               R4=AREA AFTER COUNT
         AHI   R5,-(BHDRLENG+4+BFTRLENG) -(BHDR+COUNT+BFTR)=LEN TO CLR
         LR    R8,R4              AREA TO CLEAR
         SR    R9,R9              CLEAR SECOND LENGTH
         MVCLE R4,R8,X'00'        CLEAR ELIX BLOCK
         SRLG  R14,R14,32         RESTORE R14
         BR    R14                RETURN
*
SETSBITS DS    0H
* SETTING SPCEBITS
*    SEGMENT AND ELIX BLOCKS...........00C0
*    FREESPACE ZERO....................00C0
*       ELSE
*    FIXED NON-SPANNED.....RECLEN+4....0080  RPTR=4
*                          ELSE........00C0
*    VARIABLE NON-SPANNED..9+ BYTES....0040  RLF+RPTR+1 BYTE REC=9
*                          ELSE........00C0
*    FIXED SPANNED.........16+ BYTES...0080  SPX+RPTR=16
*                          ELSE........00C0
*    VARIABLE SPANNED......20+ BYTES...0080  SPX+RLF+RPTR=20
*                          ELSE........00C0
*
* DESTROYS R0,R1
         MVHHI SPCEBITS,X'00C0'   BYTE FOR SHIFTING B'11' (BLOCK FULL)
         TM    BHDRFLG1,BHDR_SEG  SEGMENT BLOCK ?
         BOR   R14                RETURN IF IT IS
         TM    BHDRFLG2,BHDR_ELX  ELIX BLOCK ?
         BOR   R14                RETURN IF IT IS
         ICM   R1,15,BHDRFREE     R1=TOTAL FREESPACE
         BZR   R14                RETURN IF ZERO
* SOME FREESPACE
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JO    DATAFRSP           EXIT IF IT IS
* SOME FREESPACE AND NON-SPANNED
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    DATAFRV            EXIT IF IT IS
* SOME FREESPACE AND FIXED NON-SPANNED
         L     R0,VXXXLMAX        R0=RECORD LENGTH
         AHI   R0,RPTRLENG        +RPTR
         CR    R1,R0              ENOUGH SPACE ?
         BLR   R14                RETURN IF NOT
         MVHHI SPCEBITS,X'0080'   BYTE FOR SHIFTING B'10' (ALLOCATED)
         BR    R14                RETURN
*
DATAFRV  DS    0H
* SOME FREESPACE AND VARIABLE NON-SPANNED
         LHI   R0,RPTRLENG+4+1    R0=RPTR+RLF+1 BYTE RECORD
         CR    R1,R0              ENOUGH SPACE ?
         BLR   R14                RETURN IF NOT
         MVHHI SPCEBITS,X'0040'   BYTE FOR SHIFTING B'01' (BLOCK PART)
         BR    R14                RETURN
*
DATAFRSP DS    0H
* SOME FREESPACE AND SPANNED
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JO    DATAFRVS           EXIT IF IT IS
* SOME FREESPACE AND FIXED SPANNED
         LHI   R0,SPXLENG+RPTRLENG R0=SPX+RPTR
         CR    R1,R0              ENOUGH SPACE ?
         BLR   R14                RETURN IF NOT
         MVHHI SPCEBITS,X'0080'   BYTE FOR SHIFTING B'10' (ALLOCATED)
         BR    R14                RETURN
*
DATAFRVS DS    0H
* SOME FREESPACE AND VARIABLE SPANNED
         LHI   R0,SPXLENG+4+RPTRLENG R0=SPX+RLF+RPTR
         CR    R1,R0              ENOUGH SPACE ?
         BLR   R14                RETURN IF NOT
         MVHHI SPCEBITS,X'0080'   BYTE FOR SHIFTING B'10' (ALLOCATED)
         BR    R14                RETURN
*
UNSPAN   DS    0H
* REBUILD A SPANNED RECORD INTO VSAMINBF
*
* USES VSAMPREV AS SEGMENT BUFFER
*
* FOR AIX OR INDEX BUILD, WE CAN USE THE RLF
* VERY LARGE LRECL MIGHT BUST THE GETMAIN
*
* FOR UNLOAD, IT WILL DO TESTS TO MAKE SURE THE RLF<32767
* AND <VXXXLMAX
*
* INPUT:
*    R8 POINTS TO FIRST SEGMENT (SPX)
*       NOTE: THIS IS IN BUFFER FROM VSAMDATA
*    R9 DATARPTR IS BASE FOR RPTR
*
* OUTPUT:
*   R8 POINTS TO VSAMINBF
*
* USES    : R0 R1 R2 R3 R5 R6 R7 R9
         STM   R2,R9,UNSPNREG     SAVE REGS R2-R9
         SLLG  R14,R14,32         SAVE RETURN ADDRESS IN R14 HIGH
         L     R2,VSAMINBF        R2=RECORD BLOCK ADDRESS
         LTR   R2,R2              DO WE HAVE ONE ?
         JNZ   UNSPNLP            EXIT IF WE DO
* GETMAIN BLOCKS FOR THE SPANNED RECORD
         L     R6,VAXXLMAX        R6=MAXIMUM RECORD SIZE
         GETMAIN RU,LV=(R6)
         ST    R1,VSAMINBF        SAVE FIXED SPANNED BLOCK ADDRESS
         LR    R2,R1              R2=RECORD BLOCK ADDRESS
         L     R6,TRUDBKSZ        R6=(ADJUSTED) DATA BLKSIZE
         GETMAIN RU,LV=(R6)
         ST    R1,VSAMPREV        SAVE PREVIOUS BLOCK ADDRESS
UNSPNLP  DS    0H
         USING ZVSAMSPX,R8
         LR    R7,R8              SAVE SPX POINTER
         L     R5,SPXSEGLN        R5=SEGMENT LENGTH (INC. SPX)
         AHI   R5,-SPXLENG        R5=TRUE SEGMENT LENGTH
         AHI   R8,SPXLENG         BUMP RECORD POINTER
         LR    R3,R5              R3=LENGTH TO MOVE
         LR    R9,R5              R9=LENGTH TO MOVE
         MVCL  R2,R8              MOVE RECORD SEGMENT
         LR    R8,R7              RESTORE SPX POINTER
         CGHSI SPXBNEXT,-1        ANY NEXT SEGMENT ?
         JE    UNSPNDUN           EXIT IF NONE
         L     R4,VSAMPREV        R4=SEGMENT BLOCK ADDRESS
         LLC   R9,SPXBNEXT+7      R9=RECORD NUMBER
         AHI   R9,-1              -1
         MHI   R9,RPTRLENG        * RPTR LENGTH
         AHI   R9,BHDRLENG        R9=RPTR OFFSET
         AR    R9,R4              R9=RPTR ADDRESS IN SEGMENT BLOCK
         LG    R6,SPXBNEXT        R6=XLRA OF NEXT SEGMENT
         SRLG  R6,R6,8            SHIFT OUT RECORD NUMBER
         MSGF  R6,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R6,4096            + PREFIX SIZE
         STG   R6,WORK1           SAVE IT
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JE    UNSPNAIX           EXIT IF IT IS
         POINT DTAINOUT,RBA=WORK1 POINT TO NEXT DATA SEGMENT BLOCK
         MVC   DTAINOUT+DCBREC-IHADCB(4),VSAMPREV SAVE NXT SEG BLK ADDR
         JAS   R14,READDTIO       READ NEXT SEGMENT BLOCK
         J     UNSPNOFF           EXIT
*
UNSPNAIX DS    0H
* AIX
         POINT DTAIN,RBA=WORK1    POINT TO NEXT DATA SEGMENT BLOCK
         GET   DTAIN,(R4)         GET NEXT SEGMENT BLOCK
UNSPNOFF DS    0H
         L     R8,DATARPTR.RPTRREC@ R8=OFFSET TO RECORD
         DROP  DATARPTR
         AR    R8,R4              R8=POINTER TO RECORD (SPX)
         J     UNSPNLP            LOOP
*
UNSPNDUN DS    0H
         LM    R2,R9,UNSPNREG     RESTORE REGS R2-R9
         L     R8,VSAMINBF        R8=RECORD BLOCK ADDRESS
         DROP  R8
         SRLG  R14,R14,32         RESTORE R14
         BR    R14                RETURN
*
DOLOWKEY DS    0H
* SET CTRLOKEY@ IN PREFIX BLOCK
*
* INPUT: LOKEYPTR POINTS TO LOW KEY
*
* DESTROYS: R6 R7 R15
         CLI   LOKEYIND,X'FF'     LOW KEY ALREADY SET ?
         BER   R14                RETURN IF IT IS
         SLLG  R4,R4,32           SAVE R4 IN R4 HIGH
* SET CTRLOKEY@ POINTER AND DATA
         L     R4,VSAMPRFX        R4=PREFIX BLOCK ADDRESS
         L     R6,PFXKYLEN        R6=KEY LENGTH
         LH    R7,PFXXPAT@        R7=LAST OFFSET
         AR    R7,R4              R7=LAST ADDRESS
         AH    R7,0(R7)           R7=NEXT ADDRESS
         AHI   R6,2               INCLUDE LENGTH
         STH   R6,0(R7)           SAVE LENGTH
         AHI   R6,-3              LENGTH OF ELEMENT-1 FOR EXECUTE
         L     R15,LOKEYPTR       R15=LOW KEY POINTER
         EXRL  R6,MVCLOKEY        MOVE ELEMENT
         SR    R7,R4              R7=DATA OFFSET
         STH   R7,CTRLOKEY@       SAVE OFFSET
         L     R7,BHDRFRE@        R7=CURRENT FREESPACE OFFSET
         AHI   R6,3               R6=TOTAL LENGTH OF LOW KEY
         AR    R7,R6              R7=NEW FREESPACE OFFSET
         ST    R7,BHDRFRE@        SAVE IT
         L     R7,BHDRFREE        R7=TOTAL FREESPACE
         SR    R7,R6              R7=NEW TOTAL FREESPACE
         ST    R7,BHDRFREE        SAVE IT
         MVI   LOKEYIND,X'FF'     LOW KEY HAS BEEN SET
         SRLG  R4,R4,32           RESTORE R4
         BR    R14                RETURN
MVCLOKEY MVC   2(0,R7),0(R15)     MOVE ELEMENT
*
DATAAREA DS    0H
* QSAM INFILE (LOAD)
INFILEQ  DCB   DDNAME=INFILE,RECFM=F,LRECL=0,MACRF=GM,EODAD=EOFDTA
*
* QSAM OUTFILE (UNLOAD)
OUTFILEQ DCB   DDNAME=OUTFILE,RECFM=F,LRECL=0,MACRF=PM
*
* VSAM DTA INFILE (FOR AIX CREATION, UNLOAD AND VERIFY)
DTAIN    DCB   DSNAME=VSAMDTAI,RECFM=F,LRECL=0,MACRF=GM
*
* VSAM DTA IN/OUTFILE (FOR DATA AND AIX CREATION)
DTAINOUT DCB   DSNAME=VSAMDTAO,RECFM=F,LRECL=0,MACRF=RW
*
* VSAM IDX IN/OUTFILE (FOR INDEX CREATION AND LEVEL BUILD)
IDXINOUT DCB   DSNAME=VSAMIDXO,RECFM=F,LRECL=0,MACRF=RW
*
WTOHEAD  DC    AL2(WTOHEDEN-*,0)
         DC    C'zREPRO UTILITY V1'
WTOHEDEN EQU   *
*
WTOLOAD  DC    AL2(WTOQTVEN-*,0)
         DC    C'zREPRO LOAD'
WTOQTVEN EQU   *
*
WTOUNLOD DC    AL2(WTOVTQEN-*,0)
         DC    C'zREPRO UNLOAD'
WTOVTQEN EQU   *
*
WTOVERFY DC    AL2(WTOVVEEN-*,0)
         DC    C'zREPRO VERIFY'
WTOVVEEN EQU   *
*
WTOBDAIX DC    AL2(WTOAXBEN-*,0)
         DC    C'zREPRO BUILDAIX'
WTOAXBEN EQU   *
*
WTOINFO  DC    AL2(WTOINFEN-*,0)
         DC    C'zREPRO '
QVSAM    DC    C'QSAM  (RECFM='    QSAM INPUT
RECFMOVF DC    C'XX'
         DC    C' LRECL'
DLRECL   DC    X'4020202020202020'
         DC    C') TO VSAM ('     VSAM OUTPUT
VARFIX   DC    C'FIXED    '       FIXED OR VARIABLE
XXDS     DC    C'KSDS '           KSDS, ESDS, RRDS, AIXU, AIXN
NSPAN    DC    C'NONSPANNED)'     SPANNED OR NONSPANNED
WTOINFEN EQU   *
*
WTOENDOK DC    AL2(WTOTEKEN-*,0)
         DC    C'zREPRO '
WTOENTYP DC    CL8' '             TYPE
         DC    C' ENDED OK'
WTOTEKEN EQU   *
*
WTOOPEND DC    AL2(WTOOPNEN-*,0)
OPENMSG  DC    CL30' '
FILEDSN  DC    XL128'00'
WTOOPNEN EQU   *
*
WTOINP   DC    C'zREPRO INPUT FILE OPENED     :'
WTOINPVD DC    C'zREPRO INPUT DTA FILE OPENED :'
WTOINPVI DC    C'zREPRO INPUT IDX FILE OPENED :'
WTOOUT   DC    C'zREPRO OUTPUT FILE OPENED    :'
WTOOUTDT DC    C'zREPRO OUTPUT DTA FILE OPENED:'
WTOOUTIX DC    C'zREPRO OUTPUT IDX FILE OPENED:'
*
* SET= VARIABLES
INQSAMDD DC    C'INQSAM',X'00'    GETENV INQSAM
OUTQSMDD DC    C'OUTQSAM',X'00'   GETENV OUTQSAM
INVSAMDD DC    C'INVSAM',X'00'    GETENV INVSAM
OUTVSMDD DC    C'OUTVSAM',X'00'   GETENV OUTVSAM
GETENVI  DC    A(0)               INPUT GETENV ADDRESS
GETENVO  DC    A(0)               OUTPUT GETENV ADDRESS
*
* NEXT 2 TOGETHER
VSAMCLSI DC    CL8' '             INPUT CLUSTER NAME
VSAMCADI DC    AL4(0)             INPUT CLUSTER CATALOG ADDRESS
* NEXT 2 TOGETHER
VSAMCLSO DC    CL8' '             OUTPUT CLUSTER/INDEX NAME
VSAMCADO DC    AL4(0)             OUTPUT CLUSTER CATALOG ADDRESS
*
* NEXT 2 TOGETHER
VSAMDTAI DC    XL128'00'          INPUT PATH\CLUSTER.DTA
VSAMIDXI DC    XL128'00'          INPUT PATH\CLUSTER.IDX (FOR VERIFY)
* NEXT 2 TOGETHER
VSAMDTAO DC    XL128'00'          OUTPUT PATH\CLUSTER.DTA
VSAMIDXO DC    XL128'00'          OUTPUT PATH\CLUSTER.IDX
*
VSAMINBF DC    AL4(0)             ADDRESS OF VAR OR SPANNED INPUT BLOCK
*                                 ALSO USED BY UNLOAD TO BUILD RECORD
VSAMNULL DC    AL4(0)             ADDRESS OF RRDS NULL BLOCK, FIX SPAN
VSAMPRFX DC    AL4(0)             ADDRESS OF PREFIX BLOCK
VSAMSPCE DC    AL4(0)             ADDRESS OF SPACEMAP BLOCK
VSAMDATA DC    AL4(0)             ADDRESS OF DATA BLOCK
VSAMSEGM DC    AL4(0)             ADDRESS OF SEGMENT BLOCK
VSAMELIX DC    AL4(0)             ADDRESS OF ELIX BLOCK
VSAMIDXN DC    AL4(0)             ADDRESS OF NEXT INDEX BLOCK LEVEL
VSAMIDXP DC    AL4(0)             ADDRESS OF PREV INDEX BLOCK LEVEL
VSAMPREV DC    AL4(0)             ADDRESS OF PREV BLOCK (ALL)
* AIX NON-UNIQUE FIELDS
VSAMAIXN DC    AL4(0)             ADDRESS OF AIX NON-UNIQUE BUFFER
AIXNKEYL DC    FL4'0'             AIX KEYLENGTH-1(FOR EX)
AIXNBFIL DC    AL4(0)             BUFFER FILL POINT
AIXNBEND DC    AL4(0)             BUFFER END POINT
AIXNBFSZ DC    AL4(0)             CALCULATED BUFFER LENGTH
AIXNLENG DC    AL4(0)             BUFFER LENGTH REMAINING
AIXNTRAK DC    AL4(0)             BUFFER END RECORD COUNT
AIXNDCNT DC    AL4(0)             COUNT OF DUPLICATES
AIXNBSXL DC    AL4(0)             L'BASEKEY(KSDS) OR 8(ESDS)
AIXNMEGA DC    X'00'              FF=BIG RECORD, UNKNOWN SIZE
AIXNMEGC DC    AL4(0)             ELEMENT COUNT WHEN AIXNMEGA=FF
AIXNRECL DC    AL4(0)             RECORD SIZE WHEN WE RE-ENTER NON-U
         DC    AL4(0)             NON-DUPLICATE LOCATION, ALSO AIXKEY
*
VSAMDTAX DC    FL8'-1'            LAST DATA BLOCK XLRA
VSAMIDXX DC    FL8'-1'            LAST INDEX BLOCK XLRA
VSAMSEGX DC    FL8'-1'            LAST SEGMENT BLOCK XLRA
*
DTIXXLRA DC    XL8'00'            NEXT BLOCK XLRA
*
RDCOUNT  DC    XL4'00'            DATA RECORD COUNT
RICOUNT  DC    XL4'00'            INDEX RECORD COUNT
DBCOUNT  DC    XL4'00'            DATA BLOCK COUNT
SGCOUNT  DC    XL4'00'            SEGMENT BLOCK COUNT
EXCOUNT  DC    XL4'00'            ELIX BLOCK COUNT
SMCOUNT  DC    XL4'00'            SPACEMAP BLOCK COUNT
IXCOUNT  DC    XL4'00'            TOTAL NO. OF INDEX BLOCKS AT LEVEL n
TXCOUNT  DC    XL4'00'            TOTAL NO. OF INDEX BLOCKS
RRCOUNT  DC    XL4'00'            TOTAL NO. OF EMPTY RRDS SLOTS
MAXVARSZ DC    XL4'00'            MAXIMUM VARIABLE LENGTH RECORD
TOTRCSZD DC    XL8'00'            TOTAL DATA REC LENGTHS FOR CTRAVGRL
TOTRCSZI DC    XL8'00'            TOTAL INDEX REC LENGTHS FOR CTRAVGRL
TOTFREED DC    XL8'00'            TOTAL DATA FREESPACE FOR CTRAVSPAC
TOTFREEI DC    XL8'00'            TOTAL INDEX FREESPACE FOR CTRAVSPAC
DATA#REC DC    XL4'01'            DATA RECORD NUMBER
*
DBINSERT DC    XL4'00'            DATA BLOCK COUNT FOR FREEBLOCKS
IXINSERT DC    XL4'00'            INDEX BLOCK COUNT FOR FREEBLOCKS
*
RRDSSLOT DC    8X'FF'             RRDS CURRENT SLOT NO.
RRDSEMTY DC    XL8'00'            RRDS EMPTY SLOT TRACKER
RRDSNULL DC    F'4'               NULL RECORD FOR EMPTY SLOTS
RRDSNFLG DC    X'00'              FF=NULL RECORD ADDRESSED
RRDSFLAG DC    X'FF'              FF=RRDS RECORD WRITTEN, GET NEXT
*
SEGLEFT  DC    XL4'00'            REMAINING SEGMENT SIZE
SEGTYPE  DC    X'00'              TYPE OF SEGMENT BLOCK BEING WRITTEN
SEGWHOLE EQU   C'W'                  WHOLE
SEGFRST  EQU   C'F'                  FIRST
SEGMIDL  EQU   C'M'                  MIDDLE
SEGLAST  EQU   C'L'                  LAST
SEGDTUPD DC    X'00'              FF=DATA BLOCK SPXBNEXT HAS BEEN SET
SEGELIXL DC    X'00'              FF=ELIX FOR LAST SEGMENT HAS BEEN SET
SEGDTSPX DC    AL4(0)             ADDRESS OF DATA BLOCK SPX
* SPACEMAP FIELDS
SPCEBITS DC    X'0000'            BITS TO SET IN SPACEMAP
SPCEDATA DC    X'0000'            DATA BITS TO SET IN SPACEMAP
SPCEHIGH DC    XL4'00'            ADDRESS OF HIGHEST SPACEMAP BYTE
SPCEEND  DC    XL4'00'            ADDRESS OF SPACEMAP FTR-1
SPCEADJ  DC    XL8'00'            SPACEMAP BLOCK NUMBER ADJUST
SPCE2BIT DC    XL8'03'            SPACEMAP BIT LOCATOR
SPCEREGS DS    16XL4              REG SAVE AREA
*
ITYPE    DC    C' '               I=INFILE O=OUTFILE A=AIX
EOFFLAG  DC    X'00'              FE=AIX INPUT EOF BUT BUFFER HAS RECS
*                                 FF=INPUT EOF
IDXFLAG  DC    X'00'              FF=NEED ANOTHER LEVEL
IDXLEVEL DC    X'00'              INDEX LEVEL
IDXLEVFL DC    X'00'              FF=LEVEL BLOCK FULL
IDXSTATE DC    X'00'              INDEX STATUS FLAG
IDXLIMIT EQU   X'80'                 REACHED LIMIT
IDXFULL  EQU   X'40'                 REACHED LIMIT (BLOCK FULL)
IDXDBLOK EQU   X'20'                 END OF DATA BLOCK
IDXDEOF  EQU   X'10'                 END OF DATA FILE
IDXRRN   DC    XL8'00'            RRDS SLOT NUMBER FOR IDX
IDXXRBA  DC    XL8'00'            XRBA FOR IDX
*
RECDEFER DC    X'00'              FF=RECORD WRITE DEFERRED
*                                 FE=EMPTY RRDS WRITE DEFERRED
*                                 FD=RE-ENTER NON-UNQ AFT WRTE FULL BLK
*                                 FC=RE-ENTER NON-UNQ AFT FIRST/MIDDLE
*                                 FB=RE-ENTER NON-UNQ AFT WRT FRST KNWN
*                                 FA=RE-ENTER SPANNED AFTER FIRST WRITE
*                                 F9=RE-ENTER NON-UNQ AFT WRT FRST UNKN
*
TRUDBKSZ DC    XL4'00'            (ADJUSTED) DATA BLKSIZE
TRUIBKSZ DC    XL4'00'            (ADJUSTED) INDEX BLKSIZE
MINSPACD DC    XL4'00'            MINIMUM DATA FREESPACE
MAXIDX   DC    X'FF'              MAXIMUM RECORDS IN INDEX BLOCK
RECIDX   DC    X'FF'              RECORDS IN INDEX BLOCK
*
* CANNOT TEST FOR NULL KEY IF FIRST NOT RECORDED AS A NULL KEY IS VALID
KEY1IND  DC    X'FF'              FF=FIRST KEY NOT PROCESSED
*
* AREAS COPIED FROM VCLR, VAIX OR PFX
*
VXXXFLG1 DS    X                  COPY OF VCLRFLG1/VAIXFLG1
VXXXFLG2 DS    X                  COPY OF VCLRFLG2/---
VXXXDFS  DS    X                  COPY OF VCLRDFS /VAIXDFS
VXXXIFS  DS    X                  COPY OF VCLRIFS /VAIXIFS
VXXXLMAX DS    F                  COPY OF VCLRLMAX/AIX KEY+BASE KEY
VAXXLMAX DS    F                  COPY OF VCLRLMAX FOR AIX ON SPANNED
VXXXKLEN DS    F                  COPY OF VCLRKLEN/VAIXKLEN
VXXXKOFF DS    F                  COPY OF VCLRKOFF/VAIXKOFF
VXXXDTAA DS    A                  COPY OF VCLRDTAA/VAIXDTAA
VXXXIDXA DS    A                  COPY OF VCLRIDXA/VAIXIDXA
VXXXDBS  DS    F                  COPY OF VCLRDBS /VAIXDBS
VXXXIBS  DS    F                  COPY OF VCLRIBS /VAIXIBS
VXXXDNB  DS    XL2                COPY OF VCLRDNB /VAIXDNB
VXXXDFB  DS    XL2                COPY OF VCLRDFB /VAIXDFB
VXXXINB  DS    XL2                COPY OF VCLRINB /VAIXINB
VXXXIFB  DS    XL2                COPY OF VCLRIFB /VAIXIFB
VXXXAIXN DS    X                  COPY OF VCLRAIXN
VXXXMAXE DS    F                  COPY OF VAIXMAXE
*
PXXFFLGS DS    X                  COPY OF DATA PFXFFLGS FOR AIX
PXXRFLGS DS    X                  COPY OF DATA PFXRFLGS FOR AIX
* WORK AREAS
WORK1    DS    CL29
WORK2    DC    9C'0'
WORK3    DC    D'0'
WORK4    DC    XL15'00'           FORM DATA  LL,FILE.SFX X'00'
WORK5    DC    XL15'00'           FORM INDEX LL,FILE.SFX X'00'
WORK6    DS    XL8
WORK7    DS    XL16
WORK8    DS    XL8
*
BEGTIME  DS    AL4                START TIME IN 0.01 SECS
MINEDIT  DC    X'40202120'
SECEDIT  DC    X'402120204B2020'
STCK     DS    AL8                STCK VALUE FOR PREFIX BLOCKS
* CONSTANTS
CNSTLOAD DC    C'LOAD'
CNSTVERF DC    C'VERIFY'
CNSTUNLD DC    C'UNLOAD'
CNSTBDAX DC    C'BUILDAIX'
CNSTAIXU DC    C'AIXU'
CNSTVARB DC    C'VARIABLE'
CNSTSPAN DC    CL10'SPANNED'
CNSTHDR  DC    C'HDR'
CNSTFTR  DC    C'FTR'
CNST1024 DC    AL4(1024)
CNST0100 DC    AL4(100)
CNSTP000 DC    PL2'0'
CNSTP4G  DC    P'4294967295'
CNSTEDW1 DC    X'40202120'
CNSTEDW2 DC    X'4020202020202020'
*
* UNLOAD FIELDS
UNLDEOF  DC    X'1A'
UNLDRRN  DC    XL8'00'
* UNSPAN SUBROUTINE FIELDS
UNSPNREG DS    8F
* DOLOWKEY SUBROUTINE FIELDS
LOKEYPTR DS    A                  POINTER TO LOW KEY
LOKEYIND DC    X'00'              FF=LOW KEY ALREADY SET
*
         DS    0H
WTOINFOU DC    AL2(WTOINUEN-*,0)
         DC    C'zREPRO '
         DC    C'VSAM  ('         VSAM INPUT
WTOINFS  DS    0H
         DC    C'FIXED    '       FIXED OR VARIABLE
         DC    C'KSDS '           KSDS, ESDS, RRDS, AIXU, AIXN
         DC    C'NONSPANNED) '    SPANNED OR NONSPANNED
         DC    C'TO QSAM (RECFM=' QSAM OUTPUT
         DC    C'XX'
         DC    C' LRECL'
         DC    X'4020202020202020'
         DC    C')'
WTOINUEN EQU   *
*
WTOINFOV DC    AL2(WTOINVEN-*,0)
         DC    C'zREPRO '
         DC    C'VSAM  ('         VSAM INPUT
WTOINFSV DS    0H
         DC    C'FIXED    '       FIXED OR VARIABLE
         DC    C'KSDS '           KSDS, ESDS, RRDS, AIXU, AIXN
         DC    C'NONSPANNED)'     SPANNED OR NONSPANNED
WTOINVEN EQU   *
*
WTOTIME  DC    AL2(WTOTMEEN-*,0)
         DC    C'zREPRO TOTAL TIME = '
ELAPSED  DC    C'999:59.99'
WTOTMEEN EQU   *
*
WTOBASRC DC    AL2(WTOBRCEN-*,0)
         DC    C'zREPRO BASE CLUSTER RECORDS   '
BASERECS DC    X'402020202020202020202120'
WTOBRCEN EQU   *
*
WTOBADFM DC    AL2(WTOBDFRM-*,0)
         DC    C'zREPRO INVALID VSAM DSN FORMAT CODE='
BADFMCDE DS    C
* CODE=1  CANNOT FIND DOT SEPARATOR
* CODE=2  CATALOG NAME LENGTH ERROR
* CODE=3  INPUT CATALOG NAME NOT EQUAL TO OUTPUT
* CODE=4  CATALOG PATH MISSING
* CODE=5  CATALOG LOAD FAILED
* CODE=6  CATALOG VERSION ERROR
* CODE=7  CLUSTER EXTRACTION FAILED
* CODE=8  CLUSTER NAME LENGTH ERROR
* CODE=9  CLUSTER.SUFFIX LENGTH ERROR
* CODE=A  ERROR IN DPAT/XPAT EXTRACTION
WTOBDFRM EQU   *
*
WTOBADCL DC    AL2(WTOBDCEN-*,0)
         DC    C'zREPRO CLUSTER NOT FOUND IN CATALOG'
WTOBDCEN EQU   *
*
WTOSEQ   DC    AL2(WTOSEQEN-*,0)
         DC    C'zREPRO SEQUENCE ERROR'
WTOSEQEN EQU   *
*
WTOBADKY DC    AL2(WTOBDKEN-*,0)
WTOKEY   DC    XL128'00'
WTOBDKEN EQU   *
*
WTOIBKSZ DC    AL2(WTOIBKEN-*,0)
         DC    C'zREPRO INDEX BLKSIZE              '
IBLKSIZE DC    X'4020202020202020'
WTOIBKEN EQU   *
*
WTOIMXRC DC    AL2(WTOIMXEN-*,0)
         DC    C'zREPRO MAX INDEX RECORDS/BLOCK    '
IMAXRECS DC    X'4020202020202020'
WTOIMXEN EQU   *
*
WTOIFSPC DC    AL2(WTOIFSEN-*,0)
         DC    C'zREPRO INDEX FREESPACE %              '
IFSPERCT DC    X'40202120'
         DC    C'%'
WTOIFSEN EQU   *
*
WTOIFBLK DC    AL2(WTOIFBEN-*,0)
         DC    C'zREPRO INDEX FREE BLOCKS: '
IFREENUM DC    X'402020202120'
         DC    C' AFTER EVERY'
IFREEBLK DC    X'402020202120'
WTOIFBEN EQU   *
*
WTOIBKAJ DC    AL2(WTOIBJEN-*,0)
         DC    C'zREPRO ADJUSTED INDEX BLKSIZE     '
IBAJSIZE DC    X'4020202020202020'
WTOIBJEN EQU   *
*
WTOILDRC DC    AL2(WTOILDEN-*,0)
         DC    C'zREPRO LOADED INDEX RECORDS/BLOCK '
ILODRECS DC    X'4020202020202020'
WTOILDEN EQU   *
*
WTOIBLOK DC    AL2(WTOIBNEN-*,0)
         DC    C'zREPRO INDEX BLOCKS (L'
ILEVEL   DC    X'40202120'
         DC    C')       '
IBLOCKS  DC    X'4020202020202020'
WTOIBNEN EQU   *
*
WTOISBLK DC    AL2(WTOISBEN-*,0)
         DC    C'zREPRO INDEX SPACEMAP BLOCKS      '
ISBLOCKS DC    X'4020202020202020'
WTOISBEN EQU   *
*
WTOIXSIZ DC    AL2(WTOIXZEN-*,0)
         DC    C'zREPRO INDEX FILE SIZE        '
IDXSIZE  DC    X'402020202020202020202120'
WTOIXZEN EQU   *
*
VCDTADDR DC    A(0)               CATALOG LOAD ADDRESS
VSAMCATG DC    XL9'00'            CATALOG NAME X'00'
VSAMCATL DS    H                  CATALOG NAME LENGTH
VSAMCLSL DS    H                  OUTPUT CLUSTER/INDEX NAME LENGTH
VSAMDSN  DC    XL128'00'          CATALOG PATH/NAME
*
DOTDTA   DC    C'.DTA',X'00'
DOTIDX   DC    C'.IDX',X'00'
*
ZREPDECB DC    F'0'               DECBECB
*                                     X'40'=OK
*                                     X'41'=I/O ERROR
*                                     X'42'=EOF
         DC    H'0'               DECBTYPE
         DC    AL2(DECBL)         DECBLEN
         DC    A(0)               DECBDCBA OPEN DCB WITH MACRF R OR RW
         DC    A(0)               DECBAREA AREA FOR BLOCK >= DCBBLKSI
*
KEYPREV  DC    XL128'00'          PREVIOUS KEY FOR SEQUENCE CHECK
KEYNEXT  DC    XL128'00'          NEXT KEY FOR SEQUENCE CHECK
*
FINDSTOP DC    256X'00'
         ORG   FINDSTOP+X'00'
         DC    X'FF'              STOP ON SOURCE NULL
         ORG   FINDSTOP+C'.'
FINDDOT  DC    C'.'               STOP ON SOURCE DOT
         ORG   FINDSTOP+C'['
         DC    C'['               STOP ON SOURCE OPEN SQUARE BRACKET
         ORG
*
******************
* ERROR MESSAGES *
******************
WTOBADUN DC    AL2(WTOBDUNL-*,0)
         DC    C'zREPRO UNLOAD NOT VALID FOR AIX'
WTOBDUNL EQU   *
*
BADRECFM DS    0H
* QSAM IS FIXED, VSAM IS VARIABLE
* QSAM IS VARIABLE, VSAM IS FIXED
         WTO   'zREPRO INPUT AND OUTPUT HAVE DIFFERENT RECFM'
         J     BADRETN            EXIT
*
BADQSAMO DS    0H
         WTO   'zREPRO INVALID QSAM OVERRIDE'
         J     BADRETN            EXIT
*
BADSETFX DS    0H
         WTO   'zREPRO INVALID FIXED INPUT QSAM RECFM'
         J     BADRETN            EXIT
*
BADSETVR DS    0H
         WTO   'zREPRO INVALID VARIABLE QSAM RECFM'
         J     BADRETN            EXIT
*
BADOPENQ DS    0H
         WTO   'zREPRO QSAM INPUT FILE OPEN FAILED'
         J     BADRETN            EXIT
*
BADOPEND DS    0H
         WTO   'zREPRO OUTPUT DATA FILE OPEN FAILED'
         J     BADRETN            EXIT
*
BADOPENI DS    0H
         WTO   'zREPRO INPUT DATA FILE OPEN FAILED'
         J     BADRETN            EXIT
*
BADOPENX DS    0H
         WTO   'zREPRO INDEX FILE OPEN FAILED'
         J     BADRETN            EXIT
*
BADFIT   DS    0H
         WTO   'zREPRO LRECL EXCEEDS FREESPACE'
         J     BADRETN            EXIT
*
BADFITX  DS    0H
         WTO   'zREPRO INDEX RECORD EXCEEDS FREESPACE'
         J     BADRETN            EXIT
*
BADSLOT  DS    0H
         WTO   'zREPRO RRN EXCEEDS 4GB'
         J     BADRETN            EXIT
*
BADRRNSQ DS    0H
         WTO   'zREPRO RRN NOT IN ASCENDING SEQUENCE'
         J     BADRETN            EXIT
*
BADVSAM  DS    0H
* WTO INVALID VSAM DSN FORMAT CODE=NN
         WTO   MF=(E,WTOBADFM)    SHOW IT
BADRETN  DS    0H
         SUBEXIT RC=15
*
BADUNLD  DS    0H
         WTO   'zREPRO UNLOAD FAILED: VARIABLE RECORD TOO LARGE'
         J     BADRETN            EXIT
*
UNLOAD   DS    0H
**********
* UNLOAD *
**********
* AT PRESENT, AN AIX (AS A VARIABLE SPANNED FILE) WILL NOT BE
* CONSIDERED VALID FOR UNLOAD, BECAUSE THE MAXIMUM RECORD SIZE
* IS NOT IN THE CATALOG
* IT COULD BE CONSIDERED IF I WROTE MAXVAR INTO THE PREFIX BLOCK
* AND THAT WAS MAINTAINED FOR ANY AIX UPDATES
*
         L     R5,GETENVO         R5=OUTPUT QSAM PATH ADDRESS
* PROCESS QSAM ENVIRONMENT VARIABLE
*
* FORM THE DSN IN THE ENVIRONMENT VARIABLE
* SET OUTQSAM=E:\Z390\CICS\VSAM\MYFILE8F.TXT[RECFM=FT]
         MVI   FINDDOT,0          DON'T FIND DOT
         TRT   0(128,R5),FINDSTOP FIND X'00' [
         MVI   FINDDOT,C'.'       RESET DOT
         CLI   0(R1),C'['         GOT AN OVERRIDE ?
         JNE   PROCQENU           EXIT IF NOT
         MVI   0(R1),0            TERMINATE QSAM DSNAME FOR OPEN
* E:\Z390\ZVSAM\MYFILE8F.TXT X'00'[RECFM=FT]
         LARL  R4,WTOINFS         R4=BASE FOR INFO LINE
         USING WTOINFDS,R4
         CLC   1(6,R1),WTOQVSAM+9 ANY RECFM= OVERRIDE ?
         JNE   BADQSAMO           ERROR IF NOT
* RECFM OVERRIDE VALIDATION
         CHHSI 7(R1),C'VT'        VARIABLE TRANSLATE ?
         JNE   QSAMNVTU           EXIT IF NOT
         MVHHI WTORECFM,C'VT'     SET IT FOR WTO
         J     PROCQENU           EXIT
*
QSAMNVTU DS    0H
         CHHSI 7(R1),C'FT'        FIXED TRANSLATE ?
         JNE   BADQSAMO           ERROR IF NOT
         MVHHI WTORECFM,C'FT'     SET IT FOR WTO
PROCQENU DS    0H
         ST    R5,OUTFILEQ+DCBDSNAM-IHADCB SET DSNAME
         MVI   ITYPE,C'I'         SET INPUT PROCESSING
         L     R5,GETENVI         R5=INPUT VSAM PATH ADDRESS
         JAS   R14,PROCVSAM       PROCESS VSAM, LOAD CAT, BUILD DSN
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   VQSETFIX           EXIT IF NOT
* VARIABLE
         CLI   WTORECFM,C'F'      FIXED QSAM ?
         JE    BADRECFM           ERROR IF IT IS
         MVI   OUTFILEQ+DCBRECFM-IHADCB,DCBRECFM_V SET IN DCB (DEFAULT)
         CHHSI WTORECFM,C'XX'     IS RECFM SET FROM OVERRIDE ?
         JE    UNLDVQ             EXIT IF NOT
* SET RECFM FROM OVERRIDE
         CHHSI WTORECFM,C'VT'     VARIABLE TRANSLATE ?
         JNE   BADSETVR           ERROR IF NOT
         MVI   OUTFILEQ+DCBRECFM-IHADCB,DCBRECFM_VT SET VT IN DCB
         J     UNLDVQ             EXIT
*
VQSETFIX DS    0H
* FIXED VSAM
         CLI   WTORECFM,C'V'      VARIABLE QSAM ?
         JE    BADRECFM           ERROR IF IT IS
         MVI   OUTFILEQ+DCBRECFM-IHADCB,DCBRECFM_F SET DCB (DEFAULT)
         CHHSI WTORECFM,C'XX'     IS RECFM SET FROM OVERRIDE ?
         JE    UNLDVQ             EXIT IF NOT
* SET RECFM FROM OVERRIDE
         CHHSI WTORECFM,C'FT'     FIXED TRANSLATE ?
         JNE   BADSETFX           ERROR IF NOT
         MVI   OUTFILEQ+DCBRECFM-IHADCB,DCBRECFM_FT SET FT IN DCB
UNLDVQ   DS    0H
*****************************************
* QSAM AND VSAM ARE BOTH FIXED/VARIABLE *
*****************************************
* OPEN INPUT VSAM DTA
         OPEN  (DTAIN,(INPUT))    OPEN VSAM DATA INPUT DCB
         LTR   R15,R15            OK ?
         JNZ   BADOPEND           ERROR IF NOT
* SHOW INPUT DTA FILE OPENED: PATH
         MVC   OPENMSG,WTOINPVD   MOVE 'INPUT DTA OPENED' MSG
         L     R1,GETENVI         R1=VSAM INPUT PATH ADDRESS
         JAS   R14,OPENWTO        WTO OPEN FILE
* OPEN OUTPUT QSAM
         OPEN  (OUTFILEQ,(OUTPUT)) OPEN QSAM OUTPUT
         LTR   R15,R15            OK ?
         JNZ   BADOPENQ           ERROR IF NOT
* SHOW OUTPUT FILE OPENED: PATH
         MVC   OPENMSG,WTOOUT     MOVE 'OUTPUT OPENED' MSG
         L     R1,GETENVO         R1=VSAM OUTPUT PATH ADDRESS
         JAS   R14,OPENWTO        WTO OPEN FILE
* SET UP THE INFO LINE AND DISPLAY IT
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   SETNAIXU           EXIT IF NOT
* AIX
* NOT YET VALID FOR UNLOAD, BUT LEAVING THE CODE HERE
         MVI   WTOQVSAM+3,C'V'    SET VSAM INPUT
         MVC   WTOXXDS(4),CNSTAIXU SET AIX UNIQUE
         TM    VXXXFLG1,VAIXUKEY  UNIQUE ?
         JO    SETSPANU           EXIT IF IT IS
* AIX NON-UNIQUE
         MVHHI WTORECFM,C'V '     SET AIX AS VARIABLE
         MVI   WTOXXDS+3,C'N'     SET AIX NON-UNIQUE
         MVC   WTOVRFX(8),CNSTVARB SET VARIABLE
         MVC   WTONSPAN(10),CNSTSPAN SET SPANNED
* DISPLAY UNLOAD NOT VALID FOR AIX
         WTO   MF=(E,WTOBADUN)    SHOW IT
         J     BADRETN            EXIT
*
SETNAIXU DS    0H
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JO    SETXXDSU           EXIT IF IT IS
         MVHHI WTOXXDS,C'RR'      SET RRDS
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JO    SETXXDSU           EXIT IF IT IS
         MVHHI WTOXXDS,C'ES'      SET ESDS
SETXXDSU DS    0H
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   SETNVARU           EXIT IF NOT
         MVC   WTOVRFX(8),CNSTVARB SET VARIABLE
SETNVARU DS    0H
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   SETSPANU           EXIT IF IT IS
         MVC   WTONSPAN(10),CNSTSPAN SET SPANNED
         DROP  R4
SETSPANU DS    0H
* GETMAIN 4K FOR DATA PREFIX BLOCK
         LHI   R1,4096            R1=4K
         GETMAIN RU,LV=(R1)
         ST    R1,VSAMPRFX        SAVE ADDRESS
         LR    R6,R1              R6=VSAM DATA PREFIX ADDRESS
* GET DATA PREFIX BLOCK
         LHI   R2,4096            R2=PREFIX BLOCKSIZE
         ST    R2,DTAIN+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAIN+DCBLRECLF-IHADCB SAVE LRECL
         GET   DTAIN,(R6)         GET DATA PREFIX BLOCK
         USING ZVSAMHDR,R6
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         LG    R2,PFXBDATA        R2=FIRST DATA XLRA
         MVC   TRUDBKSZ,PFXBLKSZ  SET DATA BLKSIZE
         MVC   PXXFFLGS,PFXFFLGS  COPY DATA PFXFFLGS
         MVC   PXXRFLGS,PFXRFLGS  COPY DATA PFXRFLGS
         DROP  R6
* GETMAIN DATA BLOCK
         L     R6,TRUDBKSZ        R6=(ADJUSTED) DATA BLKSIZE
         ST    R6,DTAIN+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R6,DTAIN+DCBLRECLF-IHADCB SAVE LRECL
         GETMAIN RU,LV=(R6)
         ST    R1,VSAMDATA        SAVE VSAM DATA BLOCK ADDRESS
         LR    R6,R1              R6=VSAM DATA BLOCK ADDRESS
* GETMAIN OUTPUT RECORD
* +4  FOR VARIABLE
* +10 FOR RRDS
         L     R8,VXXXLMAX        R8=MAXIMUM RECORD LENGTH
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   UNLDNVAR           EXIT IF NOT
* VARIABLE
         AHI   R8,4               +4 FOR RLF
UNLDNVAR DS    0H
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JNO   UNLDNRRD           EXIT IF NOT
* RRDS
         AHI   R8,10              +10 FOR RRN
UNLDNRRD DS    0H
         ST    R8,OUTFILEQ+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R8,OUTFILEQ+DCBLRECLF-IHADCB SAVE LRECL
         CVD   R8,WORK3           CONVERT LRECL
         LARL  R15,WTOINFS        R15=BASE FOR INFO LINE
         USING WTOINFDS,R15
         ED    WTODLREC,WORK3+4   EDIT LRECL
         MVI   WTODLREC,C'='      SET =
         DROP  R15
* DISPLAY INFO LINE
         WTO   MF=(E,WTOINFOU)    DISPLAY INFO LINE
         GETMAIN RU,LV=(R8)
         ST    R1,VSAMINBF        SAVE OUTPUT BLOCK ADDRESS
* FOR RRDS, ALLOW SPACE FOR THE RRN
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JNO   UNLDNRRN           EXIT IF NOT
* RRDS
         ASI   VSAMINBF,10        ADDRESS+10
UNLDNRRN DS    0H
* FOR SPANNED, GETMAIN AN AREA FOR SEGMENTS (UNSPAN)
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   UNLDNSPN           EXIT IF NOT
* SPANNED
         L     R8,TRUDBKSZ        R8=(ADJUSTED) DATA BLKSIZE
         GETMAIN RU,LV=(R8)
         ST    R1,VSAMPREV        SAVE PREVIOUS BLOCK ADDRESS
UNLDNSPN DS    0H
         SR    R8,R8              CLEAR R8
UNLDLOOP DS    0H
         SRLG  R2,R2,8            SHIFT OUT RECORD NUMBER
         MSGF  R2,TRUDBKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R2,4096            + PREFIX SIZE
         STG   R2,WORK1           SAVE IT
         POINT DTAIN,RBA=WORK1    POINT TO DATA BLOCK
         GET   DTAIN,(R6)         GET DATA BLOCK
         USING ZVSAMHDR,R6
         AHIK  R9,R6,BHDRLENG     R9=DATA RPTR POINTER
         USING ZVSAMRPT,R9
UNLDBLCK DS    0H
* LOOP WITHIN DATA BLOCK
         CLI   RPTRFLGS,RPTR_END  END OF DATA RPTR'S ?
         JE    UNLDENDB           EXIT IF IT IS
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JNO   UNLDNRR2           EXIT IF NOT
* RRDS
* BUILD THE RRN AND RECORD IF ACTIVE
         TM    RPTRFLGS,RPTR_MTY  ACTIVE ?
         JNO   UNLDACTV           EXIT IF IT IS
* INACTIVE
         AGSI  UNLDRRN,1          BUMP RRN
         J     UNLDBUMP           EXIT
*
UNLDACTV DS    0H
* ACTIVE RRDS RECORD
         L     R5,VSAMINBF        R5=OUTPUT BUFFER
         LG    R3,UNLDRRN         R3=CURRENT RRN
         CVDG  R3,WORK1           CONVERT TO DECIMAL
         UNPK  WORK1+16(11),WORK1+10(6) UNPACK
         OI    WORK1+26,X'F0'     SET SIGN
         L     R8,RPTRREC@        R8=OFFSET TO RECORD
         AR    R8,R6              R8=RECORD ADDRESS
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   UNLDFIXR           EXIT IF NOT
* ACTIVE AND VARIABLE RRDS
* BUILD MODIFIED RDW,RRN,RECORD
         TM    RPTRFLGS,RPTR_SEG  FIRST SEGMENT ?
         JNO   UNLDNRRS           EXIT IF NOT
* VARIABLE SPANNED RRDS
* UNSPAN INTO VSAMINBF+10
* CL10,RLF,REC TO RDW+10,RRN,REC
         IC    R2,ITYPE           SAVE ITYPE
         MVI   ITYPE,C'A'         FOOL UNSPAN INTO USING GET
         JAS   R14,UNSPAN         RECONSTRUCT A SPANNED RECORD
         STC   R2,ITYPE           RESTORE ITYPE
         L     R5,VSAMINBF        R5=UNSPANNED RECORD
         AHI   R5,-10             BACK TO BUFFER START
* TEST LIMITS
         L     R3,10(R5)          R3=RLF
         AHI   R3,10              LENGTH+10 FOR RRN
         CFI   R3,32767           MAX RDW BUSTED ?
         JH    BADUNLD            ERROR IF IT IS
         C     R3,VXXXLMAX        LARGER THAN MAX RECORD LENGTH ?
         JH    BADUNLD            ERROR IF IT IS
         ST    R3,0(R5)           SAVE RLF
         MVC   4(10,R5),WORK1+17  MOVE RRN
         J     UNLDPREP           EXIT
*
UNLDNRRS DS    0H
* VARIABLE UNSPANNED RRDS
         L     R3,0(R8)           R3=RLF
         AHI   R3,10              LENGTH+10 FOR RRN
         CFI   R3,32767           MAX RDW BUSTED ?
         JH    BADUNLD            ERROR IF IT IS
         AHI   R3,-(10+4)         R3=ACTUAL RECORD SIZE (-RRN-RLF)
         C     R3,VXXXLMAX        LARGER THAN MAX RECORD LENGTH ?
         JH    BADUNLD            ERROR IF IT IS
         AHI   R3,10+4            R3=RECORD SIZE+RRN+RLF
         ST    R3,0(R5)           SAVE RLF
         MVC   4(10,R5),WORK1+17  MOVE RRN
         L     R11,0(R8)          R11=RECORD LENGTH (INCLUDES RLF)
         AHI   R11,-4             -RLF LENGTH
         LA    R10,14(R5)         R10=DESTINATION
         LA    R0,4(R8)           R0=SOURCE
         LR    R1,R11             R1=LENGTH
         MVCL  R10,R0             MOVE VARIABLE RRDS RECORD
         J     UNLDPREP           EXIT
*
UNLDFIXR DS    0H
* ACTIVE AND FIXED RRDS
* BUILD RRN,RECORD
         TM    RPTRFLGS,RPTR_SEG  FIRST SEGMENT ?
         JNO   UNLDNRRF           EXIT IF NOT
* FIXED SPANNED RRDS
* UNSPAN INTO VSAMINBF+10
* CL10,REC TO RRN,REC
         IC    R2,ITYPE           SAVE ITYPE
         MVI   ITYPE,C'A'         FOOL UNSPAN INTO USING GET
         JAS   R14,UNSPAN         RECONSTRUCT A SPANNED RECORD
         STC   R2,ITYPE           RESTORE ITYPE
         L     R5,VSAMINBF        R5=UNSPANNED RECORD
         AHI   R5,-10             BACK TO BUFFER START
         MVC   0(10,R5),WORK1+17  MOVE RRN
         J     UNLDPREP           EXIT
*
UNLDNRRF DS    0H
* FIXED UNSPANNED RRDS
         MVC   0(10,R5),WORK1+17  MOVE RRN
         L     R11,VXXXLMAX       R11=MAXIMUM RECORD LENGTH
         LA    R10,10(R5)         R10=DESTINATION
         LR    R0,R8              R0=SOURCE
         LR    R1,R11             R1=LENGTH
         MVCL  R10,R0             MOVE FIXED RRDS RECORD
UNLDPREP DS    0H
         AGSI  UNLDRRN,1          BUMP RRN
         LR    R8,R5              R8=CONSTRUCTED RECORD
         J     UNLDPUT            EXIT
*
UNLDNRR2 DS    0H
* ESDS OR KSDS
* FIXED OR VARIABLE
         L     R8,RPTRREC@        R8=OFFSET TO RECORD
         AR    R8,R6              R8=RECORD ADDRESS
         TM    RPTRFLGS,RPTR_SEG  FIRST SEGMENT ?
         JNO   UNLDPUT            EXIT IF NOT
* SPANNED
         IC    R2,ITYPE           SAVE ITYPE
         MVI   ITYPE,C'A'         FOOL UNSPAN INTO USING GET
         JAS   R14,UNSPAN         RECONSTRUCT A SPANNED RECORD
         STC   R2,ITYPE           RESTORE ITYPE
         L     R8,VSAMINBF        R8=UNSPANNED RECORD
UNLDPUT  DS    0H
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   UNLDFIXP           EXIT IF NOT
* VARIABLE, TEST LIMITS
         L     R3,0(R8)           R3=RLF
* TESTS DONE FOR RRDS, JUST DO RLF TO RDW
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JO    UNLDDNRR           EXIT IF IT IS
         CFI   R3,32767           MAX RDW BUSTED ?
         JH    BADUNLD            ERROR IF IT IS
         AHI   R3,-4              ACTUAL RECORD LENGTH
         C     R3,VXXXLMAX        LARGER THAN MAX RECORD LENGTH ?
         JH    BADUNLD            ERROR IF IT IS
         AHI   R3,4               RESTORE LENGTH (INC. RDW)
UNLDDNRR DS    0H
         SLL   R3,16              CONVERT TO RDW
         ST    R3,0(R8)           SAVE RDW
UNLDFIXP DS    0H
         PUT   OUTFILEQ,(R8)      UNLOAD QSAM RECORD
         ASI   AIXNTRAK,1         COUNT BASE RECORDS
UNLDBUMP DS    0H
         AHI   R9,RPTRLENG        BUMP DATA RPTR POINTER
         J     UNLDBLCK           LOOP
*
UNLDENDB DS    0H
* END OF DATA RPTR'S
         LG    R2,BHDRNEXT        R2=NEXT DATA BLOCK
         CGHI  R2,-1              ANY NEXT DATA BLOCK ?
         JNE   UNLDLOOP           LOOP IF THERE IS
* WTO BASE CLUSTER RECORDS
         L     R1,AIXNTRAK        R1=NO. OF BASE CLUSTER RECORDS
         CVD   R1,WORK1           CONVERT TO DECIMAL
         ED    BASERECS,WORK1+2   EDIT NO. OF BASE CLUSTER RECORDS
         WTO   MF=(E,WTOBASRC)    SHOW IT
* NOTED FOR RPI, MACRF=PM DOESN'T WRITE AN EOF AT CLOSE
* SO WE WILL HERE TO MAKE THE LOAD INPUT=UNLOAD OUTPUT
         LA    R2,1               R2=1 FOR EOF
         ST    R2,OUTFILEQ+DCBBLKSIF-IHADCB SAVE EOF LENGTH
         ST    R2,OUTFILEQ+DCBLRECLF-IHADCB SAVE EOF LENGTH
         MVI   OUTFILEQ+DCBRECFM-IHADCB,DCBRECFM_F SET IN DCB
         PUT   OUTFILEQ,UNLDEOF   UNLOAD EOF
         CLOSE OUTFILEQ           CLOSE OUTPUT QSAM DCB
         CLOSE DTAIN              CLOSE INPUT VSAM DCB
         J     PROGEND            EXIT
         DROP  R9
*
*
VERIFY   DS    0H
**********
* VERIFY *
**********
         LARL  R1,VERBASES        BASE-FREE
         STM   R12,R13,0(R1)      SAVE MAINLINE BASES R12, R13
         LARL  R13,VERIFY         R13=BASE 1
         LAY   R10,4096(R13)      R10=BASE 2
         LAY   R11,4096(R10)      R11=BASE 3
         USING VERIFY,R13,R10,R11
***************
* VERIFY DATA *
***************
* BASES
*    R2  FOR ZVSAMRPT
*    R6 HIGH FOR VSAMDATA ) SWAPPED AS
*    R6 LOW  FOR VSAMPRFX )            NEEDED
*
* OPEN INPUT VSAM DTA
         L     R14,VEREOFAD       R14=DATA EODAD ADDRESS
         ST    R14,DTAIN+DCBEODAD-IHADCB SAVE EODAD
         OPEN  (DTAIN,(INPUT))    OPEN VSAM DATA INPUT DCB
         LTR   R15,R15            OK ?
         JNZ   BADOPEND           ERROR IF NOT
* SHOW INPUT DTA FILE OPENED: PATH
         MVC   OPENMSG,WTOINPVD   MOVE 'INPUT DTA OPENED' MSG
         L     R1,GETENVI         R1=VSAM INPUT PATH ADDRESS
         JAS   R14,OPENWTOV       WTO OPEN FILE
* SET UP THE INFO LINE AND DISPLAY IT
         LARL  R4,WTOINFSV        R4=BASE FOR INFO LINE
         USING WTOINFDS,R4
         CLI   ITYPE,C'A'         IS CLUSTER AN AIX ?
         JNE   VERNAIXU           EXIT IF NOT
* AIX
         MVC   WTOXXDS(4),CNSTAIXU SET AIX UNIQUE
         TM    VXXXFLG1,VAIXUKEY  UNIQUE ?
         JO    VERSPANU           EXIT IF IT IS
* AIX NON-UNIQUE
         MVHHI WTORECFM,C'V '     SET AIX AS VARIABLE
         MVI   WTOXXDS+3,C'N'     SET AIX NON-UNIQUE
         MVC   WTOVRFX(8),CNSTVARB SET VARIABLE
         MVC   WTONSPAN(10),CNSTSPAN SET SPANNED
         J     VERSPANU           EXIT
*
VERNAIXU DS    0H
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JO    VERXXDSU           EXIT IF IT IS
         MVHHI WTOXXDS,C'RR'      SET RRDS
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JO    VERXXDSU           EXIT IF IT IS
         MVHHI WTOXXDS,C'ES'      SET ESDS
VERXXDSU DS    0H
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   VERNVARU           EXIT IF NOT
         MVC   WTOVRFX(8),CNSTVARB SET VARIABLE
VERNVARU DS    0H
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   VERSPANU           EXIT IF NOT
         MVC   WTONSPAN(10),CNSTSPAN SET SPANNED
         DROP  R4
VERSPANU DS    0H
* DISPLAY INFO LINE
         WTO   MF=(E,WTOINFOV)    SHOW IT
* GETMAIN 4K FOR DATA PREFIX BLOCK
         LHI   R1,4096            R1=4K
         GETMAIN RU,LV=(R1)
         ST    R1,VSAMPRFX        SAVE ADDRESS
         LR    R6,R1              R6=VSAMPRFX
* GET DATA PREFIX BLOCK
         LHI   R2,4096            R2=PREFIX BLOCKSIZE
         ST    R2,DTAIN+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAIN+DCBLRECLF-IHADCB SAVE LRECL
* R6 IS NOW VSAMPRFX
         GET   DTAIN,(R6)         GET DATA PREFIX BLOCK
         USING ZVSAMHDR,R6
         USING ZVSAMPFX,ZVSAMHDR+BHDRLENG
         USING ZVSAMCTR,ZVSAMPFX+PFXLENG
         MVC   PXXFFLGS,PFXFFLGS  COPY DATA PFXFFLGS
* SET AIXNBSXL (ONLY NEEDED FOR NON-UNIQUE AIX)
         MVHI  AIXNBSXL,8         ASSUME ESDS
         TM    PFXFFLGS,PFX_ESDS  ESDS ?
         JO    VERESDS            EXIT IF NOT
         L     R2,PFXRCLEN        R2=RECORD LENGTH (AIX+BASE)
         S     R2,PFXKYLEN        -AIX KEYLENGTH=BASE KEYLENGTH
         ST    R2,AIXNBSXL        SAVE IT
VERESDS  DS    0H
* ONLY NEED THESE FOR NON-UNIQUE AIX
         L     R2,PFXBLKSZ        R2=(ADJUSTED) DATA BLKSIZE
         GETMAIN RU,LV=(R2)
         ST    R1,VSAMELIX        SAVE VSAM ELIX BLOCK ADDRESS
         GETMAIN RU,LV=(R2)
         ST    R1,VSAMSEGM        SAVE VSAM SEGMENT BLOCK ADDRESS
****************************
* VERIFY DATA PREFIX BLOCK *
****************************
* ERRORS ARE SHOWN AS OFFSET/CORRECT VALUE/INCORRECT VALUE IN HEX
* BHDREYE
         CLC   BHDREYE,CNSTHDR    VERIFY BHDREYE ?
         JE    VERHEYEK           EXIT IF IT IS
* BHDREYE IN ERROR
         LA    R9,3               R9=LENGTH TO DISPLAY
         LA    R4,BHDREYE         R4=ADDRESS OF INCORRECT VALUE
         LA    R5,CNSTHDR         R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERHEYEK DS    0H
         ASI   VEROFFST,3+1       BUMP OFFSET, MISS SEQ#
* BHDRVER
         CLI   BHDRVER,BHDR_V2    VERSION 2 ?
         JE    VERVERK            EXIT IF IT IS
* BHDRVER IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRVER         R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERVERK  DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDRFLG1
         CLI   BHDRFLG1,BHDR_PFX  PREFIX BLOCK ?
         JE    VERFLG1K           EXIT IF IT IS
* BHDRFLG1 IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRFLG1        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFLG1K DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDRFLG2
         CLI   BHDRFLG2,0         FLG2=ZERO ?
         JE    VERFLG2K           EXIT IF IT IS
* BHDRFLG2 IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRFLG2        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFLG2K DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDR#REC
         CLI   BHDR#REC,0         ANY RECORDS ?
         JE    VER#RECK           EXIT IF NONE
* BHDR#REC IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDR#REC        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VER#RECK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDRXLVL
         CLI   BHDRXLVL,0         INDEX LEVEL=0 ?
         JE    VERXLVLK           EXIT IF IT IS
* BHDRXLVL IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRXLVL        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERXLVLK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDRSELF
         CGHSI BHDRSELF,-1        SELF=FOXES ?
         JE    VERSELFK           EXIT IF IT IS
* BHDRSELF IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,BHDRSELF        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERSELFK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
* BHDRNEXT
         CGHSI BHDRNEXT,-1        NEXT=FOXES ?
         JE    VERNEXTK           EXIT IF IT IS
* BHDRNEXT IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,BHDRNEXT        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERNEXTK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
* BHDRPREV
         CGHSI BHDRPREV,-1        PREV=FOXES ?
         JE    VERPREVK           EXIT IF IT IS
* BHDRPREV IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,BHDRPREV        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERPREVK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
* BHDRFRE@
         LA    R5,BHDRLENG+PFXLENG+CTRLENG CALC EXPECTED OFFSET
         LH    R4,PFXDNAM@        R4=DATA FILENAME OFFSET
         AR    R4,R6              R4=DATA FILENAME POINTER
         AH    R5,0(R4)           ADD LENGTH
         LH    R4,PFXDPAT@        R4=DATA PATH OFFSET
         AR    R4,R6              R4=DATA PATH POINTER
         AH    R5,0(R4)           ADD LENGTH
         LH    R4,PFXXNAM@        R4=INDEX FILENAME OFFSET
         AR    R4,R6              R4=INDEX FILENAME POINTER
         AH    R5,0(R4)           ADD LENGTH
         LH    R4,PFXXPAT@        R4=INDEX PATH OFFSET
         AR    R4,R6              R4=INDEX PATH POINTER
         AH    R5,0(R4)           ADD LENGTH
         CHHSI CTRLOKEY@,-1       ANY LOW KEY VALUE ?
         JE    VERNOLKY           EXIT IF NONE
         LH    R2,CTRLOKEY@       R2=LOW KEY OFFSET
         AR    R2,R6              R2=LOW KEY POINTER
         AH    R5,0(R2)           ADD LENGTH
VERNOLKY DS    0H
         LR    R2,R5              SAVE LENGTH
         ST    R5,VERWORK1        SAVE IT
         CLC   BHDRFRE@,VERWORK1  CORRECT VALUE ?
         JE    VERFRE@K           EXIT IF IT IS
* BHDRFRE@ IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,BHDRFRE@        R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERWORK1        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFRE@K DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* BHDRFREE
         LHI   R5,4096            R5=PREFIX BLOCKSIZE
         AHI   R5,-BFTRLENG       -FTR LENGTH
         SR    R5,R2              -CALCULATED BHDRFRE@
         ST    R5,VERWORK1        SAVE IT
         CLC   BHDRFREE,VERWORK1  CORRECT VALUE ?
         JE    VERFREEK           EXIT IF IT IS
* BHDRFREE IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,BHDRFREE        R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERWORK1        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFREEK DS    0H
         ASI   VEROFFST,4+7       BUMP OFFSET+PADDING
* PFXEYE
         CLC   PFXEYE,VERPXEYE    EYE=zPFX ?
         JE    VERPXEYK           EXIT IF IT IS
* PFXEYE IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXEYE          R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERPXEYE        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERPXEYK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* PFXRCLEN MATCHES CATALOG
         CLC   PFXRCLEN,VXXXLMAX  MATCHES CATALOG ?
         JE    VERRCLOK           EXIT IF IT DOES
* IF MAXIMUM VARIABLE SIZE ASSUME IT'S A AIX AS KSDS
         CHSI  VXXXLMAX,32763     MAX VARIABLE SIZE ?
         JE    VERRCLOK           EXIT IF IT IS
* PFXRCLEN IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXRCLEN        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERRCLOK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* PFXKYLEN MATCHES CATALOG (KSDS ONLY)
         TM    PFXFFLGS,PFX_KSDS  IS IT KSDS ?
         JNO   VERKYLOK           EXIT IF NOT
         CLC   PFXKYLEN,VXXXKLEN  MATCHES CATALOG ?
         JE    VERKYLOK           EXIT IF IT DOES
* PFXKYLEN IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXKYLEN        R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VXXXKLEN        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERKYLOK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* PFXKYOFF MATCHES CATALOG (KSDS ONLY)
         CLC   PFXKYOFF,VXXXKOFF  MATCHES CATALOG ?
         JE    VERKYOOK           EXIT IF IT DOES
* PFXKYOFF IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXKYOFF        R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VXXXKOFF        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERKYOOK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* PFXDVOL@
         CHHSI PFXDVOL@,-1        DVOL@=FOXES ?
         JE    VERDVOLK           EXIT IF IT IS
* PFXDVOL@ IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,PFXDVOL@        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERDVOLK DS    0H
         ASI   VEROFFST,2         BUMP OFFSET
* MATCH DPAT/DNAM WITH VSAMDTAI
* DISPLAY 1ST 32 BYTES IF MISMATCH
         LH    R4,PFXDPAT@        R4=DATA PATH OFFSET
         AR    R4,R6              R4=DATA PATH POINTER
         LH    R5,0(R4)           R5=LENGTH (INC. LL)
         AHI   R4,2               BUMP PAST LENGTH
         AHI   R5,-2-1            LENGTH-2, -1 FOR EXECUTE
         LA    R2,VERFILE         R2=PATH\FILE AREA
         EXRL  R5,VERMOVPF        MOVE PATH
         LA    R2,1(R2,R5)        R2=POINT AFTER PATH
         MVI   0(R2),C'\'         INSERT BACKSLASH
         AHI   R2,1               BUMP POINTER
         LH    R4,PFXDNAM@        R4=DATA FILENAME OFFSET
         AR    R4,R6              R4=DATA FILENAME POINTER
         LH    R5,0(R4)           R5=LENGTH (INC. LL)
         AHI   R4,2               BUMP PAST LENGTH
         AHI   R5,-2-1            LENGTH-2, -1 FOR EXECUTE
         EXRL  R5,VERMOVPF        MOVE FILENAME
         SGR   R0,R0              SET STOPPER TO X'00'
         LA    R4,VSAMDTAI        R4=PATH\FILE OPENED
         LA    R5,VERFILE         R5=PATH\FILE IN PFX
         CLST  R4,R5              MATCH ?
         JE    VERDPATK           EXIT IF IT DOES
* PFXDPAT@/DNAM@ IN ERROR
         MVI   WTOCOREC,C' '      CLEAR
         MVC   WTOCOREC+1(31),WTOCOREC  WTOCOREC
         LA    R5,VSAMDTAI        R5=ADDRESS OF CORRECT VALUE
* WTO STOPS AT X'00', MUST MOVE BYTE-BY-BYTE
         LA    R1,32              R1=LOOP LIMIT
         LA    R15,WTOCOREC       R15=WTOCOREC
VERLOOPC DS    0H
         CLI   0(R5),0            NULL STOPPER ?
         JE    VERCORDN           EXIT IF IT IS
         MVC   0(1,R15),0(R5)     MOVE BYTE
         AHI   R15,1              BUMP POINTER
         AHI   R5,1               BUMP POINTER
         JCT   R1,VERLOOPC        LOOP
*
VERCORDN DS    0H
         MVI   WTOINCOR,C' '      CLEAR
         MVC   WTOINCOR+1(31),WTOINCOR  WTOINCOR
         LA    R4,VERFILE         R4=ADDRESS OF INCORRECT VALUE
         LA    R1,32              R1=LOOP LIMIT
         LA    R15,WTOINCOR       R15=WTOCOREC
VERLOOPI DS    0H
         CLI   0(R4),0            NULL STOPPER ?
         JE    VERINCDN           EXIT IF IT IS
         MVC   0(1,R15),0(R4)     MOVE BYTE
         AHI   R15,1              BUMP POINTER
         AHI   R4,1               BUMP POINTER
         JCT   R1,VERLOOPI        LOOP
*
VERINCDN DS    0H
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         JAS   R14,VERSHOWO       BUILD OFFSET AND WTO
VERDPATK DS    0H
         ASI   VEROFFST,2+2       BUMP OFFSET (DNAM@+DPAT@)
* PFXXVOL@
         CHHSI PFXXVOL@,-1        XVOL@=FOXES ?
         JE    VERXVOLK           EXIT IF IT IS
* PFXXVOL@ IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,PFXXVOL@        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERXVOLK DS    0H
         ASI   VEROFFST,2+2+2     BUMP OFFSET (XVOL@+XNAM@+XPAT@)
* NOT DOING XNAM@, XPAT@ HERE
* PFXIXLVL
         CLI   PFXIXLVL,0         PFXIXLVL=0 ?
         JE    VERIXLVK           EXIT IF IT IS
* PFXIXLVL IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXIXLVL        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERIXLVK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXALTHR
         CLI   PFXALTHR,0         PFXALTHR=0 ?
         JE    VERALTHK           EXIT IF IT IS
* PFXALTHR IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXALTHR        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERALTHK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXBLKSZ
         CHSI  PFXBLKSZ,0         PFXBLKSZ NOT ZERO ?
         JNE   VERBLKSK           EXIT IF NOT
* PFXBLKSZ IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXBLKSZ        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERBLKSK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* TEST THE NEXT XLRAS FOR VALIDITY...NOT FOXES AND RIGHTMOST BYTE=0
*    HXLRA, BMAP, EMAP, MAPNW, BDATA, EDATA
         LA    R3,6               R3=NO. OF FIELDS
         LA    R7,PFXHXLRA        R7=ADDRESS OF START VALUE
VERXLRA1 DS    0H
         CLI   7(R7),0            RIGHTMOST BYTE ZERO ?
         JNE   VERXLRAE           ERROR IF NOT
         CGHSI 0(R7),-1           FIELD NOT FOXES ?
         JNE   VERXLRAK           EXIT IF NOT
VERXLRAE DS    0H
* FIELD IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LR    R4,R7              R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERXLRAK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
         AHI   R7,8               BUMP FIELD POINTER
         JCT   R3,VERXLRA1        LOOP
*
* TEST THE FOLLOWING FOR FOXES IF NOT SPANNED
*    BSEGM,ESEGM
* IF SPANNED AND FOXES, ISSUE WARNING THAT NO RECORD WAS SEGMENTED
         TM    PFXRFLGS,PFX_RSPN  SPANNED ?
         JO    VERSPAN            EXIT IF IT IS
* NOT SPANNED
* PFXBSEGM
         CGHSI PFXBSEGM,-1        BSEGM=FOXES ?
         JE    VERBSEGK           EXIT IF IT IS
* PFXBSEGM IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,PFXBSEGM        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERBSEGK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
* PFXESEGM
         CGHSI PFXESEGM,-1        ESEGM=FOXES ?
         JE    VERESEGK           EXIT IF IT IS
* PFXESEGM IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,PFXESEGM        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERESEGK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
         J     VERROOT            EXIT
*
VERSPAN  DS    0H
* SPANNED
* PFXBSEGM/PFXESEGM SHOULD NOT BE FOXES
         CGHSI PFXBSEGM,-1        BSEGM=FOXES ?
         JE    VERSEGER           ERROR IF IT IS
         CGHSI PFXESEGM,-1        ESEGM=FOXES ?
         JNE   VERSEGM            EXIT IF NOT
VERSEGER DS    0H
* ISSUE WARNING:SPANNED AND NO SEGMENTS CREATED
         WTO   MF=(E,WTOVERSE)    DISPLAY WARNING
         ASI   VEROFFST,16        BUMP OFFSET
         J     VERROOT            EXIT
*
VERSEGM  DS    0H
* PFXBSEGM VALID XLRA
         CLI   PFXBSEGM+7,0       RIGHTMOST BYTE ZERO ?
         JE    VERBSEG2           EXIT IF IT IS
* PFXBSEGM IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,PFXBSEGM        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERBSEG2 DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
* PFXESEGM VALID XLRA
         CLI   PFXESEGM+7,0       RIGHTMOST BYTE ZERO ?
         JE    VERESEG2           EXIT IF IT IS
* PFXESEGM IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,PFXESEGM        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERESEG2 DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
VERROOT  DS    0H
* TEST THE NEXT XLRAS FOR VALIDITY...ALL FOXES
*    ROOT, BLVLx
         LA    R3,33              R3=NO. OF FIELDS
         LA    R7,PFXROOT         R7=ADDRESS OF START VALUE
VERROOTL DS    0H
         CGHSI 0(R7),-1           FIELD=FOXES ?
         JE    VERROOTK           EXIT IF IT IS
* FIELD IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LR    R4,R7              R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERROOTK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
         AHI   R7,8               BUMP FIELD POINTER
         JCT   R3,VERROOTL        LOOP
*
         ASI   VEROFFST,4+5*8     BUMP OFFSET (MISS MAPOF+STCKS)
* PFXFRSPC
         CLI   PFXFRSPC,X'64'     LESS THAN 100 ?
         JL    VERFRSOK           EXIT IF IT IS
* PFXFRSPC IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXFRSPC        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFRSOK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXFRBLK
* ALL POSITIVE ALGEBRAIC VALUES VALID
         TM    PFXFRBLK,X'80'     VALID ?
         JNO   VERFBOK            EXIT IF IT IS
* PFXFRBLK IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,PFXFRBLK        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFBOK  DS    0H
         ASI   VEROFFST,2         BUMP OFFSET
* PFXFRINT
* ALL POSITIVE ALGEBRAIC VALUES VALID
         TM    PFXFRINT,X'80'     VALID ?
         JNO   VERFIOK            EXIT IF IT IS
* PFXFRINT IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,PFXFRINT        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFIOK  DS    0H
         ASI   VEROFFST,2         BUMP OFFSET
* PFXFFLGS MATCHES CATALOG
         TM    PFXFFLGS,PFX_ESDS  ESDS ?
         JNO   VERNTESD           EXIT IF NOT
         TM    VXXXFLG1,VCLRESDS  ESDS IN CATALOG ?
         JO    VERFFGOK           EXIT IF IT IS
         J     VERFFGBD           EXIT
*
VERNTESD DS    0H
         TM    PFXFFLGS,PFX_KSDS  KSDS ?
         JNO   VERNTKSD           EXIT IF NOT
         TM    VXXXFLG1,VCLRKSDS  KSDS IN CATALOG ?
         JO    VERFFGOK           EXIT IF IT IS
         J     VERFFGBD           EXIT
*
VERNTKSD DS    0H
         TM    PFXFFLGS,PFX_RRDS  RRDS ?
         JNO   VERNTRRD           EXIT IF NOT
         TM    VXXXFLG1,VCLRRRDS  RRDS IN CATALOG ?
         JO    VERFFGOK           EXIT IF IT IS
         J     VERFFGBD           EXIT
*
VERNTRRD DS    0H
         TM    PFXFFLGS,PFX_LDS   LDS ?
         JNO   VERFFGBD           EXIT IF NOT
         TM    VXXXFLG1,VCLRLDS   LDS IN CATALOG ?
         JO    VERFFGOK           EXIT IF IT IS
VERFFGBD DS    0H
* PFXFFLGS IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXFFLGS        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFFGOK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXRFLGS MATCHES CATALOG
         TM    PFXRFLGS,PFX_RFIX  FIXED ?
         JNO   VERNTFIX           EXIT IF NOT
* FIXED
         TM    VXXXFLG1,VCLRVREC  FIXED IN CATALOG ?
         JNO   VERDOSPN           EXIT IF IT IS
         J     VERRFGBD           EXIT
*
VERNTFIX DS    0H
* VARIABLE
         TM    VXXXFLG1,VCLRVREC  VARIABLE IN CATALOG ?
         JO    VERDOSPN           EXIT IF IT IS
         J     VERRFGBD           EXIT
*
VERDOSPN DS    0H
* SPANNED IS NOT MARKED IN CATALOG FOR AIX NON-UNIQUE
         CLI   ITYPE,C'A'         IS CLUSTER AN AIX ?
         JE    VERRFGOK           EXIT IF IT IS
         TM    PFXRFLGS,PFX_RSPN  SPANNED ?
         JNO   VERDOUNS           EXIT IF NOT
* SPANNED
         TM    VXXXFLG1,VCLRSPAN  SPANNED IN CATALOG ?
         JO    VERRFGOK           EXIT IF IT IS
         J     VERRFGBD           EXIT
*
VERDOUNS DS    0H
* UNSPANNED
         TM    VXXXFLG1,VCLRSPAN  UNSPANNED IN CATALOG ?
         JNO   VERRFGOK           EXIT IF IT IS
VERRFGBD DS    0H
* PFXRFLGS IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXRFLGS        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERRFGOK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXAIXN
         CLC   PFXAIXN,VXXXAIXN   AIXN CORRECT ?
         JE    VERAIXNK           EXIT IF IT IS
* PFXAIXN IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXAIXN         R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VXXXAIXN        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERAIXNK DS    0H
         ASI   VEROFFST,1+2       BUMP OFFSET+PADDING
* CTREYE
         CLC   CTREYE,VERCTEYE    EYE=zCTR ?
         JE    VERCTEYK           EXIT IF IT IS
* CTREYE IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,CTREYE          R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERCTEYE        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERCTEYK DS    0H
*###CTR CHECKS GO HERE
* BFTREYE AND SEQ#
         L     R7,VSAMPRFX        R7=PREFIX BLOCK ADDRESS
         AHI   R7,4096-BFTRLENG   R7=ZVSAMFTR
         USING ZVSAMFTR,R7
         MVHI  VEROFFST,4096-BFTRLENG SET OFFSET
* BFTREYE
         CLC   BFTREYE,CNSTFTR    VERIFY BFTREYE ?
         JE    VERFEYEK           EXIT IF IT IS
* BFTREYE IN ERROR
         LA    R9,3               R9=LENGTH TO DISPLAY
         LA    R4,BFTREYE         R4=ADDRESS OF INCORRECT VALUE
         LA    R5,CNSTFTR         R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERFEYEK DS    0H
         ASI   VEROFFST,3         BUMP OFFSET
* BHDRSEQ#=BFTRSEQ#
         CLC   BHDRSEQ#,BFTRSEQ#  SEQ# MATCHES ?
         JE    VERSEQOK           EXIT IF THEY DO
* SEQ# IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRSEQ#        R4=ADDRESS OF BHDRSEQ#
         LA    R5,BFTRSEQ#        R5=ADDRESS OF BFTRSEQ#
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VERSEQOK DS    0H
         DROP  R7
* VERIFY BLOCK COUNTS AND CHAINS
         L     R2,PFXBLKSZ        R2=(ADJUSTED) DATA BLKSIZE
         ST    R2,DTAIN+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAIN+DCBLRECLF-IHADCB SAVE LRECL
         GETMAIN RU,LV=(R2)
         ST    R1,VSAMDATA        SAVE VSAM DATA BLOCK ADDRESS
         LFH   R6,VSAMDATA        R6 HIGH=VSAMDATA
         RLLG  R6,R6,32           SWAP VSAMDATA/VSAMPRFX
* R6 IS NOW VSAMDATA
         LGHI  R3,-256            BLOCK NUMBER STARTS AT ZERO
VERBLOOP DS    0H
         GET   DTAIN,(R6)         GET DATA BLOCK (EOF TO VEREOF)
         AGHI  R3,256             BUMP BLOCK NUMBER
* CHECK HDR/FTR SEQ# MATCH
         CLC   BHDREYE,CNSTHDR    VERIFY BHDREYE ?
         JNE   VERHFSBD           EXIT IF NOT
         LR    R7,R2              R7=DATA BLKSIZE
         AHI   R7,-BFTRLENG       R7=OFFSET OF FTR
         AR    R7,R6              R7=ADDRESS OF FTR
         CLC   0(3,R7),CNSTFTR    VERIFY BFTREYE ?
         JNE   VERHFSBD           EXIT IF NOT
         CLC   BHDREYE+3(1),3(R7) SEQ# MATCH ?
         JE    VERHFSOK           EXIT IF THEY DO
VERHFSBD DS    0H
* BAD HDR/FTR/SEQ#
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R5,BHDRSELF        BASE-FREE
         LA    R8,VERHFSXL        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,4               R9=LENGTH
         LA    R5,BHDREYE         BASE-FREE
         LA    R8,VERHFSHD        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,BFTRLENG        R9=LENGTH
         LA    R8,VERHFSFT        R8=DESTINATION ADDRESS
         TROT  R8,R7,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERHF)    DISPLAY HDR/FTR/SEQ# ERROR
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VERHFSOK DS    0H
* COUNT BLOCK TYPES AND VERIFY BHDRSELF
         CLI   BHDRFLG1,BHDR_MAP  IS IT SPACEMAP ?
         JNE   VERNSPAC           EXIT IF NOT
* SPACEMAP BLOCK
         AGSI  VERSPCCT,1         COUNT SPACEMAP BLOCKS
* BHDRSELF CHECK
         CG    R3,BHDRSELF        MATCH BHDRSELF ?
         JE    VERBLOOP           EXIT IF IT DOES
* BHDRSELF IN ERROR
         JAS   R14,VERWTOSF       SHOW BHDRSELF ERROR MESSAGE
         J     VERBLOOP           LOOP
*
VERNSPAC DS    0H
         TM    BHDRFLG1,BHDR_SEG  IS IT SEGMENT ?
         JNO   VERNSEGM           EXIT IF NOT
* SEGMENT BLOCK
         AGSI  VERSEGCT,1         COUNT SEGMENT BLOCKS
* BHDRSELF CHECK
         CG    R3,BHDRSELF        MATCH BHDRSELF ?
         JE    VERBLOOP           LOOP IF IT DOES
* BHDRSELF IN ERROR
         JAS   R14,VERWTOSF       SHOW BHDRSELF ERROR MESSAGE
         J     VERBLOOP           LOOP
*
VERNSEGM DS    0H
         TM    BHDRFLG2,BHDR_ELX  IS IT ELIX ?
         JNO   VERNELIX           EXIT IF NOT
* SEGMENT BLOCK
         AGSI  VERELXCT,1         COUNT ELIX BLOCKS
* BHDRSELF CHECK
         CG    R3,BHDRSELF        MATCH BHDRSELF ?
         JE    VERBLOOP           LOOP IF IT DOES
* BHDRSELF IN ERROR
         JAS   R14,VERWTOSF       SHOW BHDRSELF ERROR MESSAGE
         J     VERBLOOP           LOOP
*
* DATA BLOCK
VERNELIX DS    0H
         AGSI  VERDTACT,1         COUNT DATA BLOCKS
* BHDRSELF CHECK
         CG    R3,BHDRSELF        MATCH BHDRSELF ?
         JE    VERBLOOP           LOOP IF IT DOES
* BHDRSELF IN ERROR
         JAS   R14,VERWTOSF       SHOW BHDRSELF ERROR MESSAGE
         J     VERBLOOP           LOOP
*
VEREOF   DS    0H
* PFXHXLRA CHECK
         RLLG  R6,R6,32           SWAP VSAMDATA/VSAMPRFX
* R6 IS NOW VSAMPRFX
         CG    R3,PFXHXLRA        MATCHES PFXHXLRA ?
         JE    VERHXLOK           EXIT IF IT DOES
* PFXHXLRA IN ERROR
         STG   R3,VERWORK1        SAVE COUNT
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R5,PFXHXLRA        BASE-FREE
         LA    R8,VERHXLRA        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,8               R9=LENGTH
         LA    R5,VERWORK1        BASE-FREE
         LA    R8,VERHXCNT        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERHX)    DISPLAY PFXHXLRA ERROR
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VERHXLOK DS    0H
* CHASE THE CHAINS AND CHECK THE COUNTS AND TYPES
* INCLUDING LOOP PROTECTION
*
* CHECK BHDR#REC/RPTREND/FREESPACE
*
* SPACEMAP BLOCKS HAVE BIT PATTERN CHECKS
*
* DATA FORWARD SCAN
         LA    R4,VERDF           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
* DATA BACKWARD SCAN
         LA    R4,VERDB           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
         CGHSI PFXBSEGM,-1        ANY SEGMENT BLOCKS ?
         JE    VERNOSEG           EXIT IF NONE
* SEGMENT FORWARD SCAN
         LA    R4,VERGF           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
* SEGMENT BACKWARD SCAN
         LA    R4,VERGB           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
VERNOSEG DS    0H
* SPACEMAP FORWARD SCAN
         LA    R4,VERSF           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
* SPACEMAP BACKWARD SCAN
         LA    R4,VERSB           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
         CLOSE DTAIN              CLOSE INPUT VSAM DCB
****************
* VERIFY INDEX *
****************
         MVHI  VEROFFST,0         SET OFFSET TO ZERO
* OPEN INPUT VSAM IDX
         LA    R14,VSAMIDXI       R14=INDEX DSNAME ADDRESS
         ST    R14,DTAIN+DCBDSNAM-IHADCB SAVE INDEX DSNAME ADDRESS
         L     R14,VEIEOFAD       R14=INDEX EODAD ADDRESS
         ST    R14,DTAIN+DCBEODAD-IHADCB SAVE EODAD
         OPEN  (DTAIN,(INPUT))    OPEN VSAM INDEX INPUT DCB
         LTR   R15,R15            OK ?
         JNZ   BADOPEND           ERROR IF NOT
         MVI   WTOVERH1,X'FF'     MARK DATA HEADER DONE
         MVI   WTOVERH2,0         MARK INDEX HEADER POSSIBLE
* SHOW INPUT IDX FILE OPENED: PATH
         MVC   OPENMSG,WTOINPVI   MOVE 'INPUT IDX OPENED' MSG
         L     R1,GETENVI         R1=VSAM INPUT PATH ADDRESS
         JAS   R14,OPENWTOV       WTO OPEN FILE
* SET UP THE INFO LINE AND DISPLAY IT
         LARL  R4,WTOINFSV        R4=BASE FOR INFO LINE
         USING WTOINFDS,R4
         CLI   ITYPE,C'A'         IS OUTPUT CLUSTER AN AIX ?
         JNE   VEINAIXU           EXIT IF NOT
* AIX
         MVC   WTOXXDS(4),CNSTAIXU SET AIX UNIQUE
         TM    VXXXFLG1,VAIXUKEY  UNIQUE ?
         JO    VEISPANU           EXIT IF IT IS
* AIX NON-UNIQUE
         MVHHI WTORECFM,C'V '     SET AIX AS VARIABLE
         MVI   WTOXXDS+3,C'N'     SET AIX NON-UNIQUE
         MVC   WTOVRFX(8),CNSTVARB SET VARIABLE
         MVC   WTONSPAN(10),CNSTSPAN SET SPANNED
         J     VEISPANU           EXIT
*
VEINAIXU DS    0H
         TM    VXXXFLG1,VCLRKSDS  KSDS ?
         JO    VEIXXDSU           EXIT IF IT IS
         MVHHI WTOXXDS,C'RR'      SET RRDS
         TM    VXXXFLG1,VCLRRRDS  RRDS ?
         JO    VEIXXDSU           EXIT IF IT IS
         MVHHI WTOXXDS,C'ES'      SET ESDS
VEIXXDSU DS    0H
         TM    VXXXFLG1,VCLRVREC  VARIABLE ?
         JNO   VEINVARU           EXIT IF NOT
         MVC   WTOVRFX(8),CNSTVARB SET VARIABLE
VEINVARU DS    0H
         TM    VXXXFLG1,VCLRSPAN  SPANNED ?
         JNO   VEISPANU           EXIT IF IT IS
         MVC   WTONSPAN(10),CNSTSPAN SET SPANNED
         DROP  R4
VEISPANU DS    0H
* DISPLAY INFO LINE
         WTO   MF=(E,WTOINFOV)    DISPLAY INFO LINE
* GET INDEX PREFIX BLOCK
         LHI   R2,4096            R2=PREFIX BLOCKSIZE
         ST    R2,DTAIN+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAIN+DCBLRECLF-IHADCB SAVE LRECL
* R6 IS VSAMPRFX
         GET   DTAIN,(R6)         GET INDEX PREFIX BLOCK
* VERIFY INDEX PREFIX BLOCK
* ERRORS ARE SHOWN AS OFFSET/CORRECT VALUE/INCORRECT VALUE IN HEX
* BHDREYE
         CLC   BHDREYE,CNSTHDR    VERIFY BHDREYE ?
         JE    VEIHEYEK           EXIT IF IT IS
* BHDREYE IN ERROR
         LA    R9,3               R9=LENGTH TO DISPLAY
         LA    R4,BHDREYE         R4=ADDRESS OF INCORRECT VALUE
         LA    R5,CNSTHDR         R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIHEYEK DS    0H
         ASI   VEROFFST,3+1       BUMP OFFSET, MISS SEQ#
* BHDRVER
         CLI   BHDRVER,BHDR_V2    VERSION 2 ?
         JE    VEIVERK            EXIT IF IT IS
* BHDRVER IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRVER         R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIVERK  DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDRFLG1
         CLI   BHDRFLG1,BHDR_PFX  PREFIX BLOCK ?
         JE    VEIFLG1K           EXIT IF IT IS
* BHDRFLG1 IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRFLG1        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFLG1K DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDRFLG2
         CLI   BHDRFLG2,0         FLG2=ZERO ?
         JE    VEIFLG2K           EXIT IF IT IS
* BHDRFLG2 IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRFLG2        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFLG2K DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDR#REC
         CLI   BHDR#REC,0         ANY RECORDS ?
         JE    VEI#RECK           EXIT IF NONE
* BHDR#REC IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDR#REC        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEI#RECK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDRXLVL
         CLI   BHDRXLVL,0         INDEX LEVEL=0 ?
         JE    VEIBLVLK           EXIT IF IT IS
* BHDRXLVL IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRXLVL        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIBLVLK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* BHDRSELF
         CGHSI BHDRSELF,-1        SELF=FOXES ?
         JE    VEISELFK           EXIT IF IT IS
* BHDRSELF IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,BHDRSELF        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEISELFK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
* BHDRNEXT
         CGHSI BHDRNEXT,-1        NEXT=FOXES ?
         JE    VEINEXTK           EXIT IF IT IS
* BHDRNEXT IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,BHDRNEXT        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEINEXTK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
* BHDRPREV
         CGHSI BHDRPREV,-1        PREV=FOXES ?
         JE    VEIPREVK           EXIT IF IT IS
* BHDRPREV IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LA    R4,BHDRPREV        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIPREVK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
* BHDRFRE@
         LA    R5,BHDRLENG+PFXLENG+CTRLENG CALC EXPECTED OFFSET
         LH    R4,PFXDNAM@        R4=DATA FILENAME OFFSET
         AR    R4,R6              R4=DATA FILENAME POINTER
         AH    R5,0(R4)           ADD LENGTH
         LH    R4,PFXDPAT@        R4=DATA PATH OFFSET
         AR    R4,R6              R4=DATA PATH POINTER
         AH    R5,0(R4)           ADD LENGTH
         LH    R4,PFXXNAM@        R4=INDEX FILENAME OFFSET
         AR    R4,R6              R4=INDEX FILENAME POINTER
         AH    R5,0(R4)           ADD LENGTH
         LH    R4,PFXXPAT@        R4=INDEX PATH OFFSET
         AR    R4,R6              R4=INDEX PATH POINTER
         AH    R5,0(R4)           ADD LENGTH
         LR    R2,R5              SAVE LENGTH
         ST    R5,VERWORK1        SAVE IT
         CLC   BHDRFRE@,VERWORK1  CORRECT VALUE ?
         JE    VEIFRE@K           EXIT IF IT IS
* BHDRFRE@ IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,BHDRFRE@        R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERWORK1        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFRE@K DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* BHDRFREE
         LHI   R5,4096            R5=PREFIX BLOCKSIZE
         AHI   R5,-BFTRLENG       -FTR LENGTH
         SR    R5,R2              -CALCULATED BHDRFRE@
         ST    R5,VERWORK1        SAVE IT
         CLC   BHDRFREE,VERWORK1  CORRECT VALUE ?
         JE    VEIFREEK           EXIT IF IT IS
* BHDRFREE IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,BHDRFREE        R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERWORK1        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFREEK DS    0H
         ASI   VEROFFST,4+7       BUMP OFFSET+PADDING
* PFXEYE
         CLC   PFXEYE,VERPXEYE    EYE=zPFX ?
         JE    VEIPXEYK           EXIT IF IT IS
* PFXEYE IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXEYE          R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERPXEYE        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIPXEYK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* PFXRCLEN=8(ESDS/RRDS) OR KEYLEN(KSDS)+8(XLRA)
         CLI   PXXFFLGS,PFX_LDS   LDS ?
         JE    VEIRCLOK           EXIT IF IT IS
         L     R14,VXXXKLEN       R14=KEY LENGTH (KSDS)
         TM    PXXFFLGS,PFX_KSDS  KSDS ?
         JO    VEIRCLLL           EXIT IF IT IS
         LA    R14,8              R14=8(XLRA) FOR ESDS/RRDS
VEIRCLLL DS    0H
         AHI   R14,8              +8 FOR XLRA
         C     R14,PFXRCLEN       CORRECT ?
         JE    VEIRCLOK           EXIT IF IT IS
* PFXRCLEN IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXRCLEN        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIRCLOK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
         TM    PXXFFLGS,PFX_KSDS  KSDS ?
         JO    VEIKEYLO           EXIT IF IT IS
* NOT KSDS, MISS PFXKYLEN AND PFXKYOFF
         ASI   VEROFFST,4+4       BUMP OFFSET (PFXKYLEN+PFXKYOFF)
         J     VEIDVOL            EXIT
********EGQTV    DC    C'EGQTV '          ###TRACE ON
********NOTRACE  DC    C' '               ###TRACE OFF
*
VEIKEYLO DS    0H
* PFXKYLEN MATCHES CATALOG (KSDS ONLY)
         CLC   PFXKYLEN,VXXXKLEN  MATCHES CATALOG ?
         JE    VEIKYLOK           EXIT IF IT DOES
* PFXKYLEN IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXKYLEN        R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VXXXKLEN        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIKYLOK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* PFXKYOFF=0 (KSDS ONLY)
         CHSI  PFXKYOFF,0         PFXKYOFF=ZERO ?
         JE    VEIKYOOK           EXIT IF IT IS
* PFXKYOFF IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXKYOFF        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIKYOOK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
VEIDVOL  DS    0H
* PFXDVOL@
         CHHSI PFXDVOL@,-1        DVOL@=FOXES ?
         JE    VEIDVOLK           EXIT IF IT IS
* PFXDVOL@ IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,PFXDVOL@        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIDVOLK DS    0H
* NOT DOING DNAM@, DPAT@ HERE
         ASI   VEROFFST,2+2+2     BUMP OFFSET (DVOL@+DNAM@+DPAT@)
* PFXXVOL@
         CHHSI PFXXVOL@,-1        XVOL@=FOXES ?
         JE    VEIXVOLK           EXIT IF IT IS
* PFXXVOL@ IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,PFXXVOL@        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIXVOLK DS    0H
         ASI   VEROFFST,2         BUMP OFFSET
* MATCH XPAT/XNAM WITH VSAMIDXI
* DISPLAY 1ST 32 BYTES IF MISMATCH
         LH    R4,PFXXPAT@        R4=INDEX PATH OFFSET
         AR    R4,R6              R4=INDEX PATH POINTER
         LH    R5,0(R4)           R5=LENGTH (INC. LL)
         AHI   R4,2               BUMP PAST LENGTH
         AHI   R5,-2-1            LENGTH-2, -1 FOR EXECUTE
         LA    R2,VERFILE         R2=PATH\FILE AREA
         EXRL  R5,VERMOVPF        MOVE PATH
         LA    R2,1(R2,R5)        R2=POINT AFTER PATH
         MVI   0(R2),C'\'         INSERT BACKSLASH
         AHI   R2,1               BUMP POINTER
         LH    R4,PFXXNAM@        R4=INDEX FILENAME OFFSET
         AR    R4,R6              R4=INDEX FILENAME POINTER
         LH    R5,0(R4)           R5=LENGTH (INC. LL)
         AHI   R4,2               BUMP PAST LENGTH
         AHI   R5,-2-1            LENGTH-2, -1 FOR EXECUTE
         EXRL  R5,VERMOVPF        MOVE FILENAME
         SGR   R0,R0              SET STOPPER TO X'00'
         LA    R4,VSAMIDXI        R4=PATH\FILE OPENED
         LA    R5,VERFILE         R5=PATH\FILE IN PFX
         CLST  R4,R5              MATCH ?
         JE    VEIXPATK           EXIT IF IT DOES
* PFXXPAT@/XNAM@ IN ERROR
         MVI   WTOCOREC,C' '      CLEAR
         MVC   WTOCOREC+1(31),WTOCOREC  WTOCOREC
         LA    R5,VSAMIDXI        R5=ADDRESS OF CORRECT VALUE
* WTO STOPS AT X'00', MUST MOVE BYTE-BY-BYTE
         LA    R1,32              R1=LOOP LIMIT
VEILOOPC DS    0H
         CLI   0(R5),0            NULL STOPPER ?
         JE    VEICORDN           EXIT IF IT IS
         MVC   0(1,R15),0(R5)     MOVE BYTE
         AHI   R15,1              BUMP POINTER
         AHI   R5,1               BUMP POINTER
         JCT   R1,VEILOOPC        LOOP
*
VEICORDN DS    0H
         MVI   WTOINCOR,C' '      CLEAR
         MVC   WTOINCOR+1(31),WTOINCOR  WTOINCOR
         LA    R4,VERFILE         R4=ADDRESS OF INCORRECT VALUE
         LA    R1,32              R1=LOOP LIMIT
VEILOOPI DS    0H
         CLI   0(R4),0            NULL STOPPER ?
         JE    VEIINCDN           EXIT IF IT IS
         MVC   0(1,R15),0(R4)     MOVE BYTE
         AHI   R15,1              BUMP POINTER
         AHI   R4,1               BUMP POINTER
         JCT   R1,VEILOOPI        LOOP
*
VEIINCDN DS    0H
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         JAS   R14,VERSHOWO       BUILD OFFSET AND WTO
VEIXPATK DS    0H
         ASI   VEROFFST,2+2       BUMP OFFSET (XNAM@+XPAT@)
* PFXIXLVL
* COUNT LEVELS AND CHECK
         SR    R0,R0              R0=LEVEL COUNT
         LA    R1,15              R1=NO. OF LEVELS TO CHECK
         LA    R5,PFXBLVL1        R5=LEVEL XLRA
VEIIXLOP DS    0H
         CGHSI 0(R5),-1           GOT A LEVEL ?
         JE    VEIIXDUN           EXIT IF NOT
         AHI   R5,16              BUMP LEVEL POINTER
         AHI   R0,1               COUNT LEVELS
         JCT   R1,VEIIXLOP        LOOP
*
VEIIXDUN DS    0H
         SLL   R0,24              SHIFT TO TOP BYTE
         ST    R0,VERWORK1        SAVE ACTUAL NO. OF LEVELS
         CLC   PFXIXLVL,VERWORK1  PFXIXLVL CORRECT ?
         JE    VEIIXLVK           EXIT IF IT IS
* PFXIXLVL IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXIXLVL        R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERWORK1        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIIXLVK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXALTHR
         CLI   PFXALTHR,0         PFXALTHR=0 ?
         JE    VEIALTHK           EXIT IF IT IS
* PFXALTHR IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXALTHR        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIALTHK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXBLKSZ
         CHSI  PFXBLKSZ,0         PFXBLKSZ NOT ZERO ?
         JNE   VEIBLKSK           EXIT IF NOT
* PFXBLKSZ IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,PFXBLKSZ        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIBLKSK DS    0H
         ASI   VEROFFST,4         BUMP OFFSET
* TEST THE NEXT XLRAS FOR VALIDITY...NOT FOXES AND RIGHTMOST BYTE=0
*    HXLRA, BMAP, EMAP, MAPNW
         LA    R2,4               R2=NO. OF FIELDS
         LA    R7,PFXHXLRA        R7=ADDRESS OF START VALUE
VEIXLRA1 DS    0H
         CLI   7(R7),0            RIGHTMOST BYTE ZERO ?
         JNE   VEIXLRAE           ERROR IF NOT
         MVI   7(R7),X'FF'        TEMP CHANGE
         CGHSI 0(R7),-1           FIELD NOT FOXES ?
         MVI   7(R7),X'00'        RESET CHANGE
         JNE   VEIXLRAK           EXIT IF NOT
VEIXLRAE DS    0H
* FIELD IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LR    R4,R7              R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIXLRAK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
         AHI   R7,8               BUMP FIELD POINTER
         JCT   R2,VEIXLRA1        LOOP
*
* TEST THE FOLLOWING FOR FOXES
*    BDATA,EDATA,BSEGM,ESEGM
         LA    R2,4               R2=NO. OF FIELDS
         LA    R7,PFXBDATA        R7=ADDRESS OF START VALUE
VEIXLRA2 DS    0H
         CGHSI 0(R7),-1           FIELD NOT FOXES ?
         JE    VEIXLRK2           EXIT IF IT IS
* FIELD IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LR    R4,R7              R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIXLRK2 DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
         AHI   R7,8               BUMP FIELD POINTER
         JCT   R2,VEIXLRA2        LOOP
*
* TEST THE NEXT XLRAS FOR VALIDITY...NOT FOXES AND RIGHTMOST BYTE=0
*    ROOT, BLVL0, ELVL0
         LA    R2,3               R2=NO. OF FIELDS
         LA    R7,PFXROOT         R7=ADDRESS OF START VALUE
VEIROOTL DS    0H
         CLI   7(R7),0            RIGHTMOST BYTE ZERO ?
         JNE   VEIROOTE           ERROR IF NOT
         MVI   7(R7),X'FF'        TEMP CHANGE
         CGHSI 0(R7),-1           FIELD NOT FOXES ?
         MVI   7(R7),X'00'        RESET CHANGE
         JNE   VEIROOTK           EXIT IF NOT
VEIROOTE DS    0H
* FIELD IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LR    R4,R7              R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIROOTK DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
         AHI   R7,8               BUMP FIELD POINTER
         JCT   R2,VEIROOTL        LOOP
*
* CHECK LEVELS, ONCE FOXES THE REST ARE FOXES
* BLVLn AND ELVLn ARE BOTH FOXES, OR BOTH NOT FOXES
         LA    R2,15              R2=NO. OF FIELD PAIRS
         LA    R7,PFXBLVL1        R7=ADDRESS OF START VALUE
VEILEVLP DS    0H
         CGHSI 0(R7),-1           FIELD IS FOXES ?
         JE    VEILEVFX           EXIT IF IT IS
* LEVEL PAIR MUST BOTH BE VALID
         CLI   7(R7),0            RIGHTMOST BYTE ZERO ?
         JE    VEILEVK1           EXIT IF IT IS
* FIELD IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LR    R4,R7              R4=ADDRESS OF INCORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEILEVK1 DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
         AHI   R7,8               BUMP FIELD POINTER
         CLI   7(R7),0            RIGHTMOST BYTE ZERO ?
         JE    VEILEVK2           EXIT IF IT IS
* FIELD IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LR    R4,R7              R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEILEVK2 DS    0H
         ASI   VEROFFST,8         BUMP OFFSET
         AHI   R7,8               BUMP FIELD POINTER
         JCT   R2,VEILEVLP        LOOP
*
         J     VEIFRSPC           EXIT
*
VEILEVFX DS    0H
* 1ST OF PAIR IS FOXES, CHECK THE REMAINING PAIRS
         AR    R2,R2              R2=REMAINING NO. OF FIELDS
VEILEVFP DS    0H
         CGHSI 0(R7),-1           FIELD IS FOXES ?
         JE    VEILEVFK           EXIT IF IT IS
* FIELD IN ERROR
         LA    R9,8               R9=LENGTH TO DISPLAY
         LR    R4,R7              R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEILEVFK DS    0H
         ASI   VEROFFST,8        BUMP OFFSET
         AHI   R7,8               BUMP FIELD POINTER
         JCT   R2,VEILEVFP        LOOP
*
         ASI   VEROFFST,4+5*8     BUMP OFFSET (MISS PFXMAPOF+STCKS)
VEIFRSPC DS    0H
* PFXFRSPC
         CLI   PFXFRSPC,X'64'     LESS THAN 100 ?
         JL    VEIFRSOK           EXIT IF IT IS
* PFXFRSPC IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXFRSPC        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFRSOK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXFRBLK
* ALL POSITIVE ALGEBRAIC VALUES VALID
         TM    PFXFRBLK,X'80'     VALID ?
         JNO   VEIFBOK            EXIT IF IT IS
* PFXFRBLK IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,PFXFRBLK        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFBOK  DS    0H
         ASI   VEROFFST,2         BUMP OFFSET
* PFXFRINT
* ALL POSITIVE ALGEBRAIC VALUES VALID
         TM    PFXFRINT,X'80'     VALID ?
         JNO   VEIFIOK            EXIT IF IT IS
* PFXFRINT IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,PFXFRINT        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFIOK  DS    0H
         ASI   VEROFFST,2         BUMP OFFSET
* PFXFFLGS=X'41'
         CLI   PFXFFLGS,PFX_KSDS+PFX_INDX CORRECT FLAGS ?
         JE    VEIFFGOK           EXIT IF THEY ARE
* PFXFFLGS IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXFFLGS        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFFGOK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXRFLGS=X'80'
         CLI   PFXRFLGS,PFX_RFIX  FIXED ?
         JE    VEIRFGOK           EXIT IF NOT
* PFXRFLGS IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXRFLGS        R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIRFGOK DS    0H
         ASI   VEROFFST,1         BUMP OFFSET
* PFXAIXN=0 FOR INDEX
         CLI   PFXAIXN,0          AIXN CORRECT ?
         JE    VEIAIXNK           EXIT IF IT IS
* PFXAIXN IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,PFXAIXN         R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIAIXNK DS    0H
         ASI   VEROFFST,1+2       BUMP OFFSET+PADDING
* CTREYE
         CLC   CTREYE,VERCTEYE    EYE=zCTR ?
         JE    VEICTEYK           EXIT IF IT IS
* CTREYE IN ERROR
         LA    R9,4               R9=LENGTH TO DISPLAY
         LA    R4,CTREYE          R4=ADDRESS OF INCORRECT VALUE
         LA    R5,VERCTEYE        R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEICTEYK DS    0H
         ASI   VEROFFST,4+4+10*8  BUMP OFFSET
         ASI   VEROFFST,11*8                  (MISS ALL TO CTRLOKEY@)
         CHHSI CTRLOKEY@,-1       LOKEY@=FOXES ?
         JE    VEILOKYK           EXIT IF IT IS
* CTRLOKEY@ IN ERROR
         LA    R9,2               R9=LENGTH TO DISPLAY
         LA    R4,CTRLOKEY@       R4=ADDRESS OF INCORRECT VALUE
         SR    R5,R5              SHOW 'INVALID'
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEILOKYK DS    0H
* BFTREYE AND SEQ#
         L     R7,VSAMPRFX        R7=PREFIX BLOCK ADDRESS
         AHI   R7,4096-BFTRLENG   R7=ZVSAMFTR
         USING ZVSAMFTR,R7
         MVHI  VEROFFST,4096-BFTRLENG SET OFFSET
* BFTREYE
         CLC   BFTREYE,CNSTFTR    VERIFY BFTREYE ?
         JE    VEIFEYEK           EXIT IF IT IS
* BFTREYE IN ERROR
         LA    R9,3               R9=LENGTH TO DISPLAY
         LA    R4,BFTREYE         R4=ADDRESS OF INCORRECT VALUE
         LA    R5,CNSTFTR         R5=ADDRESS OF CORRECT VALUE
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEIFEYEK DS    0H
         ASI   VEROFFST,3         BUMP OFFSET
* BHDRSEQ#=BFTRSEQ#
         CLC   BHDRSEQ#,BFTRSEQ#  SEQ# MATCHES ?
         JE    VEISEQOK           EXIT IF THEY DO
* SEQ# IN ERROR
         LA    R9,1               R9=LENGTH TO DISPLAY
         LA    R4,BHDRSEQ#        R4=ADDRESS OF BHDRSEQ#
         LA    R5,BFTRSEQ#        R5=ADDRESS OF BFTRSEQ#
         JAS   R14,VERSHOW        BUILD ERROR LINE AND WTO
VEISEQOK DS    0H
         DROP  R7
* VERIFY BLOCK COUNTS AND CHAINS
         L     R2,PFXBLKSZ        R2=(ADJUSTED) INDEX BLKSIZE
         ST    R2,DTAIN+DCBBLKSIF-IHADCB SAVE BLKSIZE
         ST    R2,DTAIN+DCBLRECLF-IHADCB SAVE LRECL
         GETMAIN RU,LV=(R2)
         ST    R1,VSAMDATA        SAVE VSAM INDEX BLOCK ADDRESS
         LFH   R6,VSAMDATA        R6 HIGH=VSAM INDEX BLOCK ADDRESS
         RLLG  R6,R6,32           SWAP VSAMDATA/VSAMPRFX
* R6 IS NOW VSAMDATA
         MVGHI VERSPCCT,0         CLEAR SPACEMAP BLOCK COUNT
         LGHI  R3,-256            BLOCK NUMBER STARTS AT ZERO
VEIBLOOP DS    0H
         GET   DTAIN,(R6)         GET INDEX BLOCK
* CHECK HDR/FTR SEQ# MATCH
         CLC   BHDREYE,CNSTHDR    VERIFY BHDREYE ?
         JNE   VEIHFSBD           EXIT IF NOT
         LR    R7,R2              R7=INDEX BLKSIZE
         AHI   R7,-BFTRLENG       R7=OFFSET OF FTR
         AR    R7,R6              R7=ADDRESS OF FTR
         CLC   0(3,R7),CNSTFTR    VERIFY BFTREYE ?
         JNE   VEIHFSBD           EXIT IF NOT
         CLC   BHDREYE+3(1),3(R7) SEQ# MATCH ?
         JE    VEIHFSOK           EXIT IF NOT
VEIHFSBD DS    0H
* BAD HDR/FTR/SEQ#
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R5,BHDRSELF        BASE-FREE
         LA    R8,VERHFSXL        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,4               R9=LENGTH
         LA    R5,BHDREYE         BASE-FREE
         LA    R8,VERHFSHD        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,BFTRLENG        R9=LENGTH
         LA    R8,VERHFSFT        R8=DESTINATION ADDRESS
         TROT  R8,R7,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERHF)    DISPLAY HDR/FTR/SEQ# ERROR
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VEIHFSOK DS    0H
* COUNT BLOCK TYPES AND VERIFY BHDRSELF
         CLI   BHDRFLG1,BHDR_MAP  IS IT SPACEMAP ?
         JNE   VEINSPAC           EXIT IF NOT
* SPACEMAP BLOCK
         AGSI  VERSPCCT,1         COUNT SPACEMAP BLOCKS
         AGHI  R3,256             BUMP BLOCK NUMBER
* BHDRSELF CHECK
         CG    R3,BHDRSELF        MATCH BHDRSELF ?
         JE    VEIBLOOP           EXIT IF IT DOES
* BHDRSELF IN ERROR
         JAS   R14,VERWTOSF       SHOW BHDRSELF ERROR MESSAGE
         J     VEIBLOOP           LOOP
*
VEINSPAC DS    0H
* INDEX BLOCK
         AGSI  VERIDXCT,1         COUNT INDEX BLOCKS
         AGHI  R3,256             BUMP BLOCK NUMBER
* BHDRXLVL CHECK
         CLI   BHDRXLVL,16        BHDRXLVL LESS THAN 16 ?
         JL    VEIXLVLK           EXIT IF IT IS
* BHDRXLVL IN ERROR
         STG   R3,VERWORK1        SAVE XLRA
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R5,VERWORK1        BASE-FREE
         LA    R8,VERXLVLX        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,1               R9=LENGTH
         LA    R5,BHDRXLVL        BASE-FREE
         LA    R8,VERXLVL         R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERBX)    DISPLAY BHDRXLVL ERROR
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
         J     VEINOLVL           EXIT
*
VEIXLVLK DS    0H
* BHDRFLG1 CHECK
         CLI   BHDRXLVL,0         LEVEL 0 ?
         JNE   VEINOTL0           EXIT IF NOT
* LEVEL 0 (LEAF BLOCK)
         TM    BHDRFLG1,BHDR_INT  INTERMEDIATE BLOCK ?
         JO    VEIFLGBD           ERROR IF IT IS
         TM    BHDRFLG1,BHDR_LEF  LEAF BLOCK ?
         JNO   VEIFLGBD           ERROR IF NOT
         J     VEILVCNT           EXIT
*
VEINOTL0 DS    0H
         RLLG  R5,R6,32           R5=VSAMPRFX
         CLC   BHDRSELF,BHDRLENG+PFXROOT-ZVSAMPFX(R5) ROOT BLOCK ?
         JNE   VEINOTRT           EXIT IF NOT
* ROOT BLOCK
         TM    BHDRFLG1,BHDR_INT  INTERMEDIATE BLOCK ?
         JO    VEIFLGBD           ERROR IF IT IS
         TM    BHDRFLG1,BHDR_ROT  ROOT BLOCK ?
         JNO   VEIFLGBD           ERROR IF NOT
         J     VEILVCNT           EXIT
*
VEINOTRT DS    0H
* INTERMEDIATE BLOCK
         TM    BHDRFLG1,BHDR_LEF  LEAF BLOCK ?
         JO    VEIFLGBD           ERROR IF IT IS
         TM    BHDRFLG1,BHDR_ROT  ROOT BLOCK ?
         JO    VEIFLGBD           ERROR IF IT IS
         TM    BHDRFLG1,BHDR_INT  INTERMEDIATE BLOCK ?
         JNO   VEIFLGBD           ERROR IF NOT
         J     VEILVCNT           EXIT
*
VEIFLGBD DS    0H
* BHDRFLG1 IN ERROR
         STG   R3,VERWORK1        SAVE XLRA
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R5,VERWORK1        BASE-FREE
         LA    R8,VERFLGXL        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,1               R9=LENGTH
         LA    R5,BHDRXLVL        BASE-FREE
         LA    R8,VERFLAGX        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,1               R9=LENGTH
         LA    R5,BHDRFLG1        BASE-FREE
         LA    R8,VERFLAGF        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERFG)    DISPLAY BHDRFLG1 ERROR
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VEILVCNT DS    0H
* COUNT BLOCKS BY LEVEL
         LA    R5,VERIDXLV        BASE-FREE
         LB    R1,BHDRXLVL        R1=BHDRXLVL
         SLL   R1,3               * 8
         AR    R5,R1              R5=INDEXED COUNT
         AGSI  0(R5),1            COUNT BY INDEX LEVEL
VEINOLVL DS    0H
* BHDRSELF CHECK
         CG    R3,BHDRSELF        MATCH BHDRSELF ?
         JE    VEIBLOOP           EXIT IF IT DOES
* BHDRSELF IN ERROR
         JAS   R14,VERWTOSF       SHOW BHDRSELF ERROR MESSAGE
         J     VEIBLOOP           LOOP
*
VEIEOF   DS    0H
* PFXHXLRA CHECK
         RLLG  R6,R6,32           SWAP VSAMDATA/VSAMPRFX
* R6 IS NOW VSAMPRFX
         CG    R3,PFXHXLRA        MATCHES PFXHXLRA ?
         JE    VEIHXLOK           EXIT IF IT DOES
* PFXHXLRA IN ERROR
         STG   R3,VERWORK1        SAVE COUNT
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R5,PFXHXLRA        BASE-FREE
         LA    R8,VERHXLRA        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,8               R9=LENGTH
         LA    R5,VERWORK1        BASE-FREE
         LA    R8,VERHXCNT        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERHX)    DISPLAY PFXHXLRA ERROR
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VEIHXLOK DS    0H
* CHASE THE CHAINS AND CHECK THE COUNTS AND TYPES
* INCLUDING LOOP PROTECTION
*
* CHECK BHDR#REC/RPTREND/FREESPACE
*
* SPACEMAP BLOCKS HAVE BIT PATTERN CHECKS
*
* INDEX LEVEL FORWARD SCAN (PFXBLVLn)
         LA    R4,VERLF           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
* INDEX LEVEL BACKWARD SCAN (PFXELVLn)
         LA    R4,VERLB           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
* SPACEMAP FORWARD SCAN
         LA    R4,VERSF           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
* SPACEMAP BACKWARD SCAN
         LA    R4,VERSB           R4=TYPE/DIRECTION
         JAS   R14,VERCHAIN       CHECK CHAIN
VERCLOSE DS    0H
         CLOSE DTAIN              CLOSE INPUT VSAM DCB
* RE-ESTABLISH MAINLINE BASES
         LM    R12,R13,VERBASES   RESTORE MAINLINE BASES R12, R13
         J     PROGEND            EXIT
VERMOVPF MVC   0(0,R2),0(R4)      MOVE PATH\FILE
VERBASES DS    2F                 SAVE MAINLINE BASES R12, R13
*
VERSHOW  DS    0H
* BUILD ERROR LINE AND WTO
* NO LENGTH WILL BE LARGER THAN 8
*
* INPUT: R4=ADDRESS OF INCORRECT VALUE
*        R5=ADDRESS OF CORRECT VALUE, IF ZERO DISPLAYS 'INVALID'
*        R9=LENGTH TO DISPLAY
*
* DESTROYS: R0 R1 R4 R5 R8 R15
         LR    R0,R9              SAVE R9
         MVI   WTOCOREC,C' '      CLEAR WTOCOREC
         MVC   WTOCOREC+1(66),WTOCOREC           AND WTOINCOR
         ARK   R15,R0,R0          R15=LENGTH*2
         AHI   R15,-1             -1 FOR EXECUTE
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LTR   R5,R5              ANY CORRECT VALUE ?
         JNZ   VERDOCOR           EXIT IF THERE IS
         MVC   WTOCOREC(7),VERINVAL MOVE 'INVALID'
         J     VERDOINC           EXIT
*
VERDOCOR DS    0H
         LA    R8,VERTRANS        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         EXRL  R15,VERMVCC        MOVE CORRECT VALUE
VERDOINC DS    0H
         LA    R8,VERTRANS        R8=DESTINATION ADDRESS
         LR    R9,R0              RESTORE LENGTH
         TROT  R8,R4,1            TRANSLATE TO PRINTABLE HEX
         EXRL  R15,VERMVCI        MOVE INCORRECT VALUE
VERSHOWO DS    0H
         LA    R8,VERTRANS        R8=DESTINATION ADDRESS
         LA    R9,4               LENGTH OF OFFSET
         LA    R4,VEROFFST        R4=SOURCE ADDRESS
         TROT  R8,R4,1            TRANSLATE TO PRINTABLE HEX
         LA    R15,8-1            R15=LENGTH OF OFFSET-1 FOR EXECUTE
         EXRL  R15,VERMVCO        MOVE OFFSET
* DISPLAY HEADER LINE
         CLI   WTOVERH1,X'FF'     HAVE WE DONE IT ?
         JE    VERHDRDK           EXIT IF WE HAVE
         WTO   MF=(E,WTOVERH1)    DISPLAY DATA HEADER LINE
         MVI   WTOVERH1,X'FF'     MARK HEADER DONE
         J     VERHDRIK           EXIT
VERMVCC  MVC   WTOCOREC(0),VERTRANS MOVE CORRECT VALUE
VERMVCI  MVC   WTOINCOR(0),VERTRANS MOVE INCORRECT VALUE
VERMVCO  MVC   WTOOFFST(0),VERTRANS MOVE OFFSET
*
VERHDRDK DS    0H
         CLI   WTOVERH2,X'FF'     HAVE WE DONE IT ?
         JE    VERHDRIK           EXIT IF WE HAVE
         WTO   MF=(E,WTOVERH2)    DISPLAY INDEX HEADER LINE
         MVI   WTOVERH2,X'FF'     MARK HEADER DONE
VERHDRIK DS    0H
* DISPLAY ERROR LINE
         WTO   MF=(E,WTOVEROR)    DISPLAY ERROR LINE
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         BNER  R14                RETURN IF NOT
VERABORT DS    0H
* DISPLAY ERROR LIMIT REACHED
         WTO   MF=(E,WTOVERLM)    DISPLAY ERROR LIMIT REACHED
         J     VERCLOSE           END PROGRAM
*
VERWTOSF DS    0H
* BHDRSELF IN ERROR, DISPLAY ERROR MESSAGE
*
* DESTROYS: R1 R5 R8 R9 R10
         STG   R3,VERWORK1        SAVE XLRA
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R5,BHDRSELF        BASE-FREE
         LA    R8,VERSELF         R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,8               R9=LENGTH
         LA    R5,VERWORK1        BASE-FREE
         LA    R8,VERSFBLK        R8=DESTINATION ADDRESS
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERSF)    DISPLAY BHDRSELF ERROR
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
         BR    R14                RETURN
*
VERCHAIN DS    0H
* CHASE THE CHAINS AND CHECK THE COUNTS AND TYPES
* INCLUDING LOOP PROTECTION
*
* VIA SUBROUTINE VERRPFS CHECK BHDR#REC/RPTREND/FREESPACE FOR DATA,
* INDEX AND SEGMENT BLOCKS
*
* SPACEMAP BLOCKS HAVE BIT PATTERN CHECKS
*
* INPUT: R4  POINTS TO 2-LETTER TYPE/DIRECTION CODE
*        R6 LOW =VSAMPRFX
*        R6 HIGH=VSAMDATA
*
* DESTROYS: R0-R3 R5 R7-R9 R10 HIGH
         ST    R14,VERCHN14       SAVE RETURN ADDRESS
         RLLG  R14,R6,32          R14=VSAMDATA (DATA/INDEX BLOCK)
DATABHDR USING ZVSAMHDR,R14       BASE OF DATA/INDEX BLOCK
         IIHF  R10,VERLIMIT       R10 HIGH=CHAIN LOOP LIMIT
* LOAD ANCHOR POINT
         LG    R2,PFXBDATA        R2=XLRA OF DATA/INDEX FORWARD CHAIN
         CHHSI 0(R4),C'DF'        IS IT DATA FORWARD ?
         JE    VERCHND1           EXIT IF IT IS
         LG    R2,PFXEDATA        R2=XLRA OF DATA/INDEX BACKWARD CHAIN
         CHHSI 0(R4),C'DB'        IS IT DATA BACKWARD ?
         JE    VERCHND1           EXIT IF IT IS
         LG    R2,PFXBSEGM        R2=XLRA OF SEGMENT FORWARD CHAIN
         CHHSI 0(R4),C'GF'        IS IT SEGMENT FORWARD ?
         JE    VERCHND1           EXIT IF IT IS
         LG    R2,PFXESEGM        R2=XLRA OF SEGMENT BACKWARD CHAIN
         CHHSI 0(R4),C'GB'        IS IT SEGMENT BACKWARD ?
         JE    VERCHND1           EXIT IF IT IS
         LG    R2,PFXBMAP         R2=XLRA OF SPACEMAP FORWARD CHAIN
         CHHSI 0(R4),C'SF'        IS IT SPACEMAP FORWARD ?
         JE    VERCHND1           EXIT IF IT IS
         LG    R2,PFXEMAP         R2=XLRA OF SPACEMAP BACKWARD CHAIN
         CHHSI 0(R4),C'SB'        IS IT SPACEMAP BACKWARD ?
         JE    VERCHND1           EXIT IF IT IS
VERLVLLP DS    0H
* MUST BE INDEX LEVEL
         L     R7,VERLEVEL        R7=CURRENT LEVEL
         SLL   R7,4               * 16
         LA    R7,PFXBLVL0(R7)    R7=INDEX LEVEL PAIR
         CGHSI 0(R7),-1           ANY LEVEL CHAIN HERE ?
         JE    VERLVLDN           EXIT IF NONE
* GOT AN INDEX LEVEL PAIR
         CLI   1(R4),C'F'         FORWARDS ?
         JE    VERLVLFW           EXIT IF IT IS
         AHI   R7,8               R7=INDEX LEVEL BACKWARDS
VERLVLFW DS    0H
         LG    R2,0(R7)           R2=XLRA OF LEVEL CHAIN
VERCHND1 DS    0H
         MVGHI VERBITCT,0         CLEAR SPACEMAP BIT COUNT
         SGR   R7,R7              CLEAR R7
VERCHNLP DS    0H
* LOOP THROUGH BLOCKS
         SRLG  R2,R2,8            SHIFT OUT RECORD NUMBER
         MSGF  R2,PFXBLKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R2,4096            + PREFIX SIZE
         STG   R2,VERWORK1        SAVE IT
         POINT DTAIN,RBA=VERWORK1 POINT TO BLOCK
         GET   DTAIN,(R14)        GET DATA/INDEX BLOCK
         AGHI  R7,1               COUNT THEM
         AIH   R10,-1             -1
         JNZ   VERCHNOK           EXIT IF NO LOOP DETECTED SO FAR
*###DUMP BRCTH R10,VERCHNOK       EXIT IF NO LOOP DETECTED SO FAR
*
* LOOP DETECTED
* WTO AND ABORT FURTHER CHAIN TESTS
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
         LA    R5,CONDATA         R5=CONDATA
         CLI   0(R4),C'D'         IS IT DATA ?
         JE    VERCHNT1           EXIT IF IT IS
         LA    R5,CONLEVEL        R5=CONLEVEL
         CLI   0(R4),C'L'         IS IT INDEX LEVEL ?
         JE    VERCHNT1           EXIT IF IT IS
         LA    R5,CONSEGM         R5=CONSEGM
         CLI   0(R4),C'G'         IS IT SEGMENT ?
         JE    VERCHNT1           EXIT IF IT IS
         LA    R5,CONSPACE        R5=CONSPACE
VERCHNT1 DS    0H
         MVC   VERTYPE,0(R5)      MOVE TYPE
         LA    R5,CONFWD          R5=CONFWD
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERCHND2           EXIT IF IT IS
         LA    R5,CONBWD          R5=CONBWD
VERCHND2 DS    0H
         MVC   VERDIR,0(R5)       MOVE DIRECTION
         WTO   MF=(E,WTOVERLP)    DISPLAY LOOP DETECTED
VERCHNCY DS    0H
* DISPLAY 8 XLRA'S IN LOOP IN TWO GROUPS OF 4
         SGR   R0,R0              CLEAR R0
         LA    R8,VERXLRA         R8=VERXLRA
         AHHLR R3,R0,R8           R3 HIGH=POSITION CONTROL
         LA    R5,4               R5=LOOP LIMIT
VERCHNBD DS    0H
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JNE   VERCHND3           EXIT IF NOT
         LA    R2,DATABHDR.BHDRNEXT R2=NEXT XLRA IN LOOP
         J     VERCHNX1           EXIT
*
VERCHND3 DS    0H
         LA    R2,DATABHDR.BHDRPREV R2=PREV XLRA IN LOOP
VERCHNX1 DS    0H
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LG    R2,DATABHDR.BHDRNEXT R2=NEXT XLRA
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERCHND4           EXIT IF IT IS
         LG    R2,DATABHDR.BHDRPREV R2=PREV XLRA
VERCHND4 DS    0H
         SRLG  R2,R2,8            SHIFT OUT RECORD NUMBER
         MSGF  R2,PFXBLKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R2,4096            + PREFIX SIZE
         STG   R2,VERWORK1        SAVE IT
         POINT DTAIN,RBA=VERWORK1 POINT TO BLOCK
         GET   DTAIN,(R14)        GET DATA/INDEX BLOCK
         AIH   R3,17              BUMP XLRA POINTER
         LGR   R8,R3              R8=DESTINATION
         SRLG  R8,R8,32           SHIFT TO LOW
         JCT   R5,VERCHNBD        LOOP
*
         WTO   MF=(E,WTOVERXL)    DISPLAY 4 XLRA'S
         CLI   VERTYPE,X'FF'      2ND 4 DONE ?
         JE    VERRETRN           RETURN IF WE HAVE
         MVI   VERTYPE,X'FF'      MARK 1ST 4 DONE
         J     VERCHNCY           LOOP
*
VERCHNOK DS    0H
* CHECK BLOCK TYPE IS CORRECT FOR CHAIN
         CLI   0(R4),C'D'         IS IT DATA ?
         JNE   VERCHNT4           EXIT IF NOT
* DATA BLOCK
         TM    DATABHDR.BHDRFLG1,BHDR_DTA IS IT DATA ?
         JNO   VERCHNWC           ERROR IF NOT
* DATA BLOCK
         JAS   R14,VERRPFS        CHECK BHDR#REC/RPTREND/FREESPACE
         RLLG  R14,R6,32          R14=VSAMDATA (DATA/INDEX BLOCK)
* IF NON-UNIQUE AIX...
*    IF FIRST SEGMENT, GET THE ELIX BLOCK, CHECK IT IS
*    CHECK BHDRPREV POINTS BACK TO THE DATA BLOCK
*    FOR EACH ELIX ENTRY...
*       COUNT=2, THEN CHECK ENTRY 1=FIRST, ENTRY 2=LAST
*       COUNT=N, THEN CHECK ENTRY 1=FIRST, ENTRIES 2 TO N-1=MIDDLE
*                           ENTRY N=LAST
         CLI   DATABHDR.BHDR#REC,1 1 RECORD ?
         JNE   VERCHNTK           EXIT IF NOT
         LA    R2,DATABHDR.BHDRLENG(R14) R2=RPTR ADDRESS
         USING ZVSAMRPT,R2
         TM    PFXFFLGS,PFX_AIX   IS IT AN AIX ?
         JNO   VERCHNTK           EXIT IF NOT
* AIX
         TM    RPTRFLGS,RPTR_SEG  IS IT A FIRST SEGMENT ?
         JNO   VERCHNTK           EXIT IF NOT
* AIX AND DATA BLOCK IS A FIRST SEGMENT
* GET THE ELIX BLOCK
         LG    R1,RPTRLENG*2(R2)  R1=ELIX XLRA
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,PFXBLKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R1,4096            + PREFIX SIZE
         STG   R1,VERWORK1        SAVE RBA OF ELIX BLOCK
         L     R8,VSAMELIX        R8=ELIX BLOCK AREA
         POINT DTAIN,RBA=VERWORK1 POINT TO ELIX BLOCK
         GET   DTAIN,(R8)         GET ELIX BLOCK
         TM    BHDRFLG2-ZVSAMHDR(R8),BHDR_ELX IS IT AN ELIX BLOCK ?
         JNO   VERELXB1           ERROR IF NOT
* ELIX XLRA DOES POINT TO AN ELIX BLOCK
         LG    R1,BHDRPREV-ZVSAMHDR(R8) R1=ELIX BHDRPREV
         CG    R1,DATABHDR.BHDRSELF ELIX PREV=DATA SELF ?
         JNE   VERELXB2           ERROR IF NOT
* ELIX BHDRPREV=DATA BHDRSELF
*
* CHECK THAT EACH ELIX ENTRY POINTS TO CORRECT TYPE OF BLOCK
         L     R5,BHDRLENG(R8)    R5=ELIX ENTRY COUNT
         LA    R9,1               R9=ELIX ENTRY COUNT TRACKER
         SGR   R0,R0              CLEAR R0
         AHHLR R3,R0,R8           R3 HIGH=ELIX
         AIH   R3,BHDRLENG+4                   ENTRY POINTER
         L     R1,AIXNBSXL        R1=ELEMENT LENGTH
         AHHLR R3,R3,R1           R3 HIGH=ELIX XLRA POINTER
VERELXLP DS    0H
         LGR   R1,R3              R1 HIGH=ELIX XLRA POINTER
         SRLG  R1,R1,32           SHIFT TO LOW
         LG    R1,0(R1)           R1=ELIX XLRA
         SRLG  R1,R1,8            SHIFT OUT RECORD NUMBER
         MSGF  R1,PFXBLKSZ        * (ADJUSTED) DATA BLKSIZE
         ALGFI R1,4096            + PREFIX SIZE
         STG   R1,VERWORK1        SAVE RBA OF ELIX BLOCK
         POINT DTAIN,RBA=VERWORK1 POINT TO SEGMENT BLOCK
         L     R0,VSAMSEGM        R0=SEGMENT BLOCK ADDRESS
         GET   DTAIN,(R0)         GET SEGMENT BLOCK
         AHIK  R2,R0,BHDRLENG     R2=FIRST RPTR
         L     R2,RPTRREC@        R2=SEGMENT OFFSET
         DROP  R2
         ARK   R1,R2,R0           R1=SEGMENT ADDRESS
         USING ZVSAMSPX,R1
* ELIX COUNT TRACKER DETERMINES WHAT KIND OF SEGMENT IT IS
         CFI   R9,1               FIRST SEGMENT EXPECTED ?
         JNE   VERELXNF           EXIT IF NOT
         TM    SPXSEGCC,SPXSFRST  IS IT A FIRST SEGMENT ?
         JNO   VERELXB3           ERROR IF NOT
         J     VERELXIN           EXIT
*
VERELXNF DS    0H
         C     R9,BHDRLENG(R8)    LAST SEGMENT EXPECTED ?
         JNE   VERELXNL           EXIT IF NOT
         TM    SPXSEGCC,SPXSLAST  IS IT A LAST SEGMENT ?
         JNO   VERELXB3           ERROR IF NOT
         J     VERELXIN           EXIT
*
VERELXNL DS    0H
* MUST BE A MIDDLE
         TM    SPXSEGCC,SPXSMIDL  IS IT A MIDDLE SEGMENT ?
         JNO   VERELXB3           ERROR IF NOT
VERELXIN DS    0H
         AHI   R9,1               BUMP ELIX COUNT TRACKER
         L     R1,AIXNBSXL        R1=ELEMENT LENGTH
         AHHLR R3,R3,R1           R3 HIGH=NEXT ELIX
         AIH   R3,8                                 XLRA POINTER
         JCT   R5,VERELXLP        LOOP
*
         J     VERCHNTK           EXIT
*
VERELXB1 DS    0H
* FIRST SEGMENT DOES NOT POINT TO ELIX BLOCK
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         MVC   VERWORK1(8),DATABHDR.BHDRSELF SAVE DATA XLRA
         LA    R8,VERFST1         BASE-FREE
         LA    R5,VERWORK1        R5=VERWORK1
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,8               R9=LENGTH
         LG    R8,RPTRLENG*2(R2)  R8=ELIX XLRA
         STG   R8,VERWORK1        SAVE ELIX XLRA
         LA    R8,VERELIX         BASE-FREE
         LA    R5,VERWORK1        R5=VERWORK1
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERNX)    DISPLAY 1ST SEG NOT POINTING TO ELIX
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
         J     VERCHNTK           EXIT
*
VERELXB2 DS    0H
* ELIX BHDRPREV NOT EQUAL TO DATA BHDRSELF
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         MVC   VERWORK1(8),DATABHDR.BHDRSELF SAVE DATA XLRA
         LA    R8,VERFST2         BASE-FREE
         LA    R5,VERWORK1        R5=VERWORK1
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R5,VERWORK1        R5=VERWORK1
         LA    R9,8               R9=LENGTH
         LG    R8,RPTRLENG*2(R2)  R8=ELIX XLRA
         STG   R8,VERWORK1        SAVE ELIX BHDRPREV
         LA    R8,VERELXPV        BASE-FREE
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERPV)    DISPLAY 1ST SEG NE TO ELIX PREV
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
         J     VERCHNTK           EXIT
*
VERELXB3 DS    0H
* ELIX XLRA NOT POINTING TO CORRECT SEGMENT TYPE
         LR    R15,R9             SAVE R9
         LA    R9,1               R9=LENGTH
         MVC   VERWORK1(1),SPXSEGCC SAVE SPXSEGCC
         DROP  R1
         LR    R0,R8              SAVE R8
         LA    R8,VERELXSX        BASE-FREE
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R5,VERWORK1        R5=VERWORK1
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,8               R9=LENGTH
         LR    R8,R0              RESTORE R8
         MVC   VERWORK1(8),BHDRSELF-ZVSAMHDR(R8) SAVE ELIX BHDRSELF
         LA    R8,VERELIX@        BASE-FREE
         LA    R5,VERWORK1        R5=VERWORK1
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,8               R9=LENGTH
         LGR   R8,R3              R8 HIGH=ELIX XLRA POINTER
         SRLG  R8,R8,32           SHIFT TO LOW
         MVC   VERWORK1(8),0(R8)  SAVE ELIX ELEMENT XLRA
         LA    R8,VERELIXX        BASE-FREE
         LA    R5,VERWORK1        R5=VERWORK1
         TROT  R8,R5,1            TRANSLATE TO PRINTABLE HEX
         LR    R9,R15             RESTORE R9
         LR    R8,R0              RESTORE R8
         WTO   MF=(E,WTOVERX1)    DISPLAY HEADER LINE
         WTO   MF=(E,WTOVERX2)    DISPLAY DATA LINE
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
         J     VERELXIN           EXIT
*
VERCHNT4 DS    0H
         CLI   0(R4),C'L'         IS IT INDEX LEVEL ?
         JNE   VERCHNT2           EXIT IF NOT
* INDEX LEVEL BLOCK
         TM    DATABHDR.BHDRFLG1,BHDR_IDX IS IT INDEX ?
         JNO   VERCHNWC           ERROR IF NOT
         JAS   R14,VERRPFS        CHECK BHDR#REC/RPTREND/FREESPACE
         RLLG  R14,R6,32          R14=VSAMDATA (DATA/INDEX BLOCK)
         J     VERCHNTK           EXIT
*
VERCHNT2 DS    0H
         CLI   0(R4),C'G'         IS IT SEGMENT ?
         JNE   VERCHNT3           EXIT IF NOT
* SEGMENT BLOCK
         TM    DATABHDR.BHDRFLG1,BHDR_DTA+BHDR_SEG IS IT SEGMENT ?
         JNO   VERCHNWC           ERROR IF NOT
         JAS   R14,VERRPFS        CHECK BHDR#REC/RPTREND/FREESPACE
         RLLG  R14,R6,32          R14=VSAMDATA (DATA/INDEX BLOCK)
         J     VERCHNTK           EXIT
*
VERCHNT3 DS    0H
* SPACEMAP BLOCK
         CLI   DATABHDR.BHDRFLG1,BHDR_MAP IS IT SPACEMAP ?
         JNE   VERCHNWC           EXIT IF NOT
* COUNT BIT PATTERNS AND MATCH AGAINST TOTAL RECORDS
         AHIK  R5,R14,BHDRLENG+L'MAPXLRA R5=ADDRESS OF MAPBITS
         L     R8,PFXBLKSZ        R8=END OF
         AR    R8,R14                       BLOCK ADDRESS
         AHI   R8,-BFTRLENG       R8=ADDRESS OF LAST SPACEMAP BYTE
VERBYTLP DS    0H
         SR    R1,R1              CLEAR R1
         LA    R2,4               R2=LOOP COUNT
         ICM   R1,B'1000',0(R5)   R1=MAPBITS BYTE
VERBITLP DS    0H
         SR    R0,R0              CLEAR R0
         SLDL  R0,2               PAIR OF BITS INTO R0
         LTR   R0,R0              ZERO ?
         JZ    VERBIT00           EXIT IF IT IS
         AGSI  VERBITCT,1         COUNT BLOCKS
         JCT   R2,VERBITLP        LOOP THROUGH 4 PAIRS OF BITS
*
         AHI   R5,1               BUMP BYTE POINTER
         CR    R5,R8              END OF SPACEMAP BLOCK ?
         JNH   VERBYTLP           LOOP IF NOT
         J     VERCHNTK           EXIT
*
VERBIT00 DS    0H
* PFXMAPOF CAN ONLY BE DERIVED FROM PFXEMAP
* IF R2=4, THE 1ST TWO BITS ARE 00 AND THE LAST USED IS PREVIOUS BYTE
         CLC   DATABHDR.BHDRSELF,PFXEMAP LAST SPACEMAP BLOCK ?
         JNE   VERBITNL           EXIT IF NOT
* LAST SPACEMAP BLOCK
         CHI   R2,4               1ST TWO BITS ZERO ?
         JNE   VERBITPV           EXIT IF NOT
         AHI   R5,-1              BACK OFF TO PREVIOUS BYTE
VERBITPV DS    0H
         ST    R5,VERWORK2        SAVE ADDR OF LAST USED SPACEMAP BYTE
VERBITNL DS    0H
         LG    R2,DATABHDR.BHDRNEXT R2=NEXT XLRA
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERBITFW           EXIT IF IT IS
         LG    R2,DATABHDR.BHDRPREV R2=PREV XLRA
VERBITFW DS    0H
         CGHI  R2,-1              ANY NEXT/PREVIOUS BLOCK ?
         JNE   VERCHNLP           LOOP IF THERE IS
*
* LAST SPACEMAP BLOCK PROCESSED
* FOR DATA,  ADD DATA+SEGMENT+SPACEMAP BLOCKS
* FOR INDEX, ADD ALL LEVEL BLOCKS+SPACEMAP BLOCKS
         TM    PFXFFLGS,PFX_INDX  INDEX ?
         JNO   VERDTABK           EXIT IF NOT
* SUM INDEX BLOCKS
         SGR   R2,R2              CLEAR R2
         LA    R1,16              R1=LOOP COUNT
         LA    R9,VERIDXLV        R9=VERIDXLV
VERIDXBK DS    0H
         AG    R2,0(R9)           SUM INDEX LEVEL COUNTS
         AHI   R9,8               BUMP POINTER
         JCT   R1,VERIDXBK        LOOP
*
         AG    R2,VERSPCCT        +SPACEMAP BLOCKS
         J     VERBITCK           EXIT
*
VERDTABK DS    0H
* SUM DATA BLOCKS
         LG    R2,VERDTACT        R2=DATA BLOCKS
         AG    R2,VERELXCT        +ELIX BLOCKS
         AG    R2,VERSEGCT        +SEGMENT BLOCKS
         AG    R2,VERSPCCT        +SPACEMAP BLOCKS
VERBITCK DS    0H
         CG    R2,VERBITCT        MATCH TO BIT COUNT ?
         JE    VERBITDN           EXIT IF IT DOES
* BIT COUNT IN ERROR
* DISPLAY BLOCK COUNT DIFFERENCE
         LA    R8,CONFWD          R8=CONFWD
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERBITD1           EXIT IF IT IS
         LA    R8,CONBWD          R8=CONBWD
VERBITD1 DS    0H
         MVC   VERBITDR,0(R8)     MOVE DIRECTION
         LG    R1,VERBITCT        R1=BIT PATTERN COUNT
         CVDG  R1,VERWORK1        CONVERT BIT PATTERN COUNT TO DECIMAL
         MVC   VERBITPT,VEREDIT   MOVE EDIT WORD
         ED    VERBITPT,VERWORK1+10 EDIT BIT PATTERN COUNT
         CVDG  R2,VERWORK1        CONVERT BLOCK COUNT TO DECIMAL
         MVC   VERBITBK,VEREDIT   MOVE EDIT WORD
         ED    VERBITBK,VERWORK1+10 EDIT BLOCK COUNT
         WTO   MF=(E,WTOVERBT)    DISPLAY SPACEMAP BITS NE BLOCK COUNT
         WTO   MF=(E,WTOVERB1)    DISPLAY BIT PATTERN/BLOCK COUNTS
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VERBITDN DS    0H
         L     R5,VERWORK2        LAST BYTE USED IN LAST SPACEMAP BLOCK
         SR    R5,R14             R5=OFFSET OF LAST USED SPACEMAP BYTE
         C     R5,PFXMAPOF        OFFSETS MATCH ?
         JE    VERCHNC2           EXIT IF THEY DO
* DISPLAY PFXMAPOF MISMATCH
         LA    R8,CONFWD          R8=CONFWD
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERPFXD1           EXIT IF IT IS
         LA    R8,CONBWD          R8=CONBWD
VERPFXD1 DS    0H
         MVC   VERPFXDR,0(R8)     MOVE DIRECTION
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,4               R9=LENGTH
         LA    R2,PFXMAPOF        BASE-FREE
         LA    R8,VERPFXMF        R8=DESTINATION ADDRESS
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,4               R9=LENGTH
         LA    R2,VERWORK1        BASE-FREE
         ST    R5,VERWORK1        SAVE CALCULATED PFXMAPOF
         LA    R8,VERPFXCC        R8=DESTINATION ADDRESS
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVEROF)    DISPLAY SPACEMAP PFXMAPOF MISMATCH
         WTO   MF=(E,WTOVERO1)    DISPLAY PFXMAPOF/CALCULATED
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
         J     VERCHNC2           EXIT
*
VERCHNWC DS    0H
* DISPLAY BLOCK ON WRONG CHAIN
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R2,DATABHDR.BHDRSELF R2=XLRA
         LA    R8,VERXLRAW        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LA    R5,CONDATA         R5=CONDATA
         CLI   0(R4),C'D'         IS IT DATA ?
         JE    VERCHNW1           EXIT IF IT IS
         LA    R5,CONLEVEL        R5=CONLEVEL
         CLI   0(R4),C'L'         IS IT INDEX LEVEL ?
         JE    VERCHNW1           EXIT IF IT IS
         LA    R5,CONSEGM         R5=CONSEGM
         CLI   0(R4),C'G'         IS IT SEGMENT ?
         JE    VERCHNW1           EXIT IF IT IS
         LA    R5,CONSPACE        R5=CONSPACE
VERCHNW1 DS    0H
         MVC   VERTYPEW,0(R5)     MOVE TYPE
         LA    R9,1               R9=LENGTH
         LA    R2,DATABHDR.BHDRFLG1 R2=BHDRFLG1
         LA    R8,VERFLGSW        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERWC)    DISPLAY BLOCK ON WRONG CHAIN
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VERCHNTK DS    0H
         LG    R2,DATABHDR.BHDRNEXT R2=NEXT XLRA
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERCHND5           EXIT IF IT IS
         LG    R2,DATABHDR.BHDRPREV R2=PREV XLRA
VERCHND5 DS    0H
         CGHI  R2,-1              ANY NEXT/PREVIOUS BLOCK ?
         JNE   VERCHNLP           LOOP IF THERE IS
* CHECK SEQUENTIAL COUNT VS ANCHOR COUNT
         CLI   0(R4),C'D'         IS IT DATA ?
         JNE   VERCHNC4           EXIT IF NOT
* DATA BLOCK
         CG    R7,VERDTACT        CORRECT NUMBER ?
         JE    VERRETRN           RETURN IF IT IS
* DATA CHAINING CAUSED COUNT DIFFERENCE
         MVC   VERTYPC2,CONDATA   MOVE TYPE
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERANCCT,VEREDIT   MOVE EDIT WORD
         ED    VERANCCT,VERWORK1+10 EDIT ANCHOR COUNT
         LG    R7,VERDTACT        R7=DATA BLOCK COUNT
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERSEQCT,VEREDIT   MOVE EDIT WORD
         ED    VERSEQCT,VERWORK1+10 EDIT SEQUENTIAL COUNT
         J     VERCTWTO           EXIT
*
VERCHNC4 DS    0H
         CLI   0(R4),C'L'         IS IT INDEX LEVEL ?
         JNE   VERCHNC1           EXIT IF NOT
* INDEX LEVEL BLOCK
         L     R8,VERLEVEL        R8=INDEX LEVEL
         CVD   R8,VERWORK1        CONVERT INDEX LEVEL TO DECIMAL
         MVC   VERWORK2(4),VEREDLVL MOVE EDIT WORD
         ED    VERWORK2(4),VERWORK1+5 EDIT INDEX LEVEL
         MVC   CONLEVEL+6(2),VERWORK2+2 MOVE INDEX LEVEL INTO CONSTANT
         SLL   R8,3               INDEX LEVEL * 8
         LA    R5,VERIDXLV        R5=INDEX LEVEL COUNTS
         AR    R5,R8              R5=INDEX LEVEL COUNT POINTER
         MVC   VERWORK2,0(R5)     SAVE INDEX LEVEL COUNT
         CG    R7,0(R5)           CORRECT NUMBER ?
         JE    VERLVLOK           EXIT IF IT IS
* INDEX LEVEL CHAINING CAUSED COUNT DIFFERENCE
         MVC   VERTYPC2,CONLEVEL  MOVE TYPE
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERANCCT,VEREDIT   MOVE EDIT WORD
         ED    VERANCCT,VERWORK1+10 EDIT ANCHOR COUNT
         LG    R7,VERWORK2        R7=INDEX LEVEL BLOCK COUNT
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERSEQCT,VEREDIT   MOVE EDIT WORD
         ED    VERSEQCT,VERWORK1+10 EDIT SEQUENTIAL COUNT
         J     VERCTWTO           EXIT
*
VERCHNC1 DS    0H
         CLI   0(R4),C'G'         IS IT SEGMENT ?
         JNE   VERCHNC2           EXIT IF NOT
* SEGMENT BLOCK
         CG    R7,VERSEGCT        CORRECT NUMBER ?
         JE    VERRETRN           RETURN IF IT IS
* SEGMENT CHAINING CAUSED COUNT DIFFERENCE
         MVC   VERTYPC2,CONSEGM   MOVE TYPE
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERANCCT,VEREDIT   MOVE EDIT WORD
         ED    VERANCCT,VERWORK1+10 EDIT ANCHOR COUNT
         LG    R7,VERSEGCT        R7=SEGMENT BLOCK COUNT
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERSEQCT,VEREDIT   MOVE EDIT WORD
         ED    VERSEQCT,VERWORK1+10 EDIT SEQUENTIAL COUNT
         J     VERCTWTO           EXIT
*
VERCHNC2 DS    0H
* SPACEMAP BLOCK
         CG    R7,VERSPCCT        CORRECT NUMBER ?
         JE    VERRETRN           RETURN IF IT IS
* SPACEMAP CHAINING CAUSED COUNT DIFFERENCE
         MVC   VERTYPC2,CONSPACE  MOVE TYPE
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERANCCT,VEREDIT   MOVE EDIT WORD
         ED    VERANCCT,VERWORK1+10 EDIT ANCHOR COUNT
         LG    R7,VERSPCCT        R7=SPACEMAP BLOCK COUNT
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERSEQCT,VEREDIT   MOVE EDIT WORD
         ED    VERSEQCT,VERWORK1+10 EDIT SEQUENTIAL COUNT
VERCTWTO DS    0H
* DISPLAY COUNT DIFFERENCE MESSAGES
         LA    R5,CONFWD          R5=CONFWD
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERCHNC3           EXIT IF IT IS
         LA    R5,CONBWD          R5=CONBWD
VERCHNC3 DS    0H
         MVC   VERDIRC2,0(R5)     MOVE DIRECTION
         WTO   MF=(E,WTOVERC1)    DISPLAY HEADER
         WTO   MF=(E,WTOVERC2)    DISPLAY TYPE/DIRECTION
         WTO   MF=(E,WTOVERC3)    DISPLAY SEQUENTIAL COUNT
         WTO   MF=(E,WTOVERC4)    DISPLAY ANCHOR COUNT
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VERLVLOK DS    0H
         CLI   0(R4),C'L'         IS IT INDEX LEVEL ?
         JNE   VERRETRN           RETURN IF NOT
         ASI   VERLEVEL,1         BUMP INDEX LEVEL
         CHSI  VERLEVEL,16        DONE THEM ALL ?
         JNE   VERLVLLP           LOOP IF NOT
VERLVLDN DS    0H
* END OF INDEX LEVELS
* CHECK THAT THE SUM OF LEVEL BLOCKS=NO. OF INDEX BLOCKS
         SGR   R1,R1              CLEAR R1
         LA    R8,VERIDXLV        R8=INDEX LEVEL COUNTS
         LA    R9,16              R9=LEVEL COUNT
VERLVLCK DS    0H
         AG    R1,0(R8)           SUM LEVEL COUNTS
         AHI   R8,8               BUMP LEVEL COUNT
         JCT   R9,VERLVLCK        LOOP
*
         CG    R1,VERIDXCT        CORRECT NUMBER ?
         JE    VERLVLRT           EXIT IF IT IS
* INDEX CHAINING CAUSED COUNT DIFFERENCE
         MVC   VERTYPC2,CONINDEX  MOVE TYPE
         CVDG  R1,VERWORK1        CONVERT TO DECIMAL
         MVC   VERANCCT,VEREDIT   MOVE EDIT WORD
         ED    VERANCCT,VERWORK1+10 EDIT ANCHOR COUNT
         LG    R7,VERIDXCT        R7=INDEX BLOCK COUNT
         CVDG  R7,VERWORK1        CONVERT TO DECIMAL
         MVC   VERSEQCT,VEREDIT   MOVE EDIT WORD
         ED    VERSEQCT,VERWORK1+10 EDIT SEQUENTIAL COUNT
         MVI   0(R4),C'X'         ENSURE WE DON'T LOOP
         J     VERCTWTO           EXIT
*
VERLVLRT DS    0H
* CHECK LAST INDEX LEVEL PROCESSED PFXROOT=PFXBLVLn=PFXELVLn
         AHI   R7,-16             BACK OFF TO LAST USED PAIR
         CLC   PFXROOT,0(R7)      PFXROOT=PFXBLVLn ?
         JNE   VERRTBAD           EXIT IF NOT
         CLC   PFXROOT,8(R7)      PFXROOT=PFXELVLn ?
         JE    VERRETRN           RETURN IF IT IS
VERRTBAD DS    0H
* PFXROOT MISMATCH
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,8               R9=LENGTH
         LA    R2,PFXROOT         R2=PFXROOT
         LA    R8,VERPFXRT        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,8               R9=LENGTH
         LR    R2,R7              R2=PFXBLVLn
         LA    R8,VERBLVL         BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,8               R9=LENGTH
         LA    R2,8(R7)           R2=PFXELVLn
         LA    R8,VERELVL         BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERP1)    DISPLAY HEADER
         WTO   MF=(E,WTOVERP2)    DISPLAY PFXROOT
         WTO   MF=(E,WTOVERP3)    DISPLAY PFXBLVLn
         WTO   MF=(E,WTOVERP4)    DISPLAY PFXELVLn
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VERRETRN DS    0H
         L     R14,VERCHN14       RESTORE R14
         BR    R14                RETURN
VERCHN14 DS    F                  SAVE RETURN ADDESS
*
VERRPFS  DS    0H
* CHECK BHDR#REC/RPTREND/FREESPACE
*
* INPUT: R4 POINTS TO TYPE/DIRECTION CODE
*
* DESTROYS: R0 R1 R2 R5 R8 R9
         ST    R14,VERSAV14       SAVE R14
         RLLG  R14,R6,32          R14=VSAMDATA (DATA/INDEX BLOCK)
         LLC   R2,DATABHDR.BHDR#REC R2=NO. OF RECORDS
         MHI   R2,RPTRLENG        *RPTR'S
         LA    R2,BHDRLENG(R14,R2) R2=ADDRESS OF RPTREND
         CLI   0(R2),RPTR_END     RPTREND ?
         JNE   VERRPTBD           EXIT IF NOT
         CHSI  1(R2),-1           RPTRREC@=FOXES ?
         JE    VERFSPAC           EXIT IF IT IS
VERRPTBD DS    0H
* RPTREND NOT WHERE EXPECTED
         MVC   VERWORK1+10(5),0(R2) SAVE BAD RPTREND
         SR    R2,R14             R2=OFFSET OF RPTREND
         ST    R2,VERWORK1        SAVE IT
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,4               R9=LENGTH
         LA    R2,VERWORK1        R2=OFFSET
         LA    R8,VERRPEXO        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,5               R9=LENGTH
         LA    R2,VERWORK1+10     R2=BAD RPTREND
         LA    R8,VERRPEXD        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LA    R5,CONDATA         R5=CONDATA
         CLI   0(R4),C'D'         IS IT DATA ?
         JE    VERRPTT1           EXIT IF IT IS
         LA    R5,CONINDEX        R5=CONINDEX
         CLI   0(R4),C'I'         IS IT INDEX ?
         JE    VERRPTT1           EXIT IF IT IS
         LA    R5,CONSEGM         R5=CONSEGM
VERRPTT1 DS    0H
         MVC   VERTYPR1,0(R5)     MOVE TYPE
         LA    R5,CONFWD          R5=CONFWD
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERRPTD2           EXIT IF IT IS
         LA    R5,CONBWD          R5=CONBWD
VERRPTD2 DS    0H
         MVC   VERDIRR1,0(R5)     MOVE DIRECTION
         LA    R9,8               R9=LENGTH
         LA    R2,DATABHDR.BHDRSELF BASE-FREE
         LA    R8,VERXLRR1        R8=DESTINATION ADDRESS
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERRP)    DISPLAY RPTREND NOT WHERE EXPECTED
         WTO   MF=(E,WTOVERR1)    DISPLAY TYPE/DIRECTION/XLRA
         WTO   MF=(E,WTOVERRE)    DISPLAY EXPECTED AT
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VERFSPAC DS    0H
* CHECK FREESPACE (ASSUMES CONSOLIDATED)
         LA    R2,BHDRLENG(R14)   R2=ADDRESS OF RPTR'S
         USING ZVSAMRPT,R2
* SEGMENT BLOCK AND THERE ARE RECORDS
* SEARCH RPTR'S FOR LOWEST OFFSET
         L     R5,PFXBLKSZ        R5=(ADJUSTED) DATA BLKSIZE
         AHI   R5,-BFTRLENG       R5=MAX DATA OFFSET IF NO RPTR'S
         SR    R0,R0              CLEAR R0
VERDFLOP DS    0H
         CLI   RPTRFLGS,RPTR_END  GOT TO END ?
         JE    VERDFCLC           EXIT IF WE HAVE
         L     R0,RPTRREC@        R0=OFFSET TO RECORD
         CR    R0,R5              LOWER ?
         JNL   VERDFINC           EXIT IF NOT
         LR    R5,R0              R5=LOWER OFFSET
VERDFINC DS    0H
         AHI   R2,RPTRLENG        BUMP RPTR POINTER
         J     VERDFLOP           LOOP
*
VERDFCLC DS    0H
* MATCH FREESPACE OFFSET AND FREESPACE
         L     R8,DATABHDR.BHDRFRE@ R8=FREESPACE OFFSET
         AR    R5,R14             R5=LOWEST DATA ADDRESS
* CATER FOR FIRST SEGMENT ELIX POINTER
         CLI   0(R4),C'D'         IS IT DATA ?
         JNE   VERRPTND           EXIT IF NOT
* DATA CHAIN
         AHI   R2,-RPTRLENG       BACK OFF TO 1ST RPTR
         TM    PFXFFLGS,PFX_AIX   IS IT AN AIX ?
         JNO   VERRPTNS           EXIT IF NOT
* AIX
         TM    RPTRFLGS,RPTR_SEG  FIRST SEGMENT ?
         JNO   VERRPTNS           EXIT IF NOT
* AIX, DATA CHAIN AND FIRST SEGMENT
         AHI   R2,RPTRLENG+8      ADJUST ADDRESS FOR ELIX POINTER
         J     VERRPTND           EXIT
         DROP  R2
*
VERRPTNS DS    0H
* NOT AIX
* --OR--
* DATA CHAIN AND NOT FIRST SEGMENT
         AHI   R2,RPTRLENG        R2=ADDRESS OF RPTREND
VERRPTND DS    0H
         AHI   R2,RPTRLENG        R2=ADDRESS AFTER RPTREND+ELIX PTR
         LR    R9,R2              R9=OFFSET AFTER
         SR    R9,R14                             RPTREND
         SR    R5,R2              R5=FREESPACE
         L     R0,DATABHDR.BHDRFREE R0=FREESPACE
         CR    R8,R9              BHDRFRE@=CALCULATED OFFSET ?
         JNE   VERDFBAD           EXIT IF NOT
         CR    R0,R5              BHDRFREE=CALCULATED FREESPACE ?
         JE    VERRPRET           EXIT IF IT DOES
VERDFBAD DS    0H
* FREESPACE OFFSET OR VALUES MISMATCHED
         LA    R2,VERWORK1        R2=BHDRFRE@
         STM   R8,R9,VERWORK1     SAVE OFFSETS
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R9,4               R9=LENGTH
         LA    R8,VEROFFS1        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LA    R9,4               R9=LENGTH
         LA    R2,VERWORK1+4      R2=CALC OFFSET
         LA    R8,VEROFFS2        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         ST    R0,VERWORK1        SAVE BHDRFREE
         LA    R9,4               R9=LENGTH
         LA    R2,VERWORK1        R2=BHDRFREE
         LA    R8,VERFSPS1        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         ST    R5,VERWORK1        SAVE CALC FREESPACE
         LA    R9,4               R9=LENGTH
         LA    R2,VERWORK1        R2=CALC FREESPACE
         LA    R8,VERFSPS2        BASE-FREE
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         LA    R5,CONDATA         R5=CONDATA
         CLI   0(R4),C'D'         IS IT DATA ?
         JE    VERRPTT2           EXIT IF IT IS
         LA    R5,CONSEGM         R5=CONSEGM
VERRPTT2 DS    0H
         MVC   VERTYPR1,0(R5)     MOVE TYPE
         LA    R5,CONFWD          R5=CONFWD
         CLI   1(R4),C'F'         IS IT FORWARD ?
         JE    VERRPTD3           EXIT IF IT IS
         LA    R5,CONBWD          R5=CONBWD
VERRPTD3 DS    0H
         MVC   VERDIRR1,0(R5)     MOVE DIRECTION
         LA    R9,8               R9=LENGTH
         LA    R2,DATABHDR.BHDRSELF BASE-FREE
         LA    R8,VERXLRR1        R8=DESTINATION ADDRESS
         TROT  R8,R2,1            TRANSLATE TO PRINTABLE HEX
         WTO   MF=(E,WTOVERFS)    DISPLAY FSPACE OFFSET/VALUE MISMATCH
         WTO   MF=(E,WTOVERR1)    DISPLAY TYPE/DIRECTION/XLRA
         WTO   MF=(E,WTOVERF1)    DISPLAY BHDRFRE@/CALC VALUE
         WTO   MF=(E,WTOVERF2)    DISPLAY BHDRFREE/CALC VALUE
         ASI   VERCOUNT,1         COUNT ERRORS
         CHSI  VERCOUNT,VERERMAX  MAXIMUM REACHED ?
         JE    VERABORT           EXIT IF WE HAVE
VERRPRET DS    0H
         DROP  DATABHDR
         L     R14,VERSAV14       RESTORE R14
         BR    R14                RETURN
VERSAV14 DS    F
*
OPENWTOV DS    0H
* WTO OPEN MESSAGE (VERIFY)
*
* INPUT: R1 POINTS TO PATH,X'00'
*
* DESTROYS: R0 R1 R5
         LA    R5,FILEDSN         BASE-FREE
         XC    FILEDSN,FILEDSN    CLEAR PATH NAME
         SR    R0,R0              X'00' IS STOPPER
         MVST  R5,R1              MOVE PATH NAME
         WTO   MF=(E,WTOOPEND)    SHOW IT
         BR    R14                RETURN
*
VEREOFAD DC    AL4(VEREOF)        DATA EOF ADDRESS
VEIEOFAD DC    AL4(VEIEOF)        INDEX EOF ADDRESS
VERINVAL DC    C'INVALID'
*
VEROFFST DC    AL4(0)             OFFSET
VERTRANS DS    CL32               TRANSLATE AREA
VERFILE  DC    XL128'00'          BUILD INPUT PATH\FILE AREA
VERCOUNT DC    A(0)               COUNT ERRORS
VERERMAX EQU   50                 MAXIMUM ERRORS BEFORE ABORT
VERPXEYE DC    C'zPFX'
VERCTEYE DC    C'zCTR'
*
* COUNTS OF BLOCK TYPES
VERDTACT DC    D'0'               DATA BLOCKS
VERELXCT DC    D'0'               ELIX BLOCKS
VERIDXCT DC    D'0'               INDEX BLOCKS
VERSEGCT DC    D'0'               SEGMENT BLOCKS
VERSPCCT DC    D'0'               SPACEMAP BLOCKS
VERBITCT DC    D'0'               SPACEMAP BIT PATTERN COUNT (NOT 00)
*
VERIDXLV DC    16D'0'             INDEX BLOCK COUNTS BY LEVEL
*
VERLIMIT EQU   100000             CHAIN LOOP LIMIT
* CHAIN TYPE/DIRECTION CODES
VERDF    DC    C'DF'              DATA        FORWARDS
VERDB    DC    C'DB'              DATA        BACKWARDS
VERLF    DC    C'LF'              INDEX LEVEL FORWARDS
VERLB    DC    C'LB'              INDEX LEVEL BACKWARDS
VERGF    DC    C'GF'              SEGMENT     FORWARDS
VERGB    DC    C'GB'              SEGMENT     BACKWARDS
VERSF    DC    C'SF'              SPACEMAP    FORWARDS
VERSB    DC    C'SB'              SPACEMAP    BACKWARDS
VEREDIT  DC    X'402020202020202020202120'
VEREDLVL DC    X'40202120'
VERLEVEL DC    AL4(0)             INDEX LEVEL
VERWORK1 DS    XL16
VERWORK2 DS    XL8
*
* HEX TRANSLATE TABLE
*
         DS    0D
TRANHEX  DC    C'000102030405060708090A0B0C0D0E0F'  00-0F
         DC    C'101112131415161718191A1B1C1D1E1F'  10-1F
         DC    C'202122232425262728292A2B2C2D2E2F'  20-2F
         DC    C'303132333435363738393A3B3C3D3E3F'  30-3F
         DC    C'404142434445464748494A4B4C4D4E4F'  40-4F
         DC    C'505152535455565758595A5B5C5D5E5F'  50-5F
         DC    C'606162636465666768696A6B6C6D6E6F'  60-6F
         DC    C'707172737475767778797A7B7C7D7E7F'  70-7F
         DC    C'808182838485868788898A8B8C8D8E8F'  80-8F
         DC    C'909192939495969798999A9B9C9D9E9F'  90-9F
         DC    C'A0A1A2A3A4A5A6A7A8A9AAABACADAEAF'  A0-AF
         DC    C'B0B1B2B3B4B5B6B7B8B9BABBBCBDBEBF'  B0-BF
         DC    C'C0C1C2C3C4C5C6C7C8C9CACBCCCDCECF'  C0-CF
         DC    C'D0D1D2D3D4D5D6D7D8D9DADBDCDDDEDF'  D0-DF
         DC    C'E0E1E2E3E4E5E6E7E8E9EAEBECEDEEEF'  E0-EF
         DC    C'F0F1F2F3F4F5F6F7F8F9FAFBFCFDFEFF'  F0-FF
*
WTOVERH1 DC    AL2(WTOVH1EN-*,0)
         DC    C'zREPRO VERIFY DATA PREFIX BLOCK'
WTOVH1EN EQU   *
*
WTOVERH2 DC    AL2(WTOVH2EN-*,0)
         ORG   *-4
         DC    X'FF'              MARK IT SHOWN
         ORG
         DC    C'zREPRO VERIFY INDEX PREFIX BLOCK'
WTOVH2EN EQU   *
*
WTOVEROR DC    AL2(WTOVEEEN-*,0)
         DC    C'  '
WTOOFFST DC    C'00000000'
         DC    C'  '
WTOCOREC DC    CL32' '
         DC    C'  '
WTOINCOR DC    CL32' '
WTOVEEEN EQU   *
*
WTOVERLM DC    AL2(WTOVLMEN-*,0)
         DC    C'zREPRO VERIFY ERROR LIMIT REACHED'
WTOVLMEN EQU   *
*
WTOVERSE DC    AL2(WTOVSEEN-*,0)
         DC    C'zREPRO VERIFY WARNING:SPANNED AND NO SEGMENTS CREATED'
WTOVSEEN EQU   *
*
WTOVERHF DC    AL2(WTOVHFEN-*,0)
         DC    C'HDR/FTR/SEQ# ERROR XLRA='
VERHFSXL DS    CL16
         DC    C'  '
VERHFSHD DS    CL8
         DC    C'  '
VERHFSFT DS    CL8
WTOVHFEN EQU   *
*
WTOVERHX DC    AL2(WTOVHXEN-*,0)
         DC    C'PFXHXLRA ERROR XLRA='
VERHXLRA DS    CL16
         DC    C'  COUNT='
VERHXCNT DS    CL16
WTOVHXEN EQU   *
*
WTOVERSF DC    AL2(WTOVSFEN-*,0)
         DC    C'BHDRSELF ERROR XLRA='
VERSELF  DS    CL16
         DC    C'  BLOCK='
VERSFBLK DS    CL16
WTOVSFEN EQU   *
*
WTOVERLP DC    AL2(WTOVLPEN-*,0)
         DC    C'LOOP DETECTED CHAIN='
VERTYPE  DS    CL8
         DC    C'  DIRECTION='
VERDIR   DS    CL8
WTOVLPEN EQU   *
*
WTOVERXL DC    AL2(WTOVXLEN-*,0)
VERXLRA  DC    4CL17' '           4 XLRA'S ON EACH OF 2 LINES
WTOVXLEN EQU   *
*
WTOVERWC DC    AL2(WTOVWCEN-*,0)
         DC    C'BLOCK ON WRONG CHAIN XLRA='
VERXLRAW DS    CL16
         DC    C' TYPE='
VERTYPEW DS    CL8
         DC    C' BHDRFLG1='
VERFLGSW DS    CL2
WTOVWCEN EQU   *
*
WTOVERC1 DC    AL2(WTOVC1EN-*,0)
         DC    C'BLOCK COUNT VIA SEQUENTIAL READ DIFFERS FROM'
         DC    C' BLOCK COUNT VIA ANCHOR'
WTOVC1EN EQU   *
*
WTOVERC2 DC    AL2(WTOVC2EN-*,0)
         DC    C'   TYPE='
VERTYPC2 DS    CL8
         DC    C'  DIRECTION='
VERDIRC2 DS    CL8
WTOVC2EN EQU   *
*
WTOVERC3 DC    AL2(WTOVC3EN-*,0)
         DC    C'   SEQUENTIAL READ= '
VERSEQCT DS    CL12
WTOVC3EN EQU   *
*
WTOVERC4 DC    AL2(WTOVC4EN-*,0)
         DC    C'       ANCHOR READ= '
VERANCCT DS    CL12
WTOVC4EN EQU   *
*
WTOVERRP DC    AL2(WTOVRPEN-*,0)
         DC    C'RPTREND NOT WHERE EXPECTED'
WTOVRPEN EQU   *
*
WTOVERR1 DC    AL2(WTOVR1EN-*,0)
         DC    C'   TYPE='
VERTYPR1 DS    CL8
         DC    C'  DIRECTION='
VERDIRR1 DS    CL8
         DC    C'   XLRA='
VERXLRR1 DS    CL16
WTOVR1EN EQU   *
*
WTOVERRE DC    AL2(WTOVREEN-*,0)
         DC    C'   EXPECTED AT  '
VERRPEXO DS    CL8
         DC    C'  '
VERRPEXD DS    CL10
WTOVREEN EQU   *
*
WTOVERFS DC    AL2(WTOVFSEN-*,0)
         DC    C'FREESPACE OFFSET OR VALUE MISMATCH'
WTOVFSEN EQU   *
*
WTOVERF1 DC    AL2(WTOVF1EN-*,0)
         DC    C'   BHDRFRE@='
VEROFFS1 DS    CL8
         DC    C'   CALCULATED='
VEROFFS2 DS    CL8
WTOVF1EN EQU   *
*
WTOVERF2 DC    AL2(WTOVF2EN-*,0)
         DC    C'   BHDRFREE='
VERFSPS1 DS    CL8
         DC    C'   CALCULATED='
VERFSPS2 DS    CL8
WTOVF2EN EQU   *
*
WTOVERBT DC    AL2(WTOVBTEN-*,0)
         DC    C'SPACEMAP BITS NOT EQUAL TO NUMBER OF BLOCKS'
WTOVBTEN EQU   *
*
WTOVERB1 DC    AL2(WTOVB1EN-*,0)
         DC    C'  DIRECTION='
VERBITDR DS    CL8
         DC    C'   BIT PATTERNS='
VERBITPT DS    CL12
         DC    C' BLOCKS='
VERBITBK DS    CL12
WTOVB1EN EQU   *
*
WTOVEROF DC    AL2(WTOVOFEN-*,0)
         DC    C'SPACEMAP PFXMAPOF MISMATCH'
WTOVOFEN EQU   *
*
WTOVERO1 DC    AL2(WTOVO1EN-*,0)
         DC    C'  DIRECTION='
VERPFXDR DS    CL8
         DC    C'   PFXMAPOF='
VERPFXMF DS    CL8
         DC    C' CALCULATED='
VERPFXCC DS    CL8
WTOVO1EN EQU   *
*
WTOVERBX DC    AL2(WTOVBXEN-*,0)
         DC    C'BHDRXLVL ERROR XLRA='
VERXLVLX DS    CL16
         DC    C' XLVL='
VERXLVL  DS    CL2
WTOVBXEN EQU   *
*
WTOVERFG DC    AL2(WTOVFGEN-*,0)
         DC    C'BHDRFLG1 ERROR XLRA='
VERFLGXL DS    CL16
         DC    C' XLVL='
VERFLAGX DS    CL2
         DC    C' FLGS='
VERFLAGF DS    CL2
WTOVFGEN EQU   *
*
WTOVERP1 DC    AL2(WTOVP1EN-*,0)
         DC    C'PFXROOT MISMATCH'
WTOVP1EN EQU   *
*
WTOVERP2 DC    AL2(WTOVP2EN-*,0)
         DC    C' PFXROOT ='
VERPFXRT DS    CL16
WTOVP2EN EQU   *
*
WTOVERP3 DC    AL2(WTOVP3EN-*,0)
         DC    C' PFXBLVLn='
VERBLVL  DS    CL16
WTOVP3EN EQU   *
*
WTOVERP4 DC    AL2(WTOVP4EN-*,0)
         DC    C' PFXELVLn='
VERELVL  DS    CL16
WTOVP4EN EQU   *
*
WTOVERNX DC    AL2(WTOVNXEN-*,0)
         DC    C'FIRST SEGMENT AT  '
VERFST1  DS    CL16
         DC    C'  DOES NOT POINT TO ELIX BLOCK AT '
VERELIX  DS    CL16
WTOVNXEN EQU   *
*
WTOVERPV DC    AL2(WTOVPVEN-*,0)
         DC    C'FIRST SEGMENT AT  '
VERFST2  DS    CL16
         DC    C'  NOT POINTED TO BY ELIX BHDRPREV '
VERELXPV DS    CL16
WTOVPVEN EQU   *
*
WTOVERX1 DC    AL2(WTOVX1EN-*,0)
         DC    C'ELIX XLRA NOT POINTING TO CORRECT SEGMENT TYPE'
WTOVX1EN EQU   *
*
WTOVERX2 DC    AL2(WTOVX2EN-*,0)
         DC    C'  ELIX AT '
VERELIX@ DS    CL16
         DC    C'  ELIX ELEMENT XLRA='
VERELIXX DS    CL16
         DC    C' SPXSEGCC='
VERELXSX DS    CL2
WTOVX2EN EQU   *
*
CONDATA  DC    CL8'DATA'
CONINDEX DC    CL8'INDEX'
CONLEVEL DC    CL8'LEVEL NN'
CONSEGM  DC    CL8'SEGMENT'
CONSPACE DC    CL8'SPACEMAP'
CONFWD   DC    CL8'FORWARD'
CONBWD   DC    CL8'BACKWARD'
*
WTOINFDS DSECT
WTOVRFX  DS    CL9
WTOXXDS  DS    CL5
WTONSPAN DS    CL12
WTOQVSAM DS    CL15
WTORECFM DS    CL2
         DS    CL6
WTODLREC DS    CL8
*
         VCDTD2 ,                 VSAM CATALOG STRUCTURES
         ZVSAMHDR                 HEADER DSECT
         ZVSAMPFX                 PREFIX DSECT
         ZVSAMFTR                 FOOTER DSECT
         ZVSAMMAP                 SPACEMAP DSECT
         ZVSAMRPT                 RECORD POINTER DSECT
         ZVSAMSPX                 SEGMENT PREFIX
*
         DECBD ,                  DECB DSECT
*
         EQUREGS
         END
