ESF1   SUBENTRY
       WTO 'TEST ESF1.390 IN SAME DIRECTORY AS REPO REF TO ESF1.???'
       WTO 'REPRO WILL LOAD ESF1 AND CHECK FOR VCDT PREFIX'
       SUBEXIT
       END
