FILEERTB DS    0F
*                RPLFEEDB  RESP  RESP2
         DC    X'00080004',F'20',F'90',CL8'ENDFILE' END-OF-FILE
         DC    X'00080010',F'13',F'80',CL8'NOTFND'  RRDS INVALID RRN
         DC    X'00080020',F'13',F'80',CL8'NOTFND'  ESDS INVALID RBA
         DC    X'00080068',F'21',F'110',CL8'ILLOGIC' ANY INVALID OPT
         DC    X'0008006C',F'13',F'80',CL8'NOTFND'  INVALID LRECL
         DC    X'FF'              STOPPER
