***********************************************************************
* Copyright 2006 Automated Software Tools Corporation                 *
* This source code is part of z390 assembler/emulator package         *
* The z390 package is distributed under GNU general public license    *
* Author - Don Higgins                                                *
***********************************************************************
MAPEDF   DFHMSD TYPE=&SYSPARM,STORAGE=AUTO,MODE=INOUT,LANG=ASM,        X
               CTRL=FREEKB,CURSLOC=YES,TIOAPFX=YES
*
* PROGRAM INITIATION
*
EDF01    DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E01TRAN  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E01PROG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E01TSKN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E01MODE  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E01DISP  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E01DSNO  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E01DSTL  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=26,ATTRB=(ASKIP,BRT),                 X
               INITIAL='STATUS: PROGRAM INITIATION'
         DFHMDF POS=(4,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBTIME     ='
E01EBTM  DFHMDF POS=(4,18),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(5,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBDATE     ='
E01EBDT  DFHMDF POS=(5,18),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(6,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBTRNID    ='
E01EBTD  DFHMDF POS=(6,18),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(7,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBCPOSN    ='
E01EBCS  DFHMDF POS=(7,18),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(8,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBCALEN    ='
E01EBCL  DFHMDF POS=(8,18),LENGTH=5,ATTRB=ASKIP
         DFHMDF POS=(9,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBAID      ='
E01EBAD  DFHMDF POS=(9,18),LENGTH=5,ATTRB=ASKIP
E01EBAX  DFHMDF POS=(9,26),LENGTH=5,ATTRB=ASKIP
         DFHMDF POS=(10,4),LENGTH=13,ATTRB=ASKIP,                      X
               INITIAL='EIBFN       ='
E01EBFN  DFHMDF POS=(10,18),LENGTH=7,ATTRB=ASKIP
E01EBFX  DFHMDF POS=(10,26),LENGTH=10,ATTRB=ASKIP
         DFHMDF POS=(11,4),LENGTH=13,ATTRB=ASKIP,                      X
               INITIAL='EIBRCODE    ='
E01EBRC  DFHMDF POS=(11,18),LENGTH=15,ATTRB=ASKIP
         DFHMDF POS=(12,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBREQID    ='
* XXXXXXXX OR X'0000000000000000'
E01EBRQ  DFHMDF POS=(12,18),LENGTH=19,ATTRB=ASKIP
         DFHMDF POS=(13,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBDS       ='
E01EBDS  DFHMDF POS=(13,18),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(14,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBRSRCE    ='
* XXXXXXXX OR X'0000000000000000'
E01EBRS  DFHMDF POS=(14,18),LENGTH=19,ATTRB=ASKIP
         DFHMDF POS=(15,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBRESP     ='
E01EBRP  DFHMDF POS=(15,18),LENGTH=12,ATTRB=ASKIP
         DFHMDF POS=(16,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBRESP2    ='
E01EBR2  DFHMDF POS=(16,18),LENGTH=12,ATTRB=ASKIP
         DFHMDF POS=(17,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBPROG     ='
E01EBPG  DFHMDF POS=(17,18),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(18,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBDTFRM    ='
E01EBDF  DFHMDF POS=(18,18),LENGTH=1,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E01ENTR  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E01PF7   DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E01PF8   DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E01PF10  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E01PF11  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E01PF12  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* ADDRESS
*
EDF0202  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0202TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0202PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0202TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0202MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0202DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0202DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0202DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0202ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ADDRESS'
* COMMAREA (X'00000000') LENGTH (0000000)
*          (...//...) OR (X'0000//0000')
E0202CH  DFHMDF POS=(4,2),LENGTH=39,ATTRB=ASKIP
E0202CM  DFHMDF POS=(5,11),LENGTH=69,ATTRB=ASKIP
* CWA      (X'00000000') LENGTH (0000000)
*          (...//...) OR (X'0000//0000')
E0202WH  DFHMDF POS=(6,2),LENGTH=39,ATTRB=ASKIP
E0202WM  DFHMDF POS=(7,11),LENGTH=69,ATTRB=ASKIP
* EIB      (X'00000000') LENGTH (0000000)
*          (...//...) OR (X'0000//0000')
E0202EH  DFHMDF POS=(8,2),LENGTH=39,ATTRB=ASKIP
E0202EM  DFHMDF POS=(9,11),LENGTH=69,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0202PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0202OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP X'......'
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0202'''
E02021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0202RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E02022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0202R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0202RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0202EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E0202P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0202P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0202P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0202PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0202PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0202PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* HANDLE CONDITION
*
EDF0204  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0204TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0204PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0204TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0204DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0204DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0204DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0204ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=26,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS HANDLE CONDITION'
* @FILENOTFOUND@(X'00000000')  +X'000000'
* @NOSPACE     @
E0204C1  DFHMDF POS=(4,2),LENGTH=12,ATTRB=ASKIP
E0204X1  DFHMDF POS=(4,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204C2  DFHMDF POS=(5,2),LENGTH=12,ATTRB=ASKIP
E0204X2  DFHMDF POS=(5,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204C3  DFHMDF POS=(6,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204X3  DFHMDF POS=(6,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204C4  DFHMDF POS=(7,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204X4  DFHMDF POS=(7,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204C5  DFHMDF POS=(8,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204X5  DFHMDF POS=(8,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204C6  DFHMDF POS=(9,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204X6  DFHMDF POS=(9,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204C7  DFHMDF POS=(10,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204X7  DFHMDF POS=(10,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204C8  DFHMDF POS=(11,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204X8  DFHMDF POS=(11,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204C9  DFHMDF POS=(12,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204X9  DFHMDF POS=(12,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204CA  DFHMDF POS=(13,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204XA  DFHMDF POS=(13,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204CB  DFHMDF POS=(14,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204XB  DFHMDF POS=(14,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0204CC  DFHMDF POS=(15,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E0204XC  DFHMDF POS=(15,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0204PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0204OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0204'''
E02041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0204RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E02042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0204R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0204RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0204EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
* PF7 :SCROLL BACK HALF
* PF7 :REDISPLAY BACK 1
E0204P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF8 :SCROLL FORWARD HALF
* PF8 :REDISPLAY FORWARD 1
E0204P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* NO USE FOR PF9
* PF10:SCROLL BACK FULL
* PF10:REDISPLAY BACK 5
E0204PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF11:SCROLL FORWARD FULL
* PF11:REDISPLAY FORWARD 5
E0204PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF12:REDISPLAY MODE
* PF12:REDISPLAY KEYS
* PF12:PAGING KEYS
E0204PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFL
*
* HANDLE AID
*
EDF0206  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0206TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0206PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0206TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0206DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0206DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0206DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0206ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=20,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS HANDLE AID'
* @ANYKEY@(X'00000000')  +X'000000'
* @PF24  @
E0206C1  DFHMDF POS=(4,2),LENGTH=6,ATTRB=ASKIP
E0206X1  DFHMDF POS=(4,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206C2  DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP
E0206X2  DFHMDF POS=(5,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206C3  DFHMDF POS=(6,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206X3  DFHMDF POS=(6,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206C4  DFHMDF POS=(7,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206X4  DFHMDF POS=(7,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206C5  DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206X5  DFHMDF POS=(8,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206C6  DFHMDF POS=(9,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206X6  DFHMDF POS=(9,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206C7  DFHMDF POS=(10,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206X7  DFHMDF POS=(10,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206C8  DFHMDF POS=(11,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206X8  DFHMDF POS=(11,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206C9  DFHMDF POS=(12,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206X9  DFHMDF POS=(12,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206CA  DFHMDF POS=(13,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206XA  DFHMDF POS=(13,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206CB  DFHMDF POS=(14,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206XB  DFHMDF POS=(14,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
E0206CC  DFHMDF POS=(15,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=ACFLO
E0206XC  DFHMDF POS=(15,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=ACFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0206PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0206OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0206'''
E02061R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0206RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E02062R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0206R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0206RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0206EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
* PF7 :SCROLL BACK HALF
* PF7 :REDISPLAY BACK 1
E0206P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF8 :SCROLL FORWARD HALF
* PF8 :REDISPLAY FORWARD 1
E0206P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* NO USE FOR PF9
* PF10:SCROLL BACK FULL
* PF10:REDISPLAY BACK 5
E0206PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF11:SCROLL FORWARD FULL
* PF11:REDISPLAY FORWARD 5
E0206PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF12:REDISPLAY MODE
* PF12:REDISPLAY KEYS
* PF12:PAGING KEYS
E0206PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFL
*
* ASSIGN
*
EDF0208  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0208TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0208PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0208TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0208DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0208DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0208DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0208ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=16,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ASSIGN'
* @ASRAREGS R12-R15 (00000000 00000000 00000000 00000000)
E0208C1  DFHMDF POS=(4,2),LENGTH=54,ATTRB=ASKIP
E0208C2  DFHMDF POS=(5,2),LENGTH=54,ATTRB=ASKIP
E0208C3  DFHMDF POS=(6,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208C4  DFHMDF POS=(7,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208C5  DFHMDF POS=(8,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208C6  DFHMDF POS=(9,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208C7  DFHMDF POS=(10,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208C8  DFHMDF POS=(11,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208C9  DFHMDF POS=(12,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208CA  DFHMDF POS=(13,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208CB  DFHMDF POS=(14,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
E0208CC  DFHMDF POS=(15,2),LENGTH=54,ATTRB=ASKIP,NOLABEL=ACFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0208PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0208OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0208'''
E02081R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0208RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E02082R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0208R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0208RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0208EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
* PF7 :SCROLL BACK HALF
* PF7 :REDISPLAY BACK 1
E0208P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF8 :SCROLL FORWARD HALF
* PF8 :REDISPLAY FORWARD 1
E0208P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* NO USE FOR PF9
* PF10:SCROLL BACK FULL
* PF10:REDISPLAY BACK 5
E0208PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF11:SCROLL FORWARD FULL
* PF11:REDISPLAY FORWARD 5
E0208PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF12:REDISPLAY MODE
* PF12:REDISPLAY KEYS
* PF12:PAGING KEYS
E0208PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFL
*
* IGNORE CONDITION
*
EDF020A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E020ATS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E020APG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E020ATN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E020ADY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E020ADI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E020ADT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E020AST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=26,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS IGNORE CONDITION'
* @FILENOTFOUND
E020AC1  DFHMDF POS=(4,2),LENGTH=12,ATTRB=ASKIP
E020AC2  DFHMDF POS=(5,2),LENGTH=12,ATTRB=ASKIP
E020AC3  DFHMDF POS=(6,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020AC4  DFHMDF POS=(7,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020AC5  DFHMDF POS=(8,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020AC6  DFHMDF POS=(9,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020AC7  DFHMDF POS=(10,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020AC8  DFHMDF POS=(11,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020AC9  DFHMDF POS=(12,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020ACA  DFHMDF POS=(13,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020ACB  DFHMDF POS=(14,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
E020ACC  DFHMDF POS=(15,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=ACFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E020APR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E020AOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''020A'''
E020A1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E020ARP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E020A2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E020AR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E020ARC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E020AEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
* PF7 :SCROLL BACK HALF
* PF7 :REDISPLAY BACK 1
E020AP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF8 :SCROLL FORWARD HALF
* PF8 :REDISPLAY FORWARD 1
E020AP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* NO USE FOR PF9
* PF10:SCROLL BACK FULL
* PF10:REDISPLAY BACK 5
E020APA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF11:SCROLL FORWARD FULL
* PF11:REDISPLAY FORWARD 5
E020APB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF12:REDISPLAY MODE
* PF12:REDISPLAY KEYS
* PF12:PAGING KEYS
E020APC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFL
*
* PUSH HANDLE
*
EDF020C  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E020CTS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E020CPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E020CTN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E020CDY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E020CDI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E020CDT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E020CST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=21,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS PUSH HANDLE'
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E020CPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E020COF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''020C'''
E020C1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E020CRP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E020C2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E020CR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E020CRC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E020CEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E020CP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E020CP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E020CPA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E020CPB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E020CPC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* POP HANDLE
*
EDF020E  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E020ETS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E020EPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E020ETN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E020EDY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E020EDI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E020EDT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E020EST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=20,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS POP HANDLE'
* NOHANDLE
E020ENH  DFHMDF POS=(4,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E020EPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E020EOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''020E'''
E020E1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E020ERP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E020E2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E020ER2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E020ERC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E020EEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E020EP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E020EP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E020EPA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E020EPB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E020EPC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* RECEIVE
*
EDF0402  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0402TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0402PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0402TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0402MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0402DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0402DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0402DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0402ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RECEIVE'
* INTO
* INTO          @(...//...)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='INTO'
E0402IN  DFHMDF POS=(4,17),LENGTH=63,ATTRB=ASKIP
* LENGTH OF INTO (00000)
         DFHMDF POS=(5,2),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='LENGTH OF INTO'
E0402LI  DFHMDF POS=(5,17),LENGTH=7,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000)'
E0402LD  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP
* NOWAIT
E0402NW  DFHMDF POS=(7,2),LENGTH=6,ATTRB=ASKIP
* NOHANDLE
E0402NH  DFHMDF POS=(8,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0402PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0402OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0402'''
E04021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0402RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E04022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0402R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0402RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0402EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* AFTER ENTER, ACTION REQUIRED ON TERMINAL
E0402AC  DFHMDF POS=(20,27),LENGTH=40,ATTRB=ASKIP,COLOR=WHITE
* NO USE FOR PF1
E0402P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0402P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0402P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0402PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0402PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0402PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* SEND
*
EDF0404  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0404TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0404PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0404TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0404MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0404DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0404DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0404DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0404ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS SEND'
* FROM  @(...//...)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FROM'
E0404FM  DFHMDF POS=(4,9),LENGTH=71,ATTRB=ASKIP
* LENGTH@(00000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='LENGTH'
E0404LN  DFHMDF POS=(5,9),LENGTH=7,ATTRB=ASKIP
* NOHANDLE
E0404NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0404PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0404OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0404'''
E04041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0404RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E04042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0404R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0404RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0404EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0404P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0404P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0404PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0404PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0404PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* READ
*
EDF0602  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0602TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0602PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0602TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0602MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0602DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0602DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0602DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0602ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS READ'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E0602FL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E0602IS  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO (00000000000)
E0602LI  DFHMDF POS=(6,2),LENGTH=28,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E0602LD  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E0602RI  DFHMDF POS=(8,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E0602RL  DFHMDF POS=(9,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E0602KL  DFHMDF POS=(10,2),LENGTH=22,ATTRB=ASKIP
* GENERIC
E0602GN  DFHMDF POS=(11,2),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E0602RB  DFHMDF POS=(12,2),LENGTH=4,ATTRB=ASKIP
* EQUAL/GTEQ
E0602EG  DFHMDF POS=(13,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E0602NH  DFHMDF POS=(14,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0602PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0602OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0602'''
E06021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0602RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E06022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0602R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0602RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0602EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E0602P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0602P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0602P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0602PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0602PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0602PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* STARTBR
*
EDF060C  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E060CTS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E060CPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E060CTN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E060CMD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E060CDY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E060CDI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E060CDT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E060CST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS STARTBR'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E060CFL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E060CRI  DFHMDF POS=(5,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E060CRL  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E060CKL  DFHMDF POS=(7,2),LENGTH=22,ATTRB=ASKIP
* GENERIC
E060CGN  DFHMDF POS=(8,2),LENGTH=7,ATTRB=ASKIP
* REQID         @(00000)
         DFHMDF POS=(9,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E060CRQ  DFHMDF POS=(9,17),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E060CRB  DFHMDF POS=(10,2),LENGTH=4,ATTRB=ASKIP
* EQUAL/GTEQ
E060CEG  DFHMDF POS=(11,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E060CNH  DFHMDF POS=(12,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E060CPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E060COF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''060C'''
E060C1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E060CRP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E060C2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E060CR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E060CRC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E060CEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E060CP2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E060CP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E060CP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E060CPA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E060CPB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E060CPC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* READNEXT
*
EDF060E  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E060ETS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E060EPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E060ETN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E060EMD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E060EDY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E060EDI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E060EDT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E060EST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS READNEXT'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E060EFL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E060EIS  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO (00000000000)
E060ELI  DFHMDF POS=(6,2),LENGTH=28,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E060ELD  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E060ERI  DFHMDF POS=(8,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E060ERL  DFHMDF POS=(9,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E060EKL  DFHMDF POS=(10,2),LENGTH=22,ATTRB=ASKIP
* REQID         @(00000)
         DFHMDF POS=(11,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E060ERQ  DFHMDF POS=(11,17),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E060ERB  DFHMDF POS=(12,2),LENGTH=4,ATTRB=ASKIP
* NOHANDLE
E060ENH  DFHMDF POS=(13,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E060EPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E060EOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''060E'''
E060E1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E060ERP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E060E2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E060ER2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E060ERC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E060EEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E060EP2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E060EP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E060EP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E060EPA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E060EPB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E060EPC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* READPREV
*
EDF0610  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0610TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0610PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0610TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0610MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0610DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0610DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0610DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0610ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS READPREV'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E0610FL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E0610IS  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO (00000000000)
E0610LI  DFHMDF POS=(6,2),LENGTH=28,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E0610LD  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E0610RI  DFHMDF POS=(8,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E0610RL  DFHMDF POS=(9,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E0610KL  DFHMDF POS=(10,2),LENGTH=22,ATTRB=ASKIP
* REQID         @(00000)
         DFHMDF POS=(11,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E0610RQ  DFHMDF POS=(11,17),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E0610RB  DFHMDF POS=(12,2),LENGTH=4,ATTRB=ASKIP
* NOHANDLE
E0610NH  DFHMDF POS=(13,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0610PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0610OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0610'''
E06101R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0610RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E06102R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0610R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0610RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0610EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E0610P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0610P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0610P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0610PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0610PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0610PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* ENDBR
*
EDF0612  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0612TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0612PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0612TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0612DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0612DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0612DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0612ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=15,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ENDBR'
* FILE @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E0612FL  DFHMDF POS=(4,8),LENGTH=10,ATTRB=ASKIP
* REQID@(00000)
         DFHMDF POS=(5,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E0612RQ  DFHMDF POS=(5,8),LENGTH=7,ATTRB=ASKIP
* NOHANDLE
E0612NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0612PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0612OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0612'''
E06121R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0612RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E06122R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0612R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0612RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0612EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0612P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0612P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0612PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0612PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0612PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* RESETBR
*
EDF0614  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0614TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0614PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0614TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0614MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0614DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0614DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0614DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0614ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RESETBR'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E0614FL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E0614RI  DFHMDF POS=(5,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E0614RL  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E0614KL  DFHMDF POS=(7,2),LENGTH=22,ATTRB=ASKIP
* GENERIC
E0614GN  DFHMDF POS=(8,2),LENGTH=7,ATTRB=ASKIP
* REQID         @(00000)
         DFHMDF POS=(9,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E0614RQ  DFHMDF POS=(9,17),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E0614RB  DFHMDF POS=(10,2),LENGTH=4,ATTRB=ASKIP
* EQUAL/GTEQ
E0614EG  DFHMDF POS=(11,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E0614NH  DFHMDF POS=(12,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0614PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0614OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0614'''
E06141R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0614RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E06142R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0614R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0614RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0614EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E0614P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0614P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0614P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0614PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0614PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0614PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* WRITEQ TS
*
EDF0A02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0A02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0A02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0A02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0A02MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0A02DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0A02DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0A02DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0A02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=19,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS WRITEQ TS'
* QNAME   @(................)
* QNAME   @(X'................................')
         DFHMDF POS=(4,2),LENGTH=5,ATTRB=ASKIP,INITIAL='QNAME'
E0A02QU  DFHMDF POS=(4,11),LENGTH=37,ATTRB=ASKIP
* FROM    @(...//...)
* FROM    @(X'...//...')
         DFHMDF POS=(5,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FROM'
E0A02FM  DFHMDF POS=(5,11),LENGTH=69,ATTRB=ASKIP
* LENGTH  @(00000000000)
         DFHMDF POS=(6,2),LENGTH=6,ATTRB=ASKIP,INITIAL='LENGTH'
E0A02LN  DFHMDF POS=(6,11),LENGTH=13,ATTRB=ASKIP
* ITEM     (00000)
E0A02IT  DFHMDF POS=(7,2),LENGTH=16,ATTRB=ASKIP
* REWRITE
E0A02RW  DFHMDF POS=(8,2),LENGTH=7,ATTRB=ASKIP
* NUMITEMS (00000)
E0A02NI  DFHMDF POS=(9,2),LENGTH=16,ATTRB=ASKIP
* NOHANDLE
E0A02NH  DFHMDF POS=(10,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0A02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0A02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0A02'''
E0A021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0A02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0A022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0A02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0A02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0A02EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0A02P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0A02P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0A02PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0A02PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0A02PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* READQ TS
*
EDF0A04  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0A04TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0A04PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0A04TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0A04MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0A04DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0A04DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0A04DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0A04ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS READQ TS'
* QNAME         @(................)
* QNAME         @(X'................................')
         DFHMDF POS=(4,2),LENGTH=5,ATTRB=ASKIP,INITIAL='QNAME'
E0A04QU  DFHMDF POS=(4,17),LENGTH=37,ATTRB=ASKIP
* ITEM           (00000)
* NEXT
E0A04IT  DFHMDF POS=(5,2),LENGTH=22,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E0A04IS  DFHMDF POS=(6,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO@(00000000000)
         DFHMDF POS=(7,2),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='LENGTH OF INTO'
E0A04LI  DFHMDF POS=(7,17),LENGTH=13,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E0A04LD  DFHMDF POS=(8,2),LENGTH=28,ATTRB=ASKIP
* NUMITEMS       (00000)
E0A04NI  DFHMDF POS=(9,2),LENGTH=22,ATTRB=ASKIP
* NOHANDLE
E0A04NH  DFHMDF POS=(10,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0A04PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0A04OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0A04'''
E0A041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0A04RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0A042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0A04R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0A04RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0A04EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0A04P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0A04P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0A04PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0A04PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0A04PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* DELETEQ TS
*
EDF0A06  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0A06TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0A06PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0A06TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0A06MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0A06DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0A06DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0A06DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0A06ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=20,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DELETEQ TS'
* QNAME@(................)
* QNAME@(X'................................')
         DFHMDF POS=(4,2),LENGTH=5,ATTRB=ASKIP,INITIAL='QNAME'
E0A06QU  DFHMDF POS=(4,8),LENGTH=37,ATTRB=ASKIP
* NOHANDLE
E0A06NH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0A06PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0A06OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0A06'''
E0A061R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0A06RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0A062R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0A06R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0A06RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0A06EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0A06P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0A06P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0A06PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0A06PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0A06PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* GETMAIN
*
EDF0C02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0C02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0C02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0C02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0C02DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0C02DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0C02DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0C02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS GETMAIN'
* LENGTH   (00000000000)
E0C02LN  DFHMDF POS=(4,2),LENGTH=22,ATTRB=ASKIP
* INITIMG  (X'..')
E0C02IM  DFHMDF POS=(5,2),LENGTH=16,ATTRB=ASKIP,NOLABEL=CFL
* ADDRESS  (X'........')
E0C02AD  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP,NOLABEL=CFL
* NOHANDLE
E0C02NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0C02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0C02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0C02'''
E0C021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0C02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0C022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0C02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0C02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0C02EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0C02P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0C02P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0C02PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0C02PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0C02PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* FREEMAIN
*
EDF0C04  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0C04TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0C04PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0C04TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0C04DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0C04DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0C04DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0C04ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS FREEMAIN'
* ADDRESS  (X'........')
E0C04AD  DFHMDF POS=(4,2),LENGTH=22,ATTRB=ASKIP
* NOHANDLE
E0C04NH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0C04PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0C04OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0C04'''
E0C041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0C04RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0C042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0C04R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0C04RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0C04EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0C04P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0C04P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0C04PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0C04PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0C04PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* LINK
*
EDF0E02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0E02MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0E02DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0E02DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0E02DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS LINK'
* PROGRAM @(........)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='PROGRAM'
E0E02PM  DFHMDF POS=(4,11),LENGTH=10,ATTRB=ASKIP
* COMMAREA (...//...)
* COMMAREA (X'...//...')
E0E02CM  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH   (00000)
E0E02LN  DFHMDF POS=(6,2),LENGTH=16,ATTRB=ASKIP
* CHANNEL  (................)
E0E02CH  DFHMDF POS=(7,2),LENGTH=27,ATTRB=ASKIP,NOLABEL=CFL
* NOHANDLE
E0E02NH  DFHMDF POS=(8,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E02'''
E0E021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0E02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0E02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0E02EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E0E02P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0E02P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0E02P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0E02PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0E02PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0E02PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* XCTL
*
EDF0E04  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E04TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E04PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E04TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0E04MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0E04DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0E04DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0E04DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E04ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS XCTL'
* PROGRAM @(........)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='PROGRAM'
E0E04PM  DFHMDF POS=(4,11),LENGTH=10,ATTRB=ASKIP
* COMMAREA (...//...)
* COMMAREA (X'...//...')
E0E04CM  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH   (00000)
E0E04LN  DFHMDF POS=(6,2),LENGTH=16,ATTRB=ASKIP
* CHANNEL  (................)
E0E04CH  DFHMDF POS=(7,2),LENGTH=27,ATTRB=ASKIP,NOLABEL=CFL
* NOHANDLE
E0E04NH  DFHMDF POS=(8,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E04PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E04OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E04'''
E0E041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0E04RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0E04R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E04RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0E04EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E0E04P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0E04P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0E04P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0E04PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0E04PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0E04PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* LOAD
*
EDF0E06  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E06TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E06PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E06TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0E06DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0E06DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0E06DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E06ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS LOAD'
* PROGRAM  @(........)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='PROGRAM'
E0E06PM  DFHMDF POS=(4,12),LENGTH=10,ATTRB=ASKIP
* ENTRY/SET (X'........')
E0E06ET  DFHMDF POS=(5,2),LENGTH=23,ATTRB=ASKIP
* LENGTH    (00000)
E0E06LN  DFHMDF POS=(6,2),LENGTH=17,ATTRB=ASKIP
* FLENGTH   (00000000000)
E0E06FL  DFHMDF POS=(7,2),LENGTH=23,ATTRB=ASKIP
* NOHANDLE
E0E06NH  DFHMDF POS=(8,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E06PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E06OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E06'''
E0E061R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0E06RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E062R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0E06R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E06RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0E06EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0E06P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0E06P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0E06PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0E06PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0E06PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* RETURN
*
EDF0E08  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E08TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E08PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E08TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0E08MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E0E08DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0E08DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0E08DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E08ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=16,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RETURN'
* TRANSID  (....)
E0E08TR  DFHMDF POS=(4,2),LENGTH=15,ATTRB=ASKIP
* COMMAREA (...//...)
* COMMAREA (X'...//...')
E0E08CM  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH   (00000)
E0E08LN  DFHMDF POS=(6,2),LENGTH=16,ATTRB=ASKIP
* CHANNEL  (................)
E0E08CH  DFHMDF POS=(7,2),LENGTH=27,ATTRB=ASKIP,NOLABEL=CFL
* IMMEDIATE
E0E08IM  DFHMDF POS=(8,2),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E08PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E08OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E08'''
E0E081R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0E08RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E082R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0E08R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E08RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0E08EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E0E08P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0E08P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0E08P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0E08PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0E08PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0E08PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* RELEASE
*
EDF0E0A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E0ATS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E0APG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E0ATN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0E0ADY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0E0ADI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0E0ADT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E0AST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RELEASE'
* PROGRAM  @(........)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='PROGRAM'
E0E0APM  DFHMDF POS=(4,12),LENGTH=10,ATTRB=ASKIP
* NOHANDLE
E0E0ANH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E0APR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E0AOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E0A'''
E0E0A1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0E0ARP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E0A2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0E0AR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E0ARC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0E0AEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0E0AP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0E0AP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0E0APA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0E0APB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0E0APC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* ABEND
*
EDF0E0C  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E0CTS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E0CPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E0CTN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0E0CDY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0E0CDI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0E0CDT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E0CST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=15,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ABEND'
* ABCODE @(....)
         DFHMDF POS=(4,2),LENGTH=6,ATTRB=ASKIP,INITIAL='ABCODE'
E0E0CAB  DFHMDF POS=(4,9),LENGTH=6,ATTRB=ASKIP
* NODUMP
E0E0CND  DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP
* CANCEL
E0E0CCN  DFHMDF POS=(6,2),LENGTH=6,ATTRB=ASKIP
* NOHANDLE
E0E0CNH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E0CPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E0COF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E0C'''
E0E0C1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0E0CRP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E0C2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0E0CR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E0CRC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0E0CEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0E0CP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0E0CP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0E0CPA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0E0CPB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0E0CPC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* HANDLE ABEND
*
EDF0E0E  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E0ETS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E0EPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E0ETN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E0E0EDY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E0E0EDI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E0E0EDT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E0EST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=22,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS HANDLE ABEND'
* CANCEL/RESET
E0E0ECR  DFHMDF POS=(4,2),LENGTH=6,ATTRB=ASKIP
* PROGRAM (........)
* LABEL (X'00000000')  +X'000000'
E0E0EPL  DFHMDF POS=(5,2),LENGTH=31,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E0EPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E0EOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E0E'''
E0E0E1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0E0ERP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E0E2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0E0ER2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E0ERC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E0E0EEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0E0EP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E0E0EP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E0E0EPA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E0E0EPB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E0E0EPC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* ASKTIME
* ASKTIME ABSTIME
*
EDF1002  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1002TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1002PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1002TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E1002DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1002DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1002DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1002ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ASKTIME'
* ABSTIME (...............)
E1002AB  DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,NOLABEL=CFLO,           X
               INITIAL='ABSTIME'
E1002AT  DFHMDF POS=(4,10),LENGTH=17,ATTRB=ASKIP
* NOHANDLE
E1002NH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1002PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1002OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=6,ATTRB=ASKIP,INITIAL='EIBFN:'
* EIBFN: X'1002' OR X'4A02'
E1002FN  DFHMDF POS=(17,48),LENGTH=7,ATTRB=ASKIP
E10021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1002RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E10022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1002R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1002RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1002EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1002P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1002P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1002PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1002PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1002PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* DELAY
*
EDF1004  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1004TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1004PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1004TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E1004MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E1004DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1004DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1004DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1004ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=15,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DELAY'
* INTERVAL
* INTERVAL (HH:MM:SS)
* TIME
* TIME     (HH:MM:SS)
E1004IT  DFHMDF POS=(4,2),LENGTH=19,ATTRB=ASKIP
* FOR   HOURS (99)
* FOR   MINUTES (9999)
* FOR   SECONDS (999999)
* FOR   HOURS (99) MINUTES (99) SECONDS (99)
*
* UNTIL HOURS (99)
* UNTIL MINUTES (9999)
* UNTIL SECONDS (999999)
* UNTIL HOURS (99) MINUTES (99) SECONDS (99)
E1004FU  DFHMDF POS=(5,2),LENGTH=42,ATTRB=ASKIP
* REQID (........)
* REQID (X'................')
E1004RQ  DFHMDF POS=(6,2),LENGTH=27,ATTRB=ASKIP
* NOHANDLE
E1004NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1004PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1004OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1004'''
E10041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1004RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E10042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1004R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1004RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1004EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E1004P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1004P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1004P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1004PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1004PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1004PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* START
*
EDF1008  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1008TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1008PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1008TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E1008MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E1008DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1008DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1008DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1008ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=15,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS START'
* TRANSID  @(....)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='TRANSID'
E1008TI  DFHMDF POS=(4,12),LENGTH=6,ATTRB=ASKIP
* INTERVAL
* INTERVAL  (HH:MM:SS)
* TIME
* TIME      (HH:MM:SS)
E1008IT  DFHMDF POS=(5,2),LENGTH=20,ATTRB=ASKIP
* FOR   HOURS (99)
* FOR   MINUTES (9999)
* FOR   SECONDS (999999)
* FOR   HOURS (99) MINUTES (99) SECONDS (99)
*
* UNTIL HOURS (99)
* UNTIL MINUTES (9999)
* UNTIL SECONDS (999999)
* UNTIL HOURS (99) MINUTES (99) SECONDS (99)
E1008FU  DFHMDF POS=(6,2),LENGTH=42,ATTRB=ASKIP
* REQID     (........)
* REQID     (X'................')
E1008RQ  DFHMDF POS=(7,2),LENGTH=31,ATTRB=ASKIP
* FROM      (...//...)
* FROM      (X'...//...')
E1008FM  DFHMDF POS=(8,2),LENGTH=79,ATTRB=ASKIP
* LENGTH    (00000000000)
E1008LN  DFHMDF POS=(9,2),LENGTH=23,ATTRB=ASKIP
* TERMID    (....)
E1008TM  DFHMDF POS=(10,2),LENGTH=16,ATTRB=ASKIP
* RTRANSID  (....)
* RTRANSID  (X'........')
E1008RT  DFHMDF POS=(11,2),LENGTH=23,ATTRB=ASKIP
* RTERMID   (....)
* RTERMID   (X'........')
E1008RM  DFHMDF POS=(12,2),LENGTH=23,ATTRB=ASKIP
* QUEUE     (........)
* QUEUE     (X'................')
E1008QU  DFHMDF POS=(13,2),LENGTH=31,ATTRB=ASKIP
* CHANNEL   (................)
E1008CH  DFHMDF POS=(14,2),LENGTH=28,ATTRB=ASKIP,NOLABEL=CFL
* NOHANDLE
E1008NH  DFHMDF POS=(15,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1008PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1008OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1008'''
E10081R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1008RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E10082R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1008R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1008RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1008EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E1008P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1008P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1008P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1008PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1008PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1008PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* RETRIEVE
*
EDF100A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E100ATS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E100APG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E100ATN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E100AMD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E100ADY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E100ADI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E100ADT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E100AST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RETRIEVE'
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E100AIS  DFHMDF POS=(4,2),LENGTH=79,ATTRB=ASKIP
* LENGTH         (00000000000)
E100ALN  DFHMDF POS=(5,2),LENGTH=28,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E100ALD  DFHMDF POS=(6,2),LENGTH=28,ATTRB=ASKIP
* RTRANSID       (....)
* RTRANSID       (X'........')
E100ART  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* RTERMID        (....)
* RTERMID        (X'........')
E100ARM  DFHMDF POS=(8,2),LENGTH=28,ATTRB=ASKIP
* QUEUE          (........)
* QUEUE          (X'................')
E100AQU  DFHMDF POS=(9,2),LENGTH=36,ATTRB=ASKIP
* NOHANDLE
E100ANH  DFHMDF POS=(14,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E100APR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E100AOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''100A'''
E100A1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E100ARP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E100A2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E100AR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E100ARC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E100AEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E100AP2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E100AP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E100AP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E100APA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E100APB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E100APC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* CANCEL
*
EDF100C  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E100CTS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E100CPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E100CTN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E100CMD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E100CDY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E100CDI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E100CDT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E100CST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=16,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS CANCEL'
* REQID (........)
* REQID (X'................')
E100CRQ  DFHMDF POS=(4,2),LENGTH=27,ATTRB=ASKIP
* NOHANDLE
E100CNH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E100CPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E100COF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''100C'''
E100C1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E100CRP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E100C2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E100CR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E100CRC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E100CEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E100CP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E100CP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E100CPA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E100CPB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E100CPC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* ENQ
*
EDF1204  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1204TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1204PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1204TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E1204MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E1204DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1204DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1204DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1204ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=13,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ENQ'
* RESOURCE@(X'00000000')
* RESOURCE@(...//...)
* RESOURCE@(X'...//...')
         DFHMDF POS=(4,2),LENGTH=8,ATTRB=ASKIP,INITIAL='RESOURCE'
E1204RS  DFHMDF POS=(4,11),LENGTH=69,ATTRB=ASKIP
* LENGTH  @(00000)
E1204LH  DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=CFLO,           X
               INITIAL='LENGTH'
E1204LN  DFHMDF POS=(5,11),LENGTH=7,ATTRB=ASKIP
* NOSUSPEND
E1204NS  DFHMDF POS=(6,2),LENGTH=9,ATTRB=ASKIP
* NOHANDLE
E1204NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1204PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1204OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1204'''
E12041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1204RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E12042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1204R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1204RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1204EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E1204P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1204P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1204P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1204PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1204PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1204PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* DEQ
*
EDF1206  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1206TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1206PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1206TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E1206MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E1206DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1206DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1206DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1206ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=13,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DEQ'
* RESOURCE@(X'00000000')
* RESOURCE@(...//...)
* RESOURCE@(X'...//...')
         DFHMDF POS=(4,2),LENGTH=8,ATTRB=ASKIP,INITIAL='RESOURCE'
E1206RS  DFHMDF POS=(4,11),LENGTH=69,ATTRB=ASKIP
* LENGTH  @(00000)
E1206LH  DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=CFLO,           X
               INITIAL='LENGTH'
E1206LN  DFHMDF POS=(5,11),LENGTH=7,ATTRB=ASKIP
* NOHANDLE
E1206NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1206PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1206OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1206'''
E12061R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1206RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E12062R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1206R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1206RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1206EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E1206P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1206P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1206P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1206PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1206PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1206PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* RECEIVE MAP
*
EDF1802  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1802TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1802PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1802TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E1802DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1802DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1802DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1802ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=21,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RECEIVE MAP'
* MAP           @(.......)
         DFHMDF POS=(4,2),LENGTH=3,ATTRB=ASKIP,INITIAL='MAP'
E1802MP  DFHMDF POS=(4,17),LENGTH=9,ATTRB=ASKIP
* MAPSET        @(........)  (00000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='MAPSET'
E1802MS  DFHMDF POS=(5,17),LENGTH=19,ATTRB=ASKIP
* MAP STRUCTURE @(X'........')
         DFHMDF POS=(6,2),LENGTH=13,ATTRB=ASKIP,INITIAL='MAP STRUCTURE'
E1802SR  DFHMDF POS=(6,17),LENGTH=13,ATTRB=ASKIP
* NOHANDLE
E1802NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1802PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1802OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1802'''
E18021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1802RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E18022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1802R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1802RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1802EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1802P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1802P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1802PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1802PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1802PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* SEND MAP
*
EDF1804  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1804TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1804PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1804TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E1804DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1804DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1804DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1804ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS SEND MAP'
* MAP           @(.......)
         DFHMDF POS=(4,2),LENGTH=3,ATTRB=ASKIP,INITIAL='MAP'
E1804MP  DFHMDF POS=(4,17),LENGTH=9,ATTRB=ASKIP
* MAPSET        @(........)  (00000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='MAPSET'
E1804MS  DFHMDF POS=(5,17),LENGTH=19,ATTRB=ASKIP
* MAP STRUCTURE @(X'........')
         DFHMDF POS=(6,2),LENGTH=13,ATTRB=ASKIP,INITIAL='MAP STRUCTURE'
E1804SR  DFHMDF POS=(6,17),LENGTH=13,ATTRB=ASKIP
* SET            (X'........')
E1804DS  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* LENGTH OF DATA (00000)
E1804LN  DFHMDF POS=(8,2),LENGTH=22,ATTRB=ASKIP
* DATAONLY/MAPONLY
E1804DM  DFHMDF POS=(9,2),LENGTH=8,ATTRB=ASKIP
* CURSOR
* CURSOR        @(0000) ROW(00) COL(00)
E1804CS  DFHMDF POS=(10,2),LENGTH=6,ATTRB=ASKIP
E1804CP  DFHMDF POS=(10,17),LENGTH=22,ATTRB=ASKIP
* ERASEAUP/ERASE
E1804ER  DFHMDF POS=(11,2),LENGTH=8,ATTRB=ASKIP
* ALARM
E1804AL  DFHMDF POS=(12,2),LENGTH=5,ATTRB=ASKIP
* FREEKB
E1804FK  DFHMDF POS=(13,2),LENGTH=6,ATTRB=ASKIP
* FRSET
E1804FR  DFHMDF POS=(14,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E1804NH  DFHMDF POS=(15,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1804PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1804OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1804'''
E18041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1804RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E18042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1804R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1804RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1804EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1804P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1804P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1804PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1804PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1804PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* SEND CONTROL
*
EDF1812  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1812TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1812PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1812TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E1812DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1812DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1812DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1812ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=22,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS SEND CONTROL'
* CURSOR
* CURSOR@(0000) ROW(00) COL(00)
E1812CS  DFHMDF POS=(4,2),LENGTH=6,ATTRB=ASKIP
E1812CP  DFHMDF POS=(4,9),LENGTH=22,ATTRB=ASKIP
* ERASEAUP/ERASE
E1812ER  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
* ALARM
E1812AL  DFHMDF POS=(6,2),LENGTH=5,ATTRB=ASKIP
* FREEKB
E1812FK  DFHMDF POS=(7,2),LENGTH=6,ATTRB=ASKIP
* FRSET
E1812FR  DFHMDF POS=(8,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E1812NH  DFHMDF POS=(9,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1812PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1812OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1812'''
E18121R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1812RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E18122R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1812R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1812RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1812EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1812P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1812P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1812PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1812PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1812PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* DUMP TRANSACTION
*
EDF1C02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1C02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1C02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1C02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E1C02DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E1C02DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E1C02DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1C02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=26,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DUMP TRANSACTION'
* DUMPCODE   @(....)
         DFHMDF POS=(4,2),LENGTH=8,ATTRB=ASKIP,INITIAL='DUMPCODE'
E1C02DC  DFHMDF POS=(4,14),LENGTH=6,ATTRB=ASKIP
* COMPLETE
E1C02CM  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
* FROM        (X'........')
E1C02FM  DFHMDF POS=(6,2),LENGTH=25,ATTRB=ASKIP
* LENGTH      (00000000000)
E1C02LN  DFHMDF POS=(7,2),LENGTH=25,ATTRB=ASKIP
* SEGMENTLIST (X'........')
E1C02SL  DFHMDF POS=(8,2),LENGTH=25,ATTRB=ASKIP
* LENGTHLIST  (X'........')
E1C02LL  DFHMDF POS=(9,2),LENGTH=25,ATTRB=ASKIP
* NUMSEGMENTS (00000000000)
E1C02NS  DFHMDF POS=(10,2),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1C02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1C02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1C02'''
E1C021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E1C02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E1C022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E1C02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1C02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E1C02EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E1C02P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E1C02P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E1C02PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E1C02PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E1C02PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* DELETE CONTAINER
*
EDF3412  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E3412TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E3412PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E3412TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E3412DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E3412DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E3412DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E3412ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=16,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DELETE'
* CONTAINER@(................)
         DFHMDF POS=(4,2),LENGTH=9,ATTRB=ASKIP,INITIAL='CONTAINER'
E3412CN  DFHMDF POS=(4,12),LENGTH=18,ATTRB=ASKIP
* CHANNEL  @(................)
         DFHMDF POS=(5,2),LENGTH=7,ATTRB=ASKIP,INITIAL='CHANNEL'
E3412CH  DFHMDF POS=(5,12),LENGTH=18,ATTRB=ASKIP
* NOHANDLE
E3412NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E3412PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E3412OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''3412'''
E34121R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E3412RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E34122R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E3412R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E3412RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E3412EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E3412P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E3412P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E3412PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E3412PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E3412PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* GET CONTAINER
*
EDF3414  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E3414TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E3414PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E3414TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E3414MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* DISPLAY-@...@/...
E3414DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E3414DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E3414DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E3414ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=13,ATTRB=ASKIP,INITIAL='EXEC CICS GET'
* CONTAINER     @(................)
         DFHMDF POS=(4,2),LENGTH=9,ATTRB=ASKIP,INITIAL='CONTAINER'
E3414CN  DFHMDF POS=(4,17),LENGTH=18,ATTRB=ASKIP
* CHANNEL       @(................)
         DFHMDF POS=(5,2),LENGTH=7,ATTRB=ASKIP,INITIAL='CHANNEL'
E3414CH  DFHMDF POS=(5,17),LENGTH=18,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E3414IS  DFHMDF POS=(6,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO@(00000000000)
E3414LL  DFHMDF POS=(7,2),LENGTH=14,ATTRB=ASKIP,NOLABEL=CFLO,          X
               INITIAL='LENGTH OF INTO'
E3414LI  DFHMDF POS=(7,17),LENGTH=13,ATTRB=ASKIP
* NODATA
E3414ND  DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=CFLO,           X
               INITIAL='NODATA'
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E3414LD  DFHMDF POS=(9,2),LENGTH=28,ATTRB=ASKIP
* NOHANDLE
E3414NH  DFHMDF POS=(10,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E3414PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E3414OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''3414'''
E34141R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E3414RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E34142R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E3414R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E3414RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E3414EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
E3414P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E3414P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E3414P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E3414PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E3414PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E3414PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* PUT CONTAINER
*
EDF3416  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E3416TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E3416PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E3416TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E3416MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
* DISPLAY-@...@/...
E3416DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E3416DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E3416DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E3416ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=13,ATTRB=ASKIP,INITIAL='EXEC CICS PUT'
* CONTAINER@(................)
         DFHMDF POS=(4,2),LENGTH=9,ATTRB=ASKIP,INITIAL='CONTAINER'
E3416CN  DFHMDF POS=(4,12),LENGTH=18,ATTRB=ASKIP
* CHANNEL  @(................)
         DFHMDF POS=(5,2),LENGTH=7,ATTRB=ASKIP,INITIAL='CHANNEL'
E3416CH  DFHMDF POS=(5,12),LENGTH=18,ATTRB=ASKIP
* FROM     @(...//...)
* FROM     @(X'...//...')
         DFHMDF POS=(6,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FROM'
E3416FM  DFHMDF POS=(6,12),LENGTH=67,ATTRB=ASKIP
* LENGTH   @(00000000000)
         DFHMDF POS=(7,2),LENGTH=6,ATTRB=ASKIP,INITIAL='LENGTH'
E3416LN  DFHMDF POS=(7,12),LENGTH=13,ATTRB=ASKIP
* NOHANDLE
E3416NH  DFHMDF POS=(8,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E3416PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E3416OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''3416'''
E34161R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E3416RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E34162R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E3416R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E3416RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E3416EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E3416P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E3416P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E3416PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E3416PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E3416PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* MOVE CONTAINER
*
EDF3440  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E3440TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E3440PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E3440TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E3440DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E3440DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E3440DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E3440ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS MOVE'
* CONTAINER@(................)
         DFHMDF POS=(4,2),LENGTH=9,ATTRB=ASKIP,INITIAL='CONTAINER'
E3440CN  DFHMDF POS=(4,12),LENGTH=18,ATTRB=ASKIP
* AS       @(................)
         DFHMDF POS=(5,2),LENGTH=2,ATTRB=ASKIP,INITIAL='AS'
E3440AS  DFHMDF POS=(5,12),LENGTH=18,ATTRB=ASKIP
* CHANNEL  @(................)
         DFHMDF POS=(6,2),LENGTH=7,ATTRB=ASKIP,INITIAL='CHANNEL'
E3440CH  DFHMDF POS=(6,12),LENGTH=18,ATTRB=ASKIP
* TOCHANNEL@(................)
         DFHMDF POS=(7,2),LENGTH=9,ATTRB=ASKIP,INITIAL='TOCHANNEL'
E3440TC  DFHMDF POS=(7,12),LENGTH=18,ATTRB=ASKIP
* NOHANDLE
E3440NH  DFHMDF POS=(8,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E3440PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E3440OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''3440'''
E34401R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E3440RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E34402R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E3440R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E3440RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E3440EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E3440P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E3440P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E3440PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E3440PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E3440PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* FORMATTIME
*
EDF4A04  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E4A04TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E4A04PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E4A04TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E4A04DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E4A04DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E4A04DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E4A04ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=20,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS FORMATTIME'
* @DATESTRING  (.........................)
* @MONTHOFYEAR (00)
E4A04C1  DFHMDF POS=(4,2),LENGTH=39,ATTRB=ASKIP
E4A04C2  DFHMDF POS=(5,2),LENGTH=39,ATTRB=ASKIP
E4A04C3  DFHMDF POS=(6,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04C4  DFHMDF POS=(7,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04C5  DFHMDF POS=(8,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04C6  DFHMDF POS=(9,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04C7  DFHMDF POS=(10,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04C8  DFHMDF POS=(11,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04C9  DFHMDF POS=(12,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04CA  DFHMDF POS=(13,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04CB  DFHMDF POS=(14,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
E4A04CC  DFHMDF POS=(15,2),LENGTH=39,ATTRB=ASKIP,NOLABEL=ACFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E4A04PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E4A04OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''4A04'''
E4A041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E4A04RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E4A042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E4A04R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E4A04RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E4A04EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
* PF7 :SCROLL BACK HALF
* PF7 :REDISPLAY BACK 1
E4A04P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF8 :SCROLL FORWARD HALF
* PF8 :REDISPLAY FORWARD 1
E4A04P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* NO USE FOR PF9
* PF10:SCROLL BACK FULL
* PF10:REDISPLAY BACK 5
E4A04PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF11:SCROLL FORWARD FULL
* PF11:REDISPLAY FORWARD 5
E4A04PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF12:REDISPLAY MODE
* PF12:REDISPLAY KEYS
* PF12:PAGING KEYS
E4A04PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFL
*
* INQUIRE FILE
*
EDF4C02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E4C02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E4C02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E4C02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E4C02DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E4C02DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E4C02DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E4C02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=22,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS INQUIRE FILE'
* @ACCESSMETHOD (...//...)
E4C02C1  DFHMDF POS=(4,2),LENGTH=78,ATTRB=ASKIP
E4C02C2  DFHMDF POS=(5,2),LENGTH=78,ATTRB=ASKIP
E4C02C3  DFHMDF POS=(6,2),LENGTH=78,ATTRB=ASKIP
E4C02C4  DFHMDF POS=(7,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
E4C02C5  DFHMDF POS=(8,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
E4C02C6  DFHMDF POS=(9,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
E4C02C7  DFHMDF POS=(10,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
E4C02C8  DFHMDF POS=(11,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
E4C02C9  DFHMDF POS=(12,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
E4C02CA  DFHMDF POS=(13,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
E4C02CB  DFHMDF POS=(14,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
E4C02CC  DFHMDF POS=(15,2),LENGTH=78,ATTRB=ASKIP,NOLABEL=ACFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E4C02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E4C02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''4C02'''
E4C021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E4C02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E4C022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E4C02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E4C02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E4C02EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
* PF7 :SCROLL BACK HALF
* PF7 :REDISPLAY BACK 1
E4C02P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF8 :SCROLL FORWARD HALF
* PF8 :REDISPLAY FORWARD 1
E4C02P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* NO USE FOR PF9
* PF10:SCROLL BACK FULL
* PF10:REDISPLAY BACK 5
E4C02PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF11:SCROLL FORWARD FULL
* PF11:REDISPLAY FORWARD 5
E4C02PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* PF12:REDISPLAY MODE
* PF12:REDISPLAY KEYS
* PF12:PAGING KEYS
E4C02PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFL
*
* SET FILE
*
EDF4C04  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E4C04TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E4C04PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E4C04TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E4C04DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E4C04DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E4C04DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E4C04ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS SET FILE'
* FILE        @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E4C04FL  DFHMDF POS=(4,15),LENGTH=10,ATTRB=ASKIP
* OPENSTATUS   (CLOSED)
E4C04OS  DFHMDF POS=(5,2),LENGTH=21,ATTRB=ASKIP
* ENABLESTATUS (DISABLED)
E4C04ES  DFHMDF POS=(6,2),LENGTH=23,ATTRB=ASKIP
* READSTATUS   (NOTREADABLE)
E4C04RS  DFHMDF POS=(7,2),LENGTH=26,ATTRB=ASKIP
* UPDATESTATUS (NOTUPDATABLE)
E4C04US  DFHMDF POS=(8,2),LENGTH=27,ATTRB=ASKIP
* ADDSTATUS    (NOTADDABLE)
E4C04AS  DFHMDF POS=(9,2),LENGTH=25,ATTRB=ASKIP
* BROWSESTATUS (NOTBROWSABLE)
E4C04BS  DFHMDF POS=(10,2),LENGTH=27,ATTRB=ASKIP
* DELETESTATUS (NOTDELETABLE)
E4C04DS  DFHMDF POS=(11,2),LENGTH=27,ATTRB=ASKIP
* NOHANDLE
E4C04NH  DFHMDF POS=(12,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E4C04PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E4C04OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''4C04'''
E4C041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E4C04RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E4C042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E4C04R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E4C04RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E4C04EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E4C04P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E4C04P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E4C04PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E4C04PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E4C04PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* STARTBROWSE CONTAINER
*
EDF9626  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E9626TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E9626PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E9626TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E9626DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E9626DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E9626DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E9626ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=31,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS STARTBROWSE CONTAINER'
* CHANNEL    @(................)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='CHANNEL'
E9626CH  DFHMDF POS=(4,14),LENGTH=18,ATTRB=ASKIP
* BROWSETOKEN@(X'00000000')
         DFHMDF POS=(5,2),LENGTH=11,ATTRB=ASKIP,INITIAL='BROWSETOKEN'
E9626BT  DFHMDF POS=(5,14),LENGTH=13,ATTRB=ASKIP
* NOHANDLE
E9626NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E9626PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E9626OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''9626'''
E96261R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E9626RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E96262R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E9626R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E9626RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E9626EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E9626P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E9626P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E9626PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E9626PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E9626PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* GETNEXT CONTAINER
*
EDF9628  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E9628TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E9628PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E9628TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E9628DY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E9628DI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E9628DT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E9628ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS GETNEXT'
* CONTAINER  @(................)
         DFHMDF POS=(4,2),LENGTH=9,ATTRB=ASKIP,INITIAL='CONTAINER'
E9628CN  DFHMDF POS=(4,14),LENGTH=18,ATTRB=ASKIP
* BROWSETOKEN@(X'00000000')
         DFHMDF POS=(5,2),LENGTH=11,ATTRB=ASKIP,INITIAL='BROWSETOKEN'
E9628BT  DFHMDF POS=(5,14),LENGTH=13,ATTRB=ASKIP
* NOHANDLE
E9628NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E9628PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E9628OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''9628'''
E96281R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E9628RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E96282R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E9628R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E9628RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E9628EN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E9628P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E9628P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E9628PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E9628PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E9628PC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* ENDBROWSE CONTAINER
*
EDF962A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E962ATS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E962APG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E962ATN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
E962ADY  DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
E962ADI  DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
E962ADT  DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E962AST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=29,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ENDBROWSE CONTAINER'
* BROWSETOKEN@(X'00000000')
         DFHMDF POS=(4,2),LENGTH=11,ATTRB=ASKIP,INITIAL='BROWSETOKEN'
E962ABT  DFHMDF POS=(4,14),LENGTH=13,ATTRB=ASKIP
* NOHANDLE
E962ANH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E962APR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E962AOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''962A'''
E962A1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E962ARP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E962A2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E962AR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E962ARC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
         DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='ENTER:'
E962AEN  DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT)
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E962AP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
E962AP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
E962APA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
E962APB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
E962APC  DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
*
* PROGRAM/TASK TERMINATION
*
EDFKCP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
EKCPTS   DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
EKCPPG   DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
EKCPTN   DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* DISPLAY-@...@/...
EKCPDY   DFHMDF POS=(1,63),LENGTH=8,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,    X
               INITIAL='DISPLAY-'
EKCPDI   DFHMDF POS=(1,72),LENGTH=3,ATTRB=ASKIP,COLOR=GREEN,NOLABEL=C
EKCPDT   DFHMDF POS=(1,76),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
* PROGRAM TERMINATION : LEVEL ..
* TASK TERMINATION : NO TRANSID SET
* TASK TERMINATION : TRANSID .... SET
EKCPST   DFHMDF POS=(2,9),LENGTH=35,ATTRB=(ASKIP,BRT),COLOR=WHITE,     X
               NOLABEL=AFL
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
EKCPPR   DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
EKCPOF   DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E08'''
         DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),                 X
               INITIAL='RESPONSE:'
EKCPRP   DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,INITIAL='EIBRESP2:'
EKCPR2   DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* ENTER: CONTINUE
* ENTER: END REDISPLAY MODE
EKCPENK  DFHMDF POS=(20,1),LENGTH=6,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='ENTER:'
EKCPEN   DFHMDF POS=(20,8),LENGTH=18,ATTRB=(ASKIP,BRT),NOLABEL=CFL
* NO USE FOR PF1-PF2
EKCPP3   DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4-PF6
EKCPP7   DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF7 :REDISPLAY BACK 1'
EKCPP8   DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF8 :REDISPLAY FORWARD 1'
* NO USE FOR PF9
EKCPPA   DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,   X
               INITIAL='PF10:REDISPLAY BACK 5'
EKCPPB   DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,DRK),NOLABEL=CFLO,  X
               INITIAL='PF11:REDISPLAY FORWARD 5'
EKCPPC   DFHMDF POS=(24,51),LENGTH=19,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF12:REDISPLAY MODE'
* WORKING STORAGE
*
EDFWKS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
EWKSTS   DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
EWKSPG   DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
EWKSTN   DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII
EWKSMDE  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
EWKSHED  DFHMDF POS=(2,1),LENGTH=79,ATTRB=(ASKIP,BRT)
* HEX/CHAR DISPLAY
*@--ADDR-- OFFSET 00000000 00000000 00000000 00000000  XXXXXXXXXXXXXXXX
EWKSL01  DFHMDF POS=(3,1),LENGTH=69,ATTRB=ASKIP
EWKSL02  DFHMDF POS=(4,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL03  DFHMDF POS=(5,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL04  DFHMDF POS=(6,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL05  DFHMDF POS=(7,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL06  DFHMDF POS=(8,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL07  DFHMDF POS=(9,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL08  DFHMDF POS=(10,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL09  DFHMDF POS=(11,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL10  DFHMDF POS=(12,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL11  DFHMDF POS=(13,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL12  DFHMDF POS=(14,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL13  DFHMDF POS=(15,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL14  DFHMDF POS=(16,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL15  DFHMDF POS=(17,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL16  DFHMDF POS=(18,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
         DFHMDF POS=(20,1),LENGTH=22,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CURRENT DISPLAY'
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=17,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII'
* NO USE FOR PF3-6
EWKSP7   DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF7 :SCROLL BACK HALF'
EWKSP8   DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF8 :SCROLL FORWARD HALF'
* NO USE FOR PF9
EWKSPA   DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF10:SCROLL BACK FULL'
EWKSPB   DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF11:SCROLL FORWARD FULL'
* NO USE FOR PF12
*
         DFHMSD TYPE=FINAL
         END
