***********************************************************************
* Copyright 2006 Automated Software Tools Corporation                 *
* This source code is part of z390 assembler/emulator package         *
* The z390 package is distributed under GNU general public license    *
* Author - Don Higgins                                                *
***********************************************************************
MAPEDF   DFHMSD TYPE=&SYSPARM,STORAGE=AUTO,MODE=INOUT,LANG=ASM,        X
               CTRL=FREEKB,CURSLOC=YES,TIOAPFX=YES
*
* PROGRAM INITIATION
*
EDF01    DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E01TRAN  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E01PROG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E01TSKN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E01MODE  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E01SCRN  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=26,ATTRB=(ASKIP,BRT),                 X
               INITIAL='STATUS: PROGRAM INITIATION'
         DFHMDF POS=(4,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBTIME     ='
E01EBTM  DFHMDF POS=(4,18),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(5,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBDATE     ='
E01EBDT  DFHMDF POS=(5,18),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(6,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBTRNID    ='
E01EBTD  DFHMDF POS=(6,18),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(7,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBCPOSN    ='
E01EBCS  DFHMDF POS=(7,18),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(8,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBCALEN    ='
E01EBCL  DFHMDF POS=(8,18),LENGTH=5,ATTRB=ASKIP
         DFHMDF POS=(9,4),LENGTH=13,ATTRB=ASKIP,INITIAL='EIBAID      ='
E01EBAD  DFHMDF POS=(9,18),LENGTH=5,ATTRB=ASKIP
E01EBAX  DFHMDF POS=(9,26),LENGTH=5,ATTRB=ASKIP
         DFHMDF POS=(10,4),LENGTH=13,ATTRB=ASKIP,                      X
               INITIAL='EIBFN       ='
E01EBFN  DFHMDF POS=(10,18),LENGTH=7,ATTRB=ASKIP
E01EBFX  DFHMDF POS=(10,26),LENGTH=10,ATTRB=ASKIP
         DFHMDF POS=(11,4),LENGTH=13,ATTRB=ASKIP,                      X
               INITIAL='EIBRCODE    ='
E01EBRC  DFHMDF POS=(11,18),LENGTH=15,ATTRB=ASKIP
         DFHMDF POS=(12,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBREQID    ='
* XXXXXXXX OR X'0000000000000000'
E01EBRQ  DFHMDF POS=(12,18),LENGTH=19,ATTRB=ASKIP
         DFHMDF POS=(13,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBDS       ='
E01EBDS  DFHMDF POS=(13,18),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(14,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBRSRCE    ='
* XXXXXXXX OR X'0000000000000000'
E01EBRS  DFHMDF POS=(14,18),LENGTH=19,ATTRB=ASKIP
         DFHMDF POS=(15,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBRESP     ='
E01EBRP  DFHMDF POS=(15,18),LENGTH=12,ATTRB=ASKIP
         DFHMDF POS=(16,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBRESP2    ='
E01EBR2  DFHMDF POS=(16,18),LENGTH=12,ATTRB=ASKIP
         DFHMDF POS=(17,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBPROG     ='
E01EBPG  DFHMDF POS=(17,18),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(18,4),LENGTH=13,                                  X
               ATTRB=ASKIP,INITIAL='EIBDTFRM    ='
E01EBDF  DFHMDF POS=(18,18),LENGTH=1,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* ADDRESS
*
EDF0202  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0202TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0202PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0202TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0202MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0202SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0202ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ADDRESS'
* COMMAREA (X'00000000') LENGTH (0000000)
*          (...//...) OR (X'0000//0000')
E0202CH  DFHMDF POS=(4,2),LENGTH=39,ATTRB=ASKIP
E0202CM  DFHMDF POS=(5,11),LENGTH=69,ATTRB=ASKIP
* CWA      (X'00000000') LENGTH (0000000)
*          (...//...) OR (X'0000//0000')
E0202WH  DFHMDF POS=(6,2),LENGTH=39,ATTRB=ASKIP
E0202WM  DFHMDF POS=(7,11),LENGTH=69,ATTRB=ASKIP
* EIB      (X'00000000') LENGTH (0000000)
*          (...//...) OR (X'0000//0000')
E0202EH  DFHMDF POS=(8,2),LENGTH=39,ATTRB=ASKIP
E0202EM  DFHMDF POS=(9,11),LENGTH=69,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0202PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0202OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP X'......'
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0202'''
E02021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0202RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E02022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0202R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0202RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E0202P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* HANDLE CONDITION
*
EDF0204  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0204TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0204PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0204TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0204SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0204ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=26,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS HANDLE CONDITION'
* @FILENOTFOUND@(X'00000000')  +X'000000'
* @NOSPACE     @
E0204C1  DFHMDF POS=(4,2),LENGTH=12,ATTRB=ASKIP
E0204X1  DFHMDF POS=(4,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204C2  DFHMDF POS=(5,2),LENGTH=12,ATTRB=ASKIP
E0204X2  DFHMDF POS=(5,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204C3  DFHMDF POS=(6,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204X3  DFHMDF POS=(6,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204C4  DFHMDF POS=(7,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204X4  DFHMDF POS=(7,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204C5  DFHMDF POS=(8,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204X5  DFHMDF POS=(8,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204C6  DFHMDF POS=(9,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204X6  DFHMDF POS=(9,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204C7  DFHMDF POS=(10,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204X7  DFHMDF POS=(10,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204C8  DFHMDF POS=(11,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204X8  DFHMDF POS=(11,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204C9  DFHMDF POS=(12,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204X9  DFHMDF POS=(12,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204CA  DFHMDF POS=(13,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204XA  DFHMDF POS=(13,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204CB  DFHMDF POS=(14,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204XB  DFHMDF POS=(14,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0204CC  DFHMDF POS=(15,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E0204XC  DFHMDF POS=(15,15),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0204PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0204OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0204'''
E02041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0204RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E02042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0204R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0204RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0204P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF7 :SCROLL BACK HALF'
E0204P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF8 :SCROLL FORWARD HALF'
* NO USE FOR PF9
E0204PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF10:SCROLL BACK FULL'
E0204PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF11:SCROLL FORWARD FULL'
* NO USE FOR PF12
*
* HANDLE AID
*
EDF0206  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0206TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0206PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0206TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0206SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0206ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=20,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS HANDLE AID'
* @ANYKEY@(X'00000000')  +X'000000'
* @PF24  @
E0206C1  DFHMDF POS=(4,2),LENGTH=6,ATTRB=ASKIP
E0206X1  DFHMDF POS=(4,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206C2  DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP
E0206X2  DFHMDF POS=(5,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206C3  DFHMDF POS=(6,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206X3  DFHMDF POS=(6,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206C4  DFHMDF POS=(7,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206X4  DFHMDF POS=(7,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206C5  DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206X5  DFHMDF POS=(8,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206C6  DFHMDF POS=(9,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206X6  DFHMDF POS=(9,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206C7  DFHMDF POS=(10,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206X7  DFHMDF POS=(10,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206C8  DFHMDF POS=(11,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206X8  DFHMDF POS=(11,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206C9  DFHMDF POS=(12,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206X9  DFHMDF POS=(12,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206CA  DFHMDF POS=(13,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206XA  DFHMDF POS=(13,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206CB  DFHMDF POS=(14,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206XB  DFHMDF POS=(14,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
E0206CC  DFHMDF POS=(15,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=AFLO
E0206XC  DFHMDF POS=(15,9),LENGTH=25,ATTRB=ASKIP,NOLABEL=AFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0206PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0206OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0206'''
E02061R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO      X
               INITIAL='RESPONSE:'
E0206RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E02062R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0206R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0206RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E0206P7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF7 :SCROLL BACK HALF'
E0206P8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF8 :SCROLL FORWARD HALF'
* NO USE FOR PF9
E0206PA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF10:SCROLL BACK FULL'
E0206PB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF11:SCROLL FORWARD FULL'
* NO USE FOR PF12
*
* IGNORE CONDITION
*
EDF020A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E020ATS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E020APG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E020ATN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E020ASC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E020AST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=26,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS IGNORE CONDITION'
* @FILENOTFOUND
E020AC1  DFHMDF POS=(4,2),LENGTH=12,ATTRB=ASKIP
E020AC2  DFHMDF POS=(5,2),LENGTH=12,ATTRB=ASKIP
E020AC3  DFHMDF POS=(6,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020AC4  DFHMDF POS=(7,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020AC5  DFHMDF POS=(8,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020AC6  DFHMDF POS=(9,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020AC7  DFHMDF POS=(10,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020AC8  DFHMDF POS=(11,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020AC9  DFHMDF POS=(12,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020ACA  DFHMDF POS=(13,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020ACB  DFHMDF POS=(14,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
E020ACC  DFHMDF POS=(15,2),LENGTH=12,ATTRB=ASKIP,NOLABEL=AFLO
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E020APR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E020AOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''020A'''
E020A1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E020ARP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E020A2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E020AR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E020ARC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6
E020AP7  DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF7 :SCROLL BACK HALF'
E020AP8  DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF8 :SCROLL FORWARD HALF'
* NO USE FOR PF9
E020APA  DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF10:SCROLL BACK FULL'
E020APB  DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF11:SCROLL FORWARD FULL'
* NO USE FOR PF12
*
* PUSH HANDLE
*
EDF020C  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E020CTS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E020CPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E020CTN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E020CSC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E020CST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=21,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS PUSH HANDLE'
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E020CPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E020COF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''020C'''
E020C1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E020CRP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E020C2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E020CR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E020CRC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* POP HANDLE
*
EDF020E  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E020ETS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E020EPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E020ETN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E020ESC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E020EST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=20,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS POP HANDLE'
* NOHANDLE
E020ENH  DFHMDF POS=(4,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E020EPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E020EOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''020E'''
E020E1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E020ERP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E020E2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E020ER2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E020ERC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* RECEIVE
*
EDF0402  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0402TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0402PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0402TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0402MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0402SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0402ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RECEIVE'
* INTO
* INTO          @(...//...)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='INTO'
E0402IN  DFHMDF POS=(4,17),LENGTH=63,ATTRB=ASKIP
* LENGTH OF INTO (00000)
         DFHMDF POS=(5,2),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='LENGTH OF INTO'
E0402LI  DFHMDF POS=(5,17),LENGTH=7,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000)'
E0402LD  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP
* NOWAIT
E0402NW  DFHMDF POS=(7,2),LENGTH=6,ATTRB=ASKIP
* NOHANDLE
E0402NH  DFHMDF POS=(8,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0402PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0402OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0402'''
E04021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,    X
               INITIAL='RESPONSE:'
E0402RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E04022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=CFLO,         X
               INITIAL='EIBRESP2:'
E0402R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0402RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* AFTER ENTER, ACTION REQUIRED ON TERMINAL
E0402AC  DFHMDF POS=(20,17),LENGTH=40,ATTRB=ASKIP,COLOR=WHITE
* NO USE FOR PF1
E0402P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,  X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* SEND
*
EDF0404  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0404TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0404PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0404TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0404MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0404SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0404ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS SEND'
* FROM  @(...//...)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FROM'
E0404FM  DFHMDF POS=(4,9),LENGTH=71,ATTRB=ASKIP
* LENGTH@(00000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='LENGTH'
E0404LN  DFHMDF POS=(5,9),LENGTH=7,ATTRB=ASKIP
* NOHANDLE
E0404NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0404PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0404OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0404'''
E04041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0404RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E04042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0404R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0404RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* READ
*
EDF0602  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0602TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0602PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0602TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0602MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0602SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0602ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS READ'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E0602FL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E0602IS  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO (00000000000)
E0602LI  DFHMDF POS=(6,2),LENGTH=28,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E0602LD  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E0602RI  DFHMDF POS=(8,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E0602RL  DFHMDF POS=(9,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E0602KL  DFHMDF POS=(10,2),LENGTH=22,ATTRB=ASKIP
* GENERIC
E0602GN  DFHMDF POS=(11,2),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E0602RB  DFHMDF POS=(12,2),LENGTH=4,ATTRB=ASKIP
* EQUAL/GTEQ
E0602EG  DFHMDF POS=(13,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E0602NH  DFHMDF POS=(14,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0602PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0602OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0602'''
E06021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0602RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E06022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0602R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0602RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E0602P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* STARTBR
*
EDF060C  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E060CTS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E060CPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E060CTN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E060CMD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E060CSC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E060CST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS STARTBR'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E060CFL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E060CRI  DFHMDF POS=(5,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E060CRL  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E060CKL  DFHMDF POS=(7,2),LENGTH=22,ATTRB=ASKIP
* GENERIC
E060CGN  DFHMDF POS=(8,2),LENGTH=7,ATTRB=ASKIP
* REQID         @(00000)
         DFHMDF POS=(9,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E060CRQ  DFHMDF POS=(9,17),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E060CRB  DFHMDF POS=(10,2),LENGTH=4,ATTRB=ASKIP
* EQUAL/GTEQ
E060CEG  DFHMDF POS=(11,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E060CNH  DFHMDF POS=(12,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E060CPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E060COF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''060C'''
E060C1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E060CRP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E060C2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E060CR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E060CRC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E060CP2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* READNEXT
*
EDF060E  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E060ETS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E060EPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E060ETN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E060EMD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E060ESC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E060EST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS READNEXT'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E060EFL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E060EIS  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO (00000000000)
E060ELI  DFHMDF POS=(6,2),LENGTH=28,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E060ELD  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E060ERI  DFHMDF POS=(8,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E060ERL  DFHMDF POS=(9,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E060EKL  DFHMDF POS=(10,2),LENGTH=22,ATTRB=ASKIP
* REQID         @(00000)
         DFHMDF POS=(11,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E060ERQ  DFHMDF POS=(11,17),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E060ERB  DFHMDF POS=(12,2),LENGTH=4,ATTRB=ASKIP
* NOHANDLE
E060ENH  DFHMDF POS=(13,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E060EPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E060EOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''060E'''
E060E1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E060ERP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E060E2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E060ER2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E060ERC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E060EP2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* READPREV
*
EDF0610  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0610TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0610PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0610TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0610MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0610SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0610ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS READPREV'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E0610FL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E0610IS  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO (00000000000)
E0610LI  DFHMDF POS=(6,2),LENGTH=28,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000000000)'
E0610LD  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(8,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E0610RI  DFHMDF POS=(8,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E0610RL  DFHMDF POS=(9,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E0610KL  DFHMDF POS=(10,2),LENGTH=22,ATTRB=ASKIP
* REQID         @(00000)
         DFHMDF POS=(11,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E0610RQ  DFHMDF POS=(11,17),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E0610RB  DFHMDF POS=(12,2),LENGTH=4,ATTRB=ASKIP
* NOHANDLE
E0610NH  DFHMDF POS=(13,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0610PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0610OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0610'''
E06101R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0610RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E06102R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0610R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0610RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E0610P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* ENDBR
*
EDF0612  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0612TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0612PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0612TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0612SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0612ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=15,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ENDBR'
* FILE @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E0612FL  DFHMDF POS=(4,8),LENGTH=10,ATTRB=ASKIP
* REQID@(00000)
         DFHMDF POS=(5,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E0612RQ  DFHMDF POS=(5,8),LENGTH=7,ATTRB=ASKIP
* NOHANDLE
E0612NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0612PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0612OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0612'''
E06121R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0612RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E06122R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0612R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0612RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* RESETBR
*
EDF0614  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0614TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0614PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0614TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0614MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0614SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0614ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RESETBR'
* FILE          @(........)
         DFHMDF POS=(4,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FILE'
E0614FL  DFHMDF POS=(4,17),LENGTH=10,ATTRB=ASKIP
* RIDFLD  KEY   @(...//...)
* RIDFLD  KEY   @(X'...//...')
* RIDFLD  RBA   @(X'00000000')
* RIDFLD  XRBA  @(X'0000000000000000')
* RIDFLD  RRN   @(00000000000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='RIDFLD'
E0614RI  DFHMDF POS=(5,17),LENGTH=63,ATTRB=ASKIP
* RIDFLD LENGTH  (00000)
E0614RL  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP
* KEYLENGTH      (00000)
E0614KL  DFHMDF POS=(7,2),LENGTH=22,ATTRB=ASKIP
* GENERIC
E0614GN  DFHMDF POS=(8,2),LENGTH=7,ATTRB=ASKIP
* REQID         @(00000)
         DFHMDF POS=(9,2),LENGTH=5,ATTRB=ASKIP,INITIAL='REQID'
E0614RQ  DFHMDF POS=(9,17),LENGTH=7,ATTRB=ASKIP
* RBA/XRBA/RRN
E0614RB  DFHMDF POS=(10,2),LENGTH=4,ATTRB=ASKIP
* EQUAL/GTEQ
E0614EG  DFHMDF POS=(11,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E0614NH  DFHMDF POS=(12,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0614PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0614OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0614'''
E06141R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0614RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E06142R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0614R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0614RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E0614P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* WRITEQ TS
*
EDF0A02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0A02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0A02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0A02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0A02MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0A02SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0A02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=19,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS WRITEQ TS'
* QNAME   @(................)
* QNAME   @(X'................................')
         DFHMDF POS=(4,2),LENGTH=5,ATTRB=ASKIP,INITIAL='QNAME'
E0A02QU  DFHMDF POS=(4,11),LENGTH=37,ATTRB=ASKIP
* FROM    @(...//...)
* FROM    @(X'...//...')
         DFHMDF POS=(5,2),LENGTH=4,ATTRB=ASKIP,INITIAL='FROM'
E0A02FM  DFHMDF POS=(5,11),LENGTH=69,ATTRB=ASKIP
* LENGTH  @(00000)
         DFHMDF POS=(6,2),LENGTH=6,ATTRB=ASKIP,INITIAL='LENGTH'
E0A02LN  DFHMDF POS=(6,11),LENGTH=7,ATTRB=ASKIP
* ITEM     (00000)
E0A02IT  DFHMDF POS=(7,2),LENGTH=16,ATTRB=ASKIP
* REWRITE
E0A02RW  DFHMDF POS=(8,2),LENGTH=7,ATTRB=ASKIP
* NUMITEMS (00000)
E0A02NI  DFHMDF POS=(9,2),LENGTH=16,ATTRB=ASKIP
* NOHANDLE
E0A02NH  DFHMDF POS=(10,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0A02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0A02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0A02'''
E0A021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0A02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0A022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0A02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0A02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* READQ TS
*
EDF0A04  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0A04TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0A04PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0A04TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0A04MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0A04SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0A04ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS READQ TS'
* QNAME         @(................)
* QNAME         @(X'................................')
         DFHMDF POS=(4,2),LENGTH=5,ATTRB=ASKIP,INITIAL='QNAME'
E0A04QU  DFHMDF POS=(4,17),LENGTH=37,ATTRB=ASKIP
* ITEM           (00000)
* NEXT
E0A04IT  DFHMDF POS=(5,2),LENGTH=22,ATTRB=ASKIP
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E0A04IS  DFHMDF POS=(6,2),LENGTH=79,ATTRB=ASKIP
* LENGTH OF INTO@(00000)
         DFHMDF POS=(7,2),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='LENGTH OF INTO'
E0A04LI  DFHMDF POS=(7,17),LENGTH=7,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000)'
E0A04LD  DFHMDF POS=(8,2),LENGTH=22,ATTRB=ASKIP
* NUMITEMS       (00000)
E0A04NI  DFHMDF POS=(9,2),LENGTH=22,ATTRB=ASKIP
* NOHANDLE
E0A04NH  DFHMDF POS=(10,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0A04PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0A04OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0A04'''
E0A041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0A04RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0A042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0A04R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0A04RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* DELETEQ TS
*
EDF0A06  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0A06TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0A06PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0A06TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0A06MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0A06SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0A06ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=20,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DELETEQ TS'
* QNAME@(................)
* QNAME@(X'................................')
         DFHMDF POS=(4,2),LENGTH=5,ATTRB=ASKIP,INITIAL='QNAME'
E0A06QU  DFHMDF POS=(4,8),LENGTH=37,ATTRB=ASKIP
* NOHANDLE
E0A06NH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0A06PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0A06OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0A06'''
E0A061R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0A06RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0A062R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0A06R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0A06RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* GETMAIN
*
EDF0C02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0C02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0C02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0C02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0C02SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0C02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS GETMAIN'
* LENGTH   (00000000000)
E0C02LN  DFHMDF POS=(4,2),LENGTH=22,ATTRB=ASKIP
* INITIMG  (X'..')
E0C02IM  DFHMDF POS=(5,2),LENGTH=16,ATTRB=ASKIP,NOLABEL=FL
* ADDRESS  (X'........')
E0C02AD  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP,NOLABEL=FL
* NOHANDLE
E0C02NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0C02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0C02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0C02'''
E0C021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0C02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0C022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0C02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0C02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* FREEMAIN
*
EDF0C04  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0C04TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0C04PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0C04TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0C04SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0C04ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS FREEMAIN'
* ADDRESS  (X'........')
E0C04AD  DFHMDF POS=(4,2),LENGTH=22,ATTRB=ASKIP
* NOHANDLE
E0C04NH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0C04PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0C04OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0C04'''
E0C041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0C04RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0C042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0C04R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0C04RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* LINK
*
EDF0E02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0E02MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0E02SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS LINK'
* PROGRAM @(........)
         DFHMDF POS=(4,2),LENGTH=18,ATTRB=ASKIP,INITIAL='PROGRAM'
E0E02PM  DFHMDF POS=(4,11),LENGTH=10,ATTRB=ASKIP
* COMMAREA (...//...)
* COMMAREA (X'...//...')
E0E02CM  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH   (00000)
E0E02LN  DFHMDF POS=(6,2),LENGTH=16,ATTRB=ASKIP
* NOHANDLE
E0E02NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E02'''
E0E021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0E02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0E02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E0E02P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* XCTL
*
EDF0E04  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E04TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E04PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E04TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0E04MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0E04SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E04ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS XCTL'
* PROGRAM  (........)
E0E04PM  DFHMDF POS=(4,2),LENGTH=19,ATTRB=ASKIP
* COMMAREA (...//...)
* COMMAREA (X'...//...')
E0E04CM  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH   (00000)
E0E04LN  DFHMDF POS=(6,2),LENGTH=16,ATTRB=ASKIP
* NOHANDLE
E0E04NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E04PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E04OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E04'''
E0E041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0E04RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0E04R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E04RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E0E04P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* LOAD
*
EDF0E06  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E06TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E06PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E06TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0E06SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E06ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=14,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS LOAD'
* PROGRAM  @(........)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='PROGRAM'
E0E06PM  DFHMDF POS=(4,12),LENGTH=10,ATTRB=ASKIP
* ENTRY/SET (X'........')
E0E06ET  DFHMDF POS=(5,2),LENGTH=23,ATTRB=ASKIP
* LENGTH    (00000)
E0E06LN  DFHMDF POS=(6,2),LENGTH=17,ATTRB=ASKIP
* FLENGTH   (00000000000)
E0E06FL  DFHMDF POS=(7,2),LENGTH=23,ATTRB=ASKIP
* NOHANDLE
E0E06NH  DFHMDF POS=(8,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E06PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E06OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E06'''
E0E061R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0E06RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E062R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0E06R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E06RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* RETURN
*
EDF0E08  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E08TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E08PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E08TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E0E08MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0E08SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E08ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=16,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RETURN'
* TRANSID  (....)
E0E08TR  DFHMDF POS=(4,2),LENGTH=15,ATTRB=ASKIP
* COMMAREA (...//...)
* COMMAREA (X'...//...')
E0E08CM  DFHMDF POS=(5,2),LENGTH=79,ATTRB=ASKIP
* LENGTH   (00000)
E0E08LN  DFHMDF POS=(6,2),LENGTH=16,ATTRB=ASKIP
* IMMEDIATE
E0E08IM  DFHMDF POS=(7,2),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E08PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E08OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E08'''
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E0E08P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* RELEASE
*
EDF0E0A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E0ATS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E0APG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E0ATN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0E0ASC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E0AST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RELEASE'
* PROGRAM  @(........)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='PROGRAM'
E0E0APM  DFHMDF POS=(4,12),LENGTH=10,ATTRB=ASKIP
* NOHANDLE
E0E0ANH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E0APR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E0AOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E0A'''
E0E0A1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0E0ARP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E0A2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0E0AR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E0ARC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* HANDLE ABEND
*
EDF0E0E  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E0E0ETS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E0E0EPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E0E0ETN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E0E0ESC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E0E0EST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=22,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS HANDLE ABEND'
* CANCEL/RESET
E0E0ECR  DFHMDF POS=(4,2),LENGTH=6,ATTRB=ASKIP
* PROGRAM (........)
* LABEL (X'00000000')  +X'000000'
E0E0EPL  DFHMDF POS=(5,2),LENGTH=31,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E0E0EPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E0E0EOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E0E'''
E0E0E1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E0E0ERP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E0E0E2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E0E0ER2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E0E0ERC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* ASKTIME
* ASKTIME ABSTIME
*
EDF1002  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1002TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1002PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1002TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1002SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1002ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=17,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ASKTIME'
* ABSTIME (...............)
E1002AB  DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,NOLABEL=FLO,            X
               INITIAL='ABSTIME'
E1002AT  DFHMDF POS=(4,10),LENGTH=17,ATTRB=ASKIP
* NOHANDLE
E1002NH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1002PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1002OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=6,ATTRB=ASKIP,INITIAL='EIBFN:'
* EIBFN: X'1002' OR X'4A02'
E1002FN  DFHMDF POS=(17,48),LENGTH=7,ATTRB=ASKIP
E10021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1002RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E10022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1002R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1002RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* DELAY
*
EDF1004  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1004TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1004PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1004TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E1004MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1004SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1004ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=15,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DELAY'
* INTERVAL
* INTERVAL (HH:MM:SS)
* TIME
* TIME     (HH:MM:SS)
E1004IT  DFHMDF POS=(4,2),LENGTH=19,ATTRB=ASKIP
* FOR   HOURS (99)
* FOR   MINUTES (9999)
* FOR   SECONDS (999999)
* FOR   HOURS (99) MINUTES (99) SECONDS (99)
*
* UNTIL HOURS (99)
* UNTIL MINUTES (9999)
* UNTIL SECONDS (999999)
* UNTIL HOURS (99) MINUTES (99) SECONDS (99)
E1004FU  DFHMDF POS=(5,2),LENGTH=42,ATTRB=ASKIP
* REQID (........)
* REQID (X'................')
E1004RQ  DFHMDF POS=(6,2),LENGTH=27,ATTRB=ASKIP
* NOHANDLE
E1004NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1004PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1004OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1004'''
E10041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1004RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E10042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1004R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1004RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E1004P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* START
*
EDF1008  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1008TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1008PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1008TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E1008MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1008SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1008ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=15,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS START'
* TRANSID  @(....)
         DFHMDF POS=(4,2),LENGTH=7,ATTRB=ASKIP,INITIAL='TRANSID'
E1008TI  DFHMDF POS=(4,12),LENGTH=6,ATTRB=ASKIP
* INTERVAL
* INTERVAL  (HH:MM:SS)
* TIME
* TIME      (HH:MM:SS)
E1008IT  DFHMDF POS=(5,2),LENGTH=20,ATTRB=ASKIP
* FOR   HOURS (99)
* FOR   MINUTES (9999)
* FOR   SECONDS (999999)
* FOR   HOURS (99) MINUTES (99) SECONDS (99)
*
* UNTIL HOURS (99)
* UNTIL MINUTES (9999)
* UNTIL SECONDS (999999)
* UNTIL HOURS (99) MINUTES (99) SECONDS (99)
E1008FU  DFHMDF POS=(6,2),LENGTH=42,ATTRB=ASKIP
* REQID     (........)
* REQID     (X'................')
E1008RQ  DFHMDF POS=(7,2),LENGTH=31,ATTRB=ASKIP
* FROM      (...//...)
* FROM      (X'...//...')
E1008FM  DFHMDF POS=(8,2),LENGTH=79,ATTRB=ASKIP
* LENGTH    (00000)
E1008LN  DFHMDF POS=(9,2),LENGTH=17,ATTRB=ASKIP
* TERMID    (....)
E1008TM  DFHMDF POS=(10,2),LENGTH=16,ATTRB=ASKIP
* RTRANSID  (....)
* RTRANSID  (X'........')
E1008RT  DFHMDF POS=(11,2),LENGTH=23,ATTRB=ASKIP
* RTERMID   (....)
* RTERMID   (X'........')
E1008RM  DFHMDF POS=(12,2),LENGTH=23,ATTRB=ASKIP
* QUEUE     (........)
* QUEUE     (X'................')
E1008QU  DFHMDF POS=(13,2),LENGTH=31,ATTRB=ASKIP
* NOHANDLE
E1008NH  DFHMDF POS=(14,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1008PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1008OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1008'''
E10081R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1008RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E10082R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1008R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1008RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E1008P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* RETRIEVE
*
EDF100A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E100ATS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E100APG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E100ATN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E100AMD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E100ASC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E100AST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RETRIEVE'
* INTO
* INTO           (...//...)
* INTO           (X'...//...')
* SET
* SET            (X'........')
E100AIS  DFHMDF POS=(4,2),LENGTH=79,ATTRB=ASKIP
* LENGTH         (00000)
E100ALN  DFHMDF POS=(5,2),LENGTH=22,ATTRB=ASKIP
* AFTER DISPLAYS 'LENGTH OF DATA (00000)'
E100ALD  DFHMDF POS=(6,2),LENGTH=22,ATTRB=ASKIP
* RTRANSID       (....)
* RTRANSID       (X'........')
E100ART  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* RTERMID        (....)
* RTERMID        (X'........')
E100ARM  DFHMDF POS=(8,2),LENGTH=28,ATTRB=ASKIP
* QUEUE          (........)
* QUEUE          (X'................')
E100AQU  DFHMDF POS=(9,2),LENGTH=36,ATTRB=ASKIP
* NOHANDLE
E100ANH  DFHMDF POS=(14,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E100APR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E100AOF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''100A'''
E100A1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E100ARP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E100A2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E100AR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E100ARC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E100AP2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* CANCEL
*
EDF100C  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E100CTS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E100CPG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E100CTN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E100CMD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E100CSC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E100CST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=16,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS CANCEL'
* REQID (........)
* REQID (X'................')
E100CRQ  DFHMDF POS=(4,2),LENGTH=27,ATTRB=ASKIP
* NOHANDLE
E100CNH  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E100CPR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E100COF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''100C'''
E100C1R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E100CRP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E100C2R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E100CR2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E100CRC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* ENQ
*
EDF1204  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1204TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1204PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1204TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E1204MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1204SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1204ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=13,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS ENQ'
* RESOURCE@(X'00000000')
* RESOURCE@(...//...)
* RESOURCE@(X'...//...')
         DFHMDF POS=(4,2),LENGTH=8,ATTRB=ASKIP,INITIAL='RESOURCE'
E1204RS  DFHMDF POS=(4,11),LENGTH=69,ATTRB=ASKIP
* LENGTH  @(00000)
E1204LH  DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=FLO,            X
               INITIAL='LENGTH'
E1204LN  DFHMDF POS=(5,11),LENGTH=7,ATTRB=ASKIP
* NOSUSPEND
E1204NS  DFHMDF POS=(6,2),LENGTH=9,ATTRB=ASKIP
* NOHANDLE
E1204NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1204PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1204OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1204'''
E12041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1204RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E12042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1204R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1204RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E1204P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* DEQ
*
EDF1206  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1206TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1206PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1206TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII/HEX
E1206MD  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1206SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1206ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=13,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DEQ'
* RESOURCE@(X'00000000')
* RESOURCE@(...//...)
* RESOURCE@(X'...//...')
         DFHMDF POS=(4,2),LENGTH=8,ATTRB=ASKIP,INITIAL='RESOURCE'
E1206RS  DFHMDF POS=(4,11),LENGTH=69,ATTRB=ASKIP
* LENGTH  @(00000)
E1206LH  DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,NOLABEL=FLO,            X
               INITIAL='LENGTH'
E1206LN  DFHMDF POS=(5,11),LENGTH=7,ATTRB=ASKIP
* NOHANDLE
E1206NH  DFHMDF POS=(6,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1206PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1206OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1206'''
E12061R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1206RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E12062R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1206R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1206RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1
E1206P2  DFHMDF POS=(21,26),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF2 :EBCDIC/ASCII/HEX'
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* RECEIVE MAP
*
EDF1802  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1802TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1802PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1802TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1802SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1802ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=21,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS RECEIVE MAP'
* MAP           @(.......)
         DFHMDF POS=(4,2),LENGTH=3,ATTRB=ASKIP,INITIAL='MAP'
E1802MP  DFHMDF POS=(4,17),LENGTH=9,ATTRB=ASKIP
* MAPSET        @(........)  (00000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='MAPSET'
E1802MS  DFHMDF POS=(5,17),LENGTH=19,ATTRB=ASKIP
* MAP STRUCTURE @(X'........')
         DFHMDF POS=(6,2),LENGTH=13,ATTRB=ASKIP,INITIAL='MAP STRUCTURE'
E1802SR  DFHMDF POS=(6,17),LENGTH=13,ATTRB=ASKIP
* NOHANDLE
E1802NH  DFHMDF POS=(7,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1802PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1802OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1802'''
E18021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1802RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E18022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1802R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1802RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* SEND MAP
*
EDF1804  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1804TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1804PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1804TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1804SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1804ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=18,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS SEND MAP'
* MAP           @(.......)
         DFHMDF POS=(4,2),LENGTH=3,ATTRB=ASKIP,INITIAL='MAP'
E1804MP  DFHMDF POS=(4,17),LENGTH=9,ATTRB=ASKIP
* MAPSET        @(........)  (00000)
         DFHMDF POS=(5,2),LENGTH=6,ATTRB=ASKIP,INITIAL='MAPSET'
E1804MS  DFHMDF POS=(5,17),LENGTH=19,ATTRB=ASKIP
* MAP STRUCTURE @(X'........')
         DFHMDF POS=(6,2),LENGTH=13,ATTRB=ASKIP,INITIAL='MAP STRUCTURE'
E1804SR  DFHMDF POS=(6,17),LENGTH=13,ATTRB=ASKIP
* SET            (X'........')
E1804DS  DFHMDF POS=(7,2),LENGTH=28,ATTRB=ASKIP
* LENGTH OF DATA (00000)
E1804LN  DFHMDF POS=(8,2),LENGTH=22,ATTRB=ASKIP
* DATAONLY/MAPONLY
E1804DM  DFHMDF POS=(9,2),LENGTH=8,ATTRB=ASKIP
* CURSOR
* CURSOR        @(0000) ROW(00) COL(00)
E1804CS  DFHMDF POS=(10,2),LENGTH=6,ATTRB=ASKIP
E1804CP  DFHMDF POS=(10,17),LENGTH=22,ATTRB=ASKIP
* ERASEAUP/ERASE
E1804ER  DFHMDF POS=(11,2),LENGTH=8,ATTRB=ASKIP
* ALARM
E1804AL  DFHMDF POS=(12,2),LENGTH=5,ATTRB=ASKIP
* FREEKB
E1804FK  DFHMDF POS=(13,2),LENGTH=6,ATTRB=ASKIP
* FRSET
E1804FR  DFHMDF POS=(14,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E1804NH  DFHMDF POS=(15,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1804PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1804OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1804'''
E18041R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1804RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E18042R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1804R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1804RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* SEND CONTROL
*
EDF1812  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1812TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1812PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1812TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1812SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1812ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=22,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS SEND CONTROL'
* CURSOR
* CURSOR@(0000) ROW(00) COL(00)
E1812CS  DFHMDF POS=(4,2),LENGTH=6,ATTRB=ASKIP
E1812CP  DFHMDF POS=(4,9),LENGTH=22,ATTRB=ASKIP
* ERASEAUP/ERASE
E1812ER  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
* ALARM
E1812AL  DFHMDF POS=(6,2),LENGTH=5,ATTRB=ASKIP
* FREEKB
E1812FK  DFHMDF POS=(7,2),LENGTH=6,ATTRB=ASKIP
* FRSET
E1812FR  DFHMDF POS=(8,2),LENGTH=5,ATTRB=ASKIP
* NOHANDLE
E1812NH  DFHMDF POS=(9,2),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1812PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1812OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1812'''
E18121R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1812RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E18122R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1812R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1812RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* DUMP TRANSACTION
*
EDF1C02  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
E1C02TS  DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
E1C02PG  DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
E1C02TN  DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
E1C02SC  DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
E1C02ST  DFHMDF POS=(2,10),LENGTH=26,ATTRB=ASKIP
         DFHMDF POS=(3,1),LENGTH=26,ATTRB=ASKIP,                       X
               INITIAL='EXEC CICS DUMP TRANSACTION'
* DUMPCODE   @(....)
         DFHMDF POS=(4,2),LENGTH=8,ATTRB=ASKIP,INITIAL='DUMPCODE'
E1C02DC  DFHMDF POS=(4,14),LENGTH=6,ATTRB=ASKIP
* COMPLETE
E1C02CM  DFHMDF POS=(5,2),LENGTH=8,ATTRB=ASKIP
* FROM        (X'........')
E1C02FM  DFHMDF POS=(6,2),LENGTH=25,ATTRB=ASKIP
* LENGTH      (00000000000)
E1C02LN  DFHMDF POS=(7,2),LENGTH=25,ATTRB=ASKIP
* SEGMENTLIST (X'........')
E1C02SL  DFHMDF POS=(8,2),LENGTH=25,ATTRB=ASKIP
* LENGTHLIST  (X'........')
E1C02LL  DFHMDF POS=(9,2),LENGTH=25,ATTRB=ASKIP
* NUMSEGMENTS (00000000000)
E1C02NS  DFHMDF POS=(10,2),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
E1C02PR  DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
E1C02OF  DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''1C02'''
E1C021R  DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),NOLABEL=FLO,     X
               INITIAL='RESPONSE:'
E1C02RP  DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
E1C022R  DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,NOLABEL=FLO,          X
               INITIAL='EIBRESP2:'
E1C02R2  DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
* EIBRCODE: X'000000000000'
E1C02RC  DFHMDF POS=(18,40),LENGTH=25,ATTRB=ASKIP
         DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
         DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,                     X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4
         DFHMDF POS=(22,26),LENGTH=20,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF5 :WORKING STORAGE'
* NO USE FOR PF6-12
*
* PROGRAM/TASK TERMINATION
*
EDFKCP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,EXTATT=YES,NOLABEL=ACFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
EKCPTS   DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
EKCPPG   DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
EKCPTN   DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
EKCPSC   DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
         DFHMDF POS=(2,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='STATUS:'
* PROGRAM TERMINATION : LEVEL ..
* TASK TERMINATION : NO TRANSID SET
* TASK TERMINATION : TRANSID .... SET
EKCPST   DFHMDF POS=(2,9),LENGTH=35,ATTRB=(ASKIP,BRT),COLOR=WHITE,     X
               NOLABEL=AFL
         DFHMDF POS=(17,1),LENGTH=8,ATTRB=ASKIP,INITIAL='PROGRAM:'
EKCPPR   DFHMDF POS=(17,10),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(17,19),LENGTH=7,ATTRB=ASKIP,INITIAL='OFFSET:'
EKCPOF   DFHMDF POS=(17,27),LENGTH=9,ATTRB=ASKIP
         DFHMDF POS=(17,40),LENGTH=14,ATTRB=ASKIP,                     X
               INITIAL='EIBFN: X''0E08'''
         DFHMDF POS=(18,1),LENGTH=9,ATTRB=(ASKIP,BRT),                 X
               INITIAL='RESPONSE:'
EKCPRP   DFHMDF POS=(18,11),LENGTH=12,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(18,25),LENGTH=9,ATTRB=ASKIP,INITIAL='EIBRESP2:'
EKCPR2   DFHMDF POS=(18,35),LENGTH=3,ATTRB=ASKIP
EKCPEN   DFHMDF POS=(20,1),LENGTH=15,ATTRB=(ASKIP,BRT),NOLABEL=CFLO,   X
               INITIAL='ENTER: CONTINUE'
* NO USE FOR PF1-2
EKCPP3   DFHMDF POS=(21,51),LENGTH=20,ATTRB=ASKIP,NOLABEL=CFLO,        X
               INITIAL='PF3 :END EDF SESSION'
* NO USE FOR PF4-12
*
* WORKING STORAGE
*
EDFWKS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,NOLABEL=AFL
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(ASKIP,BRT),                 X
               INITIAL='TRANSACTION:'
EWKSTS   DFHMDF POS=(1,14),LENGTH=4,ATTRB=ASKIP
         DFHMDF POS=(1,19),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='PROGRAM:'
EWKSPG   DFHMDF POS=(1,28),LENGTH=8,ATTRB=ASKIP
         DFHMDF POS=(1,37),LENGTH=5,ATTRB=(ASKIP,BRT),INITIAL='TASK:'
EWKSTN   DFHMDF POS=(1,43),LENGTH=7,ATTRB=ASKIP
* MODE EBCDIC/ASCII
EWKSMDE  DFHMDF POS=(1,51),LENGTH=6,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(1,68),LENGTH=8,ATTRB=(ASKIP,BRT),                 X
               INITIAL='DISPLAY:'
EWKSSC   DFHMDF POS=(1,77),LENGTH=3,ATTRB=ASKIP
EWKSHED  DFHMDF POS=(2,1),LENGTH=79,ATTRB=(ASKIP,BRT)
* HEX/CHAR DISPLAY
*@--ADDR-- OFFSET 00000000 00000000 00000000 00000000  XXXXXXXXXXXXXXXX
EWKSL01  DFHMDF POS=(3,1),LENGTH=69,ATTRB=ASKIP
EWKSL02  DFHMDF POS=(4,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL03  DFHMDF POS=(5,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL04  DFHMDF POS=(6,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL05  DFHMDF POS=(7,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL06  DFHMDF POS=(8,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL07  DFHMDF POS=(9,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL08  DFHMDF POS=(10,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL09  DFHMDF POS=(11,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL10  DFHMDF POS=(12,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL11  DFHMDF POS=(13,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL12  DFHMDF POS=(14,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL13  DFHMDF POS=(15,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL14  DFHMDF POS=(16,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL15  DFHMDF POS=(17,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
EWKSL16  DFHMDF POS=(18,1),LENGTH=69,ATTRB=ASKIP,NOLABEL=AFLO
         DFHMDF POS=(20,1),LENGTH=22,ATTRB=(ASKIP,BRT),                X
               INITIAL='ENTER: CURRENT DISPLAY'
* NO USE FOR PF1
         DFHMDF POS=(21,26),LENGTH=17,ATTRB=(ASKIP,BRT),               X
               INITIAL='PF2 :EBCDIC/ASCII'
* NO USE FOR PF3-6
EWKSP7   DFHMDF POS=(23,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF7 :SCROLL BACK HALF'
EWKSP8   DFHMDF POS=(23,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF8 :SCROLL FORWARD HALF'
* NO USE FOR PF9
EWKSPA   DFHMDF POS=(24,1),LENGTH=21,ATTRB=(ASKIP,BRT),NOLABEL=FLO,    X
               INITIAL='PF10:SCROLL BACK FULL'
EWKSPB   DFHMDF POS=(24,26),LENGTH=24,ATTRB=(ASKIP,BRT),NOLABEL=FLO,   X
               INITIAL='PF11:SCROLL FORWARD FULL'
* NO USE FOR PF12
*
         DFHMSD TYPE=FINAL
         END
