TESTB    START 0
         USING *,13
         STM   14,12,12(13)
         ST    13,8(13)
         ST    15,4(15)
         LR    13,15
         B
         B     
         B     ,
         BNE
         BNE   
         BNE   ,
         BC    12
         BC    12,
         BC    ,12
         J
         J     
         J     ,
         SVC
         SVC   
         SVC   ,
         MVC
         MVC   
         MVC   ,
         RETURN (14,12)
         END   TESTB
