TESTB    START 0
         USING *,13
         STM   14,12,12(13)
         ST    13,8(13)
         ST    15,4(15)
         LR    13,15
         J
         RETURN (14,12)
         END   TESTB
