* Test ISSYM built-in function error
ISSYME1  CSECT
         SR    15,15
         BR    14
*
         LCLA  &A 
*
*        HLASM LangRef example
*
*&A      SETA  123                 Preset return value
&A       SETA  123
*&A      ISSYM('')                 Error
&A       SETA  ISSYM('')           0
         MNOTE 'ISSYM('''')=&A'
         DC    F'&A'
         AIF   (&A EQ 0).OK
         MNOTE 12,'Error; expected value is 0'
.OK      ANOP
*
         END 
