TESTX2C2 CSECT
         GBLC &SRC
*        Test X2C with EBCDIC '1' - X'F1'
&SRC     SETC X2C('F1')
         DC    C'&SRC'
*        Test X2C with ASCII '1' - X'31'
&SRC     SETC X2C('31')
         DC    C'&SRC'
         END