P3MM1    ZMFACC CODE,START,NAME='Melvyn Maltz'
         LA    R1,TRANHEX         R1=TRANSLATE TABLE ADDRESS
         LA    R6,MYSHOW          DESTINATION ADDRESS
         LA    R7,6               SOURCE LENGTH
         LA    R8,MYHEX           SOURCE ADDRESS
RETRY    EQU   *
         TROT  R6,R8,1            TRANSLATE TO PRINTABLE HEX
         BC    1,RETRY            RETRY REQ'D FOR MF PER MICHAEL POIL
         ZMFACC CODE,END
         ZMFACC INPUT,START
MYHEX    DC    X'FFA193BC120A'    HEX DATA
         ZMFACC INPUT,END
         ZMFACC OUTPUT,START
MYSHOW   DS    CL12               RESULT
         ZMFACC OUTPUT,END
TRANHEX  DC    C'000102030405060708090A0B0C0D0E0F'  00-0F
         DC    C'101112131415161718191A1B1C1D1E1F'  10-1F
         DC    C'202122232425262728292A2B2C2D2E2F'  20-2F
         DC    C'303132333435363738393A3B3C3D3E3F'  30-3F
         DC    C'404142434445464748494A4B4C4D4E4F'  40-4F
         DC    C'505152535455565758595A5B5C5D5E5F'  50-5F
         DC    C'606162636465666768696A6B6C6D6E6F'  60-6F
         DC    C'707172737475767778797A7B7C7D7E7F'  70-7F
         DC    C'808182838485868788898A8B8C8D8E8F'  80-8F
         DC    C'909192939495969798999A9B9C9D9E9F'  90-9F
         DC    C'A0A1A2A3A4A5A6A7A8A9AAABACADAEAF'  A0-AF
         DC    C'B0B1B2B3B4B5B6B7B8B9BABBBCBDBEBF'  B0-BF
         DC    C'C0C1C2C3C4C5C6C7C8C9CACBCCCDCECF'  C0-CF
         DC    C'D0D1D2D3D4D5D6D7D8D9DADBDCDDDEDF'  D0-DF
         DC    C'E0E1E2E3E4E5E6E7E8E9EAEBECEDEEEF'  E0-EF
         DC    C'F0F1F2F3F4F5F6F7F8F9FAFBFCFDFEFF'  F0-FF
         LTORG
         END
