         DEFINE CATALOG,NAME=Z390CAT1
*
* Z390/CICS TEST FILE 1
*
         DEFINE CLUSTER,NAME=MYFILE01,RECORDSIZE=(1,26),               X
               INDEX=NONINDEXED
*
* Z390/CICS TEST FILE 2
*
         DEFINE CLUSTER,NAME=MYFILE02,RECORDSIZE=50,INDEX=NONINDEXED
*
* Z390/CICS TEST FILE 3
*
         DEFINE CLUSTER,NAME=MYFILE03,RECORDSIZE=100,INDEX=NONINDEXED
*
         DEFINE END
         END
