       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TSET.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE
               ASSIGN TO 'ZCOBOL\DEMO\T1.CBL'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUT-FILE
               ASSIGN TO 'ZCOBOL\DEMO\T4.CBL'
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  IN-FILE
           DATA RECORD IS IN-RECORD.
       01  IN-RECORD.
           03  FILLER PIC X(24).
           03  IN-FILE-NAME PIC X(46).
           03  FILLER PIC X(08).  
       FD  OUT-FILE
           DATA RECORD IS OUT-RECORD.
       01  OUT-RECORD PIC X(80).
       WORKING-STORAGE SECTION.
       01  END-OF-FILE-FLAG PIC X VALUE 'F'.
       PROCEDURE DIVISION.
       MAINLINE.
           PERFORM INITIALIZATION-ROUTINE.
           PERFORM THE-LOOP
                   UNTIL END-OF-FILE-FLAG = 'Y'.
           PERFORM EOJ-ROUTINE.
           STOP RUN.
       INITIALIZATION-ROUTINE.
           OPEN INPUT IN-FILE.
           OPEN OUTPUT OUT-FILE.
           READ IN-FILE INTO OUT-RECORD
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
           WRITE OUT-RECORD.
           READ IN-FILE INTO OUT-RECORD
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
           WRITE OUT-RECORD.
           READ IN-FILE INTO OUT-RECORD
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
           WRITE OUT-RECORD.
           READ IN-FILE INTO OUT-RECORD
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
           WRITE OUT-RECORD.
           READ IN-FILE INTO OUT-RECORD
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
           WRITE OUT-RECORD.
           READ IN-FILE INTO OUT-RECORD
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
           WRITE OUT-RECORD.
           READ IN-FILE
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
           ACCEPT IN-FILE-NAME FROM CONSOLE.
           WRITE OUT-RECORD FROM IN-RECORD.
           READ IN-FILE INTO OUT-RECORD
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
       THE-LOOP.
           WRITE OUT-RECORD.
           READ IN-FILE INTO OUT-RECORD
                AT END MOVE 'Y' TO END-OF-FILE-FLAG.
       EOJ-ROUTINE.
           CLOSE IN-FILE.
           CLOSE OUT-FILE.
