         TITLE 'TESTZCV1 - DUMP ZCVT PGM FIELDS'
*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 04/23/05                                                 *
*********************************************************************
* 04/23/06 RPI 286 DUMP ZCVT FIELDS STARTING AT X'2000' AFTER PSA      
*********************************************************************
TESTZCV1 SUBENTRY    
         WTO   'TESTZCV1 STARTED'
         L     R2,=A(ZCVT)
         USING IHAZCVT,R2
         MVC   DPGM,ZCVTUPGM
         MVC   DIPL,ZCVTIPLP
         WTO   MF=(E,WTOMSG)
         WTO   'TESTZCV1 ENDED OK'
         SUBEXIT
         EQUREGS
WTOMSG   DC    AL2(WTOEND-*,0),C' Z390 PGM='
DPGM     DC    CL8' '
         DC    C' IPL='
DIPL     DC    CL8' '
WTOEND   EQU   *
         ZCVTD
         END
