*********************************************************************
* Copyright 2006 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
*********************************************************************
* 05/01/06 RPI 305 TEST ESTAE EXIT WITH PARM AND RESTART                
* 09/18/06 RPI 305 TEST REPEAT USAGE                                    
* 11/10/06 RPI 475 TEST ESTAE EXIT,CT,PARAM=RESTART                     
* 06/10/07 RPI 636 REQUIRE R15=4 FOR RESTART, R15=0 FOR PERCOLATE       
*********************************************************************
         TITLE 'TESTSTA1 - TEST ESTAE'
TESTSTA1 SUBENTRY
         WTO   'TESTSTA1 TEST ESTAE STARTED'
         ESTAE EXIT,PARAM=RESTART
         DC    X'0000' CAUSE 0C1
RESTART  DS    0H
         AP    COUNT,=P'1'
         CP    COUNT,=P'1'
         BE    RESTART2
         BH    RESTART3
RESTART1 WTO   'TESTSTA1 RESTART1 SUCCESSFUL'
         DC    X'0000' CAUSE 0C1
RESTART2 WTO   'TESTSTA1 RESTART2 SUCCESSFUL'
         ESTAE EXIT,CT,PARAM=RESTART
         DC    X'0000' CAUSE 0C1
RESTART3 WTO   'TESTSTA1 RESTART3 SUCCESSFUL'
         WTO   'TESTSTA1 ENDED OK'
         SUBEXIT
         LTORG
         DROP
EXIT     DS    0H
         USING *,R15
         USING IHAESTA,R1
         L     R0,ESTAPARM
         ST    R0,ESTAPSW+4
         LA    R15,4          RESTART CURRENT TASK AT ESTAPSW DSH
         BR    R14
COUNT    DC    P'0'
         ESTAD
         EQUREGS
         END         
