*********************************************************************
* Copyright 2006 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/11/06                                                 *
*********************************************************************
* 09/11/06 RPI 363 CHANGE FROM TEST TO RT\TEST DIRECTORY              
* 02/02/07 RPI 532 REMOVE WINDOWS PROMPT AND FIX PATH CASE FOR LINUX  
* 10/30/07 RPI 731 ADD CMDLOG=NO TO ALLOW PARENT TASK TO READ OUTPUT  
*********************************************************************
         TITLE 'TESTCMD2 TEST USE OF SVC 34 COMMAND PROCESSOR'
TESTCMD2 SUBENTRY
         COPY  ASMMSP
         WTO   'TESTCMD2 TEST SVC 34 CMDPROC MULT TASK SUPPORT'
         CMDPROC START,ID=0,CMDLOG=NO  RPI 731
         CMDPROC WRITE,=C'"rt\test\TESTCMDA.BAT"',ID=0
         CMDPROC START,ID=1,CMDLOG=NO  RPI 731
         CMDPROC WRITE,=C'"rt\test\TESTCMDB.BAT"',ID=1
         LA    R4,50
CMDLOOP  EQU   *
CMDREAD1 EQU   *
         AHI   R4,-1
         BZ    ERROR1
         CMDPROC READ,MSG,ID=0
         CHI   R15,4
         BE    CMDREAD1 
         CHI   R15,8
         BE    ERROR1
         MVI   WTOCMD_ID,C'0'
         WTO   MF=(E,WTOCMD)
         LA    R1,MSG
         LA    R2,MSG+70
         DO    WHILE=(CR,R1,LT,R2)
               IF (CLC,0(7,R1),EQ,=C'REM END')
                  IF (CLI,EOF2,EQ,C'T')
                     B  CMDEND
                  ELSE
                     MVI EOF1,C'T'
                  ENDIF
               ENDIF
               AHI  R1,1
         ENDDO
CMDREAD2 EQU   *
         AHI   4,-1
         BZ    ERROR2                         
         CMDPROC READ,MSG,ID=1
         CHI   15,4
         BE    CMDREAD2 
         CHI   15,8
         BE    ERROR2
         MVI   WTOCMD_ID,C'1'
         WTO   MF=(E,WTOCMD)
         LA    R1,MSG
         LA    R2,MSG+70
         DO    WHILE=(CR,R1,LT,R2)
               IF (CLC,0(7,R1),EQ,=C'REM END')
                  IF (CLI,EOF1,EQ,C'T')
                     B  CMDEND
                  ELSE
                     MVI EOF2,C'T'
                  ENDIF
               ENDIF
               AHI  R1,1
         ENDDO
         B     CMDLOOP
CMDEND   EQU   *
         CMDPROC STOP,ID=0
         CMDPROC STOP,ID=1
         WTO   'TESTSVC1 ENDING OK'
         SUBEXIT
ERROR1   WTO   'TESTCMD2 CMD READ1 ERROR'
         SUBEXIT RC=16
ERROR2   WTO   'TESTCMD2 CMD READ2 ERROR'
         SUBEXIT RC=16
WTOCMD   DC    AL2(WTOEND-*,0)
         DC    C'MSG FROM CMD'
WTOCMD_ID DC   C' ='
MSG      DC    CL80' '
WTOEND   EQU   *
EOF1     DC    C'F'
EOF2     DC    C'F'
         EQUREGS
         END
