*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 10/18/05 CHANGE DSN TO EBCDIC UNLESS ASCII MODE
* 09/11/06 RPI 363 CHANGE TEST TO RT\TEST DIRECTORY 
* 02/07/07 RPI 532 CORRECT PATH CASE FOR LINUX      
*********************************************************************
TESTDCBC SUBENTRY
         WTO   'TESTDCBC ASCII MODE, DCBREC, DCBDSNAM, NEW OUTPUT'
         OPEN  (SYSUT1,(INPUT),SYSUT2,(OUTPUT),SYSOUT,(OUTPUT))
LOOP     EQU   *
         GET   SYSUT1
         AP    PTOT,=P'1'
         MVC   DTOT,=X'40202020'
         ED    DTOT,PTOT
         PUT   SYSOUT,MSG
         PUT   SYSUT2
         B     LOOP
EOF      CLOSE (SYSUT1,,SYSUT2,,SYSOUT)
         WTO   'TESTDCBCBC ENDED OK'
         SUBEXIT
SYSUT1   DCB   RECFM=FT,LRECL=80,EODAD=EOF,MACRF=GM,                   X
               RECORD=RECORD,DSNAME=DSN1
SYSUT2   DCB   RECFM=FT,LRECL=80,MACRF=PM,                             X
               RECORD=RECORD,DSNAME=DSN2
SYSOUT   DCB   RECFM=FT,BLKSIZE=120,MACRF=PM,                          X
               RECORD=RECORD,DSNAME=DSN3
DSN1     DC    C'rt\test\TESTDCBC.TF1',X'00'
DSN2     DC    C'rt\test\TESTDCBC.TF2',X'00'
DSN3     DC    C'rt\test\TESTDCBC.TF3',X'00'
PTOT     DC    PL2'0'
MSG      DS    0CL120
         DC    C'REC#='
DTOT     DC    CL4' ',C' TEXT='
RECORD   DC    CL80' '
         DC    (MSG+120-*)C' '
         DCBD
         END
