*********************************************************************
* Copyright 2006 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 07/19/06                                                 *
*********************************************************************
* 11/10/06 RPI 477 ADD ASCII SUPPORT TO CTD AND CFD, USE IN=,OUPT=
*********************************************************************
         PRINT DATA
TESTCTD1 RT1   MAIN
WORK     DC    XL16'00' INT128,E,D,L WORK AREA
DECIMAL  DC    CL45' '  DECIMAL WORK AREA
         EQUREGS
         RT1   START
         WTO   'TEST CFD CONVERT FROM DISPLAY MACRO/SVC 171 SERVICE'
         MACRO
         TEST  &TYPE,&IN,&VER
         MVC   DECIMAL,&IN         
         CFD   &TYPE,OUT=WORK,IN=DECIMAL
         LD    R0,WORK
         LD    R1,WORK+8
         CLC   &VER,WORK
         RT1   CCE
         MEND
         TEST  CFD_INT128,=CL45'2',=FL16'2'
         TEST  CFD_EH,=CL45'2',=EH'2'
         TEST  CFD_EB,=CL45'2',=EB'2'
         TEST  CFD_DH,=CL45'2',=DH'2'
         TEST  CFD_DB,=CL45'2',=DB'2'
         TEST  CFD_LH,=CL45'2',=LH'2'
         TEST  CFD_LB,=CL45'2',=LB'2'
         RT1   END
         END
