      TITLE    'TESTLNK5 TEST ENTRY TEST2 VIA TESTLNK5.LKD ENTRY TEST2'
* AUTHOR. DON HIGGINS.
* DATE.   03/08/12
TEST1 SUBENTRY
      WTO      'TEST1 ENTERED'
      SUBEXIT
TEST2 SUBENTRY
      WTO      'TEST2 ENTERED'
      SUBEXIT
TEST3 BALR 12,0
      USING *,12
      WTO      'TEST3 ENTERED'
      SR  15,15
      BR  14
      END TEST3