*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
         PRINT NOGEN
TESTPRT1 SUBENTRY
         WTO   'TESTPRT1 TEST PUSH/POP PRINT'
         PRINT GEN
         WTO   'TEST PRINT GEN'
         PUSH  PRINT
         PRINT OFF
         WTO   'TEST PRINT OFF'
         PRINT ON,NOGEN
         WTO   'TEST PRINT ON,NOGEN'
         PRINT OFF
         POP   PRINT
         WTO   'TEST BACK TO PRINT GEN AFTER POP'
         WTO   'TESTPRT1 ENDED OK'
         PRINT NOGEN
         SUBEXIT
DC1      DC    16AL1(*-DC1)
         PRINT DATA
DC2      DC    16AL1(*-DC2)
DS1      DS    16AL1(*-DC2)
LC1      LA    1,=16AL1(*-LC1)
LC2      LA    1,=16AL1(*-LC1)
         PRINT NODATA
DC4      DC    16AL1(*-DC2)
         END
