      TITLE    'TESTLNK5 TEST ENTRY TEST2 VIA TESTLNK5.LKD ENTRY TEST2'
**********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* AUTHOR. DON HIGGINS.
* DATE.   03/08/12
TEST1 SUBENTRY
      WTO      'TEST1 ENTERED'
      SUBEXIT
TEST2 SUBENTRY
      WTO      'TEST2 ENTERED'
      SUBEXIT
TEST3 BALR 12,0
      USING *,12
      WTO      'TEST3 ENTERED'
      SR  15,15
      BR  14
      END TEST3