         TITLE 'TESTENV1 - TEST ENVIRONMENT VARIABLE GET/SET'
*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 07/12/07                                                 *
*********************************************************************
* 07/12/07 RPI 413 TEST GETENV AND SETENV                                  
*********************************************************************
TESTENV1 SUBENTRY                              
         WTO   'TESTENV1 START GETENV TEST'
         GETENV PATH
         LR    4,2 SAVE PATH VALUE
         LA    5,256(4)
         SNAP  ID=1,TEXT='PATH VALUE',STORAGE=((4),(5))
         WTO   'TESTENV1 ENDED OK'
         SUBEXIT
PATH     DC    C'PATH',X'00'
         END
