*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 11/10/05 RPI  80  = ADD DUPLICATE AND MISSING MACRO LABEL ERRORS
* 12/08/05 RPI 119 - ADD TEST FOR SUBSCRIPT ON MULT VALUES        
* 01/28/06 RPI 192 - TEST SINGLE QUOTE AND SINGLE &               
* 05/14/06 RPI 314 - TEST COMPOUND AIF AND COMPUTED AGO MISSING LAB
* 03/09/07 RPI 565 - TEST INVALID USE OF &SYSLIST WITHOUT SUBSCRIPT
* 05/07/07 RPI 609 - TEST INVALID STRING CONV IN SETB EXPRESSION
*********************************************************************
         TITLE 'TESTERR1 TEST MZ390 ERRORS'
TESTERR1 CSECT
         USING *,15
* INVALID USE OF ' VS '' QUOTE AND & VS && AMPERSAND
&AMP     SETA  '&&' OK
&AMP     SETA  '&'  BAD
&AMP     SETA  '&X' BAD
&AMP     SETA  '& ' BAD
         MNOTE 'AMP=&&' OK
         LA    1,=C'&&' OK
         DC    C'&&' OK
&SQ      SETC  '''' OK
&SQ      SETC  '''  BAD
* INVALID MULT VALUES BEYOND LIMIT
         LCLA  &LA(2)
&LA(1)   SETA  1,2,3
         LCLB  &LB(2)
&LB(1)   SETB  1,2,3
         LCLC  &LC(2)
&LC(1)   SETC  '1','2','3'
         GBLA  &GA(2)
&GA(1)   SETA  1,2,3
         GBLB  &GB(2)
&GB(1)   SETB  1,2,3
         GBLC  &GC(2)
&GC(1)   SETC  '1','2','3'
* INVALID MACRO EXPRESSIONS
&A1      SETA
&A2      SETA 1+
&A3      SETA 1/0
&B1      SETB
&B2      SETB 1+
&B3      SETB 1/0
&X1      SETC
&X2      SETC 'XXX
&X3      SETC 'X'(1, 
         LCLA A(2)
&A(0)    SETA 1
&A(1)    SETA 1
&A(3)    SETA 1
         LCLB B(2)
&B(0)    SETB 1
&B(1)    SETB 1
&B(3)    SETB 1
         LCLC C(2)
&C(0)    SETC 'C'
&C(1)    SETC 'C'
&C(3)    SETC 'C' 
         GBLA GA(2)
&GA(0)    SETA 1
&GA(1)    SETA 1
&GA(3)    SETA 1
         GBLB GB(2)
&GB(0)    SETB 1
&GB(1)    SETB 1
&GB(3)    SETB 1
         GBLC GC(2)
&GC(0)    SETC 'C'
&GC(1)    SETC 'C'
&GC(3)    SETC 'C' 
* INVALID SYSLIST SUBSCRIPT
         MACRO
         TEST1 
         MNOTE 'P1=&SYSLIST(-1)'       ERROR
         MNOTE 'P1(1)=&SYSLIST(1)'     OK
         MNOTE 'P1(1,2)=&SYSLIST(1,2)' OK
         MNOTE 'P1(1,2)=&SYSLIST(1,0)' ERROR
         MEND
         TEST1 (A,
         MACRO
&N       TEST2 &P1,&K1=
&N       SETA  1
&P1      SETB  1
&K1      SETC  'X'
         MNOTE 'N=&N P1=&P1 K1=&K1'
         MEND
A        TEST2 B,K1=C
* VALID COPY STATEMENT ON NEXT LINE IN TESTERR1.MLC
         COPY  TESTERR1
* TEST INVALID USE OF &SYSLIST
&SLZ     SETC  &SYSLIST             ERR
         MACRO 
         TEST  &A,&B,&C             
&SLX     SETA  &SYSLIST             ERR ASM AND MAC
&SLY     SETB  &SYSLIST             ERR ASM AND MAC
&SLZ     SETC  &SYSLIST             ERR ASM AND MAC
         MNOTE 'SYSLIST=&SYSLIST'   ERR ASM AND MAC
         MNOTE 'UNDEF=&UNDEF'       ERR IF MAC ELSE OK
         MEND
         TEST  A,B,C
* ADD COMPOND AIF AND COMPUTED AGO MISSING LABELS
&I       SETA  2
         AIF   (1 EQ 2).T11,(2 EQ 2).X11
         AGO   (&I).T11,.X12,.T13
.T11     MNOTE '.T11'
.T12     MNOTE '.T12'
.T13     MNOTE '.T13'
* ADD INVALID  SETB STRING CONV
&SETB    SETB   '0'
* ADD DUPLICATE AND MISSING MACRO ERRORS IN MACRO CODE
         MACRO
         TESTLAB
.LAB1    ANOP
.LAB2    ANOP
.LAB1    ANOP
         AGO    .UNDEFINED1
         AIF    (1 EQ 1).UNDEFINED2
         MEND
**********************************************************
* ADD DUPLICATE AND MISSING MACRO ERRORS IN OPEN CODE
*
* THIS MUST BE LAST TEST WITH FAILING AGO IN OPEN CODE
*
**********************************************************
.LAB1    ANOP
.LAB2    ANOP
.LAB1    ANOP
         AGO    .UNDEFINED1
         AIF    (1 EQ 1).UNDEFINED2
         END 
