*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 08/18/08 RPI 901 - MOVE TEST OF OPEN CODE UNDEF AGO TESTS TO ERR8/9
*********************************************************************
* ADD COMPOND AIF AND COMPUTED AGO MISSING LABELS
         AIF   (1 EQ 2).T11,(2 EQ 2).X11 ABORT ON X117
.T11     MNOTE '.T11'
.T12     MNOTE '.T12'
.T13     MNOTE '.T13'
         END
