********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 11/08/05 RPI  74 TEST RELATIVE OFFSET ERRORS
* 11/08/05 RPI  85 TEST MIN/MAX DC F AND H LIMIT ERRORS11
* 01/06/06 RPI 157 AND 159 OPERAND ERROR CHECKING
* 03/16/06 RPI 238 MNOTE error if level > 4       
* 03/21/06 RPI 253 ISSUE ERROR FOR INVALID LABELS SUCH AS _^A
* 03/22/06 RPI 260 test expression parsing errors
* 07/06/06 RPI 356 test error for instruction CVD with no args.
* 07/19/06 RPI 375 test error when labelled using prefix on sdt etc.
* 11/09/06 RPI 488 test error on branch label defined only as macro 
* 11/10/06 RPI 473 test error messages from CALL macro               
*********************************************************************
         TITLE 'TESTERR2 - TEST AZ390 ERRORS'
TESTERR2 CSECT
         USING *,15
* BLANK, LABEL ONLY, INVALID CHAR FOR LABEL, OPER

LABEL
;
;       ;
* UNDEFINED OPCODE FOR AZ390
        JUNK
* INVALID PARMS
        WTO  'HELLO
        WTO  HELLO'
        WTO  MF=(E,X
* TEST ERROR ON INVALID RELATIVE ADDRESSES
        BRL  TESTERR2+1
        BRCL 15,TESTERR2+1
        LARL 15,TESTERR2+1
TOOFAR  EQU  TESTERR2+X'100000'
        BRL  TOOFAR
* TEST MIN MAX FOR DC F AND H 
         DC    H'32767'         OK
         DC    H'32768'         BAD
         DC    H'-32768'        OK
         DC    H'-32769'        BAD
         DC    FL1'127'         OK
         DC    FL1'128'         BAD
         DC    FL1'-128'        OK
         DC    FL1'-129'        BAD
         DC    FL2'32767'     OK
         DC    FL2'32768'     BAD
         DC    FL2'-32768'    OK
         DC    FL2'-32769'    BAD
         DC    FL3'8388607'   OK
         DC    FL3'8388608'   BAD
         DC    FL3'-8388608'  OK
         DC    FL3'-8388609'  BAD
* CHECK TOO MANY PARMS
         OI    Y,3(1)
         LR    1,2,3
         L     1,2,3
         MVC   Y,2,3
         AP    Y,=P'1',3
* CHECK LITERAL IN EXPRESSION
         OI    Y,=X'FF'
Y        DC    X'00'
* TEST MNOTE ERROR LEVELS
         MNOTE 4,'TEST MNOTE 1'
         MNOTE 8,'TEST MNOTE 2'
* TEST INVALID LABEL
_A       DS    0H OK
_^A      DS    0H NOT OK
* TEST EXPRESSION PARSING ERRORS
EXP1     EQU   1+
EXP2     EQU   1//
* TEST INSTRUCTION WITH NO ARGS CAUSING TRAP
         CVD
* TEST LABELLED USING PREFIX ON SDT CAUSED BY TYPEING . VS ,
R1       EQU   1
R2       EQU   2
         LR    R1.R2
* TEST LABEL ONLY DEFINED AS MACRO LABEL
         B     MYMAC
         MACRO
         TEST
         MEND
MYMAC    TEST
* TEST CALL MACRO MNOTE ERRORS
EXEC2    CALL  SUBR,,VL,MF=(E,LIST)
EXEC3    CALL  SUBR,,,MF=E
STD      CALL  SUBR,,VL,MF=S
LIST     CALL  ,(0,0),MF=L
         END 
