*********************************************************************
* TEST FOR RECFM=FT AND VT CREATE AND READ CONTRIBUTED BY MM
*********************************************************************
* 11/18/05 RPI 101 CORRECT OPEN BUG CAUSING EOF ERROR ON GET
* 11/19/05 COPY OF TESTDCBD RUN IN ASCII MODE TO VERIFY NO TRANSLATE
*          AND ALSO SHOW ASCII VS EBCDIC CHARACTERS IN SNAP DUMP
* 09/11/06 RPI 363 CHANGE TEST TO RT\TEST DIRECTORY                    
* 02/07/07 RPI 532 CORRECT PATH CASE FOR LINUX                         
*********************************************************************
TESTDCBE SUBENTRY
         OPEN (PUTFT,OUTPUT,PUTVT,OUTPUT)
         PUT  PUTFT
         PUT  PUTVT
         CLOSE (PUTFT,,PUTVT)
         OPEN (GETFT,INPUT,GETVT,INPUT)
         GET  GETFT
         GET  GETVT
         CLOSE (GETFT,,GETVT)
         SNAP STORAGE=(RECORD1,ENDIT),ID=1
         SUBEXIT
PUTFT    DCB   RECFM=FT,LRECL=80,MACRF=PM,RECORD=RECORD1,DSNAME=DSN1
PUTVT    DCB   RECFM=VT,LRECL=10,MACRF=PM,RECORD=RECORD2,DSNAME=DSN2
GETFT    DCB   RECFM=FT,LRECL=80,MACRF=GM,RECORD=RECORD3,DSNAME=DSN1
GETVT    DCB   RECFM=VT,LRECL=10,MACRF=GM,RECORD=RECORD4,DSNAME=DSN2

DSN1     DC    C'rt\test\TESTDCBE.TF2',X'00'               
DSN2     DC    C'rt\test\TESTDCBE.TF3',X'00'                
RECORD1  DC    X'C1C2C3414243',CL74' '
RECORD2  DC    H'10',H'0'
         DC    X'C1C2C3414243'
RECORD3  DC    CL80' '
RECORD4  DC    CL10' '
ENDIT    EQU   *
         DCBD
         EQUREGS
         END
