.*********************************************************************
.* z390 - Mainframe assembler emulator and run-time engine
.* Copyright (C) 2021 z390 Assembler LLC
.*
.* This file is part of z390.
.*
.* z390 is free software; you can redistribute it and/or modify
.* it under the terms of the GNU General Public License as published by
.* the Free Software Foundation; either version 2 of the License, or
.* (at your option) any later version.
.* z390 is distributed in the hope that it will be useful,
.* but WITHOUT ANY WARRANTY; without even the implied warranty of
.* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
.* GNU General Public License for more details.
.*
.* You should have received a copy of the GNU General Public License 
.* along with this program; if not, see https://www.gnu.org/licenses.
.* Author - Don Higgins                                              *
.* Date   - 09/30/05                                                 *
.*********************************************************************
.* 03/28/06 RPI 266 CREATE TESTMAC8.MLC AND TESTMAC8.MAC TEST INLINES
.* 04/09/06 RPI 274 TEST .EXIT ON NESTED MEND                           
.*********************************************************************
         MACRO
&L       TESTMAC8 &P,&K=
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 3).LOOP
         MNOTE 'TESTMAC8 L=&L P=&P K=&K A=&A'
         MACRO
&L       ILM4  &P,&K=
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 3).LOOP
         MNOTE 'ILM4 L=&L P=&P K=&K A=&A'
         MACRO
&L       ILM5  &P,&K=
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 3).LOOP
         MNOTE 'ILM5 L=&L P=&P K=&K A=&A'
         MNOTE 'TEST .EXIT FOR TESTMAC8 ILM5'
         AGO   .EXIT
.EXIT    MEND
L5       ILM5  P5,K=K5             
         MNOTE 'TEST .EXIT FOR TESTMAC8 ILM4'
         AGO   .EXIT
.EXIT    MEND
L4       ILM4  P4,K=K4
         MNOTE 'TEST .EXIT FOR TESTMAC8 MACRO'
         AGO   .EXIT
.EXIT    MEND
