*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* TEST FOR RECFM=FT AND VT CREATE AND READ CONTRIBUTED BY MM
*********************************************************************
* 11/18/05 RPI 101 CORRECT OPEN BUG CAUSING EOF ERROR ON GET
* 11/19/05 COPY OF TESTDCBD RUN IN ASCII MODE TO VERIFY NO TRANSLATE
*          AND ALSO SHOW ASCII VS EBCDIC CHARACTERS IN SNAP DUMP
* 09/11/06 RPI 363 CHANGE TEST TO RT\TEST DIRECTORY                    
* 02/07/07 RPI 532 CORRECT PATH CASE FOR LINUX                         
* 09/28/26 -- AFK Remove T from RECFM to select notranslate mode
*********************************************************************
TESTDCBE SUBENTRY
         OPEN (PUTF,OUTPUT,PUTV,OUTPUT)
         PUT  PUTF
         PUT  PUTV
         CLOSE (PUTF,,PUTV)
         OPEN (GETF,INPUT,GETV,INPUT)
         GET  GETF
         GET  GETV
         CLOSE (GETF,,GETV)
         SNAP STORAGE=(RECORD1,ENDIT),ID=1
         SUBEXIT
PUTF     DCB   RECFM=F,LRECL=80,MACRF=PM,RECORD=RECORD1,DSNAME=DSN1
PUTV     DCB   RECFM=V,LRECL=40,MACRF=PM,RECORD=RECORD2,DSNAME=DSN2
GETF     DCB   RECFM=F,LRECL=80,MACRF=GM,RECORD=RECORD3,DSNAME=DSN1
GETV     DCB   RECFM=V,LRECL=40,MACRF=GM,RECORD=RECORD4,DSNAME=DSN2

DSN1     DC    C'rt/test/TESTDCBE.OUT',X'00'
DSN2     DC    C'rt/test/TESTDCBE.RPT',X'00'
         DC    D'0'                    * Align
RECORD1  DC    X'C1C2C3414243',CL74' ' * 80 bytes of data
RECORD2  DC    H'32',H'0'              * RDW
         DC    X'C1C2C3414243'         * 6 bytes of data
         DC    C'    5    0    5    0  ' 22 characters extra data
         DC    X'FFFF'                 * Filler for alignment
RECORD3  DC    CL80' '
RECORD4  DC    CL10' '
ENDIT    EQU   *
         DCBD
         EQUREGS
         END
