*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 11/09/07 RPI 732 TEST USING TESTLNK2.LNK TO BUILD TESTLNK2.390        
*          INCLUDING TESTLNK3, ENTRY TESTLNK3, AND ALIAS TESTLNK3             
* 08/10/08 RPI 893 CORRECT AL2(WTOEND,0) TO AL2(WTOEND-*,0)        
*********************************************************************
         TITLE 'TESTLNK2 TEST USE OF TESTLNK2.LNK TO BUILD TESTLNK2'
TESTLNK2 CSECT
         ENTRY WTOLNK2
WTOLNK2  DC   AL2(WTOEND-*),C'HELLO FROM TESTLNK3 ENTRY'
WTOEND   EQU  *
         END
