*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 11/08/05                                                 *
*********************************************************************
* 11/15/05 RPI  92 TEST NON-ZERO MEMORY ADDRESSES
* 09/11/06 RPI 363 CHANGE TEST TO RT\TEST DIRECTORY 
* 02/07/07 RPI 532 CHANGE PATH CASE FOR LINUX       
* 04/26/07 RPI 600 CORRECT DUPLICATE ID= ON SNAP    
* 07/05/07 RPI 642 TEST TEXT=(REG) WITH NULL TERM SUPPORT
*********************************************************************
TESTDMP1 SUBENTRY
         WTO   'TESTDMP4 TEST SNAP DUMP OPTIONS'
         SNAP  ID=1,TEXT='DEFAULT ALL CONTROL BLOCKS TO LOG'
         OPEN  (SYSUT1)
         SNAP  ID=2,PDATA=(GPR,DCB),TEXT='GPR REGS AND FILES'
         SNAP  ID=3,PDATA=FPR,TEXT='FPR REGS'
         SNAP  ID=4,STORAGE=(DATA1,DATA2),TEXT='LOW MEMORY'
         LA    2,TEXT
         SNAP  ID=5,TEXT=(2)
         SUBEXIT
TEXT     DC    C'TEST TEXT=(2)',X'00' RPI 642
SYSUT1   DCB   RECFM=FT,BLKSIZE=80,MACRF=GM,                           X
               DSNAME=DSN1
DSN1     DC    C'rt\test\TESTDMP4.TF1',X'00'
DATA1    DC    C'MEMORY DUMP AREA'
DATA2    EQU   *
         DCBD
         END
