*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 04/30/06                                                 *
*********************************************************************
* 04/30/06 RPI306 TEST OPSYN FOR MACRO VS OPCODE                       
* 07/03/06 RPI352 TEST OPSYN REDEFINE OF MAC OP
* 08/07/06 RPI403 TEST OPCODE USED BEFORE FIRST AND AFTER LAST RESTORE
*********************************************************************
TESTSYN2 SUBENTRY 
         WTO   'TESTSYN2 STARTED'
         B     SKIPDC
         DC    C'DC BEFORE FIRST OPSYN'
SKIPDC   DS    0H
         PUSH  PRINT
_PUSH    OPSYN PUSH
PUSH     OPSYN TESTSYN2
         PUSH  123
TESTSYNX OPSYN TESTSYN2
         TESTSYNX ABC
         WTO   'TESTSYN2 ENDED'
         SUBEXIT
* TEST DC AFTER
DCX      OPSYN DC
DC       OPSYN MNOTE
         DC    'DC MNOTE'
DC       OPSYN DCX
         DC    C'DC AFTER OPSYN RESTORE'
         END                        
