*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 03/28/06 RPI 266 CREATE TESTMAC8.MLC AND TESTMAC8.MAC TEST INLINES
* 04/09/06 RPI 274 TEST .EXIT ON NESTED MENDS/END                    
*********************************************************************
TESTMAC8 SUBENTRY
         WTO   'TESTMAC8 - TEST INLINE MACROS WITHIN MACROS'
         MACRO
&L       ILM1  &P,&K=
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 3).LOOP
         MNOTE 'ILM1 L=&L P=&P K=&K A=&A'
         MACRO
&L       ILM2  &P,&K=
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 3).LOOP
         MNOTE 'ILM2 L=&L P=&P K=&K A=&A'
         MNOTE 'TEST .EXIT FOR ILM2'
         AGO   .EXIT
.EXIT    MEND
L2       ILM2  P2,K=K2             
         MNOTE 'TEST .EXIT FOR ILM1'
         AGO   .EXIT
.EXIT    MEND
L1       ILM1  P1,K=K1
L3       TESTMAC8 P3,K=K3 TEST EXTERNAL MACRO WITH INLINE MACROS
         WTO   'TESTMAC8 ENDED OK'
         SUBEXIT
         MNOTE 'TEST .EXIT FOR MLC ON END'
.EXIT    END
