*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 02/21/07 RPI 553 CORRECT SOURCE ERROR FOR DS1 DUP. CSECT/DSECT
*********************************************************************
TESTDST1 SUBENTRY
         WTO   'TESTDST1 TEST CSECT AND DSECT SUPPORT'
         L     2,=A(CS1)                RPI 553 WAS LA IN ERROR
         USING CS1,2
         USING DS1,2
         L     3,=A(CS2)                RPI 553 WAS LA IN ERROR
         USING CS2,3
         CLC   DS1F2,DS1F2-DS1+CS2
         BNE   1
         CLC   =A(LDST2),=A(32)
         BNE   1
         WTO   'TESTDST1 ENDED OK'
         SUBEXIT
DS1      DSECT
DS1F1    DS   XL3
CS1      CSECT
CS1F1    DC   C'ABC'
CS1F2    DC   C'DEF'
CS2      CSECT
CS2F1    DS   XL3
CS1      CSECT
CS1F3    DC   C'GHI'
CS2      CSECT
CS2F2    DC   C'DEF'
DS1      DSECT             RPI 553 FIX (WAS CSECT IN ERROR)
DS1F2    DS   CL3
DS1F3    DS   CL3     
DST2     DSECT
         DS    X
         DS    ((*-DST2+31)/32*32-(*-DST2))X
LDST2    EQU   *-DST2   
         END
