*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
         MACRO
         TESTGM &TYPE,&LV,&LOC,&HL,&REG
         GETMAIN &TYPE,LV=&LV,LOC=&LOC
         CL    R0,=A(LINE)
         RT1   CC&HL
         LR    &REG,R0
         LR    R14,R0
         LA    R15,GMLEN
         L     R1,=X'EE000000'
         MVCL  R14,R0
         MEND
         TITLE 'TESTMEM1 REGRSSION TEST GETMAIN AND FREEMAIN'
TESTMEM1 RT1   MAIN
         EQUREGS
FQE24A   DC    A(0)
FQE24    DC    AL8(0)
FQE31A   DC    A(0)
FQE31    DC    AL8(0)
LINE     EQU   X'1000000'
GMLEN    EQU   100
         RT1   START
         L     R2,=A(ZCVT)
         USING IHAZCVT,R2
         L     R3,ZCVTFQ24
         ST    R3,FQE24A    SAVE 24 BIT FQE ADDR
         MVC   FQE24,0(R3)  SAVE 24 BIT FQE
         L     R3,ZCVTFQ31
         ST    R3,FQE31A    SAVE 31 BIT FQE ADDR
         MVC   FQE31,0(R3)  SAVE 31 BIT FQE
         DROP  R2
         L     R2,=A(GMLEN)
         TESTGM R,GMLEN,,L,R3
         TESTGM R,GMLEN,,L,R4
         TESTGM R,GMLEN,,L,R5
         TESTGM RC,(R2),BELOW,L,R6
         TESTGM RC,(R2),,H,R7
         TESTGM RC,(R2),,H,R8
         TESTGM RU,(R2),ABOVE,H,R9
         FREEMAIN A=(R9),LV=(R2)
         FREEMAIN A=(R3),LV=(R2)
         FREEMAIN A=(R5),LV=(R2)
         FREEMAIN A=(R4),LV=(R2)
         FREEMAIN A=(R7),LV=(R2)
         FREEMAIN A=(R6),LV=(R2)
         FREEMAIN A=(R8),LV=(R2)
         L     R2,=A(ZCVT)
         USING IHAZCVT,R2
         L     R3,ZCVTFQ24
         CL    R3,FQE24A    VER  24 BIT FQE ADDR
         RT1   CCE
         CLC   FQE24(4),0(R3)  VER  24 BIT FQE PTR
         RT1   CCE
         CLC   FQE24+4(4),4(R3)  VER  24 BIT FQE LEN
         RT1   CCE
         L     R3,ZCVTFQ31
         CL    R3,FQE31A    VER  31 BIT FQE ADDR
         RT1   CCE
         CLC   FQE31(4),0(R3)  VER  31 BIT FQE PTR
         RT1   CCE
         CLC   FQE31+4(4),4(R3)  VER  31 BIT FQE LEN
         RT1   CCE
         WTO   'TESTMEM1 ENDED OK'
         RT1   END
         ZCVTD
         END
