*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
*********************************************************************
* 05/01/06 RPI305 TEST ESPIE EXIT WITH PARM AND RESTART                
* 06/20/08 RPI 845 CHANGE EPIED TO IHAEPIE                          
*********************************************************************
         TITLE 'TESTSPI1 - TEST ESPIE'
TESTSPI1 SUBENTRY
         WTO   'TESTSPI1 TEST ESPIE STARTED'
         ESPIE SET,EXIT,1,PARAM=RESTART
         DC    X'0000' CAUSE 0C1
RESTART  WTO   'TESTSPI1 RESTART SUCCESSFUL'
         WTO   'TESTSPI1 ENDED OK'
         SUBEXIT
         DROP
EXIT     DS    0H
         USING *,15
         USING EPIE,1
         L     0,EPIEPARM
         ST    0,EPIEPSW+4
         BR    14
         IHAEPIE
         END         
