TEST1    SUBENTRY
         SNAP  PDATA=PSW,ID=1,TEXT='TEST STD FORM'
         SNAP  MF=(E,LIST2)
         LA    3,LIST2
         SNAP  MF=(E,(3))
         SNAP  MF=(E,LIST2),PDATA=PSW,ID=3,TEXT='TEST LIST2 OVERRIDES',X
               STORAGE=(LIST2,LIST4)
         SNAP  MF=(E,LIST4)
         SUBEXIT
LIST2    SNAP  MF=L,PDATA=(PSW,REGS),ID=2,TEXT='LIST2'
LIST4    SNAP  MF=L,PDATA=ALL,ID=4,STORAGE=(LIST2,LIST4),TEXT='LIST4'
         END  
