*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 02/24/06 RPI214 * OP IN SUBSTRING EXP, NO CONCAT AFTER SUBSTRING
* 04/22/08 RPI 833 ADD STRING QUOTES FOR HLASM COMPATIBILITY 
*********************************************************************
TESTMAC5 SUBENTRY 
         WTO   'TESTMAC5 TEST RPI 214 * LAST OP, AND NO CONCAT .'
&T1      SETC  'ABC'(1+2*1,1)
         AIF   ('&T1' NE 'C').ERR
&T2      SETC  'ABC'(2,1)'DEF'
         AIF   ('&T2' NE 'BDEF').ERR
         WTO   'TESTMAC5 ENDED OK'
         SUBEXIT   
         AGO   .EXIT
.ERR     MNOTE 12,'T1/T2 ERROR'
.EXIT    END                        
