*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 08/03/06                                                 *
*********************************************************************
* 06/20/08 RPI 845 CHANGE EPIED TO IHAEPIE                          
*********************************************************************
         MACRO
         TEST &P
         LA   R0,1
         ZAP  PWORK,=P'0'
         CVB  R0,&P
         CVD  R0,PWORK
         CP   PWORK,&P
         RT1  CCE
         ZAP  PWORK,=P'0'
         CVBY R0,&P
         CVDY R0,PWORK
         CP   PWORK,&P
         RT1  CCE
         MEND
TESTCVB1 RT1  MAIN
PWORK    DC   PL8'0'
         EQUREGS 
         RT1  START   
         TEST =PL8'0'                       
         TEST =PL8'1'                       
         TEST =PL8'12'                       
         TEST =PL8'123'                       
         TEST =PL8'1234'                      
         TEST =PL8'12345'                     
         TEST =PL8'123456'                    
         TEST =PL8'1234567'                   
         TEST =PL8'12345678'                  
         TEST =PL8'123456789'                 
         TEST =PL8'500000000'                       
         TEST =PL8'1234567890'                
         TEST =PL8'1000000000'       
         TEST =PL8'2000000000'         
         TEST =PL8'2147483647'  
         TEST =PL8'-0'                       
         TEST =PL8'-1'                       
         TEST =PL8'-12'                       
         TEST =PL8'-123'                       
         TEST =PL8'-1234'                      
         TEST =PL8'-12345'                     
         TEST =PL8'-123456'                    
         TEST =PL8'-1234567'                   
         TEST =PL8'-12345678'                  
         TEST =PL8'-123456789'                 
         TEST =PL8'-500000000'                       
         TEST =PL8'-1234567890'                
         TEST =PL8'-1000000000'       
         TEST =PL8'-2000000000'         
         TEST =PL8'-2147483647'  
         TEST =PL8'-2147483648'  
         ESPIE SET,ESPIE_EXIT,9,PARAM=SPI1
         TEST =PL8'2147483648' 
         ABEND 101
SPI1     ESPIE RESET
         BASR  R11,0
         USING *,R11
         ESPIE SET,ESPIE_EXIT,9,PARAM=SPI2
         TEST =PL8'-2147483649' 
         ABEND 102
SPI2     ESPIE RESET
         BASR  R11,0
         USING *,R11
         ESPIE SET,ESPIE_EXIT,9,PARAM=SPI3
         TEST =PL8'123456789012345' 
         ABEND 103
SPI3     ESPIE RESET
         BASR  R11,0
         USING *,R11
         ESPIE SET,ESPIE_EXIT,9,PARAM=SPI4
         TEST =PL8'-123456789012345' 
         ABEND 104
SPI4     ESPIE RESET
         BASR  R11,0
         USING *,R11
         RT1  END  
ESPIE_EXIT DS  0H
         USING *,R15
         USING EPIE,R1
         L     R0,EPIEPARM
         ST    R0,EPIEPSW+4
         BR    R14
         DROP  R15,R1
         IHAEPIE
         END
