         TITLE 'TESTCIC1 - TEST CICS DFHRESP LITERALS'
*********************************************************************
* Copyright 2007 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 05/31/07                                                 *
*********************************************************************
* 05/31/07 RPI 501 TEST LITERAL-ABS EXPRESSION                             
* 07/20/07 RPI 662 TEST ADDITIONAL ITEMERR AND QIDERR FOR DFHRESP          
* 08/25/07 RPI 687 TEST ADDITIONAL CICS VSAM DFHRESP CODES    
* 08/25/07 RPI 690 CORRECT NOTEND TO NOTFND                   
* 10/30/07 RPI 729 ADD DFHRESP ILLOGIC=F'21'                  
* 12/06/07 RPI 751 ADD DFHRESP EXPIRED=F'31'                  
* 04/28/08 RPI 841 ADD DFHRESP MAPFAIL,INVMPSZ,OVERFLOW       
*********************************************************************
TESTCIC1 RT1   MAIN
         EQUREGS
X        DS    F
         RT1   START
         MVC   X,DFHRESP(NORMAL)      
         MVC   X,DFHRESP(NORMAL)     X   TEST COMMENTS
         MVC   X,DFHRESP(ERROR)      
         MVC   X,DFHRESP(FILENOTFOUND)  RPI 687
         MVC   X,DFHRESP(NOTFND)        RPI 687 RPI 690
         MVC   X,DFHRESP(DUPREC)        RPI 687
         MVC   X,DFHRESP(DUPKEY)        RPI 687
         MVC   X,DFHRESP(INVREQ)      
         MVC   X,DFHRESP(NOSPACE)       RPI 687
         MVC   X,DFHRESP(NOTOPEN)       RPI 687
         MVC   X,DFHRESP(ENDFILE)       RPI 687
         MVC   X,DFHRESP(LENGERR)      
         MVC   X,DFHRESP(PGMIDERR)      
         MVC   X,DFHRESP(ITEMERR)       RPI 662
         MVC   X,DFHRESP(QIDERR)        RPI 662
         MVC   X,DFHRESP(EXPIRED)       RPI 751
         MVC   X,DFHRESP(MAPFAIL)       RPI 841
         MVC   X,DFHRESP(INVMPSZ)       RPI 841
         MVC   X,DFHRESP(OVERFLOW)       RPI 841
         MVC   X,DFHRESP(DISABLED)      RPI 687
         MVC   X,DFHRESP(ILLOGIC)       RPI 729
         CLC   =F'0',DFHRESP(NORMAL)      
         RT1   CCE
         CLC   =F'1',DFHRESP(ERROR)       
         RT1   CCE
         CLC   =F'12',DFHRESP(FILENOTFOUND) RPI 687      
         RT1   CCE
         CLC   =F'13',DFHRESP(NOTFND)       RPI 687 RPI 690
         RT1   CCE
         CLC   =F'14',DFHRESP(DUPREC)       RPI 687
         RT1   CCE
         CLC   =F'15',DFHRESP(DUPKEY)       RPI 687      
         RT1   CCE
         CLC   =F'16',DFHRESP(INVREQ)    
         RT1   CCE
         CLC   =F'18',DFHRESP(NOSPACE)      RPI 687      
         RT1   CCE
         CLC   =F'19',DFHRESP(NOTOPEN)      RPI 687      
         RT1   CCE
         CLC   =F'20',DFHRESP(ENDFILE)      RPI 687      
         RT1   CCE
         CLC   =F'21',DFHRESP(ILLOGIC)      RPI 729      
         RT1   CCE
         CLC   =F'22',DFHRESP(LENGERR)   
         RT1   CCE
         CLC   =F'26',DFHRESP(ITEMERR)   RPI 662
         RT1   CCE
         CLC   =F'27',DFHRESP(PGMIDERR)  
         RT1   CCE
         CLC   =F'31',DFHRESP(EXPIRED)   RPI 751
         RT1   CCE
         CLC   =F'36',DFHRESP(MAPFAIL)   RPI 841
         RT1   CCE
         CLC   =F'38',DFHRESP(INVMPSZ)   RPI 841
         RT1   CCE
         CLC   =F'40',DFHRESP(OVERFLOW)   RPI 841
         RT1   CCE
         CLC   =F'44',DFHRESP(QIDERR)    RPI 662
         RT1   CCE
         CLC   =F'84',DFHRESP(DISABLED)     RPI 687      
         RT1   CCE
         RT1   CCE,=F'0',DFHRESP(NORMAL) 
         RT1   CCE,=F'1',DFHRESP(ERROR)
         RT1   CCE,=F'12',DFHRESP(FILENOTFOUND) RPI 687
         RT1   CCE,=F'13',DFHRESP(NOTFND)       RPI 687 RPI 690
         RT1   CCE,=F'14',DFHRESP(DUPREC)       RPI 687
         RT1   CCE,=F'15',DFHRESP(DUPKEY)       RPI 687
         RT1   CCE,=F'16',DFHRESP(INVREQ)
         RT1   CCE,=F'18',DFHRESP(NOSPACE)      RPI 687
         RT1   CCE,=F'19',DFHRESP(NOTOPEN)      RPI 687
         RT1   CCE,=F'20',DFHRESP(ENDFILE)      RPI 687
         RT1   CCE,=F'21',DFHRESP(ILLOGIC)      RPI 729
         RT1   CCE,=F'22',DFHRESP(LENGERR)
         RT1   CCE,=F'26',DFHRESP(ITEMERR)      RPI 662
         RT1   CCE,=F'27',DFHRESP(PGMIDERR)
         RT1   CCE,=F'31',DFHRESP(EXPIRED)      RPI 751
         RT1   CCE,=F'36',DFHRESP(MAPFAIL)      RPI 841
         RT1   CCE,=F'38',DFHRESP(INVMPSZ)      RPI 841
         RT1   CCE,=F'40',DFHRESP(OVERFLOW)     RPI 841
         RT1   CCE,=F'44',DFHRESP(QIDERR)       RPI 662
         RT1   CCE,=F'84',DFHRESP(DISABLED)     RPI 687
         RT1   END
         END         
