         MACRO
.*********************************************************************
.* z390 - Mainframe assembler emulator and run-time engine
.* Copyright (C) 2021 z390 Assembler LLC
.*
.* This file is part of z390.
.*
.* z390 is free software; you can redistribute it and/or modify
.* it under the terms of the GNU General Public License as published by
.* the Free Software Foundation; either version 2 of the License, or
.* (at your option) any later version.
.* z390 is distributed in the hope that it will be useful,
.* but WITHOUT ANY WARRANTY; without even the implied warranty of
.* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
.* GNU General Public License for more details.
.*
.* You should have received a copy of the GNU General Public License 
.* along with this program; if not, see https://www.gnu.org/licenses.
.*********************************************************************
.* Author - Don Higgins                                              *
.* Date   - 09/30/05                                                 *
.*********************************************************************
&POS0    TESTPRM1 &POS1,&KEY1=DEFKEY1,&POS2,&POS3,&POS4,&KEY2=DEFKEY2,&X
               KEY3=DEFKEY3,&KEY4=DEFKEY4
         MNOTE ' POS0 = &POS0'
         MNOTE ' POS1 = &POS1'
         MNOTE ' POS2 = &POS2'
         MNOTE ' POS3 = &POS3'
         MNOTE ' POS4 = &POS4'
         MNOTE ' KEY1 = &KEY1'
         MNOTE ' KEY2 = &KEY2'
         MNOTE ' KEY3 = &KEY3'
         MNOTE ' KEY4 = &KEY4'
         MEND
