*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
TESTDCB8 SUBENTRY
         WTO   'TESTDCB8 READ SYSUT1 AND WRITE SYSUT2'
         OPEN  (SYSUT1,(INPUT),SYSUT2,(OUTPUT),SYSOUT,(OUTPUT))
LOOP     EQU   *
         READ  DECB1,SF,SYSUT1,RECORD
         CHECK DECB1
         AP    PTOT,=P'1'
         MVC   DTOT,=X'40202020'
         ED    DTOT,PTOT
         PUT   SYSOUT,MSG
         WRITE DECB2,SF,SYSUT2,RECORD
         CHECK DECB2
         B     LOOP
EOF      CLOSE (SYSUT1,,SYSUT2,,SYSOUT)
         WTO   'TESTDCB8 ENDED OK'
         SUBEXIT
SYSUT1   DCB   DSORG=PS,DDNAME=SYSUT1,EODAD=EOF,MACRF=R,               X
               RECFM=F,BLKSIZE=80            
SYSUT2   DCB   DSORG=PS,DDNAME=SYSUT2,MACRF=W,RECFM=F,BLKSIZE=80
SYSOUT   DCB   DSORG=PS,DDNAME=SYSOUT,RECFM=FT,BLKSIZE=120,MACRF=PM
PTOT     DC    PL2'0'
MSG      DS    0CL120
         DC    C'REC#='
DTOT     DC    CL4' ',C' TEXT='
RECORD   DC    CL80' '
         DC    (MSG+120-*)C' '
         DCBD
         DECBD
         EQUREGS
         END
