*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
*********************************************************************
* 04/21/06 RPI 288 - test ENTRY defined as both CSECT and label
*********************************************************************
TESTENT1 SUBENTRY
         WTO 'TESTENT1 STARTED'
         CALL ENTRY2
         WTO  'TESTENT1 ENDED OK'
         SUBEXIT
ENTRY2   CSECT
         ENTRY ENTRY2
ENTRY2   DS    0H         
         BR    14
         END
