         MACRO
         TESTPROS
.*********************************************************************
.* Copyright 2006 Automated Software Tools Corporation               *
.* This source code is part of z390 assembler/emulator package       *
.* The z390 package is distributed under GNU general public license  *
.* Author - Don Higgins                                              *
.*********************************************************************
.* 04/09/06 RPI 276 MZ390 STARTUP TEST MACRO - SEE TESTPRO1.CPY              
.*********************************************************************
         MNOTE 'MZ390 TESTPROS MACRO STARTED &SYSDATE &SYSTIME &SYSJOB'
         MEND
