*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 11/09/01 RP 732 TEST USING TESTLNK2.LNK TO BUILD TESTLNK2.390        
*          INCLUDING TESTLNK3, ENTRY TESTLNK3, AND ALIAS TESTLNK3             
*********************************************************************
         TITLE 'TESTLNK2 TEST USE OF TESTLNK2.LNK TO BUILD TESTLNK2'
TESTLNK2 CSECT
         ENTRY WTOLNK2
WTOLNK2  DC   AL2(WTOEND,0),C'HELLO FROM TESTLNK3 ENTRY'
WTOEND   EQU  *
         END
