*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 11/16/05 RPI95 TEST XCTL
* 04/26/07 RPI 598  ADD ADDITIONAL CDE SNAPS TO VERIFY OK
*********************************************************************
         TITLE 'TESTXCL3 TEST TESTXCL2 XCTL TO TESTXCL3'
TESTXCL3 SUBENTRY
         WTO   'TESTXCL3 ENTERED'
         SNAP  ID=31,PDATA=CDE,TEXT='TESTXCL3 VERIFY TESTXCL1+3 CDES'
         GETMAIN R,LV=256
         XC    0(256,1),0(1) CLEAR IT
         LA    2,256(1)
         SNAP  ID=32,PDATA=CDE,STORAGE=((1),(2)),TEXT='TESTXCL3 AREA'
*        WTO   'TESTXCL3 NOW RETURNING TO TESTXCL1'
         WTO   'TESTXCL3 NOW XCTL TO TESTXCL4'
         BALR  12,0         ESTABLISH TEMP BASE FOR XCTL USE
         USING *,12
         L     13,4(13)            RESTORE TESTXCL1 SAVE AREA POINTER
         XCTL  (2,12),EP=TESTXCL4  RESTORE REGS,DEL XCL3, TRANS XCL4
         END
