*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 02/24/06 RPI214 * OP IN SUBSTRING EXP, NO CONCAT AFTER SUBSTRING
*********************************************************************
TESTMAC5 SUBENTRY 
         WTO   'TESTMAC5 TEST RPI 214 * LAST OP, AND NO CONCAT .'
&T1      SETC  'ABC'(1+2*1,1)
         AIF   (&T1 NE 'C').ERR
&T2      SETC  'ABC'(2,1)'DEF'
         AIF   (&T2 NE 'BDEF').ERR
         WTO   'TESTMAC5 ENDED OK'
         SUBEXIT   
         AGO   .EXIT
.ERR     MNOTE 12,'T1/T2 ERROR'
.EXIT    END                        
