*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 11/10/06 RPI 473 CORRECT CALL MACRO BUGS AND TEST OPTIONS
*********************************************************************
TESTCAL1 SUBENTRY
         WTO   'TESTCAL1 TEST LOCAL STATIC LINKED CALL WITH PARMS'
         CALL  MYSUB,(PARM1),VL
         CALL  MYSUB,(PARM1,PARM2),VL
         LA    R4,PARM2
         CALL  MYSUB,(PARM1,(R4)),VL,MF=(E,LIST)
         CALL  MYSUB,MF=(E,LIST)
         WTO  'TESTCAL1 ENDED OK'
         SUBEXIT
PARM1    DC   CL20'PARM1 MSG'
PARM2    DC   CL20'PARM2 MSG'
LIST     CALL  ,(PARM1,PARM2),VL,MF=L
MYSUB    SUBENTRY
         LR   R2,R1
LOOP     EQU  *
         L    R3,0(R2)
         MVC  DMSG,0(R3)
         WTO  MF=(E,WTOMSG)
         AHI  R2,4
         LTR  R3,R3
         BP   LOOP
         SUBEXIT
WTOMSG   DC   AL2(WTOEND-*,0)
         DC   C'PARM='
DMSG     DC   CL20' '
WTOEND   EQU  *
         EQUREGS
         END
