*********************************************************************
* z390 - Mainframe assembler emulator and run-time engine
* Copyright (C) 2021 z390 Assembler LLC
*
* This file is part of z390.
*
* z390 is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
* z390 is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License 
* along with this program; if not, see https://www.gnu.org/licenses.
* Author - Don Higgins                                              *
* Date   - 09/30/05                                                 *
*********************************************************************
* 04/22/08 RPI 833 ADD STRING QUOTES FOR HLASM COMPATIBILITY 
*********************************************************************
         MACRO
         TEST1
&TEXT    AREAD
         WTO  '&TEXT'
         MEND
TESTPCH1 SUBENTRY
         WTO   'START TESTPCH1 AREAD AND PUNCH USING DEFAULT PCH'
         TEST1
TEST1 RECORD 1
         TEST1
TEST1 RECORD 2
         MACRO
         TEST2
.LOOP    ANOP
&TEXT    AREAD
         AIF   ('&TEXT'(1,17) EQ 'TEST2 END OF DATA').ENDLOOP
         WTO   '&TEXT'
         AGO   .LOOP
.ENDLOOP ANOP
         MEND
         TEST2
TEST2 RECORD 1
TEST2 RECORD 2
TEST2 RECORD 3
TEST2 END OF DATA
         WTO   'END   AREAD TEXT'
         WTO   'START PUNCH TEST'
         PUNCH 'TEST3 RECORD 1'
         PUNCH 'TEST3 RECORD 2'
&TEXT    SETC  'TEST4 RECORD 1'
         PUNCH '&TEXT'
         WTO   'END TESTPCH1 OK'
         SUBEXIT
         END    
