000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     CM104M.
000400 AUTHOR.
000500     FEDERAL COMPILER TESTING CENTER.
000600 INSTALLATION.
000700     GENERAL SERVICES ADMINISTRATION
000800     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.
000900     SOFTWARE DEVELOPMENT OFFICE.
001000     5203 LEESBURG PIKE  SUITE 1100
001100     FALLS CHURCH VIRGINIA 22041.
001200
001300     PHONE   (703) 756-6153
001400
001500     " HIGH       ".
001600 DATE-WRITTEN.
001700     CCVS-74 VERSION 4.0 - 1980 JULY 1.
001800     CREATION DATE     /    VALIDATION DATE
001900     "4.2 ".
002000 SECURITY.
002100     NONE.
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.
002500     XXXXX082.
002600 OBJECT-COMPUTER.
002700     XXXXX083.
002800 INPUT-OUTPUT SECTION.
002900 FILE-CONTROL.
003000     SELECT PRINT-FILE ASSIGN TO
003100     XXXXX055.
003200 DATA DIVISION.
003300 FILE SECTION.
003400 FD  PRINT-FILE
003500     LABEL RECORDS
003600     XXXXX084
003700     DATA RECORD IS PRINT-REC DUMMY-RECORD.
003800 01  PRINT-REC PICTURE X(120).
003900 01  DUMMY-RECORD PICTURE X(120).
004000 WORKING-STORAGE SECTION.
004100 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
004200 01  REC-CT PICTURE 99 VALUE ZERO.
004300 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
004400 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
004500 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
004600 01  PASS-COUNTER PIC 999 VALUE ZERO.
004700 01  TOTAL-ERROR PIC 999 VALUE ZERO.
004800 01  ERROR-HOLD PIC 999 VALUE ZERO.
004900 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
005000 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
005100 01  CCVS-H-1.
005200     02  FILLER   PICTURE X(27)  VALUE SPACE.
005300     02 FILLER PICTURE X(67) VALUE
005400     " FEDERAL COMPILER TESTING CENTER COBOL COMPILER VALIDATION
005500-    " SYSTEM".
005600     02  FILLER     PICTURE X(26)  VALUE SPACE.
005700 01  CCVS-H-2.
005800     02 FILLER PICTURE X(52) VALUE IS
005900     "CCVS74 NCC  COPY, NOT FOR DISTRIBUTION.".
006000     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
006100     02 TEST-ID PICTURE IS X(9).
006200     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
006300 01  CCVS-H-3.
006400     02  FILLER PICTURE X(34) VALUE
006500     " FOR OFFICIAL USE ONLY    ".
006600     02  FILLER PICTURE X(58) VALUE
006700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
006800     02  FILLER PICTURE X(28) VALUE
006900     "  COPYRIGHT   1974 ".
007000 01  CCVS-E-1.
007100     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
007200     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
007300     02 ID-AGAIN PICTURE IS X(9).
007400     02 FILLER PICTURE X(45) VALUE IS
007500     " NTIS DISTRIBUTION COBOL 74".
007600 01  CCVS-E-2.
007700     02  FILLER                   PICTURE X(31)  VALUE
007800     SPACE.
007900     02  FILLER                   PICTURE X(21)  VALUE SPACE.
008000     02 CCVS-E-2-2.
008100         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
008200         03 FILLER PICTURE IS X VALUE IS SPACE.
008300         03 ENDER-DESC PIC X(44) VALUE "ERRORS ENCOUNTERED".
008400 01  CCVS-E-3.
008500     02  FILLER PICTURE X(22) VALUE
008600     " FOR OFFICIAL USE ONLY".
008700     02  FILLER PICTURE X(12) VALUE SPACE.
008800     02  FILLER PICTURE X(58) VALUE
008900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
009000     02  FILLER PICTURE X(13) VALUE SPACE.
009100     02 FILLER PIC X(15) VALUE " COPYRIGHT 1974".
009200 01  CCVS-E-4.
009300     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
009400     02 FILLER PIC XXXX VALUE " OF ".
009500     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
009600     02 FILLER PIC X(40) VALUE
009700      "  TESTS WERE EXECUTED SUCCESSFULLY".
009800 01  XXINFO.
009900     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
010000     02 INFO-TEXT.
010100     04 FILLER PIC X(20) VALUE SPACE.
010200     04 XXCOMPUTED PIC X(20).
010300     04 FILLER PIC X(5) VALUE SPACE.
010400     04 XXCORRECT PIC X(20).
010500 01  HYPHEN-LINE.
010600     02 FILLER PICTURE IS X VALUE IS SPACE.
010700     02 FILLER PICTURE IS X(65) VALUE IS "************************
010800-    "*****************************************".
010900     02 FILLER PICTURE IS X(54) VALUE IS "************************
011000-    "******************************".
011100 01  CCVS-PGM-ID PIC X(6) VALUE
011200     "CM104M".
011300 01  LOG-HDR-1.
011400     02  FILLER PIC X(54) VALUE SPACES.
011500     02  FILLER PIC X(11) VALUE "MESSAGE LOG".
011600 01  LOG-HDR-2.
011700     02  FILLER PIC XXX VALUE SPACES.
011800     02  FILLER PIC X(12) VALUE "SYMBOLIC".
011900     02  FILLER PIC X(15) VALUE "TIME MCS".
012000     02  FILLER PIC X(6) VALUE "SEND".
012100     02  FILLER PIC X(4) VALUE "MSG".
012200     02  FILLER PIC XXX VALUE "IN".
012300     02  FILLER PIC X(3) VALUE "OUT".
012400 01  LOG-HDR-3.
012500     02  FILLER PIC X(4) VALUE SPACES.
012600     02  FILLER PIC X(11) VALUE "SOURCE".
012700     02  FILLER PIC X(11) VALUE "RECEIVED".
012800     02  FILLER PIC XXX VALUE "QD".
012900     02  FILLER PIC X(7) VALUE "COMPLT".
013000     02  FILLER PIC X(4) VALUE "LTH".
013100     02  FILLER PIC XXX VALUE "ST".
013200     02  FILLER PIC X(33) VALUE "STAT".
013300     02  FILLER PIC X(16) VALUE "MESSAGE CONTENTS".
013400 01  LOG-HDR-4.
013500     02  FILLER PIC X VALUE SPACE.
013600     02  FILLER PIC X(12) VALUE ALL "-".
013700     02  FILLER PIC X VALUE SPACE.
013800     02  FILLER PIC X(11) VALUE ALL "-".
013900     02  FILLER PIC X VALUE SPACE.
014000     02  FILLER PIC XXX VALUE "--".
014100     02  FILLER PIC X(6) VALUE ALL "-".
014200     02  FILLER PIC X VALUE SPACE.
014300     02  FILLER PIC X(4) VALUE "---".
014400     02  FILLER PIC XXX VALUE "--".
014500     02  FILLER PIC X(5) VALUE "----".
014600     02  FILLER PIC X(72) VALUE ALL "-".
014700 01  LOG-LINE.
014800     02  FILLER PIC X VALUE SPACE.
014900     02  SYM-SOURCE PIC X(12).
015000     02  FILLER PIC X VALUE SPACE.
015100     02  LOG-TIME.
015200         03  HRS PIC 99.
015300         03  FILLER PIC X VALUE ":".
015400         03  MINS PIC 99.
015500         03  FILLER PIC X VALUE ":".
015600         03  SECS PIC 99.99.
015700     02  FILLER PIC X VALUE SPACE.
015800     02  QUEUE-DEPTH PIC Z9.
015900     02  OUT-TIME PIC -(4).99.
016000     02  FILLER PIC X VALUE SPACE.
016100     02  MSG-LENGTH PIC ZZ9.
016200     02  FILLER PIC X VALUE SPACE.
016300     02  IN-STATUS PIC XX.
016400     02  FILLER PIC X VALUE SPACE.
016500     02  OUT-STATUS PIC XX.
016600     02  FILLER PIC X VALUE "/".
016700     02  OUT-ERR-KEY PIC X.
016800     02  FILLER PIC X VALUE SPACE.
016900     02  MSG.
017000         03  KILL-FIELD PIC X(4).
017100         03  FILLER PIC X(68).
017200 01  SEND-TIME.
017300     02  S-HRS PIC 99.
017400     02  S-MINS PIC 99.
017500     02  S-SECS PIC 99V99.
017600 COMMUNICATION SECTION.
017700 CD  CM-INQUE-1 FOR INPUT.
017800 01  INQUE-1-SPECIFICATIONS.
017900     02  QUEUE-1 PIC X(24) VALUE
018000     XXXXX030.
018100     02  FILLER PIC X(30) VALUE SPACES.
018200     02  TIME-RECEIVED-1.
018300         03  HRS PIC 99.
018400         03  MINS PIC 99.
018500         03  SECS PIC 99V99.
018600     02  SOURCE-1 PIC X(12).
018700     02  IN-LENGTH-1 PIC 9(4).
018800     02  END-KEY-1 PIC X.
018900     02  IN-STATUS-1 PIC XX.
019000     02  MSG-COUNT-1 PIC 9(6).
019100 01  INQUE-1-DUMMY-RECORD PIC X(87).
019200 01  INQUE-1-DUMMY-TABLE.
019300     02  DUMMY-NAME PIC 9 OCCURS 87 TIMES INDEXED BY I1.
019400 CD  CM-OUTQUE-1 FOR OUTPUT.
019500 01  OUTQUE-1-SPECIFIACTIONS.
019600     02  DEST-COUNT-1 PIC 9(4) VALUE IS 1.
019700     02  OUT-LENGTH-1 PIC 9(4).
019800     02  OUT-STATUS-1 PIC XX.
019900     02  ERR-KEY-1 PIC X.
020000     02  SYM-DEST-1 PIC X(12) VALUE
020100     XXXXX032.
020200 01  OUTQUE-1-DUMMY-RECORD PIC X(23).
020300 01  OUTQUE-1-DUMMY-TABLE.
020400     02  DUMMY-NAME OCCURS 23 TIMES PIC X.
020500 CD  CM-INQUE-2 FOR INPUT
020600     FILLER FILLER FILLER FILLER FILLER FILLER SOURCE-2
020700     IN-LENGTH-2 END-KEY-2 IN-STATUS-2 MSG-COUNT-2.
020800 01  INQUE-2-RECORD.
020900     02  FILLER PIC X(54) VALUE
021000     XXXXX034.
021100     02  TIME-RECEIVED-2.
021200         03  HRS PIC 99.
021300         03  MINS PIC 99.
021400         03  SECS PIC 99V99.
021500     02  FILLER PIC X(25).
021600 CD  CM-OUTQUE-2 FOR OUTPUT
021700     TEXT LENGTH OUT-LENGTH-2
021800     STATUS KEY OUT-STATUS-2
021900     ERROR KEY ERR-KEY-2.
022000 01  OUTQUE-2-RECORD.
022100     02  FILLER PIC 9(4) VALUE 1.
022200     02  FILLER PIC X(7) VALUE SPACES.
022300     02  FILLER PIC X(12) VALUE
022400     XXXXX035.
022500 PROCEDURE    DIVISION.
022600 SECT-CM104M-0001 SECTION.
022700 CM104M-INIT.
022800     OPEN     OUTPUT PRINT-FILE.
022900     MOVE "CM104M     " TO TEST-ID.
023000     MOVE     TEST-ID TO ID-AGAIN.
023100     PERFORM HEAD-ROUTINE.
023200     PERFORM LOG-HEADER.
023300     ENABLE INPUT CM-INQUE-1 WITH KEY
023400     XXXXX031.
023500     ENABLE INPUT CM-INQUE-2 WITH KEY
023600     XXXXX036.
023700     ENABLE OUTPUT CM-OUTQUE-1 WITH KEY
023800     XXXXX033.
023900     ENABLE OUTPUT CM-OUTQUE-2 WITH KEY
024000     XXXXX037.
024100 CM104M-POLL-1.
024200     MOVE SPACES TO MSG.
024300     RECEIVE CM-INQUE-1 MESSAGE INTO MSG
024400         NO DATA GO TO CM104M-POLL-2.
024500     ACCEPT CM-INQUE-1 COUNT.
024600     IF IN-LENGTH-1 IS GREATER THAN 72
024700         MOVE 72 TO OUT-LENGTH-2
024800             ELSE MOVE IN-LENGTH-1 TO OUT-LENGTH-2.
024900     SEND CM-OUTQUE-2 FROM MSG WITH EMI.
025000     ACCEPT SEND-TIME FROM TIME.
025100     MOVE SOURCE-1 TO SYM-SOURCE.
025200     MOVE CORR TIME-RECEIVED-1 TO LOG-TIME.
025300     COMPUTE OUT-TIME =
025400         (S-HRS * 3600 + S-MINS * 60 + S-SECS) -
025500         (HRS OF TIME-RECEIVED-1 * 3600 + MINS OF TIME-RECEIVED-1
025600          * 60 + SECS OF TIME-RECEIVED-1).
025700     MOVE MSG-COUNT-1 TO QUEUE-DEPTH.
025800     MOVE IN-LENGTH-1 TO MSG-LENGTH.
025900     MOVE IN-STATUS-1 TO IN-STATUS.
026000     MOVE OUT-STATUS-2 TO OUT-STATUS.
026100     MOVE ERR-KEY-2 TO OUT-ERR-KEY.
026200     MOVE LOG-LINE TO PRINT-REC.
026300     WRITE PRINT-REC.
026400     IF KILL-FIELD IS EQUAL TO "KILL" GO TO CM104M-FINI.
026500 CM104M-POLL-2.
026600     MOVE SPACES TO MSG.
026700     RECEIVE CM-INQUE-2 MESSAGE INTO MSG
026800         NO DATA GO TO CM104M-POLL-1.
026900     ACCEPT CM-INQUE-2 COUNT.
027000     IF IN-LENGTH-2 IS GREATER THAN 72
027100         MOVE 72 TO OUT-LENGTH-1
027200             ELSE MOVE IN-LENGTH-2 TO OUT-LENGTH-1.
027300     SEND CM-OUTQUE-1 FROM MSG WITH EMI.
027400     ACCEPT SEND-TIME FROM TIME.
027500     MOVE SOURCE-2 TO SYM-SOURCE.
027600     MOVE CORR TIME-RECEIVED-2 TO LOG-TIME.
027700     COMPUTE OUT-TIME =
027800         (S-HRS * 3600 + S-MINS * 60 + S-SECS) -
027900         (HRS OF TIME-RECEIVED-2 * 3600 + MINS OF TIME-RECEIVED-2
028000          * 60 + SECS OF TIME-RECEIVED-2).
028100     MOVE MSG-COUNT-2 TO QUEUE-DEPTH.
028200     MOVE IN-LENGTH-2 TO MSG-LENGTH.
028300     MOVE IN-STATUS-2 TO IN-STATUS.
028400     MOVE OUT-STATUS-1 TO OUT-STATUS.
028500     MOVE ERR-KEY-1 TO OUT-ERR-KEY.
028600     MOVE LOG-LINE TO PRINT-REC.
028700     WRITE PRINT-REC.
028800     IF KILL-FIELD IS EQUAL TO "KILL" GO TO CM104M-FINI.
028900     GO TO CM104M-POLL-1.
029000 CM104M-FINI.
029100     PERFORM END-ROUTINE THRU END-ROUTINE-3.
029200     CLOSE    PRINT-FILE.
029300     STOP     RUN.
029400 END-ROUTINE.
029500     MOVE     HYPHEN-LINE TO DUMMY-RECORD.
029600     PERFORM WRITE-LINE.
029700 PARA-Z.
029800     PERFORM  BLANK-LINE-PRINT 4 TIMES.
029900     MOVE     CCVS-E-1 TO DUMMY-RECORD.
030000     PERFORM WRITE-LINE.
030100 END-ROUTINE-3.
030200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
030300     PERFORM WRITE-LINE.
030400     MOVE CCVS-E-3 TO DUMMY-RECORD.
030500     PERFORM WRITE-LINE.
030600 BLANK-LINE-PRINT.
030700     MOVE     SPACE TO DUMMY-RECORD.
030800     PERFORM WRITE-LINE.
030900 WRITE-LINE.
031000     WRITE DUMMY-RECORD AFTER ADVANCING 1 LINE.
031100 LOG-HEADER.
031200     MOVE LOG-HDR-1 TO PRINT-REC
031300     WRITE PRINT-REC
031400         AFTER 3 LINES.
031500     MOVE LOG-HDR-2 TO PRINT-REC.
031600     WRITE PRINT-REC
031700         AFTER 3 LINES.
031800     MOVE LOG-HDR-3 TO PRINT-REC.
031900     WRITE PRINT-REC
032000     MOVE LOG-HDR-4 TO PRINT-REC.
032100     PERFORM WRITE-LINE.
032200     MOVE SPACES TO PRINT-REC.
032300     PERFORM WRITE-LINE.
032400 HEAD-ROUTINE.
032500     MOVE CCVS-H-1 TO PRINT-REC
032600     WRITE PRINT-REC
032700         AFTER ADVANCING PAGE.
032800     MOVE CCVS-H-2 TO PRINT-REC.
032900     WRITE PRINT-REC
033000         AFTER 2 LINES.
033100     MOVE CCVS-H-3 TO PRINT-REC.
033200     WRITE PRINT-REC
033300         AFTER 5 LINES.
033400     MOVE HYPHEN-LINE TO PRINT-REC.
033500     PERFORM WRITE-LINE.
