000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     CM102M.
000400 AUTHOR.
000500     FEDERAL COMPILER TESTING CENTER.
000600 INSTALLATION.
000700     GENERAL SERVICES ADMINISTRATION
000800     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.
000900     SOFTWARE DEVELOPMENT OFFICE.
001000     5203 LEESBURG PIKE  SUITE 1100
001100     FALLS CHURCH VIRGINIA 22041.
001200
001300     PHONE   (703) 756-6153
001400
001500     " HIGH       ".
001600 DATE-WRITTEN.
001700     CCVS-74 VERSION 4.0 - 1980 JULY 1.
001800     CREATION DATE     /    VALIDATION DATE
001900     "4.2 ".
002000 SECURITY.
002100     NONE.
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.
002500     XXXXX082.
002600 OBJECT-COMPUTER.
002700     XXXXX083.
002800 INPUT-OUTPUT SECTION.
002900 FILE-CONTROL.
003000     SELECT PRINT-FILE ASSIGN TO
003100     XXXXX055.
003200 DATA DIVISION.
003300 FILE SECTION.
003400 FD  PRINT-FILE
003500     LABEL RECORDS
003600     XXXXX084
003700     DATA RECORD IS PRINT-REC DUMMY-RECORD.
003800 01  PRINT-REC PICTURE X(120).
003900 01  DUMMY-RECORD PICTURE X(120).
004000 WORKING-STORAGE SECTION.
004100 77  COMP-TWO PIC 9 COMP VALUE 2.
004200 77  TWO PIC 9 VALUE 2.
004300 77  COMP-THREE PIC 9 VALUE 3.
004400 77  THREE PIC 9 VALUE 3.
004500 77  SEND-SWITCH PIC 99 COMP.
004600 77  MSG-NUM PIC 9(4).
004700 77  MSG-70 PIC X(70).
004800 77  PASSWORD1 PIC X(10) VALUE
004900     XXXXX033.
005000 01  ERR-MSG.
005100     02  FILLER PIC X(33) VALUE
005200         "THIS MESSAGE SHOULD NOT APPEAR - ".
005300     02  TEST-IND PIC X(4).
005400 01  LOG-HDR-1.
005500     02  FILLER PIC X(48) VALUE SPACES.
005600     02  FILLER PIC X(24) VALUE "LOG OF OUTGOING MESSAGES".
005700 01  LOG-HDR-2.
005800     02  FILLER PIC X VALUE SPACE.
005900     02  FILLER PIC X(14) VALUE "START  TIME".
006000     02  FILLER PIC X(10) VALUE "ELAPSED".
006100     02  FILLER PIC X(13) VALUE "STATUS/ERR".
006200     02  FILLER PIC X(41) VALUE "LENGTH".
006300     02  FILLER PIC X(7) VALUE "MESSAGE".
006400 01  LOG-HDR-3.
006500     02  FILLER PIC X VALUE SPACES.
006600     02  FILLER PIC X(11) VALUE ALL "-".
006700     02  FILLER PIC XXX VALUE SPACES.
006800     02  FILLER PIC X(7) VALUE ALL "-".
006900     02  FILLER PIC XXX VALUE SPACES.
007000     02  FILLER PIC X(10) VALUE ALL "-".
007100     02  FILLER PIC XXX VALUE SPACES.
007200     02  FILLER PIC X(6) VALUE ALL "-".
007300     02  FILLER PIC XXX VALUE SPACES.
007400     02  FILLER PIC X(72) VALUE ALL "-".
007500 01  LOG-LINE.
007600     02  FILLER PIC X VALUE SPACE.
007700     02  START-TIME.
007800         03  HOURS PIC 99.
007900         03  FILLER PIC X VALUE ":".
008000         03  MINUTES PIC 99.
008100         03  FILLER PIC X VALUE ":".
008200         03  SECONDS PIC 99.99.
008300     02  FILLER PIC XX VALUE SPACES.
008400     02  ELAPSED PIC -(4)9.99.
008500     02  FILLER PIC X(7) VALUE SPACES.
008600     02  STAT PIC 99.
008700     02  FILLER PIC X VALUE "/".
008800     02  ERR PIC 9.
008900     02  FILLER PIC X(5) VALUE SPACES.
009000     02  LNTH PIC ZZZ9.
009100     02  FILLER PIC X(5) VALUE SPACES.
009200     02  MSG-OUT PIC X(72).
009300 01  LOG-LINE-1.
009400     02  FILLER PIC X(39) VALUE SPACES.
009500     02  FILLER PIC X(8) VALUE "CONT".
009600     02  MSG-FLD PIC X(72).
009700 01  SUPERIMPOSITION.
009800     02  S-ALL PIC X(4).
009900     02  S-WORDS PIC X(6).
010000     02  S-IN PIC X(3).
010100     02  S-THIS PIC X(5).
010200     02  S-MESSAGE PIC X(8).
010300     02  S-SHOULD PIC X(7).
010400     02  S-COME PIC X(5).
010500     02  S-OUT PIC X(4).
010600     02  S-ON PIC XXX.
010700     02  S-THE PIC X(4).
010800     02  S-SAME PIC X(5).
010900     02  S-LINE PIC X(5).
011000 01  MSG-A.
011100     02  FILLER PIC X VALUE SPACE.
011200     02  MSG-B.
011300         03  FILLER PIC X VALUE SPACE.
011400         03  MSG-C.
011500             04  FILLER PIC X VALUE SPACE.
011600             04  MSG-D.
011700                 05  FILLER PIC X VALUE SPACE.
011800                 05  MSG-E.
011900                     06  FILLER PIC X(19) VALUE
012000                             "THIS IS MESSAGE NO.".
012100                     06  MSG-NO PIC ZZZZ.
012200                     06  FILLER PIC X(35) VALUE
012300                             ".--THIS SENTENCE MUST NOT APPEAR.".
012400 01  SYSTEM-TIME.
012500     02  HOURS PIC 99.
012600     02  MINUTES PIC 99.
012700     02  SECONDS PIC 99V99.
012800 01  COMP-TIME.
012900     02  COMP-HRS PIC 99.
013000     02  COMP-MINS PIC 99.
013100     02  COMP-SECS PIC 99V99.
013200 01  MSG-F.
013300     02  FILLER PIC X(19) VALUE  "THIS IS MESSAGE NO.".
013400     02  MSG-F-NO PIC ZZZZ.
013500     02  FILLER PIC X(40) VALUE
013600             " AND SHOULD APPEAR AT THE TOP OF A PAGE.".
013700 01  MSG-G.
013800     02  FILLER PIC X(19) VALUE  "THIS IS MESSAGE NO.".
013900     02  MSG-G-NO PIC ZZZZ.
014000     02  FILLER PIC X(41) VALUE
014100             " AND SHOULD APPEAR AFTER TWO BLANK LINES.".
014200 01  MSG-H.
014300     02  FILLER PIC X(19) VALUE "THIS IS MESSAGE NO.".
014400     02  MSG-H-NO PIC ZZZZ.
014500     02  FILLER PIC X(41) VALUE
014600             " AND SHOULD APPEAR BEFORE ONE BLANK LINE.".
014700 01  LONG-MSG.
014800     02  LONG-MSG-S1 PIC X(73) VALUE "ON PAGE XIII-21, PARAGRAPH 3
014900-        ".5.4(1)C, THE COBOL STANDARD STATES, ""EXCESS ".
015000     02  LONG-MSG-S2 PIC X(67) VALUE "CHARACTERS OF A MESSAGE OR M
015100-        "ESSAGE SEGMENT WILL NOT BE TRUNCATED.  ".
015200     02  LONG-MSG-S3 PIC X(71) VALUE "CHARACTERS WILL BE PACKED TO
015300-        " A SIZE EQUAL TO THAT OF THE PHYSICAL LINE ".
015400     02  LONG-MSG-S4 PIC X(69) VALUE "AND THEN OUTPUTTED TO THE DE
015500-        "VICE.  THE PROCESS CONTINUES ON THE NEXT ".
015600     02  LONG-MSG-S5 PIC X(73) VALUE "LINE WITH THE EXCESS CHARACT
015700-        "ERS.""  IF THIS ENTIRE PARAGRAPH WAS RECEIVED ".
015800     02  LONG-MSG-S6 PIC X(71) VALUE "BY THE DESIGNATED DEVICE, TH
015900-        "EN THE FOREGOING RULE IS SUPPORTED BY THIS ".
016000     02  LONG-MSG-S7 PIC X(9) VALUE "COMPILER.".
016100 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
016200 01  REC-CT PICTURE 99 VALUE ZERO.
016300 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
016400 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
016500 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
016600 01  PASS-COUNTER PIC 999 VALUE ZERO.
016700 01  TOTAL-ERROR PIC 999 VALUE ZERO.
016800 01  ERROR-HOLD PIC 999 VALUE ZERO.
016900 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
017000 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
017100 01  CCVS-H-1.
017200     02  FILLER   PICTURE X(27)  VALUE SPACE.
017300     02 FILLER PICTURE X(67) VALUE
017400     " FEDERAL COMPILER TESTING CENTER COBOL COMPILER VALIDATION
017500-    " SYSTEM".
017600     02  FILLER     PICTURE X(26)  VALUE SPACE.
017700 01  CCVS-H-2.
017800     02 FILLER PICTURE X(52) VALUE IS
017900     "CCVS74 NCC  COPY, NOT FOR DISTRIBUTION.".
018000     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
018100     02 TEST-ID PICTURE IS X(9).
018200     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
018300 01  CCVS-H-3.
018400     02  FILLER PICTURE X(34) VALUE
018500     " FOR OFFICIAL USE ONLY    ".
018600     02  FILLER PICTURE X(58) VALUE
018700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
018800     02  FILLER PICTURE X(28) VALUE
018900     "  COPYRIGHT   1974 ".
019000 01  CCVS-E-1.
019100     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
019200     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
019300     02 ID-AGAIN PICTURE IS X(9).
019400     02 FILLER PICTURE X(45) VALUE IS
019500     " NTIS DISTRIBUTION COBOL 74".
019600 01  CCVS-E-2.
019700     02  FILLER                   PICTURE X(31)  VALUE
019800     SPACE.
019900     02  FILLER                   PICTURE X(21)  VALUE SPACE.
020000     02 CCVS-E-2-2.
020100         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
020200         03 FILLER PICTURE IS X VALUE IS SPACE.
020300         03 ENDER-DESC PIC X(44) VALUE "ERRORS ENCOUNTERED".
020400 01  CCVS-E-3.
020500     02  FILLER PICTURE X(22) VALUE
020600     " FOR OFFICIAL USE ONLY".
020700     02  FILLER PICTURE X(12) VALUE SPACE.
020800     02  FILLER PICTURE X(58) VALUE
020900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021000     02  FILLER PICTURE X(13) VALUE SPACE.
021100     02 FILLER PIC X(15) VALUE " COPYRIGHT 1974".
021200 01  CCVS-E-4.
021300     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
021400     02 FILLER PIC XXXX VALUE " OF ".
021500     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
021600     02 FILLER PIC X(40) VALUE
021700      "  TESTS WERE EXECUTED SUCCESSFULLY".
021800 01  XXINFO.
021900     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
022000     02 INFO-TEXT.
022100     04 FILLER PIC X(20) VALUE SPACE.
022200     04 XXCOMPUTED PIC X(20).
022300     04 FILLER PIC X(5) VALUE SPACE.
022400     04 XXCORRECT PIC X(20).
022500 01  HYPHEN-LINE.
022600     02 FILLER PICTURE IS X VALUE IS SPACE.
022700     02 FILLER PICTURE IS X(65) VALUE IS "************************
022800-    "*****************************************".
022900     02 FILLER PICTURE IS X(54) VALUE IS "************************
023000-    "******************************".
023100 01  CCVS-PGM-ID PIC X(6) VALUE
023200     "CM102M".
023300 01  TEST-RESULTS.
023400     02 FILLER                    PICTURE X VALUE SPACE.
023500     02 FEATURE                   PICTURE X(18).
023600     02 FILLER                    PICTURE X VALUE SPACE.
023700     02 P-OR-F                    PICTURE X(5).
023800     02 FILLER                    PICTURE X  VALUE SPACE.
023900     02  PAR-NAME PIC X(20).
024000     02 FILLER                    PICTURE X VALUE SPACE.
024100     02 COMPUTED-A                PICTURE X(20).
024200     02  COMPUTED-SLASH-SET REDEFINES COMPUTED-A.
024300         03  FILLER PIC X(8).
024400         03  COMPUTED-STATUS PIC XX.
024500         03  SLASH PIC X.
024600         03  COMPUTED-ERR-KEY PIC X.
024700         03  FILLER PIC X(8).
024800     02 FILLER                    PICTURE X VALUE SPACE.
024900     02 CORRECT-A                 PICTURE X(20).
025000     02  CORRECT-SLASH-SET REDEFINES CORRECT-A.
025100         03  FILLER PIC X(8).
025200         03  CORRECT-2SLASH1 PIC 99/9.
025300         03  FILLER PIC X(8).
025400     02 FILLER                    PICTURE X VALUE SPACE.
025500     02 RE-MARK                   PICTURE X(30).
025600 01  COLUMNS-LINE-1.
025700     02  FILLER PIC X(3) VALUE SPACES.
025800     02  FILLER PIC X(17) VALUE "FEATURE TESTED".
025900     02  FILLER PIC X(9) VALUE "RESLT".
026000     02  FILLER PIC X(21) VALUE "PARAGRAPH NAME".
026100     02  FILLER PIC X(22) VALUE "COMPUTED DATA".
026200     02  FILLER PIC X(29) VALUE "CORRECT DATA".
026300     02  FILLER PIC X(7) VALUE "REMARKS".
026400 01  COLUMNS-LINE-2.
026500     02  FILLER PIC X VALUE SPACE.
026600     02  FILLER PIC X(18) VALUE ALL "-".
026700     02  FILLER PIC X VALUE SPACE.
026800     02  FILLER PIC X(5) VALUE ALL "-".
026900     02  FILLER PIC X VALUE SPACE.
027000     02  FILLER PIC X(20) VALUE ALL "-".
027100     02  FILLER PIC X VALUE SPACE.
027200     02  FILLER PIC X(20) VALUE ALL "-".
027300     02  FILLER PIC X VALUE SPACE.
027400     02  FILLER PIC X(20) VALUE ALL "-".
027500     02  FILLER PIC X VALUE SPACE.
027600     02  FILLER PIC X(31) VALUE ALL "-".
027700 COMMUNICATION SECTION.
027800 CD  CM-OUTQUE-1 FOR OUTPUT
027900     DESTINATION COUNT IS ONE
028000     TEXT LENGTH IS MSG-LENGTH
028100     STATUS KEY IS STATUS-KEY
028200     ERROR KEY IS ERR-KEY
028300     SYMBOLIC DESTINATION IS SYM-DEST.
028400 PROCEDURE    DIVISION.
028500 SECT-CM102M-0001 SECTION.
028600 CM102M-INIT.
028700     OPEN     OUTPUT PRINT-FILE.
028800     MOVE "CM102M     " TO TEST-ID.
028900     MOVE     TEST-ID TO ID-AGAIN.
029000     MOVE    SPACE TO TEST-RESULTS.
029100     PERFORM HEAD-ROUTINE.
029200     PERFORM COLUMN-NAMES-ROUTINE.
029300     MOVE "MCS STATUS WORD" TO FEATURE.
029400 DISAB-STATUS-TEST-01.
029500     MOVE "INITIAL DISABLE TO OUTPUT CD" TO RE-MARK.
029600     MOVE "9" TO STATUS-KEY ERR-KEY.
029700     MOVE 1 TO ONE.
029800     MOVE
029900     XXXXX032
030000         TO SYM-DEST.
030100     DISABLE OUTPUT CM-OUTQUE-1 WITH KEY
030200     XXXXX033.
030300     MOVE "INFO" TO P-OR-F.
030400     MOVE STATUS-KEY TO COMPUTED-STATUS.
030500     MOVE "/" TO SLASH.
030600     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
030700     MOVE "       INFO TEST FOR" TO CORRECT-A.
030800     GO TO DISAB-STATUS-WRITE-01.
030900 DISAB-STATUS-DELETE-01.
031000     PERFORM DE-LETE.
031100 DISAB-STATUS-WRITE-01.
031200     MOVE "DISAB-STATUS-TEST-01" TO PAR-NAME.
031300     PERFORM PRINT-DETAIL.
031400 DISAB-STATUS-TEST-02.
031500     MOVE "NO DESTINATION SPECIFIED" TO RE-MARK.
031600     MOVE "9" TO STATUS-KEY ERR-KEY.
031700     MOVE "GARBAGE" TO SYM-DEST.
031800     MOVE 1 TO ONE.
031900     DISABLE OUTPUT CM-OUTQUE-1 WITH KEY
032000     XXXXX033.
032100     IF STATUS-KEY IS EQUAL TO "20"
032200         AND ERR-KEY IS EQUAL TO "1"
032300         PERFORM PASS GO TO DISAB-STATUS-WRITE-02.
032400     MOVE 201 TO CORRECT-2SLASH1.
032500     MOVE STATUS-KEY TO COMPUTED-STATUS.
032600     MOVE "/" TO SLASH.
032700     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
032800     PERFORM FAIL.
032900     GO TO DISAB-STATUS-WRITE-02.
033000 DISAB-STATUS-DELETE-02.
033100     PERFORM DE-LETE.
033200 DISAB-STATUS-WRITE-02.
033300     MOVE "DISAB-STATUS-TEST-02" TO PAR-NAME.
033400     PERFORM PRINT-DETAIL.
033500 DISAB-STATUS-TEST-03.
033600     MOVE "INVALID PASSWORD USED" TO RE-MARK.
033700     MOVE "9" TO STATUS-KEY ERR-KEY.
033800     MOVE 1 TO ONE.
033900     MOVE
034000     XXXXX032
034100         TO SYM-DEST.
034200     DISABLE OUTPUT CM-OUTQUE-1 WITH KEY
034300         "GARBAGE".
034400     IF STATUS-KEY IS EQUAL TO "40"
034500         PERFORM PASS GO TO DISAB-STATUS-WRITE-03.
034600     MOVE 400 TO CORRECT-2SLASH1.
034700     MOVE STATUS-KEY TO COMPUTED-STATUS.
034800     MOVE "/" TO SLASH.
034900     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
035000     PERFORM FAIL.
035100     GO TO DISAB-STATUS-WRITE-03.
035200 DISAB-STATUS-DELETE-03.
035300     PERFORM DE-LETE.
035400 DISAB-STATUS-WRITE-03.
035500     MOVE "DISAB-STATUS-TEST-03" TO PAR-NAME.
035600     PERFORM PRINT-DETAIL.
035700 DISAB-STATUS-TEST-04.
035800     MOVE "INVALID DESTINATION COUNT (0)" TO RE-MARK.
035900     MOVE "9" TO STATUS-KEY ERR-KEY.
036000     MOVE
036100     XXXXX032
036200         TO SYM-DEST.
036300     MOVE 0 TO ONE.
036400     DISABLE OUTPUT CM-OUTQUE-1 WITH KEY
036500     XXXXX033.
036600     IF STATUS-KEY IS EQUAL TO "30"
036700         PERFORM PASS GO TO DISAB-STATUS-WRITE-04.
036800     MOVE 300 TO CORRECT-2SLASH1.
036900     MOVE STATUS-KEY TO COMPUTED-STATUS.
037000     MOVE "/" TO SLASH.
037100     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
037200     PERFORM FAIL.
037300     GO TO DISAB-STATUS-WRITE-04.
037400 DISAB-STATUS-DELETE-04.
037500     PERFORM DE-LETE.
037600 DISAB-STATUS-WRITE-04.
037700     MOVE "DISAB-STATUS-TEST-04" TO PAR-NAME.
037800     PERFORM PRINT-DETAIL.
037900 DISAB-STATUS-TEST-05.
038000     MOVE "COMBINATION ERROR" TO RE-MARK.
038100     MOVE "9" TO STATUS-KEY ERR-KEY.
038200     MOVE SPACES TO SYM-DEST.
038300     MOVE 0 TO ONE.
038400     DISABLE OUTPUT CM-OUTQUE-1 WITH KEY
038500         "GARBAGE".
038600     MOVE "INFO" TO P-OR-F.
038700     MOVE STATUS-KEY TO COMPUTED-STATUS.
038800     MOVE "/" TO SLASH.
038900     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
039000     GO TO DISAB-STATUS-WRITE-05.
039100 DISAB-STATUS-DELETE-05.
039200     PERFORM DE-LETE.
039300 DISAB-STATUS-WRITE-05.
039400     MOVE "DISAB-STATUS-TEST-05" TO PAR-NAME.
039500     PERFORM PRINT-DETAIL.
039600 SEND-STATUS-TEST-01.
039700     MOVE "DESTINATION DISABLED" TO RE-MARK.
039800     MOVE "CM102M- I AM THE FIRST MESSAGE IN QUEUE;" TO MSG-70.
039900     MOVE "9" TO STATUS-KEY ERR-KEY.
040000     MOVE
040100     XXXXX032
040200         TO SYM-DEST.
040300     MOVE 1 TO ONE.
040400     MOVE 45 TO MSG-LENGTH.
040500     SEND CM-OUTQUE-1 FROM MSG-70 WITH EMI
040600         AFTER ADVANCING PAGE.
040700     MOVE "THOU SHALT HAVE NO OTHER MESSAGES BEFORE ME." TO MSG-70
040800     SEND CM-OUTQUE-1 FROM MSG-70 WITH EMI.
040900     MOVE SPACES TO MSG-70.
041000     MOVE 1 TO MSG-LENGTH.
041100     SEND CM-OUTQUE-1 FROM MSG-70 WITH EGI.
041200     IF STATUS-KEY IS EQUAL TO "10"
041300         PERFORM PASS GO TO SEND-STATUS-WRITE-01.
041400     MOVE 100 TO CORRECT-2SLASH1.
041500     MOVE STATUS-KEY TO COMPUTED-STATUS.
041600     MOVE "/" TO SLASH.
041700     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
041800     PERFORM FAIL.
041900     GO TO SEND-STATUS-WRITE-01.
042000 SEND-STATUS-DELETE-01.
042100     PERFORM DE-LETE.
042200 SEND-STATUS-WRITE-01.
042300     MOVE "SEND-STATUS-TEST-01" TO PAR-NAME.
042400     PERFORM PRINT-DETAIL.
042500 SEND-STATUS-TEST-02.
042600     MOVE "COMBINATION ERROR" TO RE-MARK.
042700     MOVE SPACES TO SYM-DEST.
042800     MOVE 0 TO ONE.
042900     MOVE 100 TO MSG-LENGTH.
043000     MOVE "S-02" TO TEST-IND.
043100     SEND CM-OUTQUE-1 FROM ERR-MSG WITH EMI.
043200     MOVE "INFO" TO P-OR-F.
043300     MOVE STATUS-KEY TO COMPUTED-STATUS.
043400     MOVE "/" TO SLASH.
043500     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
043600     GO TO SEND-STATUS-WRITE-02.
043700 SEND-STATUS-DELETE-02.
043800     PERFORM DE-LETE.
043900 SEND-STATUS-WRITE-02.
044000     MOVE "SEND-STATUS-TEST-02" TO PAR-NAME.
044100     PERFORM PRINT-DETAIL.
044200 ENABL-STATUS-TEST-01.
044300     MOVE "DESTINATION NOT SPECIFIED" TO RE-MARK.
044400     MOVE SPACES TO SYM-DEST.
044500     MOVE "9" TO STATUS-KEY ERR-KEY.
044600     MOVE 1 TO ONE.
044700     ENABLE OUTPUT CM-OUTQUE-1 WITH KEY
044800     XXXXX033.
044900     IF STATUS-KEY IS EQUAL TO "20"
045000         AND ERR-KEY IS EQUAL TO "1"
045100         PERFORM PASS GO TO ENABL-STATUS-WRITE-01.
045200     MOVE 201 TO CORRECT-2SLASH1.
045300     MOVE STATUS-KEY TO COMPUTED-STATUS.
045400     MOVE "/" TO SLASH.
045500     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
045600     PERFORM FAIL.
045700     GO TO ENABL-STATUS-WRITE-01.
045800 ENABL-STATUS-DELETE-01.
045900     PERFORM DE-LETE.
046000 ENABL-STATUS-WRITE-01.
046100     MOVE "ENABL-STATUS-TEST-01" TO PAR-NAME.
046200     PERFORM PRINT-DETAIL.
046300 ENABL-STATUS-TEST-02.
046400     MOVE "INVALID DESTINATION COUNT (0)" TO RE-MARK.
046500     MOVE
046600     XXXXX032
046700         TO SYM-DEST.
046800     MOVE "9" TO STATUS-KEY ERR-KEY.
046900     MOVE 0 TO ONE.
047000     ENABLE OUTPUT CM-OUTQUE-1 WITH KEY
047100     XXXXX033.
047200     IF STATUS-KEY IS EQUAL TO "30"
047300         PERFORM PASS GO TO ENABL-STATUS-WRITE-02.
047400     MOVE 300 TO CORRECT-2SLASH1.
047500     MOVE STATUS-KEY TO COMPUTED-STATUS.
047600     MOVE "/" TO SLASH.
047700     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
047800     PERFORM FAIL.
047900     GO TO ENABL-STATUS-WRITE-02.
048000 ENABL-STATUS-DELETE-02.
048100     PERFORM DE-LETE.
048200 ENABL-STATUS-WRITE-02.
048300     MOVE "ENABL-STATUS-TEST-02" TO PAR-NAME.
048400     PERFORM PRINT-DETAIL.
048500 ENABL-STATUS-TEST-03.
048600     MOVE "INVALID PASSWORD USED" TO RE-MARK.
048700     MOVE
048800     XXXXX032
048900         TO SYM-DEST.
049000     MOVE "9" TO STATUS-KEY ERR-KEY.
049100     MOVE 1 TO ONE.
049200     ENABLE OUTPUT CM-OUTQUE-1 WITH KEY
049300         "GARBAGE".
049400     IF STATUS-KEY IS EQUAL TO "40"
049500         PERFORM PASS GO TO ENABL-STATUS-WRITE-03.
049600     MOVE 400 TO CORRECT-2SLASH1.
049700     MOVE STATUS-KEY TO COMPUTED-STATUS.
049800     MOVE "/" TO SLASH.
049900     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
050000     PERFORM FAIL.
050100     GO TO ENABL-STATUS-WRITE-03.
050200 ENABL-STATUS-DELETE-03.
050300     PERFORM DE-LETE.
050400 ENABL-STATUS-WRITE-03.
050500     MOVE "ENABL-STATUS-TEST-03" TO PAR-NAME.
050600     PERFORM PRINT-DETAIL.
050700 ENABL-STATUS-TEST-04.
050800     MOVE "VALID ENABLE/NO ERROR EXPECTED" TO RE-MARK.
050900     MOVE
051000     XXXXX032
051100         TO SYM-DEST.
051200     MOVE "9" TO STATUS-KEY ERR-KEY.
051300     MOVE 1 TO ONE.
051400     ENABLE OUTPUT CM-OUTQUE-1 WITH KEY
051500     XXXXX033.
051600     IF STATUS-KEY IS EQUAL TO ZERO
051700         PERFORM PASS GO TO ENABL-STATUS-WRITE-04.
051800     MOVE 0 TO CORRECT-2SLASH1.
051900     MOVE STATUS-KEY TO COMPUTED-STATUS.
052000     MOVE "/" TO SLASH.
052100     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
052200     PERFORM FAIL.
052300     GO TO ENABL-STATUS-WRITE-04.
052400 ENABL-STATUS-DELETE-04.
052500     PERFORM DE-LETE.
052600 ENABL-STATUS-WRITE-04.
052700     MOVE "ENABL-STATUS-TEST-04" TO PAR-NAME.
052800     PERFORM PRINT-DETAIL.
052900 SEND-STATUS-TEST-03.
053000     MOVE "DESTINATION UNKNOWN" TO RE-MARK.
053100     MOVE "GARBAGE" TO SYM-DEST.
053200     MOVE "9" TO STATUS-KEY ERR-KEY.
053300     MOVE 1 TO ONE.
053400     MOVE 37 TO MSG-LENGTH.
053500     MOVE "S-03" TO TEST-IND.
053600     SEND CM-OUTQUE-1 FROM ERR-MSG WITH EMI.
053700     IF STATUS-KEY IS EQUAL TO "20"
053800         AND ERR-KEY IS EQUAL TO "1"
053900         PERFORM PASS GO TO SEND-STATUS-WRITE-03.
054000     MOVE 201 TO CORRECT-2SLASH1.
054100     MOVE STATUS-KEY TO COMPUTED-STATUS.
054200     MOVE "/" TO SLASH.
054300     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
054400     PERFORM FAIL.
054500     GO TO SEND-STATUS-WRITE-03.
054600 SEND-STATUS-DELETE-03.
054700     PERFORM DE-LETE.
054800 SEND-STATUS-WRITE-03.
054900     MOVE "SEND-STATUS-TEST-03" TO PAR-NAME.
055000     PERFORM PRINT-DETAIL.
055100 SEND-STATUS-TEST-04.
055200     MOVE "DESTINATION COUNT INVALID (0)" TO RE-MARK.
055300     MOVE
055400     XXXXX032
055500         TO SYM-DEST.
055600     MOVE "9" TO STATUS-KEY ERR-KEY.
055700     MOVE 0 TO ONE.
055800     MOVE 37 TO MSG-LENGTH.
055900     MOVE "S-04" TO TEST-IND.
056000     SEND CM-OUTQUE-1 FROM ERR-MSG WITH EMI.
056100     IF STATUS-KEY IS EQUAL TO "30"
056200         PERFORM PASS GO TO SEND-STATUS-WRITE-04.
056300     MOVE 300 TO CORRECT-2SLASH1.
056400     MOVE STATUS-KEY TO COMPUTED-STATUS.
056500     MOVE "/" TO SLASH.
056600     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
056700     PERFORM FAIL.
056800     GO TO SEND-STATUS-WRITE-04.
056900 SEND-STATUS-DELETE-04.
057000     PERFORM DE-LETE.
057100 SEND-STATUS-WRITE-04.
057200     MOVE "SEND-STATUS-TEST-04" TO PAR-NAME.
057300     PERFORM PRINT-DETAIL.
057400 SEND-STATUS-TEST-05.
057500     MOVE "CHARACTER COUNT EXCESSIVE" TO RE-MARK.
057600     MOVE
057700     XXXXX032
057800         TO SYM-DEST.
057900     MOVE "9" TO STATUS-KEY ERR-KEY.
058000     MOVE 1 TO ONE.
058100     MOVE 38 TO MSG-LENGTH.
058200     MOVE "S-05" TO TEST-IND.
058300     SEND CM-OUTQUE-1 FROM ERR-MSG WITH EMI.
058400     IF STATUS-KEY IS EQUAL TO "50"
058500         PERFORM PASS GO TO SEND-STATUS-WRITE-05.
058600     MOVE 500 TO CORRECT-2SLASH1.
058700     MOVE STATUS-KEY TO COMPUTED-STATUS.
058800     MOVE "/" TO SLASH.
058900     MOVE ERR-KEY TO COMPUTED-ERR-KEY.
059000     PERFORM FAIL.
059100     GO TO SEND-STATUS-WRITE-05.
059200 SEND-STATUS-DELETE-05.
059300     PERFORM DE-LETE.
059400 SEND-STATUS-WRITE-05.
059500     MOVE "SEND-STATUS-TEST-05" TO PAR-NAME.
059600     PERFORM PRINT-DETAIL.
059700 STATUS-TESTS-COMPLETED.
059800     PERFORM END-ROUTINE.
059900     PERFORM END-ROUTINE-1 THRU END-ROUTINE-3.
060000     PERFORM END-ROUTINE.
060100     MOVE LOG-HDR-1 TO PRINT-REC.
060200     WRITE PRINT-REC
060300         AFTER 3 LINES.
060400     MOVE LOG-HDR-2 TO PRINT-REC.
060500     WRITE PRINT-REC
060600         AFTER 3 LINES.
060700     MOVE LOG-HDR-3 TO PRINT-REC.
060800     WRITE PRINT-REC.
060900     PERFORM BLANK-LINE-PRINT.
061000 VARIABLE-LENGTH-MSGS.
061100     MOVE 1 TO ONE.
061200     MOVE
061300     XXXXX032
061400         TO SYM-DEST.
061500     MOVE 1 TO MSG-NO SEND-SWITCH.
061600     MOVE 28 TO MSG-LENGTH.
061700     MOVE MSG-A TO MSG-OUT.
061800     PERFORM SEND-AND-LOG.
061900     MOVE 2 TO MSG-NO.
062000     MOVE 27 TO MSG-LENGTH.
062100     MOVE MSG-B TO MSG-OUT.
062200     PERFORM SEND-AND-LOG.
062300     MOVE 3 TO MSG-NO.
062400     MOVE 26 TO MSG-LENGTH.
062500     MOVE MSG-C TO MSG-OUT.
062600     PERFORM SEND-AND-LOG.
062700     MOVE 4 TO MSG-NO.
062800     MOVE 25 TO MSG-LENGTH.
062900     MOVE MSG-D TO MSG-OUT.
063000     PERFORM SEND-AND-LOG.
063100     MOVE 2 TO SEND-SWITCH.
063200     MOVE 5 TO MSG-NO.
063300     MOVE 24 TO MSG-LENGTH.
063400     MOVE MSG-E TO MSG-OUT.
063500     PERFORM SEND-AND-LOG.
063600 AFTER-PAGE-MSGS.
063700     MOVE 6 TO MSG-NUM.
063800     MOVE 3 TO SEND-SWITCH.
063900     MOVE 63 TO MSG-LENGTH.
064000     PERFORM AFTER-PAGE-MSGS-01 5 TIMES.
064100     GO TO AFTER-THREE-MSGS.
064200 AFTER-PAGE-MSGS-01.
064300     MOVE MSG-NUM TO MSG-F-NO.
064400     ADD 1 TO MSG-NUM.
064500     MOVE MSG-F TO MSG-OUT.
064600     PERFORM SEND-AND-LOG.
064700 AFTER-THREE-MSGS.
064800     MOVE 64 TO MSG-LENGTH.
064900     PERFORM AFTER-THREE-MSGS-01 5 TIMES.
065000     GO TO EGI-ONLY.
065100 AFTER-THREE-MSGS-01.
065200     MOVE MSG-NUM TO MSG-G-NO.
065300     ADD 1 TO MSG-NUM SEND-SWITCH.
065400     MOVE MSG-G TO MSG-OUT.
065500     PERFORM SEND-AND-LOG.
065600 EGI-ONLY.
065700     MOVE "ONLY EGI WAS SENT.  NO MESSAGE ACCOMPANYING" TO MSG-OUT
065800     ADD 1 TO SEND-SWITCH.
065900     MOVE 0 TO MSG-LENGTH.
066000     PERFORM SEND-AND-LOG.
066100 BEFORE-ADV-INIT.
066200     MOVE "0LTH" TO TEST-IND.
066300     ADD 1 TO SEND-SWITCH.
066400     MOVE ERR-MSG TO MSG-OUT.
066500     PERFORM SEND-AND-LOG.
066600 BEFORE-PAGE-MSGS.
066700     MOVE 63 TO MSG-LENGTH.
066800     PERFORM AFTER-PAGE-MSGS-01 5 TIMES.
066900 BEFORE-TWO-MSGS.
067000     MOVE 64 TO MSG-LENGTH.
067100     PERFORM BEFORE-TWO-MSGS-01 5 TIMES.
067200     GO TO ZERO-LINES-MSGS.
067300 BEFORE-TWO-MSGS-01.
067400     MOVE MSG-NUM TO MSG-H-NO.
067500     ADD 1 TO MSG-NUM.
067600     ADD 1 TO SEND-SWITCH.
067700     MOVE MSG-H TO MSG-OUT.
067800     PERFORM SEND-AND-LOG.
067900 ZERO-LINES-MSGS.
068000     ADD 1 TO SEND-SWITCH.
068100     MOVE 59 TO MSG-LENGTH.
068200     MOVE "ALL" TO SUPERIMPOSITION.
068300     PERFORM ZERO-LINES-MSGS-01.
068400     MOVE "WORDS" TO S-WORDS.
068500     PERFORM ZERO-LINES-MSGS-01.
068600     MOVE "IN" TO S-IN.
068700     PERFORM ZERO-LINES-MSGS-01.
068800     MOVE "THIS" TO S-THIS.
068900     PERFORM ZERO-LINES-MSGS-01.
069000     MOVE "MESSAGE" TO S-MESSAGE.
069100     PERFORM ZERO-LINES-MSGS-01.
069200     MOVE "SHOULD" TO S-SHOULD.
069300     PERFORM ZERO-LINES-MSGS-01.
069400     ADD 1 TO SEND-SWITCH.
069500     MOVE "COME" TO S-COME.
069600     PERFORM ZERO-LINES-MSGS-01.
069700     MOVE "OUT" TO S-OUT.
069800     PERFORM ZERO-LINES-MSGS-01.
069900     MOVE "ON" TO S-ON.
070000     PERFORM ZERO-LINES-MSGS-01.
070100     MOVE "THE" TO S-THE.
070200     PERFORM ZERO-LINES-MSGS-01.
070300     MOVE "SAME" TO S-SAME.
070400     PERFORM ZERO-LINES-MSGS-01.
070500     MOVE "LINE." TO S-LINE.
070600     PERFORM ZERO-LINES-MSGS-01.
070700     GO TO 433-CHARACTER-MSG.
070800 ZERO-LINES-MSGS-01.
070900     MOVE SUPERIMPOSITION TO MSG-OUT.
071000     PERFORM SEND-AND-LOG.
071100     MOVE SPACES TO SUPERIMPOSITION.
071200 433-CHARACTER-MSG.
071300     ADD 1 TO SEND-SWITCH.
071400     MOVE 433 TO MSG-LENGTH.
071500     MOVE LONG-MSG-S1 TO MSG-OUT.
071600     PERFORM SEND-AND-LOG.
071700     MOVE LONG-MSG-S2 TO MSG-FLD.
071800     WRITE PRINT-REC FROM LOG-LINE-1.
071900     MOVE LONG-MSG-S3 TO MSG-FLD.
072000     WRITE PRINT-REC FROM LOG-LINE-1.
072100     MOVE LONG-MSG-S4 TO MSG-FLD.
072200     WRITE PRINT-REC FROM LOG-LINE-1.
072300     MOVE LONG-MSG-S5 TO MSG-FLD.
072400     WRITE PRINT-REC FROM LOG-LINE-1.
072500     MOVE LONG-MSG-S6 TO MSG-FLD.
072600     WRITE PRINT-REC FROM LOG-LINE-1.
072700     MOVE LONG-MSG-S7 TO MSG-FLD.
072800     WRITE PRINT-REC FROM LOG-LINE-1.
072900 MSG-BEFORE-DELAY-AND-DISABLE.
073000     MOVE "EXPECT A PAUSE OF UP TO 30 SECONDS BEFORE TRANSMISSION
073100-        "OF NEXT MESSAGE." TO MSG-OUT.
073200     MOVE 72 TO MSG-LENGTH.
073300     MOVE 4 TO SEND-SWITCH.
073400     PERFORM SEND-AND-LOG.
073500 DELAY-FOR-30-SECS.
073600     ACCEPT SYSTEM-TIME FROM TIME.
073700     IF (HOURS OF SYSTEM-TIME * 3600 + MINUTES OF SYSTEM-TIME * 60
073800         + SECONDS OF SYSTEM-TIME) - (COMP-HRS * 3600 + COMP-MINS
073900         * 60 + COMP-SECS) IS LESS THAN 30
074000         GO TO DELAY-FOR-30-SECS.
074100 DISABLE-DEVICE.
074200     MOVE "****  DEVICE DISABLED  ****" TO MSG-OUT.
074300     MOVE 0 TO MSG-LENGTH.
074400     MOVE 19 TO SEND-SWITCH.
074500     PERFORM SEND-AND-LOG.
074600 10-WHILE-DISABLED.
074700     MOVE "TRANSMISSION NOW RESUMED." TO MSG-OUT.
074800     MOVE 25 TO MSG-LENGTH.
074900     MOVE 1 TO SEND-SWITCH.
075000     PERFORM SEND-AND-LOG.
075100     MOVE 24 TO MSG-LENGTH.
075200     PERFORM 10-WHILE-DISABLED-01 8 TIMES.
075300     GO TO 10-WHILE-DISABLED-02.
075400 10-WHILE-DISABLED-01.
075500     MOVE MSG-NUM TO MSG-NO.
075600     ADD 1 TO MSG-NUM.
075700     MOVE MSG-E TO MSG-OUT.
075800     PERFORM SEND-AND-LOG.
075900 10-WHILE-DISABLED-02.
076000     MOVE "THERE SHOULD BE NO ABNORMAL DELAY IN RECEIVING THE NEXT
076100-        " MESSAGE." TO MSG-OUT.
076200     MOVE 63 TO MSG-LENGTH.
076300     PERFORM SEND-AND-LOG.
076400 RE-ENABLE-OUTQUE.
076500     MOVE "****  DEVICE NOW RE-ENABLED  ****" TO MSG-OUT.
076600     MOVE 0 TO MSG-LENGTH.
076700     MOVE 20 TO SEND-SWITCH.
076800     PERFORM SEND-AND-LOG.
076900 ENQUEUE-500-MORE.
077000     MOVE "THIS IS THAT NEXT MESSAGE." TO MSG-OUT.
077100     MOVE 26 TO MSG-LENGTH.
077200     MOVE 2 TO SEND-SWITCH.
077300     PERFORM SEND-AND-LOG.
077400     MOVE 24 TO MSG-LENGTH.
077500     PERFORM 10-WHILE-DISABLED-01 500 TIMES.
077600 DELAY-DISABLE-DELAY-AND-STOP.
077700     PERFORM DELAY-FOR-30-SECS.
077800     PERFORM DISABLE-DEVICE.
077900     PERFORM DELAY-FOR-30-SECS.
078000     PERFORM END-ROUTINE THRU PARA-Z.
078100     PERFORM END-ROUTINE-4.
078200     CLOSE PRINT-FILE.
078300     STOP RUN.
078400 SEND-AND-LOG.
078500     ACCEPT SYSTEM-TIME FROM TIME.
078600     PERFORM UNIFORM-SEND.
078700     ACCEPT COMP-TIME FROM TIME.
078800     MOVE CORR SYSTEM-TIME TO START-TIME.
078900     COMPUTE ELAPSED =
079000         (COMP-HRS * 3600 + COMP-MINS * 60 + COMP-SECS) -
079100         (HOURS OF SYSTEM-TIME * 3600 + MINUTES OF SYSTEM-TIME *
079200         60 + SECONDS OF SYSTEM-TIME).
079300     MOVE STATUS-KEY TO STAT.
079400     MOVE ERR-KEY TO ERR.
079500     MOVE MSG-LENGTH TO LNTH.
079600     MOVE LOG-LINE TO PRINT-REC.
079700     PERFORM WRITE-LINE.
079800 UNIFORM-SEND SECTION.
079900 UNIFORM-SEND-SWITCH.
080000     GO TO
080100         SEND-EMI-A1
080200         SEND-EGI-A1
080300         SEND-EMI-AP
080400         SEND-EMI-A3-01
080500         SEND-EMI-A3-02
080600         SEND-EMI-A3-03
080700         SEND-EMI-A3-04
080800         SEND-EMI-A3-05
080900         SEND-EGI-ONLY
081000         SEND-EMI-BP
081100         SEND-EMI-B2-01
081200         SEND-EMI-B2-02
081300         SEND-EMI-B2-03
081400         SEND-EMI-B2-04
081500         SEND-EMI-B2-05
081600         SEND-EMI-A0
081700         SEND-EMI-B0
081800         SEND-LONG-MSG
081900         DISABLE-OUTQUE
082000         ENABLE-OUTQUE
082100             DEPENDING ON SEND-SWITCH.
082200 SEND-EMI-A1.
082300     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI.
082400     GO TO UNIFORM-SEND-EXIT.
082500 SEND-EGI-A1.
082600     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EGI.
082700     GO TO UNIFORM-SEND-EXIT.
082800 SEND-EMI-AP.
082900     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI AFTER PAGE.
083000     GO TO UNIFORM-SEND-EXIT.
083100 SEND-EMI-A3-01.
083200     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI AFTER ADVANCING 3
083300         LINES.
083400     GO TO UNIFORM-SEND-EXIT.
083500 SEND-EMI-A3-02.
083600     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
083700         AFTER ADVANCING THREE LINES.
083800     GO TO UNIFORM-SEND-EXIT.
083900 SEND-EMI-A3-03.
084000     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
084100         AFTER 3 LINE.
084200     GO TO UNIFORM-SEND-EXIT.
084300 SEND-EMI-A3-04.
084400     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
084500         AFTER COMP-THREE.
084600     GO TO UNIFORM-SEND-EXIT.
084700 SEND-EMI-A3-05.
084800     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
084900         AFTER 3.
085000     GO TO UNIFORM-SEND-EXIT.
085100 SEND-EGI-ONLY.
085200     SEND CM-OUTQUE-1 WITH EGI.
085300     GO TO UNIFORM-SEND-EXIT.
085400 SEND-EMI-BP.
085500     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
085600         BEFORE ADVANCING PAGE.
085700     GO TO UNIFORM-SEND-EXIT.
085800 SEND-EMI-B2-01.
085900     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
086000         BEFORE ADVANCING 2 LINES.
086100     GO TO UNIFORM-SEND-EXIT.
086200 SEND-EMI-B2-02.
086300     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
086400         BEFORE ADVANCING TWO LINES.
086500     GO TO UNIFORM-SEND-EXIT.
086600 SEND-EMI-B2-03.
086700     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
086800         BEFORE 2 LINE.
086900     GO TO UNIFORM-SEND-EXIT.
087000 SEND-EMI-B2-04.
087100     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
087200         BEFORE COMP-TWO.
087300     GO TO UNIFORM-SEND-EXIT.
087400 SEND-EMI-B2-05.
087500     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
087600         BEFORE 2.
087700     GO TO UNIFORM-SEND-EXIT.
087800 SEND-EMI-A0.
087900     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
088000         AFTER 0 LINES.
088100     GO TO UNIFORM-SEND-EXIT.
088200 SEND-EMI-B0.
088300     SEND CM-OUTQUE-1 FROM MSG-OUT WITH EMI
088400         BEFORE ZERO LINES.
088500     GO TO UNIFORM-SEND-EXIT.
088600 SEND-LONG-MSG.
088700     SEND CM-OUTQUE-1 FROM LONG-MSG WITH EMI AFTER PAGE.
088800     GO TO UNIFORM-SEND-EXIT.
088900 DISABLE-OUTQUE.
089000     DISABLE OUTPUT CM-OUTQUE-1 KEY
089100     PASSWORD1.
089200     GO TO UNIFORM-SEND-EXIT.
089300 ENABLE-OUTQUE.
089400     ENABLE OUTPUT CM-OUTQUE-1 WITH KEY
089500     XXXXX033.
089600 UNIFORM-SEND-EXIT.
089700     EXIT.
089800 COMMON-SUBROUTINES SECTION.
089900 PASS.
090000     MOVE "PASS" TO P-OR-F.
090100 FAIL.
090200     ADD      1 TO ERROR-COUNTER.
090300     MOVE "FAIL*" TO P-OR-F.
090400 DE-LETE.
090500     MOVE     SPACE TO P-OR-F.
090600     MOVE     "    ************    " TO COMPUTED-A.
090700     MOVE     "    ************    " TO CORRECT-A.
090800     MOVE "****TEST DELETED****" TO RE-MARK.
090900     ADD 1 TO DELETE-CNT.
091000 PRINT-DETAIL.
091100     MOVE     TEST-RESULTS TO PRINT-REC.
091200     PERFORM WRITE-LINE.
091300     MOVE     SPACE TO P-OR-F.
091400     MOVE     SPACE TO COMPUTED-A.
091500     MOVE SPACE TO CORRECT-A.
091600 COLUMN-NAMES-ROUTINE.
091700     MOVE     COLUMNS-LINE-1 TO DUMMY-RECORD.
091800     PERFORM WRITE-LINE.
091900     MOVE     COLUMNS-LINE-2 TO DUMMY-RECORD.
092000     PERFORM WRITE-LINE.
092100     PERFORM  BLANK-LINE-PRINT.
092200 END-ROUTINE.
092300     MOVE     HYPHEN-LINE TO DUMMY-RECORD.
092400     PERFORM WRITE-LINE.
092500 PARA-Z.
092600     PERFORM  BLANK-LINE-PRINT 4 TIMES.
092700     MOVE     CCVS-E-1 TO DUMMY-RECORD.
092800     PERFORM WRITE-LINE.
092900 END-ROUTINE-1.
093000     PERFORM  BLANK-LINE-PRINT.
093100     IF       ERROR-COUNTER IS EQUAL TO ZERO
093200              GO TO END-ROUTINE-2.
093300     MOVE     ERROR-COUNTER TO ERROR-TOTAL.
093400     GO TO    END-ROUTINE-3.
093500 END-ROUTINE-2.
093600     MOVE " NO" TO ERROR-TOTAL.
093700 END-ROUTINE-3.
093800     MOVE     CCVS-E-2 TO DUMMY-RECORD.
093900     PERFORM WRITE-LINE.
094000     IF DELETE-CNT IS EQUAL TO ZERO
094100         MOVE " NO" TO ERROR-TOTAL  ELSE
094200     MOVE DELETE-CNT TO ERROR-TOTAL.
094300     MOVE "TESTS DELETED     " TO ENDER-DESC.
094400     MOVE CCVS-E-2 TO DUMMY-RECORD.
094500     PERFORM WRITE-LINE.
094600 END-ROUTINE-4.
094700     MOVE CCVS-E-3 TO DUMMY-RECORD.
094800     PERFORM WRITE-LINE.
094900 BLANK-LINE-PRINT.
095000     MOVE     SPACE TO DUMMY-RECORD.
095100     PERFORM WRITE-LINE.
095200 WRITE-LINE.
095300     WRITE DUMMY-RECORD AFTER ADVANCING 1 LINE.
095400 HEAD-ROUTINE.
095500     MOVE CCVS-H-1 TO PRINT-REC
095600     WRITE PRINT-REC
095700         AFTER ADVANCING PAGE.
095800     MOVE CCVS-H-2 TO PRINT-REC.
095900     WRITE PRINT-REC
096000         AFTER 2 LINES.
096100     MOVE CCVS-H-3 TO PRINT-REC.
096200     WRITE PRINT-REC
096300         AFTER 5 LINES.
096400     MOVE HYPHEN-LINE TO PRINT-REC.
096500     PERFORM WRITE-LINE.
