000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     DB101A.
000400 AUTHOR.
000500     FEDERAL COMPILER TESTING CENTER.
000600 INSTALLATION.
000700     GENERAL SERVICES ADMINISTRATION
000800     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.
000900     SOFTWARE DEVELOPMENT OFFICE.
001000     5203 LEESBURG PIKE  SUITE 1100
001100     FALLS CHURCH VIRGINIA 22041.
001200
001300     PHONE   (703) 756-6153
001400
001500     " HIGH       ".
001600 DATE-WRITTEN.
001700     CCVS-74 VERSION 4.0 - 1980 JULY 1.
001800     CREATION DATE     /    VALIDATION DATE
001900     "4.2 ".
002000 SECURITY.
002100     NONE.
002200*
002300*    *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *
002400*
002500*                       PROGRAM ABSTRACT
002600*
002700*    DB101A TESTS THE BASIC OPERATION OF THE DEBUG MODULE WHEN
002800*    BOTH THE COMPILE AND OBJECT TIME DEBUGGING SWITCHES ARE
002900*    TURNED ON.  THE PROGRAM CONTAINS BOTH DEBUG LINES AND SIMPLE
003000*    DEBUGGING PROCEDURES.  THE DEBUGGING PROCEDURES ARE SPECI-
003100*    FIED FOR PROCEDURE-NAMES AND PROCEDURE-NAME SERIES.  THE
003200*    FOLLOWING CONDITIONS ARE EVALUATED FOR THE "DEBUG-ITEM"
003300*    REGISTER
003400*
003500*        (1)  START OF PROGRAM
003600*        (2)  REFERENCE BY "ALTER"
003700*        (3)  REFERENCE BY "GO TO"
003800*        (4)  REFERENCE BY "PERFORM"
003900*        (5)  SEQUENTIAL PASSAGE OF CONTROL  (FALL THROUGH)
004000*
004100*    BEFORE BEGINNING EXECUTION OF THE OBJECT PROGRAM,
004200*    WHATEVER JOB CONTROL LANGUAGE IS NECESSARY TO ACTIVATE
004300*    (TURN ON) THE OBJECT TIME DEBUGGING SWITCH SHOULD BE
004400*    SUBMITTED.
004500*
004600*
004700*
004800*
004900 ENVIRONMENT DIVISION.
005000 CONFIGURATION SECTION.
005100 SOURCE-COMPUTER.
005200     XXXXX082
005300         WITH DEBUGGING MODE.
005400 OBJECT-COMPUTER.
005500     XXXXX083.
005600 INPUT-OUTPUT SECTION.
005700 FILE-CONTROL.
005800     SELECT PRINT-FILE ASSIGN TO
005900     XXXXX055.
006000 DATA DIVISION.
006100 FILE SECTION.
006200 FD  PRINT-FILE
006300     LABEL RECORDS
006400     XXXXX084
006500     DATA RECORD IS PRINT-REC DUMMY-RECORD.
006600 01  PRINT-REC PICTURE X(120).
006700 01  DUMMY-RECORD PICTURE X(120).
006800 WORKING-STORAGE SECTION.
006900 77  A PIC 9 COMP VALUE 1.
007000 77  B PIC 9 COMP VALUE 5.
007100 77  C PIC 9 COMP VALUE 9.
007200 77  D PIC 99 COMP.
007300 77  RESULT-FLAG PIC 99 VALUE 0.
007400 77  DBLINE-HOLD PIC X(6).
007500 77  DBNAME-HOLD PIC X(30).
007600 77  DBCONT-HOLD PIC X(30).
007700 77  FIVE PIC 9 COMP VALUE 5.
007800 01  SIZE-19.
007900     02  FILLER PIC X.
008000     02  SIZE-18.
008100         03  FILLER PIC X.
008200         03  SIZE-17.
008300             04  FILLER PIC X.
008400             04  SIZE-16.
008500                 05  FILLER PIC X.
008600                 05  SIZE-15.
008700                     06  FILLER PIC X.
008800                     06  SIZE-14.
008900                         07  FILLER PIC X.
009000                         07  SIZE-13.
009100                             08  FILLER PIC X.
009200                             08  SIZE-12.
009300                                 09  FILLER PIC XX.
009400                                 09  SIZE-10.
009500                                     10  FILLER PICTURE X(5).
009600                                     10  SIZE-5 PICTURE X(5).
009700 01  TEST-RESULTS.
009800     02 FILLER                    PICTURE X VALUE SPACE.
009900     02 FEATURE                   PICTURE X(20) VALUE SPACE.
010000     02 FILLER                    PICTURE X VALUE SPACE.
010100     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
010200     02 FILLER                    PICTURE X  VALUE SPACE.
010300     02  PAR-NAME.
010400       03 FILLER PICTURE X(12) VALUE SPACE.
010500       03  PARDOT-X PICTURE X  VALUE SPACE.
010600       03 DOTVALUE PICTURE 99  VALUE ZERO.
010700       03 FILLER PIC X(5) VALUE SPACE.
010800     02 FILLER PIC X(10) VALUE SPACE.
010900     02 RE-MARK PIC X(61).
011000 01  TEST-COMPUTED.
011100     02 FILLER PIC X(30) VALUE SPACE.
011200     02 FILLER PIC X(17) VALUE "       COMPUTED=".
011300     02 COMPUTED-X.
011400     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
011500     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
011600     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
011700     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
011800     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
011900     03       CM-18V0 REDEFINES COMPUTED-A.
012000         04 COMPUTED-18V0                   PICTURE -9(18).
012100         04 FILLER                          PICTURE X.
012200     03 FILLER PIC X(50) VALUE SPACE.
012300 01  TEST-CORRECT.
012400     02 FILLER PIC X(30) VALUE SPACE.
012500     02 FILLER PIC X(17) VALUE "       CORRECT =".
012600     02 CORRECT-X.
012700     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
012800     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
012900     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
013000     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
013100     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
013200     03      CR-18V0 REDEFINES CORRECT-A.
013300         04 CORRECT-18V0                    PICTURE -9(18).
013400         04 FILLER                          PICTURE X.
013500     03 FILLER PIC X(50) VALUE SPACE.
013600 01  CCVS-C-1.
013700     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
013800-    "SS  PARAGRAPH-NAME
013900-    "        REMARKS".
014000     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
014100 01  CCVS-C-2.
014200     02 FILLER PICTURE IS X VALUE IS SPACE.
014300     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
014400     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
014500     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
014600     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
014700 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
014800 01  REC-CT PICTURE 99 VALUE ZERO.
014900 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
015000 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
015100 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
015200 01  PASS-COUNTER PIC 999 VALUE ZERO.
015300 01  TOTAL-ERROR PIC 999 VALUE ZERO.
015400 01  ERROR-HOLD PIC 999 VALUE ZERO.
015500 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
015600 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
015700 01  CCVS-H-1.
015800     02  FILLER   PICTURE X(27)  VALUE SPACE.
015900     02 FILLER PICTURE X(67) VALUE
016000     " FEDERAL COMPILER TESTING CENTER COBOL COMPILER VALIDATION
016100-    " SYSTEM".
016200     02  FILLER     PICTURE X(26)  VALUE SPACE.
016300 01  CCVS-H-2.
016400     02 FILLER PICTURE X(52) VALUE IS
016500     "CCVS74 NCC  COPY, NOT FOR DISTRIBUTION.".
016600     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
016700     02 TEST-ID PICTURE IS X(9).
016800     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
016900 01  CCVS-H-3.
017000     02  FILLER PICTURE X(34) VALUE
017100     " FOR OFFICIAL USE ONLY    ".
017200     02  FILLER PICTURE X(58) VALUE
017300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017400     02  FILLER PICTURE X(28) VALUE
017500     "  COPYRIGHT   1974 ".
017600 01  CCVS-E-1.
017700     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
017800     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
017900     02 ID-AGAIN PICTURE IS X(9).
018000     02 FILLER PICTURE X(45) VALUE IS
018100     " NTIS DISTRIBUTION COBOL 74".
018200 01  CCVS-E-2.
018300     02  FILLER                   PICTURE X(31)  VALUE
018400     SPACE.
018500     02  FILLER                   PICTURE X(21)  VALUE SPACE.
018600     02 CCVS-E-2-2.
018700         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
018800         03 FILLER PICTURE IS X VALUE IS SPACE.
018900         03 ENDER-DESC PIC X(44) VALUE "ERRORS ENCOUNTERED".
019000 01  CCVS-E-3.
019100     02  FILLER PICTURE X(22) VALUE
019200     " FOR OFFICIAL USE ONLY".
019300     02  FILLER PICTURE X(12) VALUE SPACE.
019400     02  FILLER PICTURE X(58) VALUE
019500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019600     02  FILLER PICTURE X(13) VALUE SPACE.
019700     02 FILLER PIC X(15) VALUE " COPYRIGHT 1974".
019800 01  CCVS-E-4.
019900     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
020000     02 FILLER PIC XXXX VALUE " OF ".
020100     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
020200     02 FILLER PIC X(40) VALUE
020300      "  TESTS WERE EXECUTED SUCCESSFULLY".
020400 01  XXINFO.
020500     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
020600     02 INFO-TEXT.
020700     04 FILLER PIC X(20) VALUE SPACE.
020800     04 XXCOMPUTED PIC X(20).
020900     04 FILLER PIC X(5) VALUE SPACE.
021000     04 XXCORRECT PIC X(20).
021100 01  HYPHEN-LINE.
021200     02 FILLER PICTURE IS X VALUE IS SPACE.
021300     02 FILLER PICTURE IS X(65) VALUE IS "************************
021400-    "*****************************************".
021500     02 FILLER PICTURE IS X(54) VALUE IS "************************
021600-    "******************************".
021700 01  CCVS-PGM-ID PIC X(6) VALUE
021800     "DB101A".
021900 PROCEDURE DIVISION.
022000 DECLARATIVES.
022100 START-UP SECTION.
022200     USE FOR DEBUGGING ON CCVS1.
022300 BEGIN-START-UP.
022400     MOVE 1 TO RESULT-FLAG.
022500 DB-COMMON.
022600     MOVE DEBUG-LINE TO DBLINE-HOLD.
022700     MOVE DEBUG-NAME TO DBNAME-HOLD.
022800     MOVE DEBUG-CONTENTS TO DBCONT-HOLD.
022900 FALL-THROUGH-AND-SERIES SECTION.
023000     USE FOR DEBUGGING ON FALL-THROUGH-TEST
023100              PROC-SERIES-TEST.
023200 BEGIN-FALL-THROUGH-AND-SERIES.
023300     PERFORM DB-COMMON.
023400     MOVE 2 TO RESULT-FLAG.
023500 GO-TO SECTION.
023600     USE FOR DEBUGGING ON GO-TO-TEST.
023700 BEGIN-GO-TO.
023800     PERFORM DB-COMMON.
023900     MOVE 3 TO RESULT-FLAG.
024000 ALTER-PARAGRAPH SECTION.
024100     USE FOR DEBUGGING ON ALTERABLE-PARAGRAPH.
024200 BEGIN-ALTER-PARAGRAPH.
024300     PERFORM DB-COMMON.
024400     MOVE 4 TO RESULT-FLAG.
024500 LOOP-ITERATION SECTION.
024600     USE FOR DEBUGGING ON LOOP-ROUTINE.
024700 BEGIN-LOOP-ITERATION.
024800     PERFORM DB-COMMON.
024900     ADD 1 TO RESULT-FLAG.
025000 PERFORM-THRU SECTION.
025100     USE FOR DEBUGGING ON DO-NOTHING-1.
025200 BEGIN-PERFORM-THRU.
025300     PERFORM DB-COMMON.
025400     ADD 1 TO RESULT-FLAG.
025500 END DECLARATIVES.
025600******************************************************************
025700*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
025800*    OUTPUT REPORT AS "START-PROGRAM-TEST" SHOULD POINT TO THE   *
025900*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
026000*    WHICH READS, "OPEN OUTPUT PRINT-FILE."                      *
026100******************************************************************
026200 CCVS1 SECTION.
026300 OPEN-FILES.
026400     OPEN     OUTPUT PRINT-FILE.
026500     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
026600     MOVE    SPACE TO TEST-RESULTS.
026700     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
026800     GO TO CCVS1-EXIT.
026900 CLOSE-FILES.
027000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
027100 TERMINATE-CCVS.
027200S    EXIT PROGRAM.
027300STERMINATE-CALL.
027400     STOP     RUN.
027500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
027600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
027700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
027800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
027900     MOVE "****TEST DELETED****" TO RE-MARK.
028000 PRINT-DETAIL.
028100     IF REC-CT NOT EQUAL TO ZERO
028200             MOVE "." TO PARDOT-X
028300             MOVE REC-CT TO DOTVALUE.
028400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
028500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
028600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
028700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
028800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
028900     MOVE SPACE TO CORRECT-X.
029000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
029100     MOVE     SPACE TO RE-MARK.
029200 HEAD-ROUTINE.
029300     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029400     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
029500     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
029600 COLUMN-NAMES-ROUTINE.
029700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
030000 END-ROUTINE.
030100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
030200 END-RTN-EXIT.
030300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030400 END-ROUTINE-1.
030500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
030600      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
030700      ADD PASS-COUNTER TO ERROR-HOLD.
030800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
030900      MOVE PASS-COUNTER TO CCVS-E-4-1.
031000      MOVE ERROR-HOLD TO CCVS-E-4-2.
031100      MOVE CCVS-E-4 TO CCVS-E-2-2.
031200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
031300  END-ROUTINE-12.
031400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
031500     IF       ERROR-COUNTER IS EQUAL TO ZERO
031600         MOVE "NO " TO ERROR-TOTAL
031700         ELSE
031800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
031900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
032000     PERFORM WRITE-LINE.
032100 END-ROUTINE-13.
032200     IF DELETE-CNT IS EQUAL TO ZERO
032300         MOVE "NO " TO ERROR-TOTAL  ELSE
032400         MOVE DELETE-CNT TO ERROR-TOTAL.
032500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
032600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032700      IF   INSPECT-COUNTER EQUAL TO ZERO
032800          MOVE "NO " TO ERROR-TOTAL
032900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
033000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
033100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033300 WRITE-LINE.
033400     ADD 1 TO RECORD-COUNT.
033500Y    IF RECORD-COUNT GREATER 50
033600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
033700Y        MOVE SPACE TO DUMMY-RECORD
033800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
033900Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
034000Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
034100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
034200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
034300Y        MOVE ZERO TO RECORD-COUNT.
034400     PERFORM WRT-LN.
034500 WRT-LN.
034600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
034700     MOVE SPACE TO DUMMY-RECORD.
034800 BLANK-LINE-PRINT.
034900     PERFORM WRT-LN.
035000 FAIL-ROUTINE.
035100     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
035200     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
035300     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
035400     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035500     GO TO FAIL-ROUTINE-EX.
035600 FAIL-ROUTINE-WRITE.
035700     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
035800     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
035900 FAIL-ROUTINE-EX. EXIT.
036000 BAIL-OUT.
036100     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
036200     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
036300 BAIL-OUT-WRITE.
036400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
036500     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036600 BAIL-OUT-EX. EXIT.
036700 CCVS1-EXIT.
036800     EXIT.
036900 START-PROGRAM-TEST.
037000     IF RESULT-FLAG IS NOT EQUAL TO 1
037100         MOVE "USE PROCEDURE NOT EXECUTED" TO RE-MARK
037200         PERFORM FAIL
037300         GO TO START-PROGRAM-WRITE.
037400     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
037500     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
037600     MOVE DBLINE-HOLD TO COMPUTED-A.
037700     PERFORM INSPT.
037800     PERFORM START-PROGRAM-WRITE.
037900     MOVE DBNAME-HOLD TO SIZE-5.
038000     IF SIZE-5 IS EQUAL TO "CCVS1"
038100         PERFORM PASS  ELSE
038200         MOVE "CCVS1" TO CORRECT-A
038300         MOVE DBNAME-HOLD TO COMPUTED-A
038400         PERFORM FAIL.
038500 START-PROGRAM-TEST-1.
038600     MOVE "DEBUG-NAME" TO RE-MARK.
038700     PERFORM START-PROGRAM-WRITE.
038800     MOVE DBCONT-HOLD TO SIZE-13.
038900     IF SIZE-13 IS EQUAL TO "START PROGRAM"
039000         PERFORM PASS ELSE
039100         MOVE "START PROGRAM" TO CORRECT-A
039200         MOVE DBCONT-HOLD TO COMPUTED-A
039300         PERFORM FAIL.
039400     MOVE "DEBUG-CONTENTS" TO RE-MARK.
039500     GO TO START-PROGRAM-WRITE.
039600 START-PROGRAM-DELETE.
039700     PERFORM DE-LETE.
039800 START-PROGRAM-WRITE.
039900     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
040000     MOVE "START-PROGRAM-TEST" TO PAR-NAME.
040100     PERFORM PRINT-DETAIL.
040200******************************************************************
040300*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
040400*    OUTPUT REPORT AS "FALL-THROUGH-TEST" SHOULD POINT TO THE    *
040500*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
040600*    WHICH READS, "MOVE 0 TO RESULT-FLAG."                       *
040700******************************************************************
040800     MOVE 0 TO RESULT-FLAG.
040900 FALL-THROUGH-TEST.
041000     IF RESULT-FLAG IS NOT EQUAL TO 2
041100         MOVE "USE PROCEDURE NOT EXECUTED" TO RE-MARK
041200         PERFORM FAIL
041300         GO TO FALL-THROUGH-WRITE.
041400     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
041500     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
041600     MOVE DBLINE-HOLD TO COMPUTED-A.
041700     PERFORM INSPT.
041800     PERFORM FALL-THROUGH-WRITE.
041900     MOVE DBNAME-HOLD TO SIZE-17.
042000     IF SIZE-17 IS EQUAL TO "FALL-THROUGH-TEST"
042100         PERFORM PASS ELSE
042200         MOVE "FALL-THROUGH-TEST" TO CORRECT-A
042300         MOVE DBNAME-HOLD TO COMPUTED-A
042400         PERFORM FAIL.
042500     MOVE "DEBUG-NAME" TO RE-MARK.
042600     PERFORM FALL-THROUGH-WRITE.
042700     MOVE DBCONT-HOLD TO SIZE-12.
042800     IF SIZE-12 IS EQUAL TO "FALL THROUGH"
042900         PERFORM PASS ELSE
043000         MOVE "FALL THROUGH" TO CORRECT-A
043100         MOVE DBCONT-HOLD TO COMPUTED-A
043200         PERFORM FAIL.
043300     MOVE "DEBUG-CONTENTS" TO RE-MARK.
043400     GO TO FALL-THROUGH-WRITE.
043500 FALL-THROUGH-DELETE.
043600     PERFORM DE-LETE.
043700 FALL-THROUGH-WRITE.
043800     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
043900     MOVE "FALL-THROUGH-TEST" TO PAR-NAME.
044000     PERFORM PRINT-DETAIL.
044100******************************************************************
044200*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
044300*    OUTPUT REPORT AS "PROC-SERIES-TEST" SHOULD POINT TO THE     *
044400*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
044500*    WHICH READS, "MOVE 0 TO RESULT-FLAG."                       *
044600******************************************************************
044700     MOVE 0 TO RESULT-FLAG.
044800 PROC-SERIES-TEST.
044900     IF RESULT-FLAG IS NOT EQUAL TO 2
045000         MOVE "USE PROCEDURE NOT EXECUTED" TO RE-MARK
045100         PERFORM FAIL
045200         GO TO PROC-SERIES-WRITE.
045300     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
045400     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
045500     MOVE DBLINE-HOLD TO COMPUTED-A.
045600     PERFORM INSPT.
045700     PERFORM PROC-SERIES-WRITE.
045800     MOVE DBNAME-HOLD TO SIZE-16.
045900     IF SIZE-16 IS EQUAL TO "PROC-SERIES-TEST"
046000         PERFORM PASS ELSE
046100         MOVE "PROC-SERIES-TEST" TO CORRECT-A
046200         MOVE DBNAME-HOLD TO COMPUTED-A
046300         PERFORM FAIL.
046400     MOVE "DEBUG-NAME" TO RE-MARK.
046500     PERFORM PROC-SERIES-WRITE.
046600     MOVE DBCONT-HOLD TO SIZE-12.
046700     IF SIZE-12 IS EQUAL TO "FALL THROUGH"
046800         PERFORM PASS ELSE
046900         MOVE "FALL THROUGH" TO CORRECT-A
047000         MOVE DBCONT-HOLD TO COMPUTED-A
047100         PERFORM FAIL.
047200     MOVE "DEBUG-CONTENTS" TO RE-MARK.
047300     GO TO PROC-SERIES-WRITE.
047400 PROC-SERIES-DELETE.
047500     PERFORM DE-LETE.
047600 PROC-SERIES-WRITE.
047700     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
047800     MOVE "PROC-SERIES-TEST" TO PAR-NAME.
047900     PERFORM PRINT-DETAIL.
048000     MOVE 0 TO RESULT-FLAG.
048100******************************************************************
048200*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
048300*    OUTPUT REPORT AS "GO-TO-TEST" SHOULD POINT TO THE           *
048400*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
048500*    WHICH READS, "GO TO GO-TO-TEST.".                           *
048600******************************************************************
048700 ALTERABLE-PARAGRAPH.
048800     GO TO GO-TO-TEST.
048900 FILLER-PARAGRAPH.
049000     DISPLAY "ALTER FAILED AT ALTER-TEST-INIT".
049100     PERFORM FAIL.
049200     GO TO ALTERED-GO-TO-TEST.
049300 GO-TO-TEST.
049400     IF RESULT-FLAG IS NOT EQUAL TO 3
049500         MOVE "USE PROCEDURE NOT EXECUTED" TO RE-MARK
049600         PERFORM FAIL
049700         GO TO GO-TO-WRITE.
049800     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
049900     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
050000     MOVE DBLINE-HOLD TO COMPUTED-A.
050100     PERFORM INSPT.
050200     PERFORM GO-TO-WRITE.
050300     MOVE DBNAME-HOLD TO SIZE-10.
050400     IF SIZE-10 IS EQUAL TO "GO-TO-TEST"
050500         PERFORM PASS ELSE
050600         MOVE DBNAME-HOLD TO COMPUTED-A
050700         MOVE "GO-TO-TEST" TO CORRECT-A
050800         PERFORM FAIL.
050900     MOVE "DEBUG-NAME" TO RE-MARK.
051000     PERFORM GO-TO-WRITE.
051100     MOVE DBCONT-HOLD TO SIZE-12.
051200     IF       SIZE-12 IS EQUAL TO SPACE
051300              PERFORM PASS
051400              ELSE
051500              PERFORM FAIL
051600              MOVE DBCONT-HOLD TO COMPUTED-A
051700              MOVE "SPACES" TO CORRECT-A.
051800     MOVE     "DEBUG-CONTENTS" TO RE-MARK.
051900     GO TO     GO-TO-WRITE.
052000 GO-TO-DELETE.
052100         PERFORM DE-LETE.
052200 GO-TO-WRITE.
052300     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
052400     MOVE "GO-TO-TEST" TO PAR-NAME.
052500     PERFORM PRINT-DETAIL.
052600     MOVE 0 TO RESULT-FLAG.
052700******************************************************************
052800*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
052900*    OUTPUT REPORT AS "ALTER-TEST" SHOULD POINT TO THE           *
053000*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
053100*    WHICH READS, "ALTER ALTERABLE-PARAGRAPH TO PROCEED TO       *
053200*    ALTERED-GO-TO-TEST.".                                       *
053300******************************************************************
053400 ALTER-TEST-INIT.
053500     ALTER ALTERABLE-PARAGRAPH TO PROCEED TO ALTERED-GO-TO-TEST.
053600 ALTER-TEST.
053700     IF RESULT-FLAG IS NOT EQUAL TO 4
053800         MOVE "USE PROCEDURE NOT EXECUTED" TO RE-MARK
053900         PERFORM FAIL
054000         GO TO ALTER-WRITE.
054100     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
054200     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
054300     MOVE DBLINE-HOLD TO COMPUTED-A
054400     PERFORM INSPT.
054500     PERFORM ALTER-WRITE.
054600     MOVE DBNAME-HOLD TO SIZE-19.
054700     IF SIZE-19 IS EQUAL TO "ALTERABLE-PARAGRAPH"
054800         PERFORM PASS ELSE
054900         MOVE "ALTERABLE-PARAGRAPH" TO CORRECT-A
055000         MOVE DBNAME-HOLD TO COMPUTED-A
055100         PERFORM FAIL.
055200     MOVE "DEBUG-NAME" TO RE-MARK.
055300     PERFORM ALTER-WRITE.
055400     MOVE DBCONT-HOLD TO SIZE-18.
055500     IF SIZE-18 IS EQUAL TO "ALTERED-GO-TO-TEST"
055600         PERFORM PASS ELSE
055700         MOVE "ALTERED-GO-TO-TEST" TO CORRECT-A
055800         MOVE DBCONT-HOLD TO COMPUTED-A
055900         PERFORM FAIL.
056000     MOVE "DEBUG-CONTENTS" TO RE-MARK.
056100     GO TO ALTER-WRITE.
056200 ALTER-DELETE.
056300     PERFORM DE-LETE.
056400 ALTER-WRITE.
056500     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
056600     MOVE "ALTER-TEST" TO PAR-NAME.
056700     PERFORM PRINT-DETAIL.
056800     MOVE 0 TO RESULT-FLAG.
056900******************************************************************
057000*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
057100*    OUTPUT REPORT AS "ALTERED-GO-TO-TEST" SHOULD POINT TO THE   *
057200*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
057300*    WHICH READS, "GO TO ALTERABLE-PARAGRAPH.".                  *
057400******************************************************************
057500 ALTER-WRITE-END.
057600     GO TO ALTERABLE-PARAGRAPH.
057700 ALTERED-GO-TO-TEST.
057800     IF RESULT-FLAG IS NOT EQUAL TO 4
057900         MOVE "USE PROCEDURE NOT EXECUTED" TO RE-MARK
058000         PERFORM FAIL
058100         GO TO ALTERED-GO-TO-WRITE.
058200     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
058300     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
058400     MOVE DBLINE-HOLD TO COMPUTED-A.
058500     PERFORM INSPT.
058600     PERFORM ALTERED-GO-TO-WRITE.
058700     MOVE DBNAME-HOLD TO SIZE-19.
058800     IF SIZE-19 IS EQUAL TO "ALTERABLE-PARAGRAPH"
058900         PERFORM PASS ELSE
059000         MOVE DBNAME-HOLD TO COMPUTED-A
059100         MOVE "ALTERABLE-PARAGRAPH" TO CORRECT-A
059200         PERFORM FAIL.
059300     MOVE "DEBUG-NAME" TO RE-MARK.
059400     PERFORM ALTERED-GO-TO-WRITE.
059500     IF       DBCONT-HOLD EQUAL TO SPACE
059600              PERFORM PASS
059700              ELSE
059800              PERFORM FAIL
059900              MOVE DBCONT-HOLD TO COMPUTED-A
060000              MOVE "SPACES" TO CORRECT-A.
060100     MOVE     "DEBUG-CONTENTS" TO RE-MARK.
060200     GO TO ALTERED-GO-TO-WRITE.
060300 ALTERED-GO-TO-DELETE.
060400     PERFORM DE-LETE.
060500 ALTERED-GO-TO-WRITE.
060600     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
060700     MOVE "ALTERED-GO-TO-TEST" TO PAR-NAME.
060800     PERFORM PRINT-DETAIL.
060900     MOVE 0 TO RESULT-FLAG.
061000******************************************************************
061100*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
061200*    OUTPUT REPORT AS "PERF-ITERATION-TEST" SHOULD POINT TO THE  *
061300*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
061400*    WHICH READS, "PERFORM LOOP-ROUTINE FIVE TIMES.".            *
061500******************************************************************
061600 PERF-ITERATION-TEST.
061700     PERFORM LOOP-ROUTINE FIVE TIMES.
061800     IF RESULT-FLAG IS NOT EQUAL TO 5
061900         MOVE "05" TO CORRECT-A
062000         MOVE RESULT-FLAG TO COMPUTED-A
062100         MOVE "NO. OF TIMES USE PROC EXECUTED" TO RE-MARK
062200         PERFORM FAIL
062300              ELSE
062400              MOVE "PROC EXECUTED FIVE TIMES" TO RE-MARK
062500              PERFORM PASS.
062600     IF RESULT-FLAG IS EQUAL TO 0
062700         GO TO PERF-ITERATION-WRITE
062800         ELSE PERFORM PERF-ITERATION-WRITE.
062900     MOVE DBLINE-HOLD TO COMPUTED-A.
063000     PERFORM INSPT.
063100     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
063200     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
063300     PERFORM PERF-ITERATION-WRITE.
063400     MOVE DBNAME-HOLD TO SIZE-12.
063500     IF SIZE-12 IS EQUAL TO "LOOP-ROUTINE"
063600         PERFORM PASS ELSE
063700         MOVE "LOOP-ROUTINE" TO CORRECT-A
063800         MOVE DBNAME-HOLD TO COMPUTED-A
063900         PERFORM FAIL.
064000     MOVE "DEBUG-NAME" TO RE-MARK.
064100     PERFORM PERF-ITERATION-WRITE.
064200     MOVE DBCONT-HOLD TO SIZE-12.
064300     IF SIZE-12 IS EQUAL TO "PERFORM LOOP"
064400         PERFORM PASS ELSE
064500         MOVE "PERFORM LOOP" TO CORRECT-A
064600         MOVE DBCONT-HOLD TO COMPUTED-A
064700         PERFORM FAIL.
064800     MOVE "DEBUG-CONTENTS" TO RE-MARK.
064900     GO TO PERF-ITERATION-WRITE.
065000 PERF-ITERATION-DELETE.
065100     PERFORM DE-LETE.
065200 PERF-ITERATION-WRITE.
065300     MOVE "PERF-ITERATION-TEST" TO PAR-NAME.
065400     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
065500     PERFORM PRINT-DETAIL.
065600     MOVE 0 TO RESULT-FLAG.
065700 PERF-ITERATION-END.
065800     GO TO PERFORM-THRU-TEST.
065900 LOOP-ROUTINE.
066000**NESTED PERFORMS ARE USED HERE TO ATTEMPT TO PREVENT OPTIMIZER
066100* ACTION RESULTING IN LOOP UNFOLDING AND REDUCTION.
066200     PERFORM DO-NOTHING.
066300******************************************************************
066400*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
066500*    OUTPUT REPORT AS "PERFORM-THRU-TEST" SHOULD POINT TO THE    *
066600*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
066700*    WHICH READS, "ADD A B C GIVING D.".                         *
066800******************************************************************
066900 DO-NOTHING.
067000     ADD A B C GIVING D.
067100 DO-NOTHING-1.
067200     SUBTRACT A FROM B.
067300 PERFORM-THRU-TEST.
067400     PERFORM DO-NOTHING THRU DO-NOTHING-1 FIVE TIMES.
067500     IF RESULT-FLAG IS NOT EQUAL TO 5
067600         MOVE "05" TO CORRECT-A
067700         MOVE RESULT-FLAG TO COMPUTED-A
067800         MOVE "NO. OF TIMES USE PROC EXECUTED" TO RE-MARK
067900         PERFORM FAIL
068000              ELSE
068100              MOVE "PROC EXECUTED FIVE TIMES" TO RE-MARK
068200              PERFORM PASS.
068300     IF RESULT-FLAG IS EQUAL TO 0
068400         GO TO PERFORM-THRU-WRITE   ELSE
068500         PERFORM PERFORM-THRU-WRITE.
068600     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
068700     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
068800     MOVE DBLINE-HOLD TO COMPUTED-A.
068900     PERFORM INSPT.
069000     PERFORM PERFORM-THRU-WRITE.
069100     MOVE DBNAME-HOLD TO SIZE-12.
069200     IF SIZE-12 IS EQUAL TO "DO-NOTHING-1"
069300         PERFORM PASS   ELSE
069400         MOVE "DO-NOTHING-1" TO CORRECT-A
069500         MOVE DBNAME-HOLD TO COMPUTED-A
069600         PERFORM FAIL.
069700     MOVE "DEBUG-NAME" TO RE-MARK.
069800     PERFORM PERFORM-THRU-WRITE.
069900     MOVE DBCONT-HOLD TO SIZE-12
070000     IF SIZE-12 IS EQUAL TO "FALL THROUGH"
070100         PERFORM PASS   ELSE
070200         MOVE "FALL THROUGH" TO CORRECT-A
070300         MOVE DBCONT-HOLD TO COMPUTED-A
070400         PERFORM FAIL.
070500     MOVE "DEBUG-CONTENTS" TO RE-MARK.
070600     GO TO PERFORM-THRU-WRITE.
070700 PERFORM-THRU-DELETE.
070800     PERFORM DE-LETE.
070900 PERFORM-THRU-WRITE.
071000     MOVE "PERFORM-THRU-TEST" TO PAR-NAME.
071100     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
071200     PERFORM PRINT-DETAIL.
071300     MOVE 0 TO RESULT-FLAG.
071400******************************************************************
071500*    THE DEBUG-LINE (INSPT) SUBTEST FOR THE TEST NAMED IN THE    *
071600*    OUTPUT REPORT AS "SIMPLE-PERFORM-TEST" SHOULD POINT TO THE  *
071700*    EXECUTABLE STATEMENT WHICH FOLLOWS THIS COMMENT SET AND     *
071800*    WHICH READS, "PERFORM LOOP-ROUTINE.".                       *
071900******************************************************************
072000 SIMPLE-PERFORM-TEST.
072100     PERFORM LOOP-ROUTINE.
072200     IF RESULT-FLAG IS NOT EQUAL TO 1
072300         MOVE "USE PROCEDURE NOT EXECUTED" TO RE-MARK
072400         PERFORM FAIL
072500         GO TO SIMPLE-PERFORM-WRITE.
072600     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
072700     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
072800     MOVE DBLINE-HOLD TO COMPUTED-A.
072900     PERFORM INSPT.
073000     PERFORM SIMPLE-PERFORM-WRITE.
073100     MOVE DBNAME-HOLD TO SIZE-12.
073200     IF SIZE-12 IS EQUAL TO "LOOP-ROUTINE"
073300         PERFORM PASS   ELSE
073400         MOVE "LOOP-ROUTINE" TO CORRECT-A
073500         MOVE DBNAME-HOLD TO COMPUTED-A
073600         PERFORM FAIL.
073700     MOVE "DEBUG-NAME" TO RE-MARK.
073800     PERFORM SIMPLE-PERFORM-WRITE.
073900     MOVE DBCONT-HOLD TO SIZE-12.
074000     IF SIZE-12 IS EQUAL TO "PERFORM LOOP"
074100         PERFORM PASS   ELSE
074200         MOVE "PERFORM LOOP" TO CORRECT-A
074300         MOVE DBCONT-HOLD TO COMPUTED-A
074400         PERFORM FAIL.
074500     MOVE "DEBUG-CONTENTS" TO RE-MARK.
074600     GO TO SIMPLE-PERFORM-WRITE.
074700 SIMPLE-PERFORM-DELETE.
074800     PERFORM DE-LETE.
074900 SIMPLE-PERFORM-WRITE.
075000     MOVE "SIMPLE-PERFORM-TEST" TO PAR-NAME.
075100     MOVE "DEBUG ON PROC-NAME" TO FEATURE.
075200     PERFORM PRINT-DETAIL.
075300     MOVE 0 TO RESULT-FLAG.
075400 DEBUG-LINE-TESTS-INIT.
075500     MOVE "DEBUG LINE TESTS" TO FEATURE.
075600 DEBUG-LINE-TEST-01.
075700     MOVE "COMPLETE ENTITY" TO RE-MARK.
075800     PERFORM FAIL.
075900D    PERFORM PASS  SUBTRACT 1 FROM ERROR-COUNTER.
076000     GO TO DEBUG-LINE-WRITE-01.
076100 DEBUG-LINE-DELETE-01.
076200     PERFORM DE-LETE.
076300 DEBUG-LINE-WRITE-01.
076400     MOVE "DEBUG-LINE-TEST-01" TO PAR-NAME.
076500     PERFORM PRINT-DETAIL.
076600 DEBUG-LINE-TEST-02.
076700     MOVE "CONSECUTIVE DEBUG LINES" TO RE-MARK.
076800     PERFORM FAIL.
076900D    PERFORM PASS.
077000D    SUBTRACT 1 FROM ERROR-COUNTER.
077100     GO TO DEBUG-LINE-WRITE-02.
077200 DEBUG-LINE-DELETE-02.
077300     PERFORM DE-LETE.
077400 DEBUG-LINE-WRITE-02.
077500     MOVE "DEBUG-LINE-TEST-02" TO PAR-NAME.
077600     PERFORM PRINT-DETAIL.
077700 DEBUG-LINE-TEST-03.
077800     MOVE "BROKEN STATEMENTS" TO RE-MARK.
077900     PERFORM
078000D        PASS.  GO TO DEBUG-LINE-WRITE-03.
078100DDEBUG-LINE-TEST-03-A.    PERFORM
078200                             FAIL.
078300                             GO TO DEBUG-LINE-WRITE-03.
078400 DEBUG-LINE-DELETE-03.
078500     PERFORM DE-LETE.
078600 DEBUG-LINE-WRITE-03.
078700     MOVE "DEBUG-LINE-TEST-03" TO PAR-NAME.
078800     PERFORM PRINT-DETAIL.
078900 DEBUG-LINE-TEST-04.
079000     MOVE "NESTED COMMENTS" TO RE-MARK.
079100D    PERFORM
079200*        FAIL.  GO TO DEBUG-LINE-WRITE-04.
079300*DEBUG-LINE-TEST-04-A.    PERFORM
079400D                         PASS.  GO TO DEBUG-LINE-WRITE-04.
079500 DEBUG-LINE-TEST-04-B.
079600     MOVE "    FAILURE 04B" TO COMPUTED-A.
079700     PERFORM FAIL.
079800     GO TO DEBUG-LINE-WRITE-04.
079900 DEBUG-LINE-DELETE-04.
080000     PERFORM DE-LETE.
080100 DEBUG-LINE-WRITE-04.
080200     MOVE "DEBUG-LINE-TEST-04" TO PAR-NAME.
080300     PERFORM PRINT-DETAIL.
080400 DEBUG-LINE-TEST-05.
080500     MOVE "NESTED INSIDE COMMENTS" TO RE-MARK.
080600*    PERFORM FAIL.
080700*    GO TO DEBUG-LINE-WRITE-05.
080800*DEBUG-LINE-TEST-05-A.
080900D    PERFORM PASS.
081000D    GO TO DEBUG-LINE-WRITE-05.
081100*DEBUG-LINE-TEST-05-B.
081200*    MOVE "    FAILURE 05B" TO COMPUTED-A.
081300*    PERFORM FAIL.  GO TO DEBUG-LINE-WRITE-05.
081400 DEBUG-LINE-TEST-05-C.
081500     MOVE "    FAILURE 05C" TO COMPUTED-A.
081600     PERFORM FAIL.   GO TO DEBUG-LINE-WRITE-05.
081700 DEBUG-LINE-DELETE-05.
081800     PERFORM DE-LETE.
081900 DEBUG-LINE-WRITE-05.
082000     MOVE "DEBUG-LINE-TEST-05" TO PAR-NAME.
082100     PERFORM PRINT-DETAIL.
082200 CCVS-EXIT SECTION.
082300 CCVS-999999.
082400     GO TO CLOSE-FILES.
