000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     DB105A.
000400 AUTHOR.
000500     FEDERAL COMPILER TESTING CENTER.
000600 INSTALLATION.
000700     GENERAL SERVICES ADMINISTRATION
000800     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.
000900     SOFTWARE DEVELOPMENT OFFICE.
001000     5203 LEESBURG PIKE  SUITE 1100
001100     FALLS CHURCH VIRGINIA 22041.
001200
001300     PHONE   (703) 756-6153
001400
001500     " HIGH       ".
001600 DATE-WRITTEN.
001700     CCVS-74 VERSION 4.0 - 1980 JULY 1.
001800     CREATION DATE     /    VALIDATION DATE
001900     "4.2 ".
002000 SECURITY.
002100     NONE.
002200*
002300*    *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *
002400*
002500*                       PROGRAM ABSTRACT
002600*
002700*    DB105A TESTS THE CAPABILITY OF THE DEBUG MODULE TO MONITOR
002800*    ALL PROCEDURES WITH A SINGLE DEBUGGING DECLARATIVE.  THIS
002900*    PROGRAM IS TO BE COMPILED AND EXECUTED WITH BOTH COMPILE
003000*    AND OBJECT TIME DEBUGGING SWITCHES ON.  THE DEBUGGING
003100*    PROCEDURE SHOULD BE INCLUDED IN THE COMPILATION AND
003200*    GENERATE CODE.  DURING EXECUTION, EACH PROCEDURE SHOULD
003300*    TRIGGER THE DEBUGGING PROCEDURE WHICH SHOULD STACK THE
003400*    NAME OF THE PROCEDURE CALLING IT.  PRIOR TO BEING STACKED,
003500*    EACH NAME IS POTENTIALLY ADJUSTED BY MODIFYING A FIXED-
003600*    LOCATION NUMERIC SUBFIELD IN THE NAME.  THE CONSEQUENCE IS
003700*    THAT IF THE PROGRAM EXECUTES PROPERLY, THE NAMES THAT ARE
003800*    STACKED WILL BE UNIQUE AND IN AN INCREMENTING SEQUENCE IN
003900*    THE NUMERIC SUBFIELD.  NEAR THE END OF THE PROGRAM, THE
004000*    STACKING FUNCTION IS DISABLED AND THE NAME STACK IS COMPARED
004100*    TO A STATIC TABLE CONTAINING PROCEDURE-NAMES IN THE ORDER
004200*    IN WHICH THE PROCEDURES SHOULD HAVE STACKED.
004300*
004400*   DB105A"S REPORT DIFFERS SLIGHTLY FROM THE NOMINAL CCVS FORMAT.
004500*    IF EXECUTION IS PERFECT, THE REPORT WILL CONSIST OF 227
004600*    LINES SHOWING
004700*
004800*        (A)  PROGRAM PROCEDURE NAME, AS IT APPEARS IN THE
004900*             PROGRAM.
005000*        (B)  ADJUSTED PROCEDURE NAME, AFTER ITS NUMERIC SUBFIELD
005100*             HAS BEEN ADJUSTED.
005200*        (C)  ADJUSTED DEBUG-NAME, THAT WAS STACKED BY THE
005300*             DEBUGGING PROCEDURE.
005400*
005500*    NOMINALLY, THE NUMERIC SUBFIELDS OF THE PROCEDURE NAMES
005600*    SHOULD APPEAR IN ASCENDING SEQUENCE.  ANY DEVIATIONS IN THE
005700*    STACKING SEQUENCE FROM THE EXPECTED SEQUENCE WILL CAUSE
005800*    ADDITIONAL REPORT LINES TO BE GENERATED WITH ONE OR MORE
005900*    COLUMNS BLANK.  IF NOTHING EVER APPEARS IN THE "ADJUSTED
006000*    DEBUG-NAME" COLUMN, IT MAY BE ASSUMED THAT THE DEBUGGING
006100*    PROCEDURE WAS NEVER EXECUTED.
006200*
006300*    IT IS A FUNDAMENTAL ASSUMPTION OF DB105A THAT WHEN A SECTION
006400*    IS ENTERED, THE DEBUGGING SECTION WILL BE CALLED TWICE, ONCE
006500*    FOR THE SECTION NAME AND ONCE FOR THE PARAGRAPH NAME THAT
006600*    IMMEDIATELY FOLLOWS THE SECTION NAME.  ADDITIONALLY, DB105A
006700*    TRAPS ANY FAILURES IN PROGRAM FLOW CAUSED BY A FAILURE OF
006800*    VERBS FROM THE NUCLEUS MODULE.  THESE FAILURES ARE SUMMED
006900*    AND REPORTED AT THE BOTTOM OF DB105A"S REPORT.  IF ANY
007000*    PROCEDURE NAMES BEGINNING WITH "PROC-000" APPEAR IN THE
007100*    "ADJUSTED DEBUG-NAME" COLUMN OF THE REPORT, THESE RESULT
007200*    FROM EXECUTION OF PROCEDURES WHICH SHOULD NOT HAVE BEEN
007300*    EXECUTED IF THE PROGRAM HAD FOLLOWED THE PROPER CONTROL FLOW
007400*    SEQUENCE.
007500*
007600*
007700*
007800 ENVIRONMENT DIVISION.
007900 CONFIGURATION SECTION.
008000 SOURCE-COMPUTER.
008100     XXXXX082
008200     WITH DEBUGGING MODE.
008300 OBJECT-COMPUTER.
008400     XXXXX083.
008500 INPUT-OUTPUT SECTION.
008600 FILE-CONTROL.
008700     SELECT PRINT-FILE ASSIGN TO
008800     XXXXX055.
008900 DATA DIVISION.
009000 FILE SECTION.
009100 FD  PRINT-FILE
009200     LABEL RECORDS
009300     XXXXX084
009400     DATA RECORD IS PRINT-REC DUMMY-RECORD.
009500 01  PRINT-REC PICTURE X(120).
009600 01  DUMMY-RECORD PICTURE X(120).
009700 WORKING-STORAGE SECTION.
009800 77  ATWO-DS-01V00                PICTURE S9
009900                                  VALUE 2.
010000 77  P-COUNT                      PICTURE 9(6).
010100 77  THREE                              PICTURE IS 9 VALUE IS 3.
010200 77  XRAY                               PICTURE IS X.
010300 77  ALTERLOOP                          PICTURE IS 9 VALUE IS
010400     ZERO.
010500 77  BYPASS PICTURE IS 9 VALUE IS 1.
010600 77  STACK-END PICTURE IS 999 COMPUTATIONAL.
010700 77  INCREMENT PICTURE IS 99.
010800 77  PROC-ACTIVE PICTURE IS 9 VALUE IS 1.
010900 01  PROCEDURE-NAMES.
011000     02  FILLER PIC X(25) VALUE "PROC-001-BEGIN-TESTS     ".
011100     02  FILLER PIC X(25) VALUE "PROC-002-GO--TEST-1      ".
011200     02  FILLER PIC X(25) VALUE "PROC-003-GO--WRITE-1     ".
011300     02  FILLER PIC X(25) VALUE "PROC-004-GO--INIT-2      ".
011400     02  FILLER PIC X(25) VALUE "PROC-005-GO--TEST-2      ".
011500     02  FILLER PIC X(25) VALUE "PROC-005-GO--A           ".
011600     02  FILLER PIC X(25) VALUE "PROC-005-GO--TEST-2      ".
011700     02  FILLER PIC X(25) VALUE "PROC-005-GO--B           ".
011800     02  FILLER PIC X(25) VALUE "PROC-005-GO--TEST-2      ".
011900     02  FILLER PIC X(25) VALUE "PROC-005-GO--C           ".
012000     02  FILLER PIC X(25) VALUE "PROC-005-GO--TEST-2      ".
012100     02  FILLER PIC X(25) VALUE "PROC-005-GO--D           ".
012200     02  FILLER PIC X(25) VALUE "PROC-005-GO--TEST-2      ".
012300     02  FILLER PIC X(25) VALUE "PROC-005-GO--A           ".
012400     02  FILLER PIC X(25) VALUE "PROC-005-GO--E           ".
012500     02  FILLER PIC X(25) VALUE "PROC-016-GO--WRITE-2     ".
012600     02  FILLER PIC X(25) VALUE "PROC-017-GO--TEST-3      ".
012700     02  FILLER PIC X(25) VALUE "PROC-018-GO--PASS-3      ".
012800     02  FILLER PIC X(25) VALUE "PROC-019-GO--WRITE-3     ".
012900     02  FILLER PIC X(25) VALUE "PROC-020-GO--TEST-4      ".
013000     02  FILLER PIC X(25) VALUE "PROC-021-GO--PASS-4      ".
013100     02  FILLER PIC X(25) VALUE "PROC-022-GO--PAS-4       ".
013200     02  FILLER PIC X(25) VALUE "PROC-023-GO--WRITE-4     ".
013300     02  FILLER PIC X(25) VALUE "PROC-024-ALTER-INIT      ".
013400     02  FILLER PIC X(25) VALUE "PROC-025-ALTER-TEST-1    ".
013500     02  FILLER PIC X(25) VALUE "PROC-026-ALTER-A         ".
013600     02  FILLER PIC X(25) VALUE "PROC-026-ALTER-A         ".
013700     02  FILLER PIC X(25) VALUE "PROC-027-ALTER-C         ".
013800     02  FILLER PIC X(25) VALUE "PROC-028-ALTER-WRITE-1   ".
013900     02  FILLER PIC X(25) VALUE "PROC-030-ALTER-TEST-3    ".
014000     02  FILLER PIC X(25) VALUE "PROC-031-ALTER-G         ".
014100     02  FILLER PIC X(25) VALUE "PROC-031-ALTER-G         ".
014200     02  FILLER PIC X(25) VALUE "PROC-032-ALTER-I         ".
014300     02  FILLER PIC X(25) VALUE "PROC-031-ALTER-G         ".
014400     02  FILLER PIC X(25) VALUE "PROC-031-ALTER-G         ".
014500     02  FILLER PIC X(25) VALUE "PROC-032-ALTER-WRITE-3   ".
014600     02  FILLER PIC X(25) VALUE "PROC-037-EXIT-TEST-1     ".
014700     02  FILLER PIC X(25) VALUE "PROC-038-EXIT-CHECK-1    ".
014800     02  FILLER PIC X(25) VALUE "PROC-039-EXIT-WRITE-1    ".
014900     02  FILLER PIC X(25) VALUE "PROC-040-PFM-TEST-1      ".
015000     02  FILLER PIC X(25) VALUE "PROC-041-PFM-A           ".
015100     02  FILLER PIC X(25) VALUE "PROC-042-PFM-WRITE-1     ".
015200     02  FILLER PIC X(25) VALUE "PROC-043-PFM-TEST-2      ".
015300     02  FILLER PIC X(25) VALUE "PROC-041-PFM-A           ".
015400     02  FILLER PIC X(25) VALUE "PROC-045-PFM-B           ".
015500     02  FILLER PIC X(25) VALUE "PROC-046-PFM-WRITE-2     ".
015600     02  FILLER PIC X(25) VALUE "PROC-047-PFM-TEST-3      ".
015700     02  FILLER PIC X(25) VALUE "PROC-048-PFM-C           ".
015800     02  FILLER PIC X(25) VALUE "PROC-048-PFM-C           ".
015900     02  FILLER PIC X(25) VALUE "PROC-048-PFM-C           ".
016000     02  FILLER PIC X(25) VALUE "PROC-048-PFM-C           ".
016100     02  FILLER PIC X(25) VALUE "PROC-048-PFM-C           ".
016200     02  FILLER PIC X(25) VALUE "PROC-048-PFM-C           ".
016300     02  FILLER PIC X(25) VALUE "PROC-048-PFM-WRITE-3     ".
016400     02  FILLER PIC X(25) VALUE "PROC-055-PFM-TEST-4      ".
016500     02  FILLER PIC X(25) VALUE "PROC-056-PFM-E           ".
016600     02  FILLER PIC X(25) VALUE "PROC-057-PFM-F           ".
016700     02  FILLER PIC X(25) VALUE "PROC-058-PFM-G           ".
016800     02  FILLER PIC X(25) VALUE "PROC-059-PFM-H           ".
016900     02  FILLER PIC X(25) VALUE "PROC-060-PFM-WRITE-4     ".
017000     02  FILLER PIC X(25) VALUE "PROC-061-PFM-TEST-5      ".
017100     02  FILLER PIC X(25) VALUE "PROC-062-PFM-J           ".
017200     02  FILLER PIC X(25) VALUE "PROC-063-PFM-L           ".
017300     02  FILLER PIC X(25) VALUE "PROC-064-PFM-WRITE-5     ".
017400     02  FILLER PIC X(25) VALUE "PROC-065-PFM-TEST-6      ".
017500     02  FILLER PIC X(25) VALUE "PROC-066-PFM-N           ".
017600     02  FILLER PIC X(25) VALUE "PROC-067-PFM-O           ".
017700     02  FILLER PIC X(25) VALUE "PROC-068-PFM-P           ".
017800     02  FILLER PIC X(25) VALUE "PROC-069-PFM-WRITE-6     ".
017900     02  FILLER PIC X(25) VALUE "PROC-070-PFM-TEST-7      ".
018000     02  FILLER PIC X(25) VALUE "PROC-071-PFM-V           ".
018100     02  FILLER PIC X(25) VALUE "PROC-072-PFM-W           ".
018200     02  FILLER PIC X(25) VALUE "PROC-073-PFM-X           ".
018300     02  FILLER PIC X(25) VALUE "PROC-074-PFM-Y           ".
018400     02  FILLER PIC X(25) VALUE "PROC-075-PFM-Z           ".
018500     02  FILLER PIC X(25) VALUE "PROC-071-PFM-V           ".
018600     02  FILLER PIC X(25) VALUE "PROC-072-PFM-W           ".
018700     02  FILLER PIC X(25) VALUE "PROC-073-PFM-X           ".
018800     02  FILLER PIC X(25) VALUE "PROC-074-PFM-Y           ".
018900     02  FILLER PIC X(25) VALUE "PROC-075-PFM-Z           ".
019000     02  FILLER PIC X(25) VALUE "PROC-071-PFM-V           ".
019100     02  FILLER PIC X(25) VALUE "PROC-072-PFM-W           ".
019200     02  FILLER PIC X(25) VALUE "PROC-073-PFM-X           ".
019300     02  FILLER PIC X(25) VALUE "PROC-074-PFM-Y           ".
019400     02  FILLER PIC X(25) VALUE "PROC-075-PFM-Z           ".
019500     02  FILLER PIC X(25) VALUE "PROC-071-PFM-V           ".
019600     02  FILLER PIC X(25) VALUE "PROC-072-PFM-W           ".
019700     02  FILLER PIC X(25) VALUE "PROC-073-PFM-X           ".
019800     02  FILLER PIC X(25) VALUE "PROC-074-PFM-Y           ".
019900     02  FILLER PIC X(25) VALUE "PROC-075-PFM-Z           ".
020000     02  FILLER PIC X(25) VALUE "PROC-071-PFM-V           ".
020100     02  FILLER PIC X(25) VALUE "PROC-072-PFM-W           ".
020200     02  FILLER PIC X(25) VALUE "PROC-073-PFM-X           ".
020300     02  FILLER PIC X(25) VALUE "PROC-074-PFM-Y           ".
020400     02  FILLER PIC X(25) VALUE "PROC-075-PFM-Z           ".
020500     02  FILLER PIC X(25) VALUE "PROC-096-PFM-WRITE-7     ".
020600     02  FILLER PIC X(25) VALUE "PROC-097-PFM-TEST-08     ".
020700     02  FILLER PIC X(25) VALUE "PROC-098-PFM-B-8         ".
020800     02  FILLER PIC X(25) VALUE "PROC-097-PFM-A-8         ".
020900     02  FILLER PIC X(25) VALUE "PROC-098-PFM-B-8         ".
021000     02  FILLER PIC X(25) VALUE "PROC-097-PFM-A-8         ".
021100     02  FILLER PIC X(25) VALUE "PROC-098-PFM-B-8         ".
021200     02  FILLER PIC X(25) VALUE "PROC-097-PFM-TESTT-8     ".
021300     02  FILLER PIC X(25) VALUE "PROC-098-PFM-TESTTT-8    ".
021400     02  FILLER PIC X(25) VALUE "PROC-105-PFM-WRITE-08    ".
021500     02  FILLER PIC X(25) VALUE "PROC-106-PFM-TEST-09     ".
021600     02  FILLER PIC X(25) VALUE "PROC-107-PFM-B-9         ".
021700     02  FILLER PIC X(25) VALUE "PROC-106-PFM-A-9         ".
021800     02  FILLER PIC X(25) VALUE "PROC-107-PFM-B-9         ".
021900     02  FILLER PIC X(25) VALUE "PROC-106-PFM-A-9         ".
022000     02  FILLER PIC X(25) VALUE "PROC-107-PFM-B-9         ".
022100     02  FILLER PIC X(25) VALUE "PROC-106-PFM-A-9         ".
022200     02  FILLER PIC X(25) VALUE "PROC-107-PFM-B-9         ".
022300     02  FILLER PIC X(25) VALUE "PROC-106-PFM-TESTT-9     ".
022400     02  FILLER PIC X(25) VALUE "PROC-107-PFM-TESTTT-9    ".
022500     02  FILLER PIC X(25) VALUE "PROC-116-PFM-WRITE-09    ".
022600     02  FILLER PIC X(25) VALUE "PROC-117-PFM-TEST-10     ".
022700     02  FILLER PIC X(25) VALUE "PROC-118-PFM-B-10        ".
022800     02  FILLER PIC X(25) VALUE "PROC-119-PFM-C-10        ".
022900     02  FILLER PIC X(25) VALUE "PROC-120-PFM-D-10        ".
023000     02  FILLER PIC X(25) VALUE "PROC-117-PFM-A-10        ".
023100     02  FILLER PIC X(25) VALUE "PROC-118-PFM-B-10        ".
023200     02  FILLER PIC X(25) VALUE "PROC-119-PFM-C-10        ".
023300     02  FILLER PIC X(25) VALUE "PROC-120-PFM-D-10        ".
023400     02  FILLER PIC X(25) VALUE "PROC-117-PFM-A-10        ".
023500     02  FILLER PIC X(25) VALUE "PROC-118-PFM-B-10        ".
023600     02  FILLER PIC X(25) VALUE "PROC-119-PFM-C-10        ".
023700     02  FILLER PIC X(25) VALUE "PROC-120-PFM-D-10        ".
023800     02  FILLER PIC X(25) VALUE "PROC-118-PFM-B-10        ".
023900     02  FILLER PIC X(25) VALUE "PROC-119-PFM-C-10        ".
024000     02  FILLER PIC X(25) VALUE "PROC-120-PFM-D-10        ".
024100     02  FILLER PIC X(25) VALUE "PROC-117-PFM-A-10        ".
024200     02  FILLER PIC X(25) VALUE "PROC-118-PFM-B-10        ".
024300     02  FILLER PIC X(25) VALUE "PROC-119-PFM-C-10        ".
024400     02  FILLER PIC X(25) VALUE "PROC-120-PFM-D-10        ".
024500     02  FILLER PIC X(25) VALUE "PROC-121-PFM-TESTT-10    ".
024600     02  FILLER PIC X(25) VALUE "PROC-122-PFM-TESTTT-10   ".
024700     02  FILLER PIC X(25) VALUE "PROC-138-PFM-WRITE-10    ".
024800     02  FILLER PIC X(25) VALUE "PROC-139-PFM-TEST-11     ".
024900     02  FILLER PIC X(25) VALUE "PROC-140-PFM-B-11        ".
025000     02  FILLER PIC X(25) VALUE "PROC-139-PFM-C-11        ".
025100     02  FILLER PIC X(25) VALUE "PROC-140-PFM-D-11        ".
025200     02  FILLER PIC X(25) VALUE "PROC-139-PFM-A-11        ".
025300     02  FILLER PIC X(25) VALUE "PROC-140-PFM-B-11        ".
025400     02  FILLER PIC X(25) VALUE "PROC-139-PFM-C-11        ".
025500     02  FILLER PIC X(25) VALUE "PROC-140-PFM-D-11        ".
025600     02  FILLER PIC X(25) VALUE "PROC-139-PFM-A-11        ".
025700     02  FILLER PIC X(25) VALUE "PROC-140-PFM-B-11        ".
025800     02  FILLER PIC X(25) VALUE "PROC-139-PFM-C-11        ".
025900     02  FILLER PIC X(25) VALUE "PROC-140-PFM-D-11        ".
026000     02  FILLER PIC X(25) VALUE "PROC-139-PFM-A-11        ".
026100     02  FILLER PIC X(25) VALUE "PROC-140-PFM-B-11        ".
026200     02  FILLER PIC X(25) VALUE "PROC-139-PFM-C-11        ".
026300     02  FILLER PIC X(25) VALUE "PROC-140-PFM-D-11        ".
026400     02  FILLER PIC X(25) VALUE "PROC-139-PFM-A-11        ".
026500     02  FILLER PIC X(25) VALUE "PROC-140-PFM-B-11        ".
026600     02  FILLER PIC X(25) VALUE "PROC-139-PFM-C-11        ".
026700     02  FILLER PIC X(25) VALUE "PROC-140-PFM-D-11        ".
026800     02  FILLER PIC X(25) VALUE "PROC-140-PFM-B-11        ".
026900     02  FILLER PIC X(25) VALUE "PROC-139-PFM-C-11        ".
027000     02  FILLER PIC X(25) VALUE "PROC-140-PFM-D-11        ".
027100     02  FILLER PIC X(25) VALUE "PROC-139-PFM-A-11        ".
027200     02  FILLER PIC X(25) VALUE "PROC-140-PFM-B-11        ".
027300     02  FILLER PIC X(25) VALUE "PROC-139-PFM-C-11        ".
027400     02  FILLER PIC X(25) VALUE "PROC-140-PFM-D-11        ".
027500     02  FILLER PIC X(25) VALUE "PROC-139-PFM-TESTT-11    ".
027600     02  FILLER PIC X(25) VALUE "PROC-140-PFM-TESTTT-11   ".
027700     02  FILLER PIC X(25) VALUE "PROC-168-PFM-WRITE-11    ".
027800     02  FILLER PIC X(25) VALUE "PROC-169-PFM-TEST-12     ".
027900     02  FILLER PIC X(25) VALUE "PROC-170-PFM-A-12        ".
028000     02  FILLER PIC X(25) VALUE "PROC-171-PFM-B-12        ".
028100     02  FILLER PIC X(25) VALUE "PROC-172-PFM-C-12        ".
028200     02  FILLER PIC X(25) VALUE "PROC-173-PFM-D-12        ".
028300     02  FILLER PIC X(25) VALUE "PROC-174-PFM-E-12        ".
028400     02  FILLER PIC X(25) VALUE "PROC-175-PFM-TESTT-12    ".
028500     02  FILLER PIC X(25) VALUE "PROC-176-PFM-WRITE-12    ".
028600     02  FILLER PIC X(25) VALUE "PROC-177-PFM-TEST-13     ".
028700     02  FILLER PIC X(25) VALUE "PROC-178-PFM-A-13        ".
028800     02  FILLER PIC X(25) VALUE "PROC-177-PFM-B-13        ".
028900     02  FILLER PIC X(25) VALUE "PROC-178-PFM-A-13        ".
029000     02  FILLER PIC X(25) VALUE "PROC-177-PFM-B-13        ".
029100     02  FILLER PIC X(25) VALUE "PROC-178-PFM-A-13        ".
029200     02  FILLER PIC X(25) VALUE "PROC-177-PFM-B-13        ".
029300     02  FILLER PIC X(25) VALUE "PROC-178-PFM-A-13        ".
029400     02  FILLER PIC X(25) VALUE "PROC-177-PFM-B-13        ".
029500     02  FILLER PIC X(25) VALUE "PROC-178-PFM-TESTT-13    ".
029600     02  FILLER PIC X(25) VALUE "PROC-187-PFM-WRITE-13    ".
029700     02  FILLER PIC X(25) VALUE "PROC-188-PFM-TEST-14     ".
029800     02  FILLER PIC X(25) VALUE "PROC-189-A101            ".
029900     02  FILLER PIC X(25) VALUE "PROC-190-A102            ".
030000     02  FILLER PIC X(25) VALUE "PROC-191-A103            ".
030100     02  FILLER PIC X(25) VALUE "PROC-192-A104            ".
030200     02  FILLER PIC X(25) VALUE "PROC-193-A105            ".
030300     02  FILLER PIC X(25) VALUE "PROC-194-A106            ".
030400     02  FILLER PIC X(25) VALUE "PROC-195-A107            ".
030500     02  FILLER PIC X(25) VALUE "PROC-196-A108            ".
030600     02  FILLER PIC X(25) VALUE "PROC-197-A109            ".
030700     02  FILLER PIC X(25) VALUE "PROC-198-A110            ".
030800     02  FILLER PIC X(25) VALUE "PROC-199-A111            ".
030900     02  FILLER PIC X(25) VALUE "PROC-200-A112            ".
031000     02  FILLER PIC X(25) VALUE "PROC-201-A113            ".
031100     02  FILLER PIC X(25) VALUE "PROC-202-A114            ".
031200     02  FILLER PIC X(25) VALUE "PROC-203-A115            ".
031300     02  FILLER PIC X(25) VALUE "PROC-204-A116            ".
031400     02  FILLER PIC X(25) VALUE "PROC-205-A117            ".
031500     02  FILLER PIC X(25) VALUE "PROC-206-A118            ".
031600     02  FILLER PIC X(25) VALUE "PROC-207-A119            ".
031700     02  FILLER PIC X(25) VALUE "PROC-208-A120            ".
031800     02  FILLER PIC X(25) VALUE "PROC-209-A121            ".
031900     02  FILLER PIC X(25) VALUE "PROC-210-PFM-WRITE-14    ".
032000     02  FILLER PIC X(25) VALUE "PROC-211-PFM-A-15        ".
032100     02  FILLER PIC X(25) VALUE "PROC-212-PFM-TEST-15     ".
032200     02  FILLER PIC X(25) VALUE "PROC-213-PFM-G-15        ".
032300     02  FILLER PIC X(25) VALUE "PROC-214-PFM-H-15        ".
032400     02  FILLER PIC X(25) VALUE "PROC-215-PFM-E-15        ".
032500     02  FILLER PIC X(25) VALUE "PROC-216-PFM-L-15        ".
032600     02  FILLER PIC X(25) VALUE "PROC-217-PFM-B-15        ".
032700     02  FILLER PIC X(25) VALUE "PROC-218-PFM-WRITE-15    ".
032800     02  FILLER PIC X(25) VALUE "PROC-219-PFM-TEST-LAST   ".
032900     02  FILLER PIC X(25) VALUE "PROC-220-PFM-U           ".
033000     02  FILLER PIC X(25) VALUE "PROC-220-PFM-U           ".
033100     02  FILLER PIC X(25) VALUE "PROC-220-PFM-U           ".
033200     02  FILLER PIC X(25) VALUE "PROC-220-PFM-U           ".
033300     02  FILLER PIC X(25) VALUE "PROC-220-PFM-U           ".
033400     02  FILLER PIC X(25) VALUE "PROC-220-PFM-U           ".
033500     02  FILLER PIC X(25) VALUE "PROC-220-PFM-U           ".
033600     02  FILLER PIC X(25) VALUE "PROC-227-PFM-WRITE-LAST  ".
033700 01  STATIC-TABLE REDEFINES PROCEDURE-NAMES.
033800     02  EXPECTED-NAME OCCURS 227 TIMES INDEXED BY STATIC-INDEX
033900         PICTURE IS X(25).
034000 01  STACKING-AREA.
034100     02  PROC-NAME OCCURS 500 TIMES INDEXED BY STACK-INDEX.
034200         03  PROC-LOC PICTURE IS X(4).
034300         03  FILLER PICTURE IS X.
034400         03  BASE-NUMBER PICTURE IS 999.
034500         03  FILLER PICTURE IS X.
034600         03  BASE-NAME PICTURE IS X(16).
034700 01  TABLE-ENTRY.
034800     02  FILLER PICTURE IS X(5).
034900     02  TABLE-ENTRY-BASE PICTURE IS 999.
035000     02  FILLER PICTURE IS X(17).
035100 01  FLOW-FAILURE-1.
035200     02  FILLER PICTURE IS X VALUE IS SPACE.
035300     02  FILLER PICTURE IS X(43) VALUE
035400         "COUNT OF LEVEL 1 NUCLEUS FLOW FAILURES WAS ".
035500     02  NUC-FAILURE-COUNT PICTURE IS 999 VALUE 0.
035600     02  FILLER PICTURE X VALUE ".".
035700 01  FLOW-FAILURE-2 PICTURE IS X(75) VALUE IS
035800         " A NON-ZERO COUNT WILL CAUSE FAILURES TO APPEAR IN THE A
035900-        "BOVE REPORT.".
036000 01  NOTE-RECORD.
036100     02 A     PICTURE X VALUE SPACE.
036200     02 B     PICTURE X VALUE SPACE.
036300     02 C     PICTURE X VALUE SPACE.
036400     02 D     PICTURE X VALUE SPACE.
036500     02 E     PICTURE X VALUE SPACE.
036600     02 F     PICTURE X VALUE SPACE.
036700     02 G     PICTURE X VALUE SPACE.
036800     02 H     PICTURE X VALUE SPACE.
036900     02 I     PICTURE X VALUE SPACE.
037000     02 J     PICTURE X VALUE SPACE.
037100     02 K     PICTURE X VALUE SPACE.
037200     02 L     PICTURE X VALUE SPACE.
037300     02 M     PICTURE X VALUE SPACE.
037400     02 N     PICTURE X VALUE SPACE.
037500     02 O     PICTURE X VALUE SPACE.
037600     02 P     PICTURE X VALUE SPACE.
037700 01  GO-TABLE.
037800     02 GO-SCRIPT OCCURS 8 TIMES PICTURE 9.
037900 01  GO-TO-DEPEND                       PICTURE IS 9 VALUE IS 0.
038000 01  GO-TO-DEEP                         PICTURE IS 9 VALUE IS 1.
038100 01  PERFORM1                           PICTURE IS XXX
038200     VALUE IS SPACE.
038300 01  PERFORM2                           PICTURE IS S999
038400     VALUE IS 20.
038500 01  PERFORM4                           PICTURE IS S99V9.
038600 01  PERFORM5                           PICTURE IS 999
038700     VALUE IS ZERO.
038800 01  PERFORM-KEY                        PICTURE IS 9.
038900 01  PERFORM-HOLD.
039000     02  TEST-LETTER OCCURS 20 TIMES  PICTURE X.
039100 01  TEST-RESULTS.
039200     02 FILLER                    PICTURE X VALUE SPACE.
039300     02 FEATURE                   PICTURE X(20).
039400     02 FILLER                    PICTURE XX VALUE SPACE.
039500     02 P-OR-F                    PICTURE X(5).
039600     02 FILLER                    PICTURE XX  VALUE SPACE.
039700     02  PAR-NAME.
039800       03 FILLER PICTURE X(12).
039900       03  PARDOT-X PICTURE X.
040000       03 DOTVALUE PICTURE 99.
040100       03 FILLER PICTURE IS X(10).
040200     02 FILLER                    PICTURE X VALUE SPACE.
040300     02  CORRECT-A  PICTURE IS X(25).
040400     02  CORRECT-NFIELD REDEFINES CORRECT-A.
040500         03  CORRECT-N  PICTURE -9(9).9(9).
040600         03  FILLER PICTURE X(5).
040700     02 FILLER                    PICTURE XX VALUE SPACE.
040800     02  COMPUTED-A PICTURE IS X(25).
040900     02  COMPUTED-NFIELD REDEFINES COMPUTED-A.
041000         03  COMPUTED-N PICTURE -9(9).9(9).
041100         03  FILLER PICTURE X(5).
041200     02  RE-MARK PICTURE IS XXX.
041300 01  COLUMNS-LINE-1.
041400     02 PAGE-CONTROL-C PICTURE IS X VALUE IS SPACE.
041500     02  FILLER PICTURE IS X(7) VALUE IS SPACE.
041600     02  FILLER PICTURE IS X(7) VALUE IS "FEATURE".
041700     02  FILLER PICTURE IS X(9) VALUE IS SPACE.
041800     02  FILLER PICTURE IS X(4) VALUE IS "PASS".
041900     02  FILLER PICTURE IS X(10) VALUE IS SPACE.
042000     02  FILLER PICTURE IS X(7)  VALUE IS "PROGRAM".
042100     02  FILLER PICTURE IS X(19) VALUE IS SPACE.
042200     02  FILLER PICTURE IS X(8)  VALUE IS "ADJUSTED".
042300     02  FILLER PICTURE IS X(18) VALUE IS SPACE.
042400     02  FILLER PICTURE IS X(8)  VALUE IS "ADJUSTED".
042500 01  COLUMNS-LINE-2.
042600     02 FILLER PICTURE IS X VALUE IS SPACE.
042700     02  FILLER PICTURE IS X(7) VALUE IS SPACE.
042800     02  FILLER PICTURE IS X(6)  VALUE IS "TESTED".
042900     02  FILLER PICTURE IS X(10) VALUE IS SPACE.
043000     02  FILLER PICTURE IS X(4)  VALUE IS "FAIL".
043100     02  FILLER PICTURE IS X(7)  VALUE IS SPACE.
043200     02  FILLER PICTURE IS X(14) VALUE IS "PROCEDURE NAME".
043300     02  FILLER PICTURE IS X(12) VALUE IS SPACE.
043400     02  FILLER PICTURE IS X(14) VALUE IS "PROCEDURE NAME".
043500     02  FILLER PICTURE IS X(14) VALUE IS SPACE.
043600     02  FILLER PICTURE IS X(10) VALUE IS "DEBUG-NAME".
043700 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
043800 01  REC-CT PICTURE 99 VALUE ZERO.
043900 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
044000 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
044100 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
044200 01  PASS-COUNTER PIC 999 VALUE ZERO.
044300 01  TOTAL-ERROR PIC 999 VALUE ZERO.
044400 01  ERROR-HOLD PIC 999 VALUE ZERO.
044500 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
044600 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
044700 01  CCVS-H-1.
044800     02  FILLER   PICTURE X(27)  VALUE SPACE.
044900     02 FILLER PICTURE X(67) VALUE
045000     " FEDERAL COMPILER TESTING CENTER COBOL COMPILER VALIDATION
045100-    " SYSTEM".
045200     02  FILLER     PICTURE X(26)  VALUE SPACE.
045300 01  CCVS-H-2.
045400     02 FILLER PICTURE X(52) VALUE IS
045500     "CCVS74 NCC  COPY, NOT FOR DISTRIBUTION.".
045600     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
045700     02 TEST-ID PICTURE IS X(9).
045800     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
045900 01  CCVS-H-3.
046000     02  FILLER PICTURE X(34) VALUE
046100     " FOR OFFICIAL USE ONLY    ".
046200     02  FILLER PICTURE X(58) VALUE
046300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
046400     02  FILLER PICTURE X(28) VALUE
046500     "  COPYRIGHT   1974 ".
046600 01  CCVS-E-1.
046700     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
046800     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
046900     02 ID-AGAIN PICTURE IS X(9).
047000     02 FILLER PICTURE X(45) VALUE IS
047100     " NTIS DISTRIBUTION COBOL 74".
047200 01  CCVS-E-2.
047300     02  FILLER                   PICTURE X(31)  VALUE
047400     SPACE.
047500     02  FILLER                   PICTURE X(21)  VALUE SPACE.
047600     02 CCVS-E-2-2.
047700         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
047800         03 FILLER PICTURE IS X VALUE IS SPACE.
047900         03 ENDER-DESC PIC X(44) VALUE "ERRORS ENCOUNTERED".
048000 01  CCVS-E-3.
048100     02  FILLER PICTURE X(22) VALUE
048200     " FOR OFFICIAL USE ONLY".
048300     02  FILLER PICTURE X(12) VALUE SPACE.
048400     02  FILLER PICTURE X(58) VALUE
048500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
048600     02  FILLER PICTURE X(13) VALUE SPACE.
048700     02 FILLER PIC X(15) VALUE " COPYRIGHT 1974".
048800 01  CCVS-E-4.
048900     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
049000     02 FILLER PIC XXXX VALUE " OF ".
049100     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
049200     02 FILLER PIC X(40) VALUE
049300      "  TESTS WERE EXECUTED SUCCESSFULLY".
049400 01  XXINFO.
049500     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
049600     02 INFO-TEXT.
049700     04 FILLER PIC X(20) VALUE SPACE.
049800     04 XXCOMPUTED PIC X(20).
049900     04 FILLER PIC X(5) VALUE SPACE.
050000     04 XXCORRECT PIC X(20).
050100 01  HYPHEN-LINE.
050200     02 FILLER PICTURE IS X VALUE IS SPACE.
050300     02 FILLER PICTURE IS X(65) VALUE IS "************************
050400-    "*****************************************".
050500     02 FILLER PICTURE IS X(54) VALUE IS "************************
050600-    "******************************".
050700 01  CCVS-PGM-ID PIC X(6) VALUE
050800     "DB105A".
050900 PROCEDURE DIVISION.
051000 DECLARATIVES.
051100 DEBUG-ALL-PROCS SECTION.
051200     USE FOR DEBUGGING ON ALL PROCEDURES.
051300 DEBUG-ALL-0.
051400     MOVE 0 TO PROC-ACTIVE.
051500     IF BYPASS IS EQUAL TO 1 GO TO DEBUG-ALL-EXIT.
051600     MOVE DEBUG-NAME TO PROC-NAME (STACK-INDEX).
051700     IF PROC-LOC (STACK-INDEX) IS EQUAL TO "PROC"
051800             INSPECT PROC-NAME (STACK-INDEX)
051900             REPLACING CHARACTERS BY " " AFTER INITIAL " ".
052000     IF BASE-NUMBER (STACK-INDEX) IS NUMERIC
052100             ADD INCREMENT TO BASE-NUMBER (STACK-INDEX).
052200     IF STACK-INDEX IS EQUAL TO 500
052300             MOVE 1 TO BYPASS
052400             GO TO DEBUG-ALL-EXIT.
052500     SET STACK-INDEX UP BY 1.
052600 DEBUG-ALL-EXIT.
052700     EXIT.
052800 END DECLARATIVES.
052900 CCVS1 SECTION.
053000 OPEN-FILES.
053100     OPEN     OUTPUT PRINT-FILE.
053200     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
053300     MOVE    SPACE TO TEST-RESULTS.
053400     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
053500     GO TO CCVS1-EXIT.
053600 CLOSE-FILES.
053700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
053800 TERMINATE-CCVS.
053900T    EXIT PROGRAM.
054000TTERMINATE-CALL.
054100     STOP     RUN.
054200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
054300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
054400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
054500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
054600     MOVE "****TEST DELETED****" TO RE-MARK.
054700 PRINT-DETAIL.
054800     IF REC-CT NOT EQUAL TO ZERO
054900             MOVE "." TO PARDOT-X
055000             MOVE REC-CT TO DOTVALUE.
055100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
055200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-A.
055300     MOVE SPACE TO CORRECT-A.
055400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
055500     MOVE     SPACE TO RE-MARK.
055600 HEAD-ROUTINE.
055700     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055800     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
055900     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
056000 COLUMN-NAMES-ROUTINE.
056100     MOVE COLUMNS-LINE-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
056200     MOVE COLUMNS-LINE-2 TO DUMMY-RECORD.
056300     PERFORM WRITE-LINE 2 TIMES.
056400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
056500 END-ROUTINE.
056600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
056700 END-RTN-EXIT.
056800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
056900 END-ROUTINE-1.
057000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
057100      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
057200      ADD PASS-COUNTER TO ERROR-HOLD.
057300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
057400      MOVE PASS-COUNTER TO CCVS-E-4-1.
057500      MOVE ERROR-HOLD TO CCVS-E-4-2.
057600      MOVE CCVS-E-4 TO CCVS-E-2-2.
057700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
057800  END-ROUTINE-12.
057900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
058000     IF       ERROR-COUNTER IS EQUAL TO ZERO
058100         MOVE "NO " TO ERROR-TOTAL
058200         ELSE
058300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
058400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
058500     PERFORM WRITE-LINE.
058600 END-ROUTINE-13.
058700     IF DELETE-CNT IS EQUAL TO ZERO
058800         MOVE "NO " TO ERROR-TOTAL  ELSE
058900         MOVE DELETE-CNT TO ERROR-TOTAL.
059000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
059100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
059200      IF   INSPECT-COUNTER EQUAL TO ZERO
059300          MOVE "NO " TO ERROR-TOTAL
059400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
059500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
059600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
059700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
059800 WRITE-LINE.
059900     ADD 1 TO RECORD-COUNT.
060000Y    IF RECORD-COUNT GREATER 50
060100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
060200Y        MOVE SPACE TO DUMMY-RECORD
060300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
060400Y        MOVE COLUMNS-LINE-1 TO DUMMY-RECORD PERFORM WRT-LN
060500Y        MOVE COLUMNS-LINE-2 TO DUMMY-RECORD PERFORM WRT-LN
060600Y            2 TIMES
060700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
060800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
060900Y        MOVE ZERO TO RECORD-COUNT.
061000     PERFORM   WRT-LN.
061100 WRT-LN.
061200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
061300     MOVE SPACE TO DUMMY-RECORD.
061400*
061500 CCVS1-EXIT.
061600     EXIT.
061700 INITIALIZE-PROC-NAME-STACK.
061800     MOVE 0 TO BYPASS.
061900     SET STACK-INDEX TO 1.
062000     MOVE 0 TO INCREMENT.
062100 PROC-001-BEGIN-TESTS SECTION.
062200 PROC-002-GO--TEST-1.
062300     MOVE 0 TO INCREMENT.
062400     GO TO    PROC-003-GO--WRITE-1.
062500 PROC-000-GO--DELETE-1.
062600     MOVE 0 TO INCREMENT.
062700     PERFORM  PROC-000-NUCLEUS-FAILURE.
062800     GO TO    PROC-003-GO--WRITE-1.
062900 PROC-003-GO--WRITE-1.
063000     MOVE 0 TO INCREMENT.
063100     MOVE "GO TO " TO FEATURE.
063200     MOVE "PROC-002-GO--TEST-1" TO PAR-NAME.
063300 PROC-004-GO--INIT-2.
063400     MOVE 0 TO INCREMENT.
063500     MOVE "PROC-005-GO--TEST-2" TO PAR-NAME.
063600     MOVE     SPACE TO P-OR-F.
063700     MOVE "GO TO DEPENDING" TO FEATURE.
063800 PROC-005-GO--TEST-2.
063900     ADD 1 TO INCREMENT.
064000     MOVE     SPACE TO FEATURE.
064100     GO TO    PROC-005-GO--B
064200              PROC-005-GO--D
064300              PROC-005-GO--C DEPENDING ON GO-TO-DEPEND.
064400     GO TO    PROC-005-GO--A.
064500 PROC-000-GO--DELETE-2.
064600     MOVE 0 TO INCREMENT.
064700     MOVE "PROC-005-GO--TEST-2" TO PAR-NAME.
064800     PERFORM  PROC-000-NUCLEUS-FAILURE.
064900     GO TO    PROC-016-GO--WRITE-2.
065000 PROC-005-GO--A.
065100     ADD 1 TO INCREMENT.
065200     MOVE "PROC-005-GO--A" TO PAR-NAME.
065300     IF       GO-TO-DEPEND EQUAL TO 0
065400              ADD 1 TO GO-TO-DEPEND
065500              GO TO PROC-005-GO--TEST-2.
065600     IF       GO-TO-DEPEND GREATER THAN 3
065700              GO TO PROC-005-GO--E.
065800     PERFORM  PROC-000-NUCLEUS-FAILURE
065900              MOVE 1 TO GO-TO-DEPEND
066000              GO TO PROC-005-GO--TEST-2.
066100 PROC-005-GO--B.
066200     ADD 1 TO INCREMENT.
066300     MOVE "PROC-005-GO--B" TO PAR-NAME.
066400     IF       GO-TO-DEPEND NOT EQUAL TO 1
066500              PERFORM PROC-000-NUCLEUS-FAILURE
066600              MOVE 3 TO GO-TO-DEPEND
066700              GO TO PROC-005-GO--TEST-2.
066800     ADD      2 TO GO-TO-DEPEND.
066900     GO TO    PROC-005-GO--TEST-2.
067000 PROC-005-GO--C.
067100     ADD 1 TO INCREMENT.
067200     MOVE "PROC-005-GO--C" TO PAR-NAME.
067300     IF       GO-TO-DEPEND NOT EQUAL TO 3
067400              PERFORM PROC-000-NUCLEUS-FAILURE
067500              MOVE 2 TO GO-TO-DEPEND
067600              GO TO PROC-005-GO--TEST-2.
067700     SUBTRACT 1 FROM GO-TO-DEPEND.
067800     GO TO    PROC-005-GO--TEST-2.
067900 PROC-005-GO--D.
068000     ADD 1 TO INCREMENT.
068100     MOVE "PROC-005-GO--D" TO PAR-NAME.
068200     IF       GO-TO-DEPEND NOT EQUAL TO 2
068300              PERFORM PROC-000-NUCLEUS-FAILURE
068400              MOVE 4 TO GO-TO-DEPEND
068500              GO TO PROC-005-GO--TEST-2.
068600     ADD      2 TO GO-TO-DEPEND.
068700     GO TO    PROC-005-GO--TEST-2.
068800 PROC-005-GO--E.
068900     MOVE 0 TO INCREMENT.
069000     MOVE "PROC-005-GO--E" TO PAR-NAME.
069100     IF       GO-TO-DEPEND EQUAL TO 4
069200              GO TO PROC-016-GO--WRITE-2.
069300     PERFORM  PROC-000-NUCLEUS-FAILURE.
069400 PROC-016-GO--WRITE-2.
069500     MOVE 0 TO INCREMENT.
069600     ADD 1 TO REC-CT.
069700 PROC-017-GO--TEST-3.
069800     MOVE 0 TO INCREMENT.
069900     GO TO    PROC-018-GO--PASS-3.
070000 PROC-000-GO--TEST-3A.
070100     MOVE 0 TO INCREMENT.
070200     PERFORM  PROC-000-NUCLEUS-FAILURE.
070300     GO TO    PROC-019-GO--WRITE-3.
070400 PROC-000-GO--DELETE-3.
070500     MOVE 0 TO INCREMENT.
070600     PERFORM  PROC-000-NUCLEUS-FAILURE.
070700     GO TO    PROC-019-GO--WRITE-3.
070800 PROC-018-GO--PASS-3   SECTION.
070900 PROC-019-GO--WRITE-3.
071000     MOVE 0 TO INCREMENT.
071100     MOVE "GO TO" TO FEATURE.
071200     MOVE "PROC-017-GO--TEST-3" TO PAR-NAME.
071300 PROC-020-GO--TEST-4.
071400     MOVE 0 TO INCREMENT.
071500     GO TO    PROC-021-GO--PASS-4
071600              PROC-000-GO--NUC-FAIL-4 DEPENDING ON GO-TO-DEEP.
071700*    NOTE THAT PROC-021-GO--PASS-4 IS A SECTION-NAME.
071800     GO TO    PROC-000-GO--NUC-FAIL-4.
071900 PROC-000-GO--DELETE-4.
072000     MOVE 0 TO INCREMENT.
072100     PERFORM  PROC-000-NUCLEUS-FAILURE.
072200     GO TO    PROC-023-GO--WRITE-4.
072300 PROC-021-GO--PASS-4   SECTION.
072400 PROC-022-GO--PAS-4.
072500     MOVE 0 TO INCREMENT.
072600     IF       GO-TO-DEEP EQUAL TO 1
072700              GO TO PROC-023-GO--WRITE-4.
072800 PROC-000-GO--NUC-FAIL-4.
072900     MOVE 0 TO INCREMENT.
073000     MOVE     GO-TO-DEEP TO COMPUTED-N.
073100     MOVE     1 TO CORRECT-N.
073200     PERFORM  PROC-000-NUCLEUS-FAILURE.
073300 PROC-023-GO--WRITE-4.
073400     MOVE 0 TO INCREMENT.
073500     MOVE "GO TO DEPENDING" TO FEATURE.
073600     MOVE "PROC-020-GO--TEST-4" TO PAR-NAME.
073700 PROC-024-ALTER-INIT.
073800     MOVE 0 TO INCREMENT.
073900     MOVE "ALTER" TO FEATURE.
074000 PROC-025-ALTER-TEST-1.
074100     MOVE 0 TO INCREMENT.
074200     ALTER    PROC-026-ALTER-A TO PROCEED TO PROC-027-ALTER-C.
074300     MOVE 1 TO INCREMENT.
074400     GO TO    PROC-026-ALTER-A.
074500 PROC-000-ALTER-DELETE-1.
074600     MOVE 0 TO INCREMENT.
074700     PERFORM  PROC-000-NUCLEUS-FAILURE.
074800     GO TO    PROC-028-ALTER-WRITE-1.
074900 PROC-026-ALTER-A.
075000     GO TO    PROC-000-ALTER-B.
075100 PROC-000-ALTER-B.
075200     MOVE 0 TO INCREMENT.
075300     PERFORM  PROC-000-NUCLEUS-FAILURE.
075400     GO TO    PROC-028-ALTER-WRITE-1.
075500 PROC-027-ALTER-C.
075600     ADD 0 TO INCREMENT.
075700 PROC-028-ALTER-WRITE-1.
075800     MOVE 0 TO INCREMENT.
075900     MOVE "PROC-025-ALTER-TEST-1" TO PAR-NAME.
076000 PROC-030-ALTER-TEST-3.
076100     MOVE 0 TO INCREMENT.
076200     ALTER    PROC-031-ALTER-G TO PROCEED TO PROC-032-ALTER-I.
076300     MOVE 1 TO INCREMENT.
076400     GO TO    PROC-031-ALTER-G.
076500 PROC-000-ALTER-DELETE-3.
076600     MOVE 0 TO INCREMENT.
076700     PERFORM PROC-000-NUCLEUS-FAILURE.
076800     GO TO    PROC-032-ALTER-WRITE-3.
076900 PROC-031-ALTER-G.
077000     GO TO    PROC-000-ALTER-H.
077100 PROC-000-ALTER-H.
077200     MOVE 0 TO INCREMENT.
077300     PERFORM  PROC-000-NUCLEUS-FAILURE.
077400     GO TO    PROC-032-ALTER-WRITE-3.
077500 PROC-032-ALTER-I.
077600     MOVE 3 TO INCREMENT.
077700     ADD      1 TO ALTERLOOP.
077800     IF       ALTERLOOP GREATER THAN 1
077900              PERFORM PROC-000-NUCLEUS-FAILURE
078000              GO TO PROC-032-ALTER-WRITE-3.
078100     ALTER    PROC-031-ALTER-G TO  PROC-032-ALTER-WRITE-3.
078200     MOVE 4 TO INCREMENT.
078300     GO TO    PROC-031-ALTER-G.
078400 PROC-032-ALTER-WRITE-3.
078500     MOVE 0 TO INCREMENT.
078600     MOVE "PROC-030-ALTER-TEST-3" TO PAR-NAME.
078700 PROC-037-EXIT-TEST-1.
078800     MOVE 0 TO INCREMENT.
078900     GO TO    PROC-038-EXIT-CHECK-1.
079000 PROC-000-EXIT-DELETE-1.
079100     MOVE 0 TO INCREMENT.
079200     PERFORM  PROC-000-NUCLEUS-FAILURE.
079300     GO TO    PROC-039-EXIT-WRITE-1.
079400 PROC-038-EXIT-CHECK-1.
079500     EXIT.
079600 PROC-039-EXIT-WRITE-1.
079700     MOVE 0 TO INCREMENT.
079800     MOVE "EXIT" TO FEATURE.
079900     MOVE "PROC-037-EXIT-TEST-1" TO PAR-NAME.
080000 PROC-040-PFM-TEST-1.
080100     MOVE 0 TO INCREMENT.
080200     MOVE     1 TO PERFORM-KEY.
080300     PERFORM  PROC-041-PFM-A.
080400     IF       PERFORM1 EQUAL TO "ABC"
080500              NEXT SENTENCE
080600              ELSE
080700              PERFORM PROC-000-NUCLEUS-FAILURE.
080800     GO TO    PROC-042-PFM-WRITE-1.
080900 PROC-000-PFM-DELETE-1.
081000     MOVE 0 TO INCREMENT.
081100     PERFORM  PROC-000-NUCLEUS-FAILURE.
081200 PROC-042-PFM-WRITE-1.
081300     MOVE 0 TO INCREMENT.
081400     MOVE "PERFORM" TO FEATURE.
081500     MOVE "PFM-TEST-1" TO PAR-NAME.
081600 PROC-043-PFM-TEST-2.
081700     MOVE 3 TO INCREMENT.
081800     MOVE     2 TO PERFORM-KEY.
081900     GO TO    PROC-041-PFM-A.
082000 PROC-000-PFM-DELETE-2.
082100     MOVE 0 TO INCREMENT.
082200     PERFORM  PROC-000-NUCLEUS-FAILURE.
082300     GO TO    PROC-046-PFM-WRITE-2.
082400 PROC-041-PFM-A.
082500     MOVE 0 TO INCREMENT.
082600     IF       PERFORM-KEY EQUAL TO 1
082700              MOVE "ABC" TO PERFORM1
082800              ELSE
082900              MOVE "XYZ" TO PERFORM1.
083000 PROC-045-PFM-B.
083100     MOVE 0 TO INCREMENT.
083200     IF       PERFORM-KEY EQUAL TO 1
083300              PERFORM PROC-000-NUCLEUS-FAILURE
083400              GO TO PROC-043-PFM-TEST-2.
083500     IF       PERFORM1 EQUAL TO "XYZ"
083600              NEXT SENTENCE
083700              ELSE
083800              PERFORM PROC-000-NUCLEUS-FAILURE.
083900 PROC-046-PFM-WRITE-2.
084000     MOVE 0 TO INCREMENT.
084100     MOVE "PERFORM" TO FEATURE.
084200     MOVE "PROC-043-PFM-TEST-2" TO PAR-NAME.
084300 PROC-047-PFM-TEST-3.
084400     MOVE 0 TO INCREMENT.
084500     PERFORM  PROC-048-PFM-C 3 TIMES.
084600     PERFORM  PROC-048-PFM-C THREE TIMES.
084700     IF       PERFORM2 EQUAL TO 56
084800              NEXT SENTENCE
084900              ELSE
085000              PERFORM PROC-000-NUCLEUS-FAILURE.
085100     GO TO    PROC-048-PFM-WRITE-3.
085200 PROC-000-PFM-DELETE-3.
085300     MOVE 0 TO INCREMENT.
085400     PERFORM  PROC-000-NUCLEUS-FAILURE.
085500 PROC-048-PFM-WRITE-3.
085600     MOVE 0 TO INCREMENT.
085700     MOVE "PERFORM TIMES" TO FEATURE.
085800     MOVE "PROC-047-PFM-TEST-3" TO PAR-NAME.
085900 PROC-055-PFM-TEST-4.
086000     MOVE 0 TO INCREMENT.
086100     PERFORM  PROC-056-PFM-E THRU PROC-059-PFM-H.
086200     IF       PERFORM4 EQUAL TO 70.0
086300              NEXT SENTENCE
086400              ELSE
086500              PERFORM PROC-000-NUCLEUS-FAILURE.
086600     GO TO    PROC-060-PFM-WRITE-4.
086700 PROC-000-PFM-DELETE-4.
086800     MOVE 0 TO INCREMENT.
086900     PERFORM  PROC-000-NUCLEUS-FAILURE.
087000 PROC-060-PFM-WRITE-4.
087100     MOVE 0 TO INCREMENT.
087200     MOVE "NESTED PERFORM THRU" TO FEATURE.
087300     MOVE "PROC-055-PFM-TEST-4" TO PAR-NAME.
087400 PROC-061-PFM-TEST-5.
087500     MOVE 0 TO INCREMENT.
087600     PERFORM  PROC-062-PFM-J.
087700     IF       PERFORM2 EQUAL TO 312
087800              NEXT SENTENCE
087900              ELSE
088000              PERFORM PROC-000-NUCLEUS-FAILURE.
088100     GO TO    PROC-064-PFM-WRITE-5.
088200 PROC-000-PFM-DELETE-5.
088300     MOVE 0 TO INCREMENT.
088400     PERFORM  PROC-000-NUCLEUS-FAILURE.
088500 PROC-064-PFM-WRITE-5.
088600     MOVE 0 TO INCREMENT.
088700     MOVE "NESTED PERFORM" TO FEATURE.
088800     MOVE "PROC-061-PFM-TEST-5" TO PAR-NAME.
088900 PROC-065-PFM-TEST-6.
089000     MOVE 0 TO INCREMENT.
089100     PERFORM  PROC-066-PFM-N.
089200     GO TO    PROC-069-PFM-WRITE-6.
089300 PROC-000-PFM-DELETE-6.
089400     MOVE 0 TO INCREMENT.
089500     PERFORM  PROC-000-NUCLEUS-FAILURE.
089600 PROC-069-PFM-WRITE-6.
089700     MOVE 0 TO INCREMENT.
089800     MOVE "PERFORM SECTION-NAME" TO FEATURE.
089900     MOVE "PROC-065-PFM-TEST-6" TO PAR-NAME.
090000 PROC-070-PFM-TEST-7.
090100     MOVE 0 TO INCREMENT.
090200     PERFORM  PROC-071-PFM-V THRU PROC-075-PFM-Z 5 TIMES.
090300     MOVE 0 TO INCREMENT.
090400     GO       TO PROC-096-PFM-WRITE-7.
090500 PROC-000-PFM-DELETE-7.
090600     MOVE 0 TO INCREMENT.
090700     PERFORM  PROC-000-NUCLEUS-FAILURE.
090800 PROC-096-PFM-WRITE-7.
090900     MOVE 0 TO INCREMENT.
091000     MOVE     "PERFORM EXIT PARAS" TO FEATURE.
091100     MOVE "PROC-070-PFM-TEST-7" TO PAR-NAME.
091200 PROC-097-PFM-TEST-08.
091300     MOVE 0 TO INCREMENT.
091400     MOVE     ZERO TO P-COUNT
091500     PERFORM  PROC-098-PFM-B-8.
091600     ADD      1 TO P-COUNT.
091700     PERFORM PROC-097-PFM-A-8.
091800     ADD      1 TO P-COUNT.
091900 PROC-097-PFM-A-8   SECTION.
092000 PROC-098-PFM-B-8.
092100     ADD 2 TO INCREMENT.
092200     ADD      100 TO P-COUNT.
092300 PROC-097-PFM-TESTT-8 SECTION.
092400 PROC-098-PFM-TESTTT-8.
092500     MOVE 0 TO INCREMENT.
092600     IF       P-COUNT EQUAL TO 000302
092700              GO TO PROC-105-PFM-WRITE-08.
092800     GO       TO PROC-000-PFM-NUC-FAIL-08.
092900 PROC-000-DELETE-08.
093000     MOVE 0 TO INCREMENT.
093100     PERFORM  PROC-000-NUCLEUS-FAILURE.
093200     GO       TO PROC-105-PFM-WRITE-08.
093300 PROC-000-PFM-NUC-FAIL-08.
093400     MOVE 0 TO INCREMENT.
093500     MOVE     P-COUNT TO COMPUTED-N.
093600     MOVE     000302 TO CORRECT-N.
093700     PERFORM  PROC-000-NUCLEUS-FAILURE.
093800 PROC-105-PFM-WRITE-08.
093900     MOVE 0 TO INCREMENT.
094000     MOVE "PERFORM             " TO FEATURE.
094100     MOVE     "PROC-097-PFM-TEST-08" TO PAR-NAME.
094200 PROC-106-PFM-TEST-09.
094300     MOVE 0 TO INCREMENT.
094400     MOVE     ZERO TO P-COUNT.
094500     PERFORM PROC-107-PFM-B-9   1 TIMES.
094600     ADD      1 TO P-COUNT.
094700     PERFORM  PROC-106-PFM-A-9   ATWO-DS-01V00 TIMES.
094800     ADD      1 TO P-COUNT.
094900 PROC-106-PFM-A-9   SECTION.
095000 PROC-107-PFM-B-9.
095100     ADD 2 TO INCREMENT.
095200     ADD      100 TO P-COUNT.
095300 PROC-106-PFM-TESTT-9 SECTION.
095400 PROC-107-PFM-TESTTT-9.
095500     MOVE 0 TO INCREMENT.
095600     IF       P-COUNT EQUAL TO 000402
095700              GO TO PROC-116-PFM-WRITE-09.
095800     GO       TO PROC-000-PFM-NUC-FAIL-09.
095900 PROC-000-PFM-DELETE-09.
096000     MOVE 0 TO INCREMENT.
096100     PERFORM  PROC-000-NUCLEUS-FAILURE.
096200     GO       TO PROC-116-PFM-WRITE-09.
096300 PROC-000-PFM-NUC-FAIL-09.
096400     MOVE 0 TO INCREMENT.
096500     MOVE     P-COUNT TO COMPUTED-N.
096600     MOVE     000502 TO CORRECT-N.
096700     PERFORM  PROC-000-NUCLEUS-FAILURE.
096800 PROC-116-PFM-WRITE-09.
096900     MOVE 0 TO INCREMENT.
097000     MOVE "PERFORM TIMES       " TO FEATURE.
097100     MOVE     "PROC-106-PFM-TEST-09" TO PAR-NAME.
097200 PROC-117-PFM-TEST-10.
097300     MOVE 0 TO INCREMENT.
097400     MOVE     ZERO TO P-COUNT.
097500     PERFORM  PROC-118-PFM-B-10 THROUGH PROC-120-PFM-D-10.
097600     MOVE 4 TO INCREMENT.
097700     ADD      1 TO P-COUNT
097800     PERFORM  PROC-117-PFM-A-10 THRU PROC-119-PFM-C-10.
097900     MOVE 8 TO INCREMENT.
098000     ADD      1 TO P-COUNT.
098100     PERFORM  PROC-117-PFM-A-10 THRU PROC-120-PFM-D-10.
098200     MOVE 11 TO INCREMENT.
098300     ADD      1 TO P-COUNT.
098400     PERFORM  PROC-118-PFM-B-10 THRU PROC-119-PFM-C-10.
098500     MOVE 15 TO INCREMENT.
098600     ADD     1 TO P-COUNT.
098700 PROC-117-PFM-A-10 SECTION.
098800 PROC-118-PFM-B-10.
098900     ADD      100 TO P-COUNT.
099000 PROC-119-PFM-C-10 SECTION.
099100 PROC-120-PFM-D-10.
099200     ADD      10000 TO P-COUNT.
099300 PROC-121-PFM-TESTT-10 SECTION.
099400 PROC-122-PFM-TESTTT-10.
099500     MOVE 0 TO INCREMENT.
099600     IF       P-COUNT EQUAL TO 050504
099700              GO TO PROC-138-PFM-WRITE-10.
099800     GO       TO PROC-000-PFM-NUC-FAIL-10.
099900 PROC-000-PFM-DELETE-10.
100000     MOVE 0 TO INCREMENT.
100100     PERFORM  PROC-000-NUCLEUS-FAILURE.
100200     GO       TO PROC-138-PFM-WRITE-10.
100300 PROC-000-PFM-NUC-FAIL-10.
100400     MOVE 0 TO INCREMENT.
100500     MOVE     P-COUNT TO COMPUTED-N.
100600     MOVE     050504 TO CORRECT-N.
100700     PERFORM  PROC-000-NUCLEUS-FAILURE.
100800 PROC-138-PFM-WRITE-10.
100900     MOVE 0 TO INCREMENT.
101000     MOVE "PERFORM THRU        " TO FEATURE.
101100     MOVE     "PROC-117-PFM-TEST-10" TO PAR-NAME.
101200 PROC-139-PFM-TEST-11.
101300     MOVE 0 TO INCREMENT.
101400     MOVE     ZERO TO P-COUNT.
101500     PERFORM PROC-140-PFM-B-11 THROUGH PROC-140-PFM-D-11 1 TIMES.
101600     MOVE 4 TO INCREMENT.
101700     ADD      1 TO P-COUNT.
101800     PERFORM  PROC-139-PFM-A-11 THRU PROC-139-PFM-C-11 2 TIMES.
101900     MOVE 12 TO INCREMENT.
102000     ADD      1 TO P-COUNT.
102100     PERFORM  PROC-139-PFM-A-11 THRU PROC-140-PFM-D-11 2 TIMES.
102200     MOVE 19 TO INCREMENT.
102300     ADD      1 TO P-COUNT.
102400     PERFORM PROC-140-PFM-B-11 THRU PROC-139-PFM-C-11   1 TIMES.
102500     MOVE 23 TO INCREMENT.
102600     ADD      1 TO P-COUNT.
102700 PROC-139-PFM-A-11 SECTION.
102800 PROC-140-PFM-B-11.
102900     ADD 2 TO INCREMENT.
103000     ADD      100 TO P-COUNT.
103100 PROC-139-PFM-C-11 SECTION.
103200 PROC-140-PFM-D-11.
103300     ADD 2 TO INCREMENT.
103400     ADD     10000 TO P-COUNT.
103500 PROC-139-PFM-TESTT-11 SECTION.
103600 PROC-140-PFM-TESTTT-11.
103700     MOVE 0 TO INCREMENT.
103800     IF       P-COUNT EQUAL TO 070704
103900              GO TO PROC-168-PFM-WRITE-11.
104000     GO       TO PROC-000-PFM-NUC-FAIL-11.
104100 PROC-000-PFM-DELETE-11.
104200     MOVE 0 TO INCREMENT.
104300     PERFORM  PROC-000-NUCLEUS-FAILURE.
104400     GO       TO PROC-168-PFM-WRITE-11.
104500 PROC-000-PFM-NUC-FAIL-11.
104600     MOVE 0 TO INCREMENT.
104700     MOVE     P-COUNT TO COMPUTED-N.
104800     MOVE     090904 TO CORRECT-N.
104900     PERFORM  PROC-000-NUCLEUS-FAILURE.
105000 PROC-168-PFM-WRITE-11.
105100     MOVE 0 TO INCREMENT.
105200     MOVE "PERFORM THRU, TIMES " TO FEATURE.
105300     MOVE     "PROC-139-PFM-TEST-11" TO PAR-NAME.
105400 PROC-169-PFM-TEST-12.
105500     MOVE 0 TO INCREMENT.
105600     MOVE     ZERO TO P-COUNT.
105700     ADD      1 TO P-COUNT.
105800     PERFORM  PROC-170-PFM-A-12.
105900     ADD      2 TO P-COUNT.
106000     GO       TO PROC-175-PFM-TESTT-12.
106100 PROC-170-PFM-A-12.
106200     MOVE 0 TO INCREMENT.
106300     ADD      10 TO P-COUNT.
106400     PERFORM  PROC-171-PFM-B-12.
106500     ADD      20 TO P-COUNT.
106600 PROC-171-PFM-B-12.
106700     MOVE 0 TO INCREMENT.
106800     ADD      100 TO P-COUNT.
106900     PERFORM  PROC-172-PFM-C-12.
107000     ADD      200 TO P-COUNT.
107100 PROC-172-PFM-C-12.
107200     MOVE 0 TO INCREMENT.
107300     ADD      1000 TO P-COUNT.
107400     PERFORM  PROC-173-PFM-D-12.
107500     ADD      2000 TO P-COUNT.
107600 PROC-173-PFM-D-12.
107700     MOVE 0 TO INCREMENT.
107800     ADD      10000 TO P-COUNT.
107900     PERFORM  PROC-174-PFM-E-12.
108000     ADD      20000 TO P-COUNT.
108100 PROC-174-PFM-E-12.
108200     MOVE 0 TO INCREMENT.
108300     ADD      100000 TO P-COUNT.
108400 PROC-175-PFM-TESTT-12.
108500     MOVE 0 TO INCREMENT.
108600     IF       P-COUNT EQUAL TO 133333
108700              GO TO PROC-176-PFM-WRITE-12.
108800     GO       TO PROC-000-PFM-NUC-FAIL-12.
108900 PROC-000-PFM-DELETE-12.
109000     MOVE 0 TO INCREMENT.
109100     PERFORM  PROC-000-NUCLEUS-FAILURE.
109200     GO       TO PROC-176-PFM-WRITE-12.
109300 PROC-000-PFM-NUC-FAIL-12.
109400     MOVE 0 TO INCREMENT.
109500     MOVE     P-COUNT TO COMPUTED-N.
109600     MOVE     133333 TO CORRECT-N.
109700     PERFORM  PROC-000-NUCLEUS-FAILURE.
109800 PROC-176-PFM-WRITE-12.
109900     MOVE 0 TO INCREMENT.
110000     MOVE "NESTED PERFORM      " TO FEATURE.
110100     MOVE     "PROC-169-PFM-TEST-12" TO PAR-NAME.
110200 PROC-177-PFM-TEST-13.
110300     MOVE 0 TO INCREMENT.
110400     MOVE     ZERO TO P-COUNT.
110500     PERFORM  PROC-178-PFM-A-13 THRU PROC-177-PFM-B-13.
110600     ADD      1 TO P-COUNT.
110700     MOVE 2 TO INCREMENT.
110800     PERFORM  PROC-178-PFM-A-13 THRU PROC-177-PFM-B-13 2 TIMES.
110900     ADD      2 TO P-COUNT.
111000 PROC-178-PFM-A-13.
111100     ADD 2 TO INCREMENT.
111200     ADD      100 TO P-COUNT.
111300 PROC-177-PFM-B-13.
111400     EXIT.
111500 PROC-178-PFM-TESTT-13.
111600     MOVE 0 TO INCREMENT.
111700     IF       P-COUNT EQUAL TO 000403
111800              GO TO PROC-187-PFM-WRITE-13.
111900     GO       TO PROC-000-PFM-NUC-FAIL-13.
112000 PROC-000-PFM-DELETE-13.
112100     MOVE 0 TO INCREMENT.
112200     PERFORM  PROC-000-NUCLEUS-FAILURE.
112300     GO       TO PROC-187-PFM-WRITE-13.
112400 PROC-000-PFM-NUC-FAIL-13.
112500     MOVE 0 TO INCREMENT.
112600     MOVE     P-COUNT TO COMPUTED-N.
112700     MOVE     000403 TO CORRECT-N.
112800     MOVE     "PERFORM WITH EXIT" TO FEATURE.
112900     PERFORM  PROC-000-NUCLEUS-FAILURE.
113000 PROC-187-PFM-WRITE-13.
113100     MOVE 0 TO INCREMENT.
113200     MOVE     "PROC-177-PFM-TEST-13" TO PAR-NAME.
113300 PROC-188-PFM-TEST-14.
113400     MOVE 0 TO INCREMENT.
113500     PERFORM PROC-189-A101.
113600     IF PERFORM-HOLD EQUAL TO "ABCDEFGHIJKLMNOPQRST"
113700         GO TO PROC-210-PFM-WRITE-14.
113800     MOVE "ABCDEFGHIJKLMNOPQRST" TO CORRECT-A.
113900     MOVE PERFORM-HOLD TO COMPUTED-A.
114000     PERFORM PROC-000-NUCLEUS-FAILURE.
114100     GO TO PROC-210-PFM-WRITE-14.
114200 PROC-000-PFM-DELETE-14.
114300     MOVE 0 TO INCREMENT.
114400     PERFORM  PROC-000-NUCLEUS-FAILURE.
114500 PROC-210-PFM-WRITE-14.
114600     MOVE 0 TO INCREMENT.
114700     MOVE     "PROC-188-PFM-TEST-14" TO PAR-NAME.
114800 PROC-211-PFM-A-15 SECTION.
114900 PROC-212-PFM-TEST-15.
115000     MOVE 0 TO INCREMENT.
115100     PERFORM  PROC-213-PFM-G-15 THRU PROC-217-PFM-B-15.
115200     GO       TO PROC-218-PFM-WRITE-15.
115300 PROC-000-PFM-DELETE-15.
115400     MOVE 0 TO INCREMENT.
115500     PERFORM  PROC-000-NUCLEUS-FAILURE.
115600     GO       TO PROC-218-PFM-WRITE-15.
115700 PROC-217-PFM-B-15.
115800     MOVE 0 TO INCREMENT.
115900     ADD 1 TO REC-CT.
116000 PROC-000-PFM-C-15.
116100     MOVE 0 TO INCREMENT.
116200     PERFORM  PROC-000-NUCLEUS-FAILURE.
116300     MOVE     "RETURN MECHANISM LOST" TO RE-MARK.
116400     GO       TO PROC-218-PFM-WRITE-15.
116500 PROC-000-PFM-D-15.
116600     MOVE 0 TO INCREMENT.
116700     PERFORM  PROC-000-NUCLEUS-FAILURE.
116800     MOVE     "PERFORM GOT LOST IN GO TOS" TO RE-MARK.
116900     GO       TO PROC-218-PFM-WRITE-15.
117000 PROC-215-PFM-E-15.
117100     MOVE 0 TO INCREMENT.
117200     GO       TO PROC-216-PFM-L-15.
117300 PROC-000-PFM-F-15.
117400     MOVE 0 TO INCREMENT.
117500     GO       TO PROC-000-PFM-D-15.
117600 PROC-213-PFM-G-15 SECTION.
117700 PROC-214-PFM-H-15.
117800     MOVE 0 TO INCREMENT.
117900     GO       TO PROC-215-PFM-E-15.
118000 PROC-000-PFM-I-15.
118100     MOVE 0 TO INCREMENT.
118200     GO       TO PROC-000-PFM-D-15.
118300 PROC-000-PFM-J-15 SECTION.
118400 PROC-000-PFM-K-15.
118500     MOVE 0 TO INCREMENT.
118600     PERFORM  PROC-000-NUCLEUS-FAILURE.
118700     MOVE     "PROC-000-PFM-K-15 ENTERED" TO RE-MARK.
118800     GO       TO PROC-218-PFM-WRITE-15.
118900 PROC-216-PFM-L-15.
119000     MOVE 0 TO INCREMENT.
119100     GO       TO PROC-217-PFM-B-15.
119200 PROC-218-PFM-WRITE-15.
119300     MOVE 0 TO INCREMENT.
119400     MOVE     "PERFORM GO TO PARAS" TO FEATURE.
119500     MOVE     "PROC-212-PFM-TEST-15" TO PAR-NAME.
119600 PROC-219-PFM-TEST-LAST.
119700     MOVE 0 TO INCREMENT.
119800     MOVE     7 TO PERFORM5.
119900     PERFORM  PROC-220-PFM-U PERFORM5 TIMES.
120000     MOVE 0 TO INCREMENT.
120100     IF       PERFORM5 EQUAL TO 707
120200              GO TO PROC-227-PFM-WRITE-LAST.
120300     GO       TO PROC-000-PFM-NUC-FAIL-LST.
120400 PROC-000-PFM-DELETE-LAST.
120500     MOVE 0 TO INCREMENT.
120600     PERFORM  PROC-000-NUCLEUS-FAILURE.
120700     GO       TO PROC-227-PFM-WRITE-LAST.
120800 PROC-000-PFM-NUC-FAIL-LST.
120900     MOVE 0 TO INCREMENT.
121000     MOVE     PERFORM5 TO COMPUTED-N.
121100     MOVE     707 TO CORRECT-N.
121200     PERFORM  PROC-000-NUCLEUS-FAILURE.
121300 PROC-227-PFM-WRITE-LAST.
121400     IF PROC-ACTIVE IS NOT EQUAL TO 0
121500         MOVE " DEBUGGING PROCEDURE WAS NEVER EXECUTED.  NO FURTHE
121600-             "R REPORT WILL BE GENERATED." TO DUMMY-RECORD
121700         PERFORM WRITE-LINE
121800         MOVE 227 TO ERROR-COUNTER
121900         GO TO CCVS-EXIT.
122000     MOVE 0 TO INCREMENT.
122100     MOVE SPACE TO TEST-RESULTS.
122200     MOVE "DEBUG ALL PROCEDURES" TO FEATURE.
122300     MOVE 0 TO REC-CT.
122400     MOVE 1 TO BYPASS.
122500     SET STACK-END TO STACK-INDEX.
122600     SET STACK-INDEX TO 1.
122700     SET STATIC-INDEX TO 1.
122800     PERFORM NAME-LISTER 227 TIMES.
122900 EMPTY-THE-STACK.
123000     IF STACK-INDEX IS NOT LESS THAN STACK-END GO TO STACK-EMPTY.
123100     PERFORM CORRECT-GT-STACK.
123200     GO TO EMPTY-THE-STACK.
123300 STACK-EMPTY.
123400     MOVE SPACE TO DUMMY-RECORD.
123500     MOVE 51 TO RECORD-COUNT.
123600     PERFORM WRITE-LINE.
123700     MOVE FLOW-FAILURE-1 TO DUMMY-RECORD.
123800     PERFORM WRITE-LINE.
123900     MOVE FLOW-FAILURE-2 TO DUMMY-RECORD.
124000     PERFORM WRITE-LINE 2 TIMES.
124100*
124200     GO TO    CCVS-EXIT.
124300 NAME-LISTER SECTION.
124400 NAME-LISTER-1.
124500     MOVE EXPECTED-NAME (STATIC-INDEX) TO TABLE-ENTRY.
124600     SET TABLE-ENTRY-BASE TO STATIC-INDEX.
124700     IF STACK-INDEX IS EQUAL TO STACK-END GO TO STACK-GT-CORRECT.
124800     IF BASE-NUMBER (STACK-INDEX) IS NOT NUMERIC
124900         GO TO CORRECT-GT-STACK.
125000     IF TABLE-ENTRY-BASE IS GREATER THAN BASE-NUMBER (STACK-INDEX)
125100         GO TO CORRECT-GT-STACK.
125200     IF TABLE-ENTRY-BASE IS LESS THAN BASE-NUMBER (STACK-INDEX)
125300         GO TO STACK-GT-CORRECT.
125400 CORRECT-EQ-STACK.
125500     MOVE EXPECTED-NAME (STATIC-INDEX) TO PAR-NAME.
125600     MOVE TABLE-ENTRY TO CORRECT-A.
125700     MOVE PROC-NAME (STACK-INDEX) TO COMPUTED-A.
125800     IF CORRECT-A IS NOT EQUAL TO COMPUTED-A PERFORM FAIL
125900                                        ELSE PERFORM PASS.
126000     PERFORM PRINT-DETAIL.
126100     IF STACK-INDEX IS LESS THAN 500
126200             SET STACK-INDEX UP BY 1.
126300     IF STATIC-INDEX IS LESS THAN 227
126400             SET STATIC-INDEX UP BY 1.
126500     GO TO NAME-LISTER-EXIT.
126600 CORRECT-GT-STACK.
126700     MOVE PROC-NAME (STACK-INDEX) TO COMPUTED-A.
126800     PERFORM FAIL.
126900     PERFORM PRINT-DETAIL.
127000     IF STACK-INDEX IS LESS THAN 500
127100             SET STACK-INDEX UP BY 1.
127200 CORRECT-GT-STACK-1.
127300     GO TO NAME-LISTER-1.
127400 STACK-GT-CORRECT.
127500     MOVE EXPECTED-NAME (STATIC-INDEX) TO PAR-NAME.
127600     MOVE TABLE-ENTRY TO CORRECT-A.
127700     PERFORM FAIL.
127800     PERFORM PRINT-DETAIL.
127900     IF STATIC-INDEX IS LESS THAN 227
128000             SET STATIC-INDEX UP BY 1.
128100 NAME-LISTER-EXIT.
128200     EXIT.
128300 OTHER-PROCEDURES SECTION.
128400 PROC-000-NUCLEUS-FAILURE.
128500     ADD 1 TO NUC-FAILURE-COUNT.
128600 PROC-209-A121.
128700     EXIT.
128800 PROC-208-A120.
128900     MOVE 0 TO INCREMENT.
129000     MOVE "T" TO TEST-LETTER (20).
129100     PERFORM PROC-209-A121.
129200 PROC-207-A119.
129300     MOVE 0 TO INCREMENT.
129400     MOVE "S" TO TEST-LETTER (19).
129500     PERFORM PROC-208-A120.
129600 PROC-206-A118.
129700     MOVE 0 TO INCREMENT.
129800     MOVE "R" TO TEST-LETTER (18).
129900     PERFORM PROC-207-A119.
130000 PROC-205-A117.
130100     MOVE 0 TO INCREMENT.
130200     MOVE "Q" TO TEST-LETTER (17).
130300     PERFORM PROC-206-A118.
130400 PROC-204-A116.
130500     MOVE 0 TO INCREMENT.
130600     MOVE "P" TO TEST-LETTER (16).
130700     PERFORM PROC-205-A117.
130800 PROC-203-A115.
130900     MOVE 0 TO INCREMENT.
131000     MOVE "O" TO TEST-LETTER (15).
131100     PERFORM PROC-204-A116.
131200 PROC-202-A114.
131300     MOVE 0 TO INCREMENT.
131400     MOVE "N" TO TEST-LETTER (14).
131500     PERFORM PROC-203-A115.
131600 PROC-201-A113.
131700     MOVE 0 TO INCREMENT.
131800     MOVE "M" TO TEST-LETTER (13).
131900     PERFORM PROC-202-A114.
132000 PROC-200-A112.
132100     MOVE 0 TO INCREMENT.
132200     MOVE "L" TO TEST-LETTER (12).
132300     PERFORM PROC-201-A113.
132400 PROC-199-A111.
132500     MOVE 0 TO INCREMENT.
132600     MOVE "K" TO TEST-LETTER (11).
132700     PERFORM PROC-200-A112.
132800 PROC-198-A110.
132900     MOVE 0 TO INCREMENT.
133000     MOVE "J" TO TEST-LETTER (10).
133100     PERFORM PROC-199-A111.
133200 PROC-197-A109.
133300     MOVE 0 TO INCREMENT.
133400     MOVE "I" TO TEST-LETTER (9).
133500     PERFORM PROC-198-A110.
133600 PROC-196-A108.
133700     MOVE 0 TO INCREMENT.
133800     MOVE "H" TO TEST-LETTER (8).
133900     PERFORM PROC-197-A109.
134000 PROC-195-A107.
134100     MOVE 0 TO INCREMENT.
134200     MOVE "G" TO TEST-LETTER (7).
134300     PERFORM PROC-196-A108.
134400 PROC-194-A106.
134500     MOVE 0 TO INCREMENT.
134600     MOVE "F" TO TEST-LETTER (6).
134700     PERFORM PROC-195-A107.
134800 PROC-193-A105.
134900     MOVE 0 TO INCREMENT.
135000     MOVE "E" TO TEST-LETTER (5).
135100     PERFORM PROC-194-A106.
135200 PROC-192-A104.
135300     MOVE 0 TO INCREMENT.
135400     MOVE "D" TO TEST-LETTER (4).
135500     PERFORM PROC-193-A105.
135600 PROC-191-A103.
135700     MOVE 0 TO INCREMENT.
135800     MOVE "C" TO TEST-LETTER (3).
135900     PERFORM PROC-192-A104.
136000 PROC-190-A102.
136100     MOVE 0 TO INCREMENT.
136200     MOVE "B" TO TEST-LETTER (2).
136300     PERFORM PROC-191-A103.
136400 PROC-189-A101.
136500     MOVE 0 TO INCREMENT.
136600     MOVE "A" TO TEST-LETTER (1).
136700     PERFORM PROC-190-A102.
136800 PROC-048-PFM-C.
136900     ADD 1 TO INCREMENT.
137000     ADD      6 TO PERFORM2.
137100 PROC-000-PFM-D.
137200     MOVE 0 TO INCREMENT.
137300     PERFORM  PROC-000-NUCLEUS-FAILURE.
137400     GO TO    PROC-055-PFM-TEST-4.
137500*    NOTE CONTROL SHOULD NOT PASS TO THIS PARAGRAPH
137600*    FROM THE PREVIOUS ONE.
137700 PROC-056-PFM-E.
137800     MOVE 0 TO INCREMENT.
137900     MOVE "CSW" TO PERFORM1.
138000     PERFORM  PROC-057-PFM-F THRU PROC-058-PFM-G.
138100     SUBTRACT .8 FROM PERFORM4.
138200     GO TO    PROC-059-PFM-H.
138300 PROC-057-PFM-F.
138400     MOVE 0 TO INCREMENT.
138500     MOVE     60.5 TO PERFORM4.
138600 PROC-058-PFM-G.
138700     MOVE 0 TO INCREMENT.
138800     ADD      10.3 TO PERFORM4.
138900 PROC-059-PFM-H.
139000     EXIT.
139100 PROC-000-PFM-I.
139200     MOVE 0 TO INCREMENT.
139300     PERFORM  PROC-000-NUCLEUS-FAILURE.
139400     GO TO    PROC-060-PFM-WRITE-4.
139500*    NOTE CONTROL SHOULD NOT PASS TO THIS PARAGRAPH
139600*    FROM THE PREVIOUS ONE.
139700 PROC-062-PFM-J.
139800     MOVE 0 TO INCREMENT.
139900     MOVE "YES" TO PERFORM1.
140000     PERFORM  PROC-063-PFM-L.
140100     MULTIPLY 3 BY PERFORM2.
140200 PROC-000-PFM-K.
140300     MOVE 0 TO INCREMENT.
140400     PERFORM  PROC-000-NUCLEUS-FAILURE.
140500     GO TO    PROC-064-PFM-WRITE-5.
140600*    NOTE CONTROL SHOULD NOT PASS TO THIS PARAGRAPH
140700*    FROM THE PREVIOUS ONE.
140800 PROC-063-PFM-L.
140900     MOVE 0 TO INCREMENT.
141000     MOVE     4 TO PERFORM2.
141100     ADD      100 TO PERFORM2.
141200 PROC-000-PFM-M.
141300     MOVE 0 TO INCREMENT.
141400     PERFORM  PROC-000-NUCLEUS-FAILURE.
141500     GO TO    PROC-064-PFM-WRITE-5.
141600*    NOTE CONTROL SHOULD NOT PASS TO THIS PARAGRAPH
141700*    FROM THE PREVIOUS ONE.
141800 PROC-066-PFM-N        SECTION.
141900 PROC-067-PFM-O.
142000     MOVE 0 TO INCREMENT.
142100     ADD 1 TO NUC-FAILURE-COUNT.
142200 PROC-068-PFM-P.
142300     MOVE 0 TO INCREMENT.
142400     SUBTRACT 1 FROM NUC-FAILURE-COUNT.
142500 PROC-000-PFM-Q        SECTION.
142600 PROC-000-PFM-R.
142700     MOVE 0 TO INCREMENT.
142800     PERFORM  PROC-000-NUCLEUS-FAILURE.
142900     GO TO    PROC-069-PFM-WRITE-6.
143000*    NOTE CONTROL SHOULD NOT PASS TO THIS PARAGRAPH FROM THE
143100*        PREVIOUS ONE.
143200 PROC-000-PFM-S.
143300     MOVE 0 TO INCREMENT.
143400     ADD      1 TO PERFORM5.
143500 PROC-000-PFM-T.
143600     MOVE 0 TO INCREMENT.
143700     ADD      10 TO PERFORM5.
143800 PROC-220-PFM-U.
143900     ADD 1 TO INCREMENT.
144000     ADD      100 TO PERFORM5.
144100     IF       PERFORM5 GREATER THAN 899
144200              MOVE PERFORM5 TO COMPUTED-N
144300              MOVE 707 TO CORRECT-N
144400              PERFORM PROC-000-NUCLEUS-FAILURE.
144500 PROC-071-PFM-V.       EXIT.
144600 PROC-072-PFM-W.       EXIT.
144700 PROC-073-PFM-X.       EXIT.
144800 PROC-074-PFM-Y.       EXIT.
144900 PROC-075-PFM-Z.       ADD  5  TO INCREMENT.
145000 CCVS-EXIT SECTION.
145100 CCVS-999999.
145200     GO TO CLOSE-FILES.
