000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     DB202A.
000400 AUTHOR.
000500     FEDERAL COMPILER TESTING CENTER.
000600 INSTALLATION.
000700     GENERAL SERVICES ADMINISTRATION
000800     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.
000900     SOFTWARE DEVELOPMENT OFFICE.
001000     5203 LEESBURG PIKE  SUITE 1100
001100     FALLS CHURCH VIRGINIA 22041.
001200
001300     PHONE   (703) 756-6153
001400
001500     " HIGH       ".
001600 DATE-WRITTEN.
001700     CCVS-74 VERSION 4.0 - 1980 JULY 1.
001800     CREATION DATE     /    VALIDATION DATE
001900     "4.2 ".
002000 SECURITY.
002100     NONE.
002200*
002300*    *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *
002400*
002500*                       PROGRAM ABSTRACT
002600*
002700*    DB202A TESTS THE CPABILITY OF THE DEBUG MODULE TO HANDLE
002800*    DEBUGGING PROCEDURES WHICH ARE MONITORING I-O FUNCTIONS
002900*    OF THE SEQUENTIAL I-O MODULE.  THIS PROGRAM IS TO BE
003000*    COMPILED AND EXECUTED WITH BOTH COMPILE AND OBJECT TIME
003100*    DEBUGGING SWITCHES ON.  THE DEBUGGING PROCEDURES SHOULD
003200*    BE INCLUDED IN COMPILATION AND GENERATE CODE.
003300*
003400*    DURING EXECUTION, A SEQUENTIAL FILE IS CREATED CONTAINING
003500*    80-CHARACTER RECORDS.  THE FILE US THEN READ.  EXECUTION
003600*    OF "OPEN", "READ", AND "WRITE" FUNCTION SHOULD TRIGGER THE
003700*    APPROPRIATE DEBUGGING PROCEDURES.
003800*
003900*
004000*
004100 ENVIRONMENT DIVISION.
004200 CONFIGURATION SECTION.
004300 SOURCE-COMPUTER.
004400     XXXXX082
004500     WITH DEBUGGING MODE.
004600 OBJECT-COMPUTER.
004700     XXXXX083.
004800 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
005000     SELECT PRINT-FILE ASSIGN TO
005100     XXXXX055.
005200     SELECT SEQ-FILE ASSIGN TO
005300     XXXXX014.
005400 DATA DIVISION.
005500 FILE SECTION.
005600 FD  PRINT-FILE
005700     LABEL RECORDS
005800     XXXXX084
005900     DATA RECORD IS PRINT-REC DUMMY-RECORD.
006000 01  PRINT-REC PICTURE X(120).
006100 01  DUMMY-RECORD PICTURE X(120).
006200 FD  SEQ-FILE
006300C    VALUE OF
006400C    XXXXX074
006500*      XXXXX074  REPLACE WITH IMPLEMENTOR NAME (*OPT C ONLY)
006600C    IS
006700C    XXXXX075
006800*      XXXXX075  REPLACE WITH VALUE CLAUSE OBJECT (*OPT C ONLY)
006900G    XXXXX069
007000*      XXXXX069  REPLACE WITH ADDITIONAL INFO (*OPT G ONLY)
007100     LABEL RECORDS ARE STANDARD.
007200 01  SEQ-REC-1 PIC X(120).
007300 01  SEQ-REC-2 PIC X(120).
007400 01  SEQ-REC-3 PIC X(120).
007500 WORKING-STORAGE SECTION.
007600 01  ITEM-1.
007700     02  KEY-1 PIC 99.
007800     02  LINE-1 PIC X(6).
007900     02  NAME-1 PIC X(30).
008000     02  UNQUAL-NAME-1 PIC X(30).
008100     02  CONTENTS-1 PIC X(120).
008200     02  CONTENTS-REC PIC X(120).
008300 01  FILE-RECORD-INFORMATION-REC.
008400     03 FILE-RECORD-INFO-SKELETON.
008500        05 FILLER                 PICTURE X(48)       VALUE
008600             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
008700        05 FILLER                 PICTURE X(46)       VALUE
008800             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
008900        05 FILLER                 PICTURE X(26)       VALUE
009000             ",LFIL=000000,ORG=  ,LBLR= ".
009100        05 FILLER                 PICTURE X(37)       VALUE
009200             ",RECKEY=                             ".
009300        05 FILLER                 PICTURE X(38)       VALUE
009400             ",ALTKEY1=                             ".
009500        05 FILLER                 PICTURE X(38)       VALUE
009600             ",ALTKEY2=                             ".
009700        05 FILLER                 PICTURE X(7)        VALUE SPACE.
009800     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
009900        05 FILE-RECORD-INFO-P1-120.
010000           07 FILLER              PIC X(5).
010100           07 XFILE-NAME           PIC X(6).
010200           07 FILLER              PIC X(8).
010300           07 XRECORD-NAME         PIC X(6).
010400           07 FILLER              PIC X(1).
010500           07 REELUNIT-NUMBER     PIC 9(1).
010600           07 FILLER              PIC X(7).
010700           07 XRECORD-NUMBER       PIC 9(6).
010800           07 FILLER              PIC X(6).
010900           07 UPDATE-NUMBER       PIC 9(2).
011000           07 FILLER              PIC X(5).
011100           07 ODO-NUMBER          PIC 9(4).
011200           07 FILLER              PIC X(5).
011300           07 XPROGRAM-NAME        PIC X(5).
011400           07 FILLER              PIC X(7).
011500           07 XRECORD-LENGTH       PIC 9(6).
011600           07 FILLER              PIC X(7).
011700           07 CHARS-OR-RECORDS    PIC X(2).
011800           07 FILLER              PIC X(1).
011900           07 XBLOCK-SIZE          PIC 9(4).
012000           07 FILLER              PIC X(6).
012100           07 RECORDS-IN-FILE     PIC 9(6).
012200           07 FILLER              PIC X(5).
012300           07 XFILE-ORGANIZATION   PIC X(2).
012400           07 FILLER              PIC X(6).
012500           07 XLABEL-TYPE          PIC X(1).
012600        05 FILE-RECORD-INFO-P121-240.
012700           07 FILLER              PIC X(8).
012800           07 XRECORD-KEY          PIC X(29).
012900           07 FILLER              PIC X(9).
013000           07 ALTERNATE-KEY1      PIC X(29).
013100           07 FILLER              PIC X(9).
013200           07 ALTERNATE-KEY2      PIC X(29).
013300           07 FILLER              PIC X(7).
013400 01  TEST-RESULTS.
013500     02 FILLER                    PICTURE X VALUE SPACE.
013600     02 FEATURE                   PICTURE X(20) VALUE SPACE.
013700     02 FILLER                    PICTURE X VALUE SPACE.
013800     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
013900     02 FILLER                    PICTURE X  VALUE SPACE.
014000     02  PAR-NAME.
014100       03 FILLER PICTURE X(12) VALUE SPACE.
014200       03  PARDOT-X PICTURE X  VALUE SPACE.
014300       03 DOTVALUE PICTURE 99  VALUE ZERO.
014400       03 FILLER PIC X(5) VALUE SPACE.
014500     02 FILLER PIC X(10) VALUE SPACE.
014600     02 RE-MARK PIC X(61).
014700 01  TEST-COMPUTED.
014800     02 FILLER PIC X(30) VALUE SPACE.
014900     02 FILLER PIC X(17) VALUE "       COMPUTED=".
015000     02 COMPUTED-X.
015100     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
015200     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
015300     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
015400     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
015500     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
015600     03       CM-18V0 REDEFINES COMPUTED-A.
015700         04 COMPUTED-18V0                   PICTURE -9(18).
015800         04 FILLER                          PICTURE X.
015900     03 FILLER PIC X(50) VALUE SPACE.
016000 01  TEST-CORRECT.
016100     02 FILLER PIC X(30) VALUE SPACE.
016200     02 FILLER PIC X(17) VALUE "       CORRECT =".
016300     02 CORRECT-X.
016400     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
016500     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
016600     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
016700     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
016800     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
016900     03      CR-18V0 REDEFINES CORRECT-A.
017000         04 CORRECT-18V0                    PICTURE -9(18).
017100         04 FILLER                          PICTURE X.
017200     03 FILLER PIC X(50) VALUE SPACE.
017300 01  CCVS-C-1.
017400     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
017500-    "SS  PARAGRAPH-NAME
017600-    "        REMARKS".
017700     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
017800 01  CCVS-C-2.
017900     02 FILLER PICTURE IS X VALUE IS SPACE.
018000     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
018100     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
018200     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
018300     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
018400 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
018500 01  REC-CT PICTURE 99 VALUE ZERO.
018600 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
018700 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
018800 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
018900 01  PASS-COUNTER PIC 999 VALUE ZERO.
019000 01  TOTAL-ERROR PIC 999 VALUE ZERO.
019100 01  ERROR-HOLD PIC 999 VALUE ZERO.
019200 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
019300 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
019400 01  CCVS-H-1.
019500     02  FILLER   PICTURE X(27)  VALUE SPACE.
019600     02 FILLER PICTURE X(67) VALUE
019700     " FEDERAL COMPILER TESTING CENTER COBOL COMPILER VALIDATION
019800-    " SYSTEM".
019900     02  FILLER     PICTURE X(26)  VALUE SPACE.
020000 01  CCVS-H-2.
020100     02 FILLER PICTURE X(52) VALUE IS
020200     "CCVS74 NCC  COPY, NOT FOR DISTRIBUTION.".
020300     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
020400     02 TEST-ID PICTURE IS X(9).
020500     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
020600 01  CCVS-H-3.
020700     02  FILLER PICTURE X(34) VALUE
020800     " FOR OFFICIAL USE ONLY    ".
020900     02  FILLER PICTURE X(58) VALUE
021000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
021100     02  FILLER PICTURE X(28) VALUE
021200     "  COPYRIGHT   1974 ".
021300 01  CCVS-E-1.
021400     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
021500     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
021600     02 ID-AGAIN PICTURE IS X(9).
021700     02 FILLER PICTURE X(45) VALUE IS
021800     " NTIS DISTRIBUTION COBOL 74".
021900 01  CCVS-E-2.
022000     02  FILLER                   PICTURE X(31)  VALUE
022100     SPACE.
022200     02  FILLER                   PICTURE X(21)  VALUE SPACE.
022300     02 CCVS-E-2-2.
022400         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
022500         03 FILLER PICTURE IS X VALUE IS SPACE.
022600         03 ENDER-DESC PIC X(44) VALUE "ERRORS ENCOUNTERED".
022700 01  CCVS-E-3.
022800     02  FILLER PICTURE X(22) VALUE
022900     " FOR OFFICIAL USE ONLY".
023000     02  FILLER PICTURE X(12) VALUE SPACE.
023100     02  FILLER PICTURE X(58) VALUE
023200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
023300     02  FILLER PICTURE X(13) VALUE SPACE.
023400     02 FILLER PIC X(15) VALUE " COPYRIGHT 1974".
023500 01  CCVS-E-4.
023600     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
023700     02 FILLER PIC XXXX VALUE " OF ".
023800     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
023900     02 FILLER PIC X(40) VALUE
024000      "  TESTS WERE EXECUTED SUCCESSFULLY".
024100 01  XXINFO.
024200     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
024300     02 INFO-TEXT.
024400     04 FILLER PIC X(20) VALUE SPACE.
024500     04 XXCOMPUTED PIC X(20).
024600     04 FILLER PIC X(5) VALUE SPACE.
024700     04 XXCORRECT PIC X(20).
024800 01  HYPHEN-LINE.
024900     02 FILLER PICTURE IS X VALUE IS SPACE.
025000     02 FILLER PICTURE IS X(65) VALUE IS "************************
025100-    "*****************************************".
025200     02 FILLER PICTURE IS X(54) VALUE IS "************************
025300-    "******************************".
025400 01  CCVS-PGM-ID PIC X(6) VALUE
025500     "DB202A".
025600 PROCEDURE DIVISION.
025700 DECLARATIVES.
025800 FILENAME-PROC SECTION.
025900     USE FOR DEBUGGING ON SEQ-FILE.
026000 FILENAME-1.
026100     MOVE 1 TO KEY-1.
026200 DB-COMMON.
026300     MOVE DEBUG-LINE TO LINE-1.
026400     MOVE DEBUG-NAME TO NAME-1 UNQUAL-NAME-1.
026500     MOVE DEBUG-CONTENTS TO CONTENTS-1.
026600     INSPECT UNQUAL-NAME-1 REPLACING CHARACTERS BY SPACES
026700         AFTER INITIAL SPACE.
026800 WRITE-PROC SECTION.
026900     USE FOR DEBUGGING ON ALL REFERENCES OF SEQ-REC-1  SEQ-REC-2.
027000 WRITE-1.
027100     ADD 1 TO KEY-1.
027200     PERFORM DB-COMMON.
027300     MOVE SEQ-REC-3 TO CONTENTS-REC.
027400 END DECLARATIVES.
027500 CCVS1 SECTION.
027600 OPEN-FILES.
027700     OPEN     OUTPUT PRINT-FILE.
027800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027900     MOVE    SPACE TO TEST-RESULTS.
028000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028100     GO TO CCVS1-EXIT.
028200 CLOSE-FILES.
028300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028400 TERMINATE-CCVS.
028500S    EXIT PROGRAM.
028600STERMINATE-CALL.
028700     STOP     RUN.
028800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
028900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
029200     MOVE "****TEST DELETED****" TO RE-MARK.
029300 PRINT-DETAIL.
029400     IF REC-CT NOT EQUAL TO ZERO
029500             MOVE "." TO PARDOT-X
029600             MOVE REC-CT TO DOTVALUE.
029700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
029800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
029900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030200     MOVE SPACE TO CORRECT-X.
030300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030400     MOVE     SPACE TO RE-MARK.
030500 HEAD-ROUTINE.
030600     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030700     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
030800     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
030900 COLUMN-NAMES-ROUTINE.
031000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031300 END-ROUTINE.
031400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031500 END-RTN-EXIT.
031600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031700 END-ROUTINE-1.
031800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
031900      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
032000      ADD PASS-COUNTER TO ERROR-HOLD.
032100*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032200      MOVE PASS-COUNTER TO CCVS-E-4-1.
032300      MOVE ERROR-HOLD TO CCVS-E-4-2.
032400      MOVE CCVS-E-4 TO CCVS-E-2-2.
032500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
032600  END-ROUTINE-12.
032700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
032800     IF       ERROR-COUNTER IS EQUAL TO ZERO
032900         MOVE "NO " TO ERROR-TOTAL
033000         ELSE
033100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033300     PERFORM WRITE-LINE.
033400 END-ROUTINE-13.
033500     IF DELETE-CNT IS EQUAL TO ZERO
033600         MOVE "NO " TO ERROR-TOTAL  ELSE
033700         MOVE DELETE-CNT TO ERROR-TOTAL.
033800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
033900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034000      IF   INSPECT-COUNTER EQUAL TO ZERO
034100          MOVE "NO " TO ERROR-TOTAL
034200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034600 WRITE-LINE.
034700     ADD 1 TO RECORD-COUNT.
034800Y    IF RECORD-COUNT GREATER 50
034900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035000Y        MOVE SPACE TO DUMMY-RECORD
035100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035200Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
035300Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
035400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
035500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
035600Y        MOVE ZERO TO RECORD-COUNT.
035700     PERFORM WRT-LN.
035800 WRT-LN.
035900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036000     MOVE SPACE TO DUMMY-RECORD.
036100 BLANK-LINE-PRINT.
036200     PERFORM WRT-LN.
036300 FAIL-ROUTINE.
036400     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036500     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036600     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
036700     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036800     GO TO FAIL-ROUTINE-EX.
036900 FAIL-ROUTINE-WRITE.
037000     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037100     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
037200 FAIL-ROUTINE-EX. EXIT.
037300 BAIL-OUT.
037400     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
037500     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
037600 BAIL-OUT-WRITE.
037700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
037800     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037900 BAIL-OUT-EX. EXIT.
038000 CCVS1-EXIT.
038100     EXIT.
038200 BEGIN-DB202A-TEST SECTION.
038300 OPEN-TEST-1-INIT.
038400     MOVE SPACES TO ITEM-1.
038500     MOVE 0 TO KEY-1.
038600     MOVE "OPEN-TEST-1" TO PAR-NAME.
038700     MOVE "DEBUG OPEN FILENAME" TO FEATURE.
038800******************************************************************
038900*    THE DEBUG-LINE (INSPT) TEST NAMED IN THE OUTPUT REPORT AS   *
039000*    "OPEN-TEST-1A" SHOULD POINT TO THE EXECUTABLE STATEMENT     *
039100*    WHICH FOLLOWS THIS COMMENT SET AND WHICH READS, "OPEN       *
039200*    OUTPUT SEQ-FILE.".                                          *
039300******************************************************************
039400 OPEN-TEST-1.
039500     OPEN OUTPUT SEQ-FILE.
039600     IF KEY-1 IS EQUAL TO 1
039700         PERFORM PASS
039800         MOVE "DEBUG PROC EXECUTED" TO RE-MARK
039900         PERFORM GEN-WRITE
040000         GO TO OPEN-TEST-1A
040100     ELSE PERFORM FAIL
040200         MOVE "DEBUG PROC NOT EXECUTED" TO RE-MARK
040300         PERFORM GEN-WRITE
040400         PERFORM DELETE-OPEN-TEST-1-SUBTESTS
040500         GO TO WRITE-TEST-1-INIT.
040600 OPEN-TEST-1-DELETE.
040700     PERFORM DE-LETE.
040800     PERFORM GEN-WRITE.
040900     PERFORM DELETE-OPEN-TEST-1-SUBTESTS.
041000     GO TO WRITE-TEST-1-INIT.
041100 DELETE-OPEN-TEST-1-SUBTESTS.
041200     MOVE "OPEN-TEST-1A" TO PAR-NAME.
041300     PERFORM DE-LETE.
041400     PERFORM GEN-WRITE.
041500     MOVE "OPEN-TEST-1B" TO PAR-NAME.
041600     PERFORM DE-LETE.
041700     PERFORM GEN-WRITE.
041800     MOVE "OPEN-TEST-1C" TO PAR-NAME.
041900     PERFORM DE-LETE.
042000     PERFORM GEN-WRITE.
042100 OPEN-TEST-1A.
042200     MOVE "OPEN-TEST-1A" TO PAR-NAME.
042300     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
042400     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
042500     MOVE LINE-1 TO COMPUTED-A.
042600     PERFORM INSPT.
042700     PERFORM GEN-WRITE.
042800 OPEN-TEST-1B.
042900     MOVE "OPEN-TEST-1B" TO PAR-NAME.
043000     IF UNQUAL-NAME-1 IS EQUAL TO "SEQ-FILE"
043100         PERFORM PASS
043200     ELSE  PERFORM FAIL
043300         MOVE NAME-1 TO COMPUTED-A
043400     MOVE "SEQ-FILE" TO CORRECT-A.
043500     MOVE "DEBUG-NAME" TO RE-MARK.
043600     PERFORM GEN-WRITE.
043700 OPEN-TEST-1C.
043800     MOVE "OPEN-TEST-1C" TO PAR-NAME.
043900     IF CONTENTS-1 IS EQUAL TO SPACES
044000         PERFORM PASS
044100     ELSE PERFORM FAIL
044200         MOVE CONTENTS-1 TO COMPUTED-A
044300         MOVE "(SPACES)" TO CORRECT-A.
044400     MOVE "DEBUG-CONTENTS" TO RE-MARK.
044500     PERFORM GEN-WRITE.
044600 WRITE-TEST-1-INIT.
044700     MOVE "WRITE-TEST-1" TO PAR-NAME.
044800     MOVE SPACES TO ITEM-1.
044900     MOVE 0 TO KEY-1.
045000     MOVE "DEBUG WRITE/ALL REF" TO FEATURE.
045100     MOVE FILE-RECORD-INFO-SKELETON TO FILE-RECORD-INFO (1).
045200     MOVE "SEQ-FI" TO XFILE-NAME (1).
045300     MOVE "REC-1" TO XRECORD-NAME (1).
045400     MOVE ".XXX." TO XPROGRAM-NAME (1).
045500     MOVE 120 TO XRECORD-LENGTH (1).
045600     MOVE "RC" TO CHARS-OR-RECORDS (1).
045700     MOVE 1 TO XBLOCK-SIZE (1).
045800     MOVE 30 TO RECORDS-IN-FILE (1).
045900     MOVE "SQ" TO XFILE-ORGANIZATION (1).
046000     MOVE "S" TO XLABEL-TYPE (1).
046100 WRITE-TEST-1.
046200     PERFORM WRITE-REC-1  10  TIMES.
046300     IF KEY-1 IS EQUAL TO 10
046400         PERFORM PASS
046500         MOVE "DEBUG PROC EXECUTED 10 TIMES" TO RE-MARK
046600     ELSE PERFORM FAIL
046700         MOVE "NO. TIMES DEBUG PROC EXECUTED" TO RE-MARK
046800         MOVE KEY-1 TO COMPUTED-18V0
046900         MOVE 10 TO CORRECT-18V0.
047000     PERFORM GEN-WRITE.
047100     IF KEY-1 IS EQUAL TO 0
047200         PERFORM DELETE-WRITE-TEST-1-SUBTESTS
047300         GO TO WRITE-TEST-2-INIT
047400     ELSE  GO TO WRITE-TEST-1A.
047500 WRITE-TEST-1-DELETE.
047600     PERFORM DE-LETE.
047700     PERFORM GEN-WRITE.
047800     PERFORM DELETE-WRITE-TEST-1-SUBTESTS
047900     GO TO WRITE-TEST-2-INIT.
048000 DELETE-WRITE-TEST-1-SUBTESTS.
048100     MOVE "WRITE-TEST-1A" TO PAR-NAME.
048200     PERFORM DE-LETE.
048300     PERFORM GEN-WRITE.
048400     MOVE "WRITE-TEST-1B" TO PAR-NAME.
048500     PERFORM DE-LETE.
048600     PERFORM GEN-WRITE.
048700     MOVE "WRITE-TEST-1C" TO PAR-NAME.
048800     PERFORM DE-LETE.
048900     PERFORM GEN-WRITE.
049000     MOVE "WRITE-TEST-1D" TO PAR-NAME.
049100     PERFORM DE-LETE.
049200     PERFORM GEN-WRITE.
049300 WRITE-REC-1.
049400     MOVE SPACES TO SEQ-REC-3.
049500     ADD 1 TO XRECORD-NUMBER (1).
049600******************************************************************
049700*    THE DEBUG-LINE (INSPT) TEST NAMED IN THE OUTPUT REPORT AS   *
049800*    "WRITE-TEST-1A" SHOULD POINT TO THE EXECUTABLE STATEMENT    *
049900*    WHICH FOLLOWS THIS COMMENT SET AND WHICH READS,             *
050000*    "WRITE SEQ-REC-1 FROM FILE-RECORD-INFO-P1-120 (1).".        *
050100******************************************************************
050200     WRITE SEQ-REC-1 FROM FILE-RECORD-INFO-P1-120 (1).
050300 WRITE-TEST-1A.
050400     MOVE "WRITE-TEST-1A" TO PAR-NAME.
050500     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
050600     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
050700     MOVE LINE-1 TO COMPUTED-A.
050800     PERFORM INSPT.
050900     PERFORM GEN-WRITE.
051000 WRITE-TEST-1B.
051100     MOVE "WRITE-TEST-1B" TO PAR-NAME.
051200     IF UNQUAL-NAME-1 IS EQUAL TO "SEQ-REC-1"
051300         PERFORM PASS
051400     ELSE  PERFORM FAIL
051500         MOVE "SEQ-REC-1" TO CORRECT-A
051600         MOVE NAME-1 TO COMPUTED-A.
051700     MOVE "DEBUG-NAME" TO RE-MARK.
051800     PERFORM GEN-WRITE.
051900 WRITE-TEST-1C.
052000     MOVE "WRITE-TEST-1C" TO PAR-NAME.
052100     IF CONTENTS-REC IS EQUAL TO FILE-RECORD-INFO-P1-120 (1)
052200         PERFORM PASS
052300         MOVE "PROC EXECUTED AT PROPER TIME" TO RE-MARK
052400         PERFORM GEN-WRITE
052500         GO TO WRITE-TEST-1D
052600     ELSE  PERFORM FAIL
052700         MOVE "PROC NOT EXEC BETW MOVE / WRITE" TO RE-MARK
052800         MOVE "1ST LINE = REC AREA" TO COMPUTED-A
052900         MOVE "2ND LINE = FROM FLD" TO CORRECT-A
053000         PERFORM GEN-WRITE.
053100     MOVE CONTENTS-REC TO PRINT-REC.
053200     PERFORM WRITE-LINE.
053300     MOVE FILE-RECORD-INFO-P1-120 (1) TO PRINT-REC.
053400     PERFORM WRITE-LINE.
053500 WRITE-TEST-1D.
053600     MOVE "WRITE-TEST-1D" TO PAR-NAME.
053700     MOVE "DEBUG-CONTENTS" TO RE-MARK.
053800     IF CONTENTS-1 IS EQUAL TO FILE-RECORD-INFO-P1-120 (1)
053900         PERFORM PASS
054000         PERFORM GEN-WRITE
054100         GO TO WRITE-TEST-2-INIT
054200     ELSE  PERFORM FAIL
054300         MOVE "SEE 1ST LINE FOLLOW" TO COMPUTED-A
054400         MOVE "SEE 2ND LINE FOLLOW" TO CORRECT-A
054500         PERFORM GEN-WRITE.
054600     MOVE CONTENTS-1 TO PRINT-REC.
054700     PERFORM WRITE-LINE.
054800     MOVE FILE-RECORD-INFO-P1-120 (1) TO PRINT-REC.
054900     PERFORM WRITE-LINE.
055000 WRITE-TEST-2-INIT.
055100     MOVE "WRITE-TEST-2" TO PAR-NAME.
055200     MOVE SPACES TO ITEM-1.
055300     MOVE 0 TO KEY-1.
055400     MOVE "DEBUG WRITE/NOT ALL" TO FEATURE.
055500     MOVE 10 TO XRECORD-NUMBER (1).
055600     MOVE "REC-2" TO XRECORD-NAME (1).
055700 WRITE-TEST-2.
055800     PERFORM WRITE-REC-2 10 TIMES.
055900     IF KEY-1 IS EQUAL TO 10
056000         PERFORM PASS
056100         MOVE "DEBUG PROC EXECUTED 10 TIMES" TO RE-MARK
056200     ELSE  PERFORM FAIL
056300         MOVE "NO. TIMES DEBUG PROC EXECUTED" TO RE-MARK
056400         MOVE KEY-1 TO COMPUTED-18V0
056500         MOVE 10 TO CORRECT-18V0.
056600     PERFORM GEN-WRITE.
056700     IF KEY-1 IS EQUAL TO 0
056800         PERFORM DELETE-WRITE-TEST-2-SUBTESTS
056900         GO TO WRITE-TEST-3-INIT
057000     ELSE GO TO WRITE-TEST-2A.
057100 WRITE-TEST-2-DELETE.
057200     PERFORM DE-LETE.
057300     PERFORM GEN-WRITE.
057400     PERFORM DELETE-WRITE-TEST-2-SUBTESTS
057500     GO TO WRITE-TEST-3-INIT.
057600 DELETE-WRITE-TEST-2-SUBTESTS.
057700     MOVE "WRITE-TEST-2A" TO PAR-NAME.
057800     PERFORM DE-LETE.
057900     PERFORM GEN-WRITE.
058000     MOVE "WRITE-TEST-2B" TO PAR-NAME.
058100     PERFORM DE-LETE.
058200     PERFORM GEN-WRITE.
058300     MOVE "WRITE-TEST-2C" TO PAR-NAME.
058400     PERFORM DE-LETE.
058500     PERFORM GEN-WRITE.
058600 WRITE-REC-2.
058700     MOVE SPACES TO SEQ-REC-3.
058800     ADD 1 TO XRECORD-NUMBER (1).
058900     WRITE SEQ-REC-2 FROM FILE-RECORD-INFO-P1-120 (1).
059000 WRITE-TEST-2A.
059100     MOVE "WRITE-TEST-2A" TO PAR-NAME.
059200     IF UNQUAL-NAME-1 IS EQUAL TO "SEQ-REC-2"
059300         PERFORM PASS
059400     ELSE  PERFORM FAIL
059500         MOVE "SEQ-REC-2" TO CORRECT-A
059600         MOVE NAME-1 TO COMPUTED-A.
059700     MOVE "DEBUG-NAME" TO RE-MARK.
059800     PERFORM GEN-WRITE.
059900 WRITE-TEST-2B.
060000     MOVE "WRITE-TEST-2B" TO PAR-NAME.
060100     IF CONTENTS-REC IS EQUAL TO FILE-RECORD-INFO-P1-120 (1)
060200         PERFORM PASS
060300         MOVE "PROC EXECUTED AT PROPER TIME" TO RE-MARK
060400         PERFORM GEN-WRITE
060500         GO TO WRITE-TEST-2C
060600     ELSE  PERFORM FAIL
060700         MOVE "PROC NOT EXEC BTWN MOVE / WRITE" TO RE-MARK
060800         MOVE "1ST LINE = REC AREA" TO COMPUTED-A
060900         MOVE "2ND LINE = FROM FLD" TO CORRECT-A
061000         PERFORM GEN-WRITE.
061100     MOVE CONTENTS-REC TO PRINT-REC.
061200     PERFORM WRITE-LINE.
061300     MOVE FILE-RECORD-INFO-P1-120 (1) TO PRINT-REC.
061400     PERFORM WRITE-LINE.
061500 WRITE-TEST-2C.
061600     MOVE "WRITE-TEST-2C" TO PAR-NAME.
061700     MOVE "DEBUG-CONTENTS" TO RE-MARK.
061800     IF CONTENTS-1 IS EQUAL TO FILE-RECORD-INFO-P1-120 (1)
061900         PERFORM PASS
062000         PERFORM GEN-WRITE
062100         GO TO WRITE-TEST-3-INIT
062200     ELSE  PERFORM FAIL
062300         MOVE "SEE 1ST LINE FOLLOW" TO COMPUTED-A
062400         MOVE "SEE 2ND LINE FOLLOW" TO CORRECT-A
062500         PERFORM GEN-WRITE.
062600     MOVE CONTENTS-1 TO PRINT-REC.
062700     PERFORM WRITE-LINE.
062800     MOVE FILE-RECORD-INFO-P1-120 (1) TO PRINT-REC.
062900     PERFORM WRITE-LINE.
063000 WRITE-TEST-3-INIT.
063100     MOVE SPACES TO ITEM-1
063200     MOVE 0 TO KEY-1
063300     MOVE "WRITE/NO DEBUG PROC" TO FEATURE.
063400     MOVE "WRITE-TEST-3" TO PAR-NAME.
063500     MOVE "REC-3" TO XRECORD-NAME (1)
063600     MOVE 20 TO XRECORD-NUMBER (1).
063700 WRITE-TEST-3.
063800     PERFORM WRITE-REC-3 10 TIMES.
063900     IF KEY-1 IS EQUAL TO 0
064000         PERFORM PASS
064100         MOVE  "DEBUG PROC NOT EXECUTED" TO RE-MARK
064200     ELSE  PERFORM FAIL
064300         MOVE "NO. TIMES DEBUG PROC EXECUTED" TO RE-MARK
064400         MOVE KEY-1 TO COMPUTED-18V0
064500         MOVE 0 TO CORRECT-18V0.
064600         PERFORM GEN-WRITE.
064700     GO TO CLOSE-TEST-1-INIT.
064800 WRITE-TEST-3-DELETE.
064900     PERFORM DE-LETE.
065000     PERFORM GEN-WRITE.
065100     GO TO CLOSE-TEST-1-INIT.
065200 WRITE-REC-3.
065300     MOVE SPACES TO SEQ-REC-3.
065400     ADD 1 TO XRECORD-NUMBER (1).
065500     WRITE SEQ-REC-3 FROM FILE-RECORD-INFO-P1-120 (1).
065600 CLOSE-TEST-1-INIT.
065700     MOVE SPACES TO ITEM-1.
065800     MOVE 0 TO KEY-1.
065900     MOVE "CLOSE-TEST-1" TO PAR-NAME.
066000     MOVE "DEBUG CLOSE FILENAME" TO FEATURE.
066100******************************************************************
066200*    THE DEBUG-LINE (INSPT) TEST NAMED IN THE OUTPUT REPORT AS   *
066300*    "CLOSE-TEST-1A" SHOULD POINT TO THE EXECUTABLE STATEMENT    *
066400*    WHICH FOLLOWS THIS COMMENT SET AND WHICH READS,             *
066500*    "CLOSE SEQ-FILE.".                                          *
066600******************************************************************
066700 CLOSE-TEST-1.
066800     CLOSE SEQ-FILE.
066900     IF KEY-1 IS EQUAL TO 1
067000         PERFORM PASS
067100         MOVE "DEBUG PROC EXECUTED" TO RE-MARK
067200         PERFORM GEN-WRITE
067300         GO TO CLOSE-TEST-1A
067400     ELSE PERFORM  FAIL
067500         MOVE "DEBUG PROC NOT EXECUTED" TO RE-MARK
067600         PERFORM GEN-WRITE
067700         PERFORM DELETE-CLOSE-TEST-1-SUBTESTS
067800         GO TO OPEN-TEST-2-INIT.
067900 CLOSE-TEST-1-DELETE.
068000     PERFORM DE-LETE.
068100     PERFORM GEN-WRITE.
068200     PERFORM DELETE-CLOSE-TEST-1-SUBTESTS.
068300     GO TO OPEN-TEST-2-INIT.
068400 DELETE-CLOSE-TEST-1-SUBTESTS.
068500     MOVE "CLOSE-TEST-1A" TO PAR-NAME.
068600     PERFORM DE-LETE.
068700     PERFORM GEN-WRITE.
068800     MOVE "CLOSE-TEST-1B" TO PAR-NAME.
068900     PERFORM DE-LETE.
069000     PERFORM GEN-WRITE.
069100     MOVE "CLOSE-TEST-1C" TO PAR-NAME.
069200     PERFORM DE-LETE.
069300     PERFORM GEN-WRITE.
069400 CLOSE-TEST-1A.
069500     MOVE "CLOSE-TEST-1A" TO PAR-NAME.
069600     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
069700     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
069800     MOVE LINE-1 TO COMPUTED-A.
069900     PERFORM INSPT.
070000     PERFORM GEN-WRITE.
070100 CLOSE-TEST-1B.
070200     MOVE "CLOSE-TEST-1B" TO PAR-NAME.
070300     IF UNQUAL-NAME-1 IS EQUAL TO "SEQ-FILE"
070400         PERFORM PASS
070500     ELSE  PERFORM FAIL
070600         MOVE NAME-1 TO COMPUTED-A
070700         MOVE "SEQ-FILE" TO CORRECT-A.
070800     MOVE "DEBUG-NAME" TO RE-MARK.
070900     PERFORM GEN-WRITE.
071000 CLOSE-TEST-1C.
071100     MOVE "OPEN-TEST-1C" TO PAR-NAME.
071200     IF CONTENTS-1 IS EQUAL TO SPACES
071300         PERFORM PASS
071400     ELSE PERFORM FAIL
071500         MOVE CONTENTS-1 TO COMPUTED-A
071600         MOVE "(SPACES)" TO CORRECT-A.
071700     MOVE "DEBUG-CONTENTS" TO RE-MARK.
071800     PERFORM GEN-WRITE.
071900 OPEN-TEST-2-INIT.
072000     MOVE SPACES TO ITEM-1.
072100     MOVE 0 TO KEY-1.
072200     MOVE "OPEN-TEST-2" TO PAR-NAME.
072300     MOVE "DEBUG OPEN FILENAME" TO FEATURE.
072400 OPEN-TEST-2.
072500     OPEN INPUT SEQ-FILE.
072600     IF KEY-1 IS EQUAL TO 1
072700         PERFORM PASS
072800         MOVE "DEBUG PROC EXECUTED" TO RE-MARK
072900     ELSE PERFORM FAIL
073000         MOVE "DEBUG PROC NOT EXECUTED" TO RE-MARK.
073100     PERFORM GEN-WRITE.
073200     GO TO READ-TEST-1-INIT.
073300 OPEN-TEST-2-DELETE.
073400     PERFORM DE-LETE.
073500     PERFORM GEN-WRITE.
073600 READ-TEST-1-INIT.
073700     MOVE SPACES TO ITEM-1.
073800     MOVE 0 TO KEY-1.
073900     MOVE "READ-TEST-1" TO PAR-NAME.
074000     MOVE "DEBUG READ FILENAME" TO FEATURE.
074100******************************************************************
074200*    THE DEBUG-LINE (INSPT) TEST NAMED IN THE OUTPUT REPORT AS   *
074300*    "READ-TEST-1A" SHOULD POINT TO THE EXECUTABLE STATEMENT     *
074400*    WHICH FOLLOWS THIS COMMENT SET AND WHICH READS, "READ       *
074500*    SEQ-FILE AT END PERFORM READ-TEST-1-DELETE GO TO            *
074600*    READ-TEST-2.".                                              *
074700******************************************************************
074800 READ-TEST-1.
074900     READ SEQ-FILE  AT END
075000         PERFORM READ-TEST-1-DELETE
075100         GO TO READ-TEST-2.
075200     IF KEY-1 IS EQUAL TO 1
075300         PERFORM PASS
075400         MOVE "DEBUG PROC EXECUTED" TO RE-MARK
075500         PERFORM GEN-WRITE
075600         GO TO READ-TEST-1A
075700     ELSE  PERFORM FAIL
075800         MOVE "DEBUG PROC NOT EXECUTED" TO RE-MARK
075900         PERFORM GEN-WRITE
076000         PERFORM DELETE-READ-TEST-1-SUBTESTS
076100          GO TO READ-TEST-2-INIT.
076200 READ-TEST-1-DELETE.
076300     PERFORM DE-LETE.
076400     PERFORM GEN-WRITE.
076500     PERFORM DELETE-READ-TEST-1-SUBTESTS.
076600 READ-TEST-1-DELETE-A.
076700     GO TO READ-TEST-2-DELETE.
076800 DELETE-READ-TEST-1-SUBTESTS.
076900     MOVE "READ-TEST-1A" TO PAR-NAME.
077000     PERFORM DE-LETE.
077100     PERFORM GEN-WRITE.
077200     MOVE "READ-TEST-1B" TO PAR-NAME.
077300     PERFORM DE-LETE.
077400     PERFORM GEN-WRITE.
077500     MOVE "READ-TEST-1C" TO PAR-NAME.
077600     PERFORM DE-LETE.
077700     PERFORM GEN-WRITE.
077800 READ-TEST-1A.
077900     MOVE "READ-TEST-1A" TO PAR-NAME.
078000     MOVE "DEBUG-LINE; SEE NEXT LINE" TO RE-MARK.
078100     MOVE "<===  DEBUG-LINE" TO CORRECT-A.
078200     MOVE LINE-1 TO COMPUTED-A.
078300     PERFORM INSPT.
078400     PERFORM GEN-WRITE.
078500 READ-TEST-1B.
078600     MOVE "READ-TEST-1B" TO PAR-NAME.
078700     IF UNQUAL-NAME-1 IS EQUAL TO "SEQ-FILE"
078800         PERFORM PASS
078900     ELSE PERFORM FAIL
079000         MOVE "SEQ-FILE" TO CORRECT-A
079100         MOVE NAME-1 TO COMPUTED-A.
079200     MOVE "DEBUG-NAME" TO RE-MARK.
079300     PERFORM GEN-WRITE.
079400 READ-TEST-1C.
079500     MOVE "DEBUG-CONTENTS" TO RE-MARK.
079600     MOVE "READ-TEST-1C" TO PAR-NAME.
079700     IF CONTENTS-1 IS EQUAL TO SEQ-REC-3
079800         PERFORM PASS
079900         PERFORM GEN-WRITE
080000         GO TO READ-TEST-2-INIT
080100     ELSE PERFORM FAIL
080200         MOVE "SEE 1ST LINE FOLLOW" TO COMPUTED-A
080300         MOVE "SEE 2ND LINE FOLLOW" TO CORRECT-A
080400         PERFORM GEN-WRITE.
080500     MOVE CONTENTS-1 TO PRINT-REC.
080600     PERFORM WRITE-LINE.
080700     MOVE SEQ-REC-3 TO PRINT-REC.
080800     PERFORM WRITE-LINE.
080900 READ-TEST-2-INIT.
081000     MOVE SPACES TO ITEM-1.
081100     MOVE 0 TO KEY-1.
081200     READ SEQ-FILE  AT END GO TO READ-TEST-2.
081300     GO TO READ-TEST-2-INIT.
081400 READ-TEST-2-DELETE.
081500     MOVE "DEBUG READ AT END" TO FEATURE.
081600     MOVE "READ-TEST-2" TO PAR-NAME.
081700     PERFORM DE-LETE.
081800     PERFORM GEN-WRITE.
081900     GO TO CLOSE-SEQ-FILE.
082000 READ-TEST-2.
082100     MOVE "DEBUG READ AT END" TO FEATURE.
082200     MOVE "READ-TEST-2" TO PAR-NAME.
082300     IF KEY-1 IS EQUAL TO 0
082400         PERFORM PASS
082500         MOVE "DEBUG PROC NOT EXECUTED" TO RE-MARK
082600     ELSE  PERFORM FAIL
082700         MOVE "DEBUG PROC WAS EXECUTED" TO RE-MARK.
082800 GEN-WRITE.
082900     PERFORM PRINT-DETAIL.
083000 CLOSE-SEQ-FILE.
083100     CLOSE SEQ-FILE.
083200XTAPE-DUMP SECTION.
083300XOPEN-FILE.
083400X    OPEN INPUT SEQ-FILE.
083500XREAD-FILE.
083600X    READ SEQ-FILE AT END GO TO CLOSE-FILE.
083700X    MOVE SEQ-REC-3 TO PRINT-REC.
083800X    PERFORM WRITE-LINE.
083900X    GO TO READ-FILE.
084000XCLOSE-FILE.
084100X    CLOSE SEQ-FILE.
084200 CCVS-EXIT SECTION.
084300 CCVS-999999.
084400     GO TO CLOSE-FILES.
