000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IC108A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*        THE PROGRAM IC108 IS THE MAIN PROGRAM WHICH STARTS
002200*    A SEQUENCE OF CALLS TO THE SUBPROGRAMS IC109A,IC110A AND
002300*    IC111A.  PARAMETERS ARE SET IN EACH OF THESE SUBPROGRAMS
002400*    AND CHECKED WHEN CONTROL IS RETURNED TO THE MAIN PROGRAM.
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.
002800     XXXXX082.
002900 OBJECT-COMPUTER.
003000     XXXXX083.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300     SELECT PRINT-FILE ASSIGN TO
003400     XXXXX055.
003500 DATA DIVISION.
003600 FILE SECTION.
003700 FD  PRINT-FILE.
003800 01  PRINT-REC PICTURE X(120).
003900 01  DUMMY-RECORD PICTURE X(120).
004000 WORKING-STORAGE SECTION.
004100 01  GRP-01.
004200     02  SUB-CALLED.
004300         03  DN1 PICTURE X(6).
004400         03  DN2 PICTURE X(6).
004500         03  DN3 PICTURE X(6).
004600     02  TIMES-CALLED.
004700         03  DN4 PICTURE S999    VALUE ZERO.
004800         03  DN5 PICTURE S999    VALUE ZERO.
004900         03  DN6 PICTURE S999    VALUE ZERO.
005000     02  SPECIAL-FLAGS.
005100         03  DN7 PICTURE X.
005200         03  DN8 PICTURE X.
005300         03  DN9 PICTURE X.
005400 01  TEST-RESULTS.
005500     02 FILLER                   PIC X      VALUE SPACE.
005600     02 FEATURE                  PIC X(20)  VALUE SPACE.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005900     02 FILLER                   PIC X      VALUE SPACE.
006000     02  PAR-NAME.
006100       03 FILLER                 PIC X(19)  VALUE SPACE.
006200       03  PARDOT-X              PIC X      VALUE SPACE.
006300       03 DOTVALUE               PIC 99     VALUE ZERO.
006400     02 FILLER                   PIC X(8)   VALUE SPACE.
006500     02 RE-MARK                  PIC X(61).
006600 01  TEST-COMPUTED.
006700     02 FILLER                   PIC X(30)  VALUE SPACE.
006800     02 FILLER                   PIC X(17)  VALUE
006900            "       COMPUTED=".
007000     02 COMPUTED-X.
007100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007200     03 COMPUTED-N               REDEFINES COMPUTED-A
007300                                 PIC -9(9).9(9).
007400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007700     03       CM-18V0 REDEFINES COMPUTED-A.
007800         04 COMPUTED-18V0                    PIC -9(18).
007900         04 FILLER                           PIC X.
008000     03 FILLER PIC X(50) VALUE SPACE.
008100 01  TEST-CORRECT.
008200     02 FILLER PIC X(30) VALUE SPACE.
008300     02 FILLER PIC X(17) VALUE "       CORRECT =".
008400     02 CORRECT-X.
008500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009000     03      CR-18V0 REDEFINES CORRECT-A.
009100         04 CORRECT-18V0                     PIC -9(18).
009200         04 FILLER                           PIC X.
009300     03 FILLER PIC X(2) VALUE SPACE.
009400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009500 01  CCVS-C-1.
009600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
009700-    "SS  PARAGRAPH-NAME
009800-    "       REMARKS".
009900     02 FILLER                     PIC X(20)    VALUE SPACE.
010000 01  CCVS-C-2.
010100     02 FILLER                     PIC X        VALUE SPACE.
010200     02 FILLER                     PIC X(6)     VALUE "TESTED".
010300     02 FILLER                     PIC X(15)    VALUE SPACE.
010400     02 FILLER                     PIC X(4)     VALUE "FAIL".
010500     02 FILLER                     PIC X(94)    VALUE SPACE.
010600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
010700 01  REC-CT                        PIC 99       VALUE ZERO.
010800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
010900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
011000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
011100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
011200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
011300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
011400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
011500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
011600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
011700 01  CCVS-H-1.
011800     02  FILLER                    PIC X(39)    VALUE SPACES.
011900     02  FILLER                    PIC X(42)    VALUE
012000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
012100     02  FILLER                    PIC X(39)    VALUE SPACES.
012200 01  CCVS-H-2A.
012300   02  FILLER                        PIC X(40)  VALUE SPACE.
012400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
012500   02  FILLER                        PIC XXXX   VALUE
012600     "4.2 ".
012700   02  FILLER                        PIC X(28)  VALUE
012800            " COPY - NOT FOR DISTRIBUTION".
012900   02  FILLER                        PIC X(41)  VALUE SPACE.
013000
013100 01  CCVS-H-2B.
013200   02  FILLER                        PIC X(15)  VALUE
013300            "TEST RESULT OF ".
013400   02  TEST-ID                       PIC X(9).
013500   02  FILLER                        PIC X(4)   VALUE
013600            " IN ".
013700   02  FILLER                        PIC X(12)  VALUE
013800     " HIGH       ".
013900   02  FILLER                        PIC X(22)  VALUE
014000            " LEVEL VALIDATION FOR ".
014100   02  FILLER                        PIC X(58)  VALUE
014200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014300 01  CCVS-H-3.
014400     02  FILLER                      PIC X(34)  VALUE
014500            " FOR OFFICIAL USE ONLY    ".
014600     02  FILLER                      PIC X(58)  VALUE
014700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
014800     02  FILLER                      PIC X(28)  VALUE
014900            "  COPYRIGHT   1985 ".
015000 01  CCVS-E-1.
015100     02 FILLER                       PIC X(52)  VALUE SPACE.
015200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
015300     02 ID-AGAIN                     PIC X(9).
015400     02 FILLER                       PIC X(45)  VALUE SPACES.
015500 01  CCVS-E-2.
015600     02  FILLER                      PIC X(31)  VALUE SPACE.
015700     02  FILLER                      PIC X(21)  VALUE SPACE.
015800     02 CCVS-E-2-2.
015900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
016000         03 FILLER                   PIC X      VALUE SPACE.
016100         03 ENDER-DESC               PIC X(44)  VALUE
016200            "ERRORS ENCOUNTERED".
016300 01  CCVS-E-3.
016400     02  FILLER                      PIC X(22)  VALUE
016500            " FOR OFFICIAL USE ONLY".
016600     02  FILLER                      PIC X(12)  VALUE SPACE.
016700     02  FILLER                      PIC X(58)  VALUE
016800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016900     02  FILLER                      PIC X(13)  VALUE SPACE.
017000     02 FILLER                       PIC X(15)  VALUE
017100             " COPYRIGHT 1985".
017200 01  CCVS-E-4.
017300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
017400     02 FILLER                       PIC X(4)   VALUE " OF ".
017500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
017600     02 FILLER                       PIC X(40)  VALUE
017700      "  TESTS WERE EXECUTED SUCCESSFULLY".
017800 01  XXINFO.
017900     02 FILLER                       PIC X(19)  VALUE
018000            "*** INFORMATION ***".
018100     02 INFO-TEXT.
018200       04 FILLER                     PIC X(8)   VALUE SPACE.
018300       04 XXCOMPUTED                 PIC X(20).
018400       04 FILLER                     PIC X(5)   VALUE SPACE.
018500       04 XXCORRECT                  PIC X(20).
018600     02 INF-ANSI-REFERENCE           PIC X(48).
018700 01  HYPHEN-LINE.
018800     02 FILLER  PIC IS X VALUE IS SPACE.
018900     02 FILLER  PIC IS X(65)    VALUE IS "************************
019000-    "*****************************************".
019100     02 FILLER  PIC IS X(54)    VALUE IS "************************
019200-    "******************************".
019300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
019400     "IC108A".
019500 PROCEDURE DIVISION.
019600 CCVS1 SECTION.
019700 OPEN-FILES.
019800     OPEN     OUTPUT PRINT-FILE.
019900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
020000     MOVE    SPACE TO TEST-RESULTS.
020100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
020200     GO TO CCVS1-EXIT.
020300 CLOSE-FILES.
020400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
020500 TERMINATE-CCVS.
020600S    EXIT PROGRAM.
020700STERMINATE-CALL.
020800     STOP     RUN.
020900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
021000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
021100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
021200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
021300     MOVE "****TEST DELETED****" TO RE-MARK.
021400 PRINT-DETAIL.
021500     IF REC-CT NOT EQUAL TO ZERO
021600             MOVE "." TO PARDOT-X
021700             MOVE REC-CT TO DOTVALUE.
021800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
021900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
022000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
022100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
022200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
022300     MOVE SPACE TO CORRECT-X.
022400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
022500     MOVE     SPACE TO RE-MARK.
022600 HEAD-ROUTINE.
022700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023100 COLUMN-NAMES-ROUTINE.
023200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
023500 END-ROUTINE.
023600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
023700 END-RTN-EXIT.
023800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023900 END-ROUTINE-1.
024000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
024100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
024200      ADD PASS-COUNTER TO ERROR-HOLD.
024300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
024400      MOVE PASS-COUNTER TO CCVS-E-4-1.
024500      MOVE ERROR-HOLD TO CCVS-E-4-2.
024600      MOVE CCVS-E-4 TO CCVS-E-2-2.
024700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
024800  END-ROUTINE-12.
024900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
025000     IF       ERROR-COUNTER IS EQUAL TO ZERO
025100         MOVE "NO " TO ERROR-TOTAL
025200         ELSE
025300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
025400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
025500     PERFORM WRITE-LINE.
025600 END-ROUTINE-13.
025700     IF DELETE-COUNTER IS EQUAL TO ZERO
025800         MOVE "NO " TO ERROR-TOTAL  ELSE
025900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
026000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
026100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026200      IF   INSPECT-COUNTER EQUAL TO ZERO
026300          MOVE "NO " TO ERROR-TOTAL
026400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
026500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
026600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026800 WRITE-LINE.
026900     ADD 1 TO RECORD-COUNT.
027000Y    IF RECORD-COUNT GREATER 50
027100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
027200Y        MOVE SPACE TO DUMMY-RECORD
027300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
027400Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
027500Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
027600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
027700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
027800Y        MOVE ZERO TO RECORD-COUNT.
027900     PERFORM WRT-LN.
028000 WRT-LN.
028100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
028200     MOVE SPACE TO DUMMY-RECORD.
028300 BLANK-LINE-PRINT.
028400     PERFORM WRT-LN.
028500 FAIL-ROUTINE.
028600     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
028700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
028800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
028900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
029000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029100     MOVE   SPACES TO INF-ANSI-REFERENCE.
029200     GO TO  FAIL-ROUTINE-EX.
029300 FAIL-ROUTINE-WRITE.
029400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
029500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
029600     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
029700     MOVE   SPACES TO COR-ANSI-REFERENCE.
029800 FAIL-ROUTINE-EX. EXIT.
029900 BAIL-OUT.
030000     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
030100     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
030200 BAIL-OUT-WRITE.
030300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
030400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030600     MOVE   SPACES TO INF-ANSI-REFERENCE.
030700 BAIL-OUT-EX. EXIT.
030800 CCVS1-EXIT.
030900     EXIT.
031000 SECTION-IC108-0001 SECTION.
031100 CALL-PARAGRAPH.
031200*        THE CALL IN THIS PARAGRAPH STARTS THE SEQUENCE
031300*    OF CALLS TO THE SUBPROGRAMS.
031400     MOVE SPACE TO SUB-CALLED.
031500     MOVE SPACE TO SPECIAL-FLAGS.
031600     CALL "IC109A" USING GRP-01.
031700 CALL-TEST-07.
031800*        THIS TEST VERIFIES THAT EACH SUBPROGRAM WAS CALLED
031900*    BY CHECKING THE PARAMETER FIELDS SET IN EACH SUBPROGRAM.
032000     MOVE "SUBPROGRAM CALLS" TO FEATURE.
032100     MOVE "CALL-TEST-07" TO PAR-NAME.
032200 CALL-TEST-07-01.
032300     MOVE 1 TO REC-CT.
032400     IF DN1 IS EQUAL TO "IC109A"
032500         PERFORM PASS
032600         GO TO CALL-WRITE-07-01.
032700 CALL-FAIL-07-01.
032800     PERFORM FAIL.
032900     MOVE DN1 TO COMPUTED-A.
033000     MOVE "IC109A" TO CORRECT-A.
033100     MOVE "SUBPROGRAM IC109A ERROR" TO RE-MARK.
033200 CALL-WRITE-07-01.
033300     PERFORM PRINT-DETAIL.
033400 CALL-TEST-07-02.
033500     ADD 1 TO REC-CT.
033600     IF DN2 IS EQUAL TO "IC110A"
033700         PERFORM PASS
033800         GO TO CALL-WRITE-07-02.
033900 CALL-FAIL-07-02.
034000     PERFORM FAIL.
034100     MOVE DN2 TO COMPUTED-A.
034200     MOVE "IC110A" TO CORRECT-A.
034300     MOVE "SUBPROGRAM IC110A ERROR" TO RE-MARK.
034400 CALL-WRITE-07-02.
034500     PERFORM PRINT-DETAIL.
034600 CALL-TEST-07-03.
034700     ADD 1 TO REC-CT.
034800     IF DN3 EQUAL TO "IC111A"
034900         PERFORM PASS
035000         GO TO CALL-WRITE-07-03.
035100 CALL-FAIL-07-03.
035200     PERFORM FAIL.
035300     MOVE DN3 TO COMPUTED-A.
035400     MOVE "IC111A" TO CORRECT-A.
035500     MOVE "SUBPROGRAM IC111A ERROR" TO RE-MARK.
035600 CALL-WRITE-07-03.
035700     PERFORM PRINT-DETAIL.
035800 CALL-TEST-08.
035900*        THIS TEST VERIFIES THAT EACH OF THE SUBPROGRAMS
036000*    WERE CALLED ONLY ONCE.
036100     MOVE "CALL-TEST-08" TO PAR-NAME.
036200     MOVE "SUBPRGMS CALLED ONCE" TO FEATURE.
036300 CALL-TEST-08-01.
036400     MOVE 1 TO REC-CT.
036500     IF DN4 EQUAL TO 1
036600         PERFORM PASS
036700         GO TO CALL-WRITE-08-01.
036800 CALL-FAIL-08-01.
036900     PERFORM FAIL.
037000     MOVE DN4 TO COMPUTED-18V0.
037100     MOVE 1 TO CORRECT-18V0.
037200     MOVE "IC109A CALLED N TIMES" TO RE-MARK.
037300 CALL-WRITE-08-01.
037400     PERFORM PRINT-DETAIL.
037500 CALL-TEST-08-02.
037600     ADD 1 TO REC-CT.
037700     IF DN5 EQUAL TO 1
037800         PERFORM PASS
037900         GO TO CALL-WRITE-08-02.
038000 CALL-FAIL-08-02.
038100     PERFORM FAIL.
038200     MOVE DN5 TO COMPUTED-18V0.
038300     MOVE 1 TO CORRECT-18V0.
038400     MOVE "IC110A CALLED N TIMES" TO RE-MARK.
038500 CALL-WRITE-08-02.
038600     PERFORM PRINT-DETAIL.
038700 CALL-TEST-08-03.
038800     ADD 1 TO REC-CT.
038900     IF DN6 EQUAL TO 1
039000         PERFORM PASS
039100         GO TO CALL-WRITE-08-03.
039200 CALL-FAIL-08-03.
039300     PERFORM FAIL.
039400     MOVE DN6 TO COMPUTED-18V0.
039500     MOVE 1 TO CORRECT-18V0.
039600     MOVE "IC111A CALLED N TIMES" TO RE-MARK.
039700 CALL-WRITE-08-03.
039800     PERFORM PRINT-DETAIL.
039900 LINK-TEST-07.
040000*        THIS TEST VERIFIES THAT USING PHRASE OPERANDS
040100*    WHICH WERE DEFINED IN SUBPROGRAM WORKING-STORAGE
040200*    SECTIONS WERE PROCESSED CORRECTLY.
040300     MOVE "LINK-TEST-07" TO PAR-NAME.
040400     MOVE "USING OPERANDS" TO FEATURE.
040500 LINK-TEST-07-01.
040600     MOVE 1 TO REC-CT.
040700     IF DN7 EQUAL TO "A"
040800         PERFORM PASS
040900         GO TO LINK-WRITE-07-01.
041000 LINK-FAIL-07-01.
041100     PERFORM FAIL.
041200     MOVE DN7 TO COMPUTED-A.
041300     MOVE "A" TO CORRECT-A.
041400     MOVE "IC109A WK-STORAGE OPERAND" TO RE-MARK.
041500 LINK-WRITE-07-01.
041600     PERFORM PRINT-DETAIL.
041700 LINK-TEST-07-02.
041800     ADD 1 TO REC-CT.
041900     IF DN8 EQUAL TO "A"
042000         PERFORM PASS
042100         GO TO LINK-WRITE-07-02.
042200 LINK-FAIL-07-02.
042300     PERFORM FAIL.
042400     MOVE DN8 TO COMPUTED-A.
042500     MOVE "A" TO CORRECT-A.
042600     MOVE "IC110A WK-STORAGE OPERAND" TO RE-MARK.
042700 LINK-WRITE-07-02.
042800     PERFORM PRINT-DETAIL.
042900 LINK-TEST-07-03.
043000     ADD 1 TO REC-CT.
043100     IF DN9 EQUAL TO "B"
043200         PERFORM PASS
043300         GO TO LINK-WRITE-07-03.
043400 LINK-FAIL-07-03.
043500     PERFORM FAIL.
043600     MOVE DN9 TO COMPUTED-A.
043700     MOVE "B" TO CORRECT-A.
043800     MOVE "IC111A WK-STORAGE OPERAND" TO RE-MARK.
043900 LINK-WRITE-07-03.
044000     PERFORM PRINT-DETAIL.
044100     GO TO CCVS-EXIT.
044200 CCVS-EXIT SECTION.
044300 CCVS-999999.
044400     GO TO CLOSE-FILES.
