000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IC104A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*        THE SUBPROGRAM IC104 HAS THREE OPERANDS IN THE
002200*    USING PHRASE OF THE PROCEDURE DIVISION HEADER.  TWO
002300*    OPERANDS ARE 01 GROUP ITEMS AND THE THIRD OPERAND IS
002400*    AN ELEMENTARY 77 ITEM.  THE DATA DESCRIPTIONS OF THESE
002500*    OPERANDS IN THE LINKAGE SECTION ARE NOT THE SAME AS THE
002600*    DATA DESCRIPTIONS IN THE WORKING-STORAGE SECTION OF THE
002700*    CALLING PROGRAM, BUT AN EQUAL NUMBER OF CHARACTER
002800*    POSITIONS ARE DEFINED.  THE CALLING PROGRAM IS IC103.
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.
003200     XXXXX082.
003300 OBJECT-COMPUTER.
003400     XXXXX083.
003500 INPUT-OUTPUT SECTION.
003600 FILE-CONTROL.
003700     SELECT PRINT-FILE ASSIGN TO
003800     XXXXX055.
003900 DATA DIVISION.
004000 FILE SECTION.
004100 FD  PRINT-FILE.
004200 01  PRINT-REC PICTURE X(120).
004300 01  DUMMY-RECORD PICTURE X(120).
004400 WORKING-STORAGE SECTION.
004500 01  CONSTANT-VALUES.
004600     02  AN-CONSTANT PIC X(5) VALUE "IC104".
004700     02  NUM-CONSTANT PIC 99V9999 VALUE 0.7654.
004800 LINKAGE SECTION.
004900 01  GRP-01.
005000     02  AN-FIELD PICTURE X(5).
005100     02  NUM-DISPLAY PIC 99.
005200     02  GRP-LEVEL.
005300         03  A-FIELD PICTURE A(3).
005400 77  ELEM-01 PIC  V9(4) COMPUTATIONAL.
005500 01  GRP-02.
005600     02  GRP-03.
005700         03  NUM-ITEM PICTURE S99.
005800         03  EDITED-FIELD  PIC XXBX0X.
005900 PROCEDURE DIVISION USING GRP-01 ELEM-01 GRP-02.
006000 SECT-IC104-0001 SECTION.
006100*        THIS SECTION SETS THE PARAMETER FIELDS REFERRED TO
006200*    IN THE USING PHRASE AND DEFINED IN THE LINKAGE SECTION.
006300 CALL-TEST-06.
006400     MOVE AN-CONSTANT TO AN-FIELD.
006500     ADD 25 TO NUM-DISPLAY.
006600     MOVE "YES" TO A-FIELD.
006700     MOVE NUM-CONSTANT TO ELEM-01.
006800     MOVE NUM-DISPLAY TO NUM-ITEM.
006900     MOVE "ABCD" TO EDITED-FIELD.
007000 CALL-EXIT-06.
007100     EXIT PROGRAM.
