000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IC101A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*         THIS ROUTINE CHECKS THE USE OF THE CALL STATEMENT
002200*    WITH ONE PARAMETER IN THE USING PHRASE.  SUBSEQUENT CALLS
002300*    CHECK THAT THE CALLED ROUTINE REMAINS IN THE LAST USED STATE.
002400*
002500*        THERE ARE NO DELETE PARAGRAPHS IN THIS ROUTINE
002600*    SINCE THESE ARE THE BASIC CALL TESTS AND IF A CALL
002700*    STATEMENT IS REJECTED THERE IS NO REASON TO RUN THE ROUTINE.
002800*
002900*    THE FIRST THREE CALLS USE A DATA-NAME THE SAME AS
003000*    THE NAME IN THE SUBPROGRAM.  THE LAST TWO CALLS USE
003100*    A DIFFERENT DATA-NAME FROM THE NAME IN THE SUBPROGRAM.
003200*    THE PICTURE CLAUSES FOR DATA-NAMES IN THE USING PHRASES
003300*    OF THE CALLED AND CALLING PROGRAMS ARE IDENTICAL.
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.
003700     XXXXX082.
003800 OBJECT-COMPUTER.
003900     XXXXX083.
004000 INPUT-OUTPUT SECTION.
004100 FILE-CONTROL.
004200     SELECT PRINT-FILE ASSIGN TO
004300     XXXXX055.
004400 DATA DIVISION.
004500 FILE SECTION.
004600 FD  PRINT-FILE.
004700 01  PRINT-REC PICTURE X(120).
004800 01  DUMMY-RECORD PICTURE X(120).
004900 WORKING-STORAGE SECTION.
005000 77  DN1 PICTURE S9  VALUE ZERO.
005100 77  DN2 PICTURE S9  VALUE ZERO.
005200 01  TEST-RESULTS.
005300     02 FILLER                   PIC X      VALUE SPACE.
005400     02 FEATURE                  PIC X(20)  VALUE SPACE.
005500     02 FILLER                   PIC X      VALUE SPACE.
005600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02  PAR-NAME.
005900       03 FILLER                 PIC X(19)  VALUE SPACE.
006000       03  PARDOT-X              PIC X      VALUE SPACE.
006100       03 DOTVALUE               PIC 99     VALUE ZERO.
006200     02 FILLER                   PIC X(8)   VALUE SPACE.
006300     02 RE-MARK                  PIC X(61).
006400 01  TEST-COMPUTED.
006500     02 FILLER                   PIC X(30)  VALUE SPACE.
006600     02 FILLER                   PIC X(17)  VALUE
006700            "       COMPUTED=".
006800     02 COMPUTED-X.
006900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007000     03 COMPUTED-N               REDEFINES COMPUTED-A
007100                                 PIC -9(9).9(9).
007200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007500     03       CM-18V0 REDEFINES COMPUTED-A.
007600         04 COMPUTED-18V0                    PIC -9(18).
007700         04 FILLER                           PIC X.
007800     03 FILLER PIC X(50) VALUE SPACE.
007900 01  TEST-CORRECT.
008000     02 FILLER PIC X(30) VALUE SPACE.
008100     02 FILLER PIC X(17) VALUE "       CORRECT =".
008200     02 CORRECT-X.
008300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008800     03      CR-18V0 REDEFINES CORRECT-A.
008900         04 CORRECT-18V0                     PIC -9(18).
009000         04 FILLER                           PIC X.
009100     03 FILLER PIC X(2) VALUE SPACE.
009200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009300 01  CCVS-C-1.
009400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
009500-    "SS  PARAGRAPH-NAME
009600-    "       REMARKS".
009700     02 FILLER                     PIC X(20)    VALUE SPACE.
009800 01  CCVS-C-2.
009900     02 FILLER                     PIC X        VALUE SPACE.
010000     02 FILLER                     PIC X(6)     VALUE "TESTED".
010100     02 FILLER                     PIC X(15)    VALUE SPACE.
010200     02 FILLER                     PIC X(4)     VALUE "FAIL".
010300     02 FILLER                     PIC X(94)    VALUE SPACE.
010400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
010500 01  REC-CT                        PIC 99       VALUE ZERO.
010600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
010700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
010800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
010900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
011000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
011100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
011200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
011300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
011400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
011500 01  CCVS-H-1.
011600     02  FILLER                    PIC X(39)    VALUE SPACES.
011700     02  FILLER                    PIC X(42)    VALUE
011800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
011900     02  FILLER                    PIC X(39)    VALUE SPACES.
012000 01  CCVS-H-2A.
012100   02  FILLER                        PIC X(40)  VALUE SPACE.
012200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
012300   02  FILLER                        PIC XXXX   VALUE
012400     "4.2 ".
012500   02  FILLER                        PIC X(28)  VALUE
012600            " COPY - NOT FOR DISTRIBUTION".
012700   02  FILLER                        PIC X(41)  VALUE SPACE.
012800
012900 01  CCVS-H-2B.
013000   02  FILLER                        PIC X(15)  VALUE
013100            "TEST RESULT OF ".
013200   02  TEST-ID                       PIC X(9).
013300   02  FILLER                        PIC X(4)   VALUE
013400            " IN ".
013500   02  FILLER                        PIC X(12)  VALUE
013600     " HIGH       ".
013700   02  FILLER                        PIC X(22)  VALUE
013800            " LEVEL VALIDATION FOR ".
013900   02  FILLER                        PIC X(58)  VALUE
014000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014100 01  CCVS-H-3.
014200     02  FILLER                      PIC X(34)  VALUE
014300            " FOR OFFICIAL USE ONLY    ".
014400     02  FILLER                      PIC X(58)  VALUE
014500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
014600     02  FILLER                      PIC X(28)  VALUE
014700            "  COPYRIGHT   1985 ".
014800 01  CCVS-E-1.
014900     02 FILLER                       PIC X(52)  VALUE SPACE.
015000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
015100     02 ID-AGAIN                     PIC X(9).
015200     02 FILLER                       PIC X(45)  VALUE SPACES.
015300 01  CCVS-E-2.
015400     02  FILLER                      PIC X(31)  VALUE SPACE.
015500     02  FILLER                      PIC X(21)  VALUE SPACE.
015600     02 CCVS-E-2-2.
015700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
015800         03 FILLER                   PIC X      VALUE SPACE.
015900         03 ENDER-DESC               PIC X(44)  VALUE
016000            "ERRORS ENCOUNTERED".
016100 01  CCVS-E-3.
016200     02  FILLER                      PIC X(22)  VALUE
016300            " FOR OFFICIAL USE ONLY".
016400     02  FILLER                      PIC X(12)  VALUE SPACE.
016500     02  FILLER                      PIC X(58)  VALUE
016600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016700     02  FILLER                      PIC X(13)  VALUE SPACE.
016800     02 FILLER                       PIC X(15)  VALUE
016900             " COPYRIGHT 1985".
017000 01  CCVS-E-4.
017100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
017200     02 FILLER                       PIC X(4)   VALUE " OF ".
017300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
017400     02 FILLER                       PIC X(40)  VALUE
017500      "  TESTS WERE EXECUTED SUCCESSFULLY".
017600 01  XXINFO.
017700     02 FILLER                       PIC X(19)  VALUE
017800            "*** INFORMATION ***".
017900     02 INFO-TEXT.
018000       04 FILLER                     PIC X(8)   VALUE SPACE.
018100       04 XXCOMPUTED                 PIC X(20).
018200       04 FILLER                     PIC X(5)   VALUE SPACE.
018300       04 XXCORRECT                  PIC X(20).
018400     02 INF-ANSI-REFERENCE           PIC X(48).
018500 01  HYPHEN-LINE.
018600     02 FILLER  PIC IS X VALUE IS SPACE.
018700     02 FILLER  PIC IS X(65)    VALUE IS "************************
018800-    "*****************************************".
018900     02 FILLER  PIC IS X(54)    VALUE IS "************************
019000-    "******************************".
019100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
019200     "IC101A".
019300 PROCEDURE DIVISION.
019400 CCVS1 SECTION.
019500 OPEN-FILES.
019600     OPEN     OUTPUT PRINT-FILE.
019700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
019800     MOVE    SPACE TO TEST-RESULTS.
019900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
020000     GO TO CCVS1-EXIT.
020100 CLOSE-FILES.
020200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
020300 TERMINATE-CCVS.
020400S    EXIT PROGRAM.
020500STERMINATE-CALL.
020600     STOP     RUN.
020700 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
020800 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
020900 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
021000 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
021100     MOVE "****TEST DELETED****" TO RE-MARK.
021200 PRINT-DETAIL.
021300     IF REC-CT NOT EQUAL TO ZERO
021400             MOVE "." TO PARDOT-X
021500             MOVE REC-CT TO DOTVALUE.
021600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
021700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
021800        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
021900          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
022000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
022100     MOVE SPACE TO CORRECT-X.
022200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
022300     MOVE     SPACE TO RE-MARK.
022400 HEAD-ROUTINE.
022500     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022600     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022700     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022800     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022900 COLUMN-NAMES-ROUTINE.
023000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
023300 END-ROUTINE.
023400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
023500 END-RTN-EXIT.
023600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023700 END-ROUTINE-1.
023800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
023900      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
024000      ADD PASS-COUNTER TO ERROR-HOLD.
024100*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
024200      MOVE PASS-COUNTER TO CCVS-E-4-1.
024300      MOVE ERROR-HOLD TO CCVS-E-4-2.
024400      MOVE CCVS-E-4 TO CCVS-E-2-2.
024500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
024600  END-ROUTINE-12.
024700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
024800     IF       ERROR-COUNTER IS EQUAL TO ZERO
024900         MOVE "NO " TO ERROR-TOTAL
025000         ELSE
025100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
025200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
025300     PERFORM WRITE-LINE.
025400 END-ROUTINE-13.
025500     IF DELETE-COUNTER IS EQUAL TO ZERO
025600         MOVE "NO " TO ERROR-TOTAL  ELSE
025700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
025800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
025900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026000      IF   INSPECT-COUNTER EQUAL TO ZERO
026100          MOVE "NO " TO ERROR-TOTAL
026200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
026300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
026400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026600 WRITE-LINE.
026700     ADD 1 TO RECORD-COUNT.
026800Y    IF RECORD-COUNT GREATER 50
026900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
027000Y        MOVE SPACE TO DUMMY-RECORD
027100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
027200Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
027300Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
027400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
027500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
027600Y        MOVE ZERO TO RECORD-COUNT.
027700     PERFORM WRT-LN.
027800 WRT-LN.
027900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
028000     MOVE SPACE TO DUMMY-RECORD.
028100 BLANK-LINE-PRINT.
028200     PERFORM WRT-LN.
028300 FAIL-ROUTINE.
028400     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
028500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
028600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
028700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
028800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028900     MOVE   SPACES TO INF-ANSI-REFERENCE.
029000     GO TO  FAIL-ROUTINE-EX.
029100 FAIL-ROUTINE-WRITE.
029200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
029300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
029400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
029500     MOVE   SPACES TO COR-ANSI-REFERENCE.
029600 FAIL-ROUTINE-EX. EXIT.
029700 BAIL-OUT.
029800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
029900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
030000 BAIL-OUT-WRITE.
030100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
030200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030400     MOVE   SPACES TO INF-ANSI-REFERENCE.
030500 BAIL-OUT-EX. EXIT.
030600 CCVS1-EXIT.
030700     EXIT.
030800 SECT-IC101-0001 SECTION.
030900 CALL-INIT-1.
031000     MOVE "CALL...USING DATA-NM" TO FEATURE.
031100     MOVE "CALL-TEST-01" TO PAR-NAME.
031200 CALL-TEST-1.
031300     CALL "IC102A" USING DN1.
031400     IF DN1 IS EQUAL TO 1
031500         PERFORM PASS
031600             GO TO CALL-WRITE-1.
031700 CALL-FAIL-1.
031800     MOVE 1 TO CORRECT-18V0.
031900     MOVE DN1 TO COMPUTED-18V0.
032000     PERFORM FAIL.
032100 CALL-WRITE-1.
032200     PERFORM PRINT-DETAIL.
032300 CALL-INIT-2.
032400     MOVE 0 TO DN1.
032500 CALL-TEST-2.
032600     CALL "IC102A" USING DN1.
032700     IF DN1 IS EQUAL TO 2
032800         PERFORM PASS
032900             GO TO CALL-WRITE-2.
033000 CALL-FAIL-2.
033100     MOVE 2 TO CORRECT-18V0.
033200     MOVE DN1 TO COMPUTED-18V0.
033300     PERFORM FAIL.
033400 CALL-WRITE-2.
033500     MOVE "CALL-TEST-02" TO PAR-NAME.
033600     PERFORM PRINT-DETAIL.
033700 CALL-INIT-3.
033800     ADD 4 TO DN1.
033900 CALL-TEST-3.
034000     CALL "IC102A" USING DN1.
034100     IF DN1 IS EQUAL TO 3
034200         PERFORM PASS
034300             GO TO CALL-WRITE-3.
034400 CALL-FAIL-3.
034500     MOVE 3 TO CORRECT-18V0.
034600     MOVE DN1 TO COMPUTED-18V0.
034700     PERFORM FAIL.
034800 CALL-WRITE-3.
034900     MOVE "CALL-TEST-03" TO PAR-NAME.
035000     PERFORM PRINT-DETAIL.
035100 CALL-TEST-4.
035200     CALL "IC102A" USING DN2.
035300     IF DN2 IS NOT EQUAL TO 4
035400             GO TO CALL-FAIL-4.
035500     PERFORM PASS.
035600     GO TO CALL-WRITE-4.
035700 CALL-FAIL-4.
035800     MOVE 4 TO CORRECT-18V0.
035900     MOVE DN2 TO COMPUTED-18V0.
036000     PERFORM FAIL.
036100 CALL-WRITE-4.
036200     MOVE "CALL-TEST-04" TO PAR-NAME.
036300     PERFORM PRINT-DETAIL.
036400 CALL-INIT-5.
036500     MOVE 0 TO DN2.
036600 CALL-TEST-5.
036700     CALL "IC102A" USING DN2.
036800     IF DN2 IS EQUAL TO 5
036900         PERFORM PASS
037000             GO TO CALL-WRITE-5.
037100 CALL-FAIL-5.
037200     MOVE 5 TO CORRECT-18V0.
037300     MOVE DN2 TO COMPUTED-18V0.
037400     PERFORM FAIL.
037500 CALL-WRITE-5.
037600     MOVE "CALL-TEST-05" TO PAR-NAME.
037700     PERFORM PRINT-DETAIL.
037800 CALL-END-ROUTINE.
037900     GO TO CCVS-EXIT.
038000 CCVS-EXIT SECTION.
038100 CCVS-999999.
038200     GO TO CLOSE-FILES.
