000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IC117M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*        THE SUBPROGRAM IC117 IS CALLED BY THE MAIN PROGRAM IC116.
002300*    THE SUBPROGRAM IC117 DOES NOT CONTAIN A LINKAGE SECTION OR
002400*    AN USING PHRASE IN THE PROCEDURE DIVISION HEADER.  DISPLAY
002500*    STATEMENTS ARE USED TO VERIFY THE PROGRAM EXECUTION SEQUENCE.
002600*    THE SUBPROGRAM IC118 IS CALLED BY THE SUBPROGRAM IC117 AND
002700*    THE CALL STATEMENT IN THE SUBPROGRAM ALSO DOES NOT HAVE AN
002800*    USING PHRASE.
002900*
003000*    REFERENCE - AMERICAN NATIONAL STANDARD PROGRAMMING LANGUAGE
003100*                    COBOL, X3.23-1974
003200*                SECTION XII, INTER-PROGRAM COMMUNICATION MODULE.
003300*
003400******************************************************************
003500 ENVIRONMENT DIVISION.
003600 CONFIGURATION SECTION.
003700 SOURCE-COMPUTER.
003800     XXXXX082.
003900 OBJECT-COMPUTER.
004000     XXXXX083.
004100 DATA DIVISION.
004200 WORKING-STORAGE SECTION.
004300 01  IC117-TEMP1         PICTURE 9.
004400 01  ONE                 PICTURE 9    VALUE 1.
004500 01  IC117-TEMP2         PICTURE 9     VALUE 0.
004600 PROCEDURE DIVISION.
004700*USNG-TEST-02.
004800*
004900*    THIS TEST VERIFIES THAT A SUBPROGRAM PROCEDURE DIVISION
005000*    HEADER IS NOT REQUIRED TO HAVE THE OPTIONAL USING PHRASE.
005100*
005200 USNG-VERIFY-02.
005300     MOVE 1 TO IC117-TEMP1.
005400     ADD ONE TO IC117-TEMP2.
005500*
005600*    THE RESULTS OF THE ABOVE STATEMENTS ARE NOT TESTED.
005700*
005800 USNG-DISPLAY-02.
005900     DISPLAY "  ".
006000     DISPLAY "IC117M CALLED".
006100 USNG-TEST-03.
006200     CALL "IC118M".
006300*
006400*    THIS TEST CONTAINS A CALL STATEMENT WITHOUT THE OPTIONAL
006500*    USING PHRASE.
006600*    REFERENCE - X3.23-1995, PAGE X-27, 5.2, THE CALL STATEMENT.
006700*
006800 USNG-DISPLAY-03.
006900     DISPLAY "RETURNED TO IC117M".
007000 IC117-EXIT.
007100     EXIT PROGRAM.
