000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IC204A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*        THE SUBPROGRAM IC204 HAS TWO VARIABLES IN WORKING-
002200*    STORAGE WHICH ARE INITIALIZED BY A VALUE STATEMENT.  THE
002300*    DATA CONTENTS OF THESE VARIABLES ARE MODIFIED DURING
002400*    EXECUTION OF THE SUBPROGRAM.  INDICATORS ARE SET FOR
002500*    VARIABLES IN THE LINKAGE SECTION WHICH RELATE HOW MANY
002600*    TIMES THE SUBPROGRAM HAS BEEN CALLED SINCE IT WAS
002700*    INITIALIZED, AND WHETHER OR NOT THE SUBPROGRAM IS IN
002800*    ITS INITIAL STATE.
002900****************************************************************
003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.
003300     XXXXX082.
003400 OBJECT-COMPUTER.
003500     XXXXX083.
003600 INPUT-OUTPUT SECTION.
003700 FILE-CONTROL.
003800     SELECT PRINT-FILE ASSIGN TO
003900     XXXXX055.
004000 DATA DIVISION.
004100 FILE SECTION.
004200 FD  PRINT-FILE.
004300 01  PRINT-REC PICTURE X(120).
004400 01  DUMMY-RECORD PICTURE X(120).
004500 WORKING-STORAGE SECTION.
004600 77  WS1  PICTURE 99 VALUE ZERO.
004700 77  WS2 PICTURE X(5)   VALUE "FIRST".
004800 LINKAGE SECTION.
004900 77  SUB-DN1 PICTURE S999.
005000 01  SUB-TABLE-1.
005100     02  SUB-DN2 PIC XXX.
005200     02  SUB-DN3 PIC 99.
005300     02  SUB-DN4 PIC X(5).
005400 PROCEDURE DIVISION USING SUB-TABLE-1, SUB-DN1.
005500 SECT-IC204-0001 SECTION.
005600 CNCL-TEST-01.
005700     ADD 1 TO WS1.
005800     MOVE WS1 TO SUB-DN1.
005900 CNCL-TEST-02.
006000     MOVE "NO" TO SUB-DN2.
006100     IF WS2 EQUAL TO "FIRST"
006200         MOVE SPACE TO WS2
006300         MOVE "YES" TO SUB-DN2.
006400 CNCL-TEST-03.
006500     MOVE SPACE TO SUB-DN4.
006600     IF WS1 EQUAL TO SUB-DN3
006700         MOVE "EQUAL" TO SUB-DN4.
006800 IC204-EXIT.
006900     EXIT PROGRAM.
007000*        THE PARAMETER SUB-DN3 IS SET IN THE CALLING PROGRAM
007100*    EQUAL TO THE NUMBER OF TIMES THE SUBPROGRAM HAS BEEN
007200*    CALLED SINCE BEING INITIALIZED, EITHER BY THE FIRST CALL
007300*    OR THE FIRST CALL AFTER A CANCEL STATEMENT.
