000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF104A.
000400
000500***********************************************************
000600*                                                         *
000700*   This program is intended to form part of the CCVS85   *
000800*   COBOL Test Suite. It contains tests for the           *
000900*   Intrinsic Function ATAN.                              *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT PRINT-FILE ASSIGN TO
002100     XXXXX055.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  PRINT-FILE.
002500 01  PRINT-REC PICTURE X(120).
002600 01  DUMMY-RECORD PICTURE X(120).
002700 WORKING-STORAGE SECTION.
002800***********************************************************
002900* Variables specific to the Intrinsic Function Test IF104A*
003000***********************************************************
003100 01  A                   PIC S9(5)V9(5)      VALUE -0.00004.
003200 01  B                   PIC S9(10)          VALUE 2.
003300 01  C                   PIC S9(10)          VALUE 100000.
003400 01  D                   PIC S9(10)          VALUE 1000.
003500 01  PI                  PIC S9V9(17)        VALUE 3.141592654.
003600 01  ARG1                PIC S9V9(17)        VALUE 1.00.
003700 01  SQRT3               PIC S9V9(17)        VALUE 1.732050808.
003800 01  ARR                                     VALUE "40537".
003900     02  IND OCCURS 5 TIMES PIC 9.
004000 01  TEMP                PIC S9(5)V9(5).
004100 01  WS-NUM              PIC S9(5)V9(6).
004200 01  MIN-RANGE           PIC S9(5)V9(7).
004300 01  MAX-RANGE           PIC S9(5)V9(7).
004400*
004500**********************************************************
004600*
004700 01  TEST-RESULTS.
004800     02 FILLER                   PIC X      VALUE SPACE.
004900     02 FEATURE                  PIC X(20)  VALUE SPACE.
005000     02 FILLER                   PIC X      VALUE SPACE.
005100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005200     02 FILLER                   PIC X      VALUE SPACE.
005300     02  PAR-NAME.
005400       03 FILLER                 PIC X(19)  VALUE SPACE.
005500       03  PARDOT-X              PIC X      VALUE SPACE.
005600       03 DOTVALUE               PIC 99     VALUE ZERO.
005700     02 FILLER                   PIC X(8)   VALUE SPACE.
005800     02 RE-MARK                  PIC X(61).
005900 01  TEST-COMPUTED.
006000     02 FILLER                   PIC X(30)  VALUE SPACE.
006100     02 FILLER                   PIC X(17)  VALUE
006200            "       COMPUTED=".
006300     02 COMPUTED-X.
006400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006500     03 COMPUTED-N               REDEFINES COMPUTED-A
006600                                 PIC -9(9).9(9).
006700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
006900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007000     03       CM-18V0 REDEFINES COMPUTED-A.
007100         04 COMPUTED-18V0                    PIC -9(18).
007200         04 FILLER                           PIC X.
007300     03 FILLER PIC X(50) VALUE SPACE.
007400 01  TEST-CORRECT.
007500     02 FILLER PIC X(30) VALUE SPACE.
007600     02 FILLER PIC X(17) VALUE "       CORRECT =".
007700     02 CORRECT-X.
007800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
007900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008300     03      CR-18V0 REDEFINES CORRECT-A.
008400         04 CORRECT-18V0                     PIC -9(18).
008500         04 FILLER                           PIC X.
008600     03 FILLER PIC X(2) VALUE SPACE.
008700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008800 01  TEST-CORRECT-MIN.
008900     02 FILLER PIC X(30) VALUE SPACE.
009000     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
009100     02 CORRECTMI-X.
009200     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
009300     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
009400     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
009500     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
009600     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
009700     03      CR-18V0 REDEFINES CORRECTMI-A.
009800         04 CORRECTMI-18V0                     PIC -9(18).
009900         04 FILLER                           PIC X.
010000     03 FILLER PIC X(2) VALUE SPACE.
010100     03 FILLER                           PIC X(48) VALUE SPACE.
010200 01  TEST-CORRECT-MAX.
010300     02 FILLER PIC X(30) VALUE SPACE.
010400     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
010500     02 CORRECTMA-X.
010600     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
010700     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
010800     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
010900     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
011000     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
011100     03      CR-18V0 REDEFINES CORRECTMA-A.
011200         04 CORRECTMA-18V0                     PIC -9(18).
011300         04 FILLER                           PIC X.
011400     03 FILLER PIC X(2) VALUE SPACE.
011500     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011600 01  CCVS-C-1.
011700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011800-    "SS  PARAGRAPH-NAME
011900-    "       REMARKS".
012000     02 FILLER                     PIC X(20)    VALUE SPACE.
012100 01  CCVS-C-2.
012200     02 FILLER                     PIC X        VALUE SPACE.
012300     02 FILLER                     PIC X(6)     VALUE "TESTED".
012400     02 FILLER                     PIC X(15)    VALUE SPACE.
012500     02 FILLER                     PIC X(4)     VALUE "FAIL".
012600     02 FILLER                     PIC X(94)    VALUE SPACE.
012700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012800 01  REC-CT                        PIC 99       VALUE ZERO.
012900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013800 01  CCVS-H-1.
013900     02  FILLER                    PIC X(39)    VALUE SPACES.
014000     02  FILLER                    PIC X(42)    VALUE
014100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014200     02  FILLER                    PIC X(39)    VALUE SPACES.
014300 01  CCVS-H-2A.
014400   02  FILLER                        PIC X(40)  VALUE SPACE.
014500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014600   02  FILLER                        PIC XXXX   VALUE
014700     "4.2 ".
014800   02  FILLER                        PIC X(28)  VALUE
014900            " COPY - NOT FOR DISTRIBUTION".
015000   02  FILLER                        PIC X(41)  VALUE SPACE.
015100
015200 01  CCVS-H-2B.
015300   02  FILLER                        PIC X(15)  VALUE
015400            "TEST RESULT OF ".
015500   02  TEST-ID                       PIC X(9).
015600   02  FILLER                        PIC X(4)   VALUE
015700            " IN ".
015800   02  FILLER                        PIC X(12)  VALUE
015900     " HIGH       ".
016000   02  FILLER                        PIC X(22)  VALUE
016100            " LEVEL VALIDATION FOR ".
016200   02  FILLER                        PIC X(58)  VALUE
016300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016400 01  CCVS-H-3.
016500     02  FILLER                      PIC X(34)  VALUE
016600            " FOR OFFICIAL USE ONLY    ".
016700     02  FILLER                      PIC X(58)  VALUE
016800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016900     02  FILLER                      PIC X(28)  VALUE
017000            "  COPYRIGHT   1985 ".
017100 01  CCVS-E-1.
017200     02 FILLER                       PIC X(52)  VALUE SPACE.
017300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017400     02 ID-AGAIN                     PIC X(9).
017500     02 FILLER                       PIC X(45)  VALUE SPACES.
017600 01  CCVS-E-2.
017700     02  FILLER                      PIC X(31)  VALUE SPACE.
017800     02  FILLER                      PIC X(21)  VALUE SPACE.
017900     02 CCVS-E-2-2.
018000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018100         03 FILLER                   PIC X      VALUE SPACE.
018200         03 ENDER-DESC               PIC X(44)  VALUE
018300            "ERRORS ENCOUNTERED".
018400 01  CCVS-E-3.
018500     02  FILLER                      PIC X(22)  VALUE
018600            " FOR OFFICIAL USE ONLY".
018700     02  FILLER                      PIC X(12)  VALUE SPACE.
018800     02  FILLER                      PIC X(58)  VALUE
018900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019000     02  FILLER                      PIC X(13)  VALUE SPACE.
019100     02 FILLER                       PIC X(15)  VALUE
019200             " COPYRIGHT 1985".
019300 01  CCVS-E-4.
019400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019500     02 FILLER                       PIC X(4)   VALUE " OF ".
019600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019700     02 FILLER                       PIC X(40)  VALUE
019800      "  TESTS WERE EXECUTED SUCCESSFULLY".
019900 01  XXINFO.
020000     02 FILLER                       PIC X(19)  VALUE
020100            "*** INFORMATION ***".
020200     02 INFO-TEXT.
020300       04 FILLER                     PIC X(8)   VALUE SPACE.
020400       04 XXCOMPUTED                 PIC X(20).
020500       04 FILLER                     PIC X(5)   VALUE SPACE.
020600       04 XXCORRECT                  PIC X(20).
020700     02 INF-ANSI-REFERENCE           PIC X(48).
020800 01  HYPHEN-LINE.
020900     02 FILLER  PIC IS X VALUE IS SPACE.
021000     02 FILLER  PIC IS X(65)    VALUE IS "************************
021100-    "*****************************************".
021200     02 FILLER  PIC IS X(54)    VALUE IS "************************
021300-    "******************************".
021400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021500     "IF104A".
021600 PROCEDURE DIVISION.
021700 CCVS1 SECTION.
021800 OPEN-FILES.
021900     OPEN     OUTPUT PRINT-FILE.
022000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022100     MOVE    SPACE TO TEST-RESULTS.
022200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022300     GO TO CCVS1-EXIT.
022400 CLOSE-FILES.
022500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022600 TERMINATE-CCVS.
022700     STOP     RUN.
022800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023200     MOVE "****TEST DELETED****" TO RE-MARK.
023300 PRINT-DETAIL.
023400     IF REC-CT NOT EQUAL TO ZERO
023500             MOVE "." TO PARDOT-X
023600             MOVE REC-CT TO DOTVALUE.
023700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024200     MOVE SPACE TO CORRECT-X.
024300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024400     MOVE     SPACE TO RE-MARK.
024500 HEAD-ROUTINE.
024600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025000 COLUMN-NAMES-ROUTINE.
025100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025400 END-ROUTINE.
025500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025600 END-RTN-EXIT.
025700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025800 END-ROUTINE-1.
025900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026100      ADD PASS-COUNTER TO ERROR-HOLD.
026200      MOVE PASS-COUNTER TO CCVS-E-4-1.
026300      MOVE ERROR-HOLD TO CCVS-E-4-2.
026400      MOVE CCVS-E-4 TO CCVS-E-2-2.
026500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026600  END-ROUTINE-12.
026700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026800     IF       ERROR-COUNTER IS EQUAL TO ZERO
026900         MOVE "NO " TO ERROR-TOTAL
027000         ELSE
027100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027300     PERFORM WRITE-LINE.
027400 END-ROUTINE-13.
027500     IF DELETE-COUNTER IS EQUAL TO ZERO
027600         MOVE "NO " TO ERROR-TOTAL  ELSE
027700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028000      IF   INSPECT-COUNTER EQUAL TO ZERO
028100          MOVE "NO " TO ERROR-TOTAL
028200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028600 WRITE-LINE.
028700     ADD 1 TO RECORD-COUNT.
028800Y    IF RECORD-COUNT GREATER 42
028900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029000Y        MOVE SPACE TO DUMMY-RECORD
029100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029200Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029300Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029400Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029500Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029600Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
029700Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030000Y        MOVE ZERO TO RECORD-COUNT.
030100     PERFORM WRT-LN.
030200 WRT-LN.
030300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030400     MOVE SPACE TO DUMMY-RECORD.
030500 BLANK-LINE-PRINT.
030600     PERFORM WRT-LN.
030700 FAIL-ROUTINE.
030800     IF     COMPUTED-X NOT EQUAL TO SPACE
030900            GO TO FAIL-ROUTINE-WRITE.
031000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031400     MOVE   SPACES TO INF-ANSI-REFERENCE.
031500     GO TO  FAIL-ROUTINE-EX.
031600 FAIL-ROUTINE-WRITE.
031700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
031800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
031900                              CORMA-ANSI-REFERENCE.
032000     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
032100           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
032200           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
032300     ELSE
032400           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
032500     PERFORM WRITE-LINE.
032600     MOVE   SPACES TO COR-ANSI-REFERENCE.
032700 FAIL-ROUTINE-EX. EXIT.
032800 BAIL-OUT.
032900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033100 BAIL-OUT-WRITE.
033200     MOVE CORRECT-A TO XXCORRECT.
033300     MOVE COMPUTED-A TO XXCOMPUTED.
033400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033600     MOVE   SPACES TO INF-ANSI-REFERENCE.
033700 BAIL-OUT-EX. EXIT.
033800 CCVS1-EXIT.
033900     EXIT.
034000********************************************************
034100*                                                      *
034200*    Intrinsic Function Tests         IF104A - ATAN    *
034300*                                                      *
034400********************************************************
034500 SECT-IF104A SECTION.
034600 F-ATAN-INFO.
034700     MOVE     "See ref. A-36 2.8" TO ANSI-REFERENCE.
034800     MOVE     "ATAN Function" TO FEATURE.
034900*****************TEST (a) - SIMPLE TEST*****************
035000 F-ATAN-01.
035100     MOVE ZERO TO WS-NUM.
035200     MOVE  0.785382 TO MIN-RANGE.
035300     MOVE  0.785414 TO MAX-RANGE.
035400 F-ATAN-TEST-01.
035500     COMPUTE WS-NUM = FUNCTION ATAN(1.0).
035600     IF (WS-NUM >= MIN-RANGE) AND
035700        (WS-NUM <= MAX-RANGE) THEN
035800                    PERFORM PASS
035900     ELSE
036000                    MOVE WS-NUM TO COMPUTED-N
036100                    MOVE MIN-RANGE TO CORRECT-MIN
036200                    MOVE MAX-RANGE TO CORRECT-MAX
036300                    PERFORM FAIL.
036400     GO TO F-ATAN-WRITE-01.
036500 F-ATAN-DELETE-01.
036600     PERFORM  DE-LETE.
036700     GO TO    F-ATAN-WRITE-01.
036800 F-ATAN-WRITE-01.
036900     MOVE "F-ATAN-01" TO PAR-NAME.
037000     PERFORM  PRINT-DETAIL.
037100*****************TEST (b) - SIMPLE TEST*****************
037200 F-ATAN-02.
037300     EVALUATE FUNCTION ATAN(0.5)
037400     WHEN  0.463638 THRU 0.463656
037500                    PERFORM PASS
037600     WHEN OTHER
037700                    PERFORM FAIL.
037800     GO TO F-ATAN-WRITE-02.
037900 F-ATAN-DELETE-02.
038000     PERFORM  DE-LETE.
038100     GO TO    F-ATAN-WRITE-02.
038200 F-ATAN-WRITE-02.
038300     MOVE "F-ATAN-02" TO PAR-NAME.
038400     PERFORM  PRINT-DETAIL.
038500*****************TEST (c) - SIMPLE TEST*****************
038600 F-ATAN-03.
038700     MOVE -0.000020 TO MIN-RANGE.
038800     MOVE  0.000020 TO MAX-RANGE.
038900 F-ATAN-TEST-03.
039000     IF (FUNCTION ATAN(0) >= MIN-RANGE) AND
039100        (FUNCTION ATAN(0) <= MAX-RANGE) THEN
039200                    PERFORM PASS
039300     ELSE
039400                    PERFORM FAIL.
039500     GO TO F-ATAN-WRITE-03.
039600 F-ATAN-DELETE-03.
039700     PERFORM  DE-LETE.
039800     GO TO    F-ATAN-WRITE-03.
039900 F-ATAN-WRITE-03.
040000     MOVE "F-ATAN-03" TO PAR-NAME.
040100     PERFORM  PRINT-DETAIL.
040200*****************TEST (d) - SIMPLE TEST*****************
040300 F-ATAN-04.
040400     MOVE ZERO TO WS-NUM.
040500     MOVE -0.785414  TO MIN-RANGE.
040600     MOVE -0.785382 TO MAX-RANGE.
040700 F-ATAN-TEST-04.
040800     COMPUTE WS-NUM = FUNCTION ATAN(-1).
040900     IF (WS-NUM >= MIN-RANGE) AND
041000        (WS-NUM <= MAX-RANGE) THEN
041100                    PERFORM PASS
041200     ELSE
041300                    MOVE WS-NUM TO COMPUTED-N
041400                    MOVE MIN-RANGE TO CORRECT-MIN
041500                    MOVE MAX-RANGE TO CORRECT-MAX
041600                    PERFORM FAIL.
041700     GO TO F-ATAN-WRITE-04.
041800 F-ATAN-DELETE-04.
041900     PERFORM  DE-LETE.
042000     GO TO    F-ATAN-WRITE-04.
042100 F-ATAN-WRITE-04.
042200     MOVE "F-ATAN-04" TO PAR-NAME.
042300     PERFORM  PRINT-DETAIL.
042400*****************TEST (e) - SIMPLE TEST*****************
042500 F-ATAN-05.
042600     MOVE ZERO TO WS-NUM.
042700     MOVE  0.784881 TO MIN-RANGE.
042800     MOVE  0.784913 TO MAX-RANGE.
042900 F-ATAN-TEST-05.
043000     COMPUTE WS-NUM = FUNCTION ATAN(.999).
043100     IF (WS-NUM >= MIN-RANGE) AND
043200        (WS-NUM <= MAX-RANGE) THEN
043300                    PERFORM PASS
043400     ELSE
043500                    MOVE WS-NUM TO COMPUTED-N
043600                    MOVE MIN-RANGE TO CORRECT-MIN
043700                    MOVE MAX-RANGE TO CORRECT-MAX
043800                    PERFORM FAIL.
043900     GO TO F-ATAN-WRITE-05.
044000 F-ATAN-DELETE-05.
044100     PERFORM  DE-LETE.
044200     GO TO    F-ATAN-WRITE-05.
044300 F-ATAN-WRITE-05.
044400     MOVE "F-ATAN-05" TO PAR-NAME.
044500     PERFORM  PRINT-DETAIL.
044600*****************TEST (f) - SIMPLE TEST*****************
044700 F-ATAN-06.
044800     MOVE ZERO TO WS-NUM.
044900     MOVE  0.048959  TO MIN-RANGE.
045000     MOVE  0.048961 TO MAX-RANGE.
045100 F-ATAN-TEST-06.
045200     COMPUTE WS-NUM = FUNCTION ATAN(.049).
045300     IF (WS-NUM >= MIN-RANGE) AND
045400        (WS-NUM <= MAX-RANGE) THEN
045500                    PERFORM PASS
045600     ELSE
045700                    MOVE WS-NUM TO COMPUTED-N
045800                    MOVE MIN-RANGE TO CORRECT-MIN
045900                    MOVE MAX-RANGE TO CORRECT-MAX
046000                    PERFORM FAIL.
046100     GO TO F-ATAN-WRITE-06.
046200 F-ATAN-DELETE-06.
046300     PERFORM  DE-LETE.
046400     GO TO    F-ATAN-WRITE-06.
046500 F-ATAN-WRITE-06.
046600     MOVE "F-ATAN-06" TO PAR-NAME.
046700     PERFORM  PRINT-DETAIL.
046800*****************TEST (g) - SIMPLE TEST*****************
046900 F-ATAN-07.
047000     MOVE ZERO TO WS-NUM.
047100     MOVE -0.000040 TO MIN-RANGE.
047200     MOVE -0.000039 TO MAX-RANGE.
047300 F-ATAN-TEST-07.
047400     COMPUTE WS-NUM = FUNCTION ATAN(A).
047500     IF (WS-NUM >= MIN-RANGE) AND
047600        (WS-NUM <= MAX-RANGE) THEN
047700                    PERFORM PASS
047800     ELSE
047900                    MOVE WS-NUM TO COMPUTED-N
048000                    MOVE MIN-RANGE TO CORRECT-MIN
048100                    MOVE MAX-RANGE TO CORRECT-MAX
048200                    PERFORM FAIL.
048300     GO TO F-ATAN-WRITE-07.
048400 F-ATAN-DELETE-07.
048500     PERFORM  DE-LETE.
048600     GO TO    F-ATAN-WRITE-07.
048700 F-ATAN-WRITE-07.
048800     MOVE "F-ATAN-07" TO PAR-NAME.
048900     PERFORM  PRINT-DETAIL.
049000*****************TEST (h) - SIMPLE TEST*****************
049100 F-ATAN-08.
049200     MOVE ZERO TO WS-NUM.
049300     MOVE  0.000019  TO MIN-RANGE.
049400     MOVE  0.000020 TO MAX-RANGE.
049500 F-ATAN-TEST-08.
049600     COMPUTE WS-NUM = FUNCTION ATAN(.00002).
049700     IF (WS-NUM >= MIN-RANGE) AND
049800        (WS-NUM <= MAX-RANGE) THEN
049900                    PERFORM PASS
050000     ELSE
050100                    MOVE WS-NUM TO COMPUTED-N
050200                    MOVE MIN-RANGE TO CORRECT-MIN
050300                    MOVE MAX-RANGE TO CORRECT-MAX
050400                    PERFORM FAIL.
050500     GO TO F-ATAN-WRITE-08.
050600 F-ATAN-DELETE-08.
050700     PERFORM  DE-LETE.
050800     GO TO    F-ATAN-WRITE-08.
050900 F-ATAN-WRITE-08.
051000     MOVE "F-ATAN-08" TO PAR-NAME.
051100     PERFORM  PRINT-DETAIL.
051200*****************TEST (i) - SIMPLE TEST*****************
051300 F-ATAN-09.
051400     MOVE ZERO TO WS-NUM.
051500     MOVE -0.000020 TO MIN-RANGE.
051600     MOVE  0.000020 TO MAX-RANGE.
051700 F-ATAN-TEST-09.
051800     COMPUTE WS-NUM = FUNCTION ATAN(IND(B)).
051900     IF (WS-NUM >= MIN-RANGE) AND
052000        (WS-NUM <= MAX-RANGE) THEN
052100                    PERFORM PASS
052200     ELSE
052300                    MOVE WS-NUM TO COMPUTED-N
052400                    MOVE MIN-RANGE TO CORRECT-MIN
052500                    MOVE MAX-RANGE TO CORRECT-MAX
052600                    PERFORM FAIL.
052700     GO TO F-ATAN-WRITE-09.
052800 F-ATAN-DELETE-09.
052900     PERFORM  DE-LETE.
053000     GO TO    F-ATAN-WRITE-09.
053100 F-ATAN-WRITE-09.
053200     MOVE "F-ATAN-09" TO PAR-NAME.
053300     PERFORM  PRINT-DETAIL.
053400*****************TEST (a) - COMPLEX TEST****************
053500 F-ATAN-10.
053600     MOVE ZERO TO WS-NUM.
053700     MOVE  0.523577  TO MIN-RANGE.
053800     MOVE  0.523619 TO MAX-RANGE.
053900 F-ATAN-TEST-10.
054000     COMPUTE WS-NUM = FUNCTION ATAN(1 / SQRT3).
054100     IF (WS-NUM >= MIN-RANGE) AND
054200        (WS-NUM <= MAX-RANGE) THEN
054300                    PERFORM PASS
054400     ELSE
054500                    MOVE WS-NUM TO COMPUTED-N
054600                    MOVE MIN-RANGE TO CORRECT-MIN
054700                    MOVE MAX-RANGE TO CORRECT-MAX
054800                    PERFORM FAIL.
054900     GO TO F-ATAN-WRITE-10.
055000 F-ATAN-DELETE-10.
055100     PERFORM  DE-LETE.
055200     GO TO    F-ATAN-WRITE-10.
055300 F-ATAN-WRITE-10.
055400     MOVE "F-ATAN-10" TO PAR-NAME.
055500     PERFORM  PRINT-DETAIL.
055600*****************TEST (b) - COMPLEX TEST****************
055700 F-ATAN-11.
055800     MOVE ZERO TO WS-NUM.
055900     MOVE  1.04715 TO MIN-RANGE.
056000     MOVE  1.04723 TO MAX-RANGE.
056100 F-ATAN-TEST-11.
056200     COMPUTE WS-NUM = FUNCTION ATAN(SQRT3).
056300     IF (WS-NUM >= MIN-RANGE) AND
056400        (WS-NUM <= MAX-RANGE) THEN
056500                    PERFORM PASS
056600     ELSE
056700                    MOVE WS-NUM TO COMPUTED-N
056800                    MOVE MIN-RANGE TO CORRECT-MIN
056900                    MOVE MAX-RANGE TO CORRECT-MAX
057000                    PERFORM FAIL.
057100     GO TO F-ATAN-WRITE-11.
057200 F-ATAN-DELETE-11.
057300     PERFORM  DE-LETE.
057400     GO TO    F-ATAN-WRITE-11.
057500 F-ATAN-WRITE-11.
057600     MOVE "F-ATAN-11" TO PAR-NAME.
057700     PERFORM  PRINT-DETAIL.
057800*****************TEST (c) - COMPLEX TEST****************
057900 F-ATAN-12.
058000     MOVE ZERO TO WS-NUM.
058100     MOVE  1.04690 TO MIN-RANGE.
058200     MOVE  1.04698 TO MAX-RANGE.
058300 F-ATAN-TEST-12.
058400     COMPUTE WS-NUM = FUNCTION ATAN(SQRT3 - .001).
058500     IF (WS-NUM >= MIN-RANGE) AND
058600        (WS-NUM <= MAX-RANGE) THEN
058700                    PERFORM PASS
058800     ELSE
058900                    MOVE WS-NUM TO COMPUTED-N
059000                    MOVE MIN-RANGE TO CORRECT-MIN
059100                    MOVE MAX-RANGE TO CORRECT-MAX
059200                    PERFORM FAIL.
059300     GO TO F-ATAN-WRITE-12.
059400 F-ATAN-DELETE-12.
059500     PERFORM  DE-LETE.
059600     GO TO    F-ATAN-WRITE-12.
059700 F-ATAN-WRITE-12.
059800     MOVE "F-ATAN-12" TO PAR-NAME.
059900     PERFORM  PRINT-DETAIL.
060000*****************TEST (d) - COMPLEX TEST****************
060100 F-ATAN-13.
060200     MOVE ZERO TO WS-NUM.
060300     MOVE  0.522827 TO MIN-RANGE.
060400     MOVE  0.522869 TO MAX-RANGE.
060500 F-ATAN-TEST-13.
060600     COMPUTE WS-NUM = FUNCTION ATAN((1 / SQRT3) - .001).
060700     IF (WS-NUM >= MIN-RANGE) AND
060800        (WS-NUM <= MAX-RANGE) THEN
060900                    PERFORM PASS
061000     ELSE
061100                    MOVE WS-NUM TO COMPUTED-N
061200                    MOVE MIN-RANGE TO CORRECT-MIN
061300                    MOVE MAX-RANGE TO CORRECT-MAX
061400                    PERFORM FAIL.
061500     GO TO F-ATAN-WRITE-13.
061600 F-ATAN-DELETE-13.
061700     PERFORM  DE-LETE.
061800     GO TO    F-ATAN-WRITE-13.
061900 F-ATAN-WRITE-13.
062000     MOVE "F-ATAN-13" TO PAR-NAME.
062100     PERFORM  PRINT-DETAIL.
062200*****************TEST (e) - COMPLEX TEST****************
062300 F-ATAN-14.
062400     MOVE ZERO TO WS-NUM.
062500     MOVE -0.010000  TO MIN-RANGE.
062600     MOVE -0.009998 TO MAX-RANGE.
062700 F-ATAN-TEST-14.
062800     COMPUTE WS-NUM = FUNCTION ATAN( 1 - 1.01).
062900     IF (WS-NUM >= MIN-RANGE) AND
063000        (WS-NUM <= MAX-RANGE) THEN
063100                    PERFORM PASS
063200     ELSE
063300                    MOVE WS-NUM TO COMPUTED-N
063400                    MOVE MIN-RANGE TO CORRECT-MIN
063500                    MOVE MAX-RANGE TO CORRECT-MAX
063600                    PERFORM FAIL.
063700     GO TO F-ATAN-WRITE-14.
063800 F-ATAN-DELETE-14.
063900     PERFORM  DE-LETE.
064000     GO TO    F-ATAN-WRITE-14.
064100 F-ATAN-WRITE-14.
064200     MOVE "F-ATAN-14" TO PAR-NAME.
064300     PERFORM  PRINT-DETAIL.
064400*****************TEST (f) - COMPLEX TEST****************
064500 F-ATAN-15.
064600     MOVE ZERO TO WS-NUM.
064700     MOVE  0.780342  TO MIN-RANGE.
064800     MOVE  0.780404 TO MAX-RANGE.
064900 F-ATAN-TEST-15.
065000     COMPUTE WS-NUM = FUNCTION ATAN(1.98 / 2).
065100     IF (WS-NUM >= MIN-RANGE) AND
065200        (WS-NUM <= MAX-RANGE) THEN
065300                    PERFORM PASS
065400     ELSE
065500                    MOVE WS-NUM TO COMPUTED-N
065600                    MOVE MIN-RANGE TO CORRECT-MIN
065700                    MOVE MAX-RANGE TO CORRECT-MAX
065800                    PERFORM FAIL.
065900     GO TO F-ATAN-WRITE-15.
066000 F-ATAN-DELETE-15.
066100     PERFORM  DE-LETE.
066200     GO TO    F-ATAN-WRITE-15.
066300 F-ATAN-WRITE-15.
066400     MOVE "F-ATAN-15" TO PAR-NAME.
066500     PERFORM  PRINT-DETAIL.
066600*****************TEST (g) - COMPLEX TEST****************
066700 F-ATAN-16.
066800     MOVE ZERO TO WS-NUM.
066900     MOVE  1.04964 TO MIN-RANGE.
067000     MOVE  1.04972 TO MAX-RANGE.
067100 F-ATAN-TEST-16.
067200     COMPUTE WS-NUM = FUNCTION ATAN(SQRT3 + .01).
067300     IF (WS-NUM >= MIN-RANGE) AND
067400        (WS-NUM <= MAX-RANGE) THEN
067500                    PERFORM PASS
067600     ELSE
067700                    MOVE WS-NUM TO COMPUTED-N
067800                    MOVE MIN-RANGE TO CORRECT-MIN
067900                    MOVE MAX-RANGE TO CORRECT-MAX
068000                    PERFORM FAIL.
068100     GO TO F-ATAN-WRITE-16.
068200 F-ATAN-DELETE-16.
068300     PERFORM  DE-LETE.
068400     GO TO    F-ATAN-WRITE-16.
068500 F-ATAN-WRITE-16.
068600     MOVE "F-ATAN-16" TO PAR-NAME.
068700     PERFORM  PRINT-DETAIL.
068800*****************TEST (h) - COMPLEX TEST****************
068900 F-ATAN-17.
069000     MOVE ZERO TO WS-NUM.
069100     MOVE  0.531045 TO MIN-RANGE.
069200     MOVE  0.531087 TO MAX-RANGE.
069300 F-ATAN-TEST-17.
069400     COMPUTE WS-NUM = FUNCTION ATAN((1 / SQRT3) + .01).
069500     IF (WS-NUM >= MIN-RANGE) AND
069600        (WS-NUM <= MAX-RANGE) THEN
069700                    PERFORM PASS
069800     ELSE
069900                    MOVE WS-NUM TO COMPUTED-N
070000                    MOVE MIN-RANGE TO CORRECT-MIN
070100                    MOVE MAX-RANGE TO CORRECT-MAX
070200                    PERFORM FAIL.
070300     GO TO F-ATAN-WRITE-17.
070400 F-ATAN-DELETE-17.
070500     PERFORM  DE-LETE.
070600     GO TO    F-ATAN-WRITE-17.
070700 F-ATAN-WRITE-17.
070800     MOVE "F-ATAN-17" TO PAR-NAME.
070900     PERFORM  PRINT-DETAIL.
071000*****************TEST (i) - COMPLEX TEST****************
071100 F-ATAN-18.
071200     MOVE ZERO TO WS-NUM.
071300     MOVE  1.19023 TO MIN-RANGE.
071400     MOVE  1.19033 TO MAX-RANGE.
071500 F-ATAN-TEST-18.
071600     COMPUTE WS-NUM = FUNCTION ATAN(IND(3) / B).
071700     IF (WS-NUM >= MIN-RANGE) AND
071800        (WS-NUM <= MAX-RANGE) THEN
071900                    PERFORM PASS
072000     ELSE
072100                    MOVE WS-NUM TO COMPUTED-N
072200                    MOVE MIN-RANGE TO CORRECT-MIN
072300                    MOVE MAX-RANGE TO CORRECT-MAX
072400                    PERFORM FAIL.
072500     GO TO F-ATAN-WRITE-18.
072600 F-ATAN-DELETE-18.
072700     PERFORM  DE-LETE.
072800     GO TO    F-ATAN-WRITE-18.
072900 F-ATAN-WRITE-18.
073000     MOVE "F-ATAN-18" TO PAR-NAME.
073100     PERFORM  PRINT-DETAIL.
073200*****************TEST (j) - COMPLEX TEST****************
073300 F-ATAN-19.
073400     MOVE ZERO TO WS-NUM.
073500     MOVE  0.785367 TO MIN-RANGE.
073600     MOVE  0.785429 TO MAX-RANGE.
073700 F-ATAN-TEST-19.
073800     COMPUTE WS-NUM = FUNCTION ATAN(4 - 3).
073900     IF (WS-NUM >= MIN-RANGE) AND
074000        (WS-NUM <= MAX-RANGE) THEN
074100                    PERFORM PASS
074200     ELSE
074300                    MOVE WS-NUM TO COMPUTED-N
074400                    MOVE MIN-RANGE TO CORRECT-MIN
074500                    MOVE MAX-RANGE TO CORRECT-MAX
074600                    PERFORM FAIL.
074700     GO TO F-ATAN-WRITE-19.
074800 F-ATAN-DELETE-19.
074900     PERFORM  DE-LETE.
075000     GO TO    F-ATAN-WRITE-19.
075100 F-ATAN-WRITE-19.
075200     MOVE "F-ATAN-19" TO PAR-NAME.
075300     PERFORM  PRINT-DETAIL.
075400*****************TEST (k) - COMPLEX TEST****************
075500 F-ATAN-20.
075600     MOVE ZERO TO WS-NUM.
075700     MOVE -0.000040 TO MIN-RANGE.
075800     MOVE  0.000040 TO MAX-RANGE.
075900 F-ATAN-TEST-20.
076000     COMPUTE WS-NUM = FUNCTION ATAN(C - C).
076100     IF (WS-NUM >= MIN-RANGE) AND
076200        (WS-NUM <= MAX-RANGE) THEN
076300                    PERFORM PASS
076400     ELSE
076500                    MOVE WS-NUM TO COMPUTED-N
076600                    MOVE MIN-RANGE TO CORRECT-MIN
076700                    MOVE MAX-RANGE TO CORRECT-MAX
076800                    PERFORM FAIL.
076900     GO TO F-ATAN-WRITE-20.
077000 F-ATAN-DELETE-20.
077100     PERFORM  DE-LETE.
077200     GO TO    F-ATAN-WRITE-20.
077300 F-ATAN-WRITE-20.
077400     MOVE "F-ATAN-20" TO PAR-NAME.
077500     PERFORM  PRINT-DETAIL.
077600*****************TEST (l) - COMPLEX TEST****************
077700 F-ATAN-21.
077800     MOVE ZERO TO WS-NUM.
077900     MOVE  0.244968  TO MIN-RANGE.
078000     MOVE  0.244988 TO MAX-RANGE.
078100 F-ATAN-TEST-21.
078200     COMPUTE WS-NUM = FUNCTION ATAN(0.25 * 1).
078300     IF (WS-NUM >= MIN-RANGE) AND
078400        (WS-NUM <= MAX-RANGE) THEN
078500                    PERFORM PASS
078600     ELSE
078700                    MOVE WS-NUM TO COMPUTED-N
078800                    MOVE MIN-RANGE TO CORRECT-MIN
078900                    MOVE MAX-RANGE TO CORRECT-MAX
079000                    PERFORM FAIL.
079100     GO TO F-ATAN-WRITE-21.
079200 F-ATAN-DELETE-21.
079300     PERFORM  DE-LETE.
079400     GO TO    F-ATAN-WRITE-21.
079500 F-ATAN-WRITE-21.
079600     MOVE "F-ATAN-21" TO PAR-NAME.
079700     PERFORM  PRINT-DETAIL.
079800*****************TEST (m) - COMPLEX TEST****************
079900 F-ATAN-22.
080000     MOVE ZERO TO WS-NUM.
080100     MOVE  0.308157  TO MIN-RANGE.
080200     MOVE  0.308181 TO MAX-RANGE.
080300 F-ATAN-TEST-22.
080400     COMPUTE WS-NUM = FUNCTION ATAN(1 / PI).
080500     IF (WS-NUM >= MIN-RANGE) AND
080600        (WS-NUM <= MAX-RANGE) THEN
080700                    PERFORM PASS
080800     ELSE
080900                    MOVE WS-NUM TO COMPUTED-N
081000                    MOVE MIN-RANGE TO CORRECT-MIN
081100                    MOVE MAX-RANGE TO CORRECT-MAX
081200                    PERFORM FAIL.
081300     GO TO F-ATAN-WRITE-22.
081400 F-ATAN-DELETE-22.
081500     PERFORM  DE-LETE.
081600     GO TO    F-ATAN-WRITE-22.
081700 F-ATAN-WRITE-22.
081800     MOVE "F-ATAN-22" TO PAR-NAME.
081900     PERFORM  PRINT-DETAIL.
082000*****************TEST (n) - COMPLEX TEST****************
082100 F-ATAN-23.
082200     MOVE ZERO TO WS-NUM.
082300     MOVE -0.000040 TO MIN-RANGE.
082400     MOVE  0.000040 TO MAX-RANGE.
082500 F-ATAN-TEST-23.
082600     COMPUTE WS-NUM = FUNCTION ATAN((D / D) - 1).
082700     IF (WS-NUM >= MIN-RANGE) AND
082800        (WS-NUM <= MAX-RANGE) THEN
082900                    PERFORM PASS
083000     ELSE
083100                    MOVE WS-NUM TO COMPUTED-N
083200                    MOVE MIN-RANGE TO CORRECT-MIN
083300                    MOVE MAX-RANGE TO CORRECT-MAX
083400                    PERFORM FAIL.
083500     GO TO F-ATAN-WRITE-23.
083600 F-ATAN-DELETE-23.
083700     PERFORM  DE-LETE.
083800     GO TO    F-ATAN-WRITE-23.
083900 F-ATAN-WRITE-23.
084000     MOVE "F-ATAN-23" TO PAR-NAME.
084100     PERFORM  PRINT-DETAIL.
084200*****************TEST (o) - COMPLEX TEST****************
084300 F-ATAN-24.
084400     MOVE ZERO TO WS-NUM.
084500     MOVE -0.709382 TO MIN-RANGE.
084600     MOVE -0.709326 TO MAX-RANGE.
084700 F-ATAN-TEST-24.
084800     COMPUTE WS-NUM = FUNCTION ATAN(PI - 4).
084900     IF (WS-NUM >= MIN-RANGE) AND
085000        (WS-NUM <= MAX-RANGE) THEN
085100                    PERFORM PASS
085200     ELSE
085300                    MOVE WS-NUM TO COMPUTED-N
085400                    MOVE MIN-RANGE TO CORRECT-MIN
085500                    MOVE MAX-RANGE TO CORRECT-MAX
085600                    PERFORM FAIL.
085700     GO TO F-ATAN-WRITE-24.
085800 F-ATAN-DELETE-24.
085900     PERFORM  DE-LETE.
086000     GO TO    F-ATAN-WRITE-24.
086100 F-ATAN-WRITE-24.
086200     MOVE "F-ATAN-24" TO PAR-NAME.
086300     PERFORM  PRINT-DETAIL.
086400*****************TEST (p) - COMPLEX TEST****************
086500 F-ATAN-25.
086600     MOVE ZERO TO WS-NUM.
086700     MOVE 0.511215 TO MIN-RANGE.
086800     MOVE 0.511255 TO MAX-RANGE.
086900 F-ATAN-TEST-25.
087000     COMPUTE WS-NUM = FUNCTION ATAN(FUNCTION ATAN(PI / 5)).
087100     IF (WS-NUM >= MIN-RANGE) AND
087200        (WS-NUM <= MAX-RANGE) THEN
087300                    PERFORM PASS
087400     ELSE
087500                    MOVE WS-NUM TO COMPUTED-N
087600                    MOVE MIN-RANGE TO CORRECT-MIN
087700                    MOVE MAX-RANGE TO CORRECT-MAX
087800                    PERFORM FAIL.
087900     GO TO F-ATAN-WRITE-25.
088000 F-ATAN-DELETE-25.
088100     PERFORM  DE-LETE.
088200     GO TO    F-ATAN-WRITE-25.
088300 F-ATAN-WRITE-25.
088400     MOVE "F-ATAN-25" TO PAR-NAME.
088500     PERFORM  PRINT-DETAIL.
088600*****************TEST (q) - COMPLEX TEST****************
088700 F-ATAN-26.
088800     MOVE ZERO TO WS-NUM.
088900     MOVE -0.000040 TO MIN-RANGE.
089000     MOVE 0.000040 TO MAX-RANGE.
089100 F-ATAN-TEST-26.
089200     COMPUTE WS-NUM = FUNCTION ATAN(0.6) + FUNCTION ATAN(-0.6).
089300
089400     IF (WS-NUM >= MIN-RANGE) AND
089500        (WS-NUM <= MAX-RANGE) THEN
089600                    PERFORM PASS
089700     ELSE
089800                    MOVE WS-NUM TO COMPUTED-N
089900                    MOVE MIN-RANGE TO CORRECT-MIN
090000                    MOVE MAX-RANGE TO CORRECT-MAX
090100                    PERFORM FAIL.
090200     GO TO F-ATAN-WRITE-26.
090300 F-ATAN-DELETE-26.
090400     PERFORM  DE-LETE.
090500     GO TO    F-ATAN-WRITE-26.
090600 F-ATAN-WRITE-26.
090700     MOVE "F-ATAN-26" TO PAR-NAME.
090800     PERFORM  PRINT-DETAIL.
090900*****************SPECIAL PERFORM TEST**********************
091000 F-ATAN-27.
091100     MOVE ZERO TO WS-NUM.
091200     PERFORM F-ATAN-TEST-27
091300       UNTIL FUNCTION ATAN(ARG1) < 0.
091400     PERFORM PASS.
091500     GO TO F-ATAN-WRITE-27.
091600 F-ATAN-TEST-27.
091700     COMPUTE ARG1 = ARG1 - 0.25.
091800 F-ATAN-DELETE-27.
091900     PERFORM  DE-LETE.
092000     GO TO    F-ATAN-WRITE-27.
092100 F-ATAN-WRITE-27.
092200     MOVE "F-ATAN-27" TO PAR-NAME.
092300     PERFORM  PRINT-DETAIL.
092400********************END OF TESTS***************
092500 CCVS-EXIT SECTION.
092600 CCVS-999999.
092700     GO TO CLOSE-FILES.
