000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF106A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function COS.       *
000900*                                                         *
001000***********************************************************
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.
001400     XXXXX082.
001500 OBJECT-COMPUTER.
001600     XXXXX083.
001700 INPUT-OUTPUT SECTION.
001800 FILE-CONTROL.
001900     SELECT PRINT-FILE ASSIGN TO
002000     XXXXX055.
002100 DATA DIVISION.
002200 FILE SECTION.
002300 FD  PRINT-FILE.
002400 01  PRINT-REC PICTURE X(120).
002500 01  DUMMY-RECORD PICTURE X(120).
002600 WORKING-STORAGE SECTION.
002700***********************************************************
002800* Variables specific to the Intrinsic Function Test IF106A*
002900***********************************************************
003000 01  A                   PIC S9(5)V9(5)      VALUE -0.00004.
003100 01  B                   PIC S9(5)V9(5)      VALUE 14000.105.
003200 01  C                   PIC S9(10)          VALUE 100000.
003300 01  D                   PIC S9(10)          VALUE 1000.
003400 01  E                   PIC S9(10)          VALUE 3.
003500 01  PI                  PIC S9V9(17)        VALUE 3.141592654.
003600 01  MINUSPI             PIC S9V9(17)        VALUE -3.141592654.
003700 01  ARG1                PIC S9V9(17)        VALUE 1.00.
003800 01  ARR                                     VALUE "40537".
003900     02  IND OCCURS 5 TIMES PIC 9.
004000 01  TEMP                PIC S9(5)V9(5).
004100 01  WS-NUM              PIC S9(5)V9(6).
004200 01  MIN-RANGE           PIC S9(5)V9(7).
004300 01  MAX-RANGE           PIC S9(5)V9(7).
004400*
004500**********************************************************
004600*
004700 01  TEST-RESULTS.
004800     02 FILLER                   PIC X      VALUE SPACE.
004900     02 FEATURE                  PIC X(20)  VALUE SPACE.
005000     02 FILLER                   PIC X      VALUE SPACE.
005100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005200     02 FILLER                   PIC X      VALUE SPACE.
005300     02  PAR-NAME.
005400       03 FILLER                 PIC X(19)  VALUE SPACE.
005500       03  PARDOT-X              PIC X      VALUE SPACE.
005600       03 DOTVALUE               PIC 99     VALUE ZERO.
005700     02 FILLER                   PIC X(8)   VALUE SPACE.
005800     02 RE-MARK                  PIC X(61).
005900 01  TEST-COMPUTED.
006000     02 FILLER                   PIC X(30)  VALUE SPACE.
006100     02 FILLER                   PIC X(17)  VALUE
006200            "       COMPUTED=".
006300     02 COMPUTED-X.
006400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006500     03 COMPUTED-N               REDEFINES COMPUTED-A
006600                                 PIC -9(9).9(9).
006700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
006900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007000     03       CM-18V0 REDEFINES COMPUTED-A.
007100         04 COMPUTED-18V0                    PIC -9(18).
007200         04 FILLER                           PIC X.
007300     03 FILLER PIC X(50) VALUE SPACE.
007400 01  TEST-CORRECT.
007500     02 FILLER PIC X(30) VALUE SPACE.
007600     02 FILLER PIC X(17) VALUE "       CORRECT =".
007700     02 CORRECT-X.
007800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
007900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008300     03      CR-18V0 REDEFINES CORRECT-A.
008400         04 CORRECT-18V0                     PIC -9(18).
008500         04 FILLER                           PIC X.
008600     03 FILLER PIC X(2) VALUE SPACE.
008700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008800 01  TEST-CORRECT-MIN.
008900     02 FILLER PIC X(30) VALUE SPACE.
009000     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
009100     02 CORRECTMI-X.
009200     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
009300     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
009400     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
009500     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
009600     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
009700     03      CR-18V0 REDEFINES CORRECTMI-A.
009800         04 CORRECTMI-18V0                     PIC -9(18).
009900         04 FILLER                           PIC X.
010000     03 FILLER PIC X(2) VALUE SPACE.
010100     03 FILLER                           PIC X(48) VALUE SPACE.
010200 01  TEST-CORRECT-MAX.
010300     02 FILLER PIC X(30) VALUE SPACE.
010400     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
010500     02 CORRECTMA-X.
010600     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
010700     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
010800     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
010900     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
011000     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
011100     03      CR-18V0 REDEFINES CORRECTMA-A.
011200         04 CORRECTMA-18V0                     PIC -9(18).
011300         04 FILLER                           PIC X.
011400     03 FILLER PIC X(2) VALUE SPACE.
011500     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011600 01  CCVS-C-1.
011700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011800-    "SS  PARAGRAPH-NAME
011900-    "       REMARKS".
012000     02 FILLER                     PIC X(20)    VALUE SPACE.
012100 01  CCVS-C-2.
012200     02 FILLER                     PIC X        VALUE SPACE.
012300     02 FILLER                     PIC X(6)     VALUE "TESTED".
012400     02 FILLER                     PIC X(15)    VALUE SPACE.
012500     02 FILLER                     PIC X(4)     VALUE "FAIL".
012600     02 FILLER                     PIC X(94)    VALUE SPACE.
012700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012800 01  REC-CT                        PIC 99       VALUE ZERO.
012900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013800 01  CCVS-H-1.
013900     02  FILLER                    PIC X(39)    VALUE SPACES.
014000     02  FILLER                    PIC X(42)    VALUE
014100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014200     02  FILLER                    PIC X(39)    VALUE SPACES.
014300 01  CCVS-H-2A.
014400   02  FILLER                        PIC X(40)  VALUE SPACE.
014500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014600   02  FILLER                        PIC XXXX   VALUE
014700     "4.2 ".
014800   02  FILLER                        PIC X(28)  VALUE
014900            " COPY - NOT FOR DISTRIBUTION".
015000   02  FILLER                        PIC X(41)  VALUE SPACE.
015100
015200 01  CCVS-H-2B.
015300   02  FILLER                        PIC X(15)  VALUE
015400            "TEST RESULT OF ".
015500   02  TEST-ID                       PIC X(9).
015600   02  FILLER                        PIC X(4)   VALUE
015700            " IN ".
015800   02  FILLER                        PIC X(12)  VALUE
015900     " HIGH       ".
016000   02  FILLER                        PIC X(22)  VALUE
016100            " LEVEL VALIDATION FOR ".
016200   02  FILLER                        PIC X(58)  VALUE
016300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016400 01  CCVS-H-3.
016500     02  FILLER                      PIC X(34)  VALUE
016600            " FOR OFFICIAL USE ONLY    ".
016700     02  FILLER                      PIC X(58)  VALUE
016800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016900     02  FILLER                      PIC X(28)  VALUE
017000            "  COPYRIGHT   1985 ".
017100 01  CCVS-E-1.
017200     02 FILLER                       PIC X(52)  VALUE SPACE.
017300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017400     02 ID-AGAIN                     PIC X(9).
017500     02 FILLER                       PIC X(45)  VALUE SPACES.
017600 01  CCVS-E-2.
017700     02  FILLER                      PIC X(31)  VALUE SPACE.
017800     02  FILLER                      PIC X(21)  VALUE SPACE.
017900     02 CCVS-E-2-2.
018000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018100         03 FILLER                   PIC X      VALUE SPACE.
018200         03 ENDER-DESC               PIC X(44)  VALUE
018300            "ERRORS ENCOUNTERED".
018400 01  CCVS-E-3.
018500     02  FILLER                      PIC X(22)  VALUE
018600            " FOR OFFICIAL USE ONLY".
018700     02  FILLER                      PIC X(12)  VALUE SPACE.
018800     02  FILLER                      PIC X(58)  VALUE
018900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019000     02  FILLER                      PIC X(13)  VALUE SPACE.
019100     02 FILLER                       PIC X(15)  VALUE
019200             " COPYRIGHT 1985".
019300 01  CCVS-E-4.
019400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019500     02 FILLER                       PIC X(4)   VALUE " OF ".
019600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019700     02 FILLER                       PIC X(40)  VALUE
019800      "  TESTS WERE EXECUTED SUCCESSFULLY".
019900 01  XXINFO.
020000     02 FILLER                       PIC X(19)  VALUE
020100            "*** INFORMATION ***".
020200     02 INFO-TEXT.
020300       04 FILLER                     PIC X(8)   VALUE SPACE.
020400       04 XXCOMPUTED                 PIC X(20).
020500       04 FILLER                     PIC X(5)   VALUE SPACE.
020600       04 XXCORRECT                  PIC X(20).
020700     02 INF-ANSI-REFERENCE           PIC X(48).
020800 01  HYPHEN-LINE.
020900     02 FILLER  PIC IS X VALUE IS SPACE.
021000     02 FILLER  PIC IS X(65)    VALUE IS "************************
021100-    "*****************************************".
021200     02 FILLER  PIC IS X(54)    VALUE IS "************************
021300-    "******************************".
021400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021500     "IF106A".
021600 PROCEDURE DIVISION.
021700 CCVS1 SECTION.
021800 OPEN-FILES.
021900     OPEN     OUTPUT PRINT-FILE.
022000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022100     MOVE    SPACE TO TEST-RESULTS.
022200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022300     GO TO CCVS1-EXIT.
022400 CLOSE-FILES.
022500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022600 TERMINATE-CCVS.
022700     STOP     RUN.
022800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023200     MOVE "****TEST DELETED****" TO RE-MARK.
023300 PRINT-DETAIL.
023400     IF REC-CT NOT EQUAL TO ZERO
023500             MOVE "." TO PARDOT-X
023600             MOVE REC-CT TO DOTVALUE.
023700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024200     MOVE SPACE TO CORRECT-X.
024300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024400     MOVE     SPACE TO RE-MARK.
024500 HEAD-ROUTINE.
024600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025000 COLUMN-NAMES-ROUTINE.
025100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025400 END-ROUTINE.
025500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025600 END-RTN-EXIT.
025700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025800 END-ROUTINE-1.
025900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026100      ADD PASS-COUNTER TO ERROR-HOLD.
026200      MOVE PASS-COUNTER TO CCVS-E-4-1.
026300      MOVE ERROR-HOLD TO CCVS-E-4-2.
026400      MOVE CCVS-E-4 TO CCVS-E-2-2.
026500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026600  END-ROUTINE-12.
026700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026800     IF       ERROR-COUNTER IS EQUAL TO ZERO
026900         MOVE "NO " TO ERROR-TOTAL
027000         ELSE
027100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027300     PERFORM WRITE-LINE.
027400 END-ROUTINE-13.
027500     IF DELETE-COUNTER IS EQUAL TO ZERO
027600         MOVE "NO " TO ERROR-TOTAL  ELSE
027700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028000      IF   INSPECT-COUNTER EQUAL TO ZERO
028100          MOVE "NO " TO ERROR-TOTAL
028200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028600 WRITE-LINE.
028700     ADD 1 TO RECORD-COUNT.
028800Y    IF RECORD-COUNT GREATER 42
028900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029000Y        MOVE SPACE TO DUMMY-RECORD
029100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029200Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029300Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029400Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029500Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029600Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
029700Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030000Y        MOVE ZERO TO RECORD-COUNT.
030100     PERFORM WRT-LN.
030200 WRT-LN.
030300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030400     MOVE SPACE TO DUMMY-RECORD.
030500 BLANK-LINE-PRINT.
030600     PERFORM WRT-LN.
030700 FAIL-ROUTINE.
030800     IF     COMPUTED-X NOT EQUAL TO SPACE
030900            GO TO FAIL-ROUTINE-WRITE.
031000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031400     MOVE   SPACES TO INF-ANSI-REFERENCE.
031500     GO TO  FAIL-ROUTINE-EX.
031600 FAIL-ROUTINE-WRITE.
031700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
031800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
031900                              CORMA-ANSI-REFERENCE.
032000     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
032100           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
032200           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
032300     ELSE
032400           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
032500     PERFORM WRITE-LINE.
032600     MOVE   SPACES TO COR-ANSI-REFERENCE.
032700 FAIL-ROUTINE-EX. EXIT.
032800 BAIL-OUT.
032900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033100 BAIL-OUT-WRITE.
033200     MOVE CORRECT-A TO XXCORRECT.
033300     MOVE COMPUTED-A TO XXCOMPUTED.
033400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033600     MOVE   SPACES TO INF-ANSI-REFERENCE.
033700 BAIL-OUT-EX. EXIT.
033800 CCVS1-EXIT.
033900     EXIT.
034000********************************************************
034100*                                                      *
034200*    Intrinsic Function Tests         IF106A - COS     *
034300*                                                      *
034400********************************************************
034500 SECT-IF106A SECTION.
034600 F-COS-INFO.
034700     MOVE     "See ref. A-38 2.8" TO ANSI-REFERENCE.
034800     MOVE     "COS Function" TO FEATURE.
034900*****************TEST (a) - SIMPLE TEST*****************
035000 F-COS-01.
035100     MOVE ZERO TO WS-NUM.
035200     MOVE  0.999980 TO MIN-RANGE.
035300     MOVE  1.00000 TO MAX-RANGE.
035400 F-COS-TEST-01.
035500     COMPUTE WS-NUM = FUNCTION COS(0).
035600     IF (WS-NUM >= MIN-RANGE) AND
035700        (WS-NUM <= MAX-RANGE) THEN
035800                    PERFORM PASS
035900     ELSE
036000                    MOVE WS-NUM TO COMPUTED-N
036100                    MOVE MIN-RANGE TO CORRECT-MIN
036200                    MOVE MAX-RANGE TO CORRECT-MAX
036300                    PERFORM FAIL.
036400     GO TO F-COS-WRITE-01.
036500 F-COS-DELETE-01.
036600     PERFORM  DE-LETE.
036700     GO TO    F-COS-WRITE-01.
036800 F-COS-WRITE-01.
036900     MOVE "F-COS-01" TO PAR-NAME.
037000     PERFORM  PRINT-DETAIL.
037100*****************TEST (b) - SIMPLE TEST*****************
037200 F-COS-02.
037300     MOVE ZERO TO WS-NUM.
037400     MOVE -1.00000   TO MIN-RANGE.
037500     MOVE -0.999980 TO MAX-RANGE.
037600 F-COS-TEST-02.
037700     COMPUTE WS-NUM = FUNCTION COS(PI).
037800     IF (WS-NUM >= MIN-RANGE) AND
037900        (WS-NUM <= MAX-RANGE) THEN
038000                    PERFORM PASS
038100     ELSE
038200                    MOVE WS-NUM TO COMPUTED-N
038300                    MOVE MIN-RANGE TO CORRECT-MIN
038400                    MOVE MAX-RANGE TO CORRECT-MAX
038500                    PERFORM FAIL.
038600     GO TO F-COS-WRITE-02.
038700 F-COS-DELETE-02.
038800     PERFORM  DE-LETE.
038900     GO TO    F-COS-WRITE-02.
039000 F-COS-WRITE-02.
039100     MOVE "F-COS-02" TO PAR-NAME.
039200     PERFORM  PRINT-DETAIL.
039300*****************TEST (c) - SIMPLE TEST*****************
039400 F-COS-03.
039500     MOVE ZERO TO WS-NUM.
039600     MOVE -1.00000 TO MIN-RANGE.
039700     MOVE -0.999980 TO MAX-RANGE.
039800 F-COS-TEST-03.
039900     COMPUTE WS-NUM = FUNCTION COS(MINUSPI).
040000     IF (WS-NUM >= MIN-RANGE) AND
040100        (WS-NUM <= MAX-RANGE) THEN
040200                    PERFORM PASS
040300     ELSE
040400                    MOVE WS-NUM TO COMPUTED-N
040500                    MOVE MIN-RANGE TO CORRECT-MIN
040600                    MOVE MAX-RANGE TO CORRECT-MAX
040700                    PERFORM FAIL.
040800     GO TO F-COS-WRITE-03.
040900 F-COS-DELETE-03.
041000     PERFORM  DE-LETE.
041100     GO TO    F-COS-WRITE-03.
041200 F-COS-WRITE-03.
041300     MOVE "F-COS-03" TO PAR-NAME.
041400     PERFORM  PRINT-DETAIL.
041500*****************TEST (d) - SIMPLE TEST*****************
041600 F-COS-04.
041700     MOVE ZERO TO WS-NUM.
041800     MOVE  0.999980 TO MIN-RANGE.
041900     MOVE  1.000000 TO MAX-RANGE.
042000 F-COS-TEST-04.
042100     COMPUTE WS-NUM = FUNCTION COS(0.001).
042200     IF (WS-NUM >= MIN-RANGE) AND
042300        (WS-NUM <= MAX-RANGE) THEN
042400                    PERFORM PASS
042500     ELSE
042600                    MOVE WS-NUM TO COMPUTED-N
042700                    MOVE MIN-RANGE TO CORRECT-MIN
042800                    MOVE MAX-RANGE TO CORRECT-MAX
042900                    PERFORM FAIL.
043000     GO TO F-COS-WRITE-04.
043100 F-COS-DELETE-04.
043200     PERFORM  DE-LETE.
043300     GO TO    F-COS-WRITE-04.
043400 F-COS-WRITE-04.
043500     MOVE "F-COS-04" TO PAR-NAME.
043600     PERFORM  PRINT-DETAIL.
043700*****************TEST (e) - SIMPLE TEST*****************
043800 F-COS-05.
043900     MOVE ZERO TO WS-NUM.
044000     MOVE  0.999980 TO MIN-RANGE.
044100     MOVE  1.000000 TO MAX-RANGE.
044200 F-COS-TEST-05.
044300     COMPUTE WS-NUM = FUNCTION COS(.00009).
044400     IF (WS-NUM >= MIN-RANGE) AND
044500        (WS-NUM <= MAX-RANGE) THEN
044600                    PERFORM PASS
044700     ELSE
044800                    MOVE WS-NUM TO COMPUTED-N
044900                    MOVE MIN-RANGE TO CORRECT-MIN
045000                    MOVE MAX-RANGE TO CORRECT-MAX
045100                    PERFORM FAIL.
045200     GO TO F-COS-WRITE-05.
045300 F-COS-DELETE-05.
045400     PERFORM  DE-LETE.
045500     GO TO    F-COS-WRITE-05.
045600 F-COS-WRITE-05.
045700     MOVE "F-COS-05" TO PAR-NAME.
045800     PERFORM  PRINT-DETAIL.
045900*****************TEST (f) - SIMPLE TEST*****************
046000 F-COS-06.
046100     MOVE ZERO TO WS-NUM.
046200     MOVE  0.99998  TO MIN-RANGE.
046300     MOVE  1.000000 TO MAX-RANGE.
046400 F-COS-TEST-06.
046500     COMPUTE WS-NUM = FUNCTION COS(A).
046600     IF (WS-NUM >= MIN-RANGE) AND
046700        (WS-NUM <= MAX-RANGE) THEN
046800                    PERFORM PASS
046900     ELSE
047000                    MOVE WS-NUM TO COMPUTED-N
047100                    MOVE MIN-RANGE TO CORRECT-MIN
047200                    MOVE MAX-RANGE TO CORRECT-MAX
047300                    PERFORM FAIL.
047400     GO TO F-COS-WRITE-06.
047500 F-COS-DELETE-06.
047600     PERFORM  DE-LETE.
047700     GO TO    F-COS-WRITE-06.
047800 F-COS-WRITE-06.
047900     MOVE "F-COS-06" TO PAR-NAME.
048000     PERFORM  PRINT-DETAIL.
048100*****************TEST (g) - SIMPLE TEST*****************
048200 F-COS-07.
048300     MOVE ZERO TO WS-NUM.
048400     MOVE  0.283656 TO MIN-RANGE.
048500     MOVE  0.283668 TO MAX-RANGE.
048600 F-COS-TEST-07.
048700     COMPUTE WS-NUM = FUNCTION COS(IND(E)).
048800     IF (WS-NUM >= MIN-RANGE) AND
048900        (WS-NUM <= MAX-RANGE) THEN
049000                    PERFORM PASS
049100     ELSE
049200                    MOVE WS-NUM TO COMPUTED-N
049300                    MOVE MIN-RANGE TO CORRECT-MIN
049400                    MOVE MAX-RANGE TO CORRECT-MAX
049500                    PERFORM FAIL.
049600     GO TO F-COS-WRITE-07.
049700 F-COS-DELETE-07.
049800     PERFORM  DE-LETE.
049900     GO TO    F-COS-WRITE-07.
050000 F-COS-WRITE-07.
050100     MOVE "F-COS-07" TO PAR-NAME.
050200     PERFORM  PRINT-DETAIL.
050300*****************TEST (h) - SIMPLE TEST*****************
050400 F-COS-08.
050500     MOVE ZERO TO WS-NUM.
050600     MOVE  0.753887 TO MIN-RANGE.
050700     MOVE  0.753917 TO MAX-RANGE.
050800 F-COS-TEST-08.
050900     COMPUTE WS-NUM = FUNCTION COS(IND(5)).
051000     IF (WS-NUM >= MIN-RANGE) AND
051100        (WS-NUM <= MAX-RANGE) THEN
051200                    PERFORM PASS
051300     ELSE
051400                    MOVE WS-NUM TO COMPUTED-N
051500                    MOVE MIN-RANGE TO CORRECT-MIN
051600                    MOVE MAX-RANGE TO CORRECT-MAX
051700                    PERFORM FAIL.
051800     GO TO F-COS-WRITE-08.
051900 F-COS-DELETE-08.
052000     PERFORM  DE-LETE.
052100     GO TO    F-COS-WRITE-08.
052200 F-COS-WRITE-08.
052300     MOVE "F-COS-08" TO PAR-NAME.
052400     PERFORM  PRINT-DETAIL.
052500*****************TEST (a) - COMPLEX TEST****************
052600 F-COS-09.
052700     MOVE ZERO TO WS-NUM.
052800     MOVE  0.499980 TO MIN-RANGE.
052900     MOVE  0.500020 TO MAX-RANGE.
053000 F-COS-TEST-09.
053100     COMPUTE WS-NUM = FUNCTION COS(PI / 3).
053200     IF (WS-NUM >= MIN-RANGE) AND
053300        (WS-NUM <= MAX-RANGE) THEN
053400                    PERFORM PASS
053500     ELSE
053600                    MOVE WS-NUM TO COMPUTED-N
053700                    MOVE MIN-RANGE TO CORRECT-MIN
053800                    MOVE MAX-RANGE TO CORRECT-MAX
053900                    PERFORM FAIL.
054000     GO TO F-COS-WRITE-09.
054100 F-COS-DELETE-09.
054200     PERFORM  DE-LETE.
054300     GO TO    F-COS-WRITE-09.
054400 F-COS-WRITE-09.
054500     MOVE "F-COS-09" TO PAR-NAME.
054600     PERFORM  PRINT-DETAIL.
054700*****************TEST (b) - COMPLEX TEST****************
054800 F-COS-10.
054900     MOVE ZERO TO WS-NUM.
055000     MOVE -0.000040 TO MIN-RANGE.
055100     MOVE  0.000040 TO MAX-RANGE.
055200 F-COS-TEST-10.
055300     COMPUTE WS-NUM = FUNCTION COS(PI / 2).
055400     IF (WS-NUM >= MIN-RANGE) AND
055500        (WS-NUM <= MAX-RANGE) THEN
055600                    PERFORM PASS
055700     ELSE
055800                    MOVE WS-NUM TO COMPUTED-N
055900                    MOVE MIN-RANGE TO CORRECT-MIN
056000                    MOVE MAX-RANGE TO CORRECT-MAX
056100                    PERFORM FAIL.
056200     GO TO F-COS-WRITE-10.
056300 F-COS-DELETE-10.
056400     PERFORM  DE-LETE.
056500     GO TO    F-COS-WRITE-10.
056600 F-COS-WRITE-10.
056700     MOVE "F-COS-10" TO PAR-NAME.
056800     PERFORM  PRINT-DETAIL.
056900*****************TEST (c) - COMPLEX TEST****************
057000 F-COS-11.
057100     MOVE ZERO TO WS-NUM.
057200     MOVE -0.000040 TO MIN-RANGE.
057300     MOVE  0.000040 TO MAX-RANGE.
057400 F-COS-TEST-11.
057500     COMPUTE WS-NUM = FUNCTION COS((3 * PI) / 2).
057600     IF (WS-NUM >= MIN-RANGE) AND
057700        (WS-NUM <= MAX-RANGE) THEN
057800                    PERFORM PASS
057900     ELSE
058000                    MOVE WS-NUM TO COMPUTED-N
058100                    MOVE MIN-RANGE TO CORRECT-MIN
058200                    MOVE MAX-RANGE TO CORRECT-MAX
058300                    PERFORM FAIL.
058400     GO TO F-COS-WRITE-11.
058500 F-COS-DELETE-11.
058600     PERFORM  DE-LETE.
058700     GO TO    F-COS-WRITE-11.
058800 F-COS-WRITE-11.
058900     MOVE "F-COS-11" TO PAR-NAME.
059000     PERFORM  PRINT-DETAIL.
059100*****************TEST (d) - COMPLEX TEST****************
059200 F-COS-12.
059300     MOVE ZERO TO WS-NUM.
059400     MOVE  0.499980 TO MIN-RANGE.
059500     MOVE  0.500002 TO MAX-RANGE.
059600 F-COS-TEST-12.
059700     COMPUTE WS-NUM = FUNCTION COS(MINUSPI / 3).
059800     IF (WS-NUM >= MIN-RANGE) AND
059900        (WS-NUM <= MAX-RANGE) THEN
060000                    PERFORM PASS
060100     ELSE
060200                    MOVE WS-NUM TO COMPUTED-N
060300                    MOVE MIN-RANGE TO CORRECT-MIN
060400                    MOVE MAX-RANGE TO CORRECT-MAX
060500                    PERFORM FAIL.
060600     GO TO F-COS-WRITE-12.
060700 F-COS-DELETE-12.
060800     PERFORM  DE-LETE.
060900     GO TO    F-COS-WRITE-12.
061000 F-COS-WRITE-12.
061100     MOVE "F-COS-12" TO PAR-NAME.
061200     PERFORM  PRINT-DETAIL.
061300*****************TEST (e) - COMPLEX TEST****************
061400 F-COS-13.
061500     MOVE ZERO TO WS-NUM.
061600     MOVE -0.000040 TO MIN-RANGE.
061700     MOVE  0.000040 TO MAX-RANGE.
061800 F-COS-TEST-13.
061900     COMPUTE WS-NUM = FUNCTION COS(MINUSPI / 2).
062000     IF (WS-NUM >= MIN-RANGE) AND
062100        (WS-NUM <= MAX-RANGE) THEN
062200                    PERFORM PASS
062300     ELSE
062400                    MOVE WS-NUM TO COMPUTED-N
062500                    MOVE MIN-RANGE TO CORRECT-MIN
062600                    MOVE MAX-RANGE TO CORRECT-MAX
062700                    PERFORM FAIL.
062800     GO TO F-COS-WRITE-13.
062900 F-COS-DELETE-13.
063000     PERFORM  DE-LETE.
063100     GO TO    F-COS-WRITE-13.
063200 F-COS-WRITE-13.
063300     MOVE "F-COS-13" TO PAR-NAME.
063400     PERFORM  PRINT-DETAIL.
063500*****************TEST (f) - COMPLEX TEST****************
063600 F-COS-14.
063700     MOVE ZERO TO WS-NUM.
063800     MOVE -0.000040 TO MIN-RANGE.
063900     MOVE  0.000040 TO MAX-RANGE.
064000 F-COS-TEST-14.
064100     COMPUTE WS-NUM = FUNCTION COS((3 * MINUSPI) / 2).
064200     IF (WS-NUM >= MIN-RANGE) AND
064300        (WS-NUM <= MAX-RANGE) THEN
064400                    PERFORM PASS
064500     ELSE
064600                    MOVE WS-NUM TO COMPUTED-N
064700                    MOVE MIN-RANGE TO CORRECT-MIN
064800                    MOVE MAX-RANGE TO CORRECT-MAX
064900                    PERFORM FAIL.
065000     GO TO F-COS-WRITE-14.
065100 F-COS-DELETE-14.
065200     PERFORM  DE-LETE.
065300     GO TO    F-COS-WRITE-14.
065400 F-COS-WRITE-14.
065500     MOVE "F-COS-14" TO PAR-NAME.
065600     PERFORM  PRINT-DETAIL.
065700*****************TEST (h) - COMPLEX TEST****************
065800 F-COS-16.
065900     MOVE ZERO TO WS-NUM.
066000     MOVE  0.499113 TO MIN-RANGE.
066100     MOVE  0.499153 TO MAX-RANGE.
066200 F-COS-TEST-16.
066300     COMPUTE WS-NUM = FUNCTION COS((PI / 3) + 0.001).
066400     IF (WS-NUM >= MIN-RANGE) AND
066500        (WS-NUM <= MAX-RANGE) THEN
066600                    PERFORM PASS
066700     ELSE
066800                    MOVE WS-NUM TO COMPUTED-N
066900                    MOVE MIN-RANGE TO CORRECT-MIN
067000                    MOVE MAX-RANGE TO CORRECT-MAX
067100                    PERFORM FAIL.
067200     GO TO F-COS-WRITE-16.
067300 F-COS-DELETE-16.
067400     PERFORM  DE-LETE.
067500     GO TO    F-COS-WRITE-16.
067600 F-COS-WRITE-16.
067700     MOVE "F-COS-16" TO PAR-NAME.
067800     PERFORM  PRINT-DETAIL.
067900*****************TEST (j) - COMPLEX TEST****************
068000 F-COS-18.
068100     MOVE ZERO TO WS-NUM.
068200     MOVE  0.999350 TO MIN-RANGE.
068300     MOVE  0.999430 TO MAX-RANGE.
068400 F-COS-TEST-18.
068500     COMPUTE WS-NUM = FUNCTION COS(PI * (4 - 2) / 180).
068600     IF (WS-NUM >= MIN-RANGE) AND
068700        (WS-NUM <= MAX-RANGE) THEN
068800                    PERFORM PASS
068900     ELSE
069000                    MOVE WS-NUM TO COMPUTED-N
069100                    MOVE MIN-RANGE TO CORRECT-MIN
069200                    MOVE MAX-RANGE TO CORRECT-MAX
069300                    PERFORM FAIL.
069400     GO TO F-COS-WRITE-18.
069500 F-COS-DELETE-18.
069600     PERFORM  DE-LETE.
069700     GO TO    F-COS-WRITE-18.
069800 F-COS-WRITE-18.
069900     MOVE "F-COS-18" TO PAR-NAME.
070000     PERFORM  PRINT-DETAIL.
070100*****************TEST (k) - COMPLEX TEST****************
070200 F-COS-19.
070300     MOVE ZERO TO WS-NUM.
070400     MOVE  0.017451 TO MIN-RANGE.
070500     MOVE  0.017453 TO MAX-RANGE.
070600 F-COS-TEST-19.
070700     COMPUTE WS-NUM = FUNCTION COS((PI / 2) - (PI / 180)).
070800     IF (WS-NUM >= MIN-RANGE) AND
070900        (WS-NUM <= MAX-RANGE) THEN
071000                    PERFORM PASS
071100     ELSE
071200                    MOVE WS-NUM TO COMPUTED-N
071300                    MOVE MIN-RANGE TO CORRECT-MIN
071400                    MOVE MAX-RANGE TO CORRECT-MAX
071500                    PERFORM FAIL.
071600     GO TO F-COS-WRITE-19.
071700 F-COS-DELETE-19.
071800     PERFORM  DE-LETE.
071900     GO TO    F-COS-WRITE-19.
072000 F-COS-WRITE-19.
072100     MOVE "F-COS-19" TO PAR-NAME.
072200     PERFORM  PRINT-DETAIL.
072300*****************TEST (l) - COMPLEX TEST****************
072400 F-COS-20.
072500     MOVE ZERO TO WS-NUM.
072600     MOVE  0.515017  TO MIN-RANGE.
072700     MOVE  0.515059 TO MAX-RANGE.
072800 F-COS-TEST-20.
072900     COMPUTE WS-NUM = FUNCTION COS((PI / 3) - (PI / 180)).
073000     IF (WS-NUM >= MIN-RANGE) AND
073100        (WS-NUM <= MAX-RANGE) THEN
073200                    PERFORM PASS
073300     ELSE
073400                    MOVE WS-NUM TO COMPUTED-N
073500                    MOVE MIN-RANGE TO CORRECT-MIN
073600                    MOVE MAX-RANGE TO CORRECT-MAX
073700                    PERFORM FAIL.
073800     GO TO F-COS-WRITE-20.
073900 F-COS-DELETE-20.
074000     PERFORM  DE-LETE.
074100     GO TO    F-COS-WRITE-20.
074200 F-COS-WRITE-20.
074300     MOVE "F-COS-20" TO PAR-NAME.
074400     PERFORM  PRINT-DETAIL.
074500*****************TEST (m) - COMPLEX TEST****************
074600 F-COS-21.
074700     MOVE ZERO TO WS-NUM.
074800     MOVE -0.999887 TO MIN-RANGE.
074900     MOVE -0.999807 TO MAX-RANGE.
075000 F-COS-TEST-21.
075100     COMPUTE WS-NUM = FUNCTION COS(PI + (PI / 180)).
075200     IF (WS-NUM >= MIN-RANGE) AND
075300        (WS-NUM <= MAX-RANGE) THEN
075400                    PERFORM PASS
075500     ELSE
075600                    MOVE WS-NUM TO COMPUTED-N
075700                    MOVE MIN-RANGE TO CORRECT-MIN
075800                    MOVE MAX-RANGE TO CORRECT-MAX
075900                    PERFORM FAIL.
076000     GO TO F-COS-WRITE-21.
076100 F-COS-DELETE-21.
076200     PERFORM  DE-LETE.
076300     GO TO    F-COS-WRITE-21.
076400 F-COS-WRITE-21.
076500     MOVE "F-COS-21" TO PAR-NAME.
076600     PERFORM  PRINT-DETAIL.
076700*****************TEST (n) - COMPLEX TEST****************
076800 F-COS-22.
076900     MOVE ZERO TO WS-NUM.
077000     MOVE  0.034898 TO MIN-RANGE.
077100     MOVE  0.034900 TO MAX-RANGE.
077200 F-COS-TEST-22.
077300     COMPUTE WS-NUM = FUNCTION COS(( PI * 272) / 180).
077400     IF (WS-NUM >= MIN-RANGE) AND
077500        (WS-NUM <= MAX-RANGE) THEN
077600                    PERFORM PASS
077700     ELSE
077800                    MOVE WS-NUM TO COMPUTED-N
077900                    MOVE MIN-RANGE TO CORRECT-MIN
078000                    MOVE MAX-RANGE TO CORRECT-MAX
078100                    PERFORM FAIL.
078200     GO TO F-COS-WRITE-22.
078300 F-COS-DELETE-22.
078400     PERFORM  DE-LETE.
078500     GO TO    F-COS-WRITE-22.
078600 F-COS-WRITE-22.
078700     MOVE "F-COS-22" TO PAR-NAME.
078800     PERFORM  PRINT-DETAIL.
078900*****************TEST (o) - COMPLEX TEST****************
079000 F-COS-23.
079100     MOVE ZERO TO WS-NUM.
079200     MOVE -0.416163  TO MIN-RANGE.
079300     MOVE -0.416129 TO MAX-RANGE.
079400 F-COS-TEST-23.
079500     COMPUTE WS-NUM = FUNCTION COS(4 / 2).
079600     IF (WS-NUM >= MIN-RANGE) AND
079700        (WS-NUM <= MAX-RANGE) THEN
079800                    PERFORM PASS
079900     ELSE
080000                    MOVE WS-NUM TO COMPUTED-N
080100                    MOVE MIN-RANGE TO CORRECT-MIN
080200                    MOVE MAX-RANGE TO CORRECT-MAX
080300                    PERFORM FAIL.
080400     GO TO F-COS-WRITE-23.
080500 F-COS-DELETE-23.
080600     PERFORM  DE-LETE.
080700     GO TO    F-COS-WRITE-23.
080800 F-COS-WRITE-23.
080900     MOVE "F-COS-23" TO PAR-NAME.
081000     PERFORM  PRINT-DETAIL.
081100*****************TEST (p) - COMPLEX TEST****************
081200 F-COS-24.
081300     MOVE ZERO TO WS-NUM.
081400     MOVE  0.070734 TO MIN-RANGE.
081500     MOVE  0.070740 TO MAX-RANGE.
081600 F-COS-TEST-24.
081700     COMPUTE WS-NUM = FUNCTION COS(3 / 2).
081800     IF (WS-NUM >= MIN-RANGE) AND
081900        (WS-NUM <= MAX-RANGE) THEN
082000                    PERFORM PASS
082100     ELSE
082200                    MOVE WS-NUM TO COMPUTED-N
082300                    MOVE MIN-RANGE TO CORRECT-MIN
082400                    MOVE MAX-RANGE TO CORRECT-MAX
082500                    PERFORM FAIL.
082600     GO TO F-COS-WRITE-24.
082700 F-COS-DELETE-24.
082800     PERFORM  DE-LETE.
082900     GO TO    F-COS-WRITE-24.
083000 F-COS-WRITE-24.
083100     MOVE "F-COS-24" TO PAR-NAME.
083200     PERFORM  PRINT-DETAIL.
083300*****************TEST (q) - COMPLEX TEST****************
083400 F-COS-25.
083500     MOVE ZERO TO WS-NUM.
083600     MOVE -1.000000 TO MIN-RANGE.
083700     MOVE -0.999960 TO MAX-RANGE.
083800 F-COS-TEST-25.
083900     COMPUTE WS-NUM = FUNCTION COS(PI - A).
084000     IF (WS-NUM >= MIN-RANGE) AND
084100        (WS-NUM <= MAX-RANGE) THEN
084200                    PERFORM PASS
084300     ELSE
084400                    MOVE WS-NUM TO COMPUTED-N
084500                    MOVE MIN-RANGE TO CORRECT-MIN
084600                    MOVE MAX-RANGE TO CORRECT-MAX
084700                    PERFORM FAIL.
084800     GO TO F-COS-WRITE-25.
084900 F-COS-DELETE-25.
085000     PERFORM  DE-LETE.
085100     GO TO    F-COS-WRITE-25.
085200 F-COS-WRITE-25.
085300     MOVE "F-COS-25" TO PAR-NAME.
085400     PERFORM  PRINT-DETAIL.
085500*****************TEST (r) - COMPLEX TEST****************
085600 F-COS-26.
085700     MOVE ZERO TO WS-NUM.
085800     MOVE -0.839105 TO MIN-RANGE.
085900     MOVE -0.839037 TO MAX-RANGE.
086000 F-COS-TEST-26.
086100     COMPUTE WS-NUM = FUNCTION COS(D / 100).
086200     IF (WS-NUM >= MIN-RANGE) AND
086300        (WS-NUM <= MAX-RANGE) THEN
086400                    PERFORM PASS
086500     ELSE
086600                    MOVE WS-NUM TO COMPUTED-N
086700                    MOVE MIN-RANGE TO CORRECT-MIN
086800                    MOVE MAX-RANGE TO CORRECT-MAX
086900                    PERFORM FAIL.
087000     GO TO F-COS-WRITE-26.
087100 F-COS-DELETE-26.
087200     PERFORM  DE-LETE.
087300     GO TO    F-COS-WRITE-26.
087400 F-COS-WRITE-26.
087500     MOVE "F-COS-26" TO PAR-NAME.
087600     PERFORM  PRINT-DETAIL.
087700*****************TEST (s) - COMPLEX TEST****************
087800 F-COS-27.
087900     MOVE ZERO TO WS-NUM.
088000     MOVE  0.999807  TO MIN-RANGE.
088100     MOVE  0.999887 TO MAX-RANGE.
088200 F-COS-TEST-27.
088300     COMPUTE WS-NUM = FUNCTION COS(PI / 180).
088400     IF (WS-NUM >= MIN-RANGE) AND
088500        (WS-NUM <= MAX-RANGE) THEN
088600                    PERFORM PASS
088700     ELSE
088800                    MOVE WS-NUM TO COMPUTED-N
088900                    MOVE MIN-RANGE TO CORRECT-MIN
089000                    MOVE MAX-RANGE TO CORRECT-MAX
089100                    PERFORM FAIL.
089200     GO TO F-COS-WRITE-27.
089300 F-COS-DELETE-27.
089400     PERFORM  DE-LETE.
089500     GO TO    F-COS-WRITE-27.
089600 F-COS-WRITE-27.
089700     MOVE "F-COS-27" TO PAR-NAME.
089800     PERFORM  PRINT-DETAIL.
089900*****************TEST (t) - COMPLEX TEST****************
090000 F-COS-28.
090100     MOVE ZERO TO WS-NUM.
090200     MOVE -1.000000 TO MIN-RANGE.
090300     MOVE -0.999960 TO MAX-RANGE.
090400 F-COS-TEST-28.
090500     COMPUTE WS-NUM = FUNCTION COS(PI - 0.001).
090600     IF (WS-NUM >= MIN-RANGE) AND
090700        (WS-NUM <= MAX-RANGE) THEN
090800                    PERFORM PASS
090900     ELSE
091000                    MOVE WS-NUM TO COMPUTED-N
091100                    MOVE MIN-RANGE TO CORRECT-MIN
091200                    MOVE MAX-RANGE TO CORRECT-MAX
091300                    PERFORM FAIL.
091400     GO TO F-COS-WRITE-28.
091500 F-COS-DELETE-28.
091600     PERFORM  DE-LETE.
091700     GO TO    F-COS-WRITE-28.
091800 F-COS-WRITE-28.
091900     MOVE "F-COS-28" TO PAR-NAME.
092000     PERFORM  PRINT-DETAIL.
092100*****************TEST (u) - COMPLEX TEST****************
092200 F-COS-29.
092300     MOVE ZERO TO WS-NUM.
092400     MOVE -0.000040 TO MIN-RANGE.
092500     MOVE  0.000040 TO MAX-RANGE.
092600 F-COS-TEST-29.
092700     COMPUTE WS-NUM = FUNCTION COS(PI) + 1.
092800     IF (WS-NUM >= MIN-RANGE) AND
092900        (WS-NUM <= MAX-RANGE) THEN
093000                    PERFORM PASS
093100     ELSE
093200                    MOVE WS-NUM TO COMPUTED-N
093300                    MOVE MIN-RANGE TO CORRECT-MIN
093400                    MOVE MAX-RANGE TO CORRECT-MAX
093500                    PERFORM FAIL.
093600     GO TO F-COS-WRITE-29.
093700 F-COS-DELETE-29.
093800     PERFORM  DE-LETE.
093900     GO TO    F-COS-WRITE-29.
094000 F-COS-WRITE-29.
094100     MOVE "F-COS-29" TO PAR-NAME.
094200     PERFORM  PRINT-DETAIL.
094300*****************TEST (v) - COMPLEX TEST****************
094400 F-COS-30.
094500     MOVE ZERO TO WS-NUM.
094600     MOVE 0.914616 TO MIN-RANGE.
094700     MOVE 0.914690 TO MAX-RANGE.
094800 F-COS-TEST-30.
094900     COMPUTE WS-NUM = FUNCTION COS(FUNCTION COS(2)).
095000     IF (WS-NUM >= MIN-RANGE) AND
095100        (WS-NUM <= MAX-RANGE) THEN
095200                    PERFORM PASS
095300     ELSE
095400                    MOVE WS-NUM TO COMPUTED-N
095500                    MOVE MIN-RANGE TO CORRECT-MIN
095600                    MOVE MAX-RANGE TO CORRECT-MAX
095700                    PERFORM FAIL.
095800     GO TO F-COS-WRITE-30.
095900 F-COS-DELETE-30.
096000     PERFORM  DE-LETE.
096100     GO TO    F-COS-WRITE-30.
096200 F-COS-WRITE-30.
096300     MOVE "F-COS-30" TO PAR-NAME.
096400     PERFORM  PRINT-DETAIL.
096500*****************TEST (w) - COMPLEX TEST****************
096600 F-COS-31.
096700     MOVE ZERO TO WS-NUM.
096800     MOVE -2.00008 TO MIN-RANGE.
096900     MOVE -1.99992 TO MAX-RANGE.
097000 F-COS-TEST-31.
097100     COMPUTE WS-NUM = FUNCTION COS(PI) +
097200                              FUNCTION COS(PI).
097300     IF (WS-NUM >= MIN-RANGE) AND
097400        (WS-NUM <= MAX-RANGE) THEN
097500                    PERFORM PASS
097600     ELSE
097700                    MOVE WS-NUM TO COMPUTED-N
097800                    MOVE MIN-RANGE TO CORRECT-MIN
097900                    MOVE MAX-RANGE TO CORRECT-MAX
098000                    PERFORM FAIL.
098100     GO TO F-COS-WRITE-31.
098200 F-COS-DELETE-31.
098300     PERFORM  DE-LETE.
098400     GO TO    F-COS-WRITE-31.
098500 F-COS-WRITE-31.
098600     MOVE "F-COS-31" TO PAR-NAME.
098700     PERFORM  PRINT-DETAIL.
098800*****************SPECIAL PERFORM TEST**********************
098900 F-COS-32.
099000     PERFORM F-COS-TEST-32
099100       UNTIL FUNCTION COS(ARG1) < 0.
099200     PERFORM PASS.
099300     GO TO F-COS-WRITE-32.
099400 F-COS-TEST-32.
099500     COMPUTE ARG1 = ARG1 - 0.25.
099600 F-COS-DELETE-32.
099700     PERFORM  DE-LETE.
099800     GO TO    F-COS-WRITE-32.
099900 F-COS-WRITE-32.
100000     MOVE "F-COS-32" TO PAR-NAME.
100100     PERFORM  PRINT-DETAIL.
100200********************END OF TESTS***************
100300 CCVS-EXIT SECTION.
100400 CCVS-999999.
100500     GO TO CLOSE-FILES.
