000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF101A.
000400
000500***********************************************************
000600*                                                         *
000700*   This program is intended to form part of the CCVS85   *
000800*   COBOL Test Suite. It contains tests for the           *
000900*   Intrinsic Function ACOS.                              *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT PRINT-FILE ASSIGN TO
002100     XXXXX055.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  PRINT-FILE.
002500 01  PRINT-REC PICTURE X(120).
002600 01  DUMMY-RECORD PICTURE X(120).
002700 WORKING-STORAGE SECTION.
002800***********************************************************
002900* Variables specific to the Intrinsic Function Test IF101A*
003000***********************************************************
003100 01  A                   PIC S9(5)V9(5)      VALUE -0.00004.
003200 01  B                   PIC S9(10)          VALUE 4.
003300 01  C                   PIC S9(10)          VALUE 100000.
003400 01  D                   PIC S9(10)          VALUE 1000.
003500 01  PI                  PIC S9V9(17)        VALUE 3.141592654.
003600 01  ARG1                PIC S9V9(17)        VALUE 0.00.
003700 01  SQRT2               PIC S9V9(17)        VALUE 1.414213562.
003800 01  SQRT3D2             PIC S9V9(17)        VALUE 0.866025403.
003900 01  ARR                                     VALUE "40537".
004000     02  IND OCCURS 5 TIMES PIC 9.
004100 01  TEMP                PIC S9(5)V9(5).
004200 01  WS-NUM              PIC S9(5)V9(6).
004300 01  MIN-RANGE           PIC S9(5)V9(7).
004400 01  MAX-RANGE           PIC S9(5)V9(7).
004500*
004600**********************************************************
004700*
004800 01  TEST-RESULTS.
004900     02 FILLER                   PIC X      VALUE SPACE.
005000     02 FEATURE                  PIC X(20)  VALUE SPACE.
005100     02 FILLER                   PIC X      VALUE SPACE.
005200     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005300     02 FILLER                   PIC X      VALUE SPACE.
005400     02  PAR-NAME.
005500       03 FILLER                 PIC X(19)  VALUE SPACE.
005600       03  PARDOT-X              PIC X      VALUE SPACE.
005700       03 DOTVALUE               PIC 99     VALUE ZERO.
005800     02 FILLER                   PIC X(8)   VALUE SPACE.
005900     02 RE-MARK                  PIC X(61).
006000 01  TEST-COMPUTED.
006100     02 FILLER                   PIC X(30)  VALUE SPACE.
006200     02 FILLER                   PIC X(17)  VALUE
006300            "       COMPUTED=".
006400     02 COMPUTED-X.
006500     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006600     03 COMPUTED-N               REDEFINES COMPUTED-A
006700                                 PIC -9(9).9(9).
006800     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006900     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007000     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007100     03       CM-18V0 REDEFINES COMPUTED-A.
007200         04 COMPUTED-18V0                    PIC -9(18).
007300         04 FILLER                           PIC X.
007400     03 FILLER PIC X(50) VALUE SPACE.
007500 01  TEST-CORRECT.
007600     02 FILLER PIC X(30) VALUE SPACE.
007700     02 FILLER PIC X(17) VALUE "       CORRECT =".
007800     02 CORRECT-X.
007900     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008000     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008100     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008200     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008300     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008400     03      CR-18V0 REDEFINES CORRECT-A.
008500         04 CORRECT-18V0                     PIC -9(18).
008600         04 FILLER                           PIC X.
008700     03 FILLER PIC X(2) VALUE SPACE.
008800     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008900 01  TEST-CORRECT-MIN.
009000     02 FILLER PIC X(30) VALUE SPACE.
009100     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
009200     02 CORRECTMI-X.
009300     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
009400     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
009500     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
009600     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
009700     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
009800     03      CR-18V0 REDEFINES CORRECTMI-A.
009900         04 CORRECTMI-18V0                     PIC -9(18).
010000         04 FILLER                           PIC X.
010100     03 FILLER PIC X(2) VALUE SPACE.
010200     03 FILLER                           PIC X(48) VALUE SPACE.
010300 01  TEST-CORRECT-MAX.
010400     02 FILLER PIC X(30) VALUE SPACE.
010500     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
010600     02 CORRECTMA-X.
010700     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
010800     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
010900     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
011000     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
011100     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
011200     03      CR-18V0 REDEFINES CORRECTMA-A.
011300         04 CORRECTMA-18V0                     PIC -9(18).
011400         04 FILLER                           PIC X.
011500     03 FILLER PIC X(2) VALUE SPACE.
011600     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011700 01  CCVS-C-1.
011800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011900-    "SS  PARAGRAPH-NAME
012000-    "       REMARKS".
012100     02 FILLER                     PIC X(20)    VALUE SPACE.
012200 01  CCVS-C-2.
012300     02 FILLER                     PIC X        VALUE SPACE.
012400     02 FILLER                     PIC X(6)     VALUE "TESTED".
012500     02 FILLER                     PIC X(15)    VALUE SPACE.
012600     02 FILLER                     PIC X(4)     VALUE "FAIL".
012700     02 FILLER                     PIC X(94)    VALUE SPACE.
012800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012900 01  REC-CT                        PIC 99       VALUE ZERO.
013000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013900 01  CCVS-H-1.
014000     02  FILLER                    PIC X(39)    VALUE SPACES.
014100     02  FILLER                    PIC X(42)    VALUE
014200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014300     02  FILLER                    PIC X(39)    VALUE SPACES.
014400 01  CCVS-H-2A.
014500   02  FILLER                        PIC X(40)  VALUE SPACE.
014600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014700   02  FILLER                        PIC XXXX   VALUE
014800     "4.2 ".
014900   02  FILLER                        PIC X(28)  VALUE
015000            " COPY - NOT FOR DISTRIBUTION".
015100   02  FILLER                        PIC X(41)  VALUE SPACE.
015200
015300 01  CCVS-H-2B.
015400   02  FILLER                        PIC X(15)  VALUE
015500            "TEST RESULT OF ".
015600   02  TEST-ID                       PIC X(9).
015700   02  FILLER                        PIC X(4)   VALUE
015800            " IN ".
015900   02  FILLER                        PIC X(12)  VALUE
016000     " HIGH       ".
016100   02  FILLER                        PIC X(22)  VALUE
016200            " LEVEL VALIDATION FOR ".
016300   02  FILLER                        PIC X(58)  VALUE
016400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016500 01  CCVS-H-3.
016600     02  FILLER                      PIC X(34)  VALUE
016700            " FOR OFFICIAL USE ONLY    ".
016800     02  FILLER                      PIC X(58)  VALUE
016900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017000     02  FILLER                      PIC X(28)  VALUE
017100            "  COPYRIGHT   1985 ".
017200 01  CCVS-E-1.
017300     02 FILLER                       PIC X(52)  VALUE SPACE.
017400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017500     02 ID-AGAIN                     PIC X(9).
017600     02 FILLER                       PIC X(45)  VALUE SPACES.
017700 01  CCVS-E-2.
017800     02  FILLER                      PIC X(31)  VALUE SPACE.
017900     02  FILLER                      PIC X(21)  VALUE SPACE.
018000     02 CCVS-E-2-2.
018100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018200         03 FILLER                   PIC X      VALUE SPACE.
018300         03 ENDER-DESC               PIC X(44)  VALUE
018400            "ERRORS ENCOUNTERED".
018500 01  CCVS-E-3.
018600     02  FILLER                      PIC X(22)  VALUE
018700            " FOR OFFICIAL USE ONLY".
018800     02  FILLER                      PIC X(12)  VALUE SPACE.
018900     02  FILLER                      PIC X(58)  VALUE
019000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019100     02  FILLER                      PIC X(13)  VALUE SPACE.
019200     02 FILLER                       PIC X(15)  VALUE
019300             " COPYRIGHT 1985".
019400 01  CCVS-E-4.
019500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019600     02 FILLER                       PIC X(4)   VALUE " OF ".
019700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019800     02 FILLER                       PIC X(40)  VALUE
019900      "  TESTS WERE EXECUTED SUCCESSFULLY".
020000 01  XXINFO.
020100     02 FILLER                       PIC X(19)  VALUE
020200            "*** INFORMATION ***".
020300     02 INFO-TEXT.
020400       04 FILLER                     PIC X(8)   VALUE SPACE.
020500       04 XXCOMPUTED                 PIC X(20).
020600       04 FILLER                     PIC X(5)   VALUE SPACE.
020700       04 XXCORRECT                  PIC X(20).
020800     02 INF-ANSI-REFERENCE           PIC X(48).
020900 01  HYPHEN-LINE.
021000     02 FILLER  PIC IS X VALUE IS SPACE.
021100     02 FILLER  PIC IS X(65)    VALUE IS "************************
021200-    "*****************************************".
021300     02 FILLER  PIC IS X(54)    VALUE IS "************************
021400-    "******************************".
021500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021600     "IF101A".
021700 PROCEDURE DIVISION.
021800 CCVS1 SECTION.
021900 OPEN-FILES.
022000     OPEN     OUTPUT PRINT-FILE.
022100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022200     MOVE    SPACE TO TEST-RESULTS.
022300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022400     GO TO CCVS1-EXIT.
022500 CLOSE-FILES.
022600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022700 TERMINATE-CCVS.
022800     STOP     RUN.
022900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023300     MOVE "****TEST DELETED****" TO RE-MARK.
023400 PRINT-DETAIL.
023500     IF REC-CT NOT EQUAL TO ZERO
023600             MOVE "." TO PARDOT-X
023700             MOVE REC-CT TO DOTVALUE.
023800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024300     MOVE SPACE TO CORRECT-X.
024400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024500     MOVE     SPACE TO RE-MARK.
024600 HEAD-ROUTINE.
024700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025100 COLUMN-NAMES-ROUTINE.
025200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025500 END-ROUTINE.
025600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025700 END-RTN-EXIT.
025800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025900 END-ROUTINE-1.
026000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026200      ADD PASS-COUNTER TO ERROR-HOLD.
026300      MOVE PASS-COUNTER TO CCVS-E-4-1.
026400      MOVE ERROR-HOLD TO CCVS-E-4-2.
026500      MOVE CCVS-E-4 TO CCVS-E-2-2.
026600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026700  END-ROUTINE-12.
026800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026900     IF       ERROR-COUNTER IS EQUAL TO ZERO
027000         MOVE "NO " TO ERROR-TOTAL
027100         ELSE
027200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027400     PERFORM WRITE-LINE.
027500 END-ROUTINE-13.
027600     IF DELETE-COUNTER IS EQUAL TO ZERO
027700         MOVE "NO " TO ERROR-TOTAL  ELSE
027800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028100      IF   INSPECT-COUNTER EQUAL TO ZERO
028200          MOVE "NO " TO ERROR-TOTAL
028300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028700 WRITE-LINE.
028800     ADD 1 TO RECORD-COUNT.
028900Y    IF RECORD-COUNT GREATER 42
029000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029100Y        MOVE SPACE TO DUMMY-RECORD
029200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029300Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029400Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029500Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029600Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029700Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
029800Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030100Y        MOVE ZERO TO RECORD-COUNT.
030200     PERFORM WRT-LN.
030300 WRT-LN.
030400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030500     MOVE SPACE TO DUMMY-RECORD.
030600 BLANK-LINE-PRINT.
030700     PERFORM WRT-LN.
030800 FAIL-ROUTINE.
030900     IF     COMPUTED-X NOT EQUAL TO SPACE
031000            GO TO FAIL-ROUTINE-WRITE.
031100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031500     MOVE   SPACES TO INF-ANSI-REFERENCE.
031600     GO TO  FAIL-ROUTINE-EX.
031700 FAIL-ROUTINE-WRITE.
031800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
031900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
032000                              CORMA-ANSI-REFERENCE.
032100     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
032200           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
032300           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
032400     ELSE
032500           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
032600     PERFORM WRITE-LINE.
032700     MOVE   SPACES TO COR-ANSI-REFERENCE.
032800 FAIL-ROUTINE-EX. EXIT.
032900 BAIL-OUT.
033000     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033100     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033200 BAIL-OUT-WRITE.
033300     MOVE CORRECT-A TO XXCORRECT.
033400     MOVE COMPUTED-A TO XXCOMPUTED.
033500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033700     MOVE   SPACES TO INF-ANSI-REFERENCE.
033800 BAIL-OUT-EX. EXIT.
033900 CCVS1-EXIT.
034000     EXIT.
034100********************************************************
034200*                                                      *
034300*    Intrinsic Function Tests         IF101A - ACOS    *
034400*                                                      *
034500********************************************************
034600 SECT-IF101A SECTION.
034700 F-ACOS-INFO.
034800     MOVE     "See ref. A-33 2.5" TO ANSI-REFERENCE.
034900     MOVE     "ACOS Function" TO FEATURE.
035000*****************TEST (a) - SIMPLE TEST*****************
035100 F-ACOS-01.
035200     MOVE ZERO TO WS-NUM.
035300     MOVE  0.000000 TO MIN-RANGE.
035400     MOVE  0.000020 TO MAX-RANGE.
035500 F-ACOS-TEST-01.
035600     COMPUTE WS-NUM = FUNCTION ACOS(1.0).
035700     IF (WS-NUM >= MIN-RANGE) AND
035800        (WS-NUM <= MAX-RANGE) THEN
035900                    PERFORM PASS
036000     ELSE
036100                    MOVE WS-NUM TO COMPUTED-N
036200                    MOVE MIN-RANGE TO CORRECT-MIN
036300                    MOVE MAX-RANGE TO CORRECT-MAX
036400                    PERFORM FAIL.
036500     GO TO F-ACOS-WRITE-01.
036600 F-ACOS-DELETE-01.
036700     PERFORM  DE-LETE.
036800     GO TO    F-ACOS-WRITE-01.
036900 F-ACOS-WRITE-01.
037000     MOVE "F-ACOS-01" TO PAR-NAME.
037100     PERFORM  PRINT-DETAIL.
037200*****************TEST (b) - SIMPLE TEST*****************
037300 F-ACOS-02.
037400     MOVE  1.04718 TO MIN-RANGE.
037500     MOVE  1.04722 TO MAX-RANGE.
037600 F-ACOS-TEST-02.
037700     IF (FUNCTION ACOS(0.5) >= MIN-RANGE) AND
037800        (FUNCTION ACOS(0.5) <= MAX-RANGE) THEN
037900                    PERFORM PASS
038000     ELSE
038100                    PERFORM FAIL.
038200     GO TO F-ACOS-WRITE-02.
038300 F-ACOS-DELETE-02.
038400     PERFORM  DE-LETE.
038500     GO TO    F-ACOS-WRITE-02.
038600 F-ACOS-WRITE-02.
038700     MOVE "F-ACOS-02" TO PAR-NAME.
038800     PERFORM  PRINT-DETAIL.
038900*****************TEST (c) - SIMPLE TEST*****************
039000 F-ACOS-03.
039100     EVALUATE FUNCTION ACOS(0)
039200     WHEN 1.57076 THRU 1.57082
039300                    PERFORM PASS
039400     WHEN OTHER
039500                    PERFORM FAIL.
039600     GO TO F-ACOS-WRITE-03.
039700 F-ACOS-DELETE-03.
039800     PERFORM  DE-LETE.
039900     GO TO    F-ACOS-WRITE-03.
040000 F-ACOS-WRITE-03.
040100     MOVE "F-ACOS-03" TO PAR-NAME.
040200     PERFORM  PRINT-DETAIL.
040300*****************TEST (d) - SIMPLE TEST*****************
040400 F-ACOS-04.
040500     MOVE ZERO TO WS-NUM.
040600     MOVE  3.14153 TO MIN-RANGE.
040700     MOVE  3.14165 TO MAX-RANGE.
040800 F-ACOS-TEST-04.
040900     COMPUTE WS-NUM = FUNCTION ACOS(-1).
041000     IF (WS-NUM >= MIN-RANGE) AND
041100        (WS-NUM <= MAX-RANGE) THEN
041200                    PERFORM PASS
041300     ELSE
041400                    MOVE WS-NUM TO COMPUTED-N
041500                    MOVE MIN-RANGE TO CORRECT-MIN
041600                    MOVE MAX-RANGE TO CORRECT-MAX
041700                    PERFORM FAIL.
041800     GO TO F-ACOS-WRITE-04.
041900 F-ACOS-DELETE-04.
042000     PERFORM  DE-LETE.
042100     GO TO    F-ACOS-WRITE-04.
042200 F-ACOS-WRITE-04.
042300     MOVE "F-ACOS-04" TO PAR-NAME.
042400     PERFORM  PRINT-DETAIL.
042500*****************TEST (e) - SIMPLE TEST*****************
042600 F-ACOS-05.
042700     MOVE ZERO TO WS-NUM.
042800     MOVE  0.044724 TO MIN-RANGE.
042900     MOVE  0.044726 TO MAX-RANGE.
043000 F-ACOS-TEST-05.
043100     COMPUTE WS-NUM = FUNCTION ACOS(.999).
043200     IF (WS-NUM >= MIN-RANGE) AND
043300        (WS-NUM <= MAX-RANGE) THEN
043400                    PERFORM PASS
043500     ELSE
043600                    MOVE WS-NUM TO COMPUTED-N
043700                    MOVE MIN-RANGE TO CORRECT-MIN
043800                    MOVE MAX-RANGE TO CORRECT-MAX
043900                    PERFORM FAIL.
044000     GO TO F-ACOS-WRITE-05.
044100 F-ACOS-DELETE-05.
044200     PERFORM  DE-LETE.
044300     GO TO    F-ACOS-WRITE-05.
044400 F-ACOS-WRITE-05.
044500     MOVE "F-ACOS-05" TO PAR-NAME.
044600     PERFORM  PRINT-DETAIL.
044700*****************TEST (f) - SIMPLE TEST*****************
044800 F-ACOS-06.
044900     MOVE ZERO TO WS-NUM.
045000     MOVE  1.05868 TO MIN-RANGE.
045100     MOVE  1.05872 TO MAX-RANGE.
045200 F-ACOS-TEST-06.
045300     COMPUTE WS-NUM = FUNCTION ACOS(.49).
045400     IF (WS-NUM >= MIN-RANGE) AND
045500        (WS-NUM <= MAX-RANGE) THEN
045600                    PERFORM PASS
045700     ELSE
045800                    MOVE WS-NUM TO COMPUTED-N
045900                    MOVE MIN-RANGE TO CORRECT-MIN
046000                    MOVE MAX-RANGE TO CORRECT-MAX
046100                    PERFORM FAIL.
046200     GO TO F-ACOS-WRITE-06.
046300 F-ACOS-DELETE-06.
046400     PERFORM  DE-LETE.
046500     GO TO    F-ACOS-WRITE-06.
046600 F-ACOS-WRITE-06.
046700     MOVE "F-ACOS-06" TO PAR-NAME.
046800     PERFORM  PRINT-DETAIL.
046900*****************TEST (g) - SIMPLE TEST*****************
047000 F-ACOS-07.
047100     MOVE ZERO TO WS-NUM.
047200     MOVE  1.56976 TO MIN-RANGE.
047300     MOVE  1.56982 TO MAX-RANGE.
047400 F-ACOS-TEST-07.
047500     COMPUTE WS-NUM = FUNCTION ACOS(.001).
047600     IF (WS-NUM >= MIN-RANGE) AND
047700        (WS-NUM <= MAX-RANGE) THEN
047800                    PERFORM PASS
047900     ELSE
048000                    MOVE WS-NUM TO COMPUTED-N
048100                    MOVE MIN-RANGE TO CORRECT-MIN
048200                    MOVE MAX-RANGE TO CORRECT-MAX
048300                    PERFORM FAIL.
048400     GO TO F-ACOS-WRITE-07.
048500 F-ACOS-DELETE-07.
048600     PERFORM  DE-LETE.
048700     GO TO    F-ACOS-WRITE-07.
048800 F-ACOS-WRITE-07.
048900     MOVE "F-ACOS-07" TO PAR-NAME.
049000     PERFORM  PRINT-DETAIL.
049100*****************TEST (h) - SIMPLE TEST*****************
049200 F-ACOS-08.
049300     MOVE ZERO TO WS-NUM.
049400     MOVE  3.09680 TO MIN-RANGE.
049500     MOVE  3.09692 TO MAX-RANGE.
049600 F-ACOS-TEST-08.
049700     COMPUTE WS-NUM = FUNCTION ACOS(-.999).
049800     IF (WS-NUM >= MIN-RANGE) AND
049900        (WS-NUM <= MAX-RANGE) THEN
050000                    PERFORM PASS
050100     ELSE
050200                    MOVE WS-NUM TO COMPUTED-N
050300                    MOVE MIN-RANGE TO CORRECT-MIN
050400                    MOVE MAX-RANGE TO CORRECT-MAX
050500                    PERFORM FAIL.
050600     GO TO F-ACOS-WRITE-08.
050700 F-ACOS-DELETE-08.
050800     PERFORM  DE-LETE.
050900     GO TO    F-ACOS-WRITE-08.
051000 F-ACOS-WRITE-08.
051100     MOVE "F-ACOS-08" TO PAR-NAME.
051200     PERFORM  PRINT-DETAIL.
051300*****************TEST (i) - SIMPLE TEST*****************
051400 F-ACOS-09.
051500     MOVE ZERO TO WS-NUM.
051600     MOVE  1.57080 TO MIN-RANGE.
051700     MOVE  1.57086 TO MAX-RANGE.
051800 F-ACOS-TEST-09.
051900     COMPUTE WS-NUM = FUNCTION ACOS(A).
052000     IF (WS-NUM >= MIN-RANGE) AND
052100        (WS-NUM <= MAX-RANGE) THEN
052200                    PERFORM PASS
052300     ELSE
052400                    MOVE WS-NUM TO COMPUTED-N
052500                    MOVE MIN-RANGE TO CORRECT-MIN
052600                    MOVE MAX-RANGE TO CORRECT-MAX
052700                    PERFORM FAIL.
052800     GO TO F-ACOS-WRITE-09.
052900 F-ACOS-DELETE-09.
053000     PERFORM  DE-LETE.
053100     GO TO    F-ACOS-WRITE-09.
053200 F-ACOS-WRITE-09.
053300     MOVE "F-ACOS-09" TO PAR-NAME.
053400     PERFORM  PRINT-DETAIL.
053500*****************TEST (j) - SIMPLE TEST*****************
053600 F-ACOS-10.
053700     MOVE ZERO TO WS-NUM.
053800     MOVE  1.57074 TO MIN-RANGE.
053900     MOVE  1.57080 TO MAX-RANGE.
054000 F-ACOS-TEST-10.
054100     COMPUTE WS-NUM = FUNCTION ACOS(.00002).
054200     IF (WS-NUM >= MIN-RANGE) AND
054300        (WS-NUM <= MAX-RANGE) THEN
054400                    PERFORM PASS
054500     ELSE
054600                    MOVE WS-NUM TO COMPUTED-N
054700                    MOVE MIN-RANGE TO CORRECT-MIN
054800                    MOVE MAX-RANGE TO CORRECT-MAX
054900                    PERFORM FAIL.
055000     GO TO F-ACOS-WRITE-10.
055100 F-ACOS-DELETE-10.
055200     PERFORM  DE-LETE.
055300     GO TO    F-ACOS-WRITE-10.
055400 F-ACOS-WRITE-10.
055500     MOVE "F-ACOS-10" TO PAR-NAME.
055600     PERFORM  PRINT-DETAIL.
055700*****************TEST (a) - COMPLEX TEST****************
055800 F-ACOS-11.
055900     MOVE ZERO TO WS-NUM.
056000     MOVE  0.785367 TO MIN-RANGE.
056100     MOVE  0.785429 TO MAX-RANGE.
056200 F-ACOS-TEST-11.
056300     COMPUTE WS-NUM = FUNCTION ACOS(1 / SQRT2).
056400     IF (WS-NUM >= MIN-RANGE) AND
056500        (WS-NUM <= MAX-RANGE) THEN
056600                    PERFORM PASS
056700     ELSE
056800                    MOVE WS-NUM TO COMPUTED-N
056900                    MOVE MIN-RANGE TO CORRECT-MIN
057000                    MOVE MAX-RANGE TO CORRECT-MAX
057100                    PERFORM FAIL.
057200     GO TO F-ACOS-WRITE-11.
057300 F-ACOS-DELETE-11.
057400     PERFORM  DE-LETE.
057500     GO TO    F-ACOS-WRITE-11.
057600 F-ACOS-WRITE-11.
057700     MOVE "F-ACOS-11" TO PAR-NAME.
057800     PERFORM  PRINT-DETAIL.
057900*****************TEST (b) - COMPLEX TEST****************
058000 F-ACOS-12.
058100     MOVE ZERO TO WS-NUM.
058200     MOVE  0.523577  TO MIN-RANGE.
058300     MOVE  0.523619 TO MAX-RANGE.
058400 F-ACOS-TEST-12.
058500     COMPUTE WS-NUM = FUNCTION ACOS(SQRT3D2).
058600     IF (WS-NUM >= MIN-RANGE) AND
058700        (WS-NUM <= MAX-RANGE) THEN
058800                    PERFORM PASS
058900     ELSE
059000                    MOVE WS-NUM TO COMPUTED-N
059100                    MOVE MIN-RANGE TO CORRECT-MIN
059200                    MOVE MAX-RANGE TO CORRECT-MAX
059300                    PERFORM FAIL.
059400     GO TO F-ACOS-WRITE-12.
059500 F-ACOS-DELETE-12.
059600     PERFORM  DE-LETE.
059700     GO TO    F-ACOS-WRITE-12.
059800 F-ACOS-WRITE-12.
059900     MOVE "F-ACOS-12" TO PAR-NAME.
060000     PERFORM  PRINT-DETAIL.
060100*****************TEST (c) - COMPLEX TEST****************
060200 F-ACOS-13.
060300     MOVE ZERO TO WS-NUM.
060400     MOVE  1.58073 TO MIN-RANGE.
060500     MOVE  1.58085 TO MAX-RANGE.
060600 F-ACOS-TEST-13.
060700     COMPUTE WS-NUM = FUNCTION ACOS( 1 - 1.01).
060800     IF (WS-NUM >= MIN-RANGE) AND
060900        (WS-NUM <= MAX-RANGE) THEN
061000                    PERFORM PASS
061100     ELSE
061200                    MOVE WS-NUM TO COMPUTED-N
061300                    MOVE MIN-RANGE TO CORRECT-MIN
061400                    MOVE MAX-RANGE TO CORRECT-MAX
061500                    PERFORM FAIL.
061600     GO TO F-ACOS-WRITE-13.
061700 F-ACOS-DELETE-13.
061800     PERFORM  DE-LETE.
061900     GO TO    F-ACOS-WRITE-13.
062000 F-ACOS-WRITE-13.
062100     MOVE "F-ACOS-13" TO PAR-NAME.
062200     PERFORM  PRINT-DETAIL.
062300*****************TEST (d) - COMPLEX TEST****************
062400 F-ACOS-14.
062500     MOVE ZERO TO WS-NUM.
062600     MOVE  0.141533 TO MIN-RANGE.
062700     MOVE  0.141545 TO MAX-RANGE.
062800 F-ACOS-TEST-14.
062900     COMPUTE WS-NUM = FUNCTION ACOS(1.98 / 2).
063000     IF (WS-NUM >= MIN-RANGE) AND
063100        (WS-NUM <= MAX-RANGE) THEN
063200                    PERFORM PASS
063300     ELSE
063400                    MOVE WS-NUM TO COMPUTED-N
063500                    MOVE MIN-RANGE TO CORRECT-MIN
063600                    MOVE MAX-RANGE TO CORRECT-MAX
063700                    PERFORM FAIL.
063800     GO TO F-ACOS-WRITE-14.
063900 F-ACOS-DELETE-14.
064000     PERFORM  DE-LETE.
064100     GO TO    F-ACOS-WRITE-14.
064200 F-ACOS-WRITE-14.
064300     MOVE "F-ACOS-14" TO PAR-NAME.
064400     PERFORM  PRINT-DETAIL.
064500*****************TEST (e) - COMPLEX TEST****************
064600 F-ACOS-15.
064700     MOVE ZERO TO WS-NUM.
064800     MOVE  1.05866 TO MIN-RANGE.
064900     MOVE  1.05874 TO MAX-RANGE.
065000 F-ACOS-TEST-15.
065100     COMPUTE WS-NUM = FUNCTION ACOS(0.2 + 0.29).
065200     IF (WS-NUM >= MIN-RANGE) AND
065300        (WS-NUM <= MAX-RANGE) THEN
065400                    PERFORM PASS
065500     ELSE
065600                    MOVE WS-NUM TO COMPUTED-N
065700                    MOVE MIN-RANGE TO CORRECT-MIN
065800                    MOVE MAX-RANGE TO CORRECT-MAX
065900                    PERFORM FAIL.
066000     GO TO F-ACOS-WRITE-15.
066100 F-ACOS-DELETE-15.
066200     PERFORM  DE-LETE.
066300     GO TO    F-ACOS-WRITE-15.
066400 F-ACOS-WRITE-15.
066500     MOVE "F-ACOS-15" TO PAR-NAME.
066600     PERFORM  PRINT-DETAIL.
066700*****************TEST (f) - COMPLEX TEST****************
066800 F-ACOS-16.
066900     MOVE ZERO TO WS-NUM.
067000     MOVE  2.99993 TO MIN-RANGE.
067100     MOVE  3.00017 TO MAX-RANGE.
067200 F-ACOS-TEST-16.
067300     COMPUTE WS-NUM = FUNCTION ACOS(0.99 * -1).
067400     IF (WS-NUM >= MIN-RANGE) AND
067500        (WS-NUM <= MAX-RANGE) THEN
067600                    PERFORM PASS
067700     ELSE
067800                    MOVE WS-NUM TO COMPUTED-N
067900                    MOVE MIN-RANGE TO CORRECT-MIN
068000                    MOVE MAX-RANGE TO CORRECT-MAX
068100                    PERFORM FAIL.
068200     GO TO F-ACOS-WRITE-16.
068300 F-ACOS-DELETE-16.
068400     PERFORM  DE-LETE.
068500     GO TO    F-ACOS-WRITE-16.
068600 F-ACOS-WRITE-16.
068700     MOVE "F-ACOS-16" TO PAR-NAME.
068800     PERFORM  PRINT-DETAIL.
068900*****************TEST (g) - COMPLEX TEST****************
069000 F-ACOS-17.
069100     MOVE ZERO TO WS-NUM.
069200     MOVE  -0.000040 TO MIN-RANGE.
069300     MOVE  0.00004 TO MAX-RANGE.
069400 F-ACOS-TEST-17.
069500     COMPUTE WS-NUM = FUNCTION ACOS(IND (B) - 2).
069600     IF (WS-NUM >= MIN-RANGE) AND
069700        (WS-NUM <= MAX-RANGE) THEN
069800                    PERFORM PASS
069900     ELSE
070000                    MOVE WS-NUM TO COMPUTED-N
070100                    MOVE MIN-RANGE TO CORRECT-MIN
070200                    MOVE MAX-RANGE TO CORRECT-MAX
070300                    PERFORM FAIL.
070400     GO TO F-ACOS-WRITE-17.
070500 F-ACOS-DELETE-17.
070600     PERFORM  DE-LETE.
070700     GO TO    F-ACOS-WRITE-17.
070800 F-ACOS-WRITE-17.
070900     MOVE "F-ACOS-17" TO PAR-NAME.
071000     PERFORM  PRINT-DETAIL.
071100*****************TEST (h) - COMPLEX TEST****************
071200 F-ACOS-18.
071300     MOVE ZERO TO WS-NUM.
071400     MOVE  0.679646 TO MIN-RANGE.
071500     MOVE  0.679700 TO MAX-RANGE.
071600 F-ACOS-TEST-18.
071700     COMPUTE WS-NUM = FUNCTION ACOS(IND(5) / 9).
071800     IF (WS-NUM >= MIN-RANGE) AND
071900        (WS-NUM <= MAX-RANGE) THEN
072000                    PERFORM PASS
072100     ELSE
072200                    MOVE WS-NUM TO COMPUTED-N
072300                    MOVE MIN-RANGE TO CORRECT-MIN
072400                    MOVE MAX-RANGE TO CORRECT-MAX
072500                    PERFORM FAIL.
072600     GO TO F-ACOS-WRITE-18.
072700 F-ACOS-DELETE-18.
072800     PERFORM  DE-LETE.
072900     GO TO    F-ACOS-WRITE-18.
073000 F-ACOS-WRITE-18.
073100     MOVE "F-ACOS-18" TO PAR-NAME.
073200     PERFORM  PRINT-DETAIL.
073300*****************TEST (i) - COMPLEX TEST****************
073400 F-ACOS-19.
073500     MOVE ZERO TO WS-NUM.
073600     MOVE  0.000000 TO MIN-RANGE.
073700     MOVE  0.000040 TO MAX-RANGE.
073800 F-ACOS-TEST-19.
073900     COMPUTE WS-NUM = FUNCTION ACOS(4 - 3).
074000     IF (WS-NUM >= MIN-RANGE) AND
074100        (WS-NUM <= MAX-RANGE) THEN
074200                    PERFORM PASS
074300     ELSE
074400                    MOVE WS-NUM TO COMPUTED-N
074500                    MOVE MIN-RANGE TO CORRECT-MIN
074600                    MOVE MAX-RANGE TO CORRECT-MAX
074700                    PERFORM FAIL.
074800     GO TO F-ACOS-WRITE-19.
074900 F-ACOS-DELETE-19.
075000     PERFORM  DE-LETE.
075100     GO TO    F-ACOS-WRITE-19.
075200 F-ACOS-WRITE-19.
075300     MOVE "F-ACOS-19" TO PAR-NAME.
075400     PERFORM  PRINT-DETAIL.
075500*****************TEST (j) - COMPLEX TEST****************
075600 F-ACOS-20.
075700     MOVE ZERO TO WS-NUM.
075800     MOVE  0.000000 TO MIN-RANGE.
075900     MOVE  0.000004 TO MAX-RANGE.
076000 F-ACOS-TEST-20.
076100     COMPUTE WS-NUM = FUNCTION ACOS(C / C).
076200     IF (WS-NUM >= MIN-RANGE) AND
076300        (WS-NUM <= MAX-RANGE) THEN
076400                    PERFORM PASS
076500     ELSE
076600                    MOVE WS-NUM TO COMPUTED-N
076700                    MOVE MIN-RANGE TO CORRECT-MIN
076800                    MOVE MAX-RANGE TO CORRECT-MAX
076900                    PERFORM FAIL.
077000     GO TO F-ACOS-WRITE-20.
077100 F-ACOS-DELETE-20.
077200     PERFORM  DE-LETE.
077300     GO TO    F-ACOS-WRITE-20.
077400 F-ACOS-WRITE-20.
077500     MOVE "F-ACOS-20" TO PAR-NAME.
077600     PERFORM  PRINT-DETAIL.
077700*****************TEST (k) - COMPLEX TEST****************
077800 F-ACOS-21.
077900     MOVE ZERO TO WS-NUM.
078000     MOVE  1.31806 TO MIN-RANGE.
078100     MOVE  1.31816 TO MAX-RANGE.
078200 F-ACOS-TEST-21.
078300     COMPUTE WS-NUM = FUNCTION ACOS(0.25 * 1).
078400     IF (WS-NUM >= MIN-RANGE) AND
078500        (WS-NUM <= MAX-RANGE) THEN
078600                    PERFORM PASS
078700     ELSE
078800                    MOVE WS-NUM TO COMPUTED-N
078900                    MOVE MIN-RANGE TO CORRECT-MIN
079000                    MOVE MAX-RANGE TO CORRECT-MAX
079100                    PERFORM FAIL.
079200     GO TO F-ACOS-WRITE-21.
079300 F-ACOS-DELETE-21.
079400     PERFORM  DE-LETE.
079500     GO TO    F-ACOS-WRITE-21.
079600 F-ACOS-WRITE-21.
079700     MOVE "F-ACOS-21" TO PAR-NAME.
079800     PERFORM  PRINT-DETAIL.
079900*****************TEST (l) - COMPLEX TEST****************
080000 F-ACOS-22.
080100     MOVE ZERO TO WS-NUM.
080200     MOVE  1.57073 TO MIN-RANGE.
080300     MOVE  1.57085 TO MAX-RANGE.
080400 F-ACOS-TEST-22.
080500     COMPUTE WS-NUM = FUNCTION ACOS((D / D) - 1).
080600     IF (WS-NUM >= MIN-RANGE) AND
080700        (WS-NUM <= MAX-RANGE) THEN
080800                    PERFORM PASS
080900     ELSE
081000                    MOVE WS-NUM TO COMPUTED-N
081100                    MOVE MIN-RANGE TO CORRECT-MIN
081200                    MOVE MAX-RANGE TO CORRECT-MAX
081300                    PERFORM FAIL.
081400     GO TO F-ACOS-WRITE-22.
081500 F-ACOS-DELETE-22.
081600     PERFORM  DE-LETE.
081700     GO TO    F-ACOS-WRITE-22.
081800 F-ACOS-WRITE-22.
081900     MOVE "F-ACOS-22" TO PAR-NAME.
082000     PERFORM  PRINT-DETAIL.
082100*****************TEST (m) - COMPLEX TEST****************
082200 F-ACOS-23.
082300     MOVE ZERO TO WS-NUM.
082400     MOVE  2.60285  TO MIN-RANGE.
082500     MOVE  2.60305 TO MAX-RANGE.
082600 F-ACOS-TEST-23.
082700     COMPUTE WS-NUM = FUNCTION ACOS(PI - 4).
082800     IF (WS-NUM >= MIN-RANGE) AND
082900        (WS-NUM <= MAX-RANGE) THEN
083000                    PERFORM PASS
083100     ELSE
083200                    MOVE WS-NUM TO COMPUTED-N
083300                    MOVE MIN-RANGE TO CORRECT-MIN
083400                    MOVE MAX-RANGE TO CORRECT-MAX
083500                    PERFORM FAIL.
083600     GO TO F-ACOS-WRITE-23.
083700 F-ACOS-DELETE-23.
083800     PERFORM  DE-LETE.
083900     GO TO    F-ACOS-WRITE-23.
084000 F-ACOS-WRITE-23.
084100     MOVE "F-ACOS-23" TO PAR-NAME.
084200     PERFORM  PRINT-DETAIL.
084300*****************TEST (n) - COMPLEX TEST****************
084400 F-ACOS-24.
084500     MOVE ZERO TO WS-NUM.
084600     MOVE 1.57073 TO MIN-RANGE.
084700     MOVE 1.57085 TO MAX-RANGE.
084800 F-ACOS-TEST-24.
084900     COMPUTE WS-NUM = FUNCTION ACOS(FUNCTION ACOS(D / D)).
085000     IF (WS-NUM >= MIN-RANGE) AND
085100        (WS-NUM <= MAX-RANGE) THEN
085200                    PERFORM PASS
085300     ELSE
085400                    MOVE WS-NUM TO COMPUTED-N
085500                    MOVE MIN-RANGE TO CORRECT-MIN
085600                    MOVE MAX-RANGE TO CORRECT-MAX
085700                    PERFORM FAIL.
085800     GO TO F-ACOS-WRITE-24.
085900 F-ACOS-DELETE-24.
086000     PERFORM  DE-LETE.
086100     GO TO    F-ACOS-WRITE-24.
086200 F-ACOS-WRITE-24.
086300     MOVE "F-ACOS-24" TO PAR-NAME.
086400     PERFORM  PRINT-DETAIL.
086500*****************TEST (o) - COMPLEX TEST****************
086600 F-ACOS-25.
086700     MOVE ZERO TO WS-NUM.
086800     MOVE 0.000000 TO MIN-RANGE.
086900     MOVE 0.000040 TO MAX-RANGE.
087000 F-ACOS-TEST-25.
087100     COMPUTE WS-NUM = FUNCTION ACOS(D / D) + FUNCTION ACOS(D / D).
087200
087300     IF (WS-NUM >= MIN-RANGE) AND
087400        (WS-NUM <= MAX-RANGE) THEN
087500                    PERFORM PASS
087600     ELSE
087700                    MOVE WS-NUM TO COMPUTED-N
087800                    MOVE MIN-RANGE TO CORRECT-MIN
087900                    MOVE MAX-RANGE TO CORRECT-MAX
088000                    PERFORM FAIL.
088100     GO TO F-ACOS-WRITE-25.
088200 F-ACOS-DELETE-25.
088300     PERFORM  DE-LETE.
088400     GO TO    F-ACOS-WRITE-25.
088500 F-ACOS-WRITE-25.
088600     MOVE "F-ACOS-25" TO PAR-NAME.
088700     PERFORM  PRINT-DETAIL.
088800*****************SPECIAL PERFORM TEST**********************
088900 F-ACOS-26.
089000     MOVE ZERO TO ARG1.
089100     PERFORM F-ACOS-TEST-26
089200       UNTIL FUNCTION ACOS(ARG1) < 1.
089300     PERFORM PASS.
089400     GO TO F-ACOS-WRITE-26.
089500 F-ACOS-TEST-26.
089600     COMPUTE ARG1 = ARG1 + 0.25.
089700 F-ACOS-DELETE-26.
089800     PERFORM  DE-LETE.
089900     GO TO    F-ACOS-WRITE-26.
090000 F-ACOS-WRITE-26.
090100     MOVE "F-ACOS-26" TO PAR-NAME.
090200     PERFORM  PRINT-DETAIL.
090300********************END OF TESTS***************
090400 CCVS-EXIT SECTION.
090500 CCVS-999999.
090600     GO TO CLOSE-FILES.
