000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF114A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function            *
000900* INTEGER-PART.                                           *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT PRINT-FILE ASSIGN TO
002100     XXXXX055.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  PRINT-FILE.
002500 01  PRINT-REC PICTURE X(120).
002600 01  DUMMY-RECORD PICTURE X(120).
002700 WORKING-STORAGE SECTION.
002800***********************************************************
002900* Variables specific to the Intrinsic Function Test IF114A*
003000***********************************************************
003100 01  A                   PIC S9(10)          VALUE 500000.
003200 01  B                   PIC S9(10)          VALUE 1.
003300 01  E                   PIC S9(6)V9(5)      VALUE 399999.122.
003400 01  F                   PIC S9(5)V9(5)      VALUE 0.00032.
003500 01  G                   PIC S9(5)V9(5)      VALUE 4.08.
003600 01  H                   PIC S9(5)V9(5)      VALUE -5.
003700 01  I                   PIC S9(5)V9(5)      VALUE 3.4.
003800 01  ARG1                PIC S9(5)V9(5)      VALUE 4.4.
003900 01  ARR                                     VALUE "40537".
004000     02  IND OCCURS 5 TIMES PIC 9.
004100 01  TEMP                PIC S9(5)V9(5).
004200 01  WS-INT              PIC S9(10).
004300*
004400**********************************************************
004500*
004600 01  TEST-RESULTS.
004700     02 FILLER                   PIC X      VALUE SPACE.
004800     02 FEATURE                  PIC X(20)  VALUE SPACE.
004900     02 FILLER                   PIC X      VALUE SPACE.
005000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005100     02 FILLER                   PIC X      VALUE SPACE.
005200     02  PAR-NAME.
005300       03 FILLER                 PIC X(19)  VALUE SPACE.
005400       03  PARDOT-X              PIC X      VALUE SPACE.
005500       03 DOTVALUE               PIC 99     VALUE ZERO.
005600     02 FILLER                   PIC X(8)   VALUE SPACE.
005700     02 RE-MARK                  PIC X(61).
005800 01  TEST-COMPUTED.
005900     02 FILLER                   PIC X(30)  VALUE SPACE.
006000     02 FILLER                   PIC X(17)  VALUE
006100            "       COMPUTED=".
006200     02 COMPUTED-X.
006300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006400     03 COMPUTED-N               REDEFINES COMPUTED-A
006500                                 PIC -9(9).9(9).
006600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
006800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
006900     03       CM-18V0 REDEFINES COMPUTED-A.
007000         04 COMPUTED-18V0                    PIC -9(18).
007100         04 FILLER                           PIC X.
007200     03 FILLER PIC X(50) VALUE SPACE.
007300 01  TEST-CORRECT.
007400     02 FILLER PIC X(30) VALUE SPACE.
007500     02 FILLER PIC X(17) VALUE "       CORRECT =".
007600     02 CORRECT-X.
007700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
007800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
007900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008200     03      CR-18V0 REDEFINES CORRECT-A.
008300         04 CORRECT-18V0                     PIC -9(18).
008400         04 FILLER                           PIC X.
008500     03 FILLER PIC X(2) VALUE SPACE.
008600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008700 01  CCVS-C-1.
008800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
008900-    "SS  PARAGRAPH-NAME
009000-    "       REMARKS".
009100     02 FILLER                     PIC X(20)    VALUE SPACE.
009200 01  CCVS-C-2.
009300     02 FILLER                     PIC X        VALUE SPACE.
009400     02 FILLER                     PIC X(6)     VALUE "TESTED".
009500     02 FILLER                     PIC X(15)    VALUE SPACE.
009600     02 FILLER                     PIC X(4)     VALUE "FAIL".
009700     02 FILLER                     PIC X(94)    VALUE SPACE.
009800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
009900 01  REC-CT                        PIC 99       VALUE ZERO.
010000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
010100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
010200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
010300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
010400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
010500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
010600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
010700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
010800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
010900 01  CCVS-H-1.
011000     02  FILLER                    PIC X(39)    VALUE SPACES.
011100     02  FILLER                    PIC X(42)    VALUE
011200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
011300     02  FILLER                    PIC X(39)    VALUE SPACES.
011400 01  CCVS-H-2A.
011500   02  FILLER                        PIC X(40)  VALUE SPACE.
011600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
011700   02  FILLER                        PIC XXXX   VALUE
011800     "4.2 ".
011900   02  FILLER                        PIC X(28)  VALUE
012000            " COPY - NOT FOR DISTRIBUTION".
012100   02  FILLER                        PIC X(41)  VALUE SPACE.
012200
012300 01  CCVS-H-2B.
012400   02  FILLER                        PIC X(15)  VALUE
012500            "TEST RESULT OF ".
012600   02  TEST-ID                       PIC X(9).
012700   02  FILLER                        PIC X(4)   VALUE
012800            " IN ".
012900   02  FILLER                        PIC X(12)  VALUE
013000     " HIGH       ".
013100   02  FILLER                        PIC X(22)  VALUE
013200            " LEVEL VALIDATION FOR ".
013300   02  FILLER                        PIC X(58)  VALUE
013400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
013500 01  CCVS-H-3.
013600     02  FILLER                      PIC X(34)  VALUE
013700            " FOR OFFICIAL USE ONLY    ".
013800     02  FILLER                      PIC X(58)  VALUE
013900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
014000     02  FILLER                      PIC X(28)  VALUE
014100            "  COPYRIGHT   1985 ".
014200 01  CCVS-E-1.
014300     02 FILLER                       PIC X(52)  VALUE SPACE.
014400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
014500     02 ID-AGAIN                     PIC X(9).
014600     02 FILLER                       PIC X(45)  VALUE SPACES.
014700 01  CCVS-E-2.
014800     02  FILLER                      PIC X(31)  VALUE SPACE.
014900     02  FILLER                      PIC X(21)  VALUE SPACE.
015000     02 CCVS-E-2-2.
015100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
015200         03 FILLER                   PIC X      VALUE SPACE.
015300         03 ENDER-DESC               PIC X(44)  VALUE
015400            "ERRORS ENCOUNTERED".
015500 01  CCVS-E-3.
015600     02  FILLER                      PIC X(22)  VALUE
015700            " FOR OFFICIAL USE ONLY".
015800     02  FILLER                      PIC X(12)  VALUE SPACE.
015900     02  FILLER                      PIC X(58)  VALUE
016000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016100     02  FILLER                      PIC X(13)  VALUE SPACE.
016200     02 FILLER                       PIC X(15)  VALUE
016300             " COPYRIGHT 1985".
016400 01  CCVS-E-4.
016500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
016600     02 FILLER                       PIC X(4)   VALUE " OF ".
016700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
016800     02 FILLER                       PIC X(40)  VALUE
016900      "  TESTS WERE EXECUTED SUCCESSFULLY".
017000 01  XXINFO.
017100     02 FILLER                       PIC X(19)  VALUE
017200            "*** INFORMATION ***".
017300     02 INFO-TEXT.
017400       04 FILLER                     PIC X(8)   VALUE SPACE.
017500       04 XXCOMPUTED                 PIC X(20).
017600       04 FILLER                     PIC X(5)   VALUE SPACE.
017700       04 XXCORRECT                  PIC X(20).
017800     02 INF-ANSI-REFERENCE           PIC X(48).
017900 01  HYPHEN-LINE.
018000     02 FILLER  PIC IS X VALUE IS SPACE.
018100     02 FILLER  PIC IS X(65)    VALUE IS "************************
018200-    "*****************************************".
018300     02 FILLER  PIC IS X(54)    VALUE IS "************************
018400-    "******************************".
018500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
018600     "IF114A".
018700 PROCEDURE DIVISION.
018800 CCVS1 SECTION.
018900 OPEN-FILES.
019000     OPEN     OUTPUT PRINT-FILE.
019100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
019200     MOVE    SPACE TO TEST-RESULTS.
019300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
019400     GO TO CCVS1-EXIT.
019500 CLOSE-FILES.
019600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
019700 TERMINATE-CCVS.
019800     STOP     RUN.
019900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
020000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
020100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
020200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
020300     MOVE "****TEST DELETED****" TO RE-MARK.
020400 PRINT-DETAIL.
020500     IF REC-CT NOT EQUAL TO ZERO
020600             MOVE "." TO PARDOT-X
020700             MOVE REC-CT TO DOTVALUE.
020800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
020900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
021000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
021100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
021200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
021300     MOVE SPACE TO CORRECT-X.
021400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
021500     MOVE     SPACE TO RE-MARK.
021600 HEAD-ROUTINE.
021700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022100 COLUMN-NAMES-ROUTINE.
022200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
022300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
022500 END-ROUTINE.
022600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
022700 END-RTN-EXIT.
022800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022900 END-ROUTINE-1.
023000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
023100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
023200      ADD PASS-COUNTER TO ERROR-HOLD.
023300      MOVE PASS-COUNTER TO CCVS-E-4-1.
023400      MOVE ERROR-HOLD TO CCVS-E-4-2.
023500      MOVE CCVS-E-4 TO CCVS-E-2-2.
023600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
023700  END-ROUTINE-12.
023800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
023900     IF       ERROR-COUNTER IS EQUAL TO ZERO
024000         MOVE "NO " TO ERROR-TOTAL
024100         ELSE
024200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
024300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
024400     PERFORM WRITE-LINE.
024500 END-ROUTINE-13.
024600     IF DELETE-COUNTER IS EQUAL TO ZERO
024700         MOVE "NO " TO ERROR-TOTAL  ELSE
024800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
024900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
025000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025100      IF   INSPECT-COUNTER EQUAL TO ZERO
025200          MOVE "NO " TO ERROR-TOTAL
025300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
025400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
025500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025700 WRITE-LINE.
025800     ADD 1 TO RECORD-COUNT.
025900Y    IF RECORD-COUNT GREATER 42
026000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
026100Y        MOVE SPACE TO DUMMY-RECORD
026200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
026300Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
026400Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
026500Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
026600Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
026700Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
026800Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
026900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
027000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
027100Y        MOVE ZERO TO RECORD-COUNT.
027200     PERFORM WRT-LN.
027300 WRT-LN.
027400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
027500     MOVE SPACE TO DUMMY-RECORD.
027600 BLANK-LINE-PRINT.
027700     PERFORM WRT-LN.
027800 FAIL-ROUTINE.
027900     IF     COMPUTED-X NOT EQUAL TO SPACE
028000            GO TO FAIL-ROUTINE-WRITE.
028100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
028200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
028300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
028400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028500     MOVE   SPACES TO INF-ANSI-REFERENCE.
028600     GO TO  FAIL-ROUTINE-EX.
028700 FAIL-ROUTINE-WRITE.
028800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
028900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
029000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
029100     MOVE   SPACES TO COR-ANSI-REFERENCE.
029200 FAIL-ROUTINE-EX. EXIT.
029300 BAIL-OUT.
029400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
029500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
029600 BAIL-OUT-WRITE.
029700     MOVE CORRECT-A TO XXCORRECT.
029800     MOVE COMPUTED-A TO XXCOMPUTED.
029900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030100     MOVE   SPACES TO INF-ANSI-REFERENCE.
030200 BAIL-OUT-EX. EXIT.
030300 CCVS1-EXIT.
030400     EXIT.
030500********************************************************
030600*                                                      *
030700*    Intrinsic Function Tests    IF114A - INTEGER-PART *
030800*                                                      *
030900********************************************************
031000 SECT-IF114A SECTION.
031100 F-INTPART-INFO.
031200     MOVE     "See ref. A-47 2.18" TO ANSI-REFERENCE.
031300     MOVE     "INTEGER-PART Function"     TO FEATURE.
031400*****************TEST (a) ******************************
031500 F-INTPART-01.
031600     MOVE ZERO TO WS-INT.
031700 F-INTPART-TEST-01.
031800     COMPUTE WS-INT = FUNCTION INTEGER-PART(0).
031900     IF WS-INT = 0 THEN
032000                    PERFORM PASS
032100     ELSE
032200                    MOVE  0  TO CORRECT-N
032300                    MOVE WS-INT TO COMPUTED-N
032400                    PERFORM FAIL.
032500     GO TO F-INTPART-WRITE-01.
032600 F-INTPART-DELETE-01.
032700     PERFORM  DE-LETE.
032800     GO TO    F-INTPART-WRITE-01.
032900 F-INTPART-WRITE-01.
033000     MOVE "F-INTPART-01" TO PAR-NAME.
033100     PERFORM  PRINT-DETAIL.
033200*****************TEST (b) ******************************
033300 F-INTPART-02.
033400     MOVE ZERO TO WS-INT.
033500 F-INTPART-TEST-02.
033600     EVALUATE FUNCTION INTEGER-PART(3)
033700     WHEN 3
033800        PERFORM PASS
033900        GO TO F-INTPART-WRITE-02.
034000     PERFORM FAIL.
034100     GO TO F-INTPART-WRITE-02.
034200 F-INTPART-DELETE-02.
034300     PERFORM  DE-LETE.
034400     GO TO    F-INTPART-WRITE-02.
034500 F-INTPART-WRITE-02.
034600     MOVE "F-INTPART-02" TO PAR-NAME.
034700     PERFORM  PRINT-DETAIL.
034800*****************TEST (c) ******************************
034900 F-INTPART-03.
035000     MOVE ZERO TO WS-INT.
035100 F-INTPART-TEST-03.
035200     IF FUNCTION INTEGER-PART(4.578) = 4 THEN
035300                    PERFORM PASS
035400     ELSE
035500                    MOVE  4  TO CORRECT-N
035600                    PERFORM FAIL.
035700     GO TO F-INTPART-WRITE-03.
035800 F-INTPART-DELETE-03.
035900     PERFORM  DE-LETE.
036000     GO TO    F-INTPART-WRITE-03.
036100 F-INTPART-WRITE-03.
036200     MOVE "F-INTPART-03" TO PAR-NAME.
036300     PERFORM  PRINT-DETAIL.
036400*****************TEST (d) ******************************
036500 F-INTPART-04.
036600     MOVE ZERO TO WS-INT.
036700 F-INTPART-TEST-04.
036800     COMPUTE WS-INT = FUNCTION INTEGER-PART(-58).
036900     IF WS-INT = -58 THEN
037000                    PERFORM PASS
037100     ELSE
037200                    MOVE  -58  TO CORRECT-N
037300                    MOVE WS-INT TO COMPUTED-N
037400                    PERFORM FAIL.
037500     GO TO F-INTPART-WRITE-04.
037600 F-INTPART-DELETE-04.
037700     PERFORM  DE-LETE.
037800     GO TO    F-INTPART-WRITE-04.
037900 F-INTPART-WRITE-04.
038000     MOVE "F-INTPART-04" TO PAR-NAME.
038100     PERFORM  PRINT-DETAIL.
038200*****************TEST (e) ******************************
038300 F-INTPART-05.
038400     MOVE ZERO TO WS-INT.
038500 F-INTPART-TEST-05.
038600     COMPUTE WS-INT = FUNCTION INTEGER-PART(-9.763).
038700     IF WS-INT = -9  THEN
038800                    PERFORM PASS
038900     ELSE
039000                    MOVE -9 TO CORRECT-N
039100                    MOVE WS-INT TO COMPUTED-N
039200                    PERFORM FAIL.
039300     GO TO F-INTPART-WRITE-05.
039400 F-INTPART-DELETE-05.
039500     PERFORM  DE-LETE.
039600     GO TO    F-INTPART-WRITE-05.
039700 F-INTPART-WRITE-05.
039800     MOVE "F-INTPART-05" TO PAR-NAME.
039900     PERFORM  PRINT-DETAIL.
040000*****************TEST (f) ******************************
040100 F-INTPART-06.
040200     MOVE ZERO TO WS-INT.
040300 F-INTPART-TEST-06.
040400     COMPUTE WS-INT = FUNCTION INTEGER-PART(320485).
040500     IF WS-INT = 320485 THEN
040600                    PERFORM PASS
040700     ELSE
040800                    MOVE  320485  TO CORRECT-N
040900                    MOVE WS-INT TO COMPUTED-N
041000                    PERFORM FAIL.
041100     GO TO F-INTPART-WRITE-06.
041200 F-INTPART-DELETE-06.
041300     PERFORM  DE-LETE.
041400     GO TO    F-INTPART-WRITE-06.
041500 F-INTPART-WRITE-06.
041600     MOVE "F-INTPART-06" TO PAR-NAME.
041700     PERFORM  PRINT-DETAIL.
041800*****************TEST (g) ******************************
041900 F-INTPART-07.
042000     MOVE ZERO TO WS-INT.
042100 F-INTPART-TEST-07.
042200     COMPUTE WS-INT = FUNCTION INTEGER-PART(230492.4828).
042300     IF WS-INT = 230492 THEN
042400                    PERFORM PASS
042500     ELSE
042600                    MOVE  230492  TO CORRECT-N
042700                    MOVE WS-INT TO COMPUTED-N
042800                    PERFORM FAIL.
042900     GO TO F-INTPART-WRITE-07.
043000 F-INTPART-DELETE-07.
043100     PERFORM  DE-LETE.
043200     GO TO    F-INTPART-WRITE-07.
043300 F-INTPART-WRITE-07.
043400     MOVE "F-INTPART-07" TO PAR-NAME.
043500     PERFORM  PRINT-DETAIL.
043600*****************TEST (h) ******************************
043700 F-INTPART-08.
043800     MOVE ZERO TO WS-INT.
043900 F-INTPART-TEST-08.
044000     COMPUTE WS-INT = FUNCTION INTEGER-PART(0.00032).
044100     IF WS-INT = 0 THEN
044200                    PERFORM PASS
044300     ELSE
044400                    MOVE  0  TO CORRECT-N
044500                    MOVE WS-INT TO COMPUTED-N
044600                    PERFORM FAIL.
044700     GO TO F-INTPART-WRITE-08.
044800 F-INTPART-DELETE-08.
044900     PERFORM  DE-LETE.
045000     GO TO    F-INTPART-WRITE-08.
045100 F-INTPART-WRITE-08.
045200     MOVE "F-INTPART-08" TO PAR-NAME.
045300     PERFORM  PRINT-DETAIL.
045400*****************TEST (i) ******************************
045500 F-INTPART-09.
045600     MOVE ZERO TO WS-INT.
045700 F-INTPART-TEST-09.
045800     COMPUTE WS-INT = FUNCTION INTEGER-PART(A).
045900     IF WS-INT = 500000 THEN
046000                    PERFORM PASS
046100     ELSE
046200                    MOVE  500000  TO CORRECT-N
046300                    MOVE WS-INT TO COMPUTED-N
046400                    PERFORM FAIL.
046500     GO TO F-INTPART-WRITE-09.
046600 F-INTPART-DELETE-09.
046700     PERFORM  DE-LETE.
046800     GO TO    F-INTPART-WRITE-09.
046900 F-INTPART-WRITE-09.
047000     MOVE "F-INTPART-09" TO PAR-NAME.
047100     PERFORM  PRINT-DETAIL.
047200*****************TEST (j) ******************************
047300 F-INTPART-10.
047400     MOVE ZERO TO WS-INT.
047500 F-INTPART-TEST-10.
047600     COMPUTE WS-INT = FUNCTION INTEGER-PART(E).
047700     IF WS-INT = 399999 THEN
047800                    PERFORM PASS
047900     ELSE
048000                    MOVE  399999  TO CORRECT-N
048100                    MOVE WS-INT TO COMPUTED-N
048200                    PERFORM FAIL.
048300     GO TO F-INTPART-WRITE-10.
048400 F-INTPART-DELETE-10.
048500     PERFORM  DE-LETE.
048600     GO TO    F-INTPART-WRITE-10.
048700 F-INTPART-WRITE-10.
048800     MOVE "F-INTPART-10" TO PAR-NAME.
048900     PERFORM  PRINT-DETAIL.
049000*****************TEST (k) ******************************
049100 F-INTPART-11.
049200     MOVE ZERO TO WS-INT.
049300 F-INTPART-TEST-11.
049400     COMPUTE WS-INT = FUNCTION INTEGER-PART(B).
049500     IF WS-INT = 1 THEN
049600                    PERFORM PASS
049700     ELSE
049800                    MOVE  1  TO CORRECT-N
049900                    MOVE WS-INT TO COMPUTED-N
050000                    PERFORM FAIL.
050100     GO TO F-INTPART-WRITE-11.
050200 F-INTPART-DELETE-11.
050300     PERFORM  DE-LETE.
050400     GO TO    F-INTPART-WRITE-11.
050500 F-INTPART-WRITE-11.
050600     MOVE "F-INTPART-11" TO PAR-NAME.
050700     PERFORM  PRINT-DETAIL.
050800*****************TEST (l) ******************************
050900 F-INTPART-12.
051000     MOVE ZERO TO WS-INT.
051100 F-INTPART-TEST-12.
051200     COMPUTE WS-INT = FUNCTION INTEGER-PART(F).
051300     IF WS-INT = 0 THEN
051400                    PERFORM PASS
051500     ELSE
051600                    MOVE  0  TO CORRECT-N
051700                    MOVE WS-INT TO COMPUTED-N
051800                    PERFORM FAIL.
051900     GO TO F-INTPART-WRITE-12.
052000 F-INTPART-DELETE-12.
052100     PERFORM  DE-LETE.
052200     GO TO    F-INTPART-WRITE-12.
052300 F-INTPART-WRITE-12.
052400     MOVE "F-INTPART-12" TO PAR-NAME.
052500     PERFORM  PRINT-DETAIL.
052600*****************TEST (m) ******************************
052700 F-INTPART-13.
052800     MOVE ZERO TO WS-INT.
052900 F-INTPART-TEST-13.
053000     COMPUTE WS-INT = FUNCTION INTEGER-PART(IND(1)).
053100     IF WS-INT = 4 THEN
053200                    PERFORM PASS
053300     ELSE
053400                    MOVE 4 TO CORRECT-N
053500                    MOVE WS-INT TO COMPUTED-N
053600                    PERFORM FAIL.
053700     GO TO F-INTPART-WRITE-13.
053800 F-INTPART-DELETE-13.
053900     PERFORM  DE-LETE.
054000     GO TO    F-INTPART-WRITE-13.
054100 F-INTPART-WRITE-13.
054200     MOVE "F-INTPART-13" TO PAR-NAME.
054300     PERFORM  PRINT-DETAIL.
054400*****************TEST (n) ******************************
054500 F-INTPART-14.
054600     MOVE ZERO TO WS-INT.
054700 F-INTPART-TEST-14.
054800     COMPUTE WS-INT = FUNCTION INTEGER-PART(IND(B)).
054900     IF WS-INT = 4 THEN
055000                    PERFORM PASS
055100     ELSE
055200                    MOVE  4  TO CORRECT-N
055300                    MOVE WS-INT TO COMPUTED-N
055400                    PERFORM FAIL.
055500     GO TO F-INTPART-WRITE-14.
055600 F-INTPART-DELETE-14.
055700     PERFORM  DE-LETE.
055800     GO TO    F-INTPART-WRITE-14.
055900 F-INTPART-WRITE-14.
056000     MOVE "F-INTPART-14" TO PAR-NAME.
056100     PERFORM  PRINT-DETAIL.
056200*****************TEST (o) ******************************
056300 F-INTPART-15.
056400     MOVE ZERO TO WS-INT.
056500 F-INTPART-TEST-15.
056600     COMPUTE WS-INT = FUNCTION INTEGER-PART((6 / 3) + 9).
056700     IF WS-INT = 11 THEN
056800                    PERFORM PASS
056900     ELSE
057000                    MOVE  11  TO CORRECT-N
057100                    MOVE WS-INT TO COMPUTED-N
057200                    PERFORM FAIL.
057300     GO TO F-INTPART-WRITE-15.
057400 F-INTPART-DELETE-15.
057500     PERFORM  DE-LETE.
057600     GO TO    F-INTPART-WRITE-15.
057700 F-INTPART-WRITE-15.
057800     MOVE "F-INTPART-15" TO PAR-NAME.
057900     PERFORM  PRINT-DETAIL.
058000*****************TEST (p) ******************************
058100 F-INTPART-16.
058200     MOVE ZERO TO WS-INT.
058300 F-INTPART-TEST-16.
058400     COMPUTE WS-INT = FUNCTION INTEGER-PART(H + B).
058500     IF WS-INT = -4 THEN
058600                    PERFORM PASS
058700     ELSE
058800                    MOVE  -4  TO CORRECT-N
058900                    MOVE WS-INT TO COMPUTED-N
059000                    PERFORM FAIL.
059100     GO TO F-INTPART-WRITE-16.
059200 F-INTPART-DELETE-16.
059300     PERFORM  DE-LETE.
059400     GO TO    F-INTPART-WRITE-16.
059500 F-INTPART-WRITE-16.
059600     MOVE "F-INTPART-16" TO PAR-NAME.
059700     PERFORM  PRINT-DETAIL.
059800*****************TEST (q) ******************************
059900 F-INTPART-17.
060000     MOVE ZERO TO WS-INT.
060100 F-INTPART-TEST-17.
060200     COMPUTE WS-INT = FUNCTION INTEGER-PART(6.3 - (4.2 / 2)).
060300     IF WS-INT = 4 THEN
060400                    PERFORM PASS
060500     ELSE
060600                    MOVE  4  TO CORRECT-N
060700                    MOVE WS-INT TO COMPUTED-N
060800                    PERFORM FAIL.
060900     GO TO F-INTPART-WRITE-17.
061000 F-INTPART-DELETE-17.
061100     PERFORM  DE-LETE.
061200     GO TO    F-INTPART-WRITE-17.
061300 F-INTPART-WRITE-17.
061400     MOVE "F-INTPART-17" TO PAR-NAME.
061500     PERFORM  PRINT-DETAIL.
061600*****************TEST (r) ******************************
061700 F-INTPART-18.
061800     MOVE ZERO TO WS-INT.
061900 F-INTPART-TEST-18.
062000     COMPUTE WS-INT = FUNCTION INTEGER-PART((H + G) * I).
062100     IF WS-INT = -3 THEN
062200                    PERFORM PASS
062300     ELSE
062400                    MOVE  -3  TO CORRECT-N
062500                    MOVE WS-INT TO COMPUTED-N
062600                    PERFORM FAIL.
062700     GO TO F-INTPART-WRITE-18.
062800 F-INTPART-DELETE-18.
062900     PERFORM  DE-LETE.
063000     GO TO    F-INTPART-WRITE-18.
063100 F-INTPART-WRITE-18.
063200     MOVE "F-INTPART-18" TO PAR-NAME.
063300     PERFORM  PRINT-DETAIL.
063400*****************TEST (s) ******************************
063500 F-INTPART-19.
063600     MOVE ZERO TO WS-INT.
063700 F-INTPART-TEST-19.
063800     COMPUTE WS-INT = FUNCTION INTEGER-PART(H / 5).
063900     IF WS-INT = -1 THEN
064000                    PERFORM PASS
064100     ELSE
064200                    MOVE  -1  TO CORRECT-N
064300                    MOVE WS-INT TO COMPUTED-N
064400                    PERFORM FAIL.
064500     GO TO F-INTPART-WRITE-19.
064600 F-INTPART-DELETE-19.
064700     PERFORM  DE-LETE.
064800     GO TO    F-INTPART-WRITE-19.
064900 F-INTPART-WRITE-19.
065000     MOVE "F-INTPART-19" TO PAR-NAME.
065100     PERFORM  PRINT-DETAIL.
065200*****************TEST (t) ******************************
065300 F-INTPART-20.
065400     MOVE ZERO TO TEMP.
065500 F-INTPART-TEST-20.
065600     COMPUTE TEMP = FUNCTION INTEGER-PART(3.2) + I.
065700     IF (TEMP >= 6.39987) AND
065800        (TEMP <= 6.40013)
065900                    PERFORM PASS
066000     ELSE
066100                    MOVE  6.4  TO CORRECT-N
066200                    MOVE TEMP TO COMPUTED-N
066300                    PERFORM FAIL.
066400     GO TO F-INTPART-WRITE-20.
066500 F-INTPART-DELETE-20.
066600     PERFORM  DE-LETE.
066700     GO TO    F-INTPART-WRITE-20.
066800 F-INTPART-WRITE-20.
066900     MOVE "F-INTPART-20" TO PAR-NAME.
067000     PERFORM  PRINT-DETAIL.
067100*****************TEST (u) ******************************
067200 F-INTPART-21.
067300     MOVE ZERO TO WS-INT.
067400 F-INTPART-TEST-21.
067500     COMPUTE WS-INT =
067600            FUNCTION INTEGER-PART(FUNCTION INTEGER-PART(3.2)).
067700     IF WS-INT = 3 THEN
067800                    PERFORM PASS
067900     ELSE
068000                    MOVE 3 TO CORRECT-N
068100                    MOVE WS-INT TO COMPUTED-N
068200                    PERFORM FAIL.
068300     GO TO F-INTPART-WRITE-21.
068400 F-INTPART-DELETE-21.
068500     PERFORM  DE-LETE.
068600     GO TO    F-INTPART-WRITE-21.
068700 F-INTPART-WRITE-21.
068800     MOVE "F-INTPART-21" TO PAR-NAME.
068900     PERFORM  PRINT-DETAIL.
069000*****************TEST (v) ******************************
069100 F-INTPART-22.
069200     MOVE ZERO TO WS-INT.
069300 F-INTPART-TEST-22.
069400     COMPUTE WS-INT = FUNCTION INTEGER-PART(3.2) +
069500                      FUNCTION INTEGER-PART(1.3).
069600     IF WS-INT = 4 THEN
069700                    PERFORM PASS
069800     ELSE
069900                    MOVE 4 TO CORRECT-N
070000                    MOVE WS-INT TO COMPUTED-N
070100                    PERFORM FAIL.
070200     GO TO F-INTPART-WRITE-22.
070300 F-INTPART-DELETE-22.
070400     PERFORM  DE-LETE.
070500     GO TO    F-INTPART-WRITE-22.
070600 F-INTPART-WRITE-22.
070700     MOVE "F-INTPART-22" TO PAR-NAME.
070800     PERFORM  PRINT-DETAIL.
070900***************** SPECIAL TEST 1 ***********************
071000 F-INTPART-23.
071100     MOVE 4.4 TO ARG1.
071200     PERFORM F-INTPART-TEST-23
071300             UNTIL FUNCTION INTEGER-PART(ARG1) > 10.
071400     IF ARG1 = 11.4 THEN
071500                            PERFORM PASS
071600     ELSE
071700                            PERFORM FAIL.
071800     GO TO F-INTPART-WRITE-23.
071900*
072000 F-INTPART-TEST-23.
072100     COMPUTE ARG1 = ARG1 + 1.
072200*
072300 F-INTPART-DELETE-23.
072400     PERFORM  DE-LETE.
072500     GO TO    F-INTPART-WRITE-23.
072600 F-INTPART-WRITE-23.
072700     MOVE "F-INTPART-23" TO PAR-NAME.
072800     PERFORM  PRINT-DETAIL.
072900*******************END OF TESTS**************************
073000 CCVS-EXIT SECTION.
073100 CCVS-999999.
073200     GO TO CLOSE-FILES.
