000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF115A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function LENGTH.    *
000900*                                                         *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT PRINT-FILE ASSIGN TO
002100     XXXXX055.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  PRINT-FILE.
002500 01  PRINT-REC PICTURE X(120).
002600 01  DUMMY-RECORD PICTURE X(120).
002700 WORKING-STORAGE SECTION.
002800***********************************************************
002900* Variables specific to the Intrinsic Function Test IF115A*
003000***********************************************************
003100 01  K                PIC A(1)     VALUE "D".
003200 01  M                PIC A(17)    VALUE "longstringofchars".
003300 01  N                PIC A(3)     VALUE "abc".
003400 01  C                PIC S9(10).
003500 01  WS-INT           PIC S9(10).
003600*
003700**********************************************************
003800*
003900 01  TEST-RESULTS.
004000     02 FILLER                   PIC X      VALUE SPACE.
004100     02 FEATURE                  PIC X(20)  VALUE SPACE.
004200     02 FILLER                   PIC X      VALUE SPACE.
004300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
004400     02 FILLER                   PIC X      VALUE SPACE.
004500     02  PAR-NAME.
004600       03 FILLER                 PIC X(19)  VALUE SPACE.
004700       03  PARDOT-X              PIC X      VALUE SPACE.
004800       03 DOTVALUE               PIC 99     VALUE ZERO.
004900     02 FILLER                   PIC X(8)   VALUE SPACE.
005000     02 RE-MARK                  PIC X(61).
005100 01  TEST-COMPUTED.
005200     02 FILLER                   PIC X(30)  VALUE SPACE.
005300     02 FILLER                   PIC X(17)  VALUE
005400            "       COMPUTED=".
005500     02 COMPUTED-X.
005600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
005700     03 COMPUTED-N               REDEFINES COMPUTED-A
005800                                 PIC -9(9).9(9).
005900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
006100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
006200     03       CM-18V0 REDEFINES COMPUTED-A.
006300         04 COMPUTED-18V0                    PIC -9(18).
006400         04 FILLER                           PIC X.
006500     03 FILLER PIC X(50) VALUE SPACE.
006600 01  TEST-CORRECT.
006700     02 FILLER PIC X(30) VALUE SPACE.
006800     02 FILLER PIC X(17) VALUE "       CORRECT =".
006900     02 CORRECT-X.
007000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
007100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
007200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
007300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
007400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
007500     03      CR-18V0 REDEFINES CORRECT-A.
007600         04 CORRECT-18V0                     PIC -9(18).
007700         04 FILLER                           PIC X.
007800     03 FILLER PIC X(2) VALUE SPACE.
007900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008000 01  CCVS-C-1.
008100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
008200-    "SS  PARAGRAPH-NAME
008300-    "       REMARKS".
008400     02 FILLER                     PIC X(20)    VALUE SPACE.
008500 01  CCVS-C-2.
008600     02 FILLER                     PIC X        VALUE SPACE.
008700     02 FILLER                     PIC X(6)     VALUE "TESTED".
008800     02 FILLER                     PIC X(15)    VALUE SPACE.
008900     02 FILLER                     PIC X(4)     VALUE "FAIL".
009000     02 FILLER                     PIC X(94)    VALUE SPACE.
009100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
009200 01  REC-CT                        PIC 99       VALUE ZERO.
009300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
009400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
009500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
009600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
009700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
009800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
009900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
010000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
010100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
010200 01  CCVS-H-1.
010300     02  FILLER                    PIC X(39)    VALUE SPACES.
010400     02  FILLER                    PIC X(42)    VALUE
010500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
010600     02  FILLER                    PIC X(39)    VALUE SPACES.
010700 01  CCVS-H-2A.
010800   02  FILLER                        PIC X(40)  VALUE SPACE.
010900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
011000   02  FILLER                        PIC XXXX   VALUE
011100     "4.2 ".
011200   02  FILLER                        PIC X(28)  VALUE
011300            " COPY - NOT FOR DISTRIBUTION".
011400   02  FILLER                        PIC X(41)  VALUE SPACE.
011500
011600 01  CCVS-H-2B.
011700   02  FILLER                        PIC X(15)  VALUE
011800            "TEST RESULT OF ".
011900   02  TEST-ID                       PIC X(9).
012000   02  FILLER                        PIC X(4)   VALUE
012100            " IN ".
012200   02  FILLER                        PIC X(12)  VALUE
012300     " HIGH       ".
012400   02  FILLER                        PIC X(22)  VALUE
012500            " LEVEL VALIDATION FOR ".
012600   02  FILLER                        PIC X(58)  VALUE
012700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
012800 01  CCVS-H-3.
012900     02  FILLER                      PIC X(34)  VALUE
013000            " FOR OFFICIAL USE ONLY    ".
013100     02  FILLER                      PIC X(58)  VALUE
013200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
013300     02  FILLER                      PIC X(28)  VALUE
013400            "  COPYRIGHT   1985 ".
013500 01  CCVS-E-1.
013600     02 FILLER                       PIC X(52)  VALUE SPACE.
013700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
013800     02 ID-AGAIN                     PIC X(9).
013900     02 FILLER                       PIC X(45)  VALUE SPACES.
014000 01  CCVS-E-2.
014100     02  FILLER                      PIC X(31)  VALUE SPACE.
014200     02  FILLER                      PIC X(21)  VALUE SPACE.
014300     02 CCVS-E-2-2.
014400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
014500         03 FILLER                   PIC X      VALUE SPACE.
014600         03 ENDER-DESC               PIC X(44)  VALUE
014700            "ERRORS ENCOUNTERED".
014800 01  CCVS-E-3.
014900     02  FILLER                      PIC X(22)  VALUE
015000            " FOR OFFICIAL USE ONLY".
015100     02  FILLER                      PIC X(12)  VALUE SPACE.
015200     02  FILLER                      PIC X(58)  VALUE
015300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015400     02  FILLER                      PIC X(13)  VALUE SPACE.
015500     02 FILLER                       PIC X(15)  VALUE
015600             " COPYRIGHT 1985".
015700 01  CCVS-E-4.
015800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
015900     02 FILLER                       PIC X(4)   VALUE " OF ".
016000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
016100     02 FILLER                       PIC X(40)  VALUE
016200      "  TESTS WERE EXECUTED SUCCESSFULLY".
016300 01  XXINFO.
016400     02 FILLER                       PIC X(19)  VALUE
016500            "*** INFORMATION ***".
016600     02 INFO-TEXT.
016700       04 FILLER                     PIC X(8)   VALUE SPACE.
016800       04 XXCOMPUTED                 PIC X(20).
016900       04 FILLER                     PIC X(5)   VALUE SPACE.
017000       04 XXCORRECT                  PIC X(20).
017100     02 INF-ANSI-REFERENCE           PIC X(48).
017200 01  HYPHEN-LINE.
017300     02 FILLER  PIC IS X VALUE IS SPACE.
017400     02 FILLER  PIC IS X(65)    VALUE IS "************************
017500-    "*****************************************".
017600     02 FILLER  PIC IS X(54)    VALUE IS "************************
017700-    "******************************".
017800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
017900     "IF115A".
018000 PROCEDURE DIVISION.
018100 CCVS1 SECTION.
018200 OPEN-FILES.
018300     OPEN     OUTPUT PRINT-FILE.
018400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
018500     MOVE    SPACE TO TEST-RESULTS.
018600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
018700     GO TO CCVS1-EXIT.
018800 CLOSE-FILES.
018900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
019000 TERMINATE-CCVS.
019100     STOP     RUN.
019200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
019300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
019400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
019500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
019600     MOVE "****TEST DELETED****" TO RE-MARK.
019700 PRINT-DETAIL.
019800     IF REC-CT NOT EQUAL TO ZERO
019900             MOVE "." TO PARDOT-X
020000             MOVE REC-CT TO DOTVALUE.
020100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
020200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
020300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
020400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
020500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
020600     MOVE SPACE TO CORRECT-X.
020700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
020800     MOVE     SPACE TO RE-MARK.
020900 HEAD-ROUTINE.
021000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
021300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
021400 COLUMN-NAMES-ROUTINE.
021500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
021600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
021800 END-ROUTINE.
021900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
022000 END-RTN-EXIT.
022100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022200 END-ROUTINE-1.
022300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
022400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
022500      ADD PASS-COUNTER TO ERROR-HOLD.
022600      MOVE PASS-COUNTER TO CCVS-E-4-1.
022700      MOVE ERROR-HOLD TO CCVS-E-4-2.
022800      MOVE CCVS-E-4 TO CCVS-E-2-2.
022900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
023000  END-ROUTINE-12.
023100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
023200     IF       ERROR-COUNTER IS EQUAL TO ZERO
023300         MOVE "NO " TO ERROR-TOTAL
023400         ELSE
023500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
023600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
023700     PERFORM WRITE-LINE.
023800 END-ROUTINE-13.
023900     IF DELETE-COUNTER IS EQUAL TO ZERO
024000         MOVE "NO " TO ERROR-TOTAL  ELSE
024100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
024200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
024300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024400      IF   INSPECT-COUNTER EQUAL TO ZERO
024500          MOVE "NO " TO ERROR-TOTAL
024600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
024700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
024800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025000 WRITE-LINE.
025100     ADD 1 TO RECORD-COUNT.
025200Y    IF RECORD-COUNT GREATER 42
025300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
025400Y        MOVE SPACE TO DUMMY-RECORD
025500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
025600Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
025700Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
025800Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
025900Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
026000Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
026100Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
026200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
026300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
026400Y        MOVE ZERO TO RECORD-COUNT.
026500     PERFORM WRT-LN.
026600 WRT-LN.
026700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
026800     MOVE SPACE TO DUMMY-RECORD.
026900 BLANK-LINE-PRINT.
027000     PERFORM WRT-LN.
027100 FAIL-ROUTINE.
027200     IF     COMPUTED-X NOT EQUAL TO SPACE
027300            GO TO FAIL-ROUTINE-WRITE.
027400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
027500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
027600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
027700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027800     MOVE   SPACES TO INF-ANSI-REFERENCE.
027900     GO TO  FAIL-ROUTINE-EX.
028000 FAIL-ROUTINE-WRITE.
028100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
028200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
028300     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
028400     MOVE   SPACES TO COR-ANSI-REFERENCE.
028500 FAIL-ROUTINE-EX. EXIT.
028600 BAIL-OUT.
028700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
028800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
028900 BAIL-OUT-WRITE.
029000     MOVE CORRECT-A TO XXCORRECT.
029100     MOVE COMPUTED-A TO XXCOMPUTED.
029200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029400     MOVE   SPACES TO INF-ANSI-REFERENCE.
029500 BAIL-OUT-EX. EXIT.
029600 CCVS1-EXIT.
029700     EXIT.
029800********************************************************
029900*                                                      *
030000*    Intrinsic Function Tests         IF115A - LENGTH  *
030100*                                                      *
030200********************************************************
030300 SECT-IF115A SECTION.
030400 F-LENGTH-INFO.
030500     MOVE     "See ref. A-48 2.19" TO ANSI-REFERENCE.
030600     MOVE     "LENGTH Function"     TO FEATURE.
030700*****************TEST (a) ******************************
030800 F-LENGTH-01.
030900     MOVE ZERO TO WS-INT.
031000 F-LENGTH-TEST-01.
031100     COMPUTE WS-INT = FUNCTION LENGTH("A").
031200     IF WS-INT = 1 THEN
031300                        PERFORM PASS
031400     ELSE
031500                        MOVE 1 TO CORRECT-X
031600                        MOVE WS-INT TO COMPUTED-A
031700                        PERFORM FAIL.
031800     GO TO F-LENGTH-WRITE-01.
031900 F-LENGTH-DELETE-01.
032000     PERFORM  DE-LETE.
032100     GO TO    F-LENGTH-WRITE-01.
032200 F-LENGTH-WRITE-01.
032300     MOVE "F-LENGTH-01" TO PAR-NAME.
032400     PERFORM  PRINT-DETAIL.
032500*****************TEST (b) ******************************
032600 F-LENGTH-TEST-02.
032700     EVALUATE FUNCTION LENGTH("ABCDEFGHIJKLMNOPQRST")
032800     WHEN 20
032900                 PERFORM PASS
033000                 GO TO F-LENGTH-WRITE-02.
033100     PERFORM FAIL.
033200     GO TO F-LENGTH-WRITE-02.
033300 F-LENGTH-DELETE-02.
033400     PERFORM  DE-LETE.
033500     GO TO    F-LENGTH-WRITE-02.
033600 F-LENGTH-WRITE-02.
033700     MOVE "F-LENGTH-02" TO PAR-NAME.
033800     PERFORM  PRINT-DETAIL.
033900*****************TEST (c) ******************************
034000 F-LENGTH-03.
034100     MOVE ZERO TO WS-INT.
034200 F-LENGTH-TEST-03.
034300     IF FUNCTION LENGTH("ABCD") = 4 THEN
034400                        PERFORM PASS
034500     ELSE
034600                        MOVE 4 TO CORRECT-X
034700                        MOVE WS-INT TO COMPUTED-A
034800                        PERFORM FAIL.
034900     GO TO F-LENGTH-WRITE-03.
035000 F-LENGTH-DELETE-03.
035100     PERFORM  DE-LETE.
035200     GO TO    F-LENGTH-WRITE-03.
035300 F-LENGTH-WRITE-03.
035400     MOVE "F-LENGTH-03" TO PAR-NAME.
035500     PERFORM  PRINT-DETAIL.
035600*****************TEST (d) ******************************
035700 F-LENGTH-04.
035800     MOVE ZERO TO WS-INT.
035900 F-LENGTH-TEST-04.
036000     COMPUTE WS-INT = FUNCTION LENGTH(K).
036100     IF WS-INT = 1 THEN
036200                        PERFORM PASS
036300     ELSE
036400                        MOVE 1 TO CORRECT-X
036500                        MOVE WS-INT TO COMPUTED-A
036600                        PERFORM FAIL.
036700     GO TO F-LENGTH-WRITE-04.
036800 F-LENGTH-DELETE-04.
036900     PERFORM  DE-LETE.
037000     GO TO    F-LENGTH-WRITE-04.
037100 F-LENGTH-WRITE-04.
037200     MOVE "F-LENGTH-04" TO PAR-NAME.
037300     PERFORM  PRINT-DETAIL.
037400*****************TEST (e) ******************************
037500 F-LENGTH-05.
037600     MOVE ZERO TO WS-INT.
037700 F-LENGTH-TEST-05.
037800     COMPUTE WS-INT = FUNCTION LENGTH(M).
037900     IF WS-INT = 17 THEN
038000                        PERFORM PASS
038100     ELSE
038200                        MOVE  17  TO CORRECT-X
038300                        MOVE WS-INT TO COMPUTED-A
038400                        PERFORM FAIL.
038500     GO TO F-LENGTH-WRITE-05.
038600 F-LENGTH-DELETE-05.
038700     PERFORM  DE-LETE.
038800     GO TO    F-LENGTH-WRITE-05.
038900 F-LENGTH-WRITE-05.
039000     MOVE "F-LENGTH-05" TO PAR-NAME.
039100     PERFORM  PRINT-DETAIL.
039200*****************TEST (f) ******************************
039300 F-LENGTH-06.
039400     MOVE ZERO TO WS-INT.
039500 F-LENGTH-TEST-06.
039600     COMPUTE WS-INT = FUNCTION LENGTH(N).
039700     IF WS-INT = 3 THEN
039800                        PERFORM PASS
039900     ELSE
040000                        MOVE 3 TO CORRECT-X
040100                        MOVE WS-INT TO COMPUTED-A
040200                        PERFORM FAIL.
040300     GO TO F-LENGTH-WRITE-06.
040400 F-LENGTH-DELETE-06.
040500     PERFORM  DE-LETE.
040600     GO TO    F-LENGTH-WRITE-06.
040700 F-LENGTH-WRITE-06.
040800     MOVE "F-LENGTH-06" TO PAR-NAME.
040900     PERFORM  PRINT-DETAIL.
041000*****************TEST (g) ******************************
041100 F-LENGTH-07.
041200     MOVE ZERO TO WS-INT.
041300 F-LENGTH-TEST-07.
041400     COMPUTE WS-INT = FUNCTION LENGTH(N) + 2.
041500     IF WS-INT = 5 THEN
041600                        PERFORM PASS
041700     ELSE
041800                        MOVE 5 TO CORRECT-N
041900                        MOVE WS-INT TO COMPUTED-A
042000                        PERFORM FAIL.
042100     GO TO F-LENGTH-WRITE-07.
042200 F-LENGTH-DELETE-07.
042300     PERFORM  DE-LETE.
042400     GO TO    F-LENGTH-WRITE-07.
042500 F-LENGTH-WRITE-07.
042600     MOVE "F-LENGTH-07" TO PAR-NAME.
042700     PERFORM  PRINT-DETAIL.
042800*****************TEST (h) ******************************
042900 F-LENGTH-08.
043000     MOVE ZERO TO WS-INT.
043100 F-LENGTH-TEST-08.
043200     COMPUTE WS-INT = FUNCTION LENGTH(N) +
043300                      FUNCTION LENGTH(N).
043400     IF WS-INT = 6 THEN
043500                        PERFORM PASS
043600     ELSE
043700                        MOVE 6 TO CORRECT-N
043800                        MOVE WS-INT TO COMPUTED-A
043900                        PERFORM FAIL.
044000     GO TO F-LENGTH-WRITE-08.
044100 F-LENGTH-DELETE-08.
044200     PERFORM  DE-LETE.
044300     GO TO    F-LENGTH-WRITE-08.
044400 F-LENGTH-WRITE-08.
044500     MOVE "F-LENGTH-08" TO PAR-NAME.
044600     PERFORM  PRINT-DETAIL.
044700*******************END OF TESTS**************************
044800 CCVS-EXIT SECTION.
044900 CCVS-999999.
045000     GO TO CLOSE-FILES.
