000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF123A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function MIN.       *
000900*                                                         *
001000***********************************************************
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.
001400     XXXXX082.
001500 OBJECT-COMPUTER.
001600     XXXXX083
001700     PROGRAM COLLATING SEQUENCE IS PRG-COLL-SEQ.
001800 SPECIAL-NAMES.
001900     ALPHABET PRG-COLL-SEQ IS
002000     STANDARD-2.
002100 INPUT-OUTPUT SECTION.
002200 FILE-CONTROL.
002300     SELECT PRINT-FILE ASSIGN TO
002400     XXXXX055.
002500 DATA DIVISION.
002600 FILE SECTION.
002700 FD  PRINT-FILE.
002800 01  PRINT-REC PICTURE X(120).
002900 01  DUMMY-RECORD PICTURE X(120).
003000 WORKING-STORAGE SECTION.
003100***********************************************************
003200* Variables specific to the Intrinsic Function Test IF123A*
003300***********************************************************
003400 01  A                   PIC S9(10)          VALUE 5.
003500 01  B                   PIC S9(10)          VALUE 7.
003600 01  C                   PIC S9(10)          VALUE -4.
003700 01  D                   PIC S9(10)          VALUE 10.
003800 01  E                   PIC S9(5)V9(5)      VALUE 34.26.
003900 01  F                   PIC S9(5)V9(5)      VALUE -8.32.
004000 01  G                   PIC S9(5)V9(5)      VALUE 4.08.
004100 01  H                   PIC S9(5)V9(5)      VALUE -5.3.
004200 01  I                   PIC X               VALUE "R".
004300 01  J                   PIC X               VALUE "U".
004400 01  M                   PIC S9(10)          VALUE 1.
004500 01  N                   PIC S9(10)          VALUE 3.
004600 01  O                   PIC S9(10)          VALUE 5.
004700 01  P                   PIC S9(10)          VALUE 1.
004800 01  Q                   PIC S9(10)          VALUE 3.
004900 01  R                   PIC S9(10)          VALUE 5.
005000 01  ARG1                PIC S9(10)          VALUE 15.
005100 01  ARR                                     VALUE "40537".
005200     02  IND OCCURS 5 TIMES PIC 9.
005300 01  TEMP                PIC S9(10).
005400 01  WS-NUM              PIC S9(5)V9(6).
005500 01  WS-ANUM             PIC X.
005600 01  MIN-RANGE           PIC S9(5)V9(7).
005700 01  MAX-RANGE           PIC S9(5)V9(7).
005800*
005900**********************************************************
006000*
006100 01  TEST-RESULTS.
006200     02 FILLER                   PIC X      VALUE SPACE.
006300     02 FEATURE                  PIC X(20)  VALUE SPACE.
006400     02 FILLER                   PIC X      VALUE SPACE.
006500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006600     02 FILLER                   PIC X      VALUE SPACE.
006700     02  PAR-NAME.
006800       03 FILLER                 PIC X(19)  VALUE SPACE.
006900       03  PARDOT-X              PIC X      VALUE SPACE.
007000       03 DOTVALUE               PIC 99     VALUE ZERO.
007100     02 FILLER                   PIC X(8)   VALUE SPACE.
007200     02 RE-MARK                  PIC X(61).
007300 01  TEST-COMPUTED.
007400     02 FILLER                   PIC X(30)  VALUE SPACE.
007500     02 FILLER                   PIC X(17)  VALUE
007600            "       COMPUTED=".
007700     02 COMPUTED-X.
007800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007900     03 COMPUTED-N               REDEFINES COMPUTED-A
008000                                 PIC -9(9).9(9).
008100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
008200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
008300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
008400     03       CM-18V0 REDEFINES COMPUTED-A.
008500         04 COMPUTED-18V0                    PIC -9(18).
008600         04 FILLER                           PIC X.
008700     03 FILLER PIC X(50) VALUE SPACE.
008800 01  TEST-CORRECT.
008900     02 FILLER PIC X(30) VALUE SPACE.
009000     02 FILLER PIC X(17) VALUE "       CORRECT =".
009100     02 CORRECT-X.
009200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
009300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
009400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
009500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009700     03      CR-18V0 REDEFINES CORRECT-A.
009800         04 CORRECT-18V0                     PIC -9(18).
009900         04 FILLER                           PIC X.
010000     03 FILLER PIC X(2) VALUE SPACE.
010100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
010200 01  TEST-CORRECT-MIN.
010300     02 FILLER PIC X(30) VALUE SPACE.
010400     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
010500     02 CORRECTMI-X.
010600     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
010700     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
010800     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
010900     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
011000     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
011100     03      CR-18V0 REDEFINES CORRECTMI-A.
011200         04 CORRECTMI-18V0                     PIC -9(18).
011300         04 FILLER                           PIC X.
011400     03 FILLER PIC X(2) VALUE SPACE.
011500     03 FILLER                           PIC X(48) VALUE SPACE.
011600 01  TEST-CORRECT-MAX.
011700     02 FILLER PIC X(30) VALUE SPACE.
011800     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
011900     02 CORRECTMA-X.
012000     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
012100     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
012200     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
012300     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
012400     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
012500     03      CR-18V0 REDEFINES CORRECTMA-A.
012600         04 CORRECTMA-18V0                     PIC -9(18).
012700         04 FILLER                           PIC X.
012800     03 FILLER PIC X(2) VALUE SPACE.
012900     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
013000 01  CCVS-C-1.
013100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
013200-    "SS  PARAGRAPH-NAME
013300-    "       REMARKS".
013400     02 FILLER                     PIC X(20)    VALUE SPACE.
013500 01  CCVS-C-2.
013600     02 FILLER                     PIC X        VALUE SPACE.
013700     02 FILLER                     PIC X(6)     VALUE "TESTED".
013800     02 FILLER                     PIC X(15)    VALUE SPACE.
013900     02 FILLER                     PIC X(4)     VALUE "FAIL".
014000     02 FILLER                     PIC X(94)    VALUE SPACE.
014100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
014200 01  REC-CT                        PIC 99       VALUE ZERO.
014300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
014400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
014500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
014600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
015000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
015100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
015200 01  CCVS-H-1.
015300     02  FILLER                    PIC X(39)    VALUE SPACES.
015400     02  FILLER                    PIC X(42)    VALUE
015500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
015600     02  FILLER                    PIC X(39)    VALUE SPACES.
015700 01  CCVS-H-2A.
015800   02  FILLER                        PIC X(40)  VALUE SPACE.
015900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
016000   02  FILLER                        PIC XXXX   VALUE
016100     "4.2 ".
016200   02  FILLER                        PIC X(28)  VALUE
016300            " COPY - NOT FOR DISTRIBUTION".
016400   02  FILLER                        PIC X(41)  VALUE SPACE.
016500
016600 01  CCVS-H-2B.
016700   02  FILLER                        PIC X(15)  VALUE
016800            "TEST RESULT OF ".
016900   02  TEST-ID                       PIC X(9).
017000   02  FILLER                        PIC X(4)   VALUE
017100            " IN ".
017200   02  FILLER                        PIC X(12)  VALUE
017300     " HIGH       ".
017400   02  FILLER                        PIC X(22)  VALUE
017500            " LEVEL VALIDATION FOR ".
017600   02  FILLER                        PIC X(58)  VALUE
017700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017800 01  CCVS-H-3.
017900     02  FILLER                      PIC X(34)  VALUE
018000            " FOR OFFICIAL USE ONLY    ".
018100     02  FILLER                      PIC X(58)  VALUE
018200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
018300     02  FILLER                      PIC X(28)  VALUE
018400            "  COPYRIGHT   1985 ".
018500 01  CCVS-E-1.
018600     02 FILLER                       PIC X(52)  VALUE SPACE.
018700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018800     02 ID-AGAIN                     PIC X(9).
018900     02 FILLER                       PIC X(45)  VALUE SPACES.
019000 01  CCVS-E-2.
019100     02  FILLER                      PIC X(31)  VALUE SPACE.
019200     02  FILLER                      PIC X(21)  VALUE SPACE.
019300     02 CCVS-E-2-2.
019400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
019500         03 FILLER                   PIC X      VALUE SPACE.
019600         03 ENDER-DESC               PIC X(44)  VALUE
019700            "ERRORS ENCOUNTERED".
019800 01  CCVS-E-3.
019900     02  FILLER                      PIC X(22)  VALUE
020000            " FOR OFFICIAL USE ONLY".
020100     02  FILLER                      PIC X(12)  VALUE SPACE.
020200     02  FILLER                      PIC X(58)  VALUE
020300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020400     02  FILLER                      PIC X(13)  VALUE SPACE.
020500     02 FILLER                       PIC X(15)  VALUE
020600             " COPYRIGHT 1985".
020700 01  CCVS-E-4.
020800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020900     02 FILLER                       PIC X(4)   VALUE " OF ".
021000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
021100     02 FILLER                       PIC X(40)  VALUE
021200      "  TESTS WERE EXECUTED SUCCESSFULLY".
021300 01  XXINFO.
021400     02 FILLER                       PIC X(19)  VALUE
021500            "*** INFORMATION ***".
021600     02 INFO-TEXT.
021700       04 FILLER                     PIC X(8)   VALUE SPACE.
021800       04 XXCOMPUTED                 PIC X(20).
021900       04 FILLER                     PIC X(5)   VALUE SPACE.
022000       04 XXCORRECT                  PIC X(20).
022100     02 INF-ANSI-REFERENCE           PIC X(48).
022200 01  HYPHEN-LINE.
022300     02 FILLER  PIC IS X VALUE IS SPACE.
022400     02 FILLER  PIC IS X(65)    VALUE IS "************************
022500-    "*****************************************".
022600     02 FILLER  PIC IS X(54)    VALUE IS "************************
022700-    "******************************".
022800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022900     "IF123A".
023000 PROCEDURE DIVISION.
023100 CCVS1 SECTION.
023200 OPEN-FILES.
023300     OPEN     OUTPUT PRINT-FILE.
023400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
023500     MOVE    SPACE TO TEST-RESULTS.
023600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023700     GO TO CCVS1-EXIT.
023800 CLOSE-FILES.
023900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
024000 TERMINATE-CCVS.
024100     STOP     RUN.
024200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
024300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
024400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
024500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
024600     MOVE "****TEST DELETED****" TO RE-MARK.
024700 PRINT-DETAIL.
024800     IF REC-CT NOT EQUAL TO ZERO
024900             MOVE "." TO PARDOT-X
025000             MOVE REC-CT TO DOTVALUE.
025100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
025200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
025300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
025400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
025500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
025600     MOVE SPACE TO CORRECT-X.
025700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025800     MOVE     SPACE TO RE-MARK.
025900 HEAD-ROUTINE.
026000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026400 COLUMN-NAMES-ROUTINE.
026500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026800 END-ROUTINE.
026900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
027000 END-RTN-EXIT.
027100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027200 END-ROUTINE-1.
027300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
027400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
027500      ADD PASS-COUNTER TO ERROR-HOLD.
027600      MOVE PASS-COUNTER TO CCVS-E-4-1.
027700      MOVE ERROR-HOLD TO CCVS-E-4-2.
027800      MOVE CCVS-E-4 TO CCVS-E-2-2.
027900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
028000  END-ROUTINE-12.
028100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
028200     IF       ERROR-COUNTER IS EQUAL TO ZERO
028300         MOVE "NO " TO ERROR-TOTAL
028400         ELSE
028500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
028600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028700     PERFORM WRITE-LINE.
028800 END-ROUTINE-13.
028900     IF DELETE-COUNTER IS EQUAL TO ZERO
029000         MOVE "NO " TO ERROR-TOTAL  ELSE
029100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
029200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
029300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029400      IF   INSPECT-COUNTER EQUAL TO ZERO
029500          MOVE "NO " TO ERROR-TOTAL
029600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030000 WRITE-LINE.
030100     ADD 1 TO RECORD-COUNT.
030200Y    IF RECORD-COUNT GREATER 42
030300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
030400Y        MOVE SPACE TO DUMMY-RECORD
030500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
030600Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030700Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030800Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030900Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
031000Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
031100Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
031200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
031300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
031400Y        MOVE ZERO TO RECORD-COUNT.
031500     PERFORM WRT-LN.
031600 WRT-LN.
031700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031800     MOVE SPACE TO DUMMY-RECORD.
031900 BLANK-LINE-PRINT.
032000     PERFORM WRT-LN.
032100 FAIL-ROUTINE.
032200     IF     COMPUTED-X NOT EQUAL TO SPACE
032300            GO TO FAIL-ROUTINE-WRITE.
032400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032800     MOVE   SPACES TO INF-ANSI-REFERENCE.
032900     GO TO  FAIL-ROUTINE-EX.
033000 FAIL-ROUTINE-WRITE.
033100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
033200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
033300                              CORMA-ANSI-REFERENCE.
033400     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
033500           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
033600           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
033700     ELSE
033800           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
033900     PERFORM WRITE-LINE.
034000     MOVE   SPACES TO COR-ANSI-REFERENCE.
034100 FAIL-ROUTINE-EX. EXIT.
034200 BAIL-OUT.
034300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
034400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
034500 BAIL-OUT-WRITE.
034600     MOVE CORRECT-A TO XXCORRECT.
034700     MOVE COMPUTED-A TO XXCOMPUTED.
034800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
034900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035000     MOVE   SPACES TO INF-ANSI-REFERENCE.
035100 BAIL-OUT-EX. EXIT.
035200 CCVS1-EXIT.
035300     EXIT.
035400********************************************************
035500*                                                      *
035600*    Intrinsic Function Tests         IF123A - MIN     *
035700*                                                      *
035800********************************************************
035900 SECT-IF123A SECTION.
036000 F-MIN-INFO.
036100     MOVE     "See ref. A-56 2.27" TO ANSI-REFERENCE.
036200     MOVE     "MIN Function" TO FEATURE.
036300*****************TEST (a) - SIMPLE TEST*****************
036400 F-MIN-01.
036500     MOVE ZERO TO WS-NUM.
036600 F-MIN-TEST-01.
036700     COMPUTE WS-NUM = FUNCTION MIN(5, 6, 10, 3, 7).
036800     IF WS-NUM = 3 THEN
036900                    PERFORM PASS
037000     ELSE
037100                    MOVE WS-NUM TO COMPUTED-N
037200                    MOVE 3 TO CORRECT-N
037300                    PERFORM FAIL.
037400     GO TO F-MIN-WRITE-01.
037500 F-MIN-DELETE-01.
037600     PERFORM  DE-LETE.
037700     GO TO    F-MIN-WRITE-01.
037800 F-MIN-WRITE-01.
037900     MOVE "F-MIN-01" TO PAR-NAME.
038000     PERFORM  PRINT-DETAIL.
038100*****************TEST (b) - SIMPLE TEST*****************
038200 F-MIN-02.
038300     EVALUATE FUNCTION MIN(-4, 7, 2304, 3, -8)
038400     WHEN -8
038500                    PERFORM PASS
038600     WHEN OTHER
038700                    PERFORM FAIL.
038800     GO TO F-MIN-WRITE-02.
038900 F-MIN-DELETE-02.
039000     PERFORM  DE-LETE.
039100     GO TO    F-MIN-WRITE-02.
039200 F-MIN-WRITE-02.
039300     MOVE "F-MIN-02" TO PAR-NAME.
039400     PERFORM  PRINT-DETAIL.
039500*****************TEST (c) - SIMPLE TEST*****************
039600 F-MIN-03.
039700     IF (FUNCTION MIN(4.3, 2.6, 7.3, 9.1) >= 2.59995) AND
039800        (FUNCTION MIN(4.3, 2.6, 7.3, 9.1) <= 2.60005) THEN
039900                    PERFORM PASS
040000     ELSE
040100                    PERFORM FAIL.
040200     GO TO F-MIN-WRITE-03.
040300 F-MIN-DELETE-03.
040400     PERFORM  DE-LETE.
040500     GO TO    F-MIN-WRITE-03.
040600 F-MIN-WRITE-03.
040700     MOVE "F-MIN-03" TO PAR-NAME.
040800     PERFORM  PRINT-DETAIL.
040900*****************TEST (d) - SIMPLE TEST*****************
041000 F-MIN-04.
041100     MOVE ZERO TO WS-NUM.
041200 F-MIN-TEST-04.
041300     COMPUTE WS-NUM = FUNCTION MIN(-4.3, 10.2, -0.7, 3.9).
041400     IF (WS-NUM >= -4.30009) AND
041500        (WS-NUM <= -4.29991)
041600                    PERFORM PASS
041700     ELSE
041800                    MOVE WS-NUM TO COMPUTED-N
041900                    MOVE -4.3 TO CORRECT-N
042000                    PERFORM FAIL.
042100     GO TO F-MIN-WRITE-04.
042200 F-MIN-DELETE-04.
042300     PERFORM  DE-LETE.
042400     GO TO    F-MIN-WRITE-04.
042500 F-MIN-WRITE-04.
042600     MOVE "F-MIN-04" TO PAR-NAME.
042700     PERFORM  PRINT-DETAIL.
042800*****************TEST (e) - SIMPLE TEST*****************
042900 F-MIN-05.
043000     MOVE ZERO TO WS-NUM.
043100 F-MIN-TEST-05.
043200     COMPUTE WS-NUM = FUNCTION MIN(A, B, D).
043300     IF WS-NUM = 5 THEN
043400                    PERFORM PASS
043500     ELSE
043600                    MOVE WS-NUM TO COMPUTED-N
043700                    MOVE 5 TO CORRECT-N
043800                    PERFORM FAIL.
043900     GO TO F-MIN-WRITE-05.
044000 F-MIN-DELETE-05.
044100     PERFORM  DE-LETE.
044200     GO TO    F-MIN-WRITE-05.
044300 F-MIN-WRITE-05.
044400     MOVE "F-MIN-05" TO PAR-NAME.
044500     PERFORM  PRINT-DETAIL.
044600*****************TEST (f) - SIMPLE TEST*****************
044700 F-MIN-06.
044800     MOVE ZERO TO WS-NUM.
044900 F-MIN-TEST-06.
045000     COMPUTE WS-NUM = FUNCTION MIN(A, B, C, D).
045100     IF WS-NUM = -4 THEN
045200                    PERFORM PASS
045300     ELSE
045400                    MOVE WS-NUM TO COMPUTED-N
045500                    MOVE -4 TO CORRECT-N
045600                    PERFORM FAIL.
045700     GO TO F-MIN-WRITE-06.
045800 F-MIN-DELETE-06.
045900     PERFORM  DE-LETE.
046000     GO TO    F-MIN-WRITE-06.
046100 F-MIN-WRITE-06.
046200     MOVE "F-MIN-06" TO PAR-NAME.
046300     PERFORM  PRINT-DETAIL.
046400*****************TEST (g) - SIMPLE TEST*****************
046500 F-MIN-07.
046600     MOVE ZERO TO WS-NUM.
046700 F-MIN-TEST-07.
046800     COMPUTE WS-NUM = FUNCTION MIN(E, G).
046900     IF (WS-NUM >= 4.07992) AND
047000        (WS-NUM <= 4.08008)
047100                    PERFORM PASS
047200     ELSE
047300                    MOVE WS-NUM TO COMPUTED-N
047400                    MOVE 4.08 TO CORRECT-N
047500                    PERFORM FAIL.
047600     GO TO F-MIN-WRITE-07.
047700 F-MIN-DELETE-07.
047800     PERFORM  DE-LETE.
047900     GO TO    F-MIN-WRITE-07.
048000 F-MIN-WRITE-07.
048100     MOVE "F-MIN-07" TO PAR-NAME.
048200     PERFORM  PRINT-DETAIL.
048300*****************TEST (h) - SIMPLE TEST*****************
048400 F-MIN-08.
048500     MOVE ZERO TO WS-NUM.
048600 F-MIN-TEST-08.
048700     COMPUTE WS-NUM = FUNCTION MIN(E, F, G, H).
048800     IF (WS-NUM >= -8.32017) AND
048900        (WS-NUM <= -8.31983)
049000                    PERFORM PASS
049100     ELSE
049200                    MOVE WS-NUM TO COMPUTED-N
049300                    MOVE -8.32 TO CORRECT-N
049400                    PERFORM FAIL.
049500     GO TO F-MIN-WRITE-08.
049600 F-MIN-DELETE-08.
049700     PERFORM  DE-LETE.
049800     GO TO    F-MIN-WRITE-08.
049900 F-MIN-WRITE-08.
050000     MOVE "F-MIN-08" TO PAR-NAME.
050100     PERFORM  PRINT-DETAIL.
050200*****************TEST (i) - SIMPLE TEST*****************
050300 F-MIN-09.
050400     MOVE ZERO TO WS-NUM.
050500 F-MIN-TEST-09.
050600     COMPUTE WS-NUM = FUNCTION MIN(A, 4, 8, -10, C, 0).
050700     IF WS-NUM = -10 THEN
050800                    PERFORM PASS
050900     ELSE
051000                    MOVE WS-NUM TO COMPUTED-N
051100                    MOVE -10 TO CORRECT-N
051200                    PERFORM FAIL.
051300     GO TO F-MIN-WRITE-09.
051400 F-MIN-DELETE-09.
051500     PERFORM  DE-LETE.
051600     GO TO    F-MIN-WRITE-09.
051700 F-MIN-WRITE-09.
051800     MOVE "F-MIN-09" TO PAR-NAME.
051900     PERFORM  PRINT-DETAIL.
052000*****************TEST (j) - SIMPLE TEST*****************
052100 F-MIN-10.
052200     MOVE ZERO TO WS-NUM.
052300 F-MIN-TEST-10.
052400     COMPUTE WS-NUM = FUNCTION MIN(4, D, E, 6.3, -2.0).
052500     IF (WS-NUM >= -2.00004) AND
052600        (WS-NUM <= -1.99996)
052700                    PERFORM PASS
052800     ELSE
052900                    MOVE WS-NUM TO COMPUTED-N
053000                    MOVE -2.0 TO CORRECT-N
053100                    PERFORM FAIL.
053200     GO TO F-MIN-WRITE-10.
053300 F-MIN-DELETE-10.
053400     PERFORM  DE-LETE.
053500     GO TO    F-MIN-WRITE-10.
053600 F-MIN-WRITE-10.
053700     MOVE "F-MIN-10" TO PAR-NAME.
053800     PERFORM  PRINT-DETAIL.
053900*****************TEST (k) - SIMPLE TEST*****************
054000 F-MIN-11.
054100     MOVE SPACES TO WS-ANUM.
054200 F-MIN-TEST-11.
054300     MOVE FUNCTION MIN("R", I, "I", "a") TO WS-ANUM.
054400     IF WS-ANUM = "I" THEN
054500                    PERFORM PASS
054600     ELSE
054700                    MOVE WS-ANUM TO COMPUTED-A
054800                    MOVE "I" TO CORRECT-A
054900                    PERFORM FAIL.
055000     GO TO F-MIN-WRITE-11.
055100 F-MIN-DELETE-11.
055200     PERFORM  DE-LETE.
055300     GO TO    F-MIN-WRITE-11.
055400 F-MIN-WRITE-11.
055500     MOVE "F-MIN-11" TO PAR-NAME.
055600     PERFORM  PRINT-DETAIL.
055700*****************TEST (l) - SIMPLE TEST*****************
055800 F-MIN-12.
055900     MOVE ZERO TO WS-NUM.
056000 F-MIN-TEST-12.
056100     MOVE FUNCTION MIN("a", J, "J") TO WS-ANUM.
056200     IF WS-ANUM = "J" THEN
056300                    PERFORM PASS
056400     ELSE
056500                    MOVE WS-ANUM TO COMPUTED-A
056600                    MOVE "J" TO CORRECT-A
056700                    PERFORM FAIL.
056800     GO TO F-MIN-WRITE-12.
056900 F-MIN-DELETE-12.
057000     PERFORM  DE-LETE.
057100     GO TO    F-MIN-WRITE-12.
057200 F-MIN-WRITE-12.
057300     MOVE "F-MIN-12" TO PAR-NAME.
057400     PERFORM  PRINT-DETAIL.
057500*****************TEST (m) - SIMPLE TEST*****************
057600 F-MIN-13.
057700     MOVE ZERO TO WS-NUM.
057800 F-MIN-TEST-13.
057900     COMPUTE WS-NUM = FUNCTION MIN(IND(1), IND(2), IND(3)).
058000     IF WS-NUM = 0 THEN
058100                    PERFORM PASS
058200     ELSE
058300                    MOVE WS-NUM TO COMPUTED-N
058400                    MOVE 0 TO CORRECT-N
058500                    PERFORM FAIL.
058600     GO TO F-MIN-WRITE-13.
058700 F-MIN-DELETE-13.
058800     PERFORM  DE-LETE.
058900     GO TO    F-MIN-WRITE-13.
059000 F-MIN-WRITE-13.
059100     MOVE "F-MIN-13" TO PAR-NAME.
059200     PERFORM  PRINT-DETAIL.
059300*****************TEST (n) - SIMPLE TEST*****************
059400 F-MIN-14.
059500     MOVE ZERO TO WS-NUM.
059600 F-MIN-TEST-14.
059700     COMPUTE WS-NUM = FUNCTION MIN(IND(P), IND(Q), IND(R)).
059800     IF WS-NUM = 4 THEN
059900                    PERFORM PASS
060000     ELSE
060100                    MOVE WS-NUM TO COMPUTED-N
060200                    MOVE 4 TO CORRECT-N
060300                    PERFORM FAIL.
060400     GO TO F-MIN-WRITE-14.
060500 F-MIN-DELETE-14.
060600     PERFORM  DE-LETE.
060700     GO TO    F-MIN-WRITE-14.
060800 F-MIN-WRITE-14.
060900     MOVE "F-MIN-14" TO PAR-NAME.
061000     PERFORM  PRINT-DETAIL.
061100*****************TEST (o) - SIMPLE TEST*****************
061200 F-MIN-15.
061300     MOVE ZERO TO WS-NUM.
061400 F-MIN-TEST-15.
061500     COMPUTE WS-NUM = FUNCTION MIN(IND(ALL)).
061600     IF WS-NUM = 0 THEN
061700                    PERFORM PASS
061800     ELSE
061900                    MOVE WS-NUM TO COMPUTED-N
062000                    MOVE 0 TO CORRECT-N
062100                    PERFORM FAIL.
062200     GO TO F-MIN-WRITE-15.
062300 F-MIN-DELETE-15.
062400     PERFORM  DE-LETE.
062500     GO TO    F-MIN-WRITE-15.
062600 F-MIN-WRITE-15.
062700     MOVE "F-MIN-15" TO PAR-NAME.
062800     PERFORM  PRINT-DETAIL.
062900*****************TEST (q) - SIMPLE TEST*****************
063000 F-MIN-17.
063100     MOVE ZERO TO WS-NUM.
063200 F-MIN-TEST-17.
063300     COMPUTE WS-NUM =
063400         FUNCTION MIN(31000, 310001, 78000, 29000, 12000).
063500     IF WS-NUM = 12000 THEN
063600                    PERFORM PASS
063700     ELSE
063800                    MOVE WS-NUM TO COMPUTED-N
063900                    MOVE 1200 TO CORRECT-N
064000                    PERFORM FAIL.
064100     GO TO F-MIN-WRITE-17.
064200 F-MIN-DELETE-17.
064300     PERFORM  DE-LETE.
064400     GO TO    F-MIN-WRITE-17.
064500 F-MIN-WRITE-17.
064600     MOVE "F-MIN-17" TO PAR-NAME.
064700     PERFORM  PRINT-DETAIL.
064800*****************TEST (a) - COMPLEX TEST****************
064900 F-MIN-18.
065000     MOVE ZERO TO WS-NUM.
065100     MOVE  1.99996 TO MIN-RANGE.
065200     MOVE  2.00004 TO MAX-RANGE.
065300 F-MIN-TEST-18.
065400     COMPUTE WS-NUM = FUNCTION MIN(A * B, (3 + 1) / 2, 3 + 4).
065500     IF (WS-NUM >= MIN-RANGE) AND
065600        (WS-NUM <= MAX-RANGE) THEN
065700                    PERFORM PASS
065800     ELSE
065900                    MOVE WS-NUM TO COMPUTED-N
066000                    MOVE MIN-RANGE TO CORRECT-MIN
066100                    MOVE MAX-RANGE TO CORRECT-MAX
066200                    PERFORM FAIL.
066300     GO TO F-MIN-WRITE-18.
066400 F-MIN-DELETE-18.
066500     PERFORM  DE-LETE.
066600     GO TO    F-MIN-WRITE-18.
066700 F-MIN-WRITE-18.
066800     MOVE "F-MIN-18" TO PAR-NAME.
066900     PERFORM  PRINT-DETAIL.
067000*****************TEST (b) - COMPLEX TEST****************
067100 F-MIN-19.
067200     MOVE ZERO TO WS-NUM.
067300     MOVE -10.6002 TO MIN-RANGE.
067400     MOVE -10.5998 TO MAX-RANGE.
067500 F-MIN-TEST-19.
067600     COMPUTE WS-NUM = FUNCTION MIN(E + 4, H * 2, 5 + A).
067700     IF (WS-NUM >= MIN-RANGE) AND
067800        (WS-NUM <= MAX-RANGE) THEN
067900                    PERFORM PASS
068000     ELSE
068100                    MOVE WS-NUM TO COMPUTED-N
068200                    MOVE MIN-RANGE TO CORRECT-MIN
068300                    MOVE MAX-RANGE TO CORRECT-MAX
068400                    PERFORM FAIL.
068500     GO TO F-MIN-WRITE-19.
068600 F-MIN-DELETE-19.
068700     PERFORM  DE-LETE.
068800     GO TO    F-MIN-WRITE-19.
068900 F-MIN-WRITE-19.
069000     MOVE "F-MIN-19" TO PAR-NAME.
069100     PERFORM  PRINT-DETAIL.
069200*****************TEST (c) - COMPLEX TEST****************
069300 F-MIN-20.
069400     MOVE ZERO TO WS-NUM.
069500     MOVE -7.00014 TO MIN-RANGE.
069600     MOVE -6.99986 TO MAX-RANGE.
069700 F-MIN-TEST-20.
069800     COMPUTE WS-NUM = FUNCTION MIN(-7, -9 + 2, (- B)).
069900     IF (WS-NUM >= MIN-RANGE) AND
070000        (WS-NUM <= MAX-RANGE) THEN
070100                    PERFORM PASS
070200     ELSE
070300                    MOVE WS-NUM TO COMPUTED-N
070400                    MOVE MIN-RANGE TO CORRECT-MIN
070500                    MOVE MAX-RANGE TO CORRECT-MAX
070600                    PERFORM FAIL.
070700     GO TO F-MIN-WRITE-20.
070800 F-MIN-DELETE-20.
070900     PERFORM  DE-LETE.
071000     GO TO    F-MIN-WRITE-20.
071100 F-MIN-WRITE-20.
071200     MOVE "F-MIN-20" TO PAR-NAME.
071300     PERFORM  PRINT-DETAIL.
071400*****************TEST (d) - COMPLEX TEST****************
071500 F-MIN-21.
071600     MOVE ZERO TO WS-NUM.
071700     MOVE 4.99990 TO MIN-RANGE.
071800     MOVE 5.00010 TO MAX-RANGE.
071900 F-MIN-TEST-21.
072000     COMPUTE WS-NUM = FUNCTION MIN(FUNCTION MIN(14, A), E, 50).
072100     IF (WS-NUM >= MIN-RANGE) AND
072200        (WS-NUM <= MAX-RANGE) THEN
072300                    PERFORM PASS
072400     ELSE
072500                    MOVE WS-NUM TO COMPUTED-N
072600                    MOVE MIN-RANGE TO CORRECT-MIN
072700                    MOVE MAX-RANGE TO CORRECT-MAX
072800                    PERFORM FAIL.
072900     GO TO F-MIN-WRITE-21.
073000 F-MIN-DELETE-21.
073100     PERFORM  DE-LETE.
073200     GO TO    F-MIN-WRITE-21.
073300 F-MIN-WRITE-21.
073400     MOVE "F-MIN-21" TO PAR-NAME.
073500     PERFORM  PRINT-DETAIL.
073600*****************TEST (e) - COMPLEX TEST****************
073700 F-MIN-22.
073800     MOVE ZERO TO WS-NUM.
073900     MOVE 8.99982 TO MIN-RANGE.
074000     MOVE 9.00018 TO MAX-RANGE.
074100 F-MIN-TEST-22.
074200     COMPUTE WS-NUM = FUNCTION MIN(4, B, E) + A.
074300     IF (WS-NUM >= MIN-RANGE) AND
074400        (WS-NUM <= MAX-RANGE) THEN
074500                    PERFORM PASS
074600     ELSE
074700                    MOVE WS-NUM TO COMPUTED-N
074800                    MOVE MIN-RANGE TO CORRECT-MIN
074900                    MOVE MAX-RANGE TO CORRECT-MAX
075000                    PERFORM FAIL.
075100     GO TO F-MIN-WRITE-22.
075200 F-MIN-DELETE-22.
075300     PERFORM  DE-LETE.
075400     GO TO    F-MIN-WRITE-22.
075500 F-MIN-WRITE-22.
075600     MOVE "F-MIN-22" TO PAR-NAME.
075700     PERFORM  PRINT-DETAIL.
075800*****************TEST (f) - COMPLEX TEST****************
075900 F-MIN-23.
076000     MOVE ZERO TO WS-NUM.
076100     MOVE 4.99990 TO MIN-RANGE.
076200     MOVE 5.00010 TO MAX-RANGE.
076300 F-MIN-TEST-23.
076400     COMPUTE WS-NUM = FUNCTION MIN(A, E) + FUNCTION MIN(B, 0).
076500     IF (WS-NUM >= MIN-RANGE) AND
076600        (WS-NUM <= MAX-RANGE) THEN
076700                    PERFORM PASS
076800     ELSE
076900                    MOVE WS-NUM TO COMPUTED-N
077000                    MOVE MIN-RANGE TO CORRECT-MIN
077100                    MOVE MAX-RANGE TO CORRECT-MAX
077200                    PERFORM FAIL.
077300     GO TO F-MIN-WRITE-23.
077400 F-MIN-DELETE-23.
077500     PERFORM  DE-LETE.
077600     GO TO    F-MIN-WRITE-23.
077700 F-MIN-WRITE-23.
077800     MOVE "F-MIN-23" TO PAR-NAME.
077900     PERFORM  PRINT-DETAIL.
078000*****************SPECIAL PERFORM TEST**********************
078100 F-MIN-24.
078200     PERFORM F-MIN-TEST-24
078300       UNTIL FUNCTION MIN(ARG1, 20) < 10.
078400     PERFORM PASS.
078500     GO TO F-MIN-WRITE-24.
078600 F-MIN-TEST-24.
078700     COMPUTE ARG1 = ARG1 - 1.
078800 F-MIN-DELETE-24.
078900     PERFORM  DE-LETE.
079000     GO TO    F-MIN-WRITE-24.
079100 F-MIN-WRITE-24.
079200     MOVE "F-MIN-24" TO PAR-NAME.
079300     PERFORM  PRINT-DETAIL.
079400********************END OF TESTS***************
079500 CCVS-EXIT SECTION.
079600 CCVS-999999.
079700     GO TO CLOSE-FILES.
