000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF122A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function MIDRANGE   *
000900*                                                         *
001000***********************************************************
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.
001400     XXXXX082.
001500 OBJECT-COMPUTER.
001600     XXXXX083.
001700 INPUT-OUTPUT SECTION.
001800 FILE-CONTROL.
001900     SELECT PRINT-FILE ASSIGN TO
002000     XXXXX055.
002100 DATA DIVISION.
002200 FILE SECTION.
002300 FD  PRINT-FILE.
002400 01  PRINT-REC PICTURE X(120).
002500 01  DUMMY-RECORD PICTURE X(120).
002600 WORKING-STORAGE SECTION.
002700***********************************************************
002800* Variables specific to the Intrinsic Function Test IF122A*
002900***********************************************************
003000 01  A                   PIC S9(10)          VALUE 5.
003100 01  B                   PIC S9(10)          VALUE 7.
003200 01  C                   PIC S9(10)          VALUE -4.
003300 01  D                   PIC S9(10)          VALUE 10.
003400 01  E                   PIC S9(5)V9(5)      VALUE 34.26.
003500 01  F                   PIC S9(5)V9(5)      VALUE -8.32.
003600 01  G                   PIC S9(5)V9(5)      VALUE 4.08.
003700 01  H                   PIC S9(5)V9(5)      VALUE -5.3.
003800 01  M                   PIC S9(10)          VALUE 320000.
003900 01  N                   PIC S9(10)          VALUE 650000.
004000 01  O                   PIC S9(10)          VALUE -430000.
004100 01  P                   PIC S9(10)          VALUE 1.
004200 01  Q                   PIC S9(10)          VALUE 3.
004300 01  R                   PIC S9(10)          VALUE 5.
004400 01  ARG1                PIC S9(10)          VALUE 2.
004500 01  ARR                                     VALUE "40537".
004600     02  IND OCCURS 5 TIMES PIC 9.
004700 01  TEMP                PIC S9(10)V9(5).
004800 01  WS-NUM              PIC S9(6)V9(7).
004900 01  MIN-RANGE           PIC S9(5)V9(7).
005000 01  MAX-RANGE           PIC S9(5)V9(7).
005100*
005200**********************************************************
005300*
005400 01  TEST-RESULTS.
005500     02 FILLER                   PIC X      VALUE SPACE.
005600     02 FEATURE                  PIC X(20)  VALUE SPACE.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005900     02 FILLER                   PIC X      VALUE SPACE.
006000     02  PAR-NAME.
006100       03 FILLER                 PIC X(19)  VALUE SPACE.
006200       03  PARDOT-X              PIC X      VALUE SPACE.
006300       03 DOTVALUE               PIC 99     VALUE ZERO.
006400     02 FILLER                   PIC X(8)   VALUE SPACE.
006500     02 RE-MARK                  PIC X(61).
006600 01  TEST-COMPUTED.
006700     02 FILLER                   PIC X(30)  VALUE SPACE.
006800     02 FILLER                   PIC X(17)  VALUE
006900            "       COMPUTED=".
007000     02 COMPUTED-X.
007100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007200     03 COMPUTED-N               REDEFINES COMPUTED-A
007300                                 PIC -9(9).9(9).
007400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007700     03       CM-18V0 REDEFINES COMPUTED-A.
007800         04 COMPUTED-18V0                    PIC -9(18).
007900         04 FILLER                           PIC X.
008000     03 FILLER PIC X(50) VALUE SPACE.
008100 01  TEST-CORRECT.
008200     02 FILLER PIC X(30) VALUE SPACE.
008300     02 FILLER PIC X(17) VALUE "       CORRECT =".
008400     02 CORRECT-X.
008500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009000     03      CR-18V0 REDEFINES CORRECT-A.
009100         04 CORRECT-18V0                     PIC -9(18).
009200         04 FILLER                           PIC X.
009300     03 FILLER PIC X(2) VALUE SPACE.
009400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009500 01  TEST-CORRECT-MIN.
009600     02 FILLER PIC X(30) VALUE SPACE.
009700     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
009800     02 CORRECTMI-X.
009900     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
010000     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
010100     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
010200     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
010300     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
010400     03      CR-18V0 REDEFINES CORRECTMI-A.
010500         04 CORRECTMI-18V0                     PIC -9(18).
010600         04 FILLER                           PIC X.
010700     03 FILLER PIC X(2) VALUE SPACE.
010800     03 FILLER                           PIC X(48) VALUE SPACE.
010900 01  TEST-CORRECT-MAX.
011000     02 FILLER PIC X(30) VALUE SPACE.
011100     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
011200     02 CORRECTMA-X.
011300     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
011400     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
011500     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
011600     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
011700     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
011800     03      CR-18V0 REDEFINES CORRECTMA-A.
011900         04 CORRECTMA-18V0                     PIC -9(18).
012000         04 FILLER                           PIC X.
012100     03 FILLER PIC X(2) VALUE SPACE.
012200     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012300 01  CCVS-C-1.
012400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012500-    "SS  PARAGRAPH-NAME
012600-    "       REMARKS".
012700     02 FILLER                     PIC X(20)    VALUE SPACE.
012800 01  CCVS-C-2.
012900     02 FILLER                     PIC X        VALUE SPACE.
013000     02 FILLER                     PIC X(6)     VALUE "TESTED".
013100     02 FILLER                     PIC X(15)    VALUE SPACE.
013200     02 FILLER                     PIC X(4)     VALUE "FAIL".
013300     02 FILLER                     PIC X(94)    VALUE SPACE.
013400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013500 01  REC-CT                        PIC 99       VALUE ZERO.
013600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014500 01  CCVS-H-1.
014600     02  FILLER                    PIC X(39)    VALUE SPACES.
014700     02  FILLER                    PIC X(42)    VALUE
014800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014900     02  FILLER                    PIC X(39)    VALUE SPACES.
015000 01  CCVS-H-2A.
015100   02  FILLER                        PIC X(40)  VALUE SPACE.
015200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015300   02  FILLER                        PIC XXXX   VALUE
015400     "4.2 ".
015500   02  FILLER                        PIC X(28)  VALUE
015600            " COPY - NOT FOR DISTRIBUTION".
015700   02  FILLER                        PIC X(41)  VALUE SPACE.
015800
015900 01  CCVS-H-2B.
016000   02  FILLER                        PIC X(15)  VALUE
016100            "TEST RESULT OF ".
016200   02  TEST-ID                       PIC X(9).
016300   02  FILLER                        PIC X(4)   VALUE
016400            " IN ".
016500   02  FILLER                        PIC X(12)  VALUE
016600     " HIGH       ".
016700   02  FILLER                        PIC X(22)  VALUE
016800            " LEVEL VALIDATION FOR ".
016900   02  FILLER                        PIC X(58)  VALUE
017000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017100 01  CCVS-H-3.
017200     02  FILLER                      PIC X(34)  VALUE
017300            " FOR OFFICIAL USE ONLY    ".
017400     02  FILLER                      PIC X(58)  VALUE
017500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017600     02  FILLER                      PIC X(28)  VALUE
017700            "  COPYRIGHT   1985 ".
017800 01  CCVS-E-1.
017900     02 FILLER                       PIC X(52)  VALUE SPACE.
018000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018100     02 ID-AGAIN                     PIC X(9).
018200     02 FILLER                       PIC X(45)  VALUE SPACES.
018300 01  CCVS-E-2.
018400     02  FILLER                      PIC X(31)  VALUE SPACE.
018500     02  FILLER                      PIC X(21)  VALUE SPACE.
018600     02 CCVS-E-2-2.
018700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018800         03 FILLER                   PIC X      VALUE SPACE.
018900         03 ENDER-DESC               PIC X(44)  VALUE
019000            "ERRORS ENCOUNTERED".
019100 01  CCVS-E-3.
019200     02  FILLER                      PIC X(22)  VALUE
019300            " FOR OFFICIAL USE ONLY".
019400     02  FILLER                      PIC X(12)  VALUE SPACE.
019500     02  FILLER                      PIC X(58)  VALUE
019600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019700     02  FILLER                      PIC X(13)  VALUE SPACE.
019800     02 FILLER                       PIC X(15)  VALUE
019900             " COPYRIGHT 1985".
020000 01  CCVS-E-4.
020100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020200     02 FILLER                       PIC X(4)   VALUE " OF ".
020300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020400     02 FILLER                       PIC X(40)  VALUE
020500      "  TESTS WERE EXECUTED SUCCESSFULLY".
020600 01  XXINFO.
020700     02 FILLER                       PIC X(19)  VALUE
020800            "*** INFORMATION ***".
020900     02 INFO-TEXT.
021000       04 FILLER                     PIC X(8)   VALUE SPACE.
021100       04 XXCOMPUTED                 PIC X(20).
021200       04 FILLER                     PIC X(5)   VALUE SPACE.
021300       04 XXCORRECT                  PIC X(20).
021400     02 INF-ANSI-REFERENCE           PIC X(48).
021500 01  HYPHEN-LINE.
021600     02 FILLER  PIC IS X VALUE IS SPACE.
021700     02 FILLER  PIC IS X(65)    VALUE IS "************************
021800-    "*****************************************".
021900     02 FILLER  PIC IS X(54)    VALUE IS "************************
022000-    "******************************".
022100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022200     "IF122A".
022300 PROCEDURE DIVISION.
022400 CCVS1 SECTION.
022500 OPEN-FILES.
022600     OPEN     OUTPUT PRINT-FILE.
022700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022800     MOVE    SPACE TO TEST-RESULTS.
022900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023000     GO TO CCVS1-EXIT.
023100 CLOSE-FILES.
023200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023300 TERMINATE-CCVS.
023400     STOP     RUN.
023500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023900     MOVE "****TEST DELETED****" TO RE-MARK.
024000 PRINT-DETAIL.
024100     IF REC-CT NOT EQUAL TO ZERO
024200             MOVE "." TO PARDOT-X
024300             MOVE REC-CT TO DOTVALUE.
024400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024900     MOVE SPACE TO CORRECT-X.
025000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025100     MOVE     SPACE TO RE-MARK.
025200 HEAD-ROUTINE.
025300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025700 COLUMN-NAMES-ROUTINE.
025800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026100 END-ROUTINE.
026200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026300 END-RTN-EXIT.
026400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026500 END-ROUTINE-1.
026600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026800      ADD PASS-COUNTER TO ERROR-HOLD.
026900      MOVE PASS-COUNTER TO CCVS-E-4-1.
027000      MOVE ERROR-HOLD TO CCVS-E-4-2.
027100      MOVE CCVS-E-4 TO CCVS-E-2-2.
027200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027300  END-ROUTINE-12.
027400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027500     IF       ERROR-COUNTER IS EQUAL TO ZERO
027600         MOVE "NO " TO ERROR-TOTAL
027700         ELSE
027800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028000     PERFORM WRITE-LINE.
028100 END-ROUTINE-13.
028200     IF DELETE-COUNTER IS EQUAL TO ZERO
028300         MOVE "NO " TO ERROR-TOTAL  ELSE
028400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028700      IF   INSPECT-COUNTER EQUAL TO ZERO
028800          MOVE "NO " TO ERROR-TOTAL
028900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029300 WRITE-LINE.
029400     ADD 1 TO RECORD-COUNT.
029500Y    IF RECORD-COUNT GREATER 42
029600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029700Y        MOVE SPACE TO DUMMY-RECORD
029800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029900Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030000Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030100Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030200Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030300Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
030400Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
030500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030700Y        MOVE ZERO TO RECORD-COUNT.
030800     PERFORM WRT-LN.
030900 WRT-LN.
031000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031100     MOVE SPACE TO DUMMY-RECORD.
031200 BLANK-LINE-PRINT.
031300     PERFORM WRT-LN.
031400 FAIL-ROUTINE.
031500     IF     COMPUTED-X NOT EQUAL TO SPACE
031600            GO TO FAIL-ROUTINE-WRITE.
031700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032100     MOVE   SPACES TO INF-ANSI-REFERENCE.
032200     GO TO  FAIL-ROUTINE-EX.
032300 FAIL-ROUTINE-WRITE.
032400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
032500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
032600                              CORMA-ANSI-REFERENCE.
032700     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
032800           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
032900           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
033000     ELSE
033100           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
033200     PERFORM WRITE-LINE.
033300     MOVE   SPACES TO COR-ANSI-REFERENCE.
033400 FAIL-ROUTINE-EX. EXIT.
033500 BAIL-OUT.
033600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033800 BAIL-OUT-WRITE.
033900     MOVE CORRECT-A TO XXCORRECT.
034000     MOVE COMPUTED-A TO XXCOMPUTED.
034100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
034200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034300     MOVE   SPACES TO INF-ANSI-REFERENCE.
034400 BAIL-OUT-EX. EXIT.
034500 CCVS1-EXIT.
034600     EXIT.
034700********************************************************
034800*                                                      *
034900*    Intrinsic Function Tests        IF122A - MIDRANGE *
035000*                                                      *
035100********************************************************
035200 SECT-IF122A SECTION.
035300 F-MIDRANGE-INFO.
035400     MOVE     "See ref. A-55 2.26" TO ANSI-REFERENCE.
035500     MOVE     "MIDRANGE Function" TO FEATURE.
035600*****************TEST (a) - SIMPLE TEST*****************
035700 F-MIDRANGE-01.
035800     MOVE ZERO TO WS-NUM.
035900 F-MIDRANGE-TEST-01.
036000     COMPUTE WS-NUM = FUNCTION MIDRANGE(5, -2, -14, 0).
036100     IF (WS-NUM >= -4.50009) AND
036200        (WS-NUM <= -4.49991)
036300                    PERFORM PASS
036400     ELSE
036500                    MOVE WS-NUM TO COMPUTED-N
036600                    MOVE -4.5 TO CORRECT-N
036700                    PERFORM FAIL.
036800     GO TO F-MIDRANGE-WRITE-01.
036900 F-MIDRANGE-DELETE-01.
037000     PERFORM  DE-LETE.
037100     GO TO    F-MIDRANGE-WRITE-01.
037200 F-MIDRANGE-WRITE-01.
037300     MOVE "F-MIDRANGE-01" TO PAR-NAME.
037400     PERFORM  PRINT-DETAIL.
037500*****************TEST (b) - SIMPLE TEST*****************
037600 F-MIDRANGE-02.
037700     EVALUATE FUNCTION MIDRANGE(3.9, -0.3, 8.7, 100.2)
037800     WHEN 49.9490 THRU 49.9510
037900                    PERFORM PASS
038000     WHEN OTHER
038100                    PERFORM FAIL.
038200     GO TO F-MIDRANGE-WRITE-02.
038300 F-MIDRANGE-DELETE-02.
038400     PERFORM  DE-LETE.
038500     GO TO    F-MIDRANGE-WRITE-02.
038600 F-MIDRANGE-WRITE-02.
038700     MOVE "F-MIDRANGE-02" TO PAR-NAME.
038800     PERFORM  PRINT-DETAIL.
038900*****************TEST (c) - SIMPLE TEST*****************
039000 F-MIDRANGE-03.
039100     IF FUNCTION MIDRANGE(A, B, C, D) = 3 THEN
039200                    PERFORM PASS
039300     ELSE
039400                    PERFORM FAIL.
039500     GO TO F-MIDRANGE-WRITE-03.
039600 F-MIDRANGE-DELETE-03.
039700     PERFORM  DE-LETE.
039800     GO TO    F-MIDRANGE-WRITE-03.
039900 F-MIDRANGE-WRITE-03.
040000     MOVE "F-MIDRANGE-03" TO PAR-NAME.
040100     PERFORM  PRINT-DETAIL.
040200*****************TEST (d) - SIMPLE TEST*****************
040300 F-MIDRANGE-04.
040400     MOVE ZERO TO WS-NUM.
040500 F-MIDRANGE-TEST-04.
040600     COMPUTE WS-NUM = FUNCTION MIDRANGE(E, F, G, H).
040700     IF (WS-NUM >= 12.9697) AND
040800        (WS-NUM <= 12.9703)
040900                    PERFORM PASS
041000     ELSE
041100                    MOVE WS-NUM TO COMPUTED-N
041200                    MOVE 12.97 TO CORRECT-N
041300                    PERFORM FAIL.
041400     GO TO F-MIDRANGE-WRITE-04.
041500 F-MIDRANGE-DELETE-04.
041600     PERFORM  DE-LETE.
041700     GO TO    F-MIDRANGE-WRITE-04.
041800 F-MIDRANGE-WRITE-04.
041900     MOVE "F-MIDRANGE-04" TO PAR-NAME.
042000     PERFORM  PRINT-DETAIL.
042100*****************TEST (e) - SIMPLE TEST*****************
042200 F-MIDRANGE-05.
042300     MOVE ZERO TO WS-NUM.
042400 F-MIDRANGE-TEST-05.
042500     COMPUTE WS-NUM = FUNCTION MIDRANGE(10.2, -0.2, 5.6, -15.6).
042600     IF (WS-NUM >= -2.70005) AND
042700        (WS-NUM <= -2.69995)
042800                    PERFORM PASS
042900     ELSE
043000                    MOVE WS-NUM TO COMPUTED-N
043100                    MOVE -2.7 TO CORRECT-N
043200                    PERFORM FAIL.
043300     GO TO F-MIDRANGE-WRITE-05.
043400 F-MIDRANGE-DELETE-05.
043500     PERFORM  DE-LETE.
043600     GO TO    F-MIDRANGE-WRITE-05.
043700 F-MIDRANGE-WRITE-05.
043800     MOVE "F-MIDRANGE-05" TO PAR-NAME.
043900     PERFORM  PRINT-DETAIL.
044000*****************TEST (f) - SIMPLE TEST*****************
044100 F-MIDRANGE-06.
044200     MOVE ZERO TO WS-NUM.
044300 F-MIDRANGE-TEST-06.
044400     COMPUTE WS-NUM = FUNCTION MIDRANGE(A, B, C, D, E, F, G, H).
044500     IF (WS-NUM >= 12.9697) AND
044600        (WS-NUM <= 12.9703)
044700                    PERFORM PASS
044800     ELSE
044900                    MOVE WS-NUM TO COMPUTED-N
045000                    MOVE 12.97 TO CORRECT-N
045100                    PERFORM FAIL.
045200     GO TO F-MIDRANGE-WRITE-06.
045300 F-MIDRANGE-DELETE-06.
045400     PERFORM  DE-LETE.
045500     GO TO    F-MIDRANGE-WRITE-06.
045600 F-MIDRANGE-WRITE-06.
045700     MOVE "F-MIDRANGE-06" TO PAR-NAME.
045800     PERFORM  PRINT-DETAIL.
045900*****************TEST (g) - SIMPLE TEST*****************
046000 F-MIDRANGE-07.
046100     MOVE ZERO TO WS-NUM.
046200 F-MIDRANGE-TEST-07.
046300     COMPUTE WS-NUM = FUNCTION MIDRANGE(2.6 + 30, 4.5 * 2).
046400     IF (WS-NUM >= 20.7996) AND
046500        (WS-NUM <= 20.8004)
046600                    PERFORM PASS
046700     ELSE
046800                    MOVE WS-NUM TO COMPUTED-N
046900                    MOVE 20.8 TO CORRECT-N
047000                    PERFORM FAIL.
047100     GO TO F-MIDRANGE-WRITE-07.
047200 F-MIDRANGE-DELETE-07.
047300     PERFORM  DE-LETE.
047400     GO TO    F-MIDRANGE-WRITE-07.
047500 F-MIDRANGE-WRITE-07.
047600     MOVE "F-MIDRANGE-07" TO PAR-NAME.
047700     PERFORM  PRINT-DETAIL.
047800*****************TEST (h) - SIMPLE TEST*****************
047900 F-MIDRANGE-08.
048000     MOVE ZERO TO WS-NUM.
048100 F-MIDRANGE-TEST-08.
048200     COMPUTE WS-NUM = FUNCTION MIDRANGE(IND(1), IND(2),
048300                                                   IND(3)).
048400     IF (WS-NUM >= 2.49995) AND
048500        (WS-NUM <= 2.50005)
048600                    PERFORM PASS
048700     ELSE
048800                    MOVE WS-NUM TO COMPUTED-N
048900                    MOVE 2.5 TO CORRECT-N
049000                    PERFORM FAIL.
049100     GO TO F-MIDRANGE-WRITE-08.
049200 F-MIDRANGE-DELETE-08.
049300     PERFORM  DE-LETE.
049400     GO TO    F-MIDRANGE-WRITE-08.
049500 F-MIDRANGE-WRITE-08.
049600     MOVE "F-MIDRANGE-08" TO PAR-NAME.
049700     PERFORM  PRINT-DETAIL.
049800*****************TEST (i) - SIMPLE TEST*****************
049900 F-MIDRANGE-09.
050000     MOVE ZERO TO WS-NUM.
050100 F-MIDRANGE-TEST-09.
050200     COMPUTE WS-NUM = FUNCTION MIDRANGE(IND(P), IND(Q),
050300                                                  IND(R)).
050400     IF (WS-NUM >= 5.49989) AND
050500        (WS-NUM <= 5.50011)
050600                    PERFORM PASS
050700     ELSE
050800                    MOVE WS-NUM TO COMPUTED-N
050900                    MOVE 5.5 TO CORRECT-N
051000                    PERFORM FAIL.
051100     GO TO F-MIDRANGE-WRITE-09.
051200 F-MIDRANGE-DELETE-09.
051300     PERFORM  DE-LETE.
051400     GO TO    F-MIDRANGE-WRITE-09.
051500 F-MIDRANGE-WRITE-09.
051600     MOVE "F-MIDRANGE-09" TO PAR-NAME.
051700     PERFORM  PRINT-DETAIL.
051800*****************TEST (j) - SIMPLE TEST*****************
051900 F-MIDRANGE-10.
052000     MOVE ZERO TO WS-NUM.
052100 F-MIDRANGE-TEST-10.
052200     COMPUTE WS-NUM = FUNCTION MIDRANGE(IND(ALL)).
052300     IF (WS-NUM >= 3.49993) AND
052400        (WS-NUM <= 3.50007)
052500                    PERFORM PASS
052600     ELSE
052700                    MOVE WS-NUM TO COMPUTED-N
052800                    MOVE 3.5 TO CORRECT-N
052900                    PERFORM FAIL.
053000     GO TO F-MIDRANGE-WRITE-10.
053100 F-MIDRANGE-DELETE-10.
053200     PERFORM  DE-LETE.
053300     GO TO    F-MIDRANGE-WRITE-10.
053400 F-MIDRANGE-WRITE-10.
053500     MOVE "F-MIDRANGE-10" TO PAR-NAME.
053600     PERFORM  PRINT-DETAIL.
053700*****************TEST (l) - SIMPLE TEST*****************
053800 F-MIDRANGE-12.
053900     MOVE ZERO TO WS-NUM.
054000 F-MIDRANGE-TEST-12.
054100     COMPUTE WS-NUM = FUNCTION MIDRANGE(M, N, O).
054200     IF WS-NUM = 110000 THEN
054300                    PERFORM PASS
054400     ELSE
054500                    MOVE WS-NUM TO COMPUTED-N
054600                    MOVE 110000 TO CORRECT-N
054700                    PERFORM FAIL.
054800     GO TO F-MIDRANGE-WRITE-12.
054900 F-MIDRANGE-DELETE-12.
055000     PERFORM  DE-LETE.
055100     GO TO    F-MIDRANGE-WRITE-12.
055200 F-MIDRANGE-WRITE-12.
055300     MOVE "F-MIDRANGE-12" TO PAR-NAME.
055400     PERFORM  PRINT-DETAIL.
055500*****************TEST (m) - SIMPLE TEST*****************
055600 F-MIDRANGE-13.
055700     MOVE ZERO TO WS-NUM.
055800 F-MIDRANGE-TEST-13.
055900     COMPUTE WS-NUM = FUNCTION MIDRANGE(A, 5, A).
056000     IF WS-NUM = 5 THEN
056100                    PERFORM PASS
056200     ELSE
056300                    MOVE WS-NUM TO COMPUTED-N
056400                    MOVE 5 TO CORRECT-N
056500                    PERFORM FAIL.
056600     GO TO F-MIDRANGE-WRITE-13.
056700 F-MIDRANGE-DELETE-13.
056800     PERFORM  DE-LETE.
056900     GO TO    F-MIDRANGE-WRITE-13.
057000 F-MIDRANGE-WRITE-13.
057100     MOVE "F-MIDRANGE-13" TO PAR-NAME.
057200     PERFORM  PRINT-DETAIL.
057300*****************TEST (a) - COMPLEX TEST****************
057400 F-MIDRANGE-14.
057500     MOVE ZERO TO WS-NUM.
057600     MOVE  22.4995   TO MIN-RANGE.
057700     MOVE  22.5004 TO MAX-RANGE.
057800 F-MIDRANGE-TEST-14.
057900     COMPUTE WS-NUM = FUNCTION MIDRANGE(E, 9 * A, 0, B / 2).
058000     IF (WS-NUM >= MIN-RANGE) AND
058100        (WS-NUM <= MAX-RANGE) THEN
058200                    PERFORM PASS
058300     ELSE
058400                    MOVE WS-NUM TO COMPUTED-N
058500                    MOVE MIN-RANGE TO CORRECT-MIN
058600                    MOVE MAX-RANGE TO CORRECT-MAX
058700                    PERFORM FAIL.
058800     GO TO F-MIDRANGE-WRITE-14.
058900 F-MIDRANGE-DELETE-14.
059000     PERFORM  DE-LETE.
059100     GO TO    F-MIDRANGE-WRITE-14.
059200 F-MIDRANGE-WRITE-14.
059300     MOVE "F-MIDRANGE-14" TO PAR-NAME.
059400     PERFORM  PRINT-DETAIL.
059500*****************TEST (b) - COMPLEX TEST****************
059600 F-MIDRANGE-15.
059700     MOVE ZERO TO WS-NUM.
059800     MOVE 83.9983 TO MIN-RANGE.
059900     MOVE 84.0017 TO MAX-RANGE.
060000 F-MIDRANGE-TEST-15.
060100     COMPUTE WS-NUM = FUNCTION MIDRANGE(A, B) + 78.
060200     IF (WS-NUM >= MIN-RANGE) AND
060300        (WS-NUM <= MAX-RANGE) THEN
060400                    PERFORM PASS
060500     ELSE
060600                    MOVE WS-NUM TO COMPUTED-N
060700                    MOVE MIN-RANGE TO CORRECT-MIN
060800                    MOVE MAX-RANGE TO CORRECT-MAX
060900                    PERFORM FAIL.
061000     GO TO F-MIDRANGE-WRITE-15.
061100 F-MIDRANGE-DELETE-15.
061200     PERFORM  DE-LETE.
061300     GO TO    F-MIDRANGE-WRITE-15.
061400 F-MIDRANGE-WRITE-15.
061500     MOVE "F-MIDRANGE-15" TO PAR-NAME.
061600     PERFORM  PRINT-DETAIL.
061700*****************TEST (c) - COMPLEX TEST****************
061800 F-MIDRANGE-16.
061900     MOVE ZERO TO WS-NUM.
062000     MOVE 2.49995 TO MIN-RANGE.
062100     MOVE 2.50005 TO MAX-RANGE.
062200 F-MIDRANGE-TEST-16.
062300     COMPUTE WS-NUM = FUNCTION MIDRANGE(A, B) +
062400                      FUNCTION MIDRANGE(-2.6, -4.4).
062500     IF (WS-NUM >= MIN-RANGE) AND
062600        (WS-NUM <= MAX-RANGE) THEN
062700                    PERFORM PASS
062800     ELSE
062900                    MOVE WS-NUM TO COMPUTED-N
063000                    MOVE MIN-RANGE TO CORRECT-MIN
063100                    MOVE MAX-RANGE TO CORRECT-MAX
063200                    PERFORM FAIL.
063300     GO TO F-MIDRANGE-WRITE-16.
063400 F-MIDRANGE-DELETE-16.
063500     PERFORM  DE-LETE.
063600     GO TO    F-MIDRANGE-WRITE-16.
063700 F-MIDRANGE-WRITE-16.
063800     MOVE "F-MIDRANGE-16" TO PAR-NAME.
063900     PERFORM  PRINT-DETAIL.
064000*****************TEST (d) - COMPLEX TEST****************
064100 F-MIDRANGE-17.
064200     MOVE ZERO TO WS-NUM.
064300     MOVE 3.49993 TO MIN-RANGE.
064400     MOVE 3.50007 TO MAX-RANGE.
064500 F-MIDRANGE-TEST-17.
064600     COMPUTE WS-NUM =
064700             FUNCTION MIDRANGE(FUNCTION MIDRANGE(1, 3), 5).
064800     IF (WS-NUM >= MIN-RANGE) AND
064900        (WS-NUM <= MAX-RANGE) THEN
065000                    PERFORM PASS
065100     ELSE
065200                    MOVE WS-NUM TO COMPUTED-N
065300                    MOVE MIN-RANGE TO CORRECT-MIN
065400                    MOVE MAX-RANGE TO CORRECT-MAX
065500                    PERFORM FAIL.
065600     GO TO F-MIDRANGE-WRITE-17.
065700 F-MIDRANGE-DELETE-17.
065800     PERFORM  DE-LETE.
065900     GO TO    F-MIDRANGE-WRITE-17.
066000 F-MIDRANGE-WRITE-17.
066100     MOVE "F-MIDRANGE-17" TO PAR-NAME.
066200     PERFORM  PRINT-DETAIL.
066300*****************SPECIAL PERFORM TEST**********************
066400 F-MIDRANGE-18.
066500     PERFORM F-MIDRANGE-TEST-18
066600       UNTIL FUNCTION MIDRANGE(1, ARG1) > 10.
066700     PERFORM PASS.
066800     GO TO F-MIDRANGE-WRITE-18.
066900 F-MIDRANGE-TEST-18.
067000     COMPUTE ARG1 = ARG1 + 1.
067100 F-MIDRANGE-DELETE-18.
067200     PERFORM  DE-LETE.
067300     GO TO    F-MIDRANGE-WRITE-18.
067400 F-MIDRANGE-WRITE-18.
067500     MOVE "F-MIDRANGE-18" TO PAR-NAME.
067600     PERFORM  PRINT-DETAIL.
067700********************END OF TESTS***************
067800 CCVS-EXIT SECTION.
067900 CCVS-999999.
068000     GO TO CLOSE-FILES.
