000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF120A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function MEAN.      *
000900*                                                         *
001000***********************************************************
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.
001400     XXXXX082.
001500 OBJECT-COMPUTER.
001600     XXXXX083.
001700 INPUT-OUTPUT SECTION.
001800 FILE-CONTROL.
001900     SELECT PRINT-FILE ASSIGN TO
002000     XXXXX055.
002100 DATA DIVISION.
002200 FILE SECTION.
002300 FD  PRINT-FILE.
002400 01  PRINT-REC PICTURE X(120).
002500 01  DUMMY-RECORD PICTURE X(120).
002600 WORKING-STORAGE SECTION.
002700***********************************************************
002800* Variables specific to the Intrinsic Function Test IF120A*
002900***********************************************************
003000 01  A                   PIC S9(10)          VALUE 5.
003100 01  B                   PIC S9(10)          VALUE 7.
003200 01  C                   PIC S9(10)          VALUE -4.
003300 01  D                   PIC S9(10)          VALUE 10.
003400 01  E                   PIC S9(5)V9(5)      VALUE 34.26.
003500 01  F                   PIC S9(5)V9(5)      VALUE -8.32.
003600 01  G                   PIC S9(5)V9(5)      VALUE 4.08.
003700 01  H                   PIC S9(5)V9(5)      VALUE -5.3.
003800 01  M                   PIC S9(10)          VALUE 320000.
003900 01  N                   PIC S9(10)          VALUE 650000.
004000 01  O                   PIC S9(10)          VALUE -430000.
004100 01  P                   PIC S9(10)          VALUE 1.
004200 01  Q                   PIC S9(10)          VALUE 3.
004300 01  R                   PIC S9(10)          VALUE 5.
004400 01  ARG1                PIC S9(10)          VALUE 1.
004500 01  ARG2                PIC S9(10)          VALUE 1.
004600 01  ARR                                     VALUE "40537".
004700     02  IND OCCURS 5 TIMES PIC 9.
004800 01  TEMP                PIC S9(10)V9(5).
004900 01  WS-NUM              PIC S9(6)V9(6).
005000 01  MIN-RANGE           PIC S9(5)V9(7).
005100 01  MAX-RANGE           PIC S9(5)V9(7).
005200*
005300**********************************************************
005400*
005500 01  TEST-RESULTS.
005600     02 FILLER                   PIC X      VALUE SPACE.
005700     02 FEATURE                  PIC X(20)  VALUE SPACE.
005800     02 FILLER                   PIC X      VALUE SPACE.
005900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006000     02 FILLER                   PIC X      VALUE SPACE.
006100     02  PAR-NAME.
006200       03 FILLER                 PIC X(19)  VALUE SPACE.
006300       03  PARDOT-X              PIC X      VALUE SPACE.
006400       03 DOTVALUE               PIC 99     VALUE ZERO.
006500     02 FILLER                   PIC X(8)   VALUE SPACE.
006600     02 RE-MARK                  PIC X(61).
006700 01  TEST-COMPUTED.
006800     02 FILLER                   PIC X(30)  VALUE SPACE.
006900     02 FILLER                   PIC X(17)  VALUE
007000            "       COMPUTED=".
007100     02 COMPUTED-X.
007200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007300     03 COMPUTED-N               REDEFINES COMPUTED-A
007400                                 PIC -9(9).9(9).
007500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007800     03       CM-18V0 REDEFINES COMPUTED-A.
007900         04 COMPUTED-18V0                    PIC -9(18).
008000         04 FILLER                           PIC X.
008100     03 FILLER PIC X(50) VALUE SPACE.
008200 01  TEST-CORRECT.
008300     02 FILLER PIC X(30) VALUE SPACE.
008400     02 FILLER PIC X(17) VALUE "       CORRECT =".
008500     02 CORRECT-X.
008600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009100     03      CR-18V0 REDEFINES CORRECT-A.
009200         04 CORRECT-18V0                     PIC -9(18).
009300         04 FILLER                           PIC X.
009400     03 FILLER PIC X(2) VALUE SPACE.
009500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009600 01  TEST-CORRECT-MIN.
009700     02 FILLER PIC X(30) VALUE SPACE.
009800     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
009900     02 CORRECTMI-X.
010000     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
010100     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
010200     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
010300     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
010400     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
010500     03      CR-18V0 REDEFINES CORRECTMI-A.
010600         04 CORRECTMI-18V0                     PIC -9(18).
010700         04 FILLER                           PIC X.
010800     03 FILLER PIC X(2) VALUE SPACE.
010900     03 FILLER                           PIC X(48) VALUE SPACE.
011000 01  TEST-CORRECT-MAX.
011100     02 FILLER PIC X(30) VALUE SPACE.
011200     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
011300     02 CORRECTMA-X.
011400     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
011500     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
011600     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
011700     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
011800     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
011900     03      CR-18V0 REDEFINES CORRECTMA-A.
012000         04 CORRECTMA-18V0                     PIC -9(18).
012100         04 FILLER                           PIC X.
012200     03 FILLER PIC X(2) VALUE SPACE.
012300     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012400 01  CCVS-C-1.
012500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012600-    "SS  PARAGRAPH-NAME
012700-    "       REMARKS".
012800     02 FILLER                     PIC X(20)    VALUE SPACE.
012900 01  CCVS-C-2.
013000     02 FILLER                     PIC X        VALUE SPACE.
013100     02 FILLER                     PIC X(6)     VALUE "TESTED".
013200     02 FILLER                     PIC X(15)    VALUE SPACE.
013300     02 FILLER                     PIC X(4)     VALUE "FAIL".
013400     02 FILLER                     PIC X(94)    VALUE SPACE.
013500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013600 01  REC-CT                        PIC 99       VALUE ZERO.
013700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
014000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014600 01  CCVS-H-1.
014700     02  FILLER                    PIC X(39)    VALUE SPACES.
014800     02  FILLER                    PIC X(42)    VALUE
014900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
015000     02  FILLER                    PIC X(39)    VALUE SPACES.
015100 01  CCVS-H-2A.
015200   02  FILLER                        PIC X(40)  VALUE SPACE.
015300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015400   02  FILLER                        PIC XXXX   VALUE
015500     "4.2 ".
015600   02  FILLER                        PIC X(28)  VALUE
015700            " COPY - NOT FOR DISTRIBUTION".
015800   02  FILLER                        PIC X(41)  VALUE SPACE.
015900
016000 01  CCVS-H-2B.
016100   02  FILLER                        PIC X(15)  VALUE
016200            "TEST RESULT OF ".
016300   02  TEST-ID                       PIC X(9).
016400   02  FILLER                        PIC X(4)   VALUE
016500            " IN ".
016600   02  FILLER                        PIC X(12)  VALUE
016700     " HIGH       ".
016800   02  FILLER                        PIC X(22)  VALUE
016900            " LEVEL VALIDATION FOR ".
017000   02  FILLER                        PIC X(58)  VALUE
017100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017200 01  CCVS-H-3.
017300     02  FILLER                      PIC X(34)  VALUE
017400            " FOR OFFICIAL USE ONLY    ".
017500     02  FILLER                      PIC X(58)  VALUE
017600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017700     02  FILLER                      PIC X(28)  VALUE
017800            "  COPYRIGHT   1985 ".
017900 01  CCVS-E-1.
018000     02 FILLER                       PIC X(52)  VALUE SPACE.
018100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018200     02 ID-AGAIN                     PIC X(9).
018300     02 FILLER                       PIC X(45)  VALUE SPACES.
018400 01  CCVS-E-2.
018500     02  FILLER                      PIC X(31)  VALUE SPACE.
018600     02  FILLER                      PIC X(21)  VALUE SPACE.
018700     02 CCVS-E-2-2.
018800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018900         03 FILLER                   PIC X      VALUE SPACE.
019000         03 ENDER-DESC               PIC X(44)  VALUE
019100            "ERRORS ENCOUNTERED".
019200 01  CCVS-E-3.
019300     02  FILLER                      PIC X(22)  VALUE
019400            " FOR OFFICIAL USE ONLY".
019500     02  FILLER                      PIC X(12)  VALUE SPACE.
019600     02  FILLER                      PIC X(58)  VALUE
019700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019800     02  FILLER                      PIC X(13)  VALUE SPACE.
019900     02 FILLER                       PIC X(15)  VALUE
020000             " COPYRIGHT 1985".
020100 01  CCVS-E-4.
020200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020300     02 FILLER                       PIC X(4)   VALUE " OF ".
020400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020500     02 FILLER                       PIC X(40)  VALUE
020600      "  TESTS WERE EXECUTED SUCCESSFULLY".
020700 01  XXINFO.
020800     02 FILLER                       PIC X(19)  VALUE
020900            "*** INFORMATION ***".
021000     02 INFO-TEXT.
021100       04 FILLER                     PIC X(8)   VALUE SPACE.
021200       04 XXCOMPUTED                 PIC X(20).
021300       04 FILLER                     PIC X(5)   VALUE SPACE.
021400       04 XXCORRECT                  PIC X(20).
021500     02 INF-ANSI-REFERENCE           PIC X(48).
021600 01  HYPHEN-LINE.
021700     02 FILLER  PIC IS X VALUE IS SPACE.
021800     02 FILLER  PIC IS X(65)    VALUE IS "************************
021900-    "*****************************************".
022000     02 FILLER  PIC IS X(54)    VALUE IS "************************
022100-    "******************************".
022200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022300     "IF120A".
022400 PROCEDURE DIVISION.
022500 CCVS1 SECTION.
022600 OPEN-FILES.
022700     OPEN     OUTPUT PRINT-FILE.
022800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022900     MOVE    SPACE TO TEST-RESULTS.
023000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023100     GO TO CCVS1-EXIT.
023200 CLOSE-FILES.
023300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023400 TERMINATE-CCVS.
023500     STOP     RUN.
023600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
024000     MOVE "****TEST DELETED****" TO RE-MARK.
024100 PRINT-DETAIL.
024200     IF REC-CT NOT EQUAL TO ZERO
024300             MOVE "." TO PARDOT-X
024400             MOVE REC-CT TO DOTVALUE.
024500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
025000     MOVE SPACE TO CORRECT-X.
025100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025200     MOVE     SPACE TO RE-MARK.
025300 HEAD-ROUTINE.
025400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025800 COLUMN-NAMES-ROUTINE.
025900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026200 END-ROUTINE.
026300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026400 END-RTN-EXIT.
026500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026600 END-ROUTINE-1.
026700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026900      ADD PASS-COUNTER TO ERROR-HOLD.
027000      MOVE PASS-COUNTER TO CCVS-E-4-1.
027100      MOVE ERROR-HOLD TO CCVS-E-4-2.
027200      MOVE CCVS-E-4 TO CCVS-E-2-2.
027300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027400  END-ROUTINE-12.
027500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027600     IF       ERROR-COUNTER IS EQUAL TO ZERO
027700         MOVE "NO " TO ERROR-TOTAL
027800         ELSE
027900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
028000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028100     PERFORM WRITE-LINE.
028200 END-ROUTINE-13.
028300     IF DELETE-COUNTER IS EQUAL TO ZERO
028400         MOVE "NO " TO ERROR-TOTAL  ELSE
028500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028800      IF   INSPECT-COUNTER EQUAL TO ZERO
028900          MOVE "NO " TO ERROR-TOTAL
029000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029400 WRITE-LINE.
029500     ADD 1 TO RECORD-COUNT.
029600Y    IF RECORD-COUNT GREATER 42
029700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029800Y        MOVE SPACE TO DUMMY-RECORD
029900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
030000Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030100Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030200Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030300Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030400Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
030500Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
030600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030800Y        MOVE ZERO TO RECORD-COUNT.
030900     PERFORM WRT-LN.
031000 WRT-LN.
031100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031200     MOVE SPACE TO DUMMY-RECORD.
031300 BLANK-LINE-PRINT.
031400     PERFORM WRT-LN.
031500 FAIL-ROUTINE.
031600     IF     COMPUTED-X NOT EQUAL TO SPACE
031700            GO TO FAIL-ROUTINE-WRITE.
031800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032200     MOVE   SPACES TO INF-ANSI-REFERENCE.
032300     GO TO  FAIL-ROUTINE-EX.
032400 FAIL-ROUTINE-WRITE.
032500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
032600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
032700                              CORMA-ANSI-REFERENCE.
032800     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
032900           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
033000           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
033100     ELSE
033200           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
033300     PERFORM WRITE-LINE.
033400     MOVE   SPACES TO COR-ANSI-REFERENCE.
033500 FAIL-ROUTINE-EX. EXIT.
033600 BAIL-OUT.
033700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033900 BAIL-OUT-WRITE.
034000     MOVE CORRECT-A TO XXCORRECT.
034100     MOVE COMPUTED-A TO XXCOMPUTED.
034200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
034300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034400     MOVE   SPACES TO INF-ANSI-REFERENCE.
034500 BAIL-OUT-EX. EXIT.
034600 CCVS1-EXIT.
034700     EXIT.
034800********************************************************
034900*                                                      *
035000*    Intrinsic Function Tests         IF120A - MEAN    *
035100*                                                      *
035200********************************************************
035300 SECT-IF120A SECTION.
035400 F-MEAN-TEST-INFO.
035500     MOVE     "See ref. A-53 2.24" TO ANSI-REFERENCE.
035600     MOVE     "MEAN Function" TO FEATURE.
035700*****************TEST (a) - SIMPLE TEST*****************
035800 F-MEAN-01.
035900     MOVE ZERO TO WS-NUM.
036000 F-MEAN-TEST-01.
036100     COMPUTE WS-NUM = FUNCTION MEAN(5, -2, -14, 0).
036200     IF (WS-NUM >= -2.75006) AND
036300        (WS-NUM <= -2.74995)
036400                    PERFORM PASS
036500     ELSE
036600                    MOVE WS-NUM TO COMPUTED-N
036700                    MOVE -2.75 TO CORRECT-N
036800                    PERFORM FAIL.
036900     GO TO F-MEAN-WRITE-01.
037000 F-MEAN-DELETE-01.
037100     PERFORM  DE-LETE.
037200     GO TO    F-MEAN-WRITE-01.
037300 F-MEAN-WRITE-01.
037400     MOVE "F-MEAN-01" TO PAR-NAME.
037500     PERFORM  PRINT-DETAIL.
037600*****************TEST (b) - SIMPLE TEST*****************
037700 F-MEAN-02.
037800     EVALUATE FUNCTION MEAN(3.9, -0.3, 8.7, 100.2)
037900     WHEN 28.1244 THRU 28.1256
038000                    PERFORM PASS
038100     WHEN OTHER
038200                    PERFORM FAIL.
038300     GO TO F-MEAN-WRITE-02.
038400 F-MEAN-DELETE-02.
038500     PERFORM  DE-LETE.
038600     GO TO    F-MEAN-WRITE-02.
038700 F-MEAN-WRITE-02.
038800     MOVE "F-MEAN-02" TO PAR-NAME.
038900     PERFORM  PRINT-DETAIL.
039000*****************TEST (c) - SIMPLE TEST*****************
039100 F-MEAN-03.
039200     IF (FUNCTION MEAN(A, B, C, D) >= 4.49991) AND
039300        (FUNCTION MEAN(A, B, C, D) <= 4.50009)
039400                    PERFORM PASS
039500     ELSE
039600                    PERFORM FAIL.
039700     GO TO F-MEAN-WRITE-03.
039800 F-MEAN-DELETE-03.
039900     PERFORM  DE-LETE.
040000     GO TO    F-MEAN-WRITE-03.
040100 F-MEAN-WRITE-03.
040200     MOVE "F-MEAN-03" TO PAR-NAME.
040300     PERFORM  PRINT-DETAIL.
040400*****************TEST (d) - SIMPLE TEST*****************
040500 F-MEAN-04.
040600     MOVE ZERO TO WS-NUM.
040700 F-MEAN-TEST-04.
040800     COMPUTE WS-NUM = FUNCTION MEAN(E, F, G, H).
040900     IF (WS-NUM >= 6.17988) AND
041000        (WS-NUM <= 6.18012)
041100                    PERFORM PASS
041200     ELSE
041300                    MOVE WS-NUM TO COMPUTED-N
041400                    MOVE 6.18 TO CORRECT-N
041500                    PERFORM FAIL.
041600     GO TO F-MEAN-WRITE-04.
041700 F-MEAN-DELETE-04.
041800     PERFORM  DE-LETE.
041900     GO TO    F-MEAN-WRITE-04.
042000 F-MEAN-WRITE-04.
042100     MOVE "F-MEAN-04" TO PAR-NAME.
042200     PERFORM  PRINT-DETAIL.
042300*****************TEST (e) - SIMPLE TEST*****************
042400 F-MEAN-05.
042500     MOVE ZERO TO WS-NUM.
042600 F-MEAN-TEST-05.
042700     COMPUTE WS-NUM = FUNCTION MEAN(10.2, -0.2, 5.6, -15.6).
042800     IF (WS-NUM >= -0.000020) AND
042900        (WS-NUM <= 0.000020)
043000                    PERFORM PASS
043100     ELSE
043200                    MOVE WS-NUM TO COMPUTED-N
043300                    MOVE 0.0 TO CORRECT-N
043400                    PERFORM FAIL.
043500     GO TO F-MEAN-WRITE-05.
043600 F-MEAN-DELETE-05.
043700     PERFORM  DE-LETE.
043800     GO TO    F-MEAN-WRITE-05.
043900 F-MEAN-WRITE-05.
044000     MOVE "F-MEAN-05" TO PAR-NAME.
044100     PERFORM  PRINT-DETAIL.
044200*****************TEST (f) - SIMPLE TEST*****************
044300 F-MEAN-06.
044400     MOVE ZERO TO WS-NUM.
044500 F-MEAN-TEST-06.
044600     COMPUTE WS-NUM = FUNCTION MEAN(A, B, C, D, E, F, G, H).
044700     IF (WS-NUM >= 5.33989) AND
044800        (WS-NUM <= 5.34011)
044900                    PERFORM PASS
045000     ELSE
045100                    MOVE WS-NUM TO COMPUTED-N
045200                    MOVE 5.34 TO CORRECT-N
045300                    PERFORM FAIL.
045400     GO TO F-MEAN-WRITE-06.
045500 F-MEAN-DELETE-06.
045600     PERFORM  DE-LETE.
045700     GO TO    F-MEAN-WRITE-06.
045800 F-MEAN-WRITE-06.
045900     MOVE "F-MEAN-06" TO PAR-NAME.
046000     PERFORM  PRINT-DETAIL.
046100*****************TEST (g) - SIMPLE TEST*****************
046200 F-MEAN-07.
046300     MOVE ZERO TO WS-NUM.
046400 F-MEAN-TEST-07.
046500     COMPUTE WS-NUM = FUNCTION MEAN(IND(2), IND(1), IND(3)).
046600     IF (WS-NUM >= 2.99994) AND
046700        (WS-NUM <= 3.00006)
046800                    PERFORM PASS
046900     ELSE
047000                    MOVE WS-NUM TO COMPUTED-N
047100                    MOVE 3.0 TO CORRECT-N
047200                    PERFORM FAIL.
047300     GO TO F-MEAN-WRITE-07.
047400 F-MEAN-DELETE-07.
047500     PERFORM  DE-LETE.
047600     GO TO    F-MEAN-WRITE-07.
047700 F-MEAN-WRITE-07.
047800     MOVE "F-MEAN-07" TO PAR-NAME.
047900     PERFORM  PRINT-DETAIL.
048000*****************TEST (h) - SIMPLE TEST*****************
048100 F-MEAN-08.
048200     MOVE ZERO TO WS-NUM.
048300 F-MEAN-TEST-08.
048400     COMPUTE WS-NUM = FUNCTION MEAN(IND(P), IND(Q), IND(R)).
048500     IF (WS-NUM >= 5.33323) AND
048600        (WS-NUM <= 5.33344)
048700                    PERFORM PASS
048800     ELSE
048900                    MOVE WS-NUM TO COMPUTED-N
049000                    MOVE 5.333 TO CORRECT-N
049100                    PERFORM FAIL.
049200     GO TO F-MEAN-WRITE-08.
049300 F-MEAN-DELETE-08.
049400     PERFORM  DE-LETE.
049500     GO TO    F-MEAN-WRITE-08.
049600 F-MEAN-WRITE-08.
049700     MOVE "F-MEAN-08" TO PAR-NAME.
049800     PERFORM  PRINT-DETAIL.
049900*****************TEST (i) - SIMPLE TEST*****************
050000 F-MEAN-09.
050100     MOVE ZERO TO WS-NUM.
050200 F-MEAN-TEST-09.
050300     COMPUTE WS-NUM = FUNCTION MEAN(IND(ALL)).
050400     IF (WS-NUM >= 3.79992) AND
050500        (WS-NUM <= 3.80008)
050600                    PERFORM PASS
050700     ELSE
050800                    MOVE WS-NUM TO COMPUTED-N
050900                    MOVE 3.8 TO CORRECT-N
051000                    PERFORM FAIL.
051100     GO TO F-MEAN-WRITE-09.
051200 F-MEAN-DELETE-09.
051300     PERFORM  DE-LETE.
051400     GO TO    F-MEAN-WRITE-09.
051500 F-MEAN-WRITE-09.
051600     MOVE "F-MEAN-09" TO PAR-NAME.
051700     PERFORM  PRINT-DETAIL.
051800*****************TEST (k) - SIMPLE TEST*****************
051900 F-MEAN-11.
052000     MOVE ZERO TO WS-NUM.
052100 F-MEAN-TEST-11.
052200     COMPUTE WS-NUM = FUNCTION MEAN(M, N, O).
052300     IF WS-NUM = 180000  THEN
052400                    PERFORM PASS
052500     ELSE
052600                    MOVE WS-NUM TO COMPUTED-N
052700                    MOVE 180000  TO CORRECT-N
052800                    PERFORM FAIL.
052900     GO TO F-MEAN-WRITE-11.
053000 F-MEAN-DELETE-11.
053100     PERFORM  DE-LETE.
053200     GO TO    F-MEAN-WRITE-11.
053300 F-MEAN-WRITE-11.
053400     MOVE "F-MEAN-11" TO PAR-NAME.
053500     PERFORM  PRINT-DETAIL.
053600*****************TEST (l) - SIMPLE TEST*****************
053700 F-MEAN-12.
053800     MOVE ZERO TO WS-NUM.
053900 F-MEAN-TEST-12.
054000     COMPUTE WS-NUM = FUNCTION MEAN(A, 5, A).
054100     IF WS-NUM = 5    THEN
054200                    PERFORM PASS
054300     ELSE
054400                    MOVE WS-NUM TO COMPUTED-N
054500                    MOVE 5    TO CORRECT-N
054600                    PERFORM FAIL.
054700     GO TO F-MEAN-WRITE-12.
054800 F-MEAN-DELETE-12.
054900     PERFORM  DE-LETE.
055000     GO TO    F-MEAN-WRITE-12.
055100 F-MEAN-WRITE-12.
055200     MOVE "F-MEAN-12" TO PAR-NAME.
055300     PERFORM  PRINT-DETAIL.
055400*****************TEST (a) - COMPLEX TEST****************
055500 F-MEAN-13.
055600     MOVE ZERO TO WS-NUM.
055700     MOVE  20.6896 TO MIN-RANGE.
055800     MOVE  20.6904 TO MAX-RANGE.
055900 F-MEAN-TEST-13.
056000     COMPUTE WS-NUM = FUNCTION MEAN(E, 9 * A, 0, B / 2).
056100     IF (WS-NUM >= MIN-RANGE) AND
056200        (WS-NUM <= MAX-RANGE) THEN
056300                    PERFORM PASS
056400     ELSE
056500                    MOVE WS-NUM TO COMPUTED-N
056600                    MOVE MIN-RANGE TO CORRECT-MIN
056700                    MOVE MAX-RANGE TO CORRECT-MAX
056800                    PERFORM FAIL.
056900     GO TO F-MEAN-WRITE-13.
057000 F-MEAN-DELETE-13.
057100     PERFORM  DE-LETE.
057200     GO TO    F-MEAN-WRITE-13.
057300 F-MEAN-WRITE-13.
057400     MOVE "F-MEAN-13" TO PAR-NAME.
057500     PERFORM  PRINT-DETAIL.
057600*****************TEST (b) - COMPLEX TEST****************
057700 F-MEAN-14.
057800     MOVE ZERO TO WS-NUM.
057900     MOVE 83.9983 TO MIN-RANGE.
058000     MOVE 84.0017 TO MAX-RANGE.
058100 F-MEAN-TEST-14.
058200     COMPUTE WS-NUM = FUNCTION MEAN(A, B) + 78.
058300     IF (WS-NUM >= MIN-RANGE) AND
058400        (WS-NUM <= MAX-RANGE) THEN
058500                    PERFORM PASS
058600     ELSE
058700                    MOVE WS-NUM TO COMPUTED-N
058800                    MOVE MIN-RANGE TO CORRECT-MIN
058900                    MOVE MAX-RANGE TO CORRECT-MAX
059000                    PERFORM FAIL.
059100     GO TO F-MEAN-WRITE-14.
059200 F-MEAN-DELETE-14.
059300     PERFORM  DE-LETE.
059400     GO TO    F-MEAN-WRITE-14.
059500 F-MEAN-WRITE-14.
059600     MOVE "F-MEAN-14" TO PAR-NAME.
059700     PERFORM  PRINT-DETAIL.
059800*****************TEST (c) - COMPLEX TEST****************
059900 F-MEAN-15.
060000     MOVE ZERO TO WS-NUM.
060100     MOVE 2.49995 TO MIN-RANGE.
060200     MOVE 2.50005 TO MAX-RANGE.
060300 F-MEAN-TEST-15.
060400     COMPUTE WS-NUM = FUNCTION MEAN(A , B) +
060500                      FUNCTION MEAN(-2.6, -4.4).
060600     IF (WS-NUM >= MIN-RANGE) AND
060700        (WS-NUM <= MAX-RANGE) THEN
060800                    PERFORM PASS
060900     ELSE
061000                    MOVE WS-NUM TO COMPUTED-N
061100                    MOVE MIN-RANGE TO CORRECT-MIN
061200                    MOVE MAX-RANGE TO CORRECT-MAX
061300                    PERFORM FAIL.
061400     GO TO F-MEAN-WRITE-15.
061500 F-MEAN-DELETE-15.
061600     PERFORM  DE-LETE.
061700     GO TO    F-MEAN-WRITE-15.
061800 F-MEAN-WRITE-15.
061900     MOVE "F-MEAN-15" TO PAR-NAME.
062000     PERFORM  PRINT-DETAIL.
062100*****************TEST (d) - COMPLEX TEST****************
062200 F-MEAN-16.
062300     MOVE ZERO TO WS-NUM.
062400     MOVE 4.49991 TO MIN-RANGE.
062500     MOVE 4.50009 TO MAX-RANGE.
062600 F-MEAN-TEST-16.
062700     COMPUTE WS-NUM = FUNCTION MEAN(FUNCTION MEAN(4, 2), 6).
062800     IF (WS-NUM >= MIN-RANGE) AND
062900        (WS-NUM <= MAX-RANGE) THEN
063000                    PERFORM PASS
063100     ELSE
063200                    MOVE WS-NUM TO COMPUTED-N
063300                    MOVE MIN-RANGE TO CORRECT-MIN
063400                    MOVE MAX-RANGE TO CORRECT-MAX
063500                    PERFORM FAIL.
063600     GO TO F-MEAN-WRITE-16.
063700 F-MEAN-DELETE-16.
063800     PERFORM  DE-LETE.
063900     GO TO    F-MEAN-WRITE-16.
064000 F-MEAN-WRITE-16.
064100     MOVE "F-MEAN-16" TO PAR-NAME.
064200     PERFORM  PRINT-DETAIL.
064300*****************TEST (e) - COMPLEX TEST****************
064400 F-MEAN-17.
064500     MOVE ZERO TO WS-NUM.
064600     MOVE  20.7996 TO MIN-RANGE.
064700     MOVE  20.8004 TO MAX-RANGE.
064800 F-MEAN-TEST-17.
064900     COMPUTE WS-NUM = FUNCTION MEAN(2.6 + 30, 4.5 * 2).
065000     IF (WS-NUM >= MIN-RANGE) AND
065100        (WS-NUM <= MAX-RANGE) THEN
065200                    PERFORM PASS
065300     ELSE
065400                    MOVE WS-NUM TO COMPUTED-N
065500                    MOVE MIN-RANGE TO CORRECT-MIN
065600                    MOVE MAX-RANGE TO CORRECT-MAX
065700                    PERFORM FAIL.
065800     GO TO F-MEAN-WRITE-17.
065900 F-MEAN-DELETE-17.
066000     PERFORM  DE-LETE.
066100     GO TO    F-MEAN-WRITE-17.
066200 F-MEAN-WRITE-17.
066300     MOVE "F-MEAN-17" TO PAR-NAME.
066400     PERFORM  PRINT-DETAIL.
066500*****************SPECIAL PERFORM TEST**********************
066600 F-MEAN-18.
066700     MOVE ZERO TO WS-NUM.
066800     PERFORM F-MEAN-TEST-18
066900       UNTIL FUNCTION MEAN(ARG1, ARG2) > 8.
067000     PERFORM PASS.
067100     GO TO F-MEAN-WRITE-18.
067200 F-MEAN-TEST-18.
067300     COMPUTE ARG1 = ARG1 + 1.
067400     COMPUTE ARG2 = ARG2 + 1.
067500 F-MEAN-DELETE-18.
067600     PERFORM  DE-LETE.
067700     GO TO    F-MEAN-WRITE-18.
067800 F-MEAN-WRITE-18.
067900     MOVE "F-MEAN-18" TO PAR-NAME.
068000     PERFORM  PRINT-DETAIL.
068100********************END OF TESTS***************
068200 CCVS-EXIT SECTION.
068300 CCVS-999999.
068400     GO TO CLOSE-FILES.
