000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF124A.
000400
000500***********************************************************
000600*                                                         *
000700*   This program is intended to form part of the CCVS85   *
000800*   COBOL Test Suite. It contains tests for the           *
000900*   Intrinsic Function MOD.                               *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT PRINT-FILE ASSIGN TO
002100     XXXXX055.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  PRINT-FILE.
002500 01  PRINT-REC PICTURE X(120).
002600 01  DUMMY-RECORD PICTURE X(120).
002700 WORKING-STORAGE SECTION.
002800***********************************************************
002900* Variables specific to the Intrinsic Function Test IF124A*
003000***********************************************************
003100 01  A                   PIC S9(10)          VALUE 5.
003200 01  B                   PIC S9(10)          VALUE 7.
003300 01  C                   PIC S9(10)          VALUE -4.
003400 01  ARG2                PIC S9(10)          VALUE 1.
003500 01  TEMP                PIC S9(10).
003600 01  WS-NUM              PIC S9(5)V9(6).
003700 01  MIN-RANGE           PIC S9(5)V9(7).
003800 01  MAX-RANGE           PIC S9(5)V9(7).
003900*
004000***********************************************************
004100*
004200 01  TEST-RESULTS.
004300     02 FILLER                   PIC X      VALUE SPACE.
004400     02 FEATURE                  PIC X(20)  VALUE SPACE.
004500     02 FILLER                   PIC X      VALUE SPACE.
004600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
004700     02 FILLER                   PIC X      VALUE SPACE.
004800     02  PAR-NAME.
004900       03 FILLER                 PIC X(19)  VALUE SPACE.
005000       03  PARDOT-X              PIC X      VALUE SPACE.
005100       03 DOTVALUE               PIC 99     VALUE ZERO.
005200     02 FILLER                   PIC X(8)   VALUE SPACE.
005300     02 RE-MARK                  PIC X(61).
005400 01  TEST-COMPUTED.
005500     02 FILLER                   PIC X(30)  VALUE SPACE.
005600     02 FILLER                   PIC X(17)  VALUE
005700            "       COMPUTED=".
005800     02 COMPUTED-X.
005900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006000     03 COMPUTED-N               REDEFINES COMPUTED-A
006100                                 PIC -9(9).9(9).
006200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
006400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
006500     03       CM-18V0 REDEFINES COMPUTED-A.
006600         04 COMPUTED-18V0                    PIC -9(18).
006700         04 FILLER                           PIC X.
006800     03 FILLER PIC X(50) VALUE SPACE.
006900 01  TEST-CORRECT.
007000     02 FILLER PIC X(30) VALUE SPACE.
007100     02 FILLER PIC X(17) VALUE "       CORRECT =".
007200     02 CORRECT-X.
007300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
007400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
007500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
007600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
007700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
007800     03      CR-18V0 REDEFINES CORRECT-A.
007900         04 CORRECT-18V0                     PIC -9(18).
008000         04 FILLER                           PIC X.
008100     03 FILLER PIC X(2) VALUE SPACE.
008200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008300 01  TEST-CORRECT-MIN.
008400     02 FILLER PIC X(30) VALUE SPACE.
008500     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
008600     02 CORRECTMI-X.
008700     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
008800     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
008900     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
009000     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
009100     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
009200     03      CR-18V0 REDEFINES CORRECTMI-A.
009300         04 CORRECTMI-18V0                     PIC -9(18).
009400         04 FILLER                           PIC X.
009500     03 FILLER PIC X(2) VALUE SPACE.
009600     03 FILLER                           PIC X(48) VALUE SPACE.
009700 01  TEST-CORRECT-MAX.
009800     02 FILLER PIC X(30) VALUE SPACE.
009900     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
010000     02 CORRECTMA-X.
010100     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
010200     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
010300     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
010400     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
010500     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
010600     03      CR-18V0 REDEFINES CORRECTMA-A.
010700         04 CORRECTMA-18V0                     PIC -9(18).
010800         04 FILLER                           PIC X.
010900     03 FILLER PIC X(2) VALUE SPACE.
011000     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011100 01  CCVS-C-1.
011200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011300-    "SS  PARAGRAPH-NAME
011400-    "       REMARKS".
011500     02 FILLER                     PIC X(20)    VALUE SPACE.
011600 01  CCVS-C-2.
011700     02 FILLER                     PIC X        VALUE SPACE.
011800     02 FILLER                     PIC X(6)     VALUE "TESTED".
011900     02 FILLER                     PIC X(15)    VALUE SPACE.
012000     02 FILLER                     PIC X(4)     VALUE "FAIL".
012100     02 FILLER                     PIC X(94)    VALUE SPACE.
012200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012300 01  REC-CT                        PIC 99       VALUE ZERO.
012400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
012800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
012900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013300 01  CCVS-H-1.
013400     02  FILLER                    PIC X(39)    VALUE SPACES.
013500     02  FILLER                    PIC X(42)    VALUE
013600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013700     02  FILLER                    PIC X(39)    VALUE SPACES.
013800 01  CCVS-H-2A.
013900   02  FILLER                        PIC X(40)  VALUE SPACE.
014000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014100   02  FILLER                        PIC XXXX   VALUE
014200     "4.2 ".
014300   02  FILLER                        PIC X(28)  VALUE
014400            " COPY - NOT FOR DISTRIBUTION".
014500   02  FILLER                        PIC X(41)  VALUE SPACE.
014600
014700 01  CCVS-H-2B.
014800   02  FILLER                        PIC X(15)  VALUE
014900            "TEST RESULT OF ".
015000   02  TEST-ID                       PIC X(9).
015100   02  FILLER                        PIC X(4)   VALUE
015200            " IN ".
015300   02  FILLER                        PIC X(12)  VALUE
015400     " HIGH       ".
015500   02  FILLER                        PIC X(22)  VALUE
015600            " LEVEL VALIDATION FOR ".
015700   02  FILLER                        PIC X(58)  VALUE
015800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015900 01  CCVS-H-3.
016000     02  FILLER                      PIC X(34)  VALUE
016100            " FOR OFFICIAL USE ONLY    ".
016200     02  FILLER                      PIC X(58)  VALUE
016300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016400     02  FILLER                      PIC X(28)  VALUE
016500            "  COPYRIGHT   1985 ".
016600 01  CCVS-E-1.
016700     02 FILLER                       PIC X(52)  VALUE SPACE.
016800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
016900     02 ID-AGAIN                     PIC X(9).
017000     02 FILLER                       PIC X(45)  VALUE SPACES.
017100 01  CCVS-E-2.
017200     02  FILLER                      PIC X(31)  VALUE SPACE.
017300     02  FILLER                      PIC X(21)  VALUE SPACE.
017400     02 CCVS-E-2-2.
017500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017600         03 FILLER                   PIC X      VALUE SPACE.
017700         03 ENDER-DESC               PIC X(44)  VALUE
017800            "ERRORS ENCOUNTERED".
017900 01  CCVS-E-3.
018000     02  FILLER                      PIC X(22)  VALUE
018100            " FOR OFFICIAL USE ONLY".
018200     02  FILLER                      PIC X(12)  VALUE SPACE.
018300     02  FILLER                      PIC X(58)  VALUE
018400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018500     02  FILLER                      PIC X(13)  VALUE SPACE.
018600     02 FILLER                       PIC X(15)  VALUE
018700             " COPYRIGHT 1985".
018800 01  CCVS-E-4.
018900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019000     02 FILLER                       PIC X(4)   VALUE " OF ".
019100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019200     02 FILLER                       PIC X(40)  VALUE
019300      "  TESTS WERE EXECUTED SUCCESSFULLY".
019400 01  XXINFO.
019500     02 FILLER                       PIC X(19)  VALUE
019600            "*** INFORMATION ***".
019700     02 INFO-TEXT.
019800       04 FILLER                     PIC X(8)   VALUE SPACE.
019900       04 XXCOMPUTED                 PIC X(20).
020000       04 FILLER                     PIC X(5)   VALUE SPACE.
020100       04 XXCORRECT                  PIC X(20).
020200     02 INF-ANSI-REFERENCE           PIC X(48).
020300 01  HYPHEN-LINE.
020400     02 FILLER  PIC IS X VALUE IS SPACE.
020500     02 FILLER  PIC IS X(65)    VALUE IS "************************
020600-    "*****************************************".
020700     02 FILLER  PIC IS X(54)    VALUE IS "************************
020800-    "******************************".
020900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021000     "IF124A".
021100 PROCEDURE DIVISION.
021200 CCVS1 SECTION.
021300 OPEN-FILES.
021400     OPEN     OUTPUT PRINT-FILE.
021500     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021600     MOVE    SPACE TO TEST-RESULTS.
021700     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
021800     GO TO CCVS1-EXIT.
021900 CLOSE-FILES.
022000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022100 TERMINATE-CCVS.
022200     STOP     RUN.
022300 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022400 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022500 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
022600 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
022700     MOVE "****TEST DELETED****" TO RE-MARK.
022800 PRINT-DETAIL.
022900     IF REC-CT NOT EQUAL TO ZERO
023000             MOVE "." TO PARDOT-X
023100             MOVE REC-CT TO DOTVALUE.
023200     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023300     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023400        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023500          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
023600     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
023700     MOVE SPACE TO CORRECT-X.
023800     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
023900     MOVE     SPACE TO RE-MARK.
024000 HEAD-ROUTINE.
024100     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024200     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024300     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024400     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024500 COLUMN-NAMES-ROUTINE.
024600     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024700     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
024900 END-ROUTINE.
025000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025100 END-RTN-EXIT.
025200     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025300 END-ROUTINE-1.
025400      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025500      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
025600      ADD PASS-COUNTER TO ERROR-HOLD.
025700      MOVE PASS-COUNTER TO CCVS-E-4-1.
025800      MOVE ERROR-HOLD TO CCVS-E-4-2.
025900      MOVE CCVS-E-4 TO CCVS-E-2-2.
026000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026100  END-ROUTINE-12.
026200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026300     IF       ERROR-COUNTER IS EQUAL TO ZERO
026400         MOVE "NO " TO ERROR-TOTAL
026500         ELSE
026600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
026700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
026800     PERFORM WRITE-LINE.
026900 END-ROUTINE-13.
027000     IF DELETE-COUNTER IS EQUAL TO ZERO
027100         MOVE "NO " TO ERROR-TOTAL  ELSE
027200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027500      IF   INSPECT-COUNTER EQUAL TO ZERO
027600          MOVE "NO " TO ERROR-TOTAL
027700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
027800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
027900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028100 WRITE-LINE.
028200     ADD 1 TO RECORD-COUNT.
028300Y    IF RECORD-COUNT GREATER 42
028400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
028500Y        MOVE SPACE TO DUMMY-RECORD
028600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
028700Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028800Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028900Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029000Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029100Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
029200Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029500Y        MOVE ZERO TO RECORD-COUNT.
029600     PERFORM WRT-LN.
029700 WRT-LN.
029800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
029900     MOVE SPACE TO DUMMY-RECORD.
030000 BLANK-LINE-PRINT.
030100     PERFORM WRT-LN.
030200 FAIL-ROUTINE.
030300     IF     COMPUTED-X NOT EQUAL TO SPACE
030400            GO TO FAIL-ROUTINE-WRITE.
030500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
030800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030900     MOVE   SPACES TO INF-ANSI-REFERENCE.
031000     GO TO  FAIL-ROUTINE-EX.
031100 FAIL-ROUTINE-WRITE.
031200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
031300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
031400                              CORMA-ANSI-REFERENCE.
031500     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
031600           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
031700           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
031800     ELSE
031900           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
032000     PERFORM WRITE-LINE.
032100     MOVE   SPACES TO COR-ANSI-REFERENCE.
032200 FAIL-ROUTINE-EX. EXIT.
032300 BAIL-OUT.
032400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032600 BAIL-OUT-WRITE.
032700     MOVE CORRECT-A TO XXCORRECT.
032800     MOVE COMPUTED-A TO XXCOMPUTED.
032900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033100     MOVE   SPACES TO INF-ANSI-REFERENCE.
033200 BAIL-OUT-EX. EXIT.
033300 CCVS1-EXIT.
033400     EXIT.
033500********************************************************
033600*                                                      *
033700*    Intrinsic Function Tests         IF124A - MOD     *
033800*                                                      *
033900********************************************************
034000 SECT-IF124A SECTION.
034100 F-MOD-INFO.
034200     MOVE     "See ref. A-58 2.28" TO ANSI-REFERENCE.
034300     MOVE     "MOD Function" TO FEATURE.
034400*****************TEST (a) - SIMPLE TEST*****************
034500 F-MOD-01.
034600     MOVE ZERO TO WS-NUM.
034700 F-MOD-TEST-01.
034800     COMPUTE WS-NUM = FUNCTION MOD(6, 6).
034900     IF WS-NUM = 0 THEN
035000                    PERFORM PASS
035100     ELSE
035200                    MOVE WS-NUM TO COMPUTED-N
035300                    MOVE 0 TO CORRECT-N
035400                    PERFORM FAIL.
035500     GO TO F-MOD-WRITE-01.
035600 F-MOD-DELETE-01.
035700     PERFORM  DE-LETE.
035800     GO TO    F-MOD-WRITE-01.
035900 F-MOD-WRITE-01.
036000     MOVE "F-MOD-01" TO PAR-NAME.
036100     PERFORM  PRINT-DETAIL.
036200*****************TEST (b) - SIMPLE TEST*****************
036300 F-MOD-02.
036400     EVALUATE FUNCTION MOD(11, 5)
036500     WHEN 1
036600                    PERFORM PASS
036700     WHEN OTHER
036800                    PERFORM FAIL.
036900     GO TO F-MOD-WRITE-02.
037000 F-MOD-DELETE-02.
037100     PERFORM  DE-LETE.
037200     GO TO    F-MOD-WRITE-02.
037300 F-MOD-WRITE-02.
037400     MOVE "F-MOD-02" TO PAR-NAME.
037500     PERFORM  PRINT-DETAIL.
037600*****************TEST (c) - SIMPLE TEST*****************
037700 F-MOD-03.
037800     IF FUNCTION MOD(10, 20) = 10 THEN
037900                    PERFORM PASS
038000     ELSE
038100                    PERFORM FAIL.
038200     GO TO F-MOD-WRITE-03.
038300 F-MOD-DELETE-03.
038400     PERFORM  DE-LETE.
038500     GO TO    F-MOD-WRITE-03.
038600 F-MOD-WRITE-03.
038700     MOVE "F-MOD-03" TO PAR-NAME.
038800     PERFORM  PRINT-DETAIL.
038900*****************TEST (d) - SIMPLE TEST*****************
039000 F-MOD-04.
039100     MOVE ZERO TO WS-NUM.
039200 F-MOD-TEST-04.
039300     COMPUTE WS-NUM = FUNCTION MOD(A, B).
039400     IF WS-NUM = 5 THEN
039500                    PERFORM PASS
039600     ELSE
039700                    MOVE WS-NUM TO COMPUTED-N
039800                    MOVE 5 TO CORRECT-N
039900                    PERFORM FAIL.
040000     GO TO F-MOD-WRITE-04.
040100 F-MOD-DELETE-04.
040200     PERFORM  DE-LETE.
040300     GO TO    F-MOD-WRITE-04.
040400 F-MOD-WRITE-04.
040500     MOVE "F-MOD-04" TO PAR-NAME.
040600     PERFORM  PRINT-DETAIL.
040700*****************TEST (e) - SIMPLE TEST*****************
040800 F-MOD-05.
040900     MOVE ZERO TO WS-NUM.
041000 F-MOD-TEST-05.
041100     COMPUTE WS-NUM = FUNCTION MOD(A, -3).
041200     IF WS-NUM = -1 THEN
041300                    PERFORM PASS
041400     ELSE
041500                    MOVE WS-NUM TO COMPUTED-N
041600                    MOVE -1 TO CORRECT-N
041700                    PERFORM FAIL.
041800     GO TO F-MOD-WRITE-05.
041900 F-MOD-DELETE-05.
042000     PERFORM  DE-LETE.
042100     GO TO    F-MOD-WRITE-05.
042200 F-MOD-WRITE-05.
042300     MOVE "F-MOD-05" TO PAR-NAME.
042400     PERFORM  PRINT-DETAIL.
042500*****************TEST (f) - SIMPLE TEST*****************
042600 F-MOD-06.
042700     MOVE ZERO TO WS-NUM.
042800 F-MOD-TEST-06.
042900     COMPUTE WS-NUM = FUNCTION MOD(23, B).
043000     IF WS-NUM = 2 THEN
043100                    PERFORM PASS
043200     ELSE
043300                    MOVE WS-NUM TO COMPUTED-N
043400                    MOVE 2 TO CORRECT-N
043500                    PERFORM FAIL.
043600     GO TO F-MOD-WRITE-06.
043700 F-MOD-DELETE-06.
043800     PERFORM  DE-LETE.
043900     GO TO    F-MOD-WRITE-06.
044000 F-MOD-WRITE-06.
044100     MOVE "F-MOD-06" TO PAR-NAME.
044200     PERFORM  PRINT-DETAIL.
044300*****************TEST (g) - SIMPLE TEST*****************
044400 F-MOD-07.
044500     MOVE ZERO TO WS-NUM.
044600 F-MOD-TEST-07.
044700     COMPUTE WS-NUM = FUNCTION MOD(-11, -5).
044800     IF WS-NUM = -1    THEN
044900                    PERFORM PASS
045000     ELSE
045100                    MOVE WS-NUM TO COMPUTED-N
045200                    MOVE -1    TO CORRECT-N
045300                    PERFORM FAIL.
045400     GO TO F-MOD-WRITE-07.
045500 F-MOD-DELETE-07.
045600     PERFORM  DE-LETE.
045700     GO TO    F-MOD-WRITE-07.
045800 F-MOD-WRITE-07.
045900     MOVE "F-MOD-07" TO PAR-NAME.
046000     PERFORM  PRINT-DETAIL.
046100*****************TEST (h) - SIMPLE TEST*****************
046200 F-MOD-08.
046300     MOVE ZERO TO WS-NUM.
046400 F-MOD-TEST-08.
046500     COMPUTE WS-NUM = FUNCTION MOD(11, -5).
046600     IF WS-NUM = -4 THEN
046700                    PERFORM PASS
046800     ELSE
046900                    MOVE WS-NUM TO COMPUTED-N
047000                    MOVE -4 TO CORRECT-N
047100                    PERFORM FAIL.
047200     GO TO F-MOD-WRITE-08.
047300 F-MOD-DELETE-08.
047400     PERFORM  DE-LETE.
047500     GO TO    F-MOD-WRITE-08.
047600 F-MOD-WRITE-08.
047700     MOVE "F-MOD-08" TO PAR-NAME.
047800     PERFORM  PRINT-DETAIL.
047900*****************TEST (i) - SIMPLE TEST*****************
048000 F-MOD-09.
048100     MOVE ZERO TO WS-NUM.
048200 F-MOD-TEST-09.
048300     COMPUTE WS-NUM = FUNCTION MOD(-11, 5).
048400     IF WS-NUM = 4 THEN
048500                    PERFORM PASS
048600     ELSE
048700                    MOVE WS-NUM TO COMPUTED-N
048800                    MOVE 4 TO CORRECT-N
048900                    PERFORM FAIL.
049000     GO TO F-MOD-WRITE-09.
049100 F-MOD-DELETE-09.
049200     PERFORM  DE-LETE.
049300     GO TO    F-MOD-WRITE-09.
049400 F-MOD-WRITE-09.
049500     MOVE "F-MOD-09" TO PAR-NAME.
049600     PERFORM  PRINT-DETAIL.
049700*****************TEST (a) - COMPLEX TEST****************
049800 F-MOD-11.
049900     MOVE ZERO TO WS-NUM.
050000     MOVE -0.000020 TO MIN-RANGE.
050100     MOVE  0.000020 TO MAX-RANGE.
050200 F-MOD-TEST-11.
050300     COMPUTE WS-NUM = FUNCTION MOD(35, FUNCTION INTEGER(A * B)).
050400     IF (WS-NUM >= MIN-RANGE) AND
050500        (WS-NUM <= MAX-RANGE) THEN
050600                    PERFORM PASS
050700     ELSE
050800                    MOVE WS-NUM TO COMPUTED-N
050900                    MOVE MIN-RANGE TO CORRECT-MIN
051000                    MOVE MAX-RANGE TO CORRECT-MAX
051100                    PERFORM FAIL.
051200     GO TO F-MOD-WRITE-11.
051300 F-MOD-DELETE-11.
051400     PERFORM  DE-LETE.
051500     GO TO    F-MOD-WRITE-11.
051600 F-MOD-WRITE-11.
051700     MOVE "F-MOD-11" TO PAR-NAME.
051800     PERFORM  PRINT-DETAIL.
051900*****************TEST (b) - COMPLEX TEST****************
052000 F-MOD-12.
052100     MOVE ZERO TO WS-NUM.
052200     MOVE  0.999980 TO MIN-RANGE.
052300     MOVE  1.00002 TO MAX-RANGE.
052400 F-MOD-TEST-12.
052500     COMPUTE WS-NUM = FUNCTION MOD(A, FUNCTION INTEGER(B - 5)).
052600     IF (WS-NUM >= MIN-RANGE) AND
052700        (WS-NUM <= MAX-RANGE) THEN
052800                    PERFORM PASS
052900     ELSE
053000                    MOVE WS-NUM TO COMPUTED-N
053100                    MOVE MIN-RANGE TO CORRECT-MIN
053200                    MOVE MAX-RANGE TO CORRECT-MAX
053300                    PERFORM FAIL.
053400     GO TO F-MOD-WRITE-12.
053500 F-MOD-DELETE-12.
053600     PERFORM  DE-LETE.
053700     GO TO    F-MOD-WRITE-12.
053800 F-MOD-WRITE-12.
053900     MOVE "F-MOD-12" TO PAR-NAME.
054000     PERFORM  PRINT-DETAIL.
054100*****************TEST (c) - COMPLEX TEST****************
054200 F-MOD-13.
054300     MOVE ZERO TO WS-NUM.
054400     MOVE  6.99986 TO MIN-RANGE.
054500     MOVE  7.00014 TO MAX-RANGE.
054600 F-MOD-TEST-13.
054700     COMPUTE WS-NUM = FUNCTION MOD(FUNCTION INTEGER(A - B), 9).
054800     IF (WS-NUM >= MIN-RANGE) AND
054900        (WS-NUM <= MAX-RANGE) THEN
055000                    PERFORM PASS
055100     ELSE
055200                    MOVE WS-NUM TO COMPUTED-N
055300                    MOVE MIN-RANGE TO CORRECT-MIN
055400                    MOVE MAX-RANGE TO CORRECT-MAX
055500                    PERFORM FAIL.
055600     GO TO F-MOD-WRITE-13.
055700 F-MOD-DELETE-13.
055800     PERFORM  DE-LETE.
055900     GO TO    F-MOD-WRITE-13.
056000 F-MOD-WRITE-13.
056100     MOVE "F-MOD-13" TO PAR-NAME.
056200     PERFORM  PRINT-DETAIL.
056300*****************TEST (d) - COMPLEX TEST****************
056400 F-MOD-14.
056500     MOVE ZERO TO WS-NUM.
056600     MOVE -2.00004 TO MIN-RANGE.
056700     MOVE -1.99996 TO MAX-RANGE.
056800 F-MOD-TEST-14.
056900     COMPUTE WS-NUM = FUNCTION MOD(
057000                         FUNCTION INTEGER((A + B) / -2), -4).
057100     IF (WS-NUM >= MIN-RANGE) AND
057200        (WS-NUM <= MAX-RANGE) THEN
057300                    PERFORM PASS
057400     ELSE
057500                    MOVE WS-NUM TO COMPUTED-N
057600                    MOVE MIN-RANGE TO CORRECT-MIN
057700                    MOVE MAX-RANGE TO CORRECT-MAX
057800                    PERFORM FAIL.
057900     GO TO F-MOD-WRITE-14.
058000 F-MOD-DELETE-14.
058100     PERFORM  DE-LETE.
058200     GO TO    F-MOD-WRITE-14.
058300 F-MOD-WRITE-14.
058400     MOVE "F-MOD-14" TO PAR-NAME.
058500     PERFORM  PRINT-DETAIL.
058600*****************TEST (e) - COMPLEX TEST****************
058700 F-MOD-15.
058800     MOVE ZERO TO WS-NUM.
058900     MOVE  0.999980 TO MIN-RANGE.
059000     MOVE  1.00002 TO MAX-RANGE.
059100 F-MOD-TEST-15.
059200     COMPUTE WS-NUM = FUNCTION MOD(FUNCTION INTEGER(A * B),
059300                                      FUNCTION INTEGER(B - A)).
059400     IF (WS-NUM >= MIN-RANGE) AND
059500        (WS-NUM <= MAX-RANGE) THEN
059600                    PERFORM PASS
059700     ELSE
059800                    MOVE WS-NUM TO COMPUTED-N
059900                    MOVE MIN-RANGE TO CORRECT-MIN
060000                    MOVE MAX-RANGE TO CORRECT-MAX
060100                    PERFORM FAIL.
060200     GO TO F-MOD-WRITE-15.
060300 F-MOD-DELETE-15.
060400     PERFORM  DE-LETE.
060500     GO TO    F-MOD-WRITE-15.
060600 F-MOD-WRITE-15.
060700     MOVE "F-MOD-15" TO PAR-NAME.
060800     PERFORM  PRINT-DETAIL.
060900*****************TEST (f) - COMPLEX TEST****************
061000 F-MOD-16.
061100     MOVE ZERO TO WS-NUM.
061200     MOVE  1.99996 TO MIN-RANGE.
061300     MOVE  2.00004 TO MAX-RANGE.
061400 F-MOD-TEST-16.
061500     COMPUTE WS-NUM = FUNCTION MOD(
061600                      FUNCTION MOD(B, A), A).
061700     IF (WS-NUM >= MIN-RANGE) AND
061800        (WS-NUM <= MAX-RANGE) THEN
061900                    PERFORM PASS
062000     ELSE
062100                    MOVE WS-NUM TO COMPUTED-N
062200                    MOVE MIN-RANGE TO CORRECT-MIN
062300                    MOVE MAX-RANGE TO CORRECT-MAX
062400                    PERFORM FAIL.
062500     GO TO F-MOD-WRITE-16.
062600 F-MOD-DELETE-16.
062700     PERFORM  DE-LETE.
062800     GO TO    F-MOD-WRITE-16.
062900 F-MOD-WRITE-16.
063000     MOVE "F-MOD-16" TO PAR-NAME.
063100     PERFORM  PRINT-DETAIL.
063200*****************TEST (g) - COMPLEX TEST****************
063300 F-MOD-17.
063400     MOVE ZERO TO WS-NUM.
063500     MOVE  1.99996 TO MIN-RANGE.
063600     MOVE  2.00004 TO MAX-RANGE.
063700 F-MOD-TEST-17.
063800     COMPUTE WS-NUM = FUNCTION MOD(C, FUNCTION MOD(C, B)).
063900     IF (WS-NUM >= MIN-RANGE) AND
064000        (WS-NUM <= MAX-RANGE) THEN
064100                    PERFORM PASS
064200     ELSE
064300                    MOVE WS-NUM TO COMPUTED-N
064400                    MOVE MIN-RANGE TO CORRECT-MIN
064500                    MOVE MAX-RANGE TO CORRECT-MAX
064600                    PERFORM FAIL.
064700     GO TO F-MOD-WRITE-17.
064800 F-MOD-DELETE-17.
064900     PERFORM  DE-LETE.
065000     GO TO    F-MOD-WRITE-17.
065100 F-MOD-WRITE-17.
065200     MOVE "F-MOD-17" TO PAR-NAME.
065300     PERFORM  PRINT-DETAIL.
065400*****************TEST (h) - COMPLEX TEST****************
065500 F-MOD-18.
065600     MOVE ZERO TO WS-NUM.
065700     MOVE  0.999980 TO MIN-RANGE.
065800     MOVE  1.00002 TO MAX-RANGE.
065900 F-MOD-TEST-18.
066000     COMPUTE WS-NUM = FUNCTION MOD(FUNCTION MOD(9, 5),
066100                                   FUNCTION MOD(B, 4)).
066200     IF (WS-NUM >= MIN-RANGE) AND
066300        (WS-NUM <= MAX-RANGE) THEN
066400                    PERFORM PASS
066500     ELSE
066600                    MOVE WS-NUM TO COMPUTED-N
066700                    MOVE MIN-RANGE TO CORRECT-MIN
066800                    MOVE MAX-RANGE TO CORRECT-MAX
066900                    PERFORM FAIL.
067000     GO TO F-MOD-WRITE-18.
067100 F-MOD-DELETE-18.
067200     PERFORM  DE-LETE.
067300     GO TO    F-MOD-WRITE-18.
067400 F-MOD-WRITE-18.
067500     MOVE "F-MOD-18" TO PAR-NAME.
067600     PERFORM  PRINT-DETAIL.
067700*****************TEST (i) - COMPLEX TEST****************
067800 F-MOD-19.
067900     MOVE ZERO TO WS-NUM.
068000     MOVE 6.99986 TO MIN-RANGE.
068100     MOVE 7.00014 TO MAX-RANGE.
068200 F-MOD-TEST-19.
068300     COMPUTE WS-NUM = FUNCTION MOD(23, B) + A.
068400     IF (WS-NUM >= MIN-RANGE) AND
068500        (WS-NUM <= MAX-RANGE) THEN
068600                    PERFORM PASS
068700     ELSE
068800                    MOVE WS-NUM TO COMPUTED-N
068900                    MOVE MIN-RANGE TO CORRECT-MIN
069000                    MOVE MAX-RANGE TO CORRECT-MAX
069100                    PERFORM FAIL.
069200     GO TO F-MOD-WRITE-19.
069300 F-MOD-DELETE-19.
069400     PERFORM  DE-LETE.
069500     GO TO    F-MOD-WRITE-19.
069600 F-MOD-WRITE-19.
069700     MOVE "F-MOD-19" TO PAR-NAME.
069800     PERFORM  PRINT-DETAIL.
069900*****************TEST (j) - COMPLEX TEST****************
070000 F-MOD-20.
070100     MOVE ZERO TO WS-NUM.
070200     MOVE -0.000020 TO MIN-RANGE.
070300     MOVE  0.000020 TO MAX-RANGE.
070400 F-MOD-TEST-20.
070500     COMPUTE WS-NUM = FUNCTION MOD(FUNCTION MOD(5, 2), 1).
070600     IF (WS-NUM >= MIN-RANGE) AND
070700        (WS-NUM <= MAX-RANGE) THEN
070800                    PERFORM PASS
070900     ELSE
071000                    MOVE WS-NUM TO COMPUTED-N
071100                    MOVE MIN-RANGE TO CORRECT-MIN
071200                    MOVE MAX-RANGE TO CORRECT-MAX
071300                    PERFORM FAIL.
071400     GO TO F-MOD-WRITE-20.
071500 F-MOD-DELETE-20.
071600     PERFORM  DE-LETE.
071700     GO TO    F-MOD-WRITE-20.
071800 F-MOD-WRITE-20.
071900     MOVE "F-MOD-20" TO PAR-NAME.
072000     PERFORM  PRINT-DETAIL.
072100*****************TEST (k) - COMPLEX TEST****************
072200 F-MOD-21.
072300     MOVE ZERO TO WS-NUM.
072400     MOVE 0.999980 TO MIN-RANGE.
072500     MOVE 1.00002 TO MAX-RANGE.
072600 F-MOD-TEST-21.
072700     COMPUTE WS-NUM = FUNCTION MOD(25, C) +
072800                      FUNCTION MOD(-11, 5).
072900     IF (WS-NUM >= MIN-RANGE) AND
073000        (WS-NUM <= MAX-RANGE) THEN
073100                    PERFORM PASS
073200     ELSE
073300                    MOVE WS-NUM TO COMPUTED-N
073400                    MOVE MIN-RANGE TO CORRECT-MIN
073500                    MOVE MAX-RANGE TO CORRECT-MAX
073600                    PERFORM FAIL.
073700     GO TO F-MOD-WRITE-21.
073800 F-MOD-DELETE-21.
073900     PERFORM  DE-LETE.
074000     GO TO    F-MOD-WRITE-21.
074100 F-MOD-WRITE-21.
074200     MOVE "F-MOD-21" TO PAR-NAME.
074300     PERFORM  PRINT-DETAIL.
074400*****************SPECIAL PERFORM TEST**********************
074500 F-MOD-22.
074600     PERFORM F-MOD-TEST-22
074700       UNTIL FUNCTION MOD(5, ARG2) >= 2.
074800     PERFORM PASS.
074900     GO TO F-MOD-WRITE-22.
075000 F-MOD-TEST-22.
075100     COMPUTE ARG2 = ARG2 + 1.
075200 F-MOD-DELETE-22.
075300     PERFORM  DE-LETE.
075400     GO TO    F-MOD-WRITE-22.
075500 F-MOD-WRITE-22.
075600     MOVE "F-MOD-22" TO PAR-NAME.
075700     PERFORM  PRINT-DETAIL.
075800********************END OF TESTS***************
075900 CCVS-EXIT SECTION.
076000 CCVS-999999.
076100     GO TO CLOSE-FILES.
