000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF127A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function ORD.       *
000900*                                                         *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083
001800     PROGRAM COLLATING SEQUENCE IS PRG-COLL-SEQ.
001900 SPECIAL-NAMES.
002000     ALPHABET PRG-COLL-SEQ IS
002100     STANDARD-2.
002200 INPUT-OUTPUT SECTION.
002300 FILE-CONTROL.
002400     SELECT PRINT-FILE ASSIGN TO
002500     XXXXX055.
002600 DATA DIVISION.
002700 FILE SECTION.
002800 FD  PRINT-FILE.
002900 01  PRINT-REC PICTURE X(120).
003000 01  DUMMY-RECORD PICTURE X(120).
003100 WORKING-STORAGE SECTION.
003200***********************************************************
003300* Variables specific to the Intrinsic Function Test IF127A*
003400***********************************************************
003500 01  A                   PIC X          VALUE "F".
003600 01  B                   PIC X          VALUE "d".
003700 01  C                   PIC X          VALUE "3".
003800 01  ARG1                PIC X          VALUE "A".
003900 01  TEMP                PIC S9(10).
004000 01  WS-INT              PIC S9(10).
004100*
004200**********************************************************
004300*
004400 01  TEST-RESULTS.
004500     02 FILLER                   PIC X      VALUE SPACE.
004600     02 FEATURE                  PIC X(20)  VALUE SPACE.
004700     02 FILLER                   PIC X      VALUE SPACE.
004800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
004900     02 FILLER                   PIC X      VALUE SPACE.
005000     02  PAR-NAME.
005100       03 FILLER                 PIC X(19)  VALUE SPACE.
005200       03  PARDOT-X              PIC X      VALUE SPACE.
005300       03 DOTVALUE               PIC 99     VALUE ZERO.
005400     02 FILLER                   PIC X(8)   VALUE SPACE.
005500     02 RE-MARK                  PIC X(61).
005600 01  TEST-COMPUTED.
005700     02 FILLER                   PIC X(30)  VALUE SPACE.
005800     02 FILLER                   PIC X(17)  VALUE
005900            "       COMPUTED=".
006000     02 COMPUTED-X.
006100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006200     03 COMPUTED-N               REDEFINES COMPUTED-A
006300                                 PIC -9(9).9(9).
006400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
006600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
006700     03       CM-18V0 REDEFINES COMPUTED-A.
006800         04 COMPUTED-18V0                    PIC -9(18).
006900         04 FILLER                           PIC X.
007000     03 FILLER PIC X(50) VALUE SPACE.
007100 01  TEST-CORRECT.
007200     02 FILLER PIC X(30) VALUE SPACE.
007300     02 FILLER PIC X(17) VALUE "       CORRECT =".
007400     02 CORRECT-X.
007500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
007600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
007700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
007800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
007900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008000     03      CR-18V0 REDEFINES CORRECT-A.
008100         04 CORRECT-18V0                     PIC -9(18).
008200         04 FILLER                           PIC X.
008300     03 FILLER PIC X(2) VALUE SPACE.
008400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008500 01  TEST-CORRECT-MIN.
008600     02 FILLER PIC X(30) VALUE SPACE.
008700     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
008800     02 CORRECTMI-X.
008900     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
009000     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
009100     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
009200     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
009300     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
009400     03      CR-18V0 REDEFINES CORRECTMI-A.
009500         04 CORRECTMI-18V0                     PIC -9(18).
009600         04 FILLER                           PIC X.
009700     03 FILLER PIC X(2) VALUE SPACE.
009800     03 FILLER                           PIC X(48) VALUE SPACE.
009900 01  TEST-CORRECT-MAX.
010000     02 FILLER PIC X(30) VALUE SPACE.
010100     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
010200     02 CORRECTMA-X.
010300     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
010400     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
010500     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
010600     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
010700     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
010800     03      CR-18V0 REDEFINES CORRECTMA-A.
010900         04 CORRECTMA-18V0                     PIC -9(18).
011000         04 FILLER                           PIC X.
011100     03 FILLER PIC X(2) VALUE SPACE.
011200     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011300 01  CCVS-C-1.
011400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011500-    "SS  PARAGRAPH-NAME
011600-    "       REMARKS".
011700     02 FILLER                     PIC X(20)    VALUE SPACE.
011800 01  CCVS-C-2.
011900     02 FILLER                     PIC X        VALUE SPACE.
012000     02 FILLER                     PIC X(6)     VALUE "TESTED".
012100     02 FILLER                     PIC X(15)    VALUE SPACE.
012200     02 FILLER                     PIC X(4)     VALUE "FAIL".
012300     02 FILLER                     PIC X(94)    VALUE SPACE.
012400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012500 01  REC-CT                        PIC 99       VALUE ZERO.
012600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013500 01  CCVS-H-1.
013600     02  FILLER                    PIC X(39)    VALUE SPACES.
013700     02  FILLER                    PIC X(42)    VALUE
013800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013900     02  FILLER                    PIC X(39)    VALUE SPACES.
014000 01  CCVS-H-2A.
014100   02  FILLER                        PIC X(40)  VALUE SPACE.
014200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014300   02  FILLER                        PIC XXXX   VALUE
014400     "4.2 ".
014500   02  FILLER                        PIC X(28)  VALUE
014600            " COPY - NOT FOR DISTRIBUTION".
014700   02  FILLER                        PIC X(41)  VALUE SPACE.
014800
014900 01  CCVS-H-2B.
015000   02  FILLER                        PIC X(15)  VALUE
015100            "TEST RESULT OF ".
015200   02  TEST-ID                       PIC X(9).
015300   02  FILLER                        PIC X(4)   VALUE
015400            " IN ".
015500   02  FILLER                        PIC X(12)  VALUE
015600     " HIGH       ".
015700   02  FILLER                        PIC X(22)  VALUE
015800            " LEVEL VALIDATION FOR ".
015900   02  FILLER                        PIC X(58)  VALUE
016000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016100 01  CCVS-H-3.
016200     02  FILLER                      PIC X(34)  VALUE
016300            " FOR OFFICIAL USE ONLY    ".
016400     02  FILLER                      PIC X(58)  VALUE
016500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016600     02  FILLER                      PIC X(28)  VALUE
016700            "  COPYRIGHT   1985 ".
016800 01  CCVS-E-1.
016900     02 FILLER                       PIC X(52)  VALUE SPACE.
017000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017100     02 ID-AGAIN                     PIC X(9).
017200     02 FILLER                       PIC X(45)  VALUE SPACES.
017300 01  CCVS-E-2.
017400     02  FILLER                      PIC X(31)  VALUE SPACE.
017500     02  FILLER                      PIC X(21)  VALUE SPACE.
017600     02 CCVS-E-2-2.
017700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017800         03 FILLER                   PIC X      VALUE SPACE.
017900         03 ENDER-DESC               PIC X(44)  VALUE
018000            "ERRORS ENCOUNTERED".
018100 01  CCVS-E-3.
018200     02  FILLER                      PIC X(22)  VALUE
018300            " FOR OFFICIAL USE ONLY".
018400     02  FILLER                      PIC X(12)  VALUE SPACE.
018500     02  FILLER                      PIC X(58)  VALUE
018600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018700     02  FILLER                      PIC X(13)  VALUE SPACE.
018800     02 FILLER                       PIC X(15)  VALUE
018900             " COPYRIGHT 1985".
019000 01  CCVS-E-4.
019100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019200     02 FILLER                       PIC X(4)   VALUE " OF ".
019300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019400     02 FILLER                       PIC X(40)  VALUE
019500      "  TESTS WERE EXECUTED SUCCESSFULLY".
019600 01  XXINFO.
019700     02 FILLER                       PIC X(19)  VALUE
019800            "*** INFORMATION ***".
019900     02 INFO-TEXT.
020000       04 FILLER                     PIC X(8)   VALUE SPACE.
020100       04 XXCOMPUTED                 PIC X(20).
020200       04 FILLER                     PIC X(5)   VALUE SPACE.
020300       04 XXCORRECT                  PIC X(20).
020400     02 INF-ANSI-REFERENCE           PIC X(48).
020500 01  HYPHEN-LINE.
020600     02 FILLER  PIC IS X VALUE IS SPACE.
020700     02 FILLER  PIC IS X(65)    VALUE IS "************************
020800-    "*****************************************".
020900     02 FILLER  PIC IS X(54)    VALUE IS "************************
021000-    "******************************".
021100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021200     "IF127A".
021300 PROCEDURE DIVISION.
021400 CCVS1 SECTION.
021500 OPEN-FILES.
021600     OPEN     OUTPUT PRINT-FILE.
021700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021800     MOVE    SPACE TO TEST-RESULTS.
021900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022000     GO TO CCVS1-EXIT.
022100 CLOSE-FILES.
022200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022300 TERMINATE-CCVS.
022400     STOP     RUN.
022500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
022800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
022900     MOVE "****TEST DELETED****" TO RE-MARK.
023000 PRINT-DETAIL.
023100     IF REC-CT NOT EQUAL TO ZERO
023200             MOVE "." TO PARDOT-X
023300             MOVE REC-CT TO DOTVALUE.
023400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
023800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
023900     MOVE SPACE TO CORRECT-X.
024000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024100     MOVE     SPACE TO RE-MARK.
024200 HEAD-ROUTINE.
024300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024700 COLUMN-NAMES-ROUTINE.
024800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025100 END-ROUTINE.
025200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025300 END-RTN-EXIT.
025400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025500 END-ROUTINE-1.
025600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
025800      ADD PASS-COUNTER TO ERROR-HOLD.
025900      MOVE PASS-COUNTER TO CCVS-E-4-1.
026000      MOVE ERROR-HOLD TO CCVS-E-4-2.
026100      MOVE CCVS-E-4 TO CCVS-E-2-2.
026200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026300  END-ROUTINE-12.
026400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026500     IF       ERROR-COUNTER IS EQUAL TO ZERO
026600         MOVE "NO " TO ERROR-TOTAL
026700         ELSE
026800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
026900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027000     PERFORM WRITE-LINE.
027100 END-ROUTINE-13.
027200     IF DELETE-COUNTER IS EQUAL TO ZERO
027300         MOVE "NO " TO ERROR-TOTAL  ELSE
027400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027700      IF   INSPECT-COUNTER EQUAL TO ZERO
027800          MOVE "NO " TO ERROR-TOTAL
027900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028300 WRITE-LINE.
028400     ADD 1 TO RECORD-COUNT.
028500Y    IF RECORD-COUNT GREATER 42
028600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
028700Y        MOVE SPACE TO DUMMY-RECORD
028800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
028900Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029000Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029100Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029200Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029300Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
029400Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029700Y        MOVE ZERO TO RECORD-COUNT.
029800     PERFORM WRT-LN.
029900 WRT-LN.
030000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030100     MOVE SPACE TO DUMMY-RECORD.
030200 BLANK-LINE-PRINT.
030300     PERFORM WRT-LN.
030400 FAIL-ROUTINE.
030500     IF     COMPUTED-X NOT EQUAL TO SPACE
030600            GO TO FAIL-ROUTINE-WRITE.
030700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031100     MOVE   SPACES TO INF-ANSI-REFERENCE.
031200     GO TO  FAIL-ROUTINE-EX.
031300 FAIL-ROUTINE-WRITE.
031400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
031500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
031600                              CORMA-ANSI-REFERENCE.
031700     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
031800           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
031900           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
032000     ELSE
032100           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
032200     PERFORM WRITE-LINE.
032300     MOVE   SPACES TO COR-ANSI-REFERENCE.
032400 FAIL-ROUTINE-EX. EXIT.
032500 BAIL-OUT.
032600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032800 BAIL-OUT-WRITE.
032900     MOVE CORRECT-A TO XXCORRECT.
033000     MOVE COMPUTED-A TO XXCOMPUTED.
033100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033300     MOVE   SPACES TO INF-ANSI-REFERENCE.
033400 BAIL-OUT-EX. EXIT.
033500 CCVS1-EXIT.
033600     EXIT.
033700********************************************************
033800*                                                      *
033900*    Intrinsic Function Tests         IF127A - ORD     *
034000*                                                      *
034100********************************************************
034200 SECT-IF127A SECTION.
034300 F-ORD-INFO.
034400     MOVE     "See ref. A-60 2.31" TO ANSI-REFERENCE.
034500     MOVE     "ORD Function"     TO FEATURE.
034600*****************TEST (a) ******************************
034700 F-ORD-01.
034800     MOVE ZERO TO WS-INT.
034900 F-ORD-TEST-01.
035000     COMPUTE WS-INT = FUNCTION ORD("A").
035100     IF WS-INT = 66 THEN
035200                        PERFORM PASS
035300     ELSE
035400                        MOVE 66  TO CORRECT-N
035500                        MOVE WS-INT TO COMPUTED-N
035600                        PERFORM FAIL.
035700     GO TO F-ORD-WRITE-01.
035800 F-ORD-DELETE-01.
035900     PERFORM  DE-LETE.
036000     GO TO    F-ORD-WRITE-01.
036100 F-ORD-WRITE-01.
036200     MOVE "F-ORD-01" TO PAR-NAME.
036300     PERFORM  PRINT-DETAIL.
036400*****************TEST (b) ******************************
036500 F-ORD-TEST-02.
036600     EVALUATE FUNCTION ORD("m")
036700     WHEN 110
036800                                 PERFORM PASS
036900                                 GO TO F-ORD-WRITE-02.
037000     PERFORM FAIL.
037100     GO TO F-ORD-WRITE-02.
037200 F-ORD-DELETE-02.
037300     PERFORM  DE-LETE.
037400     GO TO    F-ORD-WRITE-02.
037500 F-ORD-WRITE-02.
037600     MOVE "F-ORD-02" TO PAR-NAME.
037700     PERFORM  PRINT-DETAIL.
037800*****************TEST (c) ******************************
037900 F-ORD-03.
038000     MOVE ZERO TO WS-INT.
038100 F-ORD-TEST-03.
038200     IF FUNCTION ORD("5") = 54 THEN
038300                        PERFORM PASS
038400     ELSE
038500                        PERFORM FAIL.
038600     GO TO F-ORD-WRITE-03.
038700 F-ORD-DELETE-03.
038800     PERFORM  DE-LETE.
038900     GO TO    F-ORD-WRITE-03.
039000 F-ORD-WRITE-03.
039100     MOVE "F-ORD-03" TO PAR-NAME.
039200     PERFORM  PRINT-DETAIL.
039300*****************TEST (d) ******************************
039400 F-ORD-04.
039500     MOVE ZERO TO WS-INT.
039600 F-ORD-TEST-04.
039700     COMPUTE WS-INT = FUNCTION ORD(A).
039800     IF WS-INT = 71 THEN
039900                        PERFORM PASS
040000     ELSE
040100                        MOVE 71  TO CORRECT-N
040200                        MOVE WS-INT TO COMPUTED-N
040300                        PERFORM FAIL.
040400     GO TO F-ORD-WRITE-04.
040500 F-ORD-DELETE-04.
040600     PERFORM  DE-LETE.
040700     GO TO    F-ORD-WRITE-04.
040800 F-ORD-WRITE-04.
040900     MOVE "F-ORD-04" TO PAR-NAME.
041000     PERFORM  PRINT-DETAIL.
041100*****************TEST (e) ******************************
041200 F-ORD-05.
041300     MOVE ZERO TO WS-INT.
041400 F-ORD-TEST-05.
041500     COMPUTE WS-INT = FUNCTION ORD(B).
041600     IF WS-INT = 101 THEN
041700                        PERFORM PASS
041800     ELSE
041900                        MOVE 101  TO CORRECT-N
042000                        MOVE WS-INT TO COMPUTED-N
042100                        PERFORM FAIL.
042200     GO TO F-ORD-WRITE-05.
042300 F-ORD-DELETE-05.
042400     PERFORM  DE-LETE.
042500     GO TO    F-ORD-WRITE-05.
042600 F-ORD-WRITE-05.
042700     MOVE "F-ORD-05" TO PAR-NAME.
042800     PERFORM  PRINT-DETAIL.
042900*****************TEST (f) ******************************
043000 F-ORD-06.
043100     MOVE ZERO TO WS-INT.
043200 F-ORD-TEST-06.
043300     COMPUTE WS-INT = FUNCTION ORD(C).
043400     IF WS-INT = 52 THEN
043500                        PERFORM PASS
043600     ELSE
043700                        MOVE 52  TO CORRECT-N
043800                        MOVE WS-INT TO COMPUTED-N
043900                        PERFORM FAIL.
044000     GO TO F-ORD-WRITE-06.
044100 F-ORD-DELETE-06.
044200     PERFORM  DE-LETE.
044300     GO TO    F-ORD-WRITE-06.
044400 F-ORD-WRITE-06.
044500     MOVE "F-ORD-06" TO PAR-NAME.
044600     PERFORM  PRINT-DETAIL.
044700*****************TEST (g) ******************************
044800 F-ORD-07.
044900     MOVE ZERO TO WS-INT.
045000 F-ORD-TEST-07.
045100     COMPUTE WS-INT = FUNCTION ORD("g") + 1.
045200     IF WS-INT = 105 THEN
045300                        PERFORM PASS
045400     ELSE
045500                        MOVE 105  TO CORRECT-N
045600                        MOVE WS-INT TO COMPUTED-N
045700                        PERFORM FAIL.
045800     GO TO F-ORD-WRITE-07.
045900 F-ORD-DELETE-07.
046000     PERFORM  DE-LETE.
046100     GO TO    F-ORD-WRITE-07.
046200 F-ORD-WRITE-07.
046300     MOVE "F-ORD-07" TO PAR-NAME.
046400     PERFORM  PRINT-DETAIL.
046500*****************TEST (h) ******************************
046600 F-ORD-08.
046700     MOVE ZERO TO WS-INT.
046800 F-ORD-TEST-08.
046900     COMPUTE WS-INT = FUNCTION ORD("A") +
047000             FUNCTION ORD(A).
047100     IF WS-INT = 137 THEN
047200                        PERFORM PASS
047300     ELSE
047400                        MOVE 137  TO CORRECT-N
047500                        MOVE WS-INT TO COMPUTED-N
047600                        PERFORM FAIL.
047700     GO TO F-ORD-WRITE-08.
047800 F-ORD-DELETE-08.
047900     PERFORM  DE-LETE.
048000     GO TO    F-ORD-WRITE-08.
048100 F-ORD-WRITE-08.
048200     MOVE "F-ORD-08" TO PAR-NAME.
048300     PERFORM  PRINT-DETAIL.
048400*****************SPECIAL TEST 1******************************
048500 F-ORD-09.
048600     PERFORM F-ORD-TEST-09 UNTIL FUNCTION ORD(ARG1) = 67.
048700     IF ARG1 = "B" THEN
048800                        PERFORM PASS
048900     ELSE
049000                        PERFORM FAIL.
049100     GO TO F-ORD-WRITE-09.
049200*
049300 F-ORD-TEST-09.
049400     MOVE "B" TO ARG1.
049500*
049600 F-ORD-DELETE-09.
049700     PERFORM  DE-LETE.
049800     GO TO    F-ORD-WRITE-09.
049900 F-ORD-WRITE-09.
050000     MOVE "F-ORD-09" TO PAR-NAME.
050100     PERFORM  PRINT-DETAIL.
050200*******************END OF TESTS**************************
050300 CCVS-EXIT SECTION.
050400 CCVS-999999.
050500     GO TO CLOSE-FILES.
