000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF134A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function REVERSE.   *
000900*                                                         *
001000***********************************************************
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.
001400     XXXXX082.
001500 OBJECT-COMPUTER.
001600     XXXXX083.
001700 INPUT-OUTPUT SECTION.
001800 FILE-CONTROL.
001900     SELECT PRINT-FILE ASSIGN TO
002000     XXXXX055.
002100 DATA DIVISION.
002200 FILE SECTION.
002300 FD  PRINT-FILE.
002400 01  PRINT-REC PICTURE X(120).
002500 01  DUMMY-RECORD PICTURE X(120).
002600 WORKING-STORAGE SECTION.
002700***********************************************************
002800* Variables specific to the Intrinsic Function Test IF134A*
002900***********************************************************
003000 01  A                   PIC A(10)           VALUE "tumble".
003100 01  B                   PIC A(10)           VALUE "WEED".
003200 01  C                   PIC X(10)           VALUE "Was".
003300 01  D                   PIC X(10)           VALUE "4".
003400 01  E                   PIC X(10)           VALUE "And4".
003500 01  TEMP1               PIC X(7)            VALUE "giZZard".
003600 01  TEMP                PIC S9(10).
003700 01  WS-ANUM          PIC X(10).
003800*
003900**********************************************************
004000*
004100 01  TEST-RESULTS.
004200     02 FILLER                   PIC X      VALUE SPACE.
004300     02 FEATURE                  PIC X(20)  VALUE SPACE.
004400     02 FILLER                   PIC X      VALUE SPACE.
004500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
004600     02 FILLER                   PIC X      VALUE SPACE.
004700     02  PAR-NAME.
004800       03 FILLER                 PIC X(19)  VALUE SPACE.
004900       03  PARDOT-X              PIC X      VALUE SPACE.
005000       03 DOTVALUE               PIC 99     VALUE ZERO.
005100     02 FILLER                   PIC X(8)   VALUE SPACE.
005200     02 RE-MARK                  PIC X(61).
005300 01  TEST-COMPUTED.
005400     02 FILLER                   PIC X(30)  VALUE SPACE.
005500     02 FILLER                   PIC X(17)  VALUE
005600            "       COMPUTED=".
005700     02 COMPUTED-X.
005800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
005900     03 COMPUTED-N               REDEFINES COMPUTED-A
006000                                 PIC -9(9).9(9).
006100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
006300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
006400     03       CM-18V0 REDEFINES COMPUTED-A.
006500         04 COMPUTED-18V0                    PIC -9(18).
006600         04 FILLER                           PIC X.
006700     03 FILLER PIC X(50) VALUE SPACE.
006800 01  TEST-CORRECT.
006900     02 FILLER PIC X(30) VALUE SPACE.
007000     02 FILLER PIC X(17) VALUE "       CORRECT =".
007100     02 CORRECT-X.
007200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
007300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
007400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
007500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
007600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
007700     03      CR-18V0 REDEFINES CORRECT-A.
007800         04 CORRECT-18V0                     PIC -9(18).
007900         04 FILLER                           PIC X.
008000     03 FILLER PIC X(2) VALUE SPACE.
008100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008200 01  CCVS-C-1.
008300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
008400-    "SS  PARAGRAPH-NAME
008500-    "       REMARKS".
008600     02 FILLER                     PIC X(20)    VALUE SPACE.
008700 01  CCVS-C-2.
008800     02 FILLER                     PIC X        VALUE SPACE.
008900     02 FILLER                     PIC X(6)     VALUE "TESTED".
009000     02 FILLER                     PIC X(15)    VALUE SPACE.
009100     02 FILLER                     PIC X(4)     VALUE "FAIL".
009200     02 FILLER                     PIC X(94)    VALUE SPACE.
009300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
009400 01  REC-CT                        PIC 99       VALUE ZERO.
009500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
009600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
009700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
009800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
009900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
010000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
010100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
010200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
010300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
010400 01  CCVS-H-1.
010500     02  FILLER                    PIC X(39)    VALUE SPACES.
010600     02  FILLER                    PIC X(42)    VALUE
010700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
010800     02  FILLER                    PIC X(39)    VALUE SPACES.
010900 01  CCVS-H-2A.
011000   02  FILLER                        PIC X(40)  VALUE SPACE.
011100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
011200   02  FILLER                        PIC XXXX   VALUE
011300     "4.2 ".
011400   02  FILLER                        PIC X(28)  VALUE
011500            " COPY - NOT FOR DISTRIBUTION".
011600   02  FILLER                        PIC X(41)  VALUE SPACE.
011700
011800 01  CCVS-H-2B.
011900   02  FILLER                        PIC X(15)  VALUE
012000            "TEST RESULT OF ".
012100   02  TEST-ID                       PIC X(9).
012200   02  FILLER                        PIC X(4)   VALUE
012300            " IN ".
012400   02  FILLER                        PIC X(12)  VALUE
012500     " HIGH       ".
012600   02  FILLER                        PIC X(22)  VALUE
012700            " LEVEL VALIDATION FOR ".
012800   02  FILLER                        PIC X(58)  VALUE
012900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
013000 01  CCVS-H-3.
013100     02  FILLER                      PIC X(34)  VALUE
013200            " FOR OFFICIAL USE ONLY    ".
013300     02  FILLER                      PIC X(58)  VALUE
013400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
013500     02  FILLER                      PIC X(28)  VALUE
013600            "  COPYRIGHT   1985 ".
013700 01  CCVS-E-1.
013800     02 FILLER                       PIC X(52)  VALUE SPACE.
013900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
014000     02 ID-AGAIN                     PIC X(9).
014100     02 FILLER                       PIC X(45)  VALUE SPACES.
014200 01  CCVS-E-2.
014300     02  FILLER                      PIC X(31)  VALUE SPACE.
014400     02  FILLER                      PIC X(21)  VALUE SPACE.
014500     02 CCVS-E-2-2.
014600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
014700         03 FILLER                   PIC X      VALUE SPACE.
014800         03 ENDER-DESC               PIC X(44)  VALUE
014900            "ERRORS ENCOUNTERED".
015000 01  CCVS-E-3.
015100     02  FILLER                      PIC X(22)  VALUE
015200            " FOR OFFICIAL USE ONLY".
015300     02  FILLER                      PIC X(12)  VALUE SPACE.
015400     02  FILLER                      PIC X(58)  VALUE
015500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015600     02  FILLER                      PIC X(13)  VALUE SPACE.
015700     02 FILLER                       PIC X(15)  VALUE
015800             " COPYRIGHT 1985".
015900 01  CCVS-E-4.
016000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
016100     02 FILLER                       PIC X(4)   VALUE " OF ".
016200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
016300     02 FILLER                       PIC X(40)  VALUE
016400      "  TESTS WERE EXECUTED SUCCESSFULLY".
016500 01  XXINFO.
016600     02 FILLER                       PIC X(19)  VALUE
016700            "*** INFORMATION ***".
016800     02 INFO-TEXT.
016900       04 FILLER                     PIC X(8)   VALUE SPACE.
017000       04 XXCOMPUTED                 PIC X(20).
017100       04 FILLER                     PIC X(5)   VALUE SPACE.
017200       04 XXCORRECT                  PIC X(20).
017300     02 INF-ANSI-REFERENCE           PIC X(48).
017400 01  HYPHEN-LINE.
017500     02 FILLER  PIC IS X VALUE IS SPACE.
017600     02 FILLER  PIC IS X(65)    VALUE IS "************************
017700-    "*****************************************".
017800     02 FILLER  PIC IS X(54)    VALUE IS "************************
017900-    "******************************".
018000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
018100     "IF134A".
018200 PROCEDURE DIVISION.
018300 CCVS1 SECTION.
018400 OPEN-FILES.
018500     OPEN     OUTPUT PRINT-FILE.
018600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
018700     MOVE    SPACE TO TEST-RESULTS.
018800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
018900     GO TO CCVS1-EXIT.
019000 CLOSE-FILES.
019100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
019200 TERMINATE-CCVS.
019300     STOP     RUN.
019400 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
019500 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
019600 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
019700 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
019800     MOVE "****TEST DELETED****" TO RE-MARK.
019900 PRINT-DETAIL.
020000     IF REC-CT NOT EQUAL TO ZERO
020100             MOVE "." TO PARDOT-X
020200             MOVE REC-CT TO DOTVALUE.
020300     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
020400     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
020500        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
020600          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
020700     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
020800     MOVE SPACE TO CORRECT-X.
020900     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
021000     MOVE     SPACE TO RE-MARK.
021100 HEAD-ROUTINE.
021200     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021300     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021400     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
021500     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
021600 COLUMN-NAMES-ROUTINE.
021700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
021800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
022000 END-ROUTINE.
022100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
022200 END-RTN-EXIT.
022300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022400 END-ROUTINE-1.
022500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
022600      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
022700      ADD PASS-COUNTER TO ERROR-HOLD.
022800      MOVE PASS-COUNTER TO CCVS-E-4-1.
022900      MOVE ERROR-HOLD TO CCVS-E-4-2.
023000      MOVE CCVS-E-4 TO CCVS-E-2-2.
023100      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
023200  END-ROUTINE-12.
023300      MOVE "TEST(S) FAILED" TO ENDER-DESC.
023400     IF       ERROR-COUNTER IS EQUAL TO ZERO
023500         MOVE "NO " TO ERROR-TOTAL
023600         ELSE
023700         MOVE ERROR-COUNTER TO ERROR-TOTAL.
023800     MOVE     CCVS-E-2 TO DUMMY-RECORD.
023900     PERFORM WRITE-LINE.
024000 END-ROUTINE-13.
024100     IF DELETE-COUNTER IS EQUAL TO ZERO
024200         MOVE "NO " TO ERROR-TOTAL  ELSE
024300         MOVE DELETE-COUNTER TO ERROR-TOTAL.
024400     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
024500     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024600      IF   INSPECT-COUNTER EQUAL TO ZERO
024700          MOVE "NO " TO ERROR-TOTAL
024800      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
024900      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
025000      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025100     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025200 WRITE-LINE.
025300     ADD 1 TO RECORD-COUNT.
025400Y    IF RECORD-COUNT GREATER 42
025500Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
025600Y        MOVE SPACE TO DUMMY-RECORD
025700Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
025800Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
025900Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
026000Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
026100Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
026200Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
026300Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
026400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
026500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
026600Y        MOVE ZERO TO RECORD-COUNT.
026700     PERFORM WRT-LN.
026800 WRT-LN.
026900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
027000     MOVE SPACE TO DUMMY-RECORD.
027100 BLANK-LINE-PRINT.
027200     PERFORM WRT-LN.
027300 FAIL-ROUTINE.
027400     IF     COMPUTED-X NOT EQUAL TO SPACE
027500            GO TO FAIL-ROUTINE-WRITE.
027600     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
027700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
027800     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
027900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028000     MOVE   SPACES TO INF-ANSI-REFERENCE.
028100     GO TO  FAIL-ROUTINE-EX.
028200 FAIL-ROUTINE-WRITE.
028300     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
028400     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
028500     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
028600     MOVE   SPACES TO COR-ANSI-REFERENCE.
028700 FAIL-ROUTINE-EX. EXIT.
028800 BAIL-OUT.
028900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
029000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
029100 BAIL-OUT-WRITE.
029200     MOVE CORRECT-A TO XXCORRECT.
029300     MOVE COMPUTED-A TO XXCOMPUTED.
029400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029600     MOVE   SPACES TO INF-ANSI-REFERENCE.
029700 BAIL-OUT-EX. EXIT.
029800 CCVS1-EXIT.
029900     EXIT.
030000********************************************************
030100*                                                      *
030200*    Intrinsic Function Tests         IF134A - REVERSE *
030300*                                                      *
030400********************************************************
030500 SECT-IF134A SECTION.
030600 F-REVERSE-INFO.
030700     MOVE     "See ref. A-67 2.38" TO ANSI-REFERENCE.
030800     MOVE     "REVERSE Function"     TO FEATURE.
030900*****************TEST (a) ******************************
031000 F-REVERSE-01.
031100     MOVE SPACES TO WS-ANUM.
031200 F-REVERSE-TEST-01.
031300     MOVE FUNCTION REVERSE("figure") TO WS-ANUM.
031400     IF WS-ANUM = "erugif" THEN
031500                    PERFORM PASS
031600     ELSE
031700                    MOVE "erugif"  TO CORRECT-A
031800                    MOVE WS-ANUM TO COMPUTED-A
031900                    PERFORM FAIL.
032000     GO TO F-REVERSE-WRITE-01.
032100 F-REVERSE-DELETE-01.
032200     PERFORM  DE-LETE.
032300     GO TO    F-REVERSE-WRITE-01.
032400 F-REVERSE-WRITE-01.
032500     MOVE "F-REVERSE-01" TO PAR-NAME.
032600     PERFORM  PRINT-DETAIL.
032700*****************TEST (b) ******************************
032800 F-REVERSE-02.
032900     MOVE SPACES TO WS-ANUM.
033000 F-REVERSE-TEST-02.
033100     IF FUNCTION REVERSE("CAPS") = "SPAC" THEN
033200                    PERFORM PASS
033300     ELSE
033400                    MOVE "SPAC"  TO CORRECT-A
033500                    PERFORM FAIL.
033600     GO TO F-REVERSE-WRITE-02.
033700 F-REVERSE-DELETE-02.
033800     PERFORM  DE-LETE.
033900     GO TO    F-REVERSE-WRITE-02.
034000 F-REVERSE-WRITE-02.
034100     MOVE "F-REVERSE-02" TO PAR-NAME.
034200     PERFORM  PRINT-DETAIL.
034300*****************TEST (c) ******************************
034400 F-REVERSE-03.
034500     MOVE SPACES TO WS-ANUM.
034600 F-REVERSE-TEST-03.
034700     MOVE FUNCTION REVERSE("highnLOW") TO WS-ANUM.
034800     IF WS-ANUM = "WOLnhgih" THEN
034900                    PERFORM PASS
035000     ELSE
035100                    MOVE "WOLnhgih"  TO CORRECT-A
035200                    MOVE WS-ANUM TO COMPUTED-A
035300                    PERFORM FAIL.
035400     GO TO F-REVERSE-WRITE-03.
035500 F-REVERSE-DELETE-03.
035600     PERFORM  DE-LETE.
035700     GO TO    F-REVERSE-WRITE-03.
035800 F-REVERSE-WRITE-03.
035900     MOVE "F-REVERSE-03" TO PAR-NAME.
036000     PERFORM  PRINT-DETAIL.
036100*****************TEST (d) ******************************
036200 F-REVERSE-04.
036300     MOVE SPACES TO WS-ANUM.
036400 F-REVERSE-TEST-04.
036500     MOVE FUNCTION REVERSE("95") TO WS-ANUM.
036600     IF WS-ANUM = "59" THEN
036700                    PERFORM PASS
036800     ELSE
036900                    MOVE "59"  TO CORRECT-A
037000                    MOVE WS-ANUM TO COMPUTED-A
037100                    PERFORM FAIL.
037200     GO TO F-REVERSE-WRITE-04.
037300 F-REVERSE-DELETE-04.
037400     PERFORM  DE-LETE.
037500     GO TO    F-REVERSE-WRITE-04.
037600 F-REVERSE-WRITE-04.
037700     MOVE "F-REVERSE-04" TO PAR-NAME.
037800     PERFORM  PRINT-DETAIL.
037900*****************TEST (e) ******************************
038000 F-REVERSE-05.
038100     MOVE SPACES TO WS-ANUM.
038200 F-REVERSE-TEST-05.
038300     MOVE FUNCTION REVERSE("8isaNUMBER") TO WS-ANUM.
038400     IF WS-ANUM = "REBMUNasi8" THEN
038500                    PERFORM PASS
038600     ELSE
038700                    MOVE "REBMUNasi8"  TO CORRECT-A
038800                    MOVE WS-ANUM TO COMPUTED-A
038900                    PERFORM FAIL.
039000     GO TO F-REVERSE-WRITE-05.
039100 F-REVERSE-DELETE-05.
039200     PERFORM  DE-LETE.
039300     GO TO    F-REVERSE-WRITE-05.
039400 F-REVERSE-WRITE-05.
039500     MOVE "F-REVERSE-05" TO PAR-NAME.
039600     PERFORM  PRINT-DETAIL.
039700*****************TEST (f) ******************************
039800 F-REVERSE-06.
039900     MOVE SPACES TO WS-ANUM.
040000 F-REVERSE-TEST-06.
040100     MOVE FUNCTION REVERSE(A) TO WS-ANUM.
040200     IF WS-ANUM = "    elbmut" THEN
040300                    PERFORM PASS
040400     ELSE
040500                    MOVE "    elbmut"  TO CORRECT-A
040600                    MOVE WS-ANUM TO COMPUTED-A
040700                    PERFORM FAIL.
040800     GO TO F-REVERSE-WRITE-06.
040900 F-REVERSE-DELETE-06.
041000     PERFORM  DE-LETE.
041100     GO TO    F-REVERSE-WRITE-06.
041200 F-REVERSE-WRITE-06.
041300     MOVE "F-REVERSE-06" TO PAR-NAME.
041400     PERFORM  PRINT-DETAIL.
041500*****************TEST (g) ******************************
041600 F-REVERSE-07.
041700     MOVE SPACES TO WS-ANUM.
041800 F-REVERSE-TEST-07.
041900     MOVE FUNCTION REVERSE(B) TO WS-ANUM.
042000     IF WS-ANUM = "      DEEW" THEN
042100                    PERFORM PASS
042200     ELSE
042300                    MOVE "      DEEW"  TO CORRECT-A
042400                    MOVE WS-ANUM TO COMPUTED-A
042500                    PERFORM FAIL.
042600     GO TO F-REVERSE-WRITE-07.
042700 F-REVERSE-DELETE-07.
042800     PERFORM  DE-LETE.
042900     GO TO    F-REVERSE-WRITE-07.
043000 F-REVERSE-WRITE-07.
043100     MOVE "F-REVERSE-07" TO PAR-NAME.
043200     PERFORM  PRINT-DETAIL.
043300*****************TEST (h) ******************************
043400 F-REVERSE-08.
043500     MOVE SPACES TO WS-ANUM.
043600 F-REVERSE-TEST-08.
043700     MOVE FUNCTION REVERSE(C) TO WS-ANUM.
043800     IF WS-ANUM = "       saW" THEN
043900                    PERFORM PASS
044000     ELSE
044100                    MOVE "       saW"  TO CORRECT-A
044200                    MOVE WS-ANUM TO COMPUTED-A
044300                    PERFORM FAIL.
044400     GO TO F-REVERSE-WRITE-08.
044500 F-REVERSE-DELETE-08.
044600     PERFORM  DE-LETE.
044700     GO TO    F-REVERSE-WRITE-08.
044800 F-REVERSE-WRITE-08.
044900     MOVE "F-REVERSE-08" TO PAR-NAME.
045000     PERFORM  PRINT-DETAIL.
045100*****************TEST (i) ******************************
045200 F-REVERSE-09.
045300     MOVE SPACES TO WS-ANUM.
045400 F-REVERSE-TEST-09.
045500     MOVE FUNCTION REVERSE(D) TO WS-ANUM.
045600     IF WS-ANUM = "         4" THEN
045700                    PERFORM PASS
045800     ELSE
045900                    MOVE "         4"  TO CORRECT-A
046000                    MOVE WS-ANUM TO COMPUTED-A
046100                    PERFORM FAIL.
046200     GO TO F-REVERSE-WRITE-09.
046300 F-REVERSE-DELETE-09.
046400     PERFORM  DE-LETE.
046500     GO TO    F-REVERSE-WRITE-09.
046600 F-REVERSE-WRITE-09.
046700     MOVE "F-REVERSE-09" TO PAR-NAME.
046800     PERFORM  PRINT-DETAIL.
046900*****************TEST (j) ******************************
047000 F-REVERSE-10.
047100     MOVE SPACES TO WS-ANUM.
047200 F-REVERSE-TEST-10.
047300     MOVE FUNCTION REVERSE(E) TO WS-ANUM.
047400     IF WS-ANUM = "      4dnA" THEN
047500                    PERFORM PASS
047600     ELSE
047700                    MOVE "      4dnA"  TO CORRECT-A
047800                    MOVE WS-ANUM TO COMPUTED-A
047900                    PERFORM FAIL.
048000     GO TO F-REVERSE-WRITE-10.
048100 F-REVERSE-DELETE-10.
048200     PERFORM  DE-LETE.
048300     GO TO    F-REVERSE-WRITE-10.
048400 F-REVERSE-WRITE-10.
048500     MOVE "F-REVERSE-10" TO PAR-NAME.
048600     PERFORM  PRINT-DETAIL.
048700*****************TEST (k) ******************************
048800 F-REVERSE-11.
048900     MOVE ZERO TO TEMP.
049000 F-REVERSE-TEST-11.
049100     COMPUTE TEMP = FUNCTION LENGTH(FUNCTION REVERSE("Homer")).
049200     IF TEMP = 5 THEN
049300                    PERFORM PASS
049400     ELSE
049500                    MOVE 5  TO CORRECT-N
049600                    MOVE TEMP TO COMPUTED-N
049700                    PERFORM FAIL.
049800     GO TO F-REVERSE-WRITE-11.
049900 F-REVERSE-DELETE-11.
050000     PERFORM  DE-LETE.
050100     GO TO    F-REVERSE-WRITE-11.
050200 F-REVERSE-WRITE-11.
050300     MOVE "F-REVERSE-11" TO PAR-NAME.
050400     PERFORM  PRINT-DETAIL.
050500*****************TEST (l) ******************************
050600 F-REVERSE-12.
050700     MOVE SPACES TO WS-ANUM.
050800 F-REVERSE-TEST-12.
050900     MOVE FUNCTION REVERSE(FUNCTION REVERSE("giZZard"))
051000       TO WS-ANUM.
051100     IF WS-ANUM = "giZZard" THEN
051200                    PERFORM PASS
051300     ELSE
051400                    MOVE "giZZard"  TO CORRECT-A
051500                    MOVE WS-ANUM TO COMPUTED-A
051600                    PERFORM FAIL.
051700     GO TO F-REVERSE-WRITE-12.
051800 F-REVERSE-DELETE-12.
051900     PERFORM  DE-LETE.
052000     GO TO    F-REVERSE-WRITE-12.
052100 F-REVERSE-WRITE-12.
052200     MOVE "F-REVERSE-12" TO PAR-NAME.
052300     PERFORM  PRINT-DETAIL.
052400*****************TEST (m) ******************************
052500 F-REVERSE-13.
052600     MOVE ZERO TO TEMP.
052700 F-REVERSE-TEST-13.
052800     COMPUTE TEMP = FUNCTION LENGTH(FUNCTION REVERSE("HOMER")) +
052900                    FUNCTION LENGTH(FUNCTION REVERSE("Gizzard")).
053000     IF TEMP = 12 THEN
053100                    PERFORM PASS
053200     ELSE
053300                    MOVE 12  TO CORRECT-N
053400                    MOVE TEMP TO COMPUTED-N
053500                    PERFORM FAIL.
053600     GO TO F-REVERSE-WRITE-13.
053700 F-REVERSE-DELETE-13.
053800     PERFORM  DE-LETE.
053900     GO TO    F-REVERSE-WRITE-13.
054000 F-REVERSE-WRITE-13.
054100     MOVE "F-REVERSE-13" TO PAR-NAME.
054200     PERFORM  PRINT-DETAIL.
054300*******************END OF TESTS**************************
054400 CCVS-EXIT SECTION.
054500 CCVS-999999.
054600     GO TO CLOSE-FILES.
