000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF130A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function            *
000900* PRESENT-VALUE.                                          *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT PRINT-FILE ASSIGN TO
002100     XXXXX055.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  PRINT-FILE.
002500 01  PRINT-REC PICTURE X(120).
002600 01  DUMMY-RECORD PICTURE X(120).
002700 WORKING-STORAGE SECTION.
002800***********************************************************
002900* Variables specific to the Intrinsic Function Test IF130A*
003000***********************************************************
003100 01  A                   PIC S9(10)          VALUE 5.
003200 01  B                   PIC S9(10)          VALUE 7.
003300 01  C                   PIC S9(10)          VALUE -4.
003400 01  D                   PIC S9(10)          VALUE 10.
003500 01  E                   PIC S9(5)V9(5)      VALUE 34.26.
003600 01  F                   PIC S9(5)V9(5)      VALUE -8.32.
003700 01  G                   PIC S9(5)V9(5)      VALUE 4.08.
003800 01  H                   PIC S9(5)V9(5)      VALUE 5.3.
003900 01  I                   PIC S9(5)V9(5)      VALUE 0.0009.
004000 01  J                   PIC S9(5)V9(5)      VALUE 0.0008.
004100 01  K                   PIC S9(10)          VALUE 23000.
004200 01  L                   PIC S9(10)          VALUE -23000.
004300 01  P                   PIC S9(10)          VALUE 1.
004400 01  Q                   PIC S9(10)          VALUE 3.
004500 01  R                   PIC S9(10)          VALUE 5.
004600 01  ARG1                PIC S9(10)          VALUE 0.
004700 01  ARR                                     VALUE "40537".
004800     02  IND OCCURS 5 TIMES PIC 9.
004900 01  TEMP                PIC S9(10)V9(5).
005000 01  WS-NUM              PIC S9(5)V9(6).
005100 01  MIN-RANGE           PIC S9(5)V9(7).
005200 01  MAX-RANGE           PIC S9(5)V9(7).
005300*
005400**********************************************************
005500*
005600 01  TEST-RESULTS.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02 FEATURE                  PIC X(20)  VALUE SPACE.
005900     02 FILLER                   PIC X      VALUE SPACE.
006000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006100     02 FILLER                   PIC X      VALUE SPACE.
006200     02  PAR-NAME.
006300       03 FILLER                 PIC X(19)  VALUE SPACE.
006400       03  PARDOT-X              PIC X      VALUE SPACE.
006500       03 DOTVALUE               PIC 99     VALUE ZERO.
006600     02 FILLER                   PIC X(8)   VALUE SPACE.
006700     02 RE-MARK                  PIC X(61).
006800 01  TEST-COMPUTED.
006900     02 FILLER                   PIC X(30)  VALUE SPACE.
007000     02 FILLER                   PIC X(17)  VALUE
007100            "       COMPUTED=".
007200     02 COMPUTED-X.
007300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007400     03 COMPUTED-N               REDEFINES COMPUTED-A
007500                                 PIC -9(9).9(9).
007600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007900     03       CM-18V0 REDEFINES COMPUTED-A.
008000         04 COMPUTED-18V0                    PIC -9(18).
008100         04 FILLER                           PIC X.
008200     03 FILLER PIC X(50) VALUE SPACE.
008300 01  TEST-CORRECT.
008400     02 FILLER PIC X(30) VALUE SPACE.
008500     02 FILLER PIC X(17) VALUE "       CORRECT =".
008600     02 CORRECT-X.
008700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
009000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009200     03      CR-18V0 REDEFINES CORRECT-A.
009300         04 CORRECT-18V0                     PIC -9(18).
009400         04 FILLER                           PIC X.
009500     03 FILLER PIC X(2) VALUE SPACE.
009600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009700 01  TEST-CORRECT-MIN.
009800     02 FILLER PIC X(30) VALUE SPACE.
009900     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
010000     02 CORRECTMI-X.
010100     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
010200     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
010300     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
010400     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
010500     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
010600     03      CR-18V0 REDEFINES CORRECTMI-A.
010700         04 CORRECTMI-18V0                     PIC -9(18).
010800         04 FILLER                           PIC X.
010900     03 FILLER PIC X(2) VALUE SPACE.
011000     03 FILLER                           PIC X(48) VALUE SPACE.
011100 01  TEST-CORRECT-MAX.
011200     02 FILLER PIC X(30) VALUE SPACE.
011300     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
011400     02 CORRECTMA-X.
011500     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
011600     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
011700     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
011800     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
011900     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
012000     03      CR-18V0 REDEFINES CORRECTMA-A.
012100         04 CORRECTMA-18V0                     PIC -9(18).
012200         04 FILLER                           PIC X.
012300     03 FILLER PIC X(2) VALUE SPACE.
012400     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012500 01  CCVS-C-1.
012600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012700-    "SS  PARAGRAPH-NAME
012800-    "       REMARKS".
012900     02 FILLER                     PIC X(20)    VALUE SPACE.
013000 01  CCVS-C-2.
013100     02 FILLER                     PIC X        VALUE SPACE.
013200     02 FILLER                     PIC X(6)     VALUE "TESTED".
013300     02 FILLER                     PIC X(15)    VALUE SPACE.
013400     02 FILLER                     PIC X(4)     VALUE "FAIL".
013500     02 FILLER                     PIC X(94)    VALUE SPACE.
013600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013700 01  REC-CT                        PIC 99       VALUE ZERO.
013800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
014000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
014100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014700 01  CCVS-H-1.
014800     02  FILLER                    PIC X(39)    VALUE SPACES.
014900     02  FILLER                    PIC X(42)    VALUE
015000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
015100     02  FILLER                    PIC X(39)    VALUE SPACES.
015200 01  CCVS-H-2A.
015300   02  FILLER                        PIC X(40)  VALUE SPACE.
015400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015500   02  FILLER                        PIC XXXX   VALUE
015600     "4.2 ".
015700   02  FILLER                        PIC X(28)  VALUE
015800            " COPY - NOT FOR DISTRIBUTION".
015900   02  FILLER                        PIC X(41)  VALUE SPACE.
016000
016100 01  CCVS-H-2B.
016200   02  FILLER                        PIC X(15)  VALUE
016300            "TEST RESULT OF ".
016400   02  TEST-ID                       PIC X(9).
016500   02  FILLER                        PIC X(4)   VALUE
016600            " IN ".
016700   02  FILLER                        PIC X(12)  VALUE
016800     " HIGH       ".
016900   02  FILLER                        PIC X(22)  VALUE
017000            " LEVEL VALIDATION FOR ".
017100   02  FILLER                        PIC X(58)  VALUE
017200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017300 01  CCVS-H-3.
017400     02  FILLER                      PIC X(34)  VALUE
017500            " FOR OFFICIAL USE ONLY    ".
017600     02  FILLER                      PIC X(58)  VALUE
017700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017800     02  FILLER                      PIC X(28)  VALUE
017900            "  COPYRIGHT   1985 ".
018000 01  CCVS-E-1.
018100     02 FILLER                       PIC X(52)  VALUE SPACE.
018200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018300     02 ID-AGAIN                     PIC X(9).
018400     02 FILLER                       PIC X(45)  VALUE SPACES.
018500 01  CCVS-E-2.
018600     02  FILLER                      PIC X(31)  VALUE SPACE.
018700     02  FILLER                      PIC X(21)  VALUE SPACE.
018800     02 CCVS-E-2-2.
018900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
019000         03 FILLER                   PIC X      VALUE SPACE.
019100         03 ENDER-DESC               PIC X(44)  VALUE
019200            "ERRORS ENCOUNTERED".
019300 01  CCVS-E-3.
019400     02  FILLER                      PIC X(22)  VALUE
019500            " FOR OFFICIAL USE ONLY".
019600     02  FILLER                      PIC X(12)  VALUE SPACE.
019700     02  FILLER                      PIC X(58)  VALUE
019800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019900     02  FILLER                      PIC X(13)  VALUE SPACE.
020000     02 FILLER                       PIC X(15)  VALUE
020100             " COPYRIGHT 1985".
020200 01  CCVS-E-4.
020300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020400     02 FILLER                       PIC X(4)   VALUE " OF ".
020500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020600     02 FILLER                       PIC X(40)  VALUE
020700      "  TESTS WERE EXECUTED SUCCESSFULLY".
020800 01  XXINFO.
020900     02 FILLER                       PIC X(19)  VALUE
021000            "*** INFORMATION ***".
021100     02 INFO-TEXT.
021200       04 FILLER                     PIC X(8)   VALUE SPACE.
021300       04 XXCOMPUTED                 PIC X(20).
021400       04 FILLER                     PIC X(5)   VALUE SPACE.
021500       04 XXCORRECT                  PIC X(20).
021600     02 INF-ANSI-REFERENCE           PIC X(48).
021700 01  HYPHEN-LINE.
021800     02 FILLER  PIC IS X VALUE IS SPACE.
021900     02 FILLER  PIC IS X(65)    VALUE IS "************************
022000-    "*****************************************".
022100     02 FILLER  PIC IS X(54)    VALUE IS "************************
022200-    "******************************".
022300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022400     "IF130A".
022500 PROCEDURE DIVISION.
022600 CCVS1 SECTION.
022700 OPEN-FILES.
022800     OPEN     OUTPUT PRINT-FILE.
022900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
023000     MOVE    SPACE TO TEST-RESULTS.
023100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023200     GO TO CCVS1-EXIT.
023300 CLOSE-FILES.
023400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023500 TERMINATE-CCVS.
023600     STOP     RUN.
023700 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023800 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023900 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
024000 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
024100     MOVE "****TEST DELETED****" TO RE-MARK.
024200 PRINT-DETAIL.
024300     IF REC-CT NOT EQUAL TO ZERO
024400             MOVE "." TO PARDOT-X
024500             MOVE REC-CT TO DOTVALUE.
024600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024800        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024900          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
025000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
025100     MOVE SPACE TO CORRECT-X.
025200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025300     MOVE     SPACE TO RE-MARK.
025400 HEAD-ROUTINE.
025500     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025600     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025700     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025800     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025900 COLUMN-NAMES-ROUTINE.
026000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026300 END-ROUTINE.
026400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026500 END-RTN-EXIT.
026600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026700 END-ROUTINE-1.
026800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026900      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
027000      ADD PASS-COUNTER TO ERROR-HOLD.
027100      MOVE PASS-COUNTER TO CCVS-E-4-1.
027200      MOVE ERROR-HOLD TO CCVS-E-4-2.
027300      MOVE CCVS-E-4 TO CCVS-E-2-2.
027400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027500  END-ROUTINE-12.
027600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027700     IF       ERROR-COUNTER IS EQUAL TO ZERO
027800         MOVE "NO " TO ERROR-TOTAL
027900         ELSE
028000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
028100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028200     PERFORM WRITE-LINE.
028300 END-ROUTINE-13.
028400     IF DELETE-COUNTER IS EQUAL TO ZERO
028500         MOVE "NO " TO ERROR-TOTAL  ELSE
028600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028900      IF   INSPECT-COUNTER EQUAL TO ZERO
029000          MOVE "NO " TO ERROR-TOTAL
029100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029500 WRITE-LINE.
029600     ADD 1 TO RECORD-COUNT.
029700Y    IF RECORD-COUNT GREATER 42
029800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029900Y        MOVE SPACE TO DUMMY-RECORD
030000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
030100Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030200Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030300Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030400Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030500Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
030600Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
030700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030900Y        MOVE ZERO TO RECORD-COUNT.
031000     PERFORM WRT-LN.
031100 WRT-LN.
031200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031300     MOVE SPACE TO DUMMY-RECORD.
031400 BLANK-LINE-PRINT.
031500     PERFORM WRT-LN.
031600 FAIL-ROUTINE.
031700     IF     COMPUTED-X NOT EQUAL TO SPACE
031800            GO TO FAIL-ROUTINE-WRITE.
031900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032300     MOVE   SPACES TO INF-ANSI-REFERENCE.
032400     GO TO  FAIL-ROUTINE-EX.
032500 FAIL-ROUTINE-WRITE.
032600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
032700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
032800                              CORMA-ANSI-REFERENCE.
032900     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
033000           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
033100           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
033200     ELSE
033300           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
033400     PERFORM WRITE-LINE.
033500     MOVE   SPACES TO COR-ANSI-REFERENCE.
033600 FAIL-ROUTINE-EX. EXIT.
033700 BAIL-OUT.
033800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
034000 BAIL-OUT-WRITE.
034100     MOVE CORRECT-A TO XXCORRECT.
034200     MOVE COMPUTED-A TO XXCOMPUTED.
034300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
034400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034500     MOVE   SPACES TO INF-ANSI-REFERENCE.
034600 BAIL-OUT-EX. EXIT.
034700 CCVS1-EXIT.
034800     EXIT.
034900********************************************************
035000*                                                      *
035100*    Intrinsic Function Tests   IF130A - PRESENT-VALUE *
035200*                                                      *
035300********************************************************
035400 SECT-IF130A SECTION.
035500 F-PRES-VAL-INFO.
035600     MOVE     "See ref. A-63 2.34" TO ANSI-REFERENCE.
035700     MOVE     "PRESENT-VALUE Function" TO FEATURE.
035800*****************TEST (a) - SIMPLE TEST*****************
035900 F-PRES-VAL-01.
036000     MOVE ZERO TO WS-NUM.
036100     MOVE 43.9991 TO MIN-RANGE.
036200     MOVE 44.0009 TO MAX-RANGE.
036300 F-PRES-VAL-TEST-01.
036400     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(0, 23, 12, 9).
036500     IF (WS-NUM >= MIN-RANGE) AND
036600        (WS-NUM <= MAX-RANGE) THEN
036700                    PERFORM PASS
036800     ELSE
036900                    MOVE WS-NUM TO COMPUTED-N
037000                    MOVE MIN-RANGE TO CORRECT-MIN
037100                    MOVE MAX-RANGE TO CORRECT-MAX
037200                    PERFORM FAIL.
037300     GO TO F-PRES-VAL-WRITE-01.
037400 F-PRES-VAL-DELETE-01.
037500     PERFORM  DE-LETE.
037600     GO TO    F-PRES-VAL-WRITE-01.
037700 F-PRES-VAL-WRITE-01.
037800     MOVE "F-PRES-VAL-01" TO PAR-NAME.
037900     PERFORM  PRINT-DETAIL.
038000*****************TEST (b) - SIMPLE TEST*****************
038100 F-PRES-VAL-02.
038200     EVALUATE FUNCTION PRESENT-VALUE(1, 10, 20, 10, 5)
038300     WHEN  11.5623 THRU  11.5627
038400                    PERFORM PASS
038500     WHEN OTHER
038600                    PERFORM FAIL.
038700     GO TO F-PRES-VAL-WRITE-02.
038800 F-PRES-VAL-DELETE-02.
038900     PERFORM  DE-LETE.
039000     GO TO    F-PRES-VAL-WRITE-02.
039100 F-PRES-VAL-WRITE-02.
039200     MOVE "F-PRES-VAL-02" TO PAR-NAME.
039300     PERFORM  PRINT-DETAIL.
039400*****************TEST (c) - SIMPLE TEST*****************
039500 F-PRES-VAL-03.
039600     MOVE  9.53314 TO MIN-RANGE.
039700     MOVE  9.53352 TO MAX-RANGE.
039800 F-PRES-VAL-TEST-03.
039900     IF (FUNCTION PRESENT-VALUE(.5, 8.3, 2.4, 9.9)
040000        >= MIN-RANGE) AND
040100        (FUNCTION PRESENT-VALUE(.5, 8.3, 2.4, 9.9)
040200        <= MAX-RANGE) THEN
040300                    PERFORM PASS
040400     ELSE
040500                    PERFORM FAIL.
040600     GO TO F-PRES-VAL-WRITE-03.
040700 F-PRES-VAL-DELETE-03.
040800     PERFORM  DE-LETE.
040900     GO TO    F-PRES-VAL-WRITE-03.
041000 F-PRES-VAL-WRITE-03.
041100     MOVE "F-PRES-VAL-03" TO PAR-NAME.
041200     PERFORM  PRINT-DETAIL.
041300*****************TEST (d) - SIMPLE TEST*****************
041400 F-PRES-VAL-04.
041500     MOVE ZERO TO WS-NUM.
041600     MOVE  22.6274 TO MIN-RANGE.
041700     MOVE  22.6283 TO MAX-RANGE.
041800 F-PRES-VAL-TEST-04.
041900     COMPUTE WS-NUM =
042000         FUNCTION PRESENT-VALUE(.1, 5, 4, 2.8, 3.1, 17).
042100     IF (WS-NUM >= MIN-RANGE) AND
042200        (WS-NUM <= MAX-RANGE) THEN
042300                    PERFORM PASS
042400     ELSE
042500                    MOVE WS-NUM TO COMPUTED-N
042600                    MOVE MIN-RANGE TO CORRECT-MIN
042700                    MOVE MAX-RANGE TO CORRECT-MAX
042800                    PERFORM FAIL.
042900     GO TO F-PRES-VAL-WRITE-04.
043000 F-PRES-VAL-DELETE-04.
043100     PERFORM  DE-LETE.
043200     GO TO    F-PRES-VAL-WRITE-04.
043300 F-PRES-VAL-WRITE-04.
043400     MOVE "F-PRES-VAL-04" TO PAR-NAME.
043500     PERFORM  PRINT-DETAIL.
043600*****************TEST (e) - SIMPLE TEST*****************
043700 F-PRES-VAL-05.
043800     MOVE ZERO TO WS-NUM.
043900     MOVE  20.1691 TO MIN-RANGE.
044000     MOVE  20.1699 TO MAX-RANGE.
044100 F-PRES-VAL-TEST-05.
044200     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(.04, A, B, D).
044300     IF (WS-NUM >= MIN-RANGE) AND
044400        (WS-NUM <= MAX-RANGE) THEN
044500                    PERFORM PASS
044600     ELSE
044700                    MOVE WS-NUM TO COMPUTED-N
044800                    MOVE MIN-RANGE TO CORRECT-MIN
044900                    MOVE MAX-RANGE TO CORRECT-MAX
045000                    PERFORM FAIL.
045100     GO TO F-PRES-VAL-WRITE-05.
045200 F-PRES-VAL-DELETE-05.
045300     PERFORM  DE-LETE.
045400     GO TO    F-PRES-VAL-WRITE-05.
045500 F-PRES-VAL-WRITE-05.
045600     MOVE "F-PRES-VAL-05" TO PAR-NAME.
045700     PERFORM  PRINT-DETAIL.
045800*****************TEST (f) - SIMPLE TEST*****************
045900 F-PRES-VAL-06.
046000     MOVE ZERO TO WS-NUM.
046100     MOVE  33.3113 TO MIN-RANGE.
046200     MOVE  33.3127 TO MAX-RANGE.
046300 F-PRES-VAL-TEST-06.
046400     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(.08, E, G, H, F).
046500
046600     IF (WS-NUM >= MIN-RANGE) AND
046700        (WS-NUM <= MAX-RANGE) THEN
046800                    PERFORM PASS
046900     ELSE
047000                    MOVE WS-NUM TO COMPUTED-N
047100                    MOVE MIN-RANGE TO CORRECT-MIN
047200                    MOVE MAX-RANGE TO CORRECT-MAX
047300                    PERFORM FAIL.
047400     GO TO F-PRES-VAL-WRITE-06.
047500 F-PRES-VAL-DELETE-06.
047600     PERFORM  DE-LETE.
047700     GO TO    F-PRES-VAL-WRITE-06.
047800 F-PRES-VAL-WRITE-06.
047900     MOVE "F-PRES-VAL-06" TO PAR-NAME.
048000     PERFORM  PRINT-DETAIL.
048100*****************TEST (g) - SIMPLE TEST*****************
048200 F-PRES-VAL-07.
048300     MOVE ZERO TO WS-NUM.
048400     MOVE  5.76505 TO MIN-RANGE.
048500     MOVE  5.76528 TO MAX-RANGE.
048600 F-PRES-VAL-TEST-07.
048700     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(.2, C, A, 5, 4, 2).
048800
048900     IF (WS-NUM >= MIN-RANGE) AND
049000        (WS-NUM <= MAX-RANGE) THEN
049100                    PERFORM PASS
049200     ELSE
049300                    MOVE WS-NUM TO COMPUTED-N
049400                    MOVE MIN-RANGE TO CORRECT-MIN
049500                    MOVE MAX-RANGE TO CORRECT-MAX
049600                    PERFORM FAIL.
049700     GO TO F-PRES-VAL-WRITE-07.
049800 F-PRES-VAL-DELETE-07.
049900     PERFORM  DE-LETE.
050000     GO TO    F-PRES-VAL-WRITE-07.
050100 F-PRES-VAL-WRITE-07.
050200     MOVE "F-PRES-VAL-07" TO PAR-NAME.
050300     PERFORM  PRINT-DETAIL.
050400*****************TEST (h) - SIMPLE TEST*****************
050500 F-PRES-VAL-08.
050600     MOVE ZERO TO WS-NUM.
050700     MOVE  0.361674 TO MIN-RANGE.
050800     MOVE  0.361689 TO MAX-RANGE.
050900 F-PRES-VAL-TEST-08.
051000     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(.3, A, H, .07, -19).
051100     IF (WS-NUM >= MIN-RANGE) AND
051200        (WS-NUM <= MAX-RANGE) THEN
051300                    PERFORM PASS
051400     ELSE
051500                    MOVE WS-NUM TO COMPUTED-N
051600                    MOVE MIN-RANGE TO CORRECT-MIN
051700                    MOVE MAX-RANGE TO CORRECT-MAX
051800                    PERFORM FAIL.
051900     GO TO F-PRES-VAL-WRITE-08.
052000 F-PRES-VAL-DELETE-08.
052100     PERFORM  DE-LETE.
052200     GO TO    F-PRES-VAL-WRITE-08.
052300 F-PRES-VAL-WRITE-08.
052400     MOVE "F-PRES-VAL-08" TO PAR-NAME.
052500     PERFORM  PRINT-DETAIL.
052600*****************TEST (i) - SIMPLE TEST*****************
052700 F-PRES-VAL-09.
052800     MOVE ZERO TO WS-NUM.
052900     MOVE -0.001500 TO MIN-RANGE.
053000     MOVE -0.001498 TO MAX-RANGE.
053100 F-PRES-VAL-TEST-09.
053200     COMPUTE WS-NUM =
053300                FUNCTION PRESENT-VALUE(.09, -.0009, -.0008).
053400     IF (WS-NUM >= MIN-RANGE) AND
053500        (WS-NUM <= MAX-RANGE) THEN
053600                    PERFORM PASS
053700     ELSE
053800                    MOVE WS-NUM TO COMPUTED-N
053900                    MOVE MIN-RANGE TO CORRECT-MIN
054000                    MOVE MAX-RANGE TO CORRECT-MAX
054100                    PERFORM FAIL.
054200     GO TO F-PRES-VAL-WRITE-09.
054300 F-PRES-VAL-DELETE-09.
054400     PERFORM  DE-LETE.
054500     GO TO    F-PRES-VAL-WRITE-09.
054600 F-PRES-VAL-WRITE-09.
054700     MOVE "F-PRES-VAL-09" TO PAR-NAME.
054800     PERFORM  PRINT-DETAIL.
054900*****************TEST (k) - SIMPLE TEST*****************
055000 F-PRES-VAL-11.
055100     MOVE ZERO TO WS-NUM.
055200     MOVE  57454.07 TO MIN-RANGE.
055300     MOVE  57456.37 TO MAX-RANGE.
055400 F-PRES-VAL-TEST-11.
055500     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(.4, 30000, 40000,
055600                                             100000, -80000).
055700     IF (WS-NUM >= MIN-RANGE) AND
055800        (WS-NUM <= MAX-RANGE) THEN
055900                    PERFORM PASS
056000     ELSE
056100                    MOVE WS-NUM TO COMPUTED-N
056200                    MOVE MIN-RANGE TO CORRECT-MIN
056300                    MOVE MAX-RANGE TO CORRECT-MAX
056400                    PERFORM FAIL.
056500     GO TO F-PRES-VAL-WRITE-11.
056600 F-PRES-VAL-DELETE-11.
056700     PERFORM  DE-LETE.
056800     GO TO    F-PRES-VAL-WRITE-11.
056900 F-PRES-VAL-WRITE-11.
057000     MOVE "F-PRES-VAL-11" TO PAR-NAME.
057100     PERFORM  PRINT-DETAIL.
057200*****************TEST (l) - SIMPLE TEST*****************
057300 F-PRES-VAL-12.
057400     MOVE ZERO TO WS-NUM.
057500     MOVE -1406.26 TO MIN-RANGE.
057600     MOVE -1406.21 TO MAX-RANGE.
057700 F-PRES-VAL-TEST-12.
057800     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(.07, L, K).
057900     IF (WS-NUM >= MIN-RANGE) AND
058000        (WS-NUM <= MAX-RANGE) THEN
058100                    PERFORM PASS
058200     ELSE
058300                    MOVE WS-NUM TO COMPUTED-N
058400                    MOVE MIN-RANGE TO CORRECT-MIN
058500                    MOVE MAX-RANGE TO CORRECT-MAX
058600                    PERFORM FAIL.
058700     GO TO F-PRES-VAL-WRITE-12.
058800 F-PRES-VAL-DELETE-12.
058900     PERFORM  DE-LETE.
059000     GO TO    F-PRES-VAL-WRITE-12.
059100 F-PRES-VAL-WRITE-12.
059200     MOVE "F-PRES-VAL-12" TO PAR-NAME.
059300     PERFORM  PRINT-DETAIL.
059400*****************TEST (m) - SIMPLE TEST*****************
059500 F-PRES-VAL-13.
059600     MOVE ZERO TO WS-NUM.
059700     MOVE  6.76570 TO MIN-RANGE.
059800     MOVE  6.76597 TO MAX-RANGE.
059900 F-PRES-VAL-TEST-13.
060000     COMPUTE WS-NUM =
060100          FUNCTION PRESENT-VALUE(.15, IND(1), IND(2),
060200                                 IND(3)).
060300     IF (WS-NUM >= MIN-RANGE) AND
060400        (WS-NUM <= MAX-RANGE) THEN
060500                    PERFORM PASS
060600     ELSE
060700                    MOVE WS-NUM TO COMPUTED-N
060800                    MOVE MIN-RANGE TO CORRECT-MIN
060900                    MOVE MAX-RANGE TO CORRECT-MAX
061000                    PERFORM FAIL.
061100     GO TO F-PRES-VAL-WRITE-13.
061200 F-PRES-VAL-DELETE-13.
061300     PERFORM  DE-LETE.
061400     GO TO    F-PRES-VAL-WRITE-13.
061500 F-PRES-VAL-WRITE-13.
061600     MOVE "F-PRES-VAL-13" TO PAR-NAME.
061700     PERFORM  PRINT-DETAIL.
061800*****************TEST (n) - SIMPLE TEST*****************
061900 F-PRES-VAL-14.
062000     MOVE ZERO TO WS-NUM.
062100     MOVE  12.3066 TO MIN-RANGE.
062200     MOVE  12.3071 TO MAX-RANGE.
062300 F-PRES-VAL-TEST-14.
062400     COMPUTE WS-NUM =
062500          FUNCTION PRESENT-VALUE(.13, IND(P), IND(Q), IND(R)).
062600     IF (WS-NUM >= MIN-RANGE) AND
062700        (WS-NUM <= MAX-RANGE) THEN
062800                    PERFORM PASS
062900     ELSE
063000                    MOVE WS-NUM TO COMPUTED-N
063100                    MOVE MIN-RANGE TO CORRECT-MIN
063200                    MOVE MAX-RANGE TO CORRECT-MAX
063300                    PERFORM FAIL.
063400     GO TO F-PRES-VAL-WRITE-14.
063500 F-PRES-VAL-DELETE-14.
063600     PERFORM  DE-LETE.
063700     GO TO    F-PRES-VAL-WRITE-14.
063800 F-PRES-VAL-WRITE-14.
063900     MOVE "F-PRES-VAL-14" TO PAR-NAME.
064000     PERFORM  PRINT-DETAIL.
064100*****************TEST (o) - SIMPLE TEST*****************
064200 F-PRES-VAL-15.
064300     MOVE ZERO TO WS-NUM.
064400     MOVE  37.9070 TO MIN-RANGE.
064500     MOVE  37.9085 TO MAX-RANGE.
064600 F-PRES-VAL-TEST-15.
064700     COMPUTE WS-NUM =
064800         FUNCTION PRESENT-VALUE(.1, 10, 10, 10, 10, 10).
064900     IF (WS-NUM >= MIN-RANGE) AND
065000        (WS-NUM <= MAX-RANGE) THEN
065100                    PERFORM PASS
065200     ELSE
065300                    MOVE WS-NUM TO COMPUTED-N
065400                    MOVE MIN-RANGE TO CORRECT-MIN
065500                    MOVE MAX-RANGE TO CORRECT-MAX
065600                    PERFORM FAIL.
065700     GO TO F-PRES-VAL-WRITE-15.
065800 F-PRES-VAL-DELETE-15.
065900     PERFORM  DE-LETE.
066000     GO TO    F-PRES-VAL-WRITE-15.
066100 F-PRES-VAL-WRITE-15.
066200     MOVE "F-PRES-VAL-15" TO PAR-NAME.
066300     PERFORM  PRINT-DETAIL.
066400*****************TEST (a) - COMPLEX TEST****************
066500 F-PRES-VAL-16.
066600     MOVE ZERO TO WS-NUM.
066700     MOVE  65.9974 TO MIN-RANGE.
066800     MOVE  66.0026 TO MAX-RANGE.
066900 F-PRES-VAL-TEST-16.
067000     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE
067100                               (-.5, (2 + 3), (6 / 3), (9 - 3)).
067200     IF (WS-NUM >= MIN-RANGE) AND
067300        (WS-NUM <= MAX-RANGE) THEN
067400                    PERFORM PASS
067500     ELSE
067600                    MOVE WS-NUM TO COMPUTED-N
067700                    MOVE MIN-RANGE TO CORRECT-MIN
067800                    MOVE MAX-RANGE TO CORRECT-MAX
067900                    PERFORM FAIL.
068000     GO TO F-PRES-VAL-WRITE-16.
068100 F-PRES-VAL-DELETE-16.
068200     PERFORM  DE-LETE.
068300     GO TO    F-PRES-VAL-WRITE-16.
068400 F-PRES-VAL-WRITE-16.
068500     MOVE "F-PRES-VAL-16" TO PAR-NAME.
068600     PERFORM  PRINT-DETAIL.
068700*****************TEST (b) - COMPLEX TEST****************
068800 F-PRES-VAL-17.
068900     MOVE ZERO TO WS-NUM.
069000     MOVE  44.4513 TO MIN-RANGE.
069100     MOVE  44.4549 TO MAX-RANGE.
069200 F-PRES-VAL-TEST-17.
069300     COMPUTE WS-NUM =
069400            FUNCTION PRESENT-VALUE(-.2, 5 / 4, 3.3 * 4, 9.4 + 2).
069500     IF (WS-NUM >= MIN-RANGE) AND
069600        (WS-NUM <= MAX-RANGE) THEN
069700                    PERFORM PASS
069800     ELSE
069900                    MOVE WS-NUM TO COMPUTED-N
070000                    MOVE MIN-RANGE TO CORRECT-MIN
070100                    MOVE MAX-RANGE TO CORRECT-MAX
070200                    PERFORM FAIL.
070300     GO TO F-PRES-VAL-WRITE-17.
070400 F-PRES-VAL-DELETE-17.
070500     PERFORM  DE-LETE.
070600     GO TO    F-PRES-VAL-WRITE-17.
070700 F-PRES-VAL-WRITE-17.
070800     MOVE "F-PRES-VAL-17" TO PAR-NAME.
070900     PERFORM  PRINT-DETAIL.
071000*****************TEST (c) - COMPLEX TEST****************
071100 F-PRES-VAL-18.
071200     MOVE ZERO TO WS-NUM.
071300     MOVE  7.91943 TO MIN-RANGE.
071400     MOVE  7.92007 TO MAX-RANGE.
071500 F-PRES-VAL-TEST-18.
071600     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE
071700                         (.5, A + 2, 4.5 / C, 8, B).
071800     IF (WS-NUM >= MIN-RANGE) AND
071900        (WS-NUM <= MAX-RANGE) THEN
072000                    PERFORM PASS
072100     ELSE
072200                    MOVE WS-NUM TO COMPUTED-N
072300                    MOVE MIN-RANGE TO CORRECT-MIN
072400                    MOVE MAX-RANGE TO CORRECT-MAX
072500                    PERFORM FAIL.
072600     GO TO F-PRES-VAL-WRITE-18.
072700 F-PRES-VAL-DELETE-18.
072800     PERFORM  DE-LETE.
072900     GO TO    F-PRES-VAL-WRITE-18.
073000 F-PRES-VAL-WRITE-18.
073100     MOVE "F-PRES-VAL-18" TO PAR-NAME.
073200     PERFORM  PRINT-DETAIL.
073300*****************TEST (d) - COMPLEX TEST****************
073400 F-PRES-VAL-19.
073500     MOVE ZERO TO WS-NUM.
073600     MOVE  22.4229 TO MIN-RANGE.
073700     MOVE  22.4247 TO MAX-RANGE.
073800 F-PRES-VAL-TEST-19.
073900     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(.08, 2, 3) + 18.
074000     IF (WS-NUM >= MIN-RANGE) AND
074100        (WS-NUM <= MAX-RANGE) THEN
074200                    PERFORM PASS
074300     ELSE
074400                    MOVE WS-NUM TO COMPUTED-N
074500                    MOVE MIN-RANGE TO CORRECT-MIN
074600                    MOVE MAX-RANGE TO CORRECT-MAX
074700                    PERFORM FAIL.
074800     GO TO F-PRES-VAL-WRITE-19.
074900 F-PRES-VAL-DELETE-19.
075000     PERFORM  DE-LETE.
075100     GO TO    F-PRES-VAL-WRITE-19.
075200 F-PRES-VAL-WRITE-19.
075300     MOVE "F-PRES-VAL-19" TO PAR-NAME.
075400     PERFORM  PRINT-DETAIL.
075500*****************TEST (e) - COMPLEX TEST****************
075600 F-PRES-VAL-20.
075700     MOVE ZERO TO WS-NUM.
075800     MOVE -2.09570 TO MIN-RANGE.
075900     MOVE -2.09554 TO MAX-RANGE.
076000 F-PRES-VAL-TEST-20.
076100     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(.03, -6, -4) +
076200                      FUNCTION PRESENT-VALUE(.2, 9).
076300     IF (WS-NUM >= MIN-RANGE) AND
076400        (WS-NUM <= MAX-RANGE) THEN
076500                    PERFORM PASS
076600     ELSE
076700                    MOVE WS-NUM TO COMPUTED-N
076800                    MOVE MIN-RANGE TO CORRECT-MIN
076900                    MOVE MAX-RANGE TO CORRECT-MAX
077000                    PERFORM FAIL.
077100     GO TO F-PRES-VAL-WRITE-20.
077200 F-PRES-VAL-DELETE-20.
077300     PERFORM  DE-LETE.
077400     GO TO    F-PRES-VAL-WRITE-20.
077500 F-PRES-VAL-WRITE-20.
077600     MOVE "F-PRES-VAL-20" TO PAR-NAME.
077700     PERFORM  PRINT-DETAIL.
077800*****************TEST (f) - COMPLEX TEST****************
077900 F-PRES-VAL-21.
078000     MOVE ZERO TO WS-NUM.
078100     MOVE  1.49994 TO MIN-RANGE.
078200     MOVE  1.50006 TO MAX-RANGE.
078300 F-PRES-VAL-TEST-21.
078400     COMPUTE WS-NUM = FUNCTION PRESENT-VALUE(
078500                         FUNCTION PRESENT-VALUE(1, 2), 3).
078600     IF (WS-NUM >= MIN-RANGE) AND
078700        (WS-NUM <= MAX-RANGE) THEN
078800                    PERFORM PASS
078900     ELSE
079000                    MOVE WS-NUM TO COMPUTED-N
079100                    MOVE MIN-RANGE TO CORRECT-MIN
079200                    MOVE MAX-RANGE TO CORRECT-MAX
079300                    PERFORM FAIL.
079400     GO TO F-PRES-VAL-WRITE-21.
079500 F-PRES-VAL-DELETE-21.
079600     PERFORM  DE-LETE.
079700     GO TO    F-PRES-VAL-WRITE-21.
079800 F-PRES-VAL-WRITE-21.
079900     MOVE "F-PRES-VAL-21" TO PAR-NAME.
080000     PERFORM  PRINT-DETAIL.
080100*****************SPECIAL PERFORM TEST**********************
080200 F-PRES-VAL-22.
080300     PERFORM F-PRES-VAL-TEST-22
080400       UNTIL FUNCTION PRESENT-VALUE(ARG1, 2) < 0.5.
080500     PERFORM PASS.
080600     GO TO F-PRES-VAL-WRITE-22.
080700 F-PRES-VAL-TEST-22.
080800     COMPUTE ARG1 = ARG1 + 1.
080900 F-PRES-VAL-DELETE-22.
081000     PERFORM  DE-LETE.
081100     GO TO    F-PRES-VAL-WRITE-22.
081200 F-PRES-VAL-WRITE-22.
081300     MOVE "F-PRES-VAL-22" TO PAR-NAME.
081400     PERFORM  PRINT-DETAIL.
081500********************END OF TESTS***************
081600 CCVS-EXIT SECTION.
081700 CCVS-999999.
081800     GO TO CLOSE-FILES.
