000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF137A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function            *
000900* STANDARD-DEVIATION.                                     *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT PRINT-FILE ASSIGN TO
002100     XXXXX055.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  PRINT-FILE.
002500 01  PRINT-REC PICTURE X(120).
002600 01  DUMMY-RECORD PICTURE X(120).
002700 WORKING-STORAGE SECTION.
002800***********************************************************
002900* Variables specific to the Intrinsic Function Test IF137A*
003000***********************************************************
003100 01  A                   PIC S9(10)          VALUE 5.
003200 01  B                   PIC S9(10)          VALUE 7.
003300 01  C                   PIC S9(10)          VALUE -4.
003400 01  D                   PIC S9(10)          VALUE 10.
003500 01  E                   PIC S9(5)V9(5)      VALUE 34.26.
003600 01  F                   PIC S9(5)V9(5)      VALUE -8.32.
003700 01  G                   PIC S9(5)V9(5)      VALUE 4.08.
003800 01  H                   PIC S9(5)V9(5)      VALUE -5.3.
003900 01  P                   PIC S9(10)          VALUE 4.
004000 01  Q                   PIC S9(10)          VALUE 3.
004100 01  R                   PIC S9(10)          VALUE 5.
004200 01  ARG3                PIC S9(10)          VALUE 2.
004300 01  ARR                                     VALUE "40537".
004400     02  IND OCCURS 5 TIMES PIC 9.
004500 01  TEMP                PIC S9(10).
004600 01  WS-NUM              PIC S9(5)V9(6).
004700 01  MIN-RANGE           PIC S9(5)V9(7).
004800 01  MAX-RANGE           PIC S9(5)V9(7).
004900*
005000**********************************************************
005100*
005200 01  TEST-RESULTS.
005300     02 FILLER                   PIC X      VALUE SPACE.
005400     02 FEATURE                  PIC X(20)  VALUE SPACE.
005500     02 FILLER                   PIC X      VALUE SPACE.
005600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02  PAR-NAME.
005900       03 FILLER                 PIC X(19)  VALUE SPACE.
006000       03  PARDOT-X              PIC X      VALUE SPACE.
006100       03 DOTVALUE               PIC 99     VALUE ZERO.
006200     02 FILLER                   PIC X(8)   VALUE SPACE.
006300     02 RE-MARK                  PIC X(61).
006400 01  TEST-COMPUTED.
006500     02 FILLER                   PIC X(30)  VALUE SPACE.
006600     02 FILLER                   PIC X(17)  VALUE
006700            "       COMPUTED=".
006800     02 COMPUTED-X.
006900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007000     03 COMPUTED-N               REDEFINES COMPUTED-A
007100                                 PIC -9(9).9(9).
007200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007500     03       CM-18V0 REDEFINES COMPUTED-A.
007600         04 COMPUTED-18V0                    PIC -9(18).
007700         04 FILLER                           PIC X.
007800     03 FILLER PIC X(50) VALUE SPACE.
007900 01  TEST-CORRECT.
008000     02 FILLER PIC X(30) VALUE SPACE.
008100     02 FILLER PIC X(17) VALUE "       CORRECT =".
008200     02 CORRECT-X.
008300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008800     03      CR-18V0 REDEFINES CORRECT-A.
008900         04 CORRECT-18V0                     PIC -9(18).
009000         04 FILLER                           PIC X.
009100     03 FILLER PIC X(2) VALUE SPACE.
009200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009300 01  TEST-CORRECT-MIN.
009400     02 FILLER PIC X(30) VALUE SPACE.
009500     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
009600     02 CORRECTMI-X.
009700     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
009800     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
009900     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
010000     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
010100     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
010200     03      CR-18V0 REDEFINES CORRECTMI-A.
010300         04 CORRECTMI-18V0                     PIC -9(18).
010400         04 FILLER                           PIC X.
010500     03 FILLER PIC X(2) VALUE SPACE.
010600     03 FILLER                           PIC X(48) VALUE SPACE.
010700 01  TEST-CORRECT-MAX.
010800     02 FILLER PIC X(30) VALUE SPACE.
010900     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
011000     02 CORRECTMA-X.
011100     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
011200     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
011300     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
011400     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
011500     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
011600     03      CR-18V0 REDEFINES CORRECTMA-A.
011700         04 CORRECTMA-18V0                     PIC -9(18).
011800         04 FILLER                           PIC X.
011900     03 FILLER PIC X(2) VALUE SPACE.
012000     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012100 01  CCVS-C-1.
012200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012300-    "SS  PARAGRAPH-NAME
012400-    "       REMARKS".
012500     02 FILLER                     PIC X(20)    VALUE SPACE.
012600 01  CCVS-C-2.
012700     02 FILLER                     PIC X        VALUE SPACE.
012800     02 FILLER                     PIC X(6)     VALUE "TESTED".
012900     02 FILLER                     PIC X(15)    VALUE SPACE.
013000     02 FILLER                     PIC X(4)     VALUE "FAIL".
013100     02 FILLER                     PIC X(94)    VALUE SPACE.
013200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013300 01  REC-CT                        PIC 99       VALUE ZERO.
013400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014300 01  CCVS-H-1.
014400     02  FILLER                    PIC X(39)    VALUE SPACES.
014500     02  FILLER                    PIC X(42)    VALUE
014600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014700     02  FILLER                    PIC X(39)    VALUE SPACES.
014800 01  CCVS-H-2A.
014900   02  FILLER                        PIC X(40)  VALUE SPACE.
015000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015100   02  FILLER                        PIC XXXX   VALUE
015200     "4.2 ".
015300   02  FILLER                        PIC X(28)  VALUE
015400            " COPY - NOT FOR DISTRIBUTION".
015500   02  FILLER                        PIC X(41)  VALUE SPACE.
015600
015700 01  CCVS-H-2B.
015800   02  FILLER                        PIC X(15)  VALUE
015900            "TEST RESULT OF ".
016000   02  TEST-ID                       PIC X(9).
016100   02  FILLER                        PIC X(4)   VALUE
016200            " IN ".
016300   02  FILLER                        PIC X(12)  VALUE
016400     " HIGH       ".
016500   02  FILLER                        PIC X(22)  VALUE
016600            " LEVEL VALIDATION FOR ".
016700   02  FILLER                        PIC X(58)  VALUE
016800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016900 01  CCVS-H-3.
017000     02  FILLER                      PIC X(34)  VALUE
017100            " FOR OFFICIAL USE ONLY    ".
017200     02  FILLER                      PIC X(58)  VALUE
017300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017400     02  FILLER                      PIC X(28)  VALUE
017500            "  COPYRIGHT   1985 ".
017600 01  CCVS-E-1.
017700     02 FILLER                       PIC X(52)  VALUE SPACE.
017800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017900     02 ID-AGAIN                     PIC X(9).
018000     02 FILLER                       PIC X(45)  VALUE SPACES.
018100 01  CCVS-E-2.
018200     02  FILLER                      PIC X(31)  VALUE SPACE.
018300     02  FILLER                      PIC X(21)  VALUE SPACE.
018400     02 CCVS-E-2-2.
018500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018600         03 FILLER                   PIC X      VALUE SPACE.
018700         03 ENDER-DESC               PIC X(44)  VALUE
018800            "ERRORS ENCOUNTERED".
018900 01  CCVS-E-3.
019000     02  FILLER                      PIC X(22)  VALUE
019100            " FOR OFFICIAL USE ONLY".
019200     02  FILLER                      PIC X(12)  VALUE SPACE.
019300     02  FILLER                      PIC X(58)  VALUE
019400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019500     02  FILLER                      PIC X(13)  VALUE SPACE.
019600     02 FILLER                       PIC X(15)  VALUE
019700             " COPYRIGHT 1985".
019800 01  CCVS-E-4.
019900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020000     02 FILLER                       PIC X(4)   VALUE " OF ".
020100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020200     02 FILLER                       PIC X(40)  VALUE
020300      "  TESTS WERE EXECUTED SUCCESSFULLY".
020400 01  XXINFO.
020500     02 FILLER                       PIC X(19)  VALUE
020600            "*** INFORMATION ***".
020700     02 INFO-TEXT.
020800       04 FILLER                     PIC X(8)   VALUE SPACE.
020900       04 XXCOMPUTED                 PIC X(20).
021000       04 FILLER                     PIC X(5)   VALUE SPACE.
021100       04 XXCORRECT                  PIC X(20).
021200     02 INF-ANSI-REFERENCE           PIC X(48).
021300 01  HYPHEN-LINE.
021400     02 FILLER  PIC IS X VALUE IS SPACE.
021500     02 FILLER  PIC IS X(65)    VALUE IS "************************
021600-    "*****************************************".
021700     02 FILLER  PIC IS X(54)    VALUE IS "************************
021800-    "******************************".
021900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022000     "IF137A".
022100 PROCEDURE DIVISION.
022200 CCVS1 SECTION.
022300 OPEN-FILES.
022400     OPEN     OUTPUT PRINT-FILE.
022500     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022600     MOVE    SPACE TO TEST-RESULTS.
022700     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022800     GO TO CCVS1-EXIT.
022900 CLOSE-FILES.
023000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023100 TERMINATE-CCVS.
023200     STOP     RUN.
023300 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023400 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023500 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023600 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023700     MOVE "****TEST DELETED****" TO RE-MARK.
023800 PRINT-DETAIL.
023900     IF REC-CT NOT EQUAL TO ZERO
024000             MOVE "." TO PARDOT-X
024100             MOVE REC-CT TO DOTVALUE.
024200     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024300     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024400        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024500          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024600     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024700     MOVE SPACE TO CORRECT-X.
024800     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024900     MOVE     SPACE TO RE-MARK.
025000 HEAD-ROUTINE.
025100     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025200     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025300     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025400     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025500 COLUMN-NAMES-ROUTINE.
025600     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025700     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025900 END-ROUTINE.
026000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026100 END-RTN-EXIT.
026200     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026300 END-ROUTINE-1.
026400      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026500      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026600      ADD PASS-COUNTER TO ERROR-HOLD.
026700      MOVE PASS-COUNTER TO CCVS-E-4-1.
026800      MOVE ERROR-HOLD TO CCVS-E-4-2.
026900      MOVE CCVS-E-4 TO CCVS-E-2-2.
027000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027100  END-ROUTINE-12.
027200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027300     IF       ERROR-COUNTER IS EQUAL TO ZERO
027400         MOVE "NO " TO ERROR-TOTAL
027500         ELSE
027600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027800     PERFORM WRITE-LINE.
027900 END-ROUTINE-13.
028000     IF DELETE-COUNTER IS EQUAL TO ZERO
028100         MOVE "NO " TO ERROR-TOTAL  ELSE
028200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028500      IF   INSPECT-COUNTER EQUAL TO ZERO
028600          MOVE "NO " TO ERROR-TOTAL
028700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029100 WRITE-LINE.
029200     ADD 1 TO RECORD-COUNT.
029300Y    IF RECORD-COUNT GREATER 42
029400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029500Y        MOVE SPACE TO DUMMY-RECORD
029600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029700Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029800Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029900Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030000Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030100Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
030200Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
030300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030500Y        MOVE ZERO TO RECORD-COUNT.
030600     PERFORM WRT-LN.
030700 WRT-LN.
030800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030900     MOVE SPACE TO DUMMY-RECORD.
031000 BLANK-LINE-PRINT.
031100     PERFORM WRT-LN.
031200 FAIL-ROUTINE.
031300     IF     COMPUTED-X NOT EQUAL TO SPACE
031400            GO TO FAIL-ROUTINE-WRITE.
031500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031900     MOVE   SPACES TO INF-ANSI-REFERENCE.
032000     GO TO  FAIL-ROUTINE-EX.
032100 FAIL-ROUTINE-WRITE.
032200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
032300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
032400                              CORMA-ANSI-REFERENCE.
032500     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
032600           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
032700           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
032800     ELSE
032900           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
033000     PERFORM WRITE-LINE.
033100     MOVE   SPACES TO COR-ANSI-REFERENCE.
033200 FAIL-ROUTINE-EX. EXIT.
033300 BAIL-OUT.
033400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033600 BAIL-OUT-WRITE.
033700     MOVE CORRECT-A TO XXCORRECT.
033800     MOVE COMPUTED-A TO XXCOMPUTED.
033900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
034000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034100     MOVE   SPACES TO INF-ANSI-REFERENCE.
034200 BAIL-OUT-EX. EXIT.
034300 CCVS1-EXIT.
034400     EXIT.
034500********************************************************
034600*                                                      *
034700* Intrinsic Function Tests IF137A - STANDARD-DEVIATION *
034800*                                                      *
034900********************************************************
035000 SECT-IF137A SECTION.
035100 F-STD-DEV-INFO.
035200     MOVE     "See ref. A-70 2.41" TO ANSI-REFERENCE.
035300     MOVE     "STANDARD-DEVIATION" TO FEATURE.
035400*****************TEST (a) - SIMPLE TEST*****************
035500 F-STD-DEV-01.
035600     MOVE ZERO TO WS-NUM.
035700     MOVE  6.97750 TO MIN-RANGE.
035800     MOVE  6.97778 TO MAX-RANGE.
035900 F-STD-DEV-TEST-01.
036000     COMPUTE WS-NUM =
036100            FUNCTION STANDARD-DEVIATION(5, -2, -14, 0).
036200     IF (WS-NUM >= MIN-RANGE) AND
036300        (WS-NUM <= MAX-RANGE) THEN
036400                    PERFORM PASS
036500     ELSE
036600                    MOVE WS-NUM TO COMPUTED-N
036700                    MOVE MIN-RANGE TO CORRECT-MIN
036800                    MOVE MAX-RANGE TO CORRECT-MAX
036900                    PERFORM FAIL.
037000     GO TO F-STD-DEV-WRITE-01.
037100 F-STD-DEV-DELETE-01.
037200     PERFORM  DE-LETE.
037300     GO TO    F-STD-DEV-WRITE-01.
037400 F-STD-DEV-WRITE-01.
037500     MOVE "F-STD-DEV-01" TO PAR-NAME.
037600     PERFORM  PRINT-DETAIL.
037700*****************TEST (b) - SIMPLE TEST*****************
037800 F-STD-DEV-02.
037900     EVALUATE FUNCTION STANDARD-DEVIATION(3.9, -0.3, 8.7, 100.2)
038000     WHEN  41.7333 THRU  41.7350
038100                    PERFORM PASS
038200     WHEN OTHER
038300                    PERFORM FAIL.
038400     GO TO F-STD-DEV-WRITE-02.
038500 F-STD-DEV-DELETE-02.
038600     PERFORM  DE-LETE.
038700     GO TO    F-STD-DEV-WRITE-02.
038800 F-STD-DEV-WRITE-02.
038900     MOVE "F-STD-DEV-02" TO PAR-NAME.
039000     PERFORM  PRINT-DETAIL.
039100*****************TEST (c) - SIMPLE TEST*****************
039200 F-STD-DEV-03.
039300     MOVE  5.22005 TO MIN-RANGE.
039400     MOVE  5.22025 TO MAX-RANGE.
039500 F-STD-DEV-TEST-03.
039600     IF (FUNCTION STANDARD-DEVIATION(A, B, C, D)
039700                                   >= MIN-RANGE) AND
039800        (FUNCTION STANDARD-DEVIATION(A, B, C, D)
039900                                   <= MAX-RANGE) THEN
040000                    PERFORM PASS
040100     ELSE
040200                    PERFORM FAIL.
040300     GO TO F-STD-DEV-WRITE-03.
040400 F-STD-DEV-DELETE-03.
040500     PERFORM  DE-LETE.
040600     GO TO    F-STD-DEV-WRITE-03.
040700 F-STD-DEV-WRITE-03.
040800     MOVE "F-STD-DEV-03" TO PAR-NAME.
040900     PERFORM  PRINT-DETAIL.
041000*****************TEST (d) - SIMPLE TEST*****************
041100 F-STD-DEV-04.
041200     MOVE ZERO TO WS-NUM.
041300     MOVE  16.8440 TO MIN-RANGE.
041400     MOVE  16.8447 TO MAX-RANGE.
041500 F-STD-DEV-TEST-04.
041600     COMPUTE WS-NUM =
041700               FUNCTION STANDARD-DEVIATION(E, F, G, H).
041800     IF (WS-NUM >= MIN-RANGE) AND
041900        (WS-NUM <= MAX-RANGE) THEN
042000                    PERFORM PASS
042100     ELSE
042200                    MOVE WS-NUM TO COMPUTED-N
042300                    MOVE MIN-RANGE TO CORRECT-MIN
042400                    MOVE MAX-RANGE TO CORRECT-MAX
042500                    PERFORM FAIL.
042600     GO TO F-STD-DEV-WRITE-04.
042700 F-STD-DEV-DELETE-04.
042800     PERFORM  DE-LETE.
042900     GO TO    F-STD-DEV-WRITE-04.
043000 F-STD-DEV-WRITE-04.
043100     MOVE "F-STD-DEV-04" TO PAR-NAME.
043200     PERFORM  PRINT-DETAIL.
043300*****************TEST (e) - SIMPLE TEST*****************
043400 F-STD-DEV-05.
043500     MOVE ZERO TO WS-NUM.
043600     MOVE  9.73119 TO MIN-RANGE.
043700     MOVE  9.73158 TO MAX-RANGE.
043800 F-STD-DEV-TEST-05.
043900     COMPUTE WS-NUM =
044000       FUNCTION STANDARD-DEVIATION(10.2, -0.2, 5.6, -15.6).
044100     IF (WS-NUM >= MIN-RANGE) AND
044200        (WS-NUM <= MAX-RANGE) THEN
044300                    PERFORM PASS
044400     ELSE
044500                    MOVE WS-NUM TO COMPUTED-N
044600                    MOVE MIN-RANGE TO CORRECT-MIN
044700                    MOVE MAX-RANGE TO CORRECT-MAX
044800                    PERFORM FAIL.
044900     GO TO F-STD-DEV-WRITE-05.
045000 F-STD-DEV-DELETE-05.
045100     PERFORM  DE-LETE.
045200     GO TO    F-STD-DEV-WRITE-05.
045300 F-STD-DEV-WRITE-05.
045400     MOVE "F-STD-DEV-05" TO PAR-NAME.
045500     PERFORM  PRINT-DETAIL.
045600*****************TEST (f) - SIMPLE TEST*****************
045700 F-STD-DEV-06.
045800     MOVE ZERO TO WS-NUM.
045900     MOVE  12.4976 TO MIN-RANGE.
046000     MOVE  12.4981 TO MAX-RANGE.
046100 F-STD-DEV-TEST-06.
046200     COMPUTE WS-NUM =
046300        FUNCTION STANDARD-DEVIATION(A, B, C, D, E, F, G, H).
046400     IF (WS-NUM >= MIN-RANGE) AND
046500        (WS-NUM <= MAX-RANGE) THEN
046600                    PERFORM PASS
046700     ELSE
046800                    MOVE WS-NUM TO COMPUTED-N
046900                    MOVE MIN-RANGE TO CORRECT-MIN
047000                    MOVE MAX-RANGE TO CORRECT-MAX
047100                    PERFORM FAIL.
047200     GO TO F-STD-DEV-WRITE-06.
047300 F-STD-DEV-DELETE-06.
047400     PERFORM  DE-LETE.
047500     GO TO    F-STD-DEV-WRITE-06.
047600 F-STD-DEV-WRITE-06.
047700     MOVE "F-STD-DEV-06" TO PAR-NAME.
047800     PERFORM  PRINT-DETAIL.
047900*****************TEST (g) - SIMPLE TEST*****************
048000 F-STD-DEV-07.
048100     MOVE ZERO TO WS-NUM.
048200     MOVE  2.16020 TO MIN-RANGE.
048300     MOVE  2.16028 TO MAX-RANGE.
048400 F-STD-DEV-TEST-07.
048500     COMPUTE WS-NUM =
048600        FUNCTION STANDARD-DEVIATION(IND(1), IND(2), IND(3)).
048700     IF (WS-NUM >= MIN-RANGE) AND
048800        (WS-NUM <= MAX-RANGE) THEN
048900                    PERFORM PASS
049000     ELSE
049100                    MOVE WS-NUM TO COMPUTED-N
049200                    MOVE MIN-RANGE TO CORRECT-MIN
049300                    MOVE MAX-RANGE TO CORRECT-MAX
049400                    PERFORM FAIL.
049500     GO TO F-STD-DEV-WRITE-07.
049600 F-STD-DEV-DELETE-07.
049700     PERFORM  DE-LETE.
049800     GO TO    F-STD-DEV-WRITE-07.
049900 F-STD-DEV-WRITE-07.
050000     MOVE "F-STD-DEV-07" TO PAR-NAME.
050100     PERFORM  PRINT-DETAIL.
050200*****************TEST (h) - SIMPLE TEST*****************
050300 F-STD-DEV-08.
050400     MOVE ZERO TO WS-NUM.
050500     MOVE  1.63296 TO MIN-RANGE.
050600     MOVE  1.63302 TO MAX-RANGE.
050700 F-STD-DEV-TEST-08.
050800     COMPUTE WS-NUM =
050900        FUNCTION STANDARD-DEVIATION(IND(P), IND(Q), IND(R)).
051000     IF (WS-NUM >= MIN-RANGE) AND
051100        (WS-NUM <= MAX-RANGE) THEN
051200                    PERFORM PASS
051300     ELSE
051400                    MOVE WS-NUM TO COMPUTED-N
051500                    MOVE MIN-RANGE TO CORRECT-MIN
051600                    MOVE MAX-RANGE TO CORRECT-MAX
051700                    PERFORM FAIL.
051800     GO TO F-STD-DEV-WRITE-08.
051900 F-STD-DEV-DELETE-08.
052000     PERFORM  DE-LETE.
052100     GO TO    F-STD-DEV-WRITE-08.
052200 F-STD-DEV-WRITE-08.
052300     MOVE "F-STD-DEV-08" TO PAR-NAME.
052400     PERFORM  PRINT-DETAIL.
052500*****************TEST (i) - SIMPLE TEST*****************
052600 F-STD-DEV-09.
052700     MOVE ZERO TO WS-NUM.
052800     MOVE 2.31511 TO MIN-RANGE.
052900     MOVE 2.31521 TO MAX-RANGE.
053000 F-STD-DEV-TEST-09.
053100     COMPUTE WS-NUM = FUNCTION STANDARD-DEVIATION(IND(ALL)).
053200     IF (WS-NUM >= MIN-RANGE) AND
053300        (WS-NUM <= MAX-RANGE) THEN
053400                    PERFORM PASS
053500     ELSE
053600                    MOVE WS-NUM TO COMPUTED-N
053700                    MOVE MIN-RANGE TO CORRECT-MIN
053800                    MOVE MAX-RANGE TO CORRECT-MAX
053900                    PERFORM FAIL.
054000     GO TO F-STD-DEV-WRITE-09.
054100 F-STD-DEV-DELETE-09.
054200     PERFORM  DE-LETE.
054300     GO TO    F-STD-DEV-WRITE-09.
054400 F-STD-DEV-WRITE-09.
054500     MOVE "F-STD-DEV-09" TO PAR-NAME.
054600     PERFORM  PRINT-DETAIL.
054700*****************TEST (j) - SIMPLE TEST*****************
054800 F-STD-DEV-10.
054900     MOVE ZERO TO WS-NUM.
055000     MOVE  0.028559  TO MIN-RANGE.
055100     MOVE  0.028561  TO MAX-RANGE.
055200 F-STD-DEV-TEST-10.
055300     COMPUTE WS-NUM =
055400        FUNCTION STANDARD-DEVIATION(0.00032, 0.00019,
055500                                    0.00014, -0.06574).
055600     IF (WS-NUM >= MIN-RANGE) AND
055700        (WS-NUM <= MAX-RANGE) THEN
055800                    PERFORM PASS
055900     ELSE
056000                    MOVE WS-NUM TO COMPUTED-N
056100                    MOVE MIN-RANGE TO CORRECT-MIN
056200                    MOVE MAX-RANGE TO CORRECT-MAX
056300                    PERFORM FAIL.
056400     GO TO F-STD-DEV-WRITE-10.
056500 F-STD-DEV-DELETE-10.
056600     PERFORM  DE-LETE.
056700     GO TO    F-STD-DEV-WRITE-10.
056800 F-STD-DEV-WRITE-10.
056900     MOVE "F-STD-DEV-10" TO PAR-NAME.
057000     PERFORM  PRINT-DETAIL.
057100*****************TEST (k) - SIMPLE TEST*****************
057200 F-STD-DEV-11.
057300     MOVE ZERO TO WS-NUM.
057400     MOVE -0.000020 TO MIN-RANGE.
057500     MOVE  0.000020 TO MAX-RANGE.
057600 F-STD-DEV-TEST-11.
057700     COMPUTE WS-NUM = FUNCTION STANDARD-DEVIATION(A, 5, A).
057800
057900     IF (WS-NUM >= MIN-RANGE) AND
058000        (WS-NUM <= MAX-RANGE) THEN
058100                    PERFORM PASS
058200     ELSE
058300                    MOVE WS-NUM TO COMPUTED-N
058400                    MOVE MIN-RANGE TO CORRECT-MIN
058500                    MOVE MAX-RANGE TO CORRECT-MAX
058600                    PERFORM FAIL.
058700     GO TO F-STD-DEV-WRITE-11.
058800 F-STD-DEV-DELETE-11.
058900     PERFORM  DE-LETE.
059000     GO TO    F-STD-DEV-WRITE-11.
059100 F-STD-DEV-WRITE-11.
059200     MOVE "F-STD-DEV-11" TO PAR-NAME.
059300     PERFORM  PRINT-DETAIL.
059400*****************TEST (a) - COMPLEX TEST****************
059500 F-STD-DEV-12.
059600     MOVE ZERO TO WS-NUM.
059700     MOVE  11.7995 TO MIN-RANGE.
059800     MOVE  11.8005 TO MAX-RANGE.
059900 F-STD-DEV-TEST-12.
060000     COMPUTE WS-NUM =
060100        FUNCTION STANDARD-DEVIATION(2.6 + 30, 4.5 * 2).
060200     IF (WS-NUM >= MIN-RANGE) AND
060300        (WS-NUM <= MAX-RANGE) THEN
060400                    PERFORM PASS
060500     ELSE
060600                    MOVE WS-NUM TO COMPUTED-N
060700                    MOVE MIN-RANGE TO CORRECT-MIN
060800                    MOVE MAX-RANGE TO CORRECT-MAX
060900                    PERFORM FAIL.
061000     GO TO F-STD-DEV-WRITE-12.
061100 F-STD-DEV-DELETE-12.
061200     PERFORM  DE-LETE.
061300     GO TO    F-STD-DEV-WRITE-12.
061400 F-STD-DEV-WRITE-12.
061500     MOVE "F-STD-DEV-12" TO PAR-NAME.
061600     PERFORM  PRINT-DETAIL.
061700*****************TEST (b) - COMPLEX TEST****************
061800 F-STD-DEV-13.
061900     MOVE ZERO TO WS-NUM.
062000     MOVE  19.3556 TO MIN-RANGE.
062100     MOVE  19.3572 TO MAX-RANGE.
062200 F-STD-DEV-TEST-13.
062300     COMPUTE WS-NUM =
062400         FUNCTION STANDARD-DEVIATION(E, 9 * A, 0, B / 2).
062500     IF (WS-NUM >= MIN-RANGE) AND
062600        (WS-NUM <= MAX-RANGE) THEN
062700                    PERFORM PASS
062800     ELSE
062900                    MOVE WS-NUM TO COMPUTED-N
063000                    MOVE MIN-RANGE TO CORRECT-MIN
063100                    MOVE MAX-RANGE TO CORRECT-MAX
063200                    PERFORM FAIL.
063300     GO TO F-STD-DEV-WRITE-13.
063400 F-STD-DEV-DELETE-13.
063500     PERFORM  DE-LETE.
063600     GO TO    F-STD-DEV-WRITE-13.
063700 F-STD-DEV-WRITE-13.
063800     MOVE "F-STD-DEV-13" TO PAR-NAME.
063900     PERFORM  PRINT-DETAIL.
064000*****************TEST (c) - COMPLEX TEST****************
064100 F-STD-DEV-14.
064200     MOVE ZERO TO WS-NUM.
064300     MOVE 77.9969 TO MIN-RANGE.
064400     MOVE 78.0031 TO MAX-RANGE.
064500 F-STD-DEV-TEST-14.
064600     COMPUTE WS-NUM = FUNCTION STANDARD-DEVIATION(A) + 78.
064700     IF (WS-NUM >= MIN-RANGE) AND
064800        (WS-NUM <= MAX-RANGE) THEN
064900                    PERFORM PASS
065000     ELSE
065100                    MOVE WS-NUM TO COMPUTED-N
065200                    MOVE MIN-RANGE TO CORRECT-MIN
065300                    MOVE MAX-RANGE TO CORRECT-MAX
065400                    PERFORM FAIL.
065500     GO TO F-STD-DEV-WRITE-14.
065600 F-STD-DEV-DELETE-14.
065700     PERFORM  DE-LETE.
065800     GO TO    F-STD-DEV-WRITE-14.
065900 F-STD-DEV-WRITE-14.
066000     MOVE "F-STD-DEV-14" TO PAR-NAME.
066100     PERFORM  PRINT-DETAIL.
066200*****************TEST (d) - COMPLEX TEST****************
066300 F-STD-DEV-15.
066400     MOVE ZERO TO WS-NUM.
066500     MOVE 0.99996 TO MIN-RANGE.
066600     MOVE 1.00004 TO MAX-RANGE.
066700 F-STD-DEV-TEST-15.
066800     COMPUTE WS-NUM = FUNCTION STANDARD-DEVIATION(A, B) +
066900                      FUNCTION STANDARD-DEVIATION(1, 1).
067000     IF (WS-NUM >= MIN-RANGE) AND
067100        (WS-NUM <= MAX-RANGE) THEN
067200                    PERFORM PASS
067300     ELSE
067400                    MOVE WS-NUM TO COMPUTED-N
067500                    MOVE MIN-RANGE TO CORRECT-MIN
067600                    MOVE MAX-RANGE TO CORRECT-MAX
067700                    PERFORM FAIL.
067800     GO TO F-STD-DEV-WRITE-15.
067900 F-STD-DEV-DELETE-15.
068000     PERFORM  DE-LETE.
068100     GO TO    F-STD-DEV-WRITE-15.
068200 F-STD-DEV-WRITE-15.
068300     MOVE "F-STD-DEV-15" TO PAR-NAME.
068400     PERFORM  PRINT-DETAIL.
068500*****************TEST (e) - COMPLEX TEST****************
068600 F-STD-DEV-16.
068700     MOVE ZERO TO WS-NUM.
068800     MOVE -0.000040 TO MIN-RANGE.
068900     MOVE  0.000040 TO MAX-RANGE.
069000 F-STD-DEV-TEST-16.
069100     COMPUTE WS-NUM = FUNCTION STANDARD-DEVIATION(
069200                      FUNCTION STANDARD-DEVIATION(0, 0)).
069300     IF (WS-NUM >= MIN-RANGE) AND
069400        (WS-NUM <= MAX-RANGE) THEN
069500                    PERFORM PASS
069600     ELSE
069700                    MOVE WS-NUM TO COMPUTED-N
069800                    MOVE MIN-RANGE TO CORRECT-MIN
069900                    MOVE MAX-RANGE TO CORRECT-MAX
070000                    PERFORM FAIL.
070100     GO TO F-STD-DEV-WRITE-16.
070200 F-STD-DEV-DELETE-16.
070300     PERFORM  DE-LETE.
070400     GO TO    F-STD-DEV-WRITE-16.
070500 F-STD-DEV-WRITE-16.
070600     MOVE "F-STD-DEV-16" TO PAR-NAME.
070700     PERFORM  PRINT-DETAIL.
070800*****************SPECIAL PERFORM TEST**********************
070900 F-STD-DEV-17.
071000     PERFORM F-STD-DEV-TEST-17
071100       UNTIL FUNCTION STANDARD-DEVIATION(1, 1, ARG3) > 1.
071200     PERFORM PASS.
071300     GO TO F-STD-DEV-WRITE-17.
071400 F-STD-DEV-TEST-17.
071500     COMPUTE ARG3 = ARG3 + 1.
071600 F-STD-DEV-DELETE-17.
071700     PERFORM  DE-LETE.
071800     GO TO    F-STD-DEV-WRITE-17.
071900 F-STD-DEV-WRITE-17.
072000     MOVE "F-STD-DEV-17" TO PAR-NAME.
072100     PERFORM  PRINT-DETAIL.
072200********************END OF TESTS***************
072300 CCVS-EXIT SECTION.
072400 CCVS-999999.
072500     GO TO CLOSE-FILES.
