000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF138A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function SUM .      *
000900*                                                         *
001000***********************************************************
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.
001400     XXXXX082.
001500 OBJECT-COMPUTER.
001600     XXXXX083.
001700 INPUT-OUTPUT SECTION.
001800 FILE-CONTROL.
001900     SELECT PRINT-FILE ASSIGN TO
002000     XXXXX055.
002100 DATA DIVISION.
002200 FILE SECTION.
002300 FD  PRINT-FILE.
002400 01  PRINT-REC PICTURE X(120).
002500 01  DUMMY-RECORD PICTURE X(120).
002600 WORKING-STORAGE SECTION.
002700***********************************************************
002800* Variables specific to the Intrinsic Function Test IF138A*
002900***********************************************************
003000 01  A                   PIC S9(10)          VALUE 5.
003100 01  B                   PIC S9(10)          VALUE 7.
003200 01  C                   PIC S9(10)          VALUE -4.
003300 01  D                   PIC S9(10)          VALUE 10.
003400 01  E                   PIC S9(5)V9(5)      VALUE 34.26.
003500 01  F                   PIC S9(5)V9(5)      VALUE -8.32.
003600 01  G                   PIC S9(5)V9(5)      VALUE 4.08.
003700 01  H                   PIC S9(5)V9(5)      VALUE -5.3.
003800 01  M                   PIC S9(10)          VALUE 320000.
003900 01  N                   PIC S9(10)          VALUE 650000.
004000 01  O                   PIC S9(10)          VALUE -430000.
004100 01  P                   PIC S9(10)          VALUE 1.
004200 01  Q                   PIC S9(10)          VALUE 3.
004300 01  R                   PIC S9(10)          VALUE 5.
004400 01  ARG1                PIC S9(10)          VALUE 1.
004500 01  ARR                                     VALUE "40537".
004600     02  IND OCCURS 5 TIMES PIC 9.
004700 01  TEMP                PIC S9(10)V9(5).
004800 01  WS-NUM              PIC S9(6)V9(7).
004900 01  MIN-RANGE           PIC S9(5)V9(7).
005000 01  MAX-RANGE           PIC S9(5)V9(7).
005100*
005200**********************************************************
005300*
005400 01  TEST-RESULTS.
005500     02 FILLER                   PIC X      VALUE SPACE.
005600     02 FEATURE                  PIC X(20)  VALUE SPACE.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005900     02 FILLER                   PIC X      VALUE SPACE.
006000     02  PAR-NAME.
006100       03 FILLER                 PIC X(19)  VALUE SPACE.
006200       03  PARDOT-X              PIC X      VALUE SPACE.
006300       03 DOTVALUE               PIC 99     VALUE ZERO.
006400     02 FILLER                   PIC X(8)   VALUE SPACE.
006500     02 RE-MARK                  PIC X(61).
006600 01  TEST-COMPUTED.
006700     02 FILLER                   PIC X(30)  VALUE SPACE.
006800     02 FILLER                   PIC X(17)  VALUE
006900            "       COMPUTED=".
007000     02 COMPUTED-X.
007100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007200     03 COMPUTED-N               REDEFINES COMPUTED-A
007300                                 PIC -9(9).9(9).
007400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007700     03       CM-18V0 REDEFINES COMPUTED-A.
007800         04 COMPUTED-18V0                    PIC -9(18).
007900         04 FILLER                           PIC X.
008000     03 FILLER PIC X(50) VALUE SPACE.
008100 01  TEST-CORRECT.
008200     02 FILLER PIC X(30) VALUE SPACE.
008300     02 FILLER PIC X(17) VALUE "       CORRECT =".
008400     02 CORRECT-X.
008500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009000     03      CR-18V0 REDEFINES CORRECT-A.
009100         04 CORRECT-18V0                     PIC -9(18).
009200         04 FILLER                           PIC X.
009300     03 FILLER PIC X(2) VALUE SPACE.
009400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009500 01  TEST-CORRECT-MIN.
009600     02 FILLER PIC X(30) VALUE SPACE.
009700     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
009800     02 CORRECTMI-X.
009900     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
010000     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
010100     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
010200     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
010300     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
010400     03      CR-18V0 REDEFINES CORRECTMI-A.
010500         04 CORRECTMI-18V0                     PIC -9(18).
010600         04 FILLER                           PIC X.
010700     03 FILLER PIC X(2) VALUE SPACE.
010800     03 FILLER                           PIC X(48) VALUE SPACE.
010900 01  TEST-CORRECT-MAX.
011000     02 FILLER PIC X(30) VALUE SPACE.
011100     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
011200     02 CORRECTMA-X.
011300     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
011400     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
011500     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
011600     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
011700     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
011800     03      CR-18V0 REDEFINES CORRECTMA-A.
011900         04 CORRECTMA-18V0                     PIC -9(18).
012000         04 FILLER                           PIC X.
012100     03 FILLER PIC X(2) VALUE SPACE.
012200     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012300 01  CCVS-C-1.
012400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012500-    "SS  PARAGRAPH-NAME
012600-    "       REMARKS".
012700     02 FILLER                     PIC X(20)    VALUE SPACE.
012800 01  CCVS-C-2.
012900     02 FILLER                     PIC X        VALUE SPACE.
013000     02 FILLER                     PIC X(6)     VALUE "TESTED".
013100     02 FILLER                     PIC X(15)    VALUE SPACE.
013200     02 FILLER                     PIC X(4)     VALUE "FAIL".
013300     02 FILLER                     PIC X(94)    VALUE SPACE.
013400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013500 01  REC-CT                        PIC 99       VALUE ZERO.
013600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014500 01  CCVS-H-1.
014600     02  FILLER                    PIC X(39)    VALUE SPACES.
014700     02  FILLER                    PIC X(42)    VALUE
014800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014900     02  FILLER                    PIC X(39)    VALUE SPACES.
015000 01  CCVS-H-2A.
015100   02  FILLER                        PIC X(40)  VALUE SPACE.
015200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015300   02  FILLER                        PIC XXXX   VALUE
015400     "4.2 ".
015500   02  FILLER                        PIC X(28)  VALUE
015600            " COPY - NOT FOR DISTRIBUTION".
015700   02  FILLER                        PIC X(41)  VALUE SPACE.
015800
015900 01  CCVS-H-2B.
016000   02  FILLER                        PIC X(15)  VALUE
016100            "TEST RESULT OF ".
016200   02  TEST-ID                       PIC X(9).
016300   02  FILLER                        PIC X(4)   VALUE
016400            " IN ".
016500   02  FILLER                        PIC X(12)  VALUE
016600     " HIGH       ".
016700   02  FILLER                        PIC X(22)  VALUE
016800            " LEVEL VALIDATION FOR ".
016900   02  FILLER                        PIC X(58)  VALUE
017000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017100 01  CCVS-H-3.
017200     02  FILLER                      PIC X(34)  VALUE
017300            " FOR OFFICIAL USE ONLY    ".
017400     02  FILLER                      PIC X(58)  VALUE
017500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017600     02  FILLER                      PIC X(28)  VALUE
017700            "  COPYRIGHT   1985 ".
017800 01  CCVS-E-1.
017900     02 FILLER                       PIC X(52)  VALUE SPACE.
018000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018100     02 ID-AGAIN                     PIC X(9).
018200     02 FILLER                       PIC X(45)  VALUE SPACES.
018300 01  CCVS-E-2.
018400     02  FILLER                      PIC X(31)  VALUE SPACE.
018500     02  FILLER                      PIC X(21)  VALUE SPACE.
018600     02 CCVS-E-2-2.
018700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018800         03 FILLER                   PIC X      VALUE SPACE.
018900         03 ENDER-DESC               PIC X(44)  VALUE
019000            "ERRORS ENCOUNTERED".
019100 01  CCVS-E-3.
019200     02  FILLER                      PIC X(22)  VALUE
019300            " FOR OFFICIAL USE ONLY".
019400     02  FILLER                      PIC X(12)  VALUE SPACE.
019500     02  FILLER                      PIC X(58)  VALUE
019600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019700     02  FILLER                      PIC X(13)  VALUE SPACE.
019800     02 FILLER                       PIC X(15)  VALUE
019900             " COPYRIGHT 1985".
020000 01  CCVS-E-4.
020100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020200     02 FILLER                       PIC X(4)   VALUE " OF ".
020300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020400     02 FILLER                       PIC X(40)  VALUE
020500      "  TESTS WERE EXECUTED SUCCESSFULLY".
020600 01  XXINFO.
020700     02 FILLER                       PIC X(19)  VALUE
020800            "*** INFORMATION ***".
020900     02 INFO-TEXT.
021000       04 FILLER                     PIC X(8)   VALUE SPACE.
021100       04 XXCOMPUTED                 PIC X(20).
021200       04 FILLER                     PIC X(5)   VALUE SPACE.
021300       04 XXCORRECT                  PIC X(20).
021400     02 INF-ANSI-REFERENCE           PIC X(48).
021500 01  HYPHEN-LINE.
021600     02 FILLER  PIC IS X VALUE IS SPACE.
021700     02 FILLER  PIC IS X(65)    VALUE IS "************************
021800-    "*****************************************".
021900     02 FILLER  PIC IS X(54)    VALUE IS "************************
022000-    "******************************".
022100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022200     "IF138A".
022300 PROCEDURE DIVISION.
022400 CCVS1 SECTION.
022500 OPEN-FILES.
022600     OPEN     OUTPUT PRINT-FILE.
022700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022800     MOVE    SPACE TO TEST-RESULTS.
022900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023000     GO TO CCVS1-EXIT.
023100 CLOSE-FILES.
023200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023300 TERMINATE-CCVS.
023400     STOP     RUN.
023500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023900     MOVE "****TEST DELETED****" TO RE-MARK.
024000 PRINT-DETAIL.
024100     IF REC-CT NOT EQUAL TO ZERO
024200             MOVE "." TO PARDOT-X
024300             MOVE REC-CT TO DOTVALUE.
024400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024900     MOVE SPACE TO CORRECT-X.
025000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025100     MOVE     SPACE TO RE-MARK.
025200 HEAD-ROUTINE.
025300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025700 COLUMN-NAMES-ROUTINE.
025800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026100 END-ROUTINE.
026200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026300 END-RTN-EXIT.
026400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026500 END-ROUTINE-1.
026600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026800      ADD PASS-COUNTER TO ERROR-HOLD.
026900      MOVE PASS-COUNTER TO CCVS-E-4-1.
027000      MOVE ERROR-HOLD TO CCVS-E-4-2.
027100      MOVE CCVS-E-4 TO CCVS-E-2-2.
027200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027300  END-ROUTINE-12.
027400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027500     IF       ERROR-COUNTER IS EQUAL TO ZERO
027600         MOVE "NO " TO ERROR-TOTAL
027700         ELSE
027800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028000     PERFORM WRITE-LINE.
028100 END-ROUTINE-13.
028200     IF DELETE-COUNTER IS EQUAL TO ZERO
028300         MOVE "NO " TO ERROR-TOTAL  ELSE
028400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028700      IF   INSPECT-COUNTER EQUAL TO ZERO
028800          MOVE "NO " TO ERROR-TOTAL
028900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029300 WRITE-LINE.
029400     ADD 1 TO RECORD-COUNT.
029500Y    IF RECORD-COUNT GREATER 42
029600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029700Y        MOVE SPACE TO DUMMY-RECORD
029800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029900Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030000Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030100Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030200Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030300Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
030400Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
030500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030700Y        MOVE ZERO TO RECORD-COUNT.
030800     PERFORM WRT-LN.
030900 WRT-LN.
031000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031100     MOVE SPACE TO DUMMY-RECORD.
031200 BLANK-LINE-PRINT.
031300     PERFORM WRT-LN.
031400 FAIL-ROUTINE.
031500     IF     COMPUTED-X NOT EQUAL TO SPACE
031600            GO TO FAIL-ROUTINE-WRITE.
031700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032100     MOVE   SPACES TO INF-ANSI-REFERENCE.
032200     GO TO  FAIL-ROUTINE-EX.
032300 FAIL-ROUTINE-WRITE.
032400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
032500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
032600                              CORMA-ANSI-REFERENCE.
032700     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
032800           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
032900           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
033000     ELSE
033100           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
033200     PERFORM WRITE-LINE.
033300     MOVE   SPACES TO COR-ANSI-REFERENCE.
033400 FAIL-ROUTINE-EX. EXIT.
033500 BAIL-OUT.
033600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033800 BAIL-OUT-WRITE.
033900     MOVE CORRECT-A TO XXCORRECT.
034000     MOVE COMPUTED-A TO XXCOMPUTED.
034100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
034200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034300     MOVE   SPACES TO INF-ANSI-REFERENCE.
034400 BAIL-OUT-EX. EXIT.
034500 CCVS1-EXIT.
034600     EXIT.
034700********************************************************
034800*                                                      *
034900*    Intrinsic Function Tests         IF138A - SUM     *
035000*                                                      *
035100********************************************************
035200 SECT-IF138A SECTION.
035300 F-SUM-INFO.
035400     MOVE     "See ref. A-69 2.40" TO ANSI-REFERENCE.
035500     MOVE     "SUM Function" TO FEATURE.
035600*****************TEST (a) - SIMPLE TEST*****************
035700 F-SUM-01.
035800     MOVE ZERO TO WS-NUM.
035900 F-SUM-TEST-01.
036000     COMPUTE WS-NUM = FUNCTION SUM(5, -2, -14, 0).
036100     IF WS-NUM = -11 THEN
036200                    PERFORM PASS
036300     ELSE
036400                    MOVE WS-NUM TO COMPUTED-N
036500                    MOVE -11 TO CORRECT-N
036600                    PERFORM FAIL.
036700     GO TO F-SUM-WRITE-01.
036800 F-SUM-DELETE-01.
036900     PERFORM  DE-LETE.
037000     GO TO    F-SUM-WRITE-01.
037100 F-SUM-WRITE-01.
037200     MOVE "F-SUM-01" TO PAR-NAME.
037300     PERFORM  PRINT-DETAIL.
037400*****************TEST (b) - SIMPLE TEST*****************
037500 F-SUM-02.
037600     EVALUATE FUNCTION SUM(3.9, -0.3, 8.7, 100.2)
037700     WHEN 112.498 THRU 122.502
037800                    PERFORM PASS
037900     WHEN OTHER
038000                    PERFORM FAIL.
038100     GO TO F-SUM-WRITE-02.
038200 F-SUM-DELETE-02.
038300     PERFORM  DE-LETE.
038400     GO TO    F-SUM-WRITE-02.
038500 F-SUM-WRITE-02.
038600     MOVE "F-SUM-02" TO PAR-NAME.
038700     PERFORM  PRINT-DETAIL.
038800*****************TEST (c) - SIMPLE TEST*****************
038900 F-SUM-03.
039000     IF FUNCTION SUM(A, B, C, D) = 18 THEN
039100                    PERFORM PASS
039200     ELSE
039300                    PERFORM FAIL.
039400     GO TO F-SUM-WRITE-03.
039500 F-SUM-DELETE-03.
039600     PERFORM  DE-LETE.
039700     GO TO    F-SUM-WRITE-03.
039800 F-SUM-WRITE-03.
039900     MOVE "F-SUM-03" TO PAR-NAME.
040000     PERFORM  PRINT-DETAIL.
040100*****************TEST (d) - SIMPLE TEST*****************
040200 F-SUM-04.
040300     MOVE ZERO TO WS-NUM.
040400 F-SUM-TEST-04.
040500     COMPUTE WS-NUM = FUNCTION SUM(E, F, G, H).
040600     IF (WS-NUM >= 24.7195) AND
040700        (WS-NUM <= 24.7205)
040800                    PERFORM PASS
040900     ELSE
041000                    MOVE WS-NUM TO COMPUTED-N
041100                    MOVE 24.72 TO CORRECT-N
041200                    PERFORM FAIL.
041300     GO TO F-SUM-WRITE-04.
041400 F-SUM-DELETE-04.
041500     PERFORM  DE-LETE.
041600     GO TO    F-SUM-WRITE-04.
041700 F-SUM-WRITE-04.
041800     MOVE "F-SUM-04" TO PAR-NAME.
041900     PERFORM  PRINT-DETAIL.
042000*****************TEST (e) - SIMPLE TEST*****************
042100 F-SUM-05.
042200     MOVE ZERO TO WS-NUM.
042300 F-SUM-TEST-05.
042400     COMPUTE WS-NUM = FUNCTION SUM(10.2, -0.2, 5.6, -15.6).
042500     IF (WS-NUM >= -0.000020) AND
042600        (WS-NUM <=  0.000020)
042700                    PERFORM PASS
042800     ELSE
042900                    MOVE WS-NUM TO COMPUTED-N
043000                    MOVE 0 TO CORRECT-N
043100                    PERFORM FAIL.
043200     GO TO F-SUM-WRITE-05.
043300 F-SUM-DELETE-05.
043400     PERFORM  DE-LETE.
043500     GO TO    F-SUM-WRITE-05.
043600 F-SUM-WRITE-05.
043700     MOVE "F-SUM-05" TO PAR-NAME.
043800     PERFORM  PRINT-DETAIL.
043900*****************TEST (f) - SIMPLE TEST*****************
044000 F-SUM-06.
044100     MOVE ZERO TO WS-NUM.
044200 F-SUM-TEST-06.
044300     COMPUTE WS-NUM = FUNCTION SUM(A, B, C, D, E, F, G, H).
044400     IF (WS-NUM >= 42.7191) AND
044500        (WS-NUM <= 42.7209)
044600                    PERFORM PASS
044700     ELSE
044800                    MOVE WS-NUM TO COMPUTED-N
044900                    MOVE 42.72 TO CORRECT-N
045000                    PERFORM FAIL.
045100     GO TO F-SUM-WRITE-06.
045200 F-SUM-DELETE-06.
045300     PERFORM  DE-LETE.
045400     GO TO    F-SUM-WRITE-06.
045500 F-SUM-WRITE-06.
045600     MOVE "F-SUM-06" TO PAR-NAME.
045700     PERFORM  PRINT-DETAIL.
045800*****************TEST (g) - SIMPLE TEST*****************
045900 F-SUM-07.
046000     MOVE ZERO TO WS-NUM.
046100 F-SUM-TEST-07.
046200     COMPUTE WS-NUM = FUNCTION SUM(IND(1), IND(2), IND(3)).
046300     IF WS-NUM = 9 THEN
046400                    PERFORM PASS
046500     ELSE
046600                    MOVE WS-NUM TO COMPUTED-N
046700                    MOVE 9 TO CORRECT-N
046800                    PERFORM FAIL.
046900     GO TO F-SUM-WRITE-07.
047000 F-SUM-DELETE-07.
047100     PERFORM  DE-LETE.
047200     GO TO    F-SUM-WRITE-07.
047300 F-SUM-WRITE-07.
047400     MOVE "F-SUM-07" TO PAR-NAME.
047500     PERFORM  PRINT-DETAIL.
047600*****************TEST (h) - SIMPLE TEST*****************
047700 F-SUM-08.
047800     MOVE ZERO TO WS-NUM.
047900 F-SUM-TEST-08.
048000     COMPUTE WS-NUM = FUNCTION SUM(IND(P), IND(Q), IND(R)).
048100     IF WS-NUM = 16 THEN
048200                    PERFORM PASS
048300     ELSE
048400                    MOVE WS-NUM TO COMPUTED-N
048500                    MOVE 16 TO CORRECT-N
048600                    PERFORM FAIL.
048700     GO TO F-SUM-WRITE-08.
048800 F-SUM-DELETE-08.
048900     PERFORM  DE-LETE.
049000     GO TO    F-SUM-WRITE-08.
049100 F-SUM-WRITE-08.
049200     MOVE "F-SUM-08" TO PAR-NAME.
049300     PERFORM  PRINT-DETAIL.
049400*****************TEST (i) - SIMPLE TEST*****************
049500 F-SUM-09.
049600     MOVE ZERO TO WS-NUM.
049700 F-SUM-TEST-09.
049800     COMPUTE WS-NUM = FUNCTION SUM(IND(ALL)).
049900     IF WS-NUM = 19 THEN
050000                    PERFORM PASS
050100     ELSE
050200                    MOVE WS-NUM TO COMPUTED-N
050300                    MOVE 19 TO CORRECT-N
050400                    PERFORM FAIL.
050500     GO TO F-SUM-WRITE-09.
050600 F-SUM-DELETE-09.
050700     PERFORM  DE-LETE.
050800     GO TO    F-SUM-WRITE-09.
050900 F-SUM-WRITE-09.
051000     MOVE "F-SUM-09" TO PAR-NAME.
051100     PERFORM  PRINT-DETAIL.
051200*****************TEST (k) - SIMPLE TEST*****************
051300 F-SUM-11.
051400     MOVE ZERO TO WS-NUM.
051500 F-SUM-TEST-11.
051600     COMPUTE WS-NUM = FUNCTION SUM(M, N, O).
051700     IF WS-NUM = 540000 THEN
051800                    PERFORM PASS
051900     ELSE
052000                    MOVE WS-NUM TO COMPUTED-N
052100                    MOVE 540000 TO CORRECT-N
052200                    PERFORM FAIL.
052300     GO TO F-SUM-WRITE-11.
052400 F-SUM-DELETE-11.
052500     PERFORM  DE-LETE.
052600     GO TO    F-SUM-WRITE-11.
052700 F-SUM-WRITE-11.
052800     MOVE "F-SUM-11" TO PAR-NAME.
052900     PERFORM  PRINT-DETAIL.
053000*****************TEST (a) - COMPLEX TEST****************
053100 F-SUM-12.
053200     MOVE ZERO TO WS-NUM.
053300     MOVE  41.5992 TO MIN-RANGE.
053400     MOVE  41.6008 TO MAX-RANGE.
053500 F-SUM-TEST-12.
053600     COMPUTE WS-NUM = FUNCTION SUM(2.6 + 30, 4.5 * 2).
053700     IF (WS-NUM >= MIN-RANGE) AND
053800        (WS-NUM <= MAX-RANGE) THEN
053900                    PERFORM PASS
054000     ELSE
054100                    MOVE WS-NUM TO COMPUTED-N
054200                    MOVE MIN-RANGE TO CORRECT-MIN
054300                    MOVE MAX-RANGE TO CORRECT-MAX
054400                    PERFORM FAIL.
054500     GO TO F-SUM-WRITE-12.
054600 F-SUM-DELETE-12.
054700     PERFORM  DE-LETE.
054800     GO TO    F-SUM-WRITE-12.
054900 F-SUM-WRITE-12.
055000     MOVE "F-SUM-12" TO PAR-NAME.
055100     PERFORM  PRINT-DETAIL.
055200*****************TEST (b) - COMPLEX TEST****************
055300 F-SUM-13.
055400     MOVE ZERO TO WS-NUM.
055500     MOVE  82.7583 TO MIN-RANGE.
055600     MOVE  82.7616 TO MAX-RANGE.
055700 F-SUM-TEST-13.
055800     COMPUTE WS-NUM = FUNCTION SUM(E, 9 * A, B / 2).
055900     IF (WS-NUM >= MIN-RANGE) AND
056000        (WS-NUM <= MAX-RANGE) THEN
056100                    PERFORM PASS
056200     ELSE
056300                    MOVE WS-NUM TO COMPUTED-N
056400                    MOVE MIN-RANGE TO CORRECT-MIN
056500                    MOVE MAX-RANGE TO CORRECT-MAX
056600                    PERFORM FAIL.
056700     GO TO F-SUM-WRITE-13.
056800 F-SUM-DELETE-13.
056900     PERFORM  DE-LETE.
057000     GO TO    F-SUM-WRITE-13.
057100 F-SUM-WRITE-13.
057200     MOVE "F-SUM-13" TO PAR-NAME.
057300     PERFORM  PRINT-DETAIL.
057400*****************TEST (c) - COMPLEX TEST****************
057500 F-SUM-14.
057600     MOVE ZERO TO WS-NUM.
057700     MOVE 89.9982 TO MIN-RANGE.
057800     MOVE 90.0018 TO MAX-RANGE.
057900 F-SUM-TEST-14.
058000     COMPUTE WS-NUM = FUNCTION SUM(A, B) + 78.
058100     IF (WS-NUM >= MIN-RANGE) AND
058200        (WS-NUM <= MAX-RANGE) THEN
058300                    PERFORM PASS
058400     ELSE
058500                    MOVE WS-NUM TO COMPUTED-N
058600                    MOVE MIN-RANGE TO CORRECT-MIN
058700                    MOVE MAX-RANGE TO CORRECT-MAX
058800                    PERFORM FAIL.
058900     GO TO F-SUM-WRITE-14.
059000 F-SUM-DELETE-14.
059100     PERFORM  DE-LETE.
059200     GO TO    F-SUM-WRITE-14.
059300 F-SUM-WRITE-14.
059400     MOVE "F-SUM-14" TO PAR-NAME.
059500     PERFORM  PRINT-DETAIL.
059600*****************TEST (d) - COMPLEX TEST****************
059700 F-SUM-15.
059800     MOVE ZERO TO WS-NUM.
059900     MOVE 4.99990 TO MIN-RANGE.
060000     MOVE 5.00010 TO MAX-RANGE.
060100 F-SUM-TEST-15.
060200     COMPUTE WS-NUM = FUNCTION SUM(A, B) +
060300                      FUNCTION SUM(-2.6, -4.4).
060400     IF (WS-NUM >= MIN-RANGE) AND
060500        (WS-NUM <= MAX-RANGE) THEN
060600                    PERFORM PASS
060700     ELSE
060800                    MOVE WS-NUM TO COMPUTED-N
060900                    MOVE MIN-RANGE TO CORRECT-MIN
061000                    MOVE MAX-RANGE TO CORRECT-MAX
061100                    PERFORM FAIL.
061200     GO TO F-SUM-WRITE-15.
061300 F-SUM-DELETE-15.
061400     PERFORM  DE-LETE.
061500     GO TO    F-SUM-WRITE-15.
061600 F-SUM-WRITE-15.
061700     MOVE "F-SUM-15" TO PAR-NAME.
061800     PERFORM  PRINT-DETAIL.
061900*****************TEST (e) - COMPLEX TEST****************
062000 F-SUM-16.
062100     MOVE ZERO TO WS-NUM.
062200     MOVE 3.99992 TO MIN-RANGE.
062300     MOVE 4.00008 TO MAX-RANGE.
062400 F-SUM-TEST-16.
062500     COMPUTE WS-NUM =
062600               FUNCTION SUM(FUNCTION SUM(6.8, -6.8), 4).
062700     IF (WS-NUM >= MIN-RANGE) AND
062800        (WS-NUM <= MAX-RANGE) THEN
062900                    PERFORM PASS
063000     ELSE
063100                    MOVE WS-NUM TO COMPUTED-N
063200                    MOVE MIN-RANGE TO CORRECT-MIN
063300                    MOVE MAX-RANGE TO CORRECT-MAX
063400                    PERFORM FAIL.
063500     GO TO F-SUM-WRITE-16.
063600 F-SUM-DELETE-16.
063700     PERFORM  DE-LETE.
063800     GO TO    F-SUM-WRITE-16.
063900 F-SUM-WRITE-16.
064000     MOVE "F-SUM-16" TO PAR-NAME.
064100     PERFORM  PRINT-DETAIL.
064200*****************SPECIAL PERFORM TEST**********************
064300 F-SUM-17.
064400     PERFORM F-SUM-TEST-17
064500       UNTIL FUNCTION SUM(ARG1, 1) > 10.
064600     PERFORM PASS.
064700     GO TO F-SUM-WRITE-17.
064800 F-SUM-TEST-17.
064900     COMPUTE ARG1 = ARG1 + 1.
065000 F-SUM-DELETE-17.
065100     PERFORM  DE-LETE.
065200     GO TO    F-SUM-WRITE-17.
065300 F-SUM-WRITE-17.
065400     MOVE "F-SUM-17" TO PAR-NAME.
065500     PERFORM  PRINT-DETAIL.
065600********************END OF TESTS***************
065700 CCVS-EXIT SECTION.
065800 CCVS-999999.
065900     GO TO CLOSE-FILES.
