000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IF133A.
000400
000500***********************************************************
000600*                                                         *
000700* This program forms part of the CCVS85 COBOL Test Suite. *
000800* It contains tests for the Intrinsic Function            *
000900* REM.                                                    *
001000*                                                         *
001100***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.
001500     XXXXX082.
001600 OBJECT-COMPUTER.
001700     XXXXX083.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT PRINT-FILE ASSIGN TO
002100     XXXXX055.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  PRINT-FILE.
002500 01  PRINT-REC PICTURE X(120).
002600 01  DUMMY-RECORD PICTURE X(120).
002700 WORKING-STORAGE SECTION.
002800***********************************************************
002900* Variables specific to the Intrinsic Function Test IF133A*
003000***********************************************************
003100 01  A                   PIC S9(10)          VALUE 5.
003200 01  B                   PIC S9(5)V9(5)      VALUE 7.36.
003300 01  C                   PIC S9(10)          VALUE -4.
003400 01  D                   PIC S9(10)          VALUE 7.
003500 01  ARG2                PIC S9(10)          VALUE 1.
003600 01  TEMP                PIC S9(10).
003700 01  WS-NUM              PIC S9(5)V9(6).
003800 01  MIN-RANGE           PIC S9(5)V9(7).
003900 01  MAX-RANGE           PIC S9(5)V9(7).
004000*
004100**********************************************************
004200*
004300 01  TEST-RESULTS.
004400     02 FILLER                   PIC X      VALUE SPACE.
004500     02 FEATURE                  PIC X(20)  VALUE SPACE.
004600     02 FILLER                   PIC X      VALUE SPACE.
004700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
004800     02 FILLER                   PIC X      VALUE SPACE.
004900     02  PAR-NAME.
005000       03 FILLER                 PIC X(19)  VALUE SPACE.
005100       03  PARDOT-X              PIC X      VALUE SPACE.
005200       03 DOTVALUE               PIC 99     VALUE ZERO.
005300     02 FILLER                   PIC X(8)   VALUE SPACE.
005400     02 RE-MARK                  PIC X(61).
005500 01  TEST-COMPUTED.
005600     02 FILLER                   PIC X(30)  VALUE SPACE.
005700     02 FILLER                   PIC X(17)  VALUE
005800            "       COMPUTED=".
005900     02 COMPUTED-X.
006000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006100     03 COMPUTED-N               REDEFINES COMPUTED-A
006200                                 PIC -9(9).9(9).
006300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
006400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
006500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
006600     03       CM-18V0 REDEFINES COMPUTED-A.
006700         04 COMPUTED-18V0                    PIC -9(18).
006800         04 FILLER                           PIC X.
006900     03 FILLER PIC X(50) VALUE SPACE.
007000 01  TEST-CORRECT.
007100     02 FILLER PIC X(30) VALUE SPACE.
007200     02 FILLER PIC X(17) VALUE "       CORRECT =".
007300     02 CORRECT-X.
007400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
007500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
007600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
007700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
007800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
007900     03      CR-18V0 REDEFINES CORRECT-A.
008000         04 CORRECT-18V0                     PIC -9(18).
008100         04 FILLER                           PIC X.
008200     03 FILLER PIC X(2) VALUE SPACE.
008300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
008400 01  TEST-CORRECT-MIN.
008500     02 FILLER PIC X(30) VALUE SPACE.
008600     02 FILLER PIC X(17) VALUE "     MIN VALUE =".
008700     02 CORRECTMI-X.
008800     03 CORRECTMI-A                 PIC X(20) VALUE SPACE.
008900     03 CORRECT-MIN    REDEFINES CORRECTMI-A     PIC -9(9).9(9).
009000     03 CORRECTMI-0V18 REDEFINES CORRECTMI-A     PIC -.9(18).
009100     03 CORRECTMI-4V14 REDEFINES CORRECTMI-A     PIC -9(4).9(14).
009200     03 CORRECTMI-14V4 REDEFINES CORRECTMI-A     PIC -9(14).9(4).
009300     03      CR-18V0 REDEFINES CORRECTMI-A.
009400         04 CORRECTMI-18V0                     PIC -9(18).
009500         04 FILLER                           PIC X.
009600     03 FILLER PIC X(2) VALUE SPACE.
009700     03 FILLER                           PIC X(48) VALUE SPACE.
009800 01  TEST-CORRECT-MAX.
009900     02 FILLER PIC X(30) VALUE SPACE.
010000     02 FILLER PIC X(17) VALUE "     MAX VALUE =".
010100     02 CORRECTMA-X.
010200     03 CORRECTMA-A                  PIC X(20) VALUE SPACE.
010300     03 CORRECT-MAX    REDEFINES CORRECTMA-A     PIC -9(9).9(9).
010400     03 CORRECTMA-0V18 REDEFINES CORRECTMA-A     PIC -.9(18).
010500     03 CORRECTMA-4V14 REDEFINES CORRECTMA-A     PIC -9(4).9(14).
010600     03 CORRECTMA-14V4 REDEFINES CORRECTMA-A     PIC -9(14).9(4).
010700     03      CR-18V0 REDEFINES CORRECTMA-A.
010800         04 CORRECTMA-18V0                     PIC -9(18).
010900         04 FILLER                           PIC X.
011000     03 FILLER PIC X(2) VALUE SPACE.
011100     03 CORMA-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011200 01  CCVS-C-1.
011300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011400-    "SS  PARAGRAPH-NAME
011500-    "       REMARKS".
011600     02 FILLER                     PIC X(20)    VALUE SPACE.
011700 01  CCVS-C-2.
011800     02 FILLER                     PIC X        VALUE SPACE.
011900     02 FILLER                     PIC X(6)     VALUE "TESTED".
012000     02 FILLER                     PIC X(15)    VALUE SPACE.
012100     02 FILLER                     PIC X(4)     VALUE "FAIL".
012200     02 FILLER                     PIC X(94)    VALUE SPACE.
012300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012400 01  REC-CT                        PIC 99       VALUE ZERO.
012500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
012900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013400 01  CCVS-H-1.
013500     02  FILLER                    PIC X(39)    VALUE SPACES.
013600     02  FILLER                    PIC X(42)    VALUE
013700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013800     02  FILLER                    PIC X(39)    VALUE SPACES.
013900 01  CCVS-H-2A.
014000   02  FILLER                        PIC X(40)  VALUE SPACE.
014100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014200   02  FILLER                        PIC XXXX   VALUE
014300     "4.2 ".
014400   02  FILLER                        PIC X(28)  VALUE
014500            " COPY - NOT FOR DISTRIBUTION".
014600   02  FILLER                        PIC X(41)  VALUE SPACE.
014700
014800 01  CCVS-H-2B.
014900   02  FILLER                        PIC X(15)  VALUE
015000            "TEST RESULT OF ".
015100   02  TEST-ID                       PIC X(9).
015200   02  FILLER                        PIC X(4)   VALUE
015300            " IN ".
015400   02  FILLER                        PIC X(12)  VALUE
015500     " HIGH       ".
015600   02  FILLER                        PIC X(22)  VALUE
015700            " LEVEL VALIDATION FOR ".
015800   02  FILLER                        PIC X(58)  VALUE
015900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016000 01  CCVS-H-3.
016100     02  FILLER                      PIC X(34)  VALUE
016200            " FOR OFFICIAL USE ONLY    ".
016300     02  FILLER                      PIC X(58)  VALUE
016400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016500     02  FILLER                      PIC X(28)  VALUE
016600            "  COPYRIGHT   1985 ".
016700 01  CCVS-E-1.
016800     02 FILLER                       PIC X(52)  VALUE SPACE.
016900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017000     02 ID-AGAIN                     PIC X(9).
017100     02 FILLER                       PIC X(45)  VALUE SPACES.
017200 01  CCVS-E-2.
017300     02  FILLER                      PIC X(31)  VALUE SPACE.
017400     02  FILLER                      PIC X(21)  VALUE SPACE.
017500     02 CCVS-E-2-2.
017600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017700         03 FILLER                   PIC X      VALUE SPACE.
017800         03 ENDER-DESC               PIC X(44)  VALUE
017900            "ERRORS ENCOUNTERED".
018000 01  CCVS-E-3.
018100     02  FILLER                      PIC X(22)  VALUE
018200            " FOR OFFICIAL USE ONLY".
018300     02  FILLER                      PIC X(12)  VALUE SPACE.
018400     02  FILLER                      PIC X(58)  VALUE
018500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018600     02  FILLER                      PIC X(13)  VALUE SPACE.
018700     02 FILLER                       PIC X(15)  VALUE
018800             " COPYRIGHT 1985".
018900 01  CCVS-E-4.
019000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019100     02 FILLER                       PIC X(4)   VALUE " OF ".
019200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019300     02 FILLER                       PIC X(40)  VALUE
019400      "  TESTS WERE EXECUTED SUCCESSFULLY".
019500 01  XXINFO.
019600     02 FILLER                       PIC X(19)  VALUE
019700            "*** INFORMATION ***".
019800     02 INFO-TEXT.
019900       04 FILLER                     PIC X(8)   VALUE SPACE.
020000       04 XXCOMPUTED                 PIC X(20).
020100       04 FILLER                     PIC X(5)   VALUE SPACE.
020200       04 XXCORRECT                  PIC X(20).
020300     02 INF-ANSI-REFERENCE           PIC X(48).
020400 01  HYPHEN-LINE.
020500     02 FILLER  PIC IS X VALUE IS SPACE.
020600     02 FILLER  PIC IS X(65)    VALUE IS "************************
020700-    "*****************************************".
020800     02 FILLER  PIC IS X(54)    VALUE IS "************************
020900-    "******************************".
021000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021100     "IF133A".
021200 PROCEDURE DIVISION.
021300 CCVS1 SECTION.
021400 OPEN-FILES.
021500     OPEN     OUTPUT PRINT-FILE.
021600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021700     MOVE    SPACE TO TEST-RESULTS.
021800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
021900     GO TO CCVS1-EXIT.
022000 CLOSE-FILES.
022100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022200 TERMINATE-CCVS.
022300     STOP     RUN.
022400 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022500 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022600 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
022700 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
022800     MOVE "****TEST DELETED****" TO RE-MARK.
022900 PRINT-DETAIL.
023000     IF REC-CT NOT EQUAL TO ZERO
023100             MOVE "." TO PARDOT-X
023200             MOVE REC-CT TO DOTVALUE.
023300     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023400     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023500        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023600          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
023700     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
023800     MOVE SPACE TO CORRECT-X.
023900     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024000     MOVE     SPACE TO RE-MARK.
024100 HEAD-ROUTINE.
024200     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024300     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024400     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024500     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024600 COLUMN-NAMES-ROUTINE.
024700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025000 END-ROUTINE.
025100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025200 END-RTN-EXIT.
025300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025400 END-ROUTINE-1.
025500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025600      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
025700      ADD PASS-COUNTER TO ERROR-HOLD.
025800      MOVE PASS-COUNTER TO CCVS-E-4-1.
025900      MOVE ERROR-HOLD TO CCVS-E-4-2.
026000      MOVE CCVS-E-4 TO CCVS-E-2-2.
026100      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026200  END-ROUTINE-12.
026300      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026400     IF       ERROR-COUNTER IS EQUAL TO ZERO
026500         MOVE "NO " TO ERROR-TOTAL
026600         ELSE
026700         MOVE ERROR-COUNTER TO ERROR-TOTAL.
026800     MOVE     CCVS-E-2 TO DUMMY-RECORD.
026900     PERFORM WRITE-LINE.
027000 END-ROUTINE-13.
027100     IF DELETE-COUNTER IS EQUAL TO ZERO
027200         MOVE "NO " TO ERROR-TOTAL  ELSE
027300         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027400     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027500     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027600      IF   INSPECT-COUNTER EQUAL TO ZERO
027700          MOVE "NO " TO ERROR-TOTAL
027800      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
027900      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028000      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028100     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028200 WRITE-LINE.
028300     ADD 1 TO RECORD-COUNT.
028400Y    IF RECORD-COUNT GREATER 42
028500Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
028600Y        MOVE SPACE TO DUMMY-RECORD
028700Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
028800Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028900Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029000Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029100Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029200Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
029300Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029600Y        MOVE ZERO TO RECORD-COUNT.
029700     PERFORM WRT-LN.
029800 WRT-LN.
029900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030000     MOVE SPACE TO DUMMY-RECORD.
030100 BLANK-LINE-PRINT.
030200     PERFORM WRT-LN.
030300 FAIL-ROUTINE.
030400     IF     COMPUTED-X NOT EQUAL TO SPACE
030500            GO TO FAIL-ROUTINE-WRITE.
030600     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030800     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
030900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031000     MOVE   SPACES TO INF-ANSI-REFERENCE.
031100     GO TO  FAIL-ROUTINE-EX.
031200 FAIL-ROUTINE-WRITE.
031300     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE.
031400     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE
031500                              CORMA-ANSI-REFERENCE.
031600     IF CORRECT-MIN NOT EQUAL TO SPACES THEN
031700           MOVE TEST-CORRECT-MIN TO PRINT-REC PERFORM WRITE-LINE
031800           MOVE TEST-CORRECT-MAX TO PRINT-REC PERFORM WRITE-LINE
031900     ELSE
032000           MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE.
032100     PERFORM WRITE-LINE.
032200     MOVE   SPACES TO COR-ANSI-REFERENCE.
032300 FAIL-ROUTINE-EX. EXIT.
032400 BAIL-OUT.
032500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032700 BAIL-OUT-WRITE.
032800     MOVE CORRECT-A TO XXCORRECT.
032900     MOVE COMPUTED-A TO XXCOMPUTED.
033000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033200     MOVE   SPACES TO INF-ANSI-REFERENCE.
033300 BAIL-OUT-EX. EXIT.
033400 CCVS1-EXIT.
033500     EXIT.
033600********************************************************
033700*                                                      *
033800*    Intrinsic Function Tests         IF133A - REM     *
033900*                                                      *
034000********************************************************
034100 SECT-IF133A SECTION.
034200 F-REM-INFO.
034300     MOVE     "See ref. A-66 2.37" TO ANSI-REFERENCE.
034400     MOVE     "REM Function" TO FEATURE.
034500*****************TEST (a) - SIMPLE TEST*****************
034600 F-REM-01.
034700     MOVE ZERO TO WS-NUM.
034800 F-REM-TEST-01.
034900     COMPUTE WS-NUM = FUNCTION REM(0, 20).
035000     IF WS-NUM = 0 THEN
035100                    PERFORM PASS
035200     ELSE
035300                    MOVE WS-NUM TO COMPUTED-N
035400                    MOVE 0 TO CORRECT-N
035500                    PERFORM FAIL.
035600     GO TO F-REM-WRITE-01.
035700 F-REM-DELETE-01.
035800     PERFORM  DE-LETE.
035900     GO TO    F-REM-WRITE-01.
036000 F-REM-WRITE-01.
036100     MOVE "F-REM-01" TO PAR-NAME.
036200     PERFORM  PRINT-DETAIL.
036300*****************TEST (b) - SIMPLE TEST*****************
036400 F-REM-02.
036500     EVALUATE FUNCTION REM(10.674, 10.674)
036600     WHEN -0.000020 THRU 0.000020
036700                    PERFORM PASS
036800     WHEN OTHER
036900                    PERFORM FAIL.
037000     GO TO F-REM-WRITE-02.
037100 F-REM-DELETE-02.
037200     PERFORM  DE-LETE.
037300     GO TO    F-REM-WRITE-02.
037400 F-REM-WRITE-02.
037500     MOVE "F-REM-02" TO PAR-NAME.
037600     PERFORM  PRINT-DETAIL.
037700*****************TEST (c) - SIMPLE TEST*****************
037800 F-REM-03.
037900     IF (FUNCTION REM(2.5, A) >= 2.49995) AND
038000        (FUNCTION REM(2.5, A) <= 2.50005)
038100                    PERFORM PASS
038200     ELSE
038300                    PERFORM FAIL.
038400     GO TO F-REM-WRITE-03.
038500 F-REM-DELETE-03.
038600     PERFORM  DE-LETE.
038700     GO TO    F-REM-WRITE-03.
038800 F-REM-WRITE-03.
038900     MOVE "F-REM-03" TO PAR-NAME.
039000     PERFORM  PRINT-DETAIL.
039100*****************TEST (d) - SIMPLE TEST*****************
039200 F-REM-04.
039300     MOVE ZERO TO WS-NUM.
039400 F-REM-TEST-04.
039500     COMPUTE WS-NUM = FUNCTION REM(A, 2).
039600     IF WS-NUM = 1 THEN
039700                    PERFORM PASS
039800     ELSE
039900                    MOVE WS-NUM TO COMPUTED-N
040000                    MOVE 1 TO CORRECT-N
040100                    PERFORM FAIL.
040200     GO TO F-REM-WRITE-04.
040300 F-REM-DELETE-04.
040400     PERFORM  DE-LETE.
040500     GO TO    F-REM-WRITE-04.
040600 F-REM-WRITE-04.
040700     MOVE "F-REM-04" TO PAR-NAME.
040800     PERFORM  PRINT-DETAIL.
040900*****************TEST (e) - SIMPLE TEST*****************
041000 F-REM-05.
041100     MOVE ZERO TO WS-NUM.
041200 F-REM-TEST-05.
041300     COMPUTE WS-NUM = FUNCTION REM(B, A).
041400     IF (WS-NUM >= 2.35995) AND
041500        (WS-NUM <= 2.36005)
041600                    PERFORM PASS
041700     ELSE
041800                    MOVE WS-NUM TO COMPUTED-N
041900                    MOVE 2.36 TO CORRECT-N
042000                    PERFORM FAIL.
042100     GO TO F-REM-WRITE-05.
042200 F-REM-DELETE-05.
042300     PERFORM  DE-LETE.
042400     GO TO    F-REM-WRITE-05.
042500 F-REM-WRITE-05.
042600     MOVE "F-REM-05" TO PAR-NAME.
042700     PERFORM  PRINT-DETAIL.
042800*****************TEST (f) - SIMPLE TEST*****************
042900 F-REM-06.
043000     MOVE ZERO TO WS-NUM.
043100 F-REM-TEST-06.
043200     COMPUTE WS-NUM = FUNCTION REM(-11, -5).
043300     IF WS-NUM = -1    THEN
043400                    PERFORM PASS
043500     ELSE
043600                    MOVE WS-NUM TO COMPUTED-N
043700                    MOVE -1    TO CORRECT-N
043800                    PERFORM FAIL.
043900     GO TO F-REM-WRITE-06.
044000 F-REM-DELETE-06.
044100     PERFORM  DE-LETE.
044200     GO TO    F-REM-WRITE-06.
044300 F-REM-WRITE-06.
044400     MOVE "F-REM-06" TO PAR-NAME.
044500     PERFORM  PRINT-DETAIL.
044600*****************TEST (g) - SIMPLE TEST*****************
044700 F-REM-07.
044800     MOVE ZERO TO WS-NUM.
044900 F-REM-TEST-07.
045000     COMPUTE WS-NUM = FUNCTION REM(11, -5).
045100     IF WS-NUM = 1 THEN
045200                    PERFORM PASS
045300     ELSE
045400                    MOVE WS-NUM TO COMPUTED-N
045500                    MOVE 1 TO CORRECT-N
045600                    PERFORM FAIL.
045700     GO TO F-REM-WRITE-07.
045800 F-REM-DELETE-07.
045900     PERFORM  DE-LETE.
046000     GO TO    F-REM-WRITE-07.
046100 F-REM-WRITE-07.
046200     MOVE "F-REM-07" TO PAR-NAME.
046300     PERFORM  PRINT-DETAIL.
046400*****************TEST (h) - SIMPLE TEST*****************
046500 F-REM-08.
046600     MOVE ZERO TO WS-NUM.
046700 F-REM-TEST-08.
046800     COMPUTE WS-NUM = FUNCTION REM(-11, 5).
046900     IF WS-NUM = -1 THEN
047000                    PERFORM PASS
047100     ELSE
047200                    MOVE WS-NUM TO COMPUTED-N
047300                    MOVE -1 TO CORRECT-N
047400                    PERFORM FAIL.
047500     GO TO F-REM-WRITE-08.
047600 F-REM-DELETE-08.
047700     PERFORM  DE-LETE.
047800     GO TO    F-REM-WRITE-08.
047900 F-REM-WRITE-08.
048000     MOVE "F-REM-08" TO PAR-NAME.
048100     PERFORM  PRINT-DETAIL.
048200*****************TEST (a) - COMPLEX TEST****************
048300 F-REM-09.
048400     MOVE ZERO TO WS-NUM.
048500     MOVE  0.889982 TO MIN-RANGE.
048600     MOVE  0.890018 TO MAX-RANGE.
048700 F-REM-TEST-09.
048800     COMPUTE WS-NUM = FUNCTION REM(0.89, B + 1).
048900     IF (WS-NUM >= MIN-RANGE) AND
049000        (WS-NUM <= MAX-RANGE) THEN
049100                    PERFORM PASS
049200     ELSE
049300                    MOVE WS-NUM TO COMPUTED-N
049400                    MOVE MIN-RANGE TO CORRECT-MIN
049500                    MOVE MAX-RANGE TO CORRECT-MAX
049600                    PERFORM FAIL.
049700     GO TO F-REM-WRITE-09.
049800 F-REM-DELETE-09.
049900     PERFORM  DE-LETE.
050000     GO TO    F-REM-WRITE-09.
050100 F-REM-WRITE-09.
050200     MOVE "F-REM-09" TO PAR-NAME.
050300     PERFORM  PRINT-DETAIL.
050400*****************TEST (b) - COMPLEX TEST****************
050500 F-REM-10.
050600     MOVE ZERO TO WS-NUM.
050700     MOVE  0.159997 TO MIN-RANGE.
050800     MOVE  0.160003 TO MAX-RANGE.
050900 F-REM-TEST-10.
051000     COMPUTE WS-NUM = FUNCTION REM(B, C + 2.2).
051100     IF (WS-NUM >= MIN-RANGE) AND
051200        (WS-NUM <= MAX-RANGE) THEN
051300                    PERFORM PASS
051400     ELSE
051500                    MOVE WS-NUM TO COMPUTED-N
051600                    MOVE MIN-RANGE TO CORRECT-MIN
051700                    MOVE MAX-RANGE TO CORRECT-MAX
051800                    PERFORM FAIL.
051900     GO TO F-REM-WRITE-10.
052000 F-REM-DELETE-10.
052100     PERFORM  DE-LETE.
052200     GO TO    F-REM-WRITE-10.
052300 F-REM-WRITE-10.
052400     MOVE "F-REM-10" TO PAR-NAME.
052500     PERFORM  PRINT-DETAIL.
052600*****************TEST (c) - COMPLEX TEST****************
052700 F-REM-11.
052800     MOVE ZERO TO WS-NUM.
052900     MOVE -0.000020 TO MIN-RANGE.
053000     MOVE  0.000020 TO MAX-RANGE.
053100 F-REM-TEST-11.
053200     COMPUTE WS-NUM = FUNCTION REM(3 / 2, .75).
053300     IF (WS-NUM >= MIN-RANGE) AND
053400        (WS-NUM <= MAX-RANGE) THEN
053500                    PERFORM PASS
053600     ELSE
053700                    MOVE WS-NUM TO COMPUTED-N
053800                    MOVE MIN-RANGE TO CORRECT-MIN
053900                    MOVE MAX-RANGE TO CORRECT-MAX
054000                    PERFORM FAIL.
054100     GO TO F-REM-WRITE-11.
054200 F-REM-DELETE-11.
054300     PERFORM  DE-LETE.
054400     GO TO    F-REM-WRITE-11.
054500 F-REM-WRITE-11.
054600     MOVE "F-REM-11" TO PAR-NAME.
054700     PERFORM  PRINT-DETAIL.
054800*****************TEST (d) - COMPLEX TEST****************
054900 F-REM-12.
055000     MOVE ZERO TO WS-NUM.
055100     MOVE  6.63987 TO MIN-RANGE.
055200     MOVE  6.64013 TO MAX-RANGE.
055300 F-REM-TEST-12.
055400     COMPUTE WS-NUM = FUNCTION REM(8 + 6, B).
055500     IF (WS-NUM >= MIN-RANGE) AND
055600        (WS-NUM <= MAX-RANGE) THEN
055700                    PERFORM PASS
055800     ELSE
055900                    MOVE WS-NUM TO COMPUTED-N
056000                    MOVE MIN-RANGE TO CORRECT-MIN
056100                    MOVE MAX-RANGE TO CORRECT-MAX
056200                    PERFORM FAIL.
056300     GO TO F-REM-WRITE-12.
056400 F-REM-DELETE-12.
056500     PERFORM  DE-LETE.
056600     GO TO    F-REM-WRITE-12.
056700 F-REM-WRITE-12.
056800     MOVE "F-REM-12" TO PAR-NAME.
056900     PERFORM  PRINT-DETAIL.
057000*****************TEST (e) - COMPLEX TEST****************
057100 F-REM-13.
057200     MOVE ZERO TO WS-NUM.
057300     MOVE -1.00002 TO MIN-RANGE.
057400     MOVE -0.999980 TO MAX-RANGE.
057500 F-REM-TEST-13.
057600     COMPUTE WS-NUM = FUNCTION REM(C + 1, 2).
057700     IF (WS-NUM >= MIN-RANGE) AND
057800        (WS-NUM <= MAX-RANGE) THEN
057900                    PERFORM PASS
058000     ELSE
058100                    MOVE WS-NUM TO COMPUTED-N
058200                    MOVE MIN-RANGE TO CORRECT-MIN
058300                    MOVE MAX-RANGE TO CORRECT-MAX
058400                    PERFORM FAIL.
058500     GO TO F-REM-WRITE-13.
058600 F-REM-DELETE-13.
058700     PERFORM  DE-LETE.
058800     GO TO    F-REM-WRITE-13.
058900 F-REM-WRITE-13.
059000     MOVE "F-REM-13" TO PAR-NAME.
059100     PERFORM  PRINT-DETAIL.
059200*****************TEST (f) - COMPLEX TEST****************
059300 F-REM-14.
059400     MOVE ZERO TO WS-NUM.
059500     MOVE  1.99996 TO MIN-RANGE.
059600     MOVE  2.00004 TO MAX-RANGE.
059700 F-REM-TEST-14.
059800     COMPUTE WS-NUM = FUNCTION REM(
059900                         FUNCTION REM(D, A), A).
060000     IF (WS-NUM >= MIN-RANGE) AND
060100        (WS-NUM <= MAX-RANGE) THEN
060200                    PERFORM PASS
060300     ELSE
060400                    MOVE WS-NUM TO COMPUTED-N
060500                    MOVE MIN-RANGE TO CORRECT-MIN
060600                    MOVE MAX-RANGE TO CORRECT-MAX
060700                    PERFORM FAIL.
060800     GO TO F-REM-WRITE-14.
060900 F-REM-DELETE-14.
061000     PERFORM  DE-LETE.
061100     GO TO    F-REM-WRITE-14.
061200 F-REM-WRITE-14.
061300     MOVE "F-REM-14" TO PAR-NAME.
061400     PERFORM  PRINT-DETAIL.
061500*****************TEST (g) - COMPLEX TEST****************
061600 F-REM-15.
061700     MOVE ZERO TO WS-NUM.
061800     MOVE -0.000020 TO MIN-RANGE.
061900     MOVE  0.000020 TO MAX-RANGE.
062000 F-REM-TEST-15.
062100     COMPUTE WS-NUM = FUNCTION REM(C,
062200                         FUNCTION REM(C, D)).
062300     IF (WS-NUM >= MIN-RANGE) AND
062400        (WS-NUM <= MAX-RANGE) THEN
062500                    PERFORM PASS
062600     ELSE
062700                    MOVE WS-NUM TO COMPUTED-N
062800                    MOVE MIN-RANGE TO CORRECT-MIN
062900                    MOVE MAX-RANGE TO CORRECT-MAX
063000                    PERFORM FAIL.
063100     GO TO F-REM-WRITE-15.
063200 F-REM-DELETE-15.
063300     PERFORM  DE-LETE.
063400     GO TO    F-REM-WRITE-15.
063500 F-REM-WRITE-15.
063600     MOVE "F-REM-15" TO PAR-NAME.
063700     PERFORM  PRINT-DETAIL.
063800*****************TEST (h) - COMPLEX TEST****************
063900 F-REM-16.
064000     MOVE ZERO TO WS-NUM.
064100     MOVE  0.999980 TO MIN-RANGE.
064200     MOVE  1.00002 TO MAX-RANGE.
064300 F-REM-TEST-16.
064400     COMPUTE WS-NUM = FUNCTION REM( FUNCTION REM(9, 5),
064500                                    FUNCTION REM(D, 4)).
064600     IF (WS-NUM >= MIN-RANGE) AND
064700        (WS-NUM <= MAX-RANGE) THEN
064800                    PERFORM PASS
064900     ELSE
065000                    MOVE WS-NUM TO COMPUTED-N
065100                    MOVE MIN-RANGE TO CORRECT-MIN
065200                    MOVE MAX-RANGE TO CORRECT-MAX
065300                    PERFORM FAIL.
065400     GO TO F-REM-WRITE-16.
065500 F-REM-DELETE-16.
065600     PERFORM  DE-LETE.
065700     GO TO    F-REM-WRITE-16.
065800 F-REM-WRITE-16.
065900     MOVE "F-REM-16" TO PAR-NAME.
066000     PERFORM  PRINT-DETAIL.
066100*****************SPECIAL PERFORM TEST**********************
066200 F-REM-17.
066300     PERFORM F-REM-TEST-17
066400       UNTIL FUNCTION REM(5, ARG2) >= 2.
066500     PERFORM PASS.
066600     GO TO F-REM-WRITE-17.
066700 F-REM-TEST-17.
066800     COMPUTE ARG2 = ARG2 + 1.
066900 F-REM-DELETE-17.
067000     PERFORM  DE-LETE.
067100     GO TO    F-REM-WRITE-17.
067200 F-REM-WRITE-17.
067300     MOVE "F-REM-17" TO PAR-NAME.
067400     PERFORM  PRINT-DETAIL.
067500********************END OF TESTS***************
067600 CCVS-EXIT SECTION.
067700 CCVS-999999.
067800     GO TO CLOSE-FILES.
