000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX102A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*         NEW TEST:
001500*                  SELECT ... ASSIGN TO <LITERAL-1> ...
001600*
001700*         NOTE: <LITERAL-1> WILL BE ASSIGNED BY THE X-CARD X-24.
001800*               X-24 SHOULD ASSIGN  A <LITERAL-1>}
001900*
002000*
002100*    THE FUNCTION OF THIS PROGRAM IS TO PROCESS AN INDEXED FILE
002200*    RANDOMLY (ACCESS MODE IS RANDOM).  THE FILE USED AS INPUT IS
002300*    THAT CREATED BY IX101.
002400*
002500*    FIRST THE FILE IS VERIFIED AS TO THE EXISTANCE AND ACCURACY
002600*    OF THE 500 RECORDS CREATED IN IX101.  SECONDLY, RECORDS
002700*    OF THE FILE ARE SELECTIVELY UPDATED; AND THIRDLY, THE
002800*    ACCURACY OF EACH RECORD IN THE FILE IS AGAIN VERIFIED.
002900*
003000*
003100*       X-CARDS  WHICH MUST BE REPLACED FOR THIS PROGRAM ARE
003200*
003300*             X-24   INDEXED FILE <LITERAL-1>      IN ASSGN TO
003400*                    CLAUSE FOR DATA FILE IX-FS1
003500*             X-44   INDEXED FILE IMPLEMENTOR-NAME IN ASSGN TO
003600*                    CLAUSE FOR INDEX FILE IX-FS1
003700*             X-55   IMPLEMENTOR-NAME FOR SYSTEM PRINTER
003800*             X-62   IMPLEMENTOR-NAME FOR RAW-DATA
003900*             X-82   IMPLEMENTOR-NAME FOR SOURCE-COMPUTER
004000*             X-83   IMPLEMENTOR-NAME FOR OBJECT-COMPUTER
004100*
004200*         NOTE:  X-CARDS 44 AND 62          ARE OPTIONAL
004300*               AND NEED ONLY TO BE PRESENT IF THE COMPILER RE-
004400*               QUIRES THIS CODE BE AVAILABLE FOR PROPER PROGRAM
004500*               COMPILATION AND EXECUTION. IF THE VP-ROUTINE IS
004600*               USED THE  X-CARDS MAY BE AUTOMATICALLY SELECTED
004700*               FOR INCLUSION IN THE PROGRAM BY SPECIFYING THE
004800*               APPROPRIATE LETTER IN THE "*OPT" VP-ROUTINE
004900*               CONTROL CARD. THE LETTER  CORRESPONDS TO A
005000*               CHARACTER IN POSITION 7 OF THE SOURCE LINE AND
005100*               THEY ARE AS FOLLOWS
005200*
005300*                  J  SELECTS X-CARD 44
005400*                  P  SELECTS X-CARD 62
005500*
005600******************************************************
005700 ENVIRONMENT DIVISION.
005800 CONFIGURATION SECTION.
005900 SOURCE-COMPUTER.
006000     XXXXX082.
006100 OBJECT-COMPUTER.
006200     XXXXX083.
006300 INPUT-OUTPUT SECTION.
006400 FILE-CONTROL.
006500P    SELECT RAW-DATA   ASSIGN TO
006600P    XXXXX062
006700P           ORGANIZATION IS INDEXED
006800P           ACCESS MODE IS RANDOM
006900P           RECORD KEY IS RAW-DATA-KEY.
007000     SELECT PRINT-FILE ASSIGN TO
007100     XXXXX055.
007200     SELECT   IX-FS1 ASSIGN
007300     XXXXP024
007400J    XXXXP044
007500        ACCESS MODE IS RANDOM
007600        ORGANIZATION INDEXED
007700     RECORD KEY IX-FS1-KEY.
007800 DATA DIVISION.
007900 FILE SECTION.
008000P
008100PFD  RAW-DATA.
008200P
008300P01  RAW-DATA-SATZ.
008400P    05  RAW-DATA-KEY        PIC X(6).
008500P    05  C-DATE              PIC 9(6).
008600P    05  C-TIME              PIC 9(8).
008700P    05  C-NO-OF-TESTS       PIC 99.
008800P    05  C-OK                PIC 999.
008900P    05  C-ALL               PIC 999.
009000P    05  C-FAIL              PIC 999.
009100P    05  C-DELETED           PIC 999.
009200P    05  C-INSPECT           PIC 999.
009300P    05  C-NOTE              PIC X(13).
009400P    05  C-INDENT            PIC X.
009500P    05  C-ABORT             PIC X(8).
009600 FD  PRINT-FILE.
009700 01  PRINT-REC PICTURE X(120).
009800 01  DUMMY-RECORD PICTURE X(120).
009900 FD  IX-FS1
010000C    LABEL RECORDS STANDARD
010100C    ; DATA RECORD IX-FS1R1-F-G-240
010200     BLOCK   1   RECORDS
010300     RECORD    240  CHARACTERS.
010400 01  IX-FS1R1-F-G-240.
010500     05 IX-FS1-REC-120   PIC  X(120).
010600     05 IX-FS1-REC-120-240.
010700        10 FILLER   PIC X(8).
010800        10 IX-FS1-KEY   PIC X(29).
010900        10 FILLER        PIC X(83).
011000 WORKING-STORAGE SECTION.
011100 01  WRK-CS-09V00 PIC S9(09)      USAGE COMP VALUE ZERO.
011200 01  WRK-DS-09V00-002 PIC S9(9) VALUE ZERO.
011300 01  WRK-CS-09V00-002 PIC S9(09)       USAGE COMP VALUE ZERO.
011400 01  I-O-ERROR-IX-FS1 PIC X(3) VALUE "NO ".
011500 01  WRK-CS-09V00-001 PIC S9(09)       USAGE COMP VALUE ZERO.
011600 01  WRK-CS-09V00-004 PIC S9(09)       USAGE COMP VALUE ZERO.
011700 01  WRK-CS-09V00-005 PIC S9(09)       USAGE COMP VALUE ZERO.
011800 01  IX-WRK-KEY.
011900     02 FILLER   PIC  X(10)  VALUE "ABCDLKJXYZ".
012000     02  WRK-DU-09V00-001 PIC 9(9) VALUE ZERO.
012100     02 FILLER   PIC  X(10)  VALUE "ZIF,.$-+CD".
012200 01  DUMMY-WRK-REC.
012300     02 DUMMY-WRK1       PIC X(120).
012400     02 DUMMY-WRK2  REDEFINES  DUMMY-WRK1.
012500        03 FILLER   PIC X(5).
012600        03 DUMMY-WRK-INDENT-5  PIC X(115).
012700 01  FILE-RECORD-INFORMATION-REC.
012800     03 FILE-RECORD-INFO-SKELETON.
012900        05 FILLER                 PICTURE X(48)       VALUE
013000             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
013100        05 FILLER                 PICTURE X(46)       VALUE
013200             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
013300        05 FILLER                 PICTURE X(26)       VALUE
013400             ",LFIL=000000,ORG=  ,LBLR= ".
013500        05 FILLER                 PICTURE X(37)       VALUE
013600             ",RECKEY=                             ".
013700        05 FILLER                 PICTURE X(38)       VALUE
013800             ",ALTKEY1=                             ".
013900        05 FILLER                 PICTURE X(38)       VALUE
014000             ",ALTKEY2=                             ".
014100        05 FILLER                 PICTURE X(7)        VALUE SPACE.
014200     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
014300        05 FILE-RECORD-INFO-P1-120.
014400           07 FILLER              PIC X(5).
014500           07 XFILE-NAME           PIC X(6).
014600           07 FILLER              PIC X(8).
014700           07 XRECORD-NAME         PIC X(6).
014800           07 FILLER              PIC X(1).
014900           07 REELUNIT-NUMBER     PIC 9(1).
015000           07 FILLER              PIC X(7).
015100           07 XRECORD-NUMBER       PIC 9(6).
015200           07 FILLER              PIC X(6).
015300           07 UPDATE-NUMBER       PIC 9(2).
015400           07 FILLER              PIC X(5).
015500           07 ODO-NUMBER          PIC 9(4).
015600           07 FILLER              PIC X(5).
015700           07 XPROGRAM-NAME        PIC X(5).
015800           07 FILLER              PIC X(7).
015900           07 XRECORD-LENGTH       PIC 9(6).
016000           07 FILLER              PIC X(7).
016100           07 CHARS-OR-RECORDS    PIC X(2).
016200           07 FILLER              PIC X(1).
016300           07 XBLOCK-SIZE          PIC 9(4).
016400           07 FILLER              PIC X(6).
016500           07 RECORDS-IN-FILE     PIC 9(6).
016600           07 FILLER              PIC X(5).
016700           07 XFILE-ORGANIZATION   PIC X(2).
016800           07 FILLER              PIC X(6).
016900           07 XLABEL-TYPE          PIC X(1).
017000        05 FILE-RECORD-INFO-P121-240.
017100           07 FILLER              PIC X(8).
017200           07 XRECORD-KEY          PIC X(29).
017300           07 FILLER              PIC X(9).
017400           07 ALTERNATE-KEY1      PIC X(29).
017500           07 FILLER              PIC X(9).
017600           07 ALTERNATE-KEY2      PIC X(29).
017700           07 FILLER              PIC X(7).
017800 01  TEST-RESULTS.
017900     02 FILLER                   PIC X      VALUE SPACE.
018000     02 FEATURE                  PIC X(20)  VALUE SPACE.
018100     02 FILLER                   PIC X      VALUE SPACE.
018200     02 P-OR-F                   PIC X(5)   VALUE SPACE.
018300     02 FILLER                   PIC X      VALUE SPACE.
018400     02  PAR-NAME.
018500       03 FILLER                 PIC X(19)  VALUE SPACE.
018600       03  PARDOT-X              PIC X      VALUE SPACE.
018700       03 DOTVALUE               PIC 99     VALUE ZERO.
018800     02 FILLER                   PIC X(8)   VALUE SPACE.
018900     02 RE-MARK                  PIC X(61).
019000 01  TEST-COMPUTED.
019100     02 FILLER                   PIC X(30)  VALUE SPACE.
019200     02 FILLER                   PIC X(17)  VALUE
019300            "       COMPUTED=".
019400     02 COMPUTED-X.
019500     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
019600     03 COMPUTED-N               REDEFINES COMPUTED-A
019700                                 PIC -9(9).9(9).
019800     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
019900     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
020000     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
020100     03       CM-18V0 REDEFINES COMPUTED-A.
020200         04 COMPUTED-18V0                    PIC -9(18).
020300         04 FILLER                           PIC X.
020400     03 FILLER PIC X(50) VALUE SPACE.
020500 01  TEST-CORRECT.
020600     02 FILLER PIC X(30) VALUE SPACE.
020700     02 FILLER PIC X(17) VALUE "       CORRECT =".
020800     02 CORRECT-X.
020900     03 CORRECT-A                  PIC X(20) VALUE SPACE.
021000     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
021100     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
021200     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
021300     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
021400     03      CR-18V0 REDEFINES CORRECT-A.
021500         04 CORRECT-18V0                     PIC -9(18).
021600         04 FILLER                           PIC X.
021700     03 FILLER PIC X(2) VALUE SPACE.
021800     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021900 01  CCVS-C-1.
022000     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
022100-    "SS  PARAGRAPH-NAME
022200-    "       REMARKS".
022300     02 FILLER                     PIC X(20)    VALUE SPACE.
022400 01  CCVS-C-2.
022500     02 FILLER                     PIC X        VALUE SPACE.
022600     02 FILLER                     PIC X(6)     VALUE "TESTED".
022700     02 FILLER                     PIC X(15)    VALUE SPACE.
022800     02 FILLER                     PIC X(4)     VALUE "FAIL".
022900     02 FILLER                     PIC X(94)    VALUE SPACE.
023000 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
023100 01  REC-CT                        PIC 99       VALUE ZERO.
023200 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
023300 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
023400 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
023500 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
023600 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
023700 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
023800 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
023900 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
024000 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
024100 01  CCVS-H-1.
024200     02  FILLER                    PIC X(39)    VALUE SPACES.
024300     02  FILLER                    PIC X(42)    VALUE
024400     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024500     02  FILLER                    PIC X(39)    VALUE SPACES.
024600 01  CCVS-H-2A.
024700   02  FILLER                        PIC X(40)  VALUE SPACE.
024800   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
024900   02  FILLER                        PIC XXXX   VALUE
025000     "4.2 ".
025100   02  FILLER                        PIC X(28)  VALUE
025200            " COPY - NOT FOR DISTRIBUTION".
025300   02  FILLER                        PIC X(41)  VALUE SPACE.
025400
025500 01  CCVS-H-2B.
025600   02  FILLER                        PIC X(15)  VALUE
025700            "TEST RESULT OF ".
025800   02  TEST-ID                       PIC X(9).
025900   02  FILLER                        PIC X(4)   VALUE
026000            " IN ".
026100   02  FILLER                        PIC X(12)  VALUE
026200     " HIGH       ".
026300   02  FILLER                        PIC X(22)  VALUE
026400            " LEVEL VALIDATION FOR ".
026500   02  FILLER                        PIC X(58)  VALUE
026600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026700 01  CCVS-H-3.
026800     02  FILLER                      PIC X(34)  VALUE
026900            " FOR OFFICIAL USE ONLY    ".
027000     02  FILLER                      PIC X(58)  VALUE
027100     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
027200     02  FILLER                      PIC X(28)  VALUE
027300            "  COPYRIGHT   1985 ".
027400 01  CCVS-E-1.
027500     02 FILLER                       PIC X(52)  VALUE SPACE.
027600     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027700     02 ID-AGAIN                     PIC X(9).
027800     02 FILLER                       PIC X(45)  VALUE SPACES.
027900 01  CCVS-E-2.
028000     02  FILLER                      PIC X(31)  VALUE SPACE.
028100     02  FILLER                      PIC X(21)  VALUE SPACE.
028200     02 CCVS-E-2-2.
028300         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
028400         03 FILLER                   PIC X      VALUE SPACE.
028500         03 ENDER-DESC               PIC X(44)  VALUE
028600            "ERRORS ENCOUNTERED".
028700 01  CCVS-E-3.
028800     02  FILLER                      PIC X(22)  VALUE
028900            " FOR OFFICIAL USE ONLY".
029000     02  FILLER                      PIC X(12)  VALUE SPACE.
029100     02  FILLER                      PIC X(58)  VALUE
029200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029300     02  FILLER                      PIC X(13)  VALUE SPACE.
029400     02 FILLER                       PIC X(15)  VALUE
029500             " COPYRIGHT 1985".
029600 01  CCVS-E-4.
029700     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
029800     02 FILLER                       PIC X(4)   VALUE " OF ".
029900     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
030000     02 FILLER                       PIC X(40)  VALUE
030100      "  TESTS WERE EXECUTED SUCCESSFULLY".
030200 01  XXINFO.
030300     02 FILLER                       PIC X(19)  VALUE
030400            "*** INFORMATION ***".
030500     02 INFO-TEXT.
030600       04 FILLER                     PIC X(8)   VALUE SPACE.
030700       04 XXCOMPUTED                 PIC X(20).
030800       04 FILLER                     PIC X(5)   VALUE SPACE.
030900       04 XXCORRECT                  PIC X(20).
031000     02 INF-ANSI-REFERENCE           PIC X(48).
031100 01  HYPHEN-LINE.
031200     02 FILLER  PIC IS X VALUE IS SPACE.
031300     02 FILLER  PIC IS X(65)    VALUE IS "************************
031400-    "*****************************************".
031500     02 FILLER  PIC IS X(54)    VALUE IS "************************
031600-    "******************************".
031700 01  CCVS-PGM-ID                     PIC X(9)   VALUE
031800     "IX102A".
031900 PROCEDURE DIVISION.
032000 CCVS1 SECTION.
032100 OPEN-FILES.
032200P    OPEN I-O RAW-DATA.
032300P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
032400P    READ RAW-DATA INVALID KEY GO TO END-E-1.
032500P    MOVE "ABORTED " TO C-ABORT.
032600P    ADD 1 TO C-NO-OF-TESTS.
032700P    ACCEPT C-DATE  FROM DATE.
032800P    ACCEPT C-TIME  FROM TIME.
032900P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
033000PEND-E-1.
033100P    CLOSE RAW-DATA.
033200     OPEN    OUTPUT PRINT-FILE.
033300     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
033400     MOVE    SPACE TO TEST-RESULTS.
033500     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
033600     MOVE    ZERO TO REC-SKL-SUB.
033700     PERFORM CCVS-INIT-FILE 9 TIMES.
033800 CCVS-INIT-FILE.
033900     ADD     1 TO REC-SKL-SUB.
034000     MOVE    FILE-RECORD-INFO-SKELETON
034100          TO FILE-RECORD-INFO (REC-SKL-SUB).
034200 CCVS-INIT-EXIT.
034300     GO TO CCVS1-EXIT.
034400 CLOSE-FILES.
034500P    OPEN I-O RAW-DATA.
034600P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
034700P    READ RAW-DATA INVALID KEY GO TO END-E-2.
034800P    MOVE "OK.     " TO C-ABORT.
034900P    MOVE PASS-COUNTER TO C-OK.
035000P    MOVE ERROR-HOLD   TO C-ALL.
035100P    MOVE ERROR-COUNTER TO C-FAIL.
035200P    MOVE DELETE-COUNTER TO C-DELETED.
035300P    MOVE INSPECT-COUNTER TO C-INSPECT.
035400P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
035500PEND-E-2.
035600P    CLOSE RAW-DATA.
035700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
035800 TERMINATE-CCVS.
035900S    EXIT PROGRAM.
036000STERMINATE-CALL.
036100     STOP     RUN.
036200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
036300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
036400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
036500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
036600     MOVE "****TEST DELETED****" TO RE-MARK.
036700 PRINT-DETAIL.
036800     IF REC-CT NOT EQUAL TO ZERO
036900             MOVE "." TO PARDOT-X
037000             MOVE REC-CT TO DOTVALUE.
037100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
037200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
037300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
037400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
037500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
037600     MOVE SPACE TO CORRECT-X.
037700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
037800     MOVE     SPACE TO RE-MARK.
037900 HEAD-ROUTINE.
038000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
038300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
038400 COLUMN-NAMES-ROUTINE.
038500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
038800 END-ROUTINE.
038900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
039000 END-RTN-EXIT.
039100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039200 END-ROUTINE-1.
039300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
039400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
039500      ADD PASS-COUNTER TO ERROR-HOLD.
039600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
039700      MOVE PASS-COUNTER TO CCVS-E-4-1.
039800      MOVE ERROR-HOLD TO CCVS-E-4-2.
039900      MOVE CCVS-E-4 TO CCVS-E-2-2.
040000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
040100  END-ROUTINE-12.
040200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
040300     IF       ERROR-COUNTER IS EQUAL TO ZERO
040400         MOVE "NO " TO ERROR-TOTAL
040500         ELSE
040600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
040700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
040800     PERFORM WRITE-LINE.
040900 END-ROUTINE-13.
041000     IF DELETE-COUNTER IS EQUAL TO ZERO
041100         MOVE "NO " TO ERROR-TOTAL  ELSE
041200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
041300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
041400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041500      IF   INSPECT-COUNTER EQUAL TO ZERO
041600          MOVE "NO " TO ERROR-TOTAL
041700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
041800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
041900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
042000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
042100 WRITE-LINE.
042200     ADD 1 TO RECORD-COUNT.
042300Y    IF RECORD-COUNT GREATER 42
042400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
042500Y        MOVE SPACE TO DUMMY-RECORD
042600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
042700Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
042800Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
042900Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
043000Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
043100Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
043200Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
043300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
043400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
043500Y        MOVE ZERO TO RECORD-COUNT.
043600     PERFORM WRT-LN.
043700 WRT-LN.
043800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
043900     MOVE SPACE TO DUMMY-RECORD.
044000 BLANK-LINE-PRINT.
044100     PERFORM WRT-LN.
044200 FAIL-ROUTINE.
044300     IF     COMPUTED-X NOT EQUAL TO SPACE
044400            GO TO   FAIL-ROUTINE-WRITE.
044500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
044600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
044700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
044800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044900     MOVE   SPACES TO INF-ANSI-REFERENCE.
045000     GO TO  FAIL-ROUTINE-EX.
045100 FAIL-ROUTINE-WRITE.
045200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
045300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
045400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
045500     MOVE   SPACES TO COR-ANSI-REFERENCE.
045600 FAIL-ROUTINE-EX. EXIT.
045700 BAIL-OUT.
045800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
045900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
046000 BAIL-OUT-WRITE.
046100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
046200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046400     MOVE   SPACES TO INF-ANSI-REFERENCE.
046500 BAIL-OUT-EX. EXIT.
046600 CCVS1-EXIT.
046700     EXIT.
046800 SECT-IX-02-001 SECTION.
046900 READ-INIT-F2-01.
047000*
047100*  TEST   1
047200*
047300     OPEN     INPUT  IX-FS1.
047400     MOVE     "READ-TEST-F2-01" TO PAR-NAME.
047500     MOVE    ZERO TO WRK-DU-09V00-001.
047600     MOVE    IX-WRK-KEY  TO IX-FS1-KEY.
047700     MOVE     ZERO TO   WRK-CS-09V00-002
047800     MOVE     ZERO  TO  WRK-DU-09V00-001
047900     MOVE    "READ ... INVALID"  TO FEATURE.
048000 READ-TEST-F2-01.
048100     ADD      1 TO WRK-DU-09V00-001
048200     MOVE      IX-WRK-KEY TO IX-FS1-KEY.
048300     IF     WRK-DU-09V00-001  GREATER  501
048400              MOVE "INVALID KEY NOT TAKEN" TO COMPUTED-A
048500             MOVE    WRK-DU-09V00-001  TO CORRECT-18V0
048600              PERFORM FAIL
048700              PERFORM PRINT-DETAIL
048800              GO TO READ-WRITE-F2-01.
048900     READ     IX-FS1
049000             INVALID KEY GO TO READ-WRITE-F2-01.
049100     MOVE     IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
049200     IF      XRECORD-NUMBER (1) EQUAL TO WRK-DU-09V00-001
049300              GO TO READ-TEST-F2-01.
049400     MOVE    "YES" TO I-O-ERROR-IX-FS1.
049500     ADD      1 TO WRK-CS-09V00-002
049600     GO TO    READ-TEST-F2-01.
049700 READ-WRITE-F2-01.
049800     IF      WRK-DU-09V00-001  NOT EQUAL TO 501
049900              MOVE "WRONG KEY/NOT 500" TO CORRECT-A
050000             MOVE    WRK-DU-09V00-001  TO  COMPUTED-18V0
050100              MOVE "IX-28 4.5.2                       " TO RE-MARK
050200              PERFORM FAIL
050300              ELSE
050400              PERFORM PASS.
050500     PERFORM PRINT-DETAIL.
050600 READ-TEST-F2-02.
050700     MOVE     "READ-TEST-F2-02" TO PAR-NAME.
050800     MOVE    "READ ... INVALID"  TO FEATURE.
050900*
051000*  TEST   2
051100*
051200     IF       XRECORD-NUMBER (1) NOT EQUAL TO 500
051300              MOVE "WRONG RECORD/NOT 500" TO CORRECT-A
051400              MOVE  XRECORD-NUMBER (1) TO COMPUTED-18V0
051500              MOVE "IX-28 4.5.2                       " TO RE-MARK
051600              PERFORM FAIL
051700              ELSE
051800              PERFORM PASS.
051900     PERFORM PRINT-DETAIL.
052000 READ-TEST-F2-03.
052100     MOVE     "READ-TEST-F2-03" TO PAR-NAME.
052200     MOVE    "READ ... INVALID"  TO FEATURE.
052300*
052400*  TEST   3
052500*
052600     IF      WRK-DU-09V00-001 NOT EQUAL TO 501
052700              MOVE "INCORRECT RECORD COUNT" TO RE-MARK
052800              MOVE  WRK-DU-09V00-001 TO COMPUTED-18V0
052900             MOVE 501  TO CORRECT-18V0
053000              MOVE "IX-28 4.5.2                       " TO RE-MARK
053100              PERFORM FAIL
053200              ELSE
053300              PERFORM PASS.
053400     PERFORM PRINT-DETAIL.
053500 READ-TEST-F2-04.
053600     MOVE     "READ-TEST-F2-04" TO PAR-NAME.
053700     MOVE    "READ ... INVALID"  TO FEATURE.
053800*
053900*  TEST   4
054000*
054100     IF       I-O-ERROR-IX-FS1 EQUAL TO "YES"
054200              MOVE WRK-CS-09V00-002 TO COMPUTED-18V0
054300              MOVE "RECORDS DID NOT COMPARE" TO RE-MARK
054400              MOVE "IX-28 4.5.2                       " TO RE-MARK
054500              PERFORM FAIL
054600              ELSE
054700              PERFORM PASS.
054800     PERFORM PRINT-DETAIL.
054900     CLOSE    IX-FS1.
055000 REWRITE-INIT-F2-01.
055100     MOVE     "REWRITE-TEST-F2-01" TO PAR-NAME.
055200     OPEN I-O IX-FS1.
055300     MOVE     ZERO TO IX-FS1-KEY.
055400     MOVE     ZERO TO WRK-CS-09V00-002.
055500     MOVE     ZERO TO WRK-DU-09V00-001.
055600     MOVE    "REWRITE ... INVALID"   TO FEATURE.
055700     MOVE     SPACE TO  FILE-RECORD-INFO (1).
055800 REWRITE-TEST-F2-01.
055900*
056000*  REWRITE TEST  1
056100*
056200     ADD      5 TO  WRK-DU-09V00-001.
056300     MOVE    IX-WRK-KEY TO IX-FS1-KEY.
056400     IF    WRK-DU-09V00-001  GREATER 505
056500              MOVE "INVALID KEY/NOT TAKEN" TO COMPUTED-A
056600             MOVE    WRK-DU-09V00-001  TO CORRECT-18V0
056700              PERFORM FAIL
056800              PERFORM PRINT-DETAIL
056900              GO TO REWRITE-TEST-F2-01-3.
057000     READ     IX-FS1
057100              INVALID KEY GO TO REWRITE-TEST-F2-01-1.
057200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1)
057300     ADD      01 TO UPDATE-NUMBER (1).
057400     MOVE  CCVS-PGM-ID  TO XPROGRAM-NAME (1).
057500     MOVE     FILE-RECORD-INFO (1) TO IX-FS1R1-F-G-240.
057600     REWRITE    IX-FS1R1-F-G-240
057700              INVALID KEY GO TO REWRITE-TEST-F2-01-2.
057800     GO TO    REWRITE-TEST-F2-01.
057900 REWRITE-TEST-F2-01-1.
058000     IF      WRK-DU-09V00-001  LESS THAN 501
058100              ADD 1 TO  WRK-CS-09V00-004
058200              GO TO REWRITE-TEST-F2-01.
058300     PERFORM   PASS.
058400     PERFORM    PRINT-DETAIL.
058500 REWRITE-TEST-F2-02.
058600     MOVE     "REWRITE-TEST-F2-02" TO PAR-NAME.
058700     MOVE    "REWRITE ... INVALID"   TO FEATURE.
058800*
058900*  REWRITE TEST  2
059000*
059100     GO TO    REWRITE-TEST-F2-01-3.
059200 REWRITE-TEST-F2-01-2.
059300     ADD      1 TO WRK-CS-09V00-005.
059400     IF      WRK-DU-09V00-001  LESS THAN 501
059500              GO TO REWRITE-TEST-F2-01.
059600 REWRITE-TEST-F2-01-3.
059700     IF       WRK-CS-09V00-004 NOT EQUAL TO ZERO
059800              MOVE "INVALID KEY ON READ" TO COMPUTED-A
059900              MOVE WRK-CS-09V00-004 TO CORRECT-18V0
060000              MOVE "IX-28 4.5.2                       " TO RE-MARK
060100              PERFORM FAIL
060200              ELSE
060300              PERFORM PASS.
060400     PERFORM PRINT-DETAIL.
060500 REWRITE-TEST-F2-03.
060600     MOVE     "REWRITE-TEST-F2-03" TO PAR-NAME.
060700     MOVE    "REWRITE ... INVALID"   TO FEATURE.
060800*
060900*  REWRITE TEST  3
061000*
061100     IF       WRK-CS-09V00-005 NOT EQUAL TO ZERO
061200              MOVE "INVALID KEY ON REWRITE" TO COMPUTED-A
061300              MOVE  WRK-CS-09V00-005 TO CORRECT-18V0
061400              MOVE "IX-28 4.5.2                       " TO RE-MARK
061500              PERFORM FAIL
061600              ELSE
061700              PERFORM PASS.
061800     PERFORM PRINT-DETAIL.
061900     CLOSE    IX-FS1.
062000 READ-INIT-F2-05.
062100     MOVE     "READ-TEST-F2-05" TO PAR-NAME.
062200     OPEN     INPUT  IX-FS1.
062300     MOVE     501  TO WRK-DU-09V00-001.
062400     MOVE    ZERO TO WRK-CS-09V00-004.
062500     MOVE    ZERO TO WRK-CS-09V00-005.
062600     MOVE    ZERO TO WRK-CS-09V00-002.
062700     MOVE     SPACE TO  FILE-RECORD-INFO (1).
062800     MOVE    "READ  ... INVALID "   TO FEATURE.
062900 READ-TEST-F2-05.
063000     IF      WRK-DU-09V00-001  EQUAL TO ZERO
063100              MOVE "INVALID KEY/NOT TAKEN" TO COMPUTED-A
063200             MOVE    WRK-DU-09V00-001  TO  COMPUTED-18V0
063300             MOVE    ZERO TO CORRECT-18V0
063400              MOVE "IX-28 4.5.2                       " TO RE-MARK
063500              PERFORM FAIL
063600              PERFORM PRINT-DETAIL
063700              GO TO READ-TEST-F2-05.
063800     SUBTRACT     1  FROM WRK-DU-09V00-001.
063900     MOVE      IX-WRK-KEY TO IX-FS1-KEY.
064000     READ     IX-FS1
064100              INVALID KEY  GO TO READ-TEST-F2-05-1.
064200     MOVE     IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
064300     IF     UPDATE-NUMBER (1) EQUAL TO 00
064400              ADD 1 TO WRK-CS-09V00-004.
064500     IF     UPDATE-NUMBER (1) EQUAL TO 01
064600              ADD 1 TO WRK-CS-09V00-005.
064700     GO TO    READ-TEST-F2-05.
064800 READ-TEST-F2-05-1.
064900     IF      WRK-DU-09V00-001  GREATER ZERO
065000             ADD 1 TO WRK-CS-09V00-002
065100              GO TO READ-TEST-F2-05.
065200     PERFORM   PASS.
065300     PERFORM   PRINT-DETAIL.
065400 READ-TEST-F2-06.
065500     MOVE     "READ-TEST-F2-06" TO PAR-NAME.
065600     MOVE    "READ ... INVALID"  TO FEATURE.
065700*
065800*  TEST   6
065900*
066000     IF       WRK-CS-09V00-004 NOT EQUAL TO 400
066100              MOVE "NON-UPDATED RECORDS" TO COMPUTED-A
066200              MOVE WRK-CS-09V00-004 TO CORRECT-18V0
066300              MOVE "SHOULD BE 400" TO RE-MARK
066400              MOVE "IX-28 4.5.2                       " TO RE-MARK
066500              PERFORM FAIL
066600              ELSE
066700              PERFORM PASS.
066800     PERFORM PRINT-DETAIL.
066900 READ-TEST-F2-07.
067000     MOVE     "READ-TEST-F2-07" TO PAR-NAME.
067100     MOVE    "READ ... INVALID"  TO FEATURE.
067200*
067300*  TEST   7
067400*
067500     IF       WRK-CS-09V00-005   NOT EQUAL TO 100
067600              MOVE "UPDATED RECORDS" TO COMPUTED-A
067700              MOVE WRK-CS-09V00-005 TO CORRECT-18V0
067800              MOVE "SHOULD BE 100" TO RE-MARK
067900              MOVE "IX-28 4.5.2                       " TO RE-MARK
068000              PERFORM FAIL
068100              ELSE
068200              PERFORM PASS.
068300     PERFORM PRINT-DETAIL.
068400 READ-TEST-F2-08.
068500     MOVE     "READ-TEST-F2-08" TO PAR-NAME.
068600     MOVE    "READ ... INVALID"  TO FEATURE.
068700*
068800*  TEST   8
068900*
069000     IF      WRK-CS-09V00-002 GREATER 1
069100             MOVE WRK-CS-09V00-002 TO COMPUTED-N
069200             MOVE  "INVALID KEY/READS" TO CORRECT-A
069300              MOVE "IX-28 4.5.2                       " TO RE-MARK
069400             PERFORM FAIL
069500              ELSE
069600              PERFORM PASS.
069700     PERFORM PRINT-DETAIL.
069800     CLOSE    IX-FS1.
069900 CCVS-EXIT SECTION.
070000 CCVS-999999.
070100     GO TO CLOSE-FILES.
