000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX109A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    1.  THE  ROUTINE  CREATES  THE  MASS  STORAGE  FILE  IX-FS3
001500*        CONTAINING  50  RECORDS. EACH BLOCK CONTAINS 2 RECORDS,
001600*        EACH  RECORD  CONTAINS  240 CHARACTERS, ORGANIZATION IS
001700*        INDEXED,  ACCESS  IS SEQUENTIAL. THIS ROUTINE CHECKS AS
001800*        MANY  FILE STATUS CODES AS POSSIBLE. HOWEVER, IT IS NOT
001900*        POSSIBLE TO CHECK ALL CODES NEITHER IN THAT PROGRAM NOR
002000*        IN THE FOLLOWING ONE.
002100*
002200*    2. THE ROUTINE READS THE CREATED FILE,VERIFIES IT AND       *
002300*       CHECKS THE FILE STATUS CODES:
002400*           00  -  AFTER OPEN OUTPUT
002500*           00  -  AFTER WRITE
002600*           21  -  AFTER WRITE  (VIOLATE ASCENDING SEQUENCE)
002700*           00  -  AFTER CLOSE OUTPUT
002800*           00  -  AFTER OPEN INPUT
002900*           00  -  AFTER READ    (WITHOUT AT END)
003000*           10  -  AFTER READ    (SEE  IX-4, 1.3.4, (2) A)
003100*           00  -  AFTER CLOSE INPUT
003200*           00  -  AFTER OPEN INPUT
003300*           00  -  AFTER READ ... END  ...
003400*           10  -  AFTER READ ... END  ...
003500*           46  -  AFTER READ ... END  ...
003600*
003700*    4. X-CARDS USED IN THIS PROGRAM:
003800*
003900*                 XXXXX024
004000*                 XXXXX055.
004100*         P       XXXXX062.
004200*                 XXXXX082.
004300*                 XXXXX083.
004400*         C       XXXXX084
004500*
004600*
004700 ENVIRONMENT DIVISION.
004800 CONFIGURATION SECTION.
004900 SOURCE-COMPUTER.
005000     XXXXX082.
005100 OBJECT-COMPUTER.
005200     XXXXX083.
005300 INPUT-OUTPUT SECTION.
005400 FILE-CONTROL.
005500P    SELECT RAW-DATA   ASSIGN TO
005600P    XXXXX062
005700P           ORGANIZATION IS INDEXED
005800P           ACCESS MODE IS RANDOM
005900P           RECORD KEY IS RAW-DATA-KEY.
006000*
006100     SELECT PRINT-FILE ASSIGN TO
006200     XXXXX055.
006300*
006400     SELECT IX-FS3 ASSIGN
006500     XXXXX024
006600     ORGANIZATION IS INDEXED
006700     ACCESS MODE IS SEQUENTIAL
006800     RECORD KEY IS IX-FS3-KEY
006900     FILE STATUS IS IX-FS3-STATUS.
007000
007100 DATA DIVISION.
007200
007300 FILE SECTION.
007400P
007500PFD  RAW-DATA.
007600P
007700P01  RAW-DATA-SATZ.
007800P    05  RAW-DATA-KEY        PIC X(6).
007900P    05  C-DATE              PIC 9(6).
008000P    05  C-TIME              PIC 9(8).
008100P    05  C-NO-OF-TESTS       PIC 99.
008200P    05  C-OK                PIC 999.
008300P    05  C-ALL               PIC 999.
008400P    05  C-FAIL              PIC 999.
008500P    05  C-DELETED           PIC 999.
008600P    05  C-INSPECT           PIC 999.
008700P    05  C-NOTE              PIC X(13).
008800P    05  C-INDENT            PIC X.
008900P    05  C-ABORT             PIC X(8).
009000
009100 FD  PRINT-FILE.
009200
009300 01  PRINT-REC               PIC X(120).
009400
009500 01  DUMMY-RECORD            PIC X(120).
009600
009700 FD  IX-FS3
009800C       DATA RECORDS IX-FS3R1-F-G-240
009900C       LABEL RECORD STANDARD
010000        RECORD 240
010100        BLOCK CONTAINS 2 RECORDS.
010200
010300 01  IX-FS3R1-F-G-240.
010400     05  IX-FS3-REC-120      PIC X(120).
010500     05  IX-FS3-REC-120-240.
010600         10  FILLER          PIC X(8).
010700         10  IX-FS3-KEY      PIC X(29).
010800         10  FILLER          PIC X(9).
010900         10  IX-FS3-ALTER-KEY  PIC X(29).
011000         10  FILLER            PIC X(45).
011100
011200
011300 WORKING-STORAGE SECTION.
011400
011500 01  GRP-0101.
011600     05  FILLER              PIC X(10) VALUE "RECORD-KEY".
011700     05  GRP-0101-KEY        PIC 9(9)  VALUE ZERO.
011800     05  FILLER              PIC X(10) VALUE "END-OF-KEY".
011900
012000 01  GRP-0102.
012100     05  FILLER              PIC X(10) VALUE "ALTERN-KEY".
012200     05  GRP-0102-KEY        PIC 9(9)  VALUE ZERO.
012300     05  FILLER              PIC X(10) VALUE "END-AL-KEY".
012400
012500 01  WRK-CS-09V00            PIC S9(9) COMP VALUE ZERO.
012600
012700 01  EOF-FLAG                PIC 9 VALUE ZERO.
012800
012900 01  RECORDS-IN-ERROR        PIC S9(5) COMP VALUE ZERO.
013000
013100 01  ERROR-FLAG              PIC 9 VALUE ZERO.
013200
013300 01  PERM-ERRORS             PIC S9(5) COMP VALUE ZERO.
013400
013500 01  STATUS-TEST-00          PIC 9 VALUE ZERO.
013600
013700 01  STATUS-TEST-10          PIC 9 VALUE ZERO.
013800 01  STATUS-TEST-READ        PIC 9 VALUE ZERO.
013900
014000 01  IX-FS3-STATUS.
014100     05  IX-FS3-STAT1        PIC X.
014200     05  IX-FS3-STAT2        PIC X.
014300
014400 01  COUNT-OF-RECS           PIC 9(5).
014500
014600 01  COUNT-OF-RECORDS REDEFINES COUNT-OF-RECS  PIC 9(5).
014700
014800 01  FILE-RECORD-INFORMATION-REC.
014900     05  FILE-RECORD-INFO-SKELETON.
015000         10  FILLER          PIC X(48) VALUE
015100              "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
015200         10  FILLER          PIC X(46) VALUE
015300                ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
015400         10  FILLER          PIC X(26) VALUE
015500                                    ",LFIL=000000,ORG=  ,LBLR= ".
015600         10  FILLER          PIC X(37) VALUE
015700                         ",RECKEY=                             ".
015800         10  FILLER          PIC X(38) VALUE
015900                        ",ALTKEY1=                             ".
016000         10  FILLER          PIC X(38) VALUE
016100                        ",ALTKEY2=                             ".
016200         10  FILLER          PIC X(7) VALUE SPACE.
016300     05  FILE-RECORD-INFO             OCCURS 10.
016400         10  FILE-RECORD-INFO-P1-120.
016500             15  FILLER      PIC X(5).
016600             15  XFILE-NAME  PIC X(6).
016700             15  FILLER      PIC X(8).
016800             15  XRECORD-NAME  PIC X(6).
016900             15  FILLER        PIC X(1).
017000             15  REELUNIT-NUMBER  PIC 9(1).
017100             15  FILLER           PIC X(7).
017200             15  XRECORD-NUMBER   PIC 9(6).
017300             15  FILLER           PIC X(6).
017400             15  UPDATE-NUMBER    PIC 9(2).
017500             15  FILLER           PIC X(5).
017600             15  ODO-NUMBER       PIC 9(4).
017700             15  FILLER           PIC X(5).
017800             15  XPROGRAM-NAME    PIC X(5).
017900             15  FILLER           PIC X(7).
018000             15  XRECORD-LENGTH   PIC 9(6).
018100             15  FILLER           PIC X(7).
018200             15  CHARS-OR-RECORDS  PIC X(2).
018300             15  FILLER            PIC X(1).
018400             15  XBLOCK-SIZE       PIC 9(4).
018500             15  FILLER            PIC X(6).
018600             15  RECORDS-IN-FILE   PIC 9(6).
018700             15  FILLER            PIC X(5).
018800             15  XFILE-ORGANIZATION  PIC X(2).
018900             15  FILLER              PIC X(6).
019000             15  XLABEL-TYPE         PIC X(1).
019100         10  FILE-RECORD-INFO-P121-240.
019200             15  FILLER              PIC X(8).
019300             15  XRECORD-KEY         PIC X(29).
019400             15  FILLER              PIC X(9).
019500             15  ALTERNATE-KEY1      PIC X(29).
019600             15  FILLER              PIC X(9).
019700             15  ALTERNATE-KEY2      PIC X(29).
019800             15  FILLER              PIC X(7).
019900
020000 01  TEST-RESULTS.
020100     02 FILLER                   PIC X      VALUE SPACE.
020200     02 FEATURE                  PIC X(20)  VALUE SPACE.
020300     02 FILLER                   PIC X      VALUE SPACE.
020400     02 P-OR-F                   PIC X(5)   VALUE SPACE.
020500     02 FILLER                   PIC X      VALUE SPACE.
020600     02  PAR-NAME.
020700       03 FILLER                 PIC X(19)  VALUE SPACE.
020800       03  PARDOT-X              PIC X      VALUE SPACE.
020900       03 DOTVALUE               PIC 99     VALUE ZERO.
021000     02 FILLER                   PIC X(8)   VALUE SPACE.
021100     02 RE-MARK                  PIC X(61).
021200 01  TEST-COMPUTED.
021300     02 FILLER                   PIC X(30)  VALUE SPACE.
021400     02 FILLER                   PIC X(17)  VALUE
021500            "       COMPUTED=".
021600     02 COMPUTED-X.
021700     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
021800     03 COMPUTED-N               REDEFINES COMPUTED-A
021900                                 PIC -9(9).9(9).
022000     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
022100     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
022200     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
022300     03       CM-18V0 REDEFINES COMPUTED-A.
022400         04 COMPUTED-18V0                    PIC -9(18).
022500         04 FILLER                           PIC X.
022600     03 FILLER PIC X(50) VALUE SPACE.
022700 01  TEST-CORRECT.
022800     02 FILLER PIC X(30) VALUE SPACE.
022900     02 FILLER PIC X(17) VALUE "       CORRECT =".
023000     02 CORRECT-X.
023100     03 CORRECT-A                  PIC X(20) VALUE SPACE.
023200     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
023300     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
023400     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
023500     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
023600     03      CR-18V0 REDEFINES CORRECT-A.
023700         04 CORRECT-18V0                     PIC -9(18).
023800         04 FILLER                           PIC X.
023900     03 FILLER PIC X(2) VALUE SPACE.
024000     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
024100 01  CCVS-C-1.
024200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
024300-    "SS  PARAGRAPH-NAME
024400-    "       REMARKS".
024500     02 FILLER                     PIC X(20)    VALUE SPACE.
024600 01  CCVS-C-2.
024700     02 FILLER                     PIC X        VALUE SPACE.
024800     02 FILLER                     PIC X(6)     VALUE "TESTED".
024900     02 FILLER                     PIC X(15)    VALUE SPACE.
025000     02 FILLER                     PIC X(4)     VALUE "FAIL".
025100     02 FILLER                     PIC X(94)    VALUE SPACE.
025200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
025300 01  REC-CT                        PIC 99       VALUE ZERO.
025400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
025500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
025600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
025700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
025800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
025900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
026000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
026100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
026200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
026300 01  CCVS-H-1.
026400     02  FILLER                    PIC X(39)    VALUE SPACES.
026500     02  FILLER                    PIC X(42)    VALUE
026600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
026700     02  FILLER                    PIC X(39)    VALUE SPACES.
026800 01  CCVS-H-2A.
026900   02  FILLER                        PIC X(40)  VALUE SPACE.
027000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
027100   02  FILLER                        PIC XXXX   VALUE
027200     "4.2 ".
027300   02  FILLER                        PIC X(28)  VALUE
027400            " COPY - NOT FOR DISTRIBUTION".
027500   02  FILLER                        PIC X(41)  VALUE SPACE.
027600
027700 01  CCVS-H-2B.
027800   02  FILLER                        PIC X(15)  VALUE
027900            "TEST RESULT OF ".
028000   02  TEST-ID                       PIC X(9).
028100   02  FILLER                        PIC X(4)   VALUE
028200            " IN ".
028300   02  FILLER                        PIC X(12)  VALUE
028400     " HIGH       ".
028500   02  FILLER                        PIC X(22)  VALUE
028600            " LEVEL VALIDATION FOR ".
028700   02  FILLER                        PIC X(58)  VALUE
028800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028900 01  CCVS-H-3.
029000     02  FILLER                      PIC X(34)  VALUE
029100            " FOR OFFICIAL USE ONLY    ".
029200     02  FILLER                      PIC X(58)  VALUE
029300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
029400     02  FILLER                      PIC X(28)  VALUE
029500            "  COPYRIGHT   1985 ".
029600 01  CCVS-E-1.
029700     02 FILLER                       PIC X(52)  VALUE SPACE.
029800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
029900     02 ID-AGAIN                     PIC X(9).
030000     02 FILLER                       PIC X(45)  VALUE SPACES.
030100 01  CCVS-E-2.
030200     02  FILLER                      PIC X(31)  VALUE SPACE.
030300     02  FILLER                      PIC X(21)  VALUE SPACE.
030400     02 CCVS-E-2-2.
030500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
030600         03 FILLER                   PIC X      VALUE SPACE.
030700         03 ENDER-DESC               PIC X(44)  VALUE
030800            "ERRORS ENCOUNTERED".
030900 01  CCVS-E-3.
031000     02  FILLER                      PIC X(22)  VALUE
031100            " FOR OFFICIAL USE ONLY".
031200     02  FILLER                      PIC X(12)  VALUE SPACE.
031300     02  FILLER                      PIC X(58)  VALUE
031400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
031500     02  FILLER                      PIC X(13)  VALUE SPACE.
031600     02 FILLER                       PIC X(15)  VALUE
031700             " COPYRIGHT 1985".
031800 01  CCVS-E-4.
031900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
032000     02 FILLER                       PIC X(4)   VALUE " OF ".
032100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
032200     02 FILLER                       PIC X(40)  VALUE
032300      "  TESTS WERE EXECUTED SUCCESSFULLY".
032400 01  XXINFO.
032500     02 FILLER                       PIC X(19)  VALUE
032600            "*** INFORMATION ***".
032700     02 INFO-TEXT.
032800       04 FILLER                     PIC X(8)   VALUE SPACE.
032900       04 XXCOMPUTED                 PIC X(20).
033000       04 FILLER                     PIC X(5)   VALUE SPACE.
033100       04 XXCORRECT                  PIC X(20).
033200     02 INF-ANSI-REFERENCE           PIC X(48).
033300 01  HYPHEN-LINE.
033400     02 FILLER  PIC IS X VALUE IS SPACE.
033500     02 FILLER  PIC IS X(65)    VALUE IS "************************
033600-    "*****************************************".
033700     02 FILLER  PIC IS X(54)    VALUE IS "************************
033800-    "******************************".
033900 01  TEST-NO                         PIC 99.
034000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
034100     "IX109A".
034200 PROCEDURE DIVISION.
034300 DECLARATIVES.
034400
034500 SECT-IX109-0002 SECTION.
034600     USE AFTER EXCEPTION PROCEDURE ON IX-FS3.
034700 INPUT-PROCESS.
034800     IF TEST-NO = 13
034900        GO TO D-R-TEST-F1-06-1.
035000     IF STATUS-TEST-10 EQUAL TO 1
035100        IF  IX-FS3-STAT1 EQUAL TO "1"
035200            MOVE 1 TO EOF-FLAG
035300        ELSE
035400           IF  IX-FS3-STAT1 GREATER THAN "1"
035500           MOVE 1 TO PERM-ERRORS.
035600     GO TO DECL-EXIT.
035700 D-R-TEST-F1-06-1.
035800     IF IX-FS3-STATUS EQUAL TO "46"
035900         GO TO D-R-PASS-F1-06-0.
036000 D-R-FAIL-F1-06-0.
036100     MOVE IX-FS3-STATUS TO COMPUTED-A.
036200     MOVE "46" TO CORRECT-X.
036300     MOVE "IX-5, 1.3.4, (5) E 3)" TO RE-MARK.
036400     PERFORM D-FAIL.
036500     GO TO D-R-WRITE-F1-06-0.
036600 D-R-PASS-F1-06-0.
036700     PERFORM D-PASS.
036800 D-R-WRITE-F1-06-0.
036900     MOVE "READ.        46 EXP." TO FEATURE.
037000     MOVE "REA-TEST-F1-06-0" TO PAR-NAME.
037100     PERFORM D-PRINT-DETAIL.
037200 D-CLOSE-FILES.
037300     CLOSE IX-FS3.
037400P    OPEN I-O RAW-DATA.
037500P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
037600P    READ RAW-DATA INVALID KEY GO TO D-END-E-2.
037700P    MOVE "OK.     " TO C-ABORT.
037800P    MOVE PASS-COUNTER TO C-OK.
037900P    MOVE ERROR-HOLD   TO C-ALL.
038000P    MOVE ERROR-COUNTER TO C-FAIL.
038100P    MOVE DELETE-COUNTER TO C-DELETED.
038200P    MOVE INSPECT-COUNTER TO C-INSPECT.
038300P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO D-END-E-2.
038400PD-END-E-2.
038500P    CLOSE RAW-DATA.
038600     PERFORM D-END-ROUTINE THRU D-END-ROUTINE-13.
038700     CLOSE PRINT-FILE.
038800 D-TERMINATE-CCVS.
038900S    EXIT PROGRAM.
039000SD-TERMINATE-CALL.
039100     STOP     RUN.
039200 D-PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
039300 D-FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
039400 D-PRINT-DETAIL.
039500     IF   REC-CT NOT EQUAL TO ZERO
039600          MOVE "." TO PARDOT-X
039700          MOVE REC-CT TO DOTVALUE.
039800     MOVE TEST-RESULTS TO PRINT-REC.
039900     PERFORM D-WRITE-LINE.
040000     IF   P-OR-F EQUAL TO "FAIL*"
040100          PERFORM D-WRITE-LINE
040200          PERFORM D-FAIL-ROUTINE THRU D-FAIL-ROUTINE-EX
040300     ELSE
040400          PERFORM D-BAIL-OUT THRU D-BAIL-OUT-EX.
040500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
040600     MOVE SPACE TO CORRECT-X.
040700     IF   REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
040800     MOVE SPACE TO RE-MARK.
040900 D-END-ROUTINE.
041000     MOVE HYPHEN-LINE TO DUMMY-RECORD.
041100     PERFORM D-WRITE-LINE 5 TIMES.
041200 D-END-RTN-EXIT.
041300     MOVE CCVS-E-1 TO DUMMY-RECORD.
041400     PERFORM D-WRITE-LINE 2 TIMES.
041500 D-END-ROUTINE-1.
041600     ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
041700     ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
041800     ADD PASS-COUNTER TO ERROR-HOLD.
041900     MOVE PASS-COUNTER TO CCVS-E-4-1.
042000     MOVE ERROR-HOLD TO CCVS-E-4-2.
042100     MOVE CCVS-E-4 TO CCVS-E-2-2.
042200     MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM D-WRITE-LINE.
042300  D-END-ROUTINE-12.
042400     MOVE "TEST(S) FAILED" TO ENDER-DESC.
042500     IF  ERROR-COUNTER IS EQUAL TO ZERO
042600         MOVE "NO " TO ERROR-TOTAL
042700     ELSE
042800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
042900     MOVE    CCVS-E-2 TO DUMMY-RECORD.
043000     PERFORM D-WRITE-LINE.
043100 D-END-ROUTINE-13.
043200     IF  DELETE-COUNTER IS EQUAL TO ZERO
043300         MOVE "NO " TO ERROR-TOTAL  ELSE
043400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
043500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
043600     MOVE CCVS-E-2 TO DUMMY-RECORD.
043700     PERFORM D-WRITE-LINE.
043800     IF   INSPECT-COUNTER EQUAL TO ZERO
043900          MOVE "NO " TO ERROR-TOTAL
044000     ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
044100     MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
044200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
044300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
044400 D-WRITE-LINE.
044500     ADD 1 TO RECORD-COUNT.
044600Y    IF RECORD-COUNT GREATER 42
044700Y       MOVE DUMMY-RECORD TO DUMMY-HOLD
044800Y       MOVE SPACE TO DUMMY-RECORD
044900Y       WRITE DUMMY-RECORD AFTER ADVANCING PAGE
045000Y       MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
045100Y       MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
045200Y       MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
045300Y       MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
045400Y       MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM D-WRT-LN
045500Y       MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM D-WRT-LN
045600Y       MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM D-WRT-LN
045700Y       MOVE DUMMY-HOLD TO DUMMY-RECORD
045800Y       MOVE ZERO TO RECORD-COUNT.
045900     PERFORM D-WRT-LN.
046000 D-WRT-LN.
046100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
046200     MOVE SPACE TO DUMMY-RECORD.
046300 D-FAIL-ROUTINE.
046400     IF   COMPUTED-X NOT EQUAL TO SPACE
046500          GO TO D-FAIL-ROUTINE-WRITE.
046600     IF   CORRECT-X NOT EQUAL TO SPACE GO TO D-FAIL-ROUTINE-WRITE.
046700     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046800     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
046900     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
047000     MOVE SPACES TO INF-ANSI-REFERENCE.
047100     GO TO D-FAIL-ROUTINE-EX.
047200 D-FAIL-ROUTINE-WRITE.
047300     MOVE TEST-COMPUTED TO PRINT-REC PERFORM D-WRITE-LINE
047400     MOVE ANSI-REFERENCE TO COR-ANSI-REFERENCE.
047500     MOVE TEST-CORRECT TO PRINT-REC PERFORM D-WRITE-LINE 2 TIMES.
047600     MOVE SPACES TO COR-ANSI-REFERENCE.
047700 D-FAIL-ROUTINE-EX. EXIT.
047800 D-BAIL-OUT.
047900     IF  COMPUTED-A NOT EQUAL TO SPACE GO TO D-BAIL-OUT-WRITE.
048000     IF  CORRECT-A EQUAL TO SPACE GO TO D-BAIL-OUT-EX.
048100 D-BAIL-OUT-WRITE.
048200     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
048300     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
048400     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
048500     MOVE SPACES TO INF-ANSI-REFERENCE.
048600 D-BAIL-OUT-EX. EXIT.
048700 DECL-EXIT.  EXIT.
048800 END DECLARATIVES.
048900
049000
049100 CCVS1 SECTION.
049200 OPEN-FILES.
049300P    OPEN I-O RAW-DATA.
049400P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
049500P    READ RAW-DATA INVALID KEY GO TO END-E-1.
049600P    MOVE "ABORTED " TO C-ABORT.
049700P    ADD 1 TO C-NO-OF-TESTS.
049800P    ACCEPT C-DATE  FROM DATE.
049900P    ACCEPT C-TIME  FROM TIME.
050000P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
050100PEND-E-1.
050200P    CLOSE RAW-DATA.
050300     OPEN    OUTPUT PRINT-FILE.
050400     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
050500     MOVE    SPACE TO TEST-RESULTS.
050600     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
050700     MOVE    ZERO TO REC-SKL-SUB.
050800     PERFORM CCVS-INIT-FILE 9 TIMES.
050900 CCVS-INIT-FILE.
051000     ADD     1 TO REC-SKL-SUB.
051100     MOVE    FILE-RECORD-INFO-SKELETON
051200          TO FILE-RECORD-INFO (REC-SKL-SUB).
051300 CCVS-INIT-EXIT.
051400     GO TO CCVS1-EXIT.
051500 CLOSE-FILES.
051600P    OPEN I-O RAW-DATA.
051700P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
051800P    READ RAW-DATA INVALID KEY GO TO END-E-2.
051900P    MOVE "OK.     " TO C-ABORT.
052000P    MOVE PASS-COUNTER TO C-OK.
052100P    MOVE ERROR-HOLD   TO C-ALL.
052200P    MOVE ERROR-COUNTER TO C-FAIL.
052300P    MOVE DELETE-COUNTER TO C-DELETED.
052400P    MOVE INSPECT-COUNTER TO C-INSPECT.
052500P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
052600PEND-E-2.
052700P    CLOSE RAW-DATA.
052800     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
052900 TERMINATE-CCVS.
053000S    EXIT PROGRAM.
053100STERMINATE-CALL.
053200     STOP     RUN.
053300 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
053400 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
053500 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
053600 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
053700     MOVE "****TEST DELETED****" TO RE-MARK.
053800 PRINT-DETAIL.
053900     IF REC-CT NOT EQUAL TO ZERO
054000             MOVE "." TO PARDOT-X
054100             MOVE REC-CT TO DOTVALUE.
054200     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
054300     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
054400        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
054500          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
054600     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
054700     MOVE SPACE TO CORRECT-X.
054800     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
054900     MOVE     SPACE TO RE-MARK.
055000 HEAD-ROUTINE.
055100     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055200     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055300     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
055400     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
055500 COLUMN-NAMES-ROUTINE.
055600     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055700     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
055900 END-ROUTINE.
056000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
056100 END-RTN-EXIT.
056200     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
056300 END-ROUTINE-1.
056400      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
056500      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
056600      ADD PASS-COUNTER TO ERROR-HOLD.
056700*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
056800      MOVE PASS-COUNTER TO CCVS-E-4-1.
056900      MOVE ERROR-HOLD TO CCVS-E-4-2.
057000      MOVE CCVS-E-4 TO CCVS-E-2-2.
057100      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
057200  END-ROUTINE-12.
057300      MOVE "TEST(S) FAILED" TO ENDER-DESC.
057400     IF       ERROR-COUNTER IS EQUAL TO ZERO
057500         MOVE "NO " TO ERROR-TOTAL
057600         ELSE
057700         MOVE ERROR-COUNTER TO ERROR-TOTAL.
057800     MOVE     CCVS-E-2 TO DUMMY-RECORD.
057900     PERFORM WRITE-LINE.
058000 END-ROUTINE-13.
058100     IF DELETE-COUNTER IS EQUAL TO ZERO
058200         MOVE "NO " TO ERROR-TOTAL  ELSE
058300         MOVE DELETE-COUNTER TO ERROR-TOTAL.
058400     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
058500     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
058600      IF   INSPECT-COUNTER EQUAL TO ZERO
058700          MOVE "NO " TO ERROR-TOTAL
058800      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
058900      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
059000      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
059100     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
059200 WRITE-LINE.
059300     ADD 1 TO RECORD-COUNT.
059400Y    IF RECORD-COUNT GREATER 42
059500Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
059600Y        MOVE SPACE TO DUMMY-RECORD
059700Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
059800Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
059900Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
060000Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
060100Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
060200Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
060300Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
060400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
060500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
060600Y        MOVE ZERO TO RECORD-COUNT.
060700     PERFORM WRT-LN.
060800 WRT-LN.
060900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
061000     MOVE SPACE TO DUMMY-RECORD.
061100 BLANK-LINE-PRINT.
061200     PERFORM WRT-LN.
061300 FAIL-ROUTINE.
061400     IF     COMPUTED-X NOT EQUAL TO SPACE
061500            GO TO   FAIL-ROUTINE-WRITE.
061600     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
061700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
061800     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
061900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
062000     MOVE   SPACES TO INF-ANSI-REFERENCE.
062100     GO TO  FAIL-ROUTINE-EX.
062200 FAIL-ROUTINE-WRITE.
062300     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
062400     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
062500     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
062600     MOVE   SPACES TO COR-ANSI-REFERENCE.
062700 FAIL-ROUTINE-EX. EXIT.
062800 BAIL-OUT.
062900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
063000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
063100 BAIL-OUT-WRITE.
063200     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
063300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
063400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
063500     MOVE   SPACES TO INF-ANSI-REFERENCE.
063600 BAIL-OUT-EX. EXIT.
063700 CCVS1-EXIT.
063800     EXIT.
063900
064000 SECT-IX109A-0003 SECTION.
064100 SEQ-INIT-010.
064200     MOVE ZERO TO TEST-NO.
064300     MOVE "IX-FS3" TO XFILE-NAME (1).
064400     MOVE "R1-F-G" TO XRECORD-NAME (1).
064500     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
064600     MOVE 000240 TO XRECORD-LENGTH (1).
064700     MOVE "RC" TO CHARS-OR-RECORDS (1).
064800     MOVE 0002 TO XBLOCK-SIZE (1).
064900     MOVE 000050 TO RECORDS-IN-FILE (1).
065000     MOVE "IX" TO XFILE-ORGANIZATION (1).
065100     MOVE "S" TO XLABEL-TYPE (1).
065200     MOVE 000001 TO XRECORD-NUMBER (1).
065300     MOVE 0 TO COUNT-OF-RECS.
065400
065500******************************************************************
065600*   TEST  1                                                      *
065700*         OPEN OUTPUT ...                 00 EXPECTED            *
065800*         IX-3, 1.3.4 (1) A                                      *
065900*    STATUS 00 CHECK ON OUTPUT FILE IX-FS3                       *
066000*    THE OUTPUT STATEMENT IS SUCCESSFULLY EXECUTED               *
066100******************************************************************
066200 OPN-INIT-GF-01-0.
066300     MOVE 1 TO STATUS-TEST-00.
066400     MOVE SPACES TO IX-FS3-STATUS.
066500     MOVE "OPEN OUTPUT: 00 EXP." TO FEATURE.
066600     MOVE "OPN-TEST-GF-01-0" TO PAR-NAME.
066700     OPEN
066800        OUTPUT IX-FS3.
066900     IF IX-FS3-STATUS EQUAL TO "00"
067000         GO TO OPN-PASS-GF-01-0.
067100 OPN-FAIL-GF-01-0.
067200     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
067300     PERFORM FAIL.
067400     MOVE IX-FS3-STATUS TO COMPUTED-A.
067500     MOVE "00" TO CORRECT-X.
067600     GO TO OPN-WRITE-GF-01-0.
067700 OPN-PASS-GF-01-0.
067800     PERFORM PASS.
067900 OPN-WRITE-GF-01-0.
068000     PERFORM PRINT-DETAIL.
068100******************************************************************
068200*   TEST  2                                                      *
068300*         WRITE                           00 EXPECTED            *
068400*         IX-3, 1.3.4 (1) A                                      *
068500*    CREATING A INDEXED FILE WITH 50 RECORDS                     *
068600*    KEY:  FROM  000000001 TO 000000050                          *
068700******************************************************************
068800 WRI-INIT-GF-01-0.
068900     MOVE SPACES TO IX-FS3-STATUS.
069000     MOVE 0 TO STATUS-TEST-00.
069100     MOVE "WRITE: 00 EXPECTED" TO FEATURE.
069200     MOVE "WRI-TEST-GF-01-0" TO PAR-NAME.
069300 WRI-TEST-GF-01-0.
069400     MOVE XRECORD-NUMBER (1) TO GRP-0101-KEY.
069500     MOVE GRP-0101 TO XRECORD-KEY (1).
069600     MOVE GRP-0102 TO ALTERNATE-KEY1 (1).
069700*    THE VALUE OF THE ALTERNATE KEY IS 50 TIMES UNCHANGED        *
069800     MOVE FILE-RECORD-INFO (1) TO IX-FS3R1-F-G-240.
069900     WRITE IX-FS3R1-F-G-240.
070000     IF IX-FS3-STATUS  NOT = "00"
070100         ADD 1 TO RECORDS-IN-ERROR
070200     ELSE
070300         ADD 1 TO COUNT-OF-RECS.
070400     IF XRECORD-NUMBER (1) EQUAL TO 50
070500         GO TO WRI-TEST-GF-01-1.
070600     ADD 1 TO XRECORD-NUMBER (1).
070700     GO TO WRI-TEST-GF-01-0.
070800 WRI-TEST-GF-01-1.
070900     IF RECORDS-IN-ERROR EQUAL TO ZERO
071000         GO TO WRI-PASS-GF-01-0.
071100 WRI-FAIL-GF-01-0.
071200     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
071300     PERFORM FAIL.
071400     MOVE "RECORDS IN ERROR =" TO COMPUTED-A.
071500     MOVE RECORDS-IN-ERROR TO CORRECT-18V0.
071600     GO TO WRI-WRITE-GF-01-0.
071700 WRI-PASS-GF-01-0.
071800     PERFORM PASS.
071900 WRI-WRITE-GF-01-0.
072000     PERFORM PRINT-DETAIL.
072100     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
072200     MOVE "CREATE FILE IX-FS3" TO FEATURE.
072300     MOVE "WRI-TEST-GF-01-1" TO PAR-NAME.
072400     MOVE COUNT-OF-RECS TO CORRECT-18V0.
072500     PERFORM PRINT-DETAIL.
072600
072700******************************************************************
072800*   TEST  3                                                      *
072900*         WRITE  (WRONG SEQUENCE)         21 EXPECTED            *
073000*         IX-4, 1.3.4 (3) A                                      *
073100*    KEY:        000000049                                       *
073200******************************************************************
073300 WRI-INIT-GF-02-0.
073400     MOVE SPACES TO IX-FS3-STATUS.
073500     MOVE 0 TO STATUS-TEST-00.
073600     MOVE "WRITE:       21 EXP." TO FEATURE.
073700     MOVE "WRI-TEST-GF-02-0" TO PAR-NAME.
073800     MOVE 49 TO XRECORD-NUMBER (1).
073900 WRI-TEST-GF-02-0.
074000     MOVE XRECORD-NUMBER (1) TO GRP-0101-KEY.
074100     MOVE GRP-0101 TO XRECORD-KEY (1).
074200     MOVE GRP-0102 TO ALTERNATE-KEY1 (1).
074300     MOVE FILE-RECORD-INFO (1) TO IX-FS3R1-F-G-240.
074400     WRITE IX-FS3R1-F-G-240 INVALID KEY GO TO WRI-TEST-GF-02-1.
074500 WRI-TEST-GF-02-1.
074600     IF IX-FS3-STATUS  = "21"
074700         GO TO WRI-PASS-GF-02-0.
074800 WRI-FAIL-GF-02-0.
074900     MOVE "IX-4, 1.3.4, (3) A. " TO RE-MARK.
075000     PERFORM FAIL.
075100     MOVE  IX-FS3-STATUS      TO COMPUTED-A.
075200     MOVE "21" TO CORRECT-X.
075300     GO TO WRI-WRITE-GF-02-0.
075400 WRI-PASS-GF-02-0.
075500     PERFORM PASS.
075600 WRI-WRITE-GF-02-0.
075700     PERFORM PRINT-DETAIL.
075800
075900******************************************************************
076000*   TEST  4                                                      *
076100*         CLOSE OUTPUT                    00 EXPECTED            *
076200*         IX-3, 1.3.4 (1) A                                      *
076300******************************************************************
076400 CLO-INIT-GF-01-0.
076500     MOVE SPACES TO IX-FS3-STATUS.
076600     MOVE "CLOSE OUTPUT:00 EXP." TO FEATURE.
076700     MOVE "CLO-TEST-GF-01-0" TO PAR-NAME.
076800 CLO-TEST-GF-01-0.
076900     CLOSE IX-FS3.
077000     IF IX-FS3-STATUS = "00"
077100         GO TO CLO-PASS-GF-01-0.
077200 CLO-FAIL-GF-01-0.
077300     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
077400     PERFORM FAIL.
077500     MOVE IX-FS3-STATUS TO COMPUTED-A.
077600     MOVE "00" TO CORRECT-X.
077700     GO TO CLO-WRITE-GF-01-0.
077800 CLO-PASS-GF-01-0.
077900     PERFORM PASS.
078000 CLO-WRITE-GF-01-0.
078100     PERFORM PRINT-DETAIL.
078200
078300******************************************************************
078400*    A INDEXED FILE WITH 50 RECORDS HAS BEEN CREATED.            *
078500******************************************************************
078600
078700******************************************************************
078800*   TEST  5                                                      *
078900*         OPEN INPUT                      00 EXPECTED            *
079000*         IX-3, 1.3.4 (1) A                                      *
079100******************************************************************
079200 OPN-INIT-GF-02-0.
079300     MOVE SPACES TO IX-FS3-STATUS.
079400     MOVE "OPEN INPUT:  00 EXP." TO FEATURE.
079500     MOVE "OPN-TEST-GF-02-0" TO PAR-NAME.
079600 OPN-TEST-GF-02-0.
079700     OPEN
079800        INPUT IX-FS3.
079900     IF IX-FS3-STATUS EQUAL TO "00"
080000         GO TO OPN-PASS-GF-02-0.
080100 OPN-FAIL-GF-02-0.
080200     MOVE "IX-3, 1.3.4, (1) A." TO RE-MARK.
080300     PERFORM FAIL.
080400     MOVE IX-FS3-STATUS TO COMPUTED-A.
080500     MOVE "00" TO CORRECT-X.
080600     GO TO OPN-WRITE-GF-02-0.
080700 OPN-PASS-GF-02-0.
080800     PERFORM PASS.
080900 OPN-WRITE-GF-02-0.
081000     PERFORM PRINT-DETAIL.
081100******************************************************************
081200*    STATUS 10 CHECK ON INPUT FILE IX-FS3.                       *
081300*    THIS TEST READS AND VERIFIES THE RECORDS WRITTEN IN         *
081400*    INX-TEST-004. THE USE ON INPUT PROCESSES THE AT END         *
081500*    CONDITION. THERE IS NO AT END PHRASE IN THE READ STATEMENT. *
081600******************************************************************
081700 REA-INIT-F1-01-0.
081800     MOVE 1 TO STATUS-TEST-10.
081900     MOVE SPACES TO IX-FS3-STATUS.
082000     MOVE ZERO TO COUNT-OF-RECS.
082100     MOVE ZERO TO RECORDS-IN-ERROR.
082200     MOVE ZERO TO PERM-ERRORS.
082300     MOVE ZERO TO EOF-FLAG.
082400 REA-TEST-F1-01-0.
082500     READ IX-FS3.
082600     IF EOF-FLAG EQUAL TO 1
082700         GO TO REA-TEST-F1-01-1.
082800     MOVE IX-FS3R1-F-G-240 TO FILE-RECORD-INFO (1).
082900     ADD 1 TO COUNT-OF-RECS.
083000     IF COUNT-OF-RECS GREATER THAN 50
083100         MOVE "MORE THAN 50 RECORDS" TO RE-MARK
083200         GO TO REA-FAIL-F1-01-0.
083300     IF COUNT-OF-RECS LESS THAN 51
083400        IF IX-FS3-STATUS NOT = "00"
083500            MOVE 1 TO STATUS-TEST-READ.
083600     IF PERM-ERRORS EQUAL TO 1
083700         ADD 1 TO RECORDS-IN-ERROR
083800         GO TO REA-TEST-F1-01-1.
083900     IF COUNT-OF-RECS NOT EQUAL TO XRECORD-NUMBER (1)
084000         ADD 1 TO RECORDS-IN-ERROR
084100         GO TO REA-TEST-F1-01-1.
084200     IF XFILE-NAME (1) NOT EQUAL TO "IX-FS3"
084300         ADD 1 TO RECORDS-IN-ERROR
084400         GO TO REA-TEST-F1-01-1.
084500     MOVE XRECORD-KEY (1) TO GRP-0101.
084600     IF GRP-0101-KEY NOT EQUAL TO COUNT-OF-RECS
084700         ADD 1 TO RECORDS-IN-ERROR.
084800     GO TO REA-TEST-F1-01-0.
084900 REA-TEST-F1-01-1.
085000******************************************************************
085100*   TEST  6                                                      *
085200*         READ ... .   (WITHOUT   AT END) 00 EXPECTED            *
085300*         IX-3, 1.3.4 (1) A                                      *
085400******************************************************************
085500     MOVE "REA-TEST-F1-01-0" TO PAR-NAME.
085600     MOVE "READ (USE):  00 EXP."     TO FEATURE.
085700     IF STATUS-TEST-READ = 0
085800         GO TO REA-PASS-F1-01-0.
085900 REA-FAIL-F1-01-0.
086000     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
086100     MOVE "I-O STATUS IS NOT 00" TO COMPUTED-A.
086200     MOVE "00" TO CORRECT-X.
086300     PERFORM FAIL.
086400     GO TO REA-WRITE-F1-01-0.
086500 REA-PASS-F1-01-0.
086600     PERFORM PASS.
086700 REA-WRITE-F1-01-0.
086800     PERFORM PRINT-DETAIL.
086900*
087000 REA-INIT-GF-02-0.
087100******************************************************************
087200*   TEST  7                                                      *
087300*         VERIFY FILE                                            *
087400******************************************************************
087500     IF RECORDS-IN-ERROR EQUAL TO ZERO
087600         GO TO REA-TEST-F1-02-0.
087700     MOVE "ERRORS IN READING IX-FS3" TO RE-MARK.
087800 REA-FAIL-F1-02-0.
087900     MOVE "RECORDS IN ERROR =" TO COMPUTED-A.
088000     MOVE RECORDS-IN-ERROR TO CORRECT-18V0.
088100     GO TO REA-FAIL-F1-02-1.
088200 REA-TEST-F1-02-0.
088300     IF COUNT-OF-RECORDS EQUAL TO 50
088400         GO TO REA-PASS-F1-02-0.
088500     MOVE "UNEXPECTED EOF" TO RE-MARK.
088600     MOVE "RECORDS READ =" TO COMPUTED-A.
088700     MOVE COUNT-OF-RECORDS TO CORRECT-18V0.
088800 REA-FAIL-F1-02-1.
088900     PERFORM FAIL.
089000     GO TO REA-WRITE-F1-02-0.
089100 REA-PASS-F1-02-0.
089200     PERFORM PASS.
089300     MOVE "FILE VERIFIED RECS =" TO COMPUTED-A.
089400     MOVE COUNT-OF-RECORDS TO CORRECT-18V0.
089500 REA-WRITE-F1-02-0.
089600     MOVE "REA-TEST-F1-02-0" TO PAR-NAME.
089700     MOVE "VERIFY FILE IX-FS3" TO FEATURE.
089800     PERFORM PRINT-DETAIL.
089900******************************************************************
090000*   TEST  8                                                      *
090100*         READ.   (WITHOUT   AT END)      10 EXPECTED            *
090200*         IX-4, 1.3.4 (2) A                                      *
090300******************************************************************
090400 REA-INIT-F1-03-0.
090500     IF IX-FS3-STATUS EQUAL TO "10"
090600         GO TO REA-PASS-F1-03-0.
090700 REA-FAIL-F1-03-0.
090800     MOVE IX-FS3-STATUS TO COMPUTED-A.
090900     MOVE "10" TO CORRECT-X.
091000     MOVE "IX-4, 1.3.4, (2) A." TO RE-MARK.
091100     PERFORM FAIL.
091200     GO TO REA-WRITE-F1-03-0.
091300 REA-PASS-F1-03-0.
091400     PERFORM PASS.
091500 REA-WRITE-F1-03-0.
091600     MOVE "READ :       10 EXP." TO FEATURE.
091700     MOVE "REA-TEST-F1-03-0" TO PAR-NAME.
091800     PERFORM PRINT-DETAIL.
091900******************************************************************
092000*   TEST  9                                                      *
092100*         CLOSE INPUT                     00 EXPECTED            *
092200*         IX-3, 1.3.4 (1) A                                      *
092300******************************************************************
092400 CLO-TEST-GF-02-0.
092500     MOVE SPACES TO IX-FS3-STATUS.
092600     MOVE "CLOSE INPUT: 00 EXP."  TO FEATURE.
092700     MOVE "CLO-TEST-GF-02-0" TO PAR-NAME.
092800     CLOSE IX-FS3.
092900     IF IX-FS3-STATUS = "00"
093000         GO TO CLO-PASS-GF-02-0.
093100 CLO-FAIL-GF-02-0.
093200     MOVE "IX-3, 1.3.4, (1) A    " TO RE-MARK.
093300     MOVE IX-FS3-STATUS TO COMPUTED-A.
093400     MOVE "00" TO CORRECT-X.
093500     PERFORM FAIL.
093600     GO TO CLO-WRITE-GF-02-0.
093700 CLO-PASS-GF-02-0.
093800     PERFORM PASS.
093900 CLO-WRITE-GF-02-0.
094000     PERFORM PRINT-DETAIL.
094100
094200******************************************************************
094300*   TEST  10                                                     *
094400*         OPEN INPUT   (FOR READ ...  AT END) 00 EXPECTED        *
094500*         IX-3, 1.3.4 (1) A                                      *
094600******************************************************************
094700 OPN-INIT-GF-03-0.
094800     MOVE SPACES TO IX-FS3-STATUS.
094900     MOVE "OPEN  INPUT: 00 EXP." TO FEATURE.
095000     MOVE "OPN-TEST-GF-03-0" TO PAR-NAME.
095100 OPN-TEST-GF-03-0.
095200     OPEN
095300        INPUT IX-FS3.
095400     IF IX-FS3-STATUS EQUAL TO "00"
095500         GO TO OPN-PASS-GF-03-0.
095600 OPN-FAIL-GF-03-0.
095700     MOVE "IX-3, 1.3.4, (1) A." TO RE-MARK.
095800     PERFORM FAIL.
095900     MOVE IX-FS3-STATUS TO COMPUTED-A.
096000     MOVE "00" TO CORRECT-X.
096100     GO TO OPN-WRITE-GF-03-0.
096200 OPN-PASS-GF-03-0.
096300     PERFORM PASS.
096400 OPN-WRITE-GF-03-0.
096500     PERFORM PRINT-DETAIL.
096600******************************************************************
096700*    STATUS IO CHECK ON INPUT FILE IX-FS3.                       *
096800*    THIS TEST READS AND VERIFIES THE RECORDS WRITTEN IN         *
096900*    TEST 2.       THE USE ON INPUT PROCESSES THE AT END         *
097000*    CONDITION.
097100******************************************************************
097200 REA-INIT-F1-04-0.
097300     MOVE 1 TO STATUS-TEST-10.
097400     MOVE ZERO TO STATUS-TEST-READ.
097500     MOVE SPACES TO IX-FS3-STATUS.
097600     MOVE ZERO TO COUNT-OF-RECS.
097700     MOVE ZERO TO PERM-ERRORS.
097800     MOVE ZERO TO EOF-FLAG.
097900 REA-TEST-F1-04-0.
098000     READ IX-FS3  AT END MOVE 1 TO EOF-FLAG.
098100     IF EOF-FLAG EQUAL TO 1
098200         GO TO REA-TEST-F1-04-1.
098300     MOVE IX-FS3R1-F-G-240 TO FILE-RECORD-INFO (1).
098400     ADD 1 TO COUNT-OF-RECS.
098500     IF COUNT-OF-RECS LESS THAN 51
098600        IF IX-FS3-STATUS NOT = "00"
098700            MOVE 1 TO STATUS-TEST-READ.
098800     IF PERM-ERRORS EQUAL TO 1
098900         ADD 1 TO RECORDS-IN-ERROR
099000         GO TO REA-TEST-F1-04-1.
099100     IF COUNT-OF-RECS NOT EQUAL TO XRECORD-NUMBER (1)
099200         ADD 1 TO RECORDS-IN-ERROR
099300         GO TO REA-TEST-F1-04-1.
099400     IF XFILE-NAME (1) NOT EQUAL TO "IX-FS3"
099500         ADD 1 TO RECORDS-IN-ERROR
099600         GO TO REA-TEST-F1-04-1.
099700     MOVE XRECORD-KEY (1) TO GRP-0101.
099800     IF GRP-0101-KEY NOT EQUAL TO COUNT-OF-RECS
099900         ADD 1 TO RECORDS-IN-ERROR.
100000     GO TO REA-TEST-F1-04-0.
100100 REA-TEST-F1-04-1.
100200******************************************************************
100300*   TEST  11                                                     *
100400*         READ ...  AT END                00 EXPECTED            *
100500*         IX-3, 1.3.4 (1) A                                      *
100600******************************************************************
100700     MOVE "REA-TEST-F1-04-0" TO PAR-NAME.
100800     MOVE "READ...END:  00 EXP."     TO FEATURE.
100900     IF STATUS-TEST-READ = 0
101000         GO TO REA-PASS-F1-04-0.
101100 REA-FAIL-F1-04-0.
101200     MOVE "I-O STATUS IS NOT 00" TO COMPUTED-A.
101300     MOVE "00" TO CORRECT-X.
101400     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
101500     PERFORM FAIL.
101600     GO TO REA-WRITE-F1-04-0.
101700 REA-PASS-F1-04-0.
101800     PERFORM PASS.
101900 REA-WRITE-F1-04-0.
102000     PERFORM PRINT-DETAIL.
102100*
102200 REA-TEST-F1-05-0.
102300******************************************************************
102400*   TEST  12                                                     *
102500*         READ ... AT END    10 EXPECTED                         *
102600*         IX-4, 1.3.4 (2) A 1)                                   *
102700******************************************************************
102800     IF IX-FS3-STATUS EQUAL TO "10"
102900         GO TO REA-PASS-F1-05-0.
103000 REA-FAIL-F1-05-0.
103100     MOVE IX-FS3-STATUS TO COMPUTED-A.
103200     MOVE "10" TO CORRECT-X.
103300     MOVE "IX-4, 1.3.4, (2) A 1)" TO RE-MARK.
103400     PERFORM FAIL.
103500     GO TO REA-WRITE-F1-05-0.
103600 REA-PASS-F1-05-0.
103700     PERFORM PASS.
103800 REA-WRITE-F1-05-0.
103900     MOVE "READ...END:  10 EXP." TO FEATURE.
104000     MOVE "REA-TEST-F1-05-0" TO PAR-NAME.
104100     PERFORM PRINT-DETAIL.
104200******************************************************************
104300*   TEST  13                                                     *
104400*         READ ... (AFTER AT END)      46 EXPECTED               *
104500*         IX-5, 1.3.4 (5) E 3)                                   *
104600******************************************************************
104700 REA-TEST-F1-06-0.
104800     MOVE 13 TO TEST-NO.
104900     READ IX-FS3 AT END GO TO REA-TEST-F1-06-1.
105000 REA-TEST-F1-06-1.
105100     IF IX-FS3-STATUS EQUAL TO "46"
105200        MOVE "SHOULD HAVE EXECUTED DECLARATIVES IX-3,1.3.4(4)"
105300          TO RE-MARK
105400        GO TO REA-WRITE-F1-06-0.
105500 REA-FAIL-F1-06-0.
105600     MOVE "IX-5, 1.3.4, (5) E 3)" TO RE-MARK.
105700 REA-WRITE-F1-06-0.
105800     MOVE IX-FS3-STATUS TO COMPUTED-A.
105900     MOVE "46" TO CORRECT-X.
106000     PERFORM FAIL.
106100     MOVE "READ.        46 EXP." TO FEATURE.
106200     MOVE "REA-TEST-F1-06-0" TO PAR-NAME.
106300     PERFORM PRINT-DETAIL.
106400     CLOSE IX-FS3.
106500
106600 TERMINATE-ROUTINE.
106700     EXIT.
106800
106900 CCVS-EXIT SECTION.
107000 CCVS-999999.
107100     GO TO CLOSE-FILES.
