000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX101A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*    THIS PROGRAM IS THE FIRST OF A SERIES WHICH PROCESSES AN
001400*    INDEXED FILE.  THE FUNCTION OF THIS PROGRAM IS TO CREATE AN
001500*    INDEXED FILE SEQUENTIALLY (ACCESS MODE SEQUENTIAL) AND VERIFY
001600*    THAT IT WAS CREATED AS EXPECTED.  THE FILE IS IDENTIFIED AS
001700*    "IX-FS1" AND IS PASSED TO PROGRAM IX102 FOR PROCESSING.
001800*
001900*
002000*       X-CARDS  WHICH MUST BE REPLACED FOR THIS PROGRAM ARE
002100*
002200*             X-24   INDEXED FILE IMPLEMENTOR-NAME IN ASSGN TO
002300*                    CLAUSE FOR DATA FILE IX-FS1
002400*             X-44   INDEXED FILE IMPLEMENTOR-NAME IN ASSGN TO
002500*                    CLAUSE FOR INDEX FILE IX-FS1
002600*             X-55   IMPLEMENTOR-NAME FOR SYSTEM PRINTER
002700*             X-62   IMPLEMENTOR-NAME FOR RAW-DATA (OPTIONAL)
002800*             X-82   IMPLEMENTOR-NAME FOR SOURCE-COMPUTER
002900*             X-83   IMPLEMENTOR-NAME FOR OBJECT-COMPUTER
003000*
003100*         NOTE:  X-CARDS 44 AND 62          ARE OPTIONAL
003200*               AND NEED ONLY TO BE PRESENT IF THE COMPILER RE-
003300*               QUIRES THIS CODE BE AVAILABLE FOR PROPER PROGRAM
003400*               COMPILATION AND EXECUTION. IF THE VP-ROUTINE IS
003500*               USED THE  X-CARDS MAY BE AUTOMATICALLY SELECTED
003600*               FOR INCLUSION IN THE PROGRAM BY SPECIFYING THE
003700*               APPROPRIATE LETTER IN THE "*OPT" VP-ROUTINE
003800*               CONTROL CARD. THE LETTER  CORRESPONDS TO A
003900*               CHARACTER IN POSITION 7 OF THE SOURCE LINE AND
004000*               THEY ARE AS FOLLOWS
004100*
004200*                  J  SELECTS X-CARD 44
004300*
004400******************************************************
004500 ENVIRONMENT DIVISION.
004600 CONFIGURATION SECTION.
004700 SOURCE-COMPUTER.
004800     XXXXX082.
004900 OBJECT-COMPUTER.
005000     XXXXX083.
005100 INPUT-OUTPUT SECTION.
005200 FILE-CONTROL.
005300P    SELECT RAW-DATA   ASSIGN TO
005400P    XXXXX062
005500P           ORGANIZATION IS INDEXED
005600P           ACCESS MODE IS RANDOM
005700P           RECORD KEY IS RAW-DATA-KEY.
005800     SELECT PRINT-FILE ASSIGN TO
005900     XXXXX055.
006000     SELECT   IX-FS1 ASSIGN TO
006100     XXXXP024
006200J    XXXXP044
006300     ORGANIZATION IS INDEXED
006400     RECORD KEY IS IX-FS1-KEY
006500     ACCESS MODE IS SEQUENTIAL.
006600 DATA DIVISION.
006700 FILE SECTION.
006800P
006900PFD  RAW-DATA.
007000P
007100P01  RAW-DATA-SATZ.
007200P    05  RAW-DATA-KEY        PIC X(6).
007300P    05  C-DATE              PIC 9(6).
007400P    05  C-TIME              PIC 9(8).
007500P    05  C-NO-OF-TESTS       PIC 99.
007600P    05  C-OK                PIC 999.
007700P    05  C-ALL               PIC 999.
007800P    05  C-FAIL              PIC 999.
007900P    05  C-DELETED           PIC 999.
008000P    05  C-INSPECT           PIC 999.
008100P    05  C-NOTE              PIC X(13).
008200P    05  C-INDENT            PIC X.
008300P    05  C-ABORT             PIC X(8).
008400 FD  PRINT-FILE.
008500 01  PRINT-REC PICTURE X(120).
008600 01  DUMMY-RECORD PICTURE X(120).
008700 FD  IX-FS1
008800C    LABEL RECORD IS STANDARD
008900C    DATA RECORD IS IX-FS1R1-F-G-240
009000     BLOCK CONTAINS 1 RECORDS
009100     RECORD CONTAINS 240 CHARACTERS.
009200 01  IX-FS1R1-F-G-240.
009300     03 IX-FS1-WRK-120 PIC X(120).
009400     03 IX-FS1-GRP-120.
009500     05 FILLER   PIC   X(8).
009600     05 IX-FS1-KEY  PIC X(29).
009700     05 FILLER PIC X(83).
009800 WORKING-STORAGE SECTION.
009900 01  GRP-0101.
010000     02 FILLER   PIC X(10)  VALUE "ABCDLKJXYZ".
010100     02 WRK-DU-09V00-001 PIC 9(9)  VALUE ZERO.
010200     02 FILLER  PIC X(10)  VALUE "ZIF,.$-+CD".
010300 01  FILE-RECORD-INFORMATION-REC.
010400     03 FILE-RECORD-INFO-SKELETON.
010500        05 FILLER                 PICTURE X(48)       VALUE
010600             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
010700        05 FILLER                 PICTURE X(46)       VALUE
010800             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
010900        05 FILLER                 PICTURE X(26)       VALUE
011000             ",LFIL=000000,ORG=  ,LBLR= ".
011100        05 FILLER                 PICTURE X(37)       VALUE
011200             ",RECKEY=                             ".
011300        05 FILLER                 PICTURE X(38)       VALUE
011400             ",ALTKEY1=                             ".
011500        05 FILLER                 PICTURE X(38)       VALUE
011600             ",ALTKEY2=                             ".
011700        05 FILLER                 PICTURE X(7)        VALUE SPACE.
011800     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
011900        05 FILE-RECORD-INFO-P1-120.
012000           07 FILLER              PIC X(5).
012100           07 XFILE-NAME           PIC X(6).
012200           07 FILLER              PIC X(8).
012300           07 XRECORD-NAME         PIC X(6).
012400           07 FILLER              PIC X(1).
012500           07 REELUNIT-NUMBER     PIC 9(1).
012600           07 FILLER              PIC X(7).
012700           07 XRECORD-NUMBER       PIC 9(6).
012800           07 FILLER              PIC X(6).
012900           07 UPDATE-NUMBER       PIC 9(2).
013000           07 FILLER              PIC X(5).
013100           07 ODO-NUMBER          PIC 9(4).
013200           07 FILLER              PIC X(5).
013300           07 XPROGRAM-NAME        PIC X(5).
013400           07 FILLER              PIC X(7).
013500           07 XRECORD-LENGTH       PIC 9(6).
013600           07 FILLER              PIC X(7).
013700           07 CHARS-OR-RECORDS    PIC X(2).
013800           07 FILLER              PIC X(1).
013900           07 XBLOCK-SIZE          PIC 9(4).
014000           07 FILLER              PIC X(6).
014100           07 RECORDS-IN-FILE     PIC 9(6).
014200           07 FILLER              PIC X(5).
014300           07 XFILE-ORGANIZATION   PIC X(2).
014400           07 FILLER              PIC X(6).
014500           07 XLABEL-TYPE          PIC X(1).
014600        05 FILE-RECORD-INFO-P121-240.
014700           07 FILLER              PIC X(8).
014800           07 XRECORD-KEY          PIC X(29).
014900           07 FILLER              PIC X(9).
015000           07 ALTERNATE-KEY1      PIC X(29).
015100           07 FILLER              PIC X(9).
015200           07 ALTERNATE-KEY2      PIC X(29).
015300           07 FILLER              PIC X(7).
015400 01  TEST-RESULTS.
015500     02 FILLER                   PIC X      VALUE SPACE.
015600     02 FEATURE                  PIC X(20)  VALUE SPACE.
015700     02 FILLER                   PIC X      VALUE SPACE.
015800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
015900     02 FILLER                   PIC X      VALUE SPACE.
016000     02  PAR-NAME.
016100       03 FILLER                 PIC X(19)  VALUE SPACE.
016200       03  PARDOT-X              PIC X      VALUE SPACE.
016300       03 DOTVALUE               PIC 99     VALUE ZERO.
016400     02 FILLER                   PIC X(8)   VALUE SPACE.
016500     02 RE-MARK                  PIC X(61).
016600 01  TEST-COMPUTED.
016700     02 FILLER                   PIC X(30)  VALUE SPACE.
016800     02 FILLER                   PIC X(17)  VALUE
016900            "       COMPUTED=".
017000     02 COMPUTED-X.
017100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
017200     03 COMPUTED-N               REDEFINES COMPUTED-A
017300                                 PIC -9(9).9(9).
017400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
017500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
017600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
017700     03       CM-18V0 REDEFINES COMPUTED-A.
017800         04 COMPUTED-18V0                    PIC -9(18).
017900         04 FILLER                           PIC X.
018000     03 FILLER PIC X(50) VALUE SPACE.
018100 01  TEST-CORRECT.
018200     02 FILLER PIC X(30) VALUE SPACE.
018300     02 FILLER PIC X(17) VALUE "       CORRECT =".
018400     02 CORRECT-X.
018500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
018600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
018700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
018800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
018900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
019000     03      CR-18V0 REDEFINES CORRECT-A.
019100         04 CORRECT-18V0                     PIC -9(18).
019200         04 FILLER                           PIC X.
019300     03 FILLER PIC X(2) VALUE SPACE.
019400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
019500 01  CCVS-C-1.
019600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
019700-    "SS  PARAGRAPH-NAME
019800-    "       REMARKS".
019900     02 FILLER                     PIC X(20)    VALUE SPACE.
020000 01  CCVS-C-2.
020100     02 FILLER                     PIC X        VALUE SPACE.
020200     02 FILLER                     PIC X(6)     VALUE "TESTED".
020300     02 FILLER                     PIC X(15)    VALUE SPACE.
020400     02 FILLER                     PIC X(4)     VALUE "FAIL".
020500     02 FILLER                     PIC X(94)    VALUE SPACE.
020600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
020700 01  REC-CT                        PIC 99       VALUE ZERO.
020800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
020900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
021000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
021100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
021200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
021300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
021400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
021500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
021600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
021700 01  CCVS-H-1.
021800     02  FILLER                    PIC X(39)    VALUE SPACES.
021900     02  FILLER                    PIC X(42)    VALUE
022000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
022100     02  FILLER                    PIC X(39)    VALUE SPACES.
022200 01  CCVS-H-2A.
022300   02  FILLER                        PIC X(40)  VALUE SPACE.
022400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
022500   02  FILLER                        PIC XXXX   VALUE
022600     "4.2 ".
022700   02  FILLER                        PIC X(28)  VALUE
022800            " COPY - NOT FOR DISTRIBUTION".
022900   02  FILLER                        PIC X(41)  VALUE SPACE.
023000
023100 01  CCVS-H-2B.
023200   02  FILLER                        PIC X(15)  VALUE
023300            "TEST RESULT OF ".
023400   02  TEST-ID                       PIC X(9).
023500   02  FILLER                        PIC X(4)   VALUE
023600            " IN ".
023700   02  FILLER                        PIC X(12)  VALUE
023800     " HIGH       ".
023900   02  FILLER                        PIC X(22)  VALUE
024000            " LEVEL VALIDATION FOR ".
024100   02  FILLER                        PIC X(58)  VALUE
024200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024300 01  CCVS-H-3.
024400     02  FILLER                      PIC X(34)  VALUE
024500            " FOR OFFICIAL USE ONLY    ".
024600     02  FILLER                      PIC X(58)  VALUE
024700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
024800     02  FILLER                      PIC X(28)  VALUE
024900            "  COPYRIGHT   1985 ".
025000 01  CCVS-E-1.
025100     02 FILLER                       PIC X(52)  VALUE SPACE.
025200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
025300     02 ID-AGAIN                     PIC X(9).
025400     02 FILLER                       PIC X(45)  VALUE SPACES.
025500 01  CCVS-E-2.
025600     02  FILLER                      PIC X(31)  VALUE SPACE.
025700     02  FILLER                      PIC X(21)  VALUE SPACE.
025800     02 CCVS-E-2-2.
025900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
026000         03 FILLER                   PIC X      VALUE SPACE.
026100         03 ENDER-DESC               PIC X(44)  VALUE
026200            "ERRORS ENCOUNTERED".
026300 01  CCVS-E-3.
026400     02  FILLER                      PIC X(22)  VALUE
026500            " FOR OFFICIAL USE ONLY".
026600     02  FILLER                      PIC X(12)  VALUE SPACE.
026700     02  FILLER                      PIC X(58)  VALUE
026800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026900     02  FILLER                      PIC X(13)  VALUE SPACE.
027000     02 FILLER                       PIC X(15)  VALUE
027100             " COPYRIGHT 1985".
027200 01  CCVS-E-4.
027300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
027400     02 FILLER                       PIC X(4)   VALUE " OF ".
027500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
027600     02 FILLER                       PIC X(40)  VALUE
027700      "  TESTS WERE EXECUTED SUCCESSFULLY".
027800 01  XXINFO.
027900     02 FILLER                       PIC X(19)  VALUE
028000            "*** INFORMATION ***".
028100     02 INFO-TEXT.
028200       04 FILLER                     PIC X(8)   VALUE SPACE.
028300       04 XXCOMPUTED                 PIC X(20).
028400       04 FILLER                     PIC X(5)   VALUE SPACE.
028500       04 XXCORRECT                  PIC X(20).
028600     02 INF-ANSI-REFERENCE           PIC X(48).
028700 01  HYPHEN-LINE.
028800     02 FILLER  PIC IS X VALUE IS SPACE.
028900     02 FILLER  PIC IS X(65)    VALUE IS "************************
029000-    "*****************************************".
029100     02 FILLER  PIC IS X(54)    VALUE IS "************************
029200-    "******************************".
029300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
029400     "IX101A".
029500 PROCEDURE DIVISION.
029600 CCVS1 SECTION.
029700 OPEN-FILES.
029800P    OPEN I-O RAW-DATA.
029900P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
030000P    READ RAW-DATA INVALID KEY GO TO END-E-1.
030100P    MOVE "ABORTED " TO C-ABORT.
030200P    ADD 1 TO C-NO-OF-TESTS.
030300P    ACCEPT C-DATE  FROM DATE.
030400P    ACCEPT C-TIME  FROM TIME.
030500P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
030600PEND-E-1.
030700P    CLOSE RAW-DATA.
030800     OPEN    OUTPUT PRINT-FILE.
030900     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
031000     MOVE    SPACE TO TEST-RESULTS.
031100     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
031200     MOVE    ZERO TO REC-SKL-SUB.
031300     PERFORM CCVS-INIT-FILE 9 TIMES.
031400 CCVS-INIT-FILE.
031500     ADD     1 TO REC-SKL-SUB.
031600     MOVE    FILE-RECORD-INFO-SKELETON
031700          TO FILE-RECORD-INFO (REC-SKL-SUB).
031800 CCVS-INIT-EXIT.
031900     GO TO CCVS1-EXIT.
032000 CLOSE-FILES.
032100P    OPEN I-O RAW-DATA.
032200P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
032300P    READ RAW-DATA INVALID KEY GO TO END-E-2.
032400P    MOVE "OK.     " TO C-ABORT.
032500P    MOVE PASS-COUNTER TO C-OK.
032600P    MOVE ERROR-HOLD   TO C-ALL.
032700P    MOVE ERROR-COUNTER TO C-FAIL.
032800P    MOVE DELETE-COUNTER TO C-DELETED.
032900P    MOVE INSPECT-COUNTER TO C-INSPECT.
033000P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
033100PEND-E-2.
033200P    CLOSE RAW-DATA.
033300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
033400 TERMINATE-CCVS.
033500S    EXIT PROGRAM.
033600STERMINATE-CALL.
033700     STOP     RUN.
033800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
033900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
034000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
034100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
034200     MOVE "****TEST DELETED****" TO RE-MARK.
034300 PRINT-DETAIL.
034400     IF REC-CT NOT EQUAL TO ZERO
034500             MOVE "." TO PARDOT-X
034600             MOVE REC-CT TO DOTVALUE.
034700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
034800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
034900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
035000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
035100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
035200     MOVE SPACE TO CORRECT-X.
035300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
035400     MOVE     SPACE TO RE-MARK.
035500 HEAD-ROUTINE.
035600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
036000 COLUMN-NAMES-ROUTINE.
036100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
036400 END-ROUTINE.
036500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
036600 END-RTN-EXIT.
036700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036800 END-ROUTINE-1.
036900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
037000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
037100      ADD PASS-COUNTER TO ERROR-HOLD.
037200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
037300      MOVE PASS-COUNTER TO CCVS-E-4-1.
037400      MOVE ERROR-HOLD TO CCVS-E-4-2.
037500      MOVE CCVS-E-4 TO CCVS-E-2-2.
037600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
037700  END-ROUTINE-12.
037800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
037900     IF       ERROR-COUNTER IS EQUAL TO ZERO
038000         MOVE "NO " TO ERROR-TOTAL
038100         ELSE
038200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
038300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
038400     PERFORM WRITE-LINE.
038500 END-ROUTINE-13.
038600     IF DELETE-COUNTER IS EQUAL TO ZERO
038700         MOVE "NO " TO ERROR-TOTAL  ELSE
038800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
038900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
039000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039100      IF   INSPECT-COUNTER EQUAL TO ZERO
039200          MOVE "NO " TO ERROR-TOTAL
039300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
039400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
039500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039700 WRITE-LINE.
039800     ADD 1 TO RECORD-COUNT.
039900Y    IF RECORD-COUNT GREATER 42
040000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
040100Y        MOVE SPACE TO DUMMY-RECORD
040200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
040300Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
040400Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
040500Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
040600Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
040700Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
040800Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
040900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
041000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
041100Y        MOVE ZERO TO RECORD-COUNT.
041200     PERFORM WRT-LN.
041300 WRT-LN.
041400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
041500     MOVE SPACE TO DUMMY-RECORD.
041600 BLANK-LINE-PRINT.
041700     PERFORM WRT-LN.
041800 FAIL-ROUTINE.
041900     IF     COMPUTED-X NOT EQUAL TO SPACE
042000            GO TO   FAIL-ROUTINE-WRITE.
042100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
042200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
042300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
042400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042500     MOVE   SPACES TO INF-ANSI-REFERENCE.
042600     GO TO  FAIL-ROUTINE-EX.
042700 FAIL-ROUTINE-WRITE.
042800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
042900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
043000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
043100     MOVE   SPACES TO COR-ANSI-REFERENCE.
043200 FAIL-ROUTINE-EX. EXIT.
043300 BAIL-OUT.
043400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
043500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
043600 BAIL-OUT-WRITE.
043700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
043800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
043900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044000     MOVE   SPACES TO INF-ANSI-REFERENCE.
044100 BAIL-OUT-EX. EXIT.
044200 CCVS1-EXIT.
044300     EXIT.
044400 SECT-IX-01-001 SECTION.
044500 WRITE-INIT-GF-01.
044600     MOVE     "FILE CREATE IX-FS1" TO FEATURE.
044700     OPEN     OUTPUT    IX-FS1.
044800     MOVE     "IX-FS1" TO XFILE-NAME (1).
044900     MOVE    "IX-F-G" TO XRECORD-NAME (1).
045000     MOVE  CCVS-PGM-ID TO XPROGRAM-NAME (1).
045100     MOVE    000240  TO XRECORD-LENGTH (1).
045200     MOVE     "RC"     TO CHARS-OR-RECORDS (1).
045300     MOVE     0001     TO XBLOCK-SIZE (1).
045400     MOVE     000500   TO RECORDS-IN-FILE (1).
045500     MOVE    "IX"  TO XFILE-ORGANIZATION (1).
045600     MOVE     "S"      TO XLABEL-TYPE (1).
045700     MOVE     000001   TO XRECORD-NUMBER (1).
045800 WRITE-TEST-GF-01.
045900     MOVE    XRECORD-NUMBER (1) TO WRK-DU-09V00-001.
046000     MOVE    GRP-0101 TO XRECORD-KEY (1).
046100     MOVE    FILE-RECORD-INFO (1) TO IX-FS1R1-F-G-240.
046200     WRITE   IX-FS1R1-F-G-240
046300              INVALID KEY GO TO WRITE-FAIL-GF-01.
046400     IF      XRECORD-NUMBER (1) EQUAL TO 500
046500             GO TO WRITE-PASS-GF-01.
046600     ADD      000001 TO XRECORD-NUMBER (1).
046700     GO       TO WRITE-TEST-GF-01.
046800 WRITE-FAIL-GF-01.
046900     MOVE     "IX-41 4.9.2        " TO RE-MARK.
047000     PERFORM FAIL.
047100     GO TO WRITE-WRITE-GF-01.
047200 WRITE-PASS-GF-01.
047300     PERFORM PASS.
047400 WRITE-WRITE-GF-01.
047500     MOVE     "WRITE-TEST-GF-01" TO PAR-NAME
047600     MOVE     "FILE CREATED, LFILE "  TO COMPUTED-A.
047700     MOVE    XRECORD-NUMBER (1) TO CORRECT-18V0.
047800     PERFORM  PRINT-DETAIL.
047900     CLOSE    IX-FS1.
048000 READ-INIT-GF-01.
048100     OPEN     INPUT     IX-FS1.
048200     MOVE   ZERO TO WRK-DU-09V00-001.
048300 READ-TEST-GF-01.
048400     READ     IX-FS1
048500              AT END GO TO READ-TEST-GF-01-1.
048600     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
048700     ADD     1  TO WRK-DU-09V00-001.
048800     IF      WRK-DU-09V00-001 GREATER 500
048900             MOVE "MORE THAN 500 RECORDS" TO RE-MARK
049000              GO TO READ-TEST-GF-01-1.
049100     GO       TO READ-TEST-GF-01.
049200 READ-TEST-GF-01-1.
049300     IF       XRECORD-NUMBER (1) NOT EQUAL TO 500
049400              MOVE "IX-28 4.5.2 " TO RE-MARK
049500              PERFORM FAIL
049600              ELSE
049700              PERFORM PASS.
049800     GO       TO READ-WRITE-GF-01.
049900 READ-WRITE-GF-01.
050000     MOVE     "READ-TEST-GF-01" TO PAR-NAME.
050100     MOVE     "FILE VERIFIED, LFILE" TO COMPUTED-A.
050200     MOVE    XRECORD-NUMBER (1) TO CORRECT-18V0.
050300     PERFORM  PRINT-DETAIL.
050400     CLOSE   IX-FS1.
050500 CCVS-EXIT SECTION.
050600 CCVS-999999.
050700     GO TO   CLOSE-FILES.
