000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX113A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    1.  THE  ROUTINE  CREATES  THE  MASS  STORAGE  FILE  IX-FS3
001500*        CONTAINING  50  RECORDS. EACH BLOCK CONTAINS 2 RECORDS,
001600*        EACH  RECORD  CONTAINS  240 CHARACTERS, ORGANIZATION IS
001700*        INDEXED,  ACCESS  IS SEQUENTIAL.
001800*
001900*    2. THE ROUTINE READS THE CREATED FILE,VERIFIES IT AND       *
002000*       CHECKS THE FILE STATUS CODES:
002100*           00  -  AFTER OPEN OUTPUT
002200*           00  -  AFTER WRITE
002300*           00  -  AFTER CLOSE OUTPUT
002400*           42  -  AFTER CLOSE OUTPUT
002500*
002600*    4. X-CARDS USED IN THIS PROGRAM:
002700*
002800*                 XXXXX024
002900*                 XXXXX055.
003000*         P       XXXXX062.
003100*                 XXXXX082.
003200*                 XXXXX083.
003300*         C       XXXXX084
003400*
003500*
003600 ENVIRONMENT DIVISION.
003700 CONFIGURATION SECTION.
003800 SOURCE-COMPUTER.
003900     XXXXX082.
004000 OBJECT-COMPUTER.
004100     XXXXX083.
004200 INPUT-OUTPUT SECTION.
004300 FILE-CONTROL.
004400P    SELECT RAW-DATA   ASSIGN TO
004500P    XXXXX062
004600P           ORGANIZATION IS INDEXED
004700P           ACCESS MODE IS RANDOM
004800P           RECORD KEY IS RAW-DATA-KEY.
004900*
005000     SELECT PRINT-FILE ASSIGN TO
005100     XXXXX055.
005200*
005300     SELECT IX-FS3 ASSIGN
005400     XXXXX024
005500     ORGANIZATION IS INDEXED
005600     ACCESS MODE IS SEQUENTIAL
005700     RECORD KEY IS IX-FS3-KEY
005800     FILE STATUS IS IX-FS3-STATUS.
005900
006000 DATA DIVISION.
006100
006200 FILE SECTION.
006300P
006400PFD  RAW-DATA.
006500P
006600P01  RAW-DATA-SATZ.
006700P    05  RAW-DATA-KEY        PIC X(6).
006800P    05  C-DATE              PIC 9(6).
006900P    05  C-TIME              PIC 9(8).
007000P    05  C-NO-OF-TESTS       PIC 99.
007100P    05  C-OK                PIC 999.
007200P    05  C-ALL               PIC 999.
007300P    05  C-FAIL              PIC 999.
007400P    05  C-DELETED           PIC 999.
007500P    05  C-INSPECT           PIC 999.
007600P    05  C-NOTE              PIC X(13).
007700P    05  C-INDENT            PIC X.
007800P    05  C-ABORT             PIC X(8).
007900
008000 FD  PRINT-FILE.
008100
008200 01  PRINT-REC               PIC X(120).
008300
008400 01  DUMMY-RECORD            PIC X(120).
008500
008600 FD  IX-FS3
008700C       DATA RECORDS IX-FS3R1-F-G-240
008800C       LABEL RECORD STANDARD
008900        RECORD 240
009000        BLOCK CONTAINS 2 RECORDS.
009100
009200 01  IX-FS3R1-F-G-240.
009300     05  IX-FS3-REC-120      PIC X(120).
009400     05  IX-FS3-REC-120-240.
009500         10  FILLER          PIC X(8).
009600         10  IX-FS3-KEY      PIC X(29).
009700         10  FILLER          PIC X(9).
009800         10  IX-FS3-ALTER-KEY  PIC X(29).
009900         10  FILLER            PIC X(45).
010000
010100
010200 WORKING-STORAGE SECTION.
010300
010400 01  GRP-0101.
010500     05  FILLER              PIC X(10) VALUE "RECORD-KEY".
010600     05  GRP-0101-KEY        PIC 9(9)  VALUE ZERO.
010700     05  FILLER              PIC X(10) VALUE "END-OF-KEY".
010800
010900 01  GRP-0102.
011000     05  FILLER              PIC X(10) VALUE "ALTERN-KEY".
011100     05  GRP-0102-KEY        PIC 9(9)  VALUE ZERO.
011200     05  FILLER              PIC X(10) VALUE "END-AL-KEY".
011300
011400 01  WRK-CS-09V00            PIC S9(9) COMP VALUE ZERO.
011500
011600 01  EOF-FLAG                PIC 9 VALUE ZERO.
011700
011800 01  RECORDS-IN-ERROR        PIC S9(5) COMP VALUE ZERO.
011900
012000 01  ERROR-FLAG              PIC 9 VALUE ZERO.
012100
012200 01  PERM-ERRORS             PIC S9(5) COMP VALUE ZERO.
012300
012400 01  STATUS-TEST-00          PIC 9 VALUE ZERO.
012500
012600 01  STATUS-TEST-10          PIC 9 VALUE ZERO.
012700 01  STATUS-TEST-READ        PIC 9 VALUE ZERO.
012800
012900 01  IX-FS3-STATUS.
013000     05  IX-FS3-STAT1        PIC X.
013100     05  IX-FS3-STAT2        PIC X.
013200
013300 01  COUNT-OF-RECS           PIC 9(5).
013400
013500 01  COUNT-OF-RECORDS REDEFINES COUNT-OF-RECS  PIC 9(5).
013600
013700 01  FILE-RECORD-INFORMATION-REC.
013800     05  FILE-RECORD-INFO-SKELETON.
013900         10  FILLER          PIC X(48) VALUE
014000              "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
014100         10  FILLER          PIC X(46) VALUE
014200                ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
014300         10  FILLER          PIC X(26) VALUE
014400                                    ",LFIL=000000,ORG=  ,LBLR= ".
014500         10  FILLER          PIC X(37) VALUE
014600                         ",RECKEY=                             ".
014700         10  FILLER          PIC X(38) VALUE
014800                        ",ALTKEY1=                             ".
014900         10  FILLER          PIC X(38) VALUE
015000                        ",ALTKEY2=                             ".
015100         10  FILLER          PIC X(7) VALUE SPACE.
015200     05  FILE-RECORD-INFO             OCCURS 10.
015300         10  FILE-RECORD-INFO-P1-120.
015400             15  FILLER      PIC X(5).
015500             15  XFILE-NAME  PIC X(6).
015600             15  FILLER      PIC X(8).
015700             15  XRECORD-NAME  PIC X(6).
015800             15  FILLER        PIC X(1).
015900             15  REELUNIT-NUMBER  PIC 9(1).
016000             15  FILLER           PIC X(7).
016100             15  XRECORD-NUMBER   PIC 9(6).
016200             15  FILLER           PIC X(6).
016300             15  UPDATE-NUMBER    PIC 9(2).
016400             15  FILLER           PIC X(5).
016500             15  ODO-NUMBER       PIC 9(4).
016600             15  FILLER           PIC X(5).
016700             15  XPROGRAM-NAME    PIC X(5).
016800             15  FILLER           PIC X(7).
016900             15  XRECORD-LENGTH   PIC 9(6).
017000             15  FILLER           PIC X(7).
017100             15  CHARS-OR-RECORDS  PIC X(2).
017200             15  FILLER            PIC X(1).
017300             15  XBLOCK-SIZE       PIC 9(4).
017400             15  FILLER            PIC X(6).
017500             15  RECORDS-IN-FILE   PIC 9(6).
017600             15  FILLER            PIC X(5).
017700             15  XFILE-ORGANIZATION  PIC X(2).
017800             15  FILLER              PIC X(6).
017900             15  XLABEL-TYPE         PIC X(1).
018000         10  FILE-RECORD-INFO-P121-240.
018100             15  FILLER              PIC X(8).
018200             15  XRECORD-KEY         PIC X(29).
018300             15  FILLER              PIC X(9).
018400             15  ALTERNATE-KEY1      PIC X(29).
018500             15  FILLER              PIC X(9).
018600             15  ALTERNATE-KEY2      PIC X(29).
018700             15  FILLER              PIC X(7).
018800
018900 01  TEST-RESULTS.
019000     02 FILLER                   PIC X      VALUE SPACE.
019100     02 FEATURE                  PIC X(20)  VALUE SPACE.
019200     02 FILLER                   PIC X      VALUE SPACE.
019300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
019400     02 FILLER                   PIC X      VALUE SPACE.
019500     02  PAR-NAME.
019600       03 FILLER                 PIC X(19)  VALUE SPACE.
019700       03  PARDOT-X              PIC X      VALUE SPACE.
019800       03 DOTVALUE               PIC 99     VALUE ZERO.
019900     02 FILLER                   PIC X(8)   VALUE SPACE.
020000     02 RE-MARK                  PIC X(61).
020100 01  TEST-COMPUTED.
020200     02 FILLER                   PIC X(30)  VALUE SPACE.
020300     02 FILLER                   PIC X(17)  VALUE
020400            "       COMPUTED=".
020500     02 COMPUTED-X.
020600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
020700     03 COMPUTED-N               REDEFINES COMPUTED-A
020800                                 PIC -9(9).9(9).
020900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
021000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
021100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
021200     03       CM-18V0 REDEFINES COMPUTED-A.
021300         04 COMPUTED-18V0                    PIC -9(18).
021400         04 FILLER                           PIC X.
021500     03 FILLER PIC X(50) VALUE SPACE.
021600 01  TEST-CORRECT.
021700     02 FILLER PIC X(30) VALUE SPACE.
021800     02 FILLER PIC X(17) VALUE "       CORRECT =".
021900     02 CORRECT-X.
022000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
022100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
022200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
022300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
022400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
022500     03      CR-18V0 REDEFINES CORRECT-A.
022600         04 CORRECT-18V0                     PIC -9(18).
022700         04 FILLER                           PIC X.
022800     03 FILLER PIC X(2) VALUE SPACE.
022900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
023000 01  CCVS-C-1.
023100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
023200-    "SS  PARAGRAPH-NAME
023300-    "       REMARKS".
023400     02 FILLER                     PIC X(20)    VALUE SPACE.
023500 01  CCVS-C-2.
023600     02 FILLER                     PIC X        VALUE SPACE.
023700     02 FILLER                     PIC X(6)     VALUE "TESTED".
023800     02 FILLER                     PIC X(15)    VALUE SPACE.
023900     02 FILLER                     PIC X(4)     VALUE "FAIL".
024000     02 FILLER                     PIC X(94)    VALUE SPACE.
024100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
024200 01  REC-CT                        PIC 99       VALUE ZERO.
024300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
024400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
024500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
024600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
024700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
024800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
024900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
025000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
025100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
025200 01  CCVS-H-1.
025300     02  FILLER                    PIC X(39)    VALUE SPACES.
025400     02  FILLER                    PIC X(42)    VALUE
025500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
025600     02  FILLER                    PIC X(39)    VALUE SPACES.
025700 01  CCVS-H-2A.
025800   02  FILLER                        PIC X(40)  VALUE SPACE.
025900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
026000   02  FILLER                        PIC XXXX   VALUE
026100     "4.2 ".
026200   02  FILLER                        PIC X(28)  VALUE
026300            " COPY - NOT FOR DISTRIBUTION".
026400   02  FILLER                        PIC X(41)  VALUE SPACE.
026500
026600 01  CCVS-H-2B.
026700   02  FILLER                        PIC X(15)  VALUE
026800            "TEST RESULT OF ".
026900   02  TEST-ID                       PIC X(9).
027000   02  FILLER                        PIC X(4)   VALUE
027100            " IN ".
027200   02  FILLER                        PIC X(12)  VALUE
027300     " HIGH       ".
027400   02  FILLER                        PIC X(22)  VALUE
027500            " LEVEL VALIDATION FOR ".
027600   02  FILLER                        PIC X(58)  VALUE
027700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027800 01  CCVS-H-3.
027900     02  FILLER                      PIC X(34)  VALUE
028000            " FOR OFFICIAL USE ONLY    ".
028100     02  FILLER                      PIC X(58)  VALUE
028200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
028300     02  FILLER                      PIC X(28)  VALUE
028400            "  COPYRIGHT   1985 ".
028500 01  CCVS-E-1.
028600     02 FILLER                       PIC X(52)  VALUE SPACE.
028700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
028800     02 ID-AGAIN                     PIC X(9).
028900     02 FILLER                       PIC X(45)  VALUE SPACES.
029000 01  CCVS-E-2.
029100     02  FILLER                      PIC X(31)  VALUE SPACE.
029200     02  FILLER                      PIC X(21)  VALUE SPACE.
029300     02 CCVS-E-2-2.
029400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
029500         03 FILLER                   PIC X      VALUE SPACE.
029600         03 ENDER-DESC               PIC X(44)  VALUE
029700            "ERRORS ENCOUNTERED".
029800 01  CCVS-E-3.
029900     02  FILLER                      PIC X(22)  VALUE
030000            " FOR OFFICIAL USE ONLY".
030100     02  FILLER                      PIC X(12)  VALUE SPACE.
030200     02  FILLER                      PIC X(58)  VALUE
030300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
030400     02  FILLER                      PIC X(13)  VALUE SPACE.
030500     02 FILLER                       PIC X(15)  VALUE
030600             " COPYRIGHT 1985".
030700 01  CCVS-E-4.
030800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
030900     02 FILLER                       PIC X(4)   VALUE " OF ".
031000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
031100     02 FILLER                       PIC X(40)  VALUE
031200      "  TESTS WERE EXECUTED SUCCESSFULLY".
031300 01  XXINFO.
031400     02 FILLER                       PIC X(19)  VALUE
031500            "*** INFORMATION ***".
031600     02 INFO-TEXT.
031700       04 FILLER                     PIC X(8)   VALUE SPACE.
031800       04 XXCOMPUTED                 PIC X(20).
031900       04 FILLER                     PIC X(5)   VALUE SPACE.
032000       04 XXCORRECT                  PIC X(20).
032100     02 INF-ANSI-REFERENCE           PIC X(48).
032200 01  HYPHEN-LINE.
032300     02 FILLER  PIC IS X VALUE IS SPACE.
032400     02 FILLER  PIC IS X(65)    VALUE IS "************************
032500-    "*****************************************".
032600     02 FILLER  PIC IS X(54)    VALUE IS "************************
032700-    "******************************".
032800 01  TEST-NO                         PIC 99.
032900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
033000     "IX113A".
033100 PROCEDURE DIVISION.
033200 DECLARATIVES.
033300
033400 SECT-IX105-0002 SECTION.
033500     USE AFTER EXCEPTION PROCEDURE ON IX-FS3.
033600 INPUT-PROCESS.
033700     IF TEST-NO = 5
033800        GO TO D-C-TEST-GF-02-1.
033900     IF STATUS-TEST-10 EQUAL TO 1
034000        IF  IX-FS3-STAT1 EQUAL TO "1"
034100            MOVE 1 TO EOF-FLAG
034200        ELSE
034300           IF  IX-FS3-STAT1 GREATER THAN "1"
034400           MOVE 1 TO PERM-ERRORS.
034500     GO TO DECL-EXIT.
034600 D-C-TEST-GF-02-1.
034700     IF IX-FS3-STATUS EQUAL TO "42"
034800         GO TO D-C-PASS-GF-02-0.
034900 D-C-FAIL-GF-02-0.
035000     MOVE IX-FS3-STATUS TO COMPUTED-A.
035100     MOVE "42" TO CORRECT-X.
035200     MOVE "IX-5, 1.3.4, (5) B" TO RE-MARK.
035300     PERFORM D-FAIL.
035400     GO TO D-C-WRITE-GF-02-0.
035500 D-C-PASS-GF-02-0.
035600     PERFORM D-PASS.
035700 D-C-WRITE-GF-02-0.
035800     PERFORM D-PRINT-DETAIL.
035900 D-CLOSE-FILES.
036000P    OPEN I-O RAW-DATA.
036100P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
036200P    READ RAW-DATA INVALID KEY GO TO D-END-E-2.
036300P    MOVE "OK.     " TO C-ABORT.
036400P    MOVE PASS-COUNTER TO C-OK.
036500P    MOVE ERROR-HOLD   TO C-ALL.
036600P    MOVE ERROR-COUNTER TO C-FAIL.
036700P    MOVE DELETE-COUNTER TO C-DELETED.
036800P    MOVE INSPECT-COUNTER TO C-INSPECT.
036900P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO D-END-E-2.
037000PD-END-E-2.
037100P    CLOSE RAW-DATA.
037200     PERFORM D-END-ROUTINE THRU D-END-ROUTINE-13.
037300     CLOSE PRINT-FILE.
037400 D-TERMINATE-CCVS.
037500S    EXIT PROGRAM.
037600SD-TERMINATE-CALL.
037700     STOP     RUN.
037800 D-PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
037900 D-FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
038000 D-PRINT-DETAIL.
038100     IF   REC-CT NOT EQUAL TO ZERO
038200          MOVE "." TO PARDOT-X
038300          MOVE REC-CT TO DOTVALUE.
038400     MOVE TEST-RESULTS TO PRINT-REC.
038500     PERFORM D-WRITE-LINE.
038600     IF   P-OR-F EQUAL TO "FAIL*"
038700          PERFORM D-WRITE-LINE
038800          PERFORM D-FAIL-ROUTINE THRU D-FAIL-ROUTINE-EX
038900     ELSE
039000          PERFORM D-BAIL-OUT THRU D-BAIL-OUT-EX.
039100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
039200     MOVE SPACE TO CORRECT-X.
039300     IF   REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
039400     MOVE SPACE TO RE-MARK.
039500 D-END-ROUTINE.
039600     MOVE HYPHEN-LINE TO DUMMY-RECORD.
039700     PERFORM D-WRITE-LINE 5 TIMES.
039800 D-END-RTN-EXIT.
039900     MOVE CCVS-E-1 TO DUMMY-RECORD.
040000     PERFORM D-WRITE-LINE 2 TIMES.
040100 D-END-ROUTINE-1.
040200     ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
040300     ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
040400     ADD PASS-COUNTER TO ERROR-HOLD.
040500     MOVE PASS-COUNTER TO CCVS-E-4-1.
040600     MOVE ERROR-HOLD TO CCVS-E-4-2.
040700     MOVE CCVS-E-4 TO CCVS-E-2-2.
040800     MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM D-WRITE-LINE.
040900  D-END-ROUTINE-12.
041000     MOVE "TEST(S) FAILED" TO ENDER-DESC.
041100     IF  ERROR-COUNTER IS EQUAL TO ZERO
041200         MOVE "NO " TO ERROR-TOTAL
041300     ELSE
041400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
041500     MOVE    CCVS-E-2 TO DUMMY-RECORD.
041600     PERFORM D-WRITE-LINE.
041700 D-END-ROUTINE-13.
041800     IF  DELETE-COUNTER IS EQUAL TO ZERO
041900         MOVE "NO " TO ERROR-TOTAL  ELSE
042000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
042100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
042200     MOVE CCVS-E-2 TO DUMMY-RECORD.
042300     PERFORM D-WRITE-LINE.
042400     IF   INSPECT-COUNTER EQUAL TO ZERO
042500          MOVE "NO " TO ERROR-TOTAL
042600     ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
042700     MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
042800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
042900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
043000 D-WRITE-LINE.
043100     ADD 1 TO RECORD-COUNT.
043200Y    IF RECORD-COUNT GREATER 42
043300Y       MOVE DUMMY-RECORD TO DUMMY-HOLD
043400Y       MOVE SPACE TO DUMMY-RECORD
043500Y       WRITE DUMMY-RECORD AFTER ADVANCING PAGE
043600Y       MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
043700Y       MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
043800Y       MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
043900Y       MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
044000Y       MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM D-WRT-LN
044100Y       MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM D-WRT-LN
044200Y       MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM D-WRT-LN
044300Y       MOVE DUMMY-HOLD TO DUMMY-RECORD
044400Y       MOVE ZERO TO RECORD-COUNT.
044500     PERFORM D-WRT-LN.
044600 D-WRT-LN.
044700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
044800     MOVE SPACE TO DUMMY-RECORD.
044900 D-FAIL-ROUTINE.
045000     IF   COMPUTED-X NOT EQUAL TO SPACE
045100          GO TO D-FAIL-ROUTINE-WRITE.
045200     IF   CORRECT-X NOT EQUAL TO SPACE GO TO D-FAIL-ROUTINE-WRITE.
045300     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
045400     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
045500     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
045600     MOVE SPACES TO INF-ANSI-REFERENCE.
045700     GO TO D-FAIL-ROUTINE-EX.
045800 D-FAIL-ROUTINE-WRITE.
045900     MOVE TEST-COMPUTED TO PRINT-REC PERFORM D-WRITE-LINE
046000     MOVE ANSI-REFERENCE TO COR-ANSI-REFERENCE.
046100     MOVE TEST-CORRECT TO PRINT-REC PERFORM D-WRITE-LINE 2 TIMES.
046200     MOVE SPACES TO COR-ANSI-REFERENCE.
046300 D-FAIL-ROUTINE-EX. EXIT.
046400 D-BAIL-OUT.
046500     IF  COMPUTED-A NOT EQUAL TO SPACE GO TO D-BAIL-OUT-WRITE.
046600     IF  CORRECT-A EQUAL TO SPACE GO TO D-BAIL-OUT-EX.
046700 D-BAIL-OUT-WRITE.
046800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
046900     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
047000     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
047100     MOVE SPACES TO INF-ANSI-REFERENCE.
047200 D-BAIL-OUT-EX. EXIT.
047300 DECL-EXIT.  EXIT.
047400 END DECLARATIVES.
047500
047600
047700 CCVS1 SECTION.
047800 OPEN-FILES.
047900P    OPEN I-O RAW-DATA.
048000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
048100P    READ RAW-DATA INVALID KEY GO TO END-E-1.
048200P    MOVE "ABORTED " TO C-ABORT.
048300P    ADD 1 TO C-NO-OF-TESTS.
048400P    ACCEPT C-DATE  FROM DATE.
048500P    ACCEPT C-TIME  FROM TIME.
048600P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
048700PEND-E-1.
048800P    CLOSE RAW-DATA.
048900     OPEN    OUTPUT PRINT-FILE.
049000     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
049100     MOVE    SPACE TO TEST-RESULTS.
049200     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
049300     MOVE    ZERO TO REC-SKL-SUB.
049400     PERFORM CCVS-INIT-FILE 9 TIMES.
049500 CCVS-INIT-FILE.
049600     ADD     1 TO REC-SKL-SUB.
049700     MOVE    FILE-RECORD-INFO-SKELETON
049800          TO FILE-RECORD-INFO (REC-SKL-SUB).
049900 CCVS-INIT-EXIT.
050000     GO TO CCVS1-EXIT.
050100 CLOSE-FILES.
050200P    OPEN I-O RAW-DATA.
050300P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
050400P    READ RAW-DATA INVALID KEY GO TO END-E-2.
050500P    MOVE "OK.     " TO C-ABORT.
050600P    MOVE PASS-COUNTER TO C-OK.
050700P    MOVE ERROR-HOLD   TO C-ALL.
050800P    MOVE ERROR-COUNTER TO C-FAIL.
050900P    MOVE DELETE-COUNTER TO C-DELETED.
051000P    MOVE INSPECT-COUNTER TO C-INSPECT.
051100P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
051200PEND-E-2.
051300P    CLOSE RAW-DATA.
051400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
051500 TERMINATE-CCVS.
051600S    EXIT PROGRAM.
051700STERMINATE-CALL.
051800     STOP     RUN.
051900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
052000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
052100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
052200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
052300     MOVE "****TEST DELETED****" TO RE-MARK.
052400 PRINT-DETAIL.
052500     IF REC-CT NOT EQUAL TO ZERO
052600             MOVE "." TO PARDOT-X
052700             MOVE REC-CT TO DOTVALUE.
052800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
052900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
053000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
053100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
053200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
053300     MOVE SPACE TO CORRECT-X.
053400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
053500     MOVE     SPACE TO RE-MARK.
053600 HEAD-ROUTINE.
053700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
054000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
054100 COLUMN-NAMES-ROUTINE.
054200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
054500 END-ROUTINE.
054600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
054700 END-RTN-EXIT.
054800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054900 END-ROUTINE-1.
055000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
055100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
055200      ADD PASS-COUNTER TO ERROR-HOLD.
055300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
055400      MOVE PASS-COUNTER TO CCVS-E-4-1.
055500      MOVE ERROR-HOLD TO CCVS-E-4-2.
055600      MOVE CCVS-E-4 TO CCVS-E-2-2.
055700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
055800  END-ROUTINE-12.
055900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
056000     IF       ERROR-COUNTER IS EQUAL TO ZERO
056100         MOVE "NO " TO ERROR-TOTAL
056200         ELSE
056300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
056400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
056500     PERFORM WRITE-LINE.
056600 END-ROUTINE-13.
056700     IF DELETE-COUNTER IS EQUAL TO ZERO
056800         MOVE "NO " TO ERROR-TOTAL  ELSE
056900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
057000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
057100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057200      IF   INSPECT-COUNTER EQUAL TO ZERO
057300          MOVE "NO " TO ERROR-TOTAL
057400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
057500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
057600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057800 WRITE-LINE.
057900     ADD 1 TO RECORD-COUNT.
058000Y    IF RECORD-COUNT GREATER 42
058100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
058200Y        MOVE SPACE TO DUMMY-RECORD
058300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
058400Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
058500Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
058600Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
058700Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
058800Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
058900Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
059000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
059100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
059200Y        MOVE ZERO TO RECORD-COUNT.
059300     PERFORM WRT-LN.
059400 WRT-LN.
059500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
059600     MOVE SPACE TO DUMMY-RECORD.
059700 BLANK-LINE-PRINT.
059800     PERFORM WRT-LN.
059900 FAIL-ROUTINE.
060000     IF     COMPUTED-X NOT EQUAL TO SPACE
060100            GO TO   FAIL-ROUTINE-WRITE.
060200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
060300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
060400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
060500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
060600     MOVE   SPACES TO INF-ANSI-REFERENCE.
060700     GO TO  FAIL-ROUTINE-EX.
060800 FAIL-ROUTINE-WRITE.
060900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
061000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
061100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
061200     MOVE   SPACES TO COR-ANSI-REFERENCE.
061300 FAIL-ROUTINE-EX. EXIT.
061400 BAIL-OUT.
061500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
061600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
061700 BAIL-OUT-WRITE.
061800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
061900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
062000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
062100     MOVE   SPACES TO INF-ANSI-REFERENCE.
062200 BAIL-OUT-EX. EXIT.
062300 CCVS1-EXIT.
062400     EXIT.
062500
062600 SECT-IX113A-0003 SECTION.
062700 SEQ-INIT-010.
062800     MOVE ZERO TO TEST-NO.
062900     MOVE "IX-FS3" TO XFILE-NAME (1).
063000     MOVE "R1-F-G" TO XRECORD-NAME (1).
063100     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
063200     MOVE 000240 TO XRECORD-LENGTH (1).
063300     MOVE "RC" TO CHARS-OR-RECORDS (1).
063400     MOVE 0002 TO XBLOCK-SIZE (1).
063500     MOVE 000050 TO RECORDS-IN-FILE (1).
063600     MOVE "IX" TO XFILE-ORGANIZATION (1).
063700     MOVE "S" TO XLABEL-TYPE (1).
063800     MOVE 000001 TO XRECORD-NUMBER (1).
063900     MOVE 0 TO COUNT-OF-RECS.
064000
064100******************************************************************
064200*   TEST  1                                                      *
064300*         OPEN OUTPUT ...                 00 EXPECTED            *
064400*         IX-3, 1.3.4 (1) A                                      *
064500*    STATUS 00 CHECK ON OUTPUT FILE IX-FS3                       *
064600*    THE OUTPUT STATEMENT IS SUCCESSFULLY EXECUTED               *
064700******************************************************************
064800 OPN-INIT-GF-01-0.
064900     MOVE 1 TO STATUS-TEST-00.
065000     MOVE SPACES TO IX-FS3-STATUS.
065100     MOVE "OPEN OUTPUT: 00 EXP." TO FEATURE.
065200     MOVE "OPN-TEST-GF-01-0" TO PAR-NAME.
065300     OPEN
065400        OUTPUT IX-FS3.
065500     IF IX-FS3-STATUS EQUAL TO "00"
065600         GO TO OPN-PASS-GF-01-0.
065700 OPN-FAIL-GF-01-0.
065800     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
065900     PERFORM FAIL.
066000     MOVE IX-FS3-STATUS TO COMPUTED-A.
066100     MOVE "00" TO CORRECT-X.
066200     GO TO OPN-WRITE-GF-01-0.
066300 OPN-PASS-GF-01-0.
066400     PERFORM PASS.
066500 OPN-WRITE-GF-01-0.
066600     PERFORM PRINT-DETAIL.
066700******************************************************************
066800*   TEST  2                                                      *
066900*         WRITE                           00 EXPECTED            *
067000*         IX-3, 1.3.4 (1) A                                      *
067100*    CREATING A INDEXED FILE WITH 50 RECORDS                     *
067200*    KEY:  FROM  000000001 TO 000000050                          *
067300******************************************************************
067400 WRI-INIT-GF-01-0.
067500     MOVE SPACES TO IX-FS3-STATUS.
067600     MOVE 0 TO STATUS-TEST-00.
067700     MOVE "WRITE: 00 EXPECTED" TO FEATURE.
067800     MOVE "WRI-TEST-GF-01-0" TO PAR-NAME.
067900 WRI-TEST-GF-01-0.
068000     MOVE XRECORD-NUMBER (1) TO GRP-0101-KEY, COUNT-OF-RECS.
068100     MOVE GRP-0101 TO XRECORD-KEY (1).
068200     MOVE GRP-0102 TO ALTERNATE-KEY1 (1).
068300*    THE VALUE OF THE ALTERNATE KEY IS 50 TIMES UNCHANGED        *
068400     MOVE FILE-RECORD-INFO (1) TO IX-FS3R1-F-G-240.
068500     WRITE IX-FS3R1-F-G-240.
068600     IF IX-FS3-STATUS  NOT = "00"
068700         MOVE 1 TO STATUS-TEST-00
068800         GO TO WRI-FAIL-GF-01-0.
068900     IF XRECORD-NUMBER (1) EQUAL TO 50
069000         GO TO WRI-TEST-GF-01-1.
069100     ADD 1 TO XRECORD-NUMBER (1).
069200     GO TO WRI-TEST-GF-01-0.
069300 WRI-TEST-GF-01-1.
069400     IF RECORDS-IN-ERROR EQUAL TO ZERO
069500         GO TO WRI-PASS-GF-01-0.
069600     MOVE "ERROR IN CREATING FILE" TO RE-MARK.
069700 WRI-FAIL-GF-01-0.
069800     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
069900     PERFORM FAIL.
070000     MOVE "RECORDS WRITTEN =" TO COMPUTED-A.
070100     GO TO WRI-WRITE-GF-01-0.
070200 WRI-PASS-GF-01-0.
070300     PERFORM PASS.
070400 WRI-WRITE-GF-01-0.
070500     PERFORM PRINT-DETAIL.
070600     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
070700     MOVE "CREATE FILE IX-FS3" TO FEATURE.
070800     MOVE "WRI-TEST-GF-01-1" TO PAR-NAME.
070900     MOVE COUNT-OF-RECS TO CORRECT-18V0.
071000     PERFORM PRINT-DETAIL.
071100
071200******************************************************************
071300*   TEST  4                                                      *
071400*         CLOSE OUTPUT                    00 EXPECTED            *
071500*         IX-3, 1.3.4 (1) A                                      *
071600******************************************************************
071700 CLO-INIT-GF-01-0.
071800     MOVE SPACES TO IX-FS3-STATUS.
071900     MOVE "CLOSE OUTPUT:00 EXP." TO FEATURE.
072000     MOVE "CLO-TEST-GF-01-0" TO PAR-NAME.
072100 CLO-TEST-GF-01-0.
072200     CLOSE IX-FS3.
072300     IF IX-FS3-STATUS = "00"
072400         GO TO CLO-PASS-GF-01-0.
072500 CLO-FAIL-GF-01-0.
072600     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
072700     PERFORM FAIL.
072800     MOVE IX-FS3-STATUS TO COMPUTED-A.
072900     MOVE "00" TO CORRECT-X.
073000     GO TO CLO-WRITE-GF-01-0.
073100 CLO-PASS-GF-01-0.
073200     PERFORM PASS.
073300 CLO-WRITE-GF-01-0.
073400     PERFORM PRINT-DETAIL.
073500
073600******************************************************************
073700*    A INDEXED FILE WITH 50 RECORDS HAS BEEN CREATED.            *
073800******************************************************************
073900
074000******************************************************************
074100*   TEST  5                                                      *
074200*         CLOSE FOR A FILE NOT IN THE OPEN MODE                  *
074300*         FILE STATUS 42 EXPECTED IX-5, 1.3.4 (5) B              *
074400******************************************************************
074500 CLO-TEST-GF-02-0.
074600     MOVE  5 TO TEST-NO.
074700     MOVE SPACES TO IX-FS3-STATUS.
074800     MOVE "CLOSE-INPUT: 42 EXP." TO FEATURE
074900     MOVE "CLO-TEST-GF-02-0" TO PAR-NAME.
075000     CLOSE IX-FS3.
075100 CLO-TEST-GF-02-1.
075200     IF IX-FS3-STATUS EQUAL TO "42"
075300        MOVE "SHOULD HAVE EXECUTED DECLARATIVES IX-3,1.3.4(4)"
075400          TO RE-MARK
075500        GO TO CLO-WRITE-GF-02-0.
075600 CLO-FAIL-GF-02-0.
075700     MOVE "IX-5, 1.3.4, (5) B" TO RE-MARK.
075800 CLO-WRITE-GF-02-0.
075900     MOVE IX-FS3-STATUS TO COMPUTED-A.
076000     MOVE "42" TO CORRECT-X.
076100     PERFORM FAIL.
076200     PERFORM PRINT-DETAIL.
076300
076400 TERMINATE-ROUTINE.
076500     EXIT.
076600
076700 CCVS-EXIT SECTION.
076800 CCVS-999999.
076900     GO TO CLOSE-FILES.
