000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX111A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    1. THE ROUTINE CHECKS THE PERMANENT ERROR CONDITIONS WITH
001500*       UNSUCCESSFUL COMPLETION FOR AN OPEN STATEMENT FOR A FILE
001600*       WHICH IS NOT PRESENT (STATUS CODE 35 EXPECTED).
001700*       THIS PROGRAM USES THE FILE IX-NOP WHICH DOES NOT EXIST.
001800*
001900*    2. THE ROUTINE CHECKS THE FILE STATUS CODES:
002000*           35  -  AFTER OPEN INPUT  (NOT EXISTING FILE)
002100
002200*    3. X-CARDS USED IN THIS PROGRAM (WITH THE OPT CODE):
002300*
002400*                 XXXXX025    (FOR THE NON EXISTING IX-NOP)
002500*                 XXXXX055.
002600*                 XXXXX082.
002700*                 XXXXX083.
002800*
002900*
003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.
003300     XXXXX082.
003400 OBJECT-COMPUTER.
003500     XXXXX083.
003600 INPUT-OUTPUT SECTION.
003700 FILE-CONTROL.
003800     SELECT PRINT-FILE ASSIGN TO
003900     XXXXX055.
004000*
004100     SELECT IX-NOP ASSIGN
004200     XXXXX025
004300     ORGANIZATION IS INDEXED
004400     ACCESS MODE IS SEQUENTIAL
004500     RECORD KEY IS IX-NOP-KEY
004600     FILE STATUS IS IX-NOP-STATUS.
004700
004800
004900 DATA DIVISION.
005000
005100 FILE SECTION.
005200
005300 FD  PRINT-FILE.
005400
005500 01  PRINT-REC               PIC X(120).
005600
005700 01  DUMMY-RECORD            PIC X(120).
005800
005900 FD  IX-NOP
006000C       LABEL RECORD STANDARD
006100C       DATA RECORDS IX-NOPR1-F-G-240
006200        RECORD 240
006300        BLOCK CONTAINS 2 RECORDS.
006400
006500 01  IX-NOPR1-F-G-240.
006600     05  IX-NOP-REC-120      PIC X(120).
006700     05  IX-NOP-REC-120-240.
006800         10  FILLER          PIC X(8).
006900         10  IX-NOP-KEY      PIC X(29).
007000         10  FILLER          PIC X(9).
007100         10  IX-NOP-ALTER-KEY  PIC X(29).
007200         10  FILLER            PIC X(45).
007300
007400
007500 WORKING-STORAGE SECTION.
007600
007700 01  IX-NOP-STATUS           PIC XX.
007800
007900 01  TEST-RESULTS.
008000     02 FILLER                   PIC X      VALUE SPACE.
008100     02 FEATURE                  PIC X(20)  VALUE SPACE.
008200     02 FILLER                   PIC X      VALUE SPACE.
008300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
008400     02 FILLER                   PIC X      VALUE SPACE.
008500     02  PAR-NAME.
008600       03 FILLER                 PIC X(19)  VALUE SPACE.
008700       03  PARDOT-X              PIC X      VALUE SPACE.
008800       03 DOTVALUE               PIC 99     VALUE ZERO.
008900     02 FILLER                   PIC X(8)   VALUE SPACE.
009000     02 RE-MARK                  PIC X(61).
009100 01  TEST-COMPUTED.
009200     02 FILLER                   PIC X(30)  VALUE SPACE.
009300     02 FILLER                   PIC X(17)  VALUE
009400            "       COMPUTED=".
009500     02 COMPUTED-X.
009600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009700     03 COMPUTED-N               REDEFINES COMPUTED-A
009800                                 PIC -9(9).9(9).
009900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
010000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
010100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
010200     03       CM-18V0 REDEFINES COMPUTED-A.
010300         04 COMPUTED-18V0                    PIC -9(18).
010400         04 FILLER                           PIC X.
010500     03 FILLER PIC X(50) VALUE SPACE.
010600 01  TEST-CORRECT.
010700     02 FILLER PIC X(30) VALUE SPACE.
010800     02 FILLER PIC X(17) VALUE "       CORRECT =".
010900     02 CORRECT-X.
011000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
011100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
011200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
011300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
011400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
011500     03      CR-18V0 REDEFINES CORRECT-A.
011600         04 CORRECT-18V0                     PIC -9(18).
011700         04 FILLER                           PIC X.
011800     03 FILLER PIC X(2) VALUE SPACE.
011900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012000 01  CCVS-C-1.
012100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012200-    "SS  PARAGRAPH-NAME
012300-    "       REMARKS".
012400     02 FILLER                     PIC X(20)    VALUE SPACE.
012500 01  CCVS-C-2.
012600     02 FILLER                     PIC X        VALUE SPACE.
012700     02 FILLER                     PIC X(6)     VALUE "TESTED".
012800     02 FILLER                     PIC X(15)    VALUE SPACE.
012900     02 FILLER                     PIC X(4)     VALUE "FAIL".
013000     02 FILLER                     PIC X(94)    VALUE SPACE.
013100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013200 01  REC-CT                        PIC 99       VALUE ZERO.
013300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014200 01  CCVS-H-1.
014300     02  FILLER                    PIC X(39)    VALUE SPACES.
014400     02  FILLER                    PIC X(42)    VALUE
014500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014600     02  FILLER                    PIC X(39)    VALUE SPACES.
014700 01  CCVS-H-2A.
014800   02  FILLER                        PIC X(40)  VALUE SPACE.
014900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015000   02  FILLER                        PIC XXXX   VALUE
015100     "4.2 ".
015200   02  FILLER                        PIC X(28)  VALUE
015300            " COPY - NOT FOR DISTRIBUTION".
015400   02  FILLER                        PIC X(41)  VALUE SPACE.
015500
015600 01  CCVS-H-2B.
015700   02  FILLER                        PIC X(15)  VALUE
015800            "TEST RESULT OF ".
015900   02  TEST-ID                       PIC X(9).
016000   02  FILLER                        PIC X(4)   VALUE
016100            " IN ".
016200   02  FILLER                        PIC X(12)  VALUE
016300     " HIGH       ".
016400   02  FILLER                        PIC X(22)  VALUE
016500            " LEVEL VALIDATION FOR ".
016600   02  FILLER                        PIC X(58)  VALUE
016700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016800 01  CCVS-H-3.
016900     02  FILLER                      PIC X(34)  VALUE
017000            " FOR OFFICIAL USE ONLY    ".
017100     02  FILLER                      PIC X(58)  VALUE
017200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017300     02  FILLER                      PIC X(28)  VALUE
017400            "  COPYRIGHT   1985 ".
017500 01  CCVS-E-1.
017600     02 FILLER                       PIC X(52)  VALUE SPACE.
017700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017800     02 ID-AGAIN                     PIC X(9).
017900     02 FILLER                       PIC X(45)  VALUE SPACES.
018000 01  CCVS-E-2.
018100     02  FILLER                      PIC X(31)  VALUE SPACE.
018200     02  FILLER                      PIC X(21)  VALUE SPACE.
018300     02 CCVS-E-2-2.
018400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018500         03 FILLER                   PIC X      VALUE SPACE.
018600         03 ENDER-DESC               PIC X(44)  VALUE
018700            "ERRORS ENCOUNTERED".
018800 01  CCVS-E-3.
018900     02  FILLER                      PIC X(22)  VALUE
019000            " FOR OFFICIAL USE ONLY".
019100     02  FILLER                      PIC X(12)  VALUE SPACE.
019200     02  FILLER                      PIC X(58)  VALUE
019300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019400     02  FILLER                      PIC X(13)  VALUE SPACE.
019500     02 FILLER                       PIC X(15)  VALUE
019600             " COPYRIGHT 1985".
019700 01  CCVS-E-4.
019800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019900     02 FILLER                       PIC X(4)   VALUE " OF ".
020000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020100     02 FILLER                       PIC X(40)  VALUE
020200      "  TESTS WERE EXECUTED SUCCESSFULLY".
020300 01  XXINFO.
020400     02 FILLER                       PIC X(19)  VALUE
020500            "*** INFORMATION ***".
020600     02 INFO-TEXT.
020700       04 FILLER                     PIC X(8)   VALUE SPACE.
020800       04 XXCOMPUTED                 PIC X(20).
020900       04 FILLER                     PIC X(5)   VALUE SPACE.
021000       04 XXCORRECT                  PIC X(20).
021100     02 INF-ANSI-REFERENCE           PIC X(48).
021200 01  HYPHEN-LINE.
021300     02 FILLER  PIC IS X VALUE IS SPACE.
021400     02 FILLER  PIC IS X(65)    VALUE IS "************************
021500-    "*****************************************".
021600     02 FILLER  PIC IS X(54)    VALUE IS "************************
021700-    "******************************".
021800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021900     "IX111A".
022000 PROCEDURE DIVISION.
022100 DECLARATIVES.
022200
022300 SECT-IX111-0001 SECTION.
022400     USE AFTER EXCEPTION PROCEDURE ON IX-NOP.
022500 INPUT-PROCESS.
022600     IF IX-NOP-STATUS = "35"
022700             PERFORM PASS-DECL
022800             GO TO ABNORMAL-TERM-DECL
022900     ELSE
023000             MOVE "35" TO CORRECT-A
023100             MOVE IX-NOP-STATUS TO COMPUTED-A
023200             MOVE "STATUS FOR OPEN INPUT OF FILE THAT IS NOT
023300-                 "PRESENT INCORRECT" TO RE-MARK
023400             MOVE "IX-2, FILE STATUS" TO ANSI-REFERENCE
023500             PERFORM FAIL-DECL
023600             GO TO ABNORMAL-TERM-DECL
023700     END-IF.
023800
023900 PASS-DECL.
024000     MOVE   "PASS " TO P-OR-F.
024100     ADD     1 TO PASS-COUNTER.
024200     PERFORM PRINT-DETAIL-DECL.
024300*
024400 FAIL-DECL.
024500     MOVE   "FAIL*" TO P-OR-F.
024600     ADD     1 TO ERROR-COUNTER.
024700     PERFORM PRINT-DETAIL-DECL.
024800*
024900 PRINT-DETAIL-DECL.
025000     IF REC-CT NOT EQUAL TO ZERO
025100         MOVE   "." TO PARDOT-X
025200         MOVE   REC-CT TO DOTVALUE.
025300     MOVE    TEST-RESULTS TO PRINT-REC.
025400     PERFORM WRITE-LINE-DECL.
025500     IF P-OR-F EQUAL TO "FAIL*"
025600         PERFORM WRITE-LINE-DECL
025700         PERFORM FAIL-ROUTINE-DECL THRU FAIL-ROUTINE-EX-DECL
025800     ELSE
025900         PERFORM BAIL-OUT-DECL THRU BAIL-OUT-EX-DECL.
026000     MOVE    SPACE TO P-OR-F.
026100     MOVE    SPACE TO COMPUTED-X.
026200     MOVE    SPACE TO CORRECT-X.
026300     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
026400     MOVE    SPACE TO RE-MARK.
026500*
026600 WRITE-LINE-DECL.
026700     ADD     1 TO RECORD-COUNT.
026800     PERFORM WRT-LN-DECL.
026900*
027000 WRT-LN-DECL.
027100     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
027200     MOVE    SPACE TO DUMMY-RECORD.
027300 BLANK-LINE-PRINT-DECL.
027400     PERFORM WRT-LN-DECL.
027500 FAIL-ROUTINE-DECL.
027600     IF COMPUTED-X NOT EQUAL TO SPACE
027700             GO TO FAIL-ROUTINE-WRITE-DECL.
027800     IF CORRECT-X NOT EQUAL TO SPACE
027900             GO TO FAIL-ROUTINE-WRITE-DECL.
028000     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
028100     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
028200     MOVE    XXINFO TO DUMMY-RECORD.
028300     PERFORM WRITE-LINE-DECL 2 TIMES.
028400     MOVE    SPACES TO INF-ANSI-REFERENCE.
028500     GO TO   FAIL-ROUTINE-EX-DECL.
028600 FAIL-ROUTINE-WRITE-DECL.
028700     MOVE    TEST-COMPUTED  TO PRINT-REC
028800     PERFORM WRITE-LINE-DECL
028900     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
029000     MOVE    TEST-CORRECT   TO PRINT-REC
029100     PERFORM WRITE-LINE-DECL 2 TIMES.
029200     MOVE    SPACES         TO COR-ANSI-REFERENCE.
029300 FAIL-ROUTINE-EX-DECL.
029400     EXIT.
029500 BAIL-OUT-DECL.
029600     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE-DECL.
029700     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX-DECL.
029800 BAIL-OUT-WRITE-DECL.
029900     MOVE    CORRECT-A      TO XXCORRECT.
030000     MOVE    COMPUTED-A     TO XXCOMPUTED.
030100     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030200     MOVE    XXINFO TO DUMMY-RECORD.
030300     PERFORM WRITE-LINE-DECL 2 TIMES.
030400     MOVE    SPACES TO INF-ANSI-REFERENCE.
030500 BAIL-OUT-EX-DECL.
030600     EXIT.
030700*
030800 ABNORMAL-TERM-DECL.
030900     MOVE    SPACE TO DUMMY-RECORD.
031000     PERFORM WRITE-LINE-DECL.
031100     MOVE    "ABNORMAL TERMINATION AT THIS POINT IS ACCEPTABLE"
031200                     TO DUMMY-RECORD.
031300     PERFORM WRITE-LINE-DECL 3 TIMES.
031400*
031500 EXIT-DECL.
031600     EXIT.
031700 END DECLARATIVES.
031800
031900
032000 CCVS1 SECTION.
032100 OPEN-FILES.
032200     OPEN    OUTPUT PRINT-FILE.
032300     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
032400     MOVE    SPACE TO TEST-RESULTS.
032500     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
032600     MOVE    ZERO TO REC-SKL-SUB.
032700 CCVS-INIT-EXIT.
032800     GO TO CCVS1-EXIT.
032900 CLOSE-FILES.
033000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
033100 TERMINATE-CCVS.
033200     STOP     RUN.
033300 HEAD-ROUTINE.
033400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
033700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
033800 COLUMN-NAMES-ROUTINE.
033900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
034200 END-ROUTINE.
034300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
034400 END-RTN-EXIT.
034500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034600 END-ROUTINE-1.
034700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
034800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
034900      ADD PASS-COUNTER TO ERROR-HOLD.
035000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
035100      MOVE PASS-COUNTER TO CCVS-E-4-1.
035200      MOVE ERROR-HOLD TO CCVS-E-4-2.
035300      MOVE CCVS-E-4 TO CCVS-E-2-2.
035400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
035500  END-ROUTINE-12.
035600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
035700     IF       ERROR-COUNTER IS EQUAL TO ZERO
035800         MOVE "NO " TO ERROR-TOTAL
035900         ELSE
036000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
036100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
036200     PERFORM WRITE-LINE.
036300 END-ROUTINE-13.
036400     IF DELETE-COUNTER IS EQUAL TO ZERO
036500         MOVE "NO " TO ERROR-TOTAL  ELSE
036600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
036700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
036800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036900      IF   INSPECT-COUNTER EQUAL TO ZERO
037000          MOVE "NO " TO ERROR-TOTAL
037100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
037200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
037300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037500 WRITE-LINE.
037600     ADD 1 TO RECORD-COUNT.
037700Y    IF RECORD-COUNT GREATER 42
037800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
037900Y        MOVE SPACE TO DUMMY-RECORD
038000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
038100Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
038200Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
038300Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
038400Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
038500Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
038600Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
038700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
038800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
038900Y        MOVE ZERO TO RECORD-COUNT.
039000     PERFORM WRT-LN.
039100 WRT-LN.
039200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
039300     MOVE SPACE TO DUMMY-RECORD.
039400 BLANK-LINE-PRINT.
039500     PERFORM WRT-LN.
039600 FAIL-ROUTINE.
039700     IF     COMPUTED-X NOT EQUAL TO SPACE
039800            GO TO   FAIL-ROUTINE-WRITE.
039900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
040000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
040100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
040200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040300     MOVE   SPACES TO INF-ANSI-REFERENCE.
040400     GO TO  FAIL-ROUTINE-EX.
040500 FAIL-ROUTINE-WRITE.
040600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
040700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
040800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
040900     MOVE   SPACES TO COR-ANSI-REFERENCE.
041000 FAIL-ROUTINE-EX. EXIT.
041100 BAIL-OUT.
041200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
041300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
041400 BAIL-OUT-WRITE.
041500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
041600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041800     MOVE   SPACES TO INF-ANSI-REFERENCE.
041900 BAIL-OUT-EX. EXIT.
042000 CCVS1-EXIT.
042100     EXIT.
042200
042300 SECT-IX111A-0003 SECTION.
042400 SEQ-INIT-010.
042500
042600******************************************************************
042700*   TEST  1                                                      *
042800*         OPEN INPUT  (FILE DOES NOT EXIST)   35  EXPECTED       *
042900*         IX-4, 1.3.4 (4) B                                      *
043000******************************************************************
043100 OPN-INIT-GF-01-0.
043200     MOVE SPACES TO IX-NOP-STATUS.
043300     MOVE "OPEN INPUT   35 EXP." TO FEATURE.
043400     MOVE "OPN-TEST-GF-01-0" TO PAR-NAME.
043500 OPN-TEST-GF-01-0.
043600     OPEN
043700        INPUT IX-NOP.
043800
043900 TERMINATE-ROUTINE.
044000     EXIT.
044100
044200 CCVS-EXIT SECTION.
044300 CCVS-999999.
044400     GO TO CLOSE-FILES.
