000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX114A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    THIS ROUTINE USES THE MASS STORAGE FILE IX-FS3 CREATED IN
001500*    IX113A.
001600*    THE FILE IS OPENED I-O AND THE STATUS CHECKED (00 EXPECTED)
001700*    THEN CLOSED AND THE STATUS CHECKED (00 EXPECTED).  AN
001800*    ATTEMPT IS THEN MADE TO READ A RECORD AT WHICH POINT THE
001900*    DECLARATIVES SHOULD BE ACTIONED AND THE STATUS SHOULD BE    *
002000*    47 (IX-5, 1.3.4 (5) F).
002100*
002200*    4. X-CARDS USED IN THIS PROGRAM:
002300*
002400*                 XXXXX024
002500*                 XXXXX055.
002600*         P       XXXXX062.
002700*                 XXXXX082.
002800*                 XXXXX083.
002900*         C       XXXXX084
003000*
003100*
003200 ENVIRONMENT DIVISION.
003300 CONFIGURATION SECTION.
003400 SOURCE-COMPUTER.
003500     XXXXX082.
003600 OBJECT-COMPUTER.
003700     XXXXX083.
003800 INPUT-OUTPUT SECTION.
003900 FILE-CONTROL.
004000P    SELECT RAW-DATA   ASSIGN TO
004100P    XXXXX062
004200P           ORGANIZATION IS INDEXED
004300P           ACCESS MODE IS RANDOM
004400P           RECORD KEY IS RAW-DATA-KEY.
004500*
004600     SELECT PRINT-FILE ASSIGN TO
004700     XXXXX055.
004800*
004900     SELECT IX-FS3 ASSIGN
005000     XXXXX024
005100     ORGANIZATION IS INDEXED
005200     ACCESS MODE IS SEQUENTIAL
005300     RECORD KEY IS IX-FS3-KEY
005400     FILE STATUS IS IX-FS3-STATUS.
005500
005600 DATA DIVISION.
005700
005800 FILE SECTION.
005900P
006000PFD  RAW-DATA.
006100P
006200P01  RAW-DATA-SATZ.
006300P    05  RAW-DATA-KEY        PIC X(6).
006400P    05  C-DATE              PIC 9(6).
006500P    05  C-TIME              PIC 9(8).
006600P    05  C-NO-OF-TESTS       PIC 99.
006700P    05  C-OK                PIC 999.
006800P    05  C-ALL               PIC 999.
006900P    05  C-FAIL              PIC 999.
007000P    05  C-DELETED           PIC 999.
007100P    05  C-INSPECT           PIC 999.
007200P    05  C-NOTE              PIC X(13).
007300P    05  C-INDENT            PIC X.
007400P    05  C-ABORT             PIC X(8).
007500
007600 FD  PRINT-FILE.
007700
007800 01  PRINT-REC               PIC X(120).
007900
008000 01  DUMMY-RECORD            PIC X(120).
008100
008200 FD  IX-FS3
008300C       DATA RECORDS IX-FS3R1-F-G-240
008400C       LABEL RECORD STANDARD
008500        RECORD 240
008600        BLOCK CONTAINS 2 RECORDS.
008700
008800 01  IX-FS3R1-F-G-240.
008900     05  IX-FS3-REC-120      PIC X(120).
009000     05  IX-FS3-REC-120-240.
009100         10  FILLER          PIC X(8).
009200         10  IX-FS3-KEY      PIC X(29).
009300         10  FILLER          PIC X(9).
009400         10  IX-FS3-ALTER-KEY  PIC X(29).
009500         10  FILLER            PIC X(45).
009600
009700
009800 WORKING-STORAGE SECTION.
009900
010000 01  GRP-0101.
010100     05  FILLER              PIC X(10) VALUE "RECORD-KEY".
010200     05  GRP-0101-KEY        PIC 9(9)  VALUE ZERO.
010300     05  FILLER              PIC X(10) VALUE "END-OF-KEY".
010400
010500 01  GRP-0102.
010600     05  FILLER              PIC X(10) VALUE "ALTERN-KEY".
010700     05  GRP-0102-KEY        PIC 9(9)  VALUE ZERO.
010800     05  FILLER              PIC X(10) VALUE "END-AL-KEY".
010900
011000 01  WRK-CS-09V00            PIC S9(9) COMP VALUE ZERO.
011100
011200 01  EOF-FLAG                PIC 9 VALUE ZERO.
011300
011400 01  RECORDS-IN-ERROR        PIC S9(5) COMP VALUE ZERO.
011500
011600 01  ERROR-FLAG              PIC 9 VALUE ZERO.
011700
011800 01  PERM-ERRORS             PIC S9(5) COMP VALUE ZERO.
011900
012000 01  STATUS-TEST-00          PIC 9 VALUE ZERO.
012100
012200 01  STATUS-TEST-10          PIC 9 VALUE ZERO.
012300 01  STATUS-TEST-READ        PIC 9 VALUE ZERO.
012400
012500 01  IX-FS3-STATUS.
012600     05  IX-FS3-STAT1        PIC X.
012700     05  IX-FS3-STAT2        PIC X.
012800
012900 01  COUNT-OF-RECS           PIC 9(5).
013000
013100 01  COUNT-OF-RECORDS REDEFINES COUNT-OF-RECS  PIC 9(5).
013200
013300 01  FILE-RECORD-INFORMATION-REC.
013400     05  FILE-RECORD-INFO-SKELETON.
013500         10  FILLER          PIC X(48) VALUE
013600              "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
013700         10  FILLER          PIC X(46) VALUE
013800                ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
013900         10  FILLER          PIC X(26) VALUE
014000                                    ",LFIL=000000,ORG=  ,LBLR= ".
014100         10  FILLER          PIC X(37) VALUE
014200                         ",RECKEY=                             ".
014300         10  FILLER          PIC X(38) VALUE
014400                        ",ALTKEY1=                             ".
014500         10  FILLER          PIC X(38) VALUE
014600                        ",ALTKEY2=                             ".
014700         10  FILLER          PIC X(7) VALUE SPACE.
014800     05  FILE-RECORD-INFO             OCCURS 10.
014900         10  FILE-RECORD-INFO-P1-120.
015000             15  FILLER      PIC X(5).
015100             15  XFILE-NAME  PIC X(6).
015200             15  FILLER      PIC X(8).
015300             15  XRECORD-NAME  PIC X(6).
015400             15  FILLER        PIC X(1).
015500             15  REELUNIT-NUMBER  PIC 9(1).
015600             15  FILLER           PIC X(7).
015700             15  XRECORD-NUMBER   PIC 9(6).
015800             15  FILLER           PIC X(6).
015900             15  UPDATE-NUMBER    PIC 9(2).
016000             15  FILLER           PIC X(5).
016100             15  ODO-NUMBER       PIC 9(4).
016200             15  FILLER           PIC X(5).
016300             15  XPROGRAM-NAME    PIC X(5).
016400             15  FILLER           PIC X(7).
016500             15  XRECORD-LENGTH   PIC 9(6).
016600             15  FILLER           PIC X(7).
016700             15  CHARS-OR-RECORDS  PIC X(2).
016800             15  FILLER            PIC X(1).
016900             15  XBLOCK-SIZE       PIC 9(4).
017000             15  FILLER            PIC X(6).
017100             15  RECORDS-IN-FILE   PIC 9(6).
017200             15  FILLER            PIC X(5).
017300             15  XFILE-ORGANIZATION  PIC X(2).
017400             15  FILLER              PIC X(6).
017500             15  XLABEL-TYPE         PIC X(1).
017600         10  FILE-RECORD-INFO-P121-240.
017700             15  FILLER              PIC X(8).
017800             15  XRECORD-KEY         PIC X(29).
017900             15  FILLER              PIC X(9).
018000             15  ALTERNATE-KEY1      PIC X(29).
018100             15  FILLER              PIC X(9).
018200             15  ALTERNATE-KEY2      PIC X(29).
018300             15  FILLER              PIC X(7).
018400
018500 01  TEST-RESULTS.
018600     02 FILLER                   PIC X      VALUE SPACE.
018700     02 FEATURE                  PIC X(20)  VALUE SPACE.
018800     02 FILLER                   PIC X      VALUE SPACE.
018900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
019000     02 FILLER                   PIC X      VALUE SPACE.
019100     02  PAR-NAME.
019200       03 FILLER                 PIC X(19)  VALUE SPACE.
019300       03  PARDOT-X              PIC X      VALUE SPACE.
019400       03 DOTVALUE               PIC 99     VALUE ZERO.
019500     02 FILLER                   PIC X(8)   VALUE SPACE.
019600     02 RE-MARK                  PIC X(61).
019700 01  TEST-COMPUTED.
019800     02 FILLER                   PIC X(30)  VALUE SPACE.
019900     02 FILLER                   PIC X(17)  VALUE
020000            "       COMPUTED=".
020100     02 COMPUTED-X.
020200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
020300     03 COMPUTED-N               REDEFINES COMPUTED-A
020400                                 PIC -9(9).9(9).
020500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
020600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
020700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
020800     03       CM-18V0 REDEFINES COMPUTED-A.
020900         04 COMPUTED-18V0                    PIC -9(18).
021000         04 FILLER                           PIC X.
021100     03 FILLER PIC X(50) VALUE SPACE.
021200 01  TEST-CORRECT.
021300     02 FILLER PIC X(30) VALUE SPACE.
021400     02 FILLER PIC X(17) VALUE "       CORRECT =".
021500     02 CORRECT-X.
021600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
021700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
021800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
021900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
022000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
022100     03      CR-18V0 REDEFINES CORRECT-A.
022200         04 CORRECT-18V0                     PIC -9(18).
022300         04 FILLER                           PIC X.
022400     03 FILLER PIC X(2) VALUE SPACE.
022500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
022600 01  CCVS-C-1.
022700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
022800-    "SS  PARAGRAPH-NAME
022900-    "       REMARKS".
023000     02 FILLER                     PIC X(20)    VALUE SPACE.
023100 01  CCVS-C-2.
023200     02 FILLER                     PIC X        VALUE SPACE.
023300     02 FILLER                     PIC X(6)     VALUE "TESTED".
023400     02 FILLER                     PIC X(15)    VALUE SPACE.
023500     02 FILLER                     PIC X(4)     VALUE "FAIL".
023600     02 FILLER                     PIC X(94)    VALUE SPACE.
023700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
023800 01  REC-CT                        PIC 99       VALUE ZERO.
023900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
024000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
024100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
024200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
024300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
024400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
024500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
024600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
024700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
024800 01  CCVS-H-1.
024900     02  FILLER                    PIC X(39)    VALUE SPACES.
025000     02  FILLER                    PIC X(42)    VALUE
025100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
025200     02  FILLER                    PIC X(39)    VALUE SPACES.
025300 01  CCVS-H-2A.
025400   02  FILLER                        PIC X(40)  VALUE SPACE.
025500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
025600   02  FILLER                        PIC XXXX   VALUE
025700     "4.2 ".
025800   02  FILLER                        PIC X(28)  VALUE
025900            " COPY - NOT FOR DISTRIBUTION".
026000   02  FILLER                        PIC X(41)  VALUE SPACE.
026100
026200 01  CCVS-H-2B.
026300   02  FILLER                        PIC X(15)  VALUE
026400            "TEST RESULT OF ".
026500   02  TEST-ID                       PIC X(9).
026600   02  FILLER                        PIC X(4)   VALUE
026700            " IN ".
026800   02  FILLER                        PIC X(12)  VALUE
026900     " HIGH       ".
027000   02  FILLER                        PIC X(22)  VALUE
027100            " LEVEL VALIDATION FOR ".
027200   02  FILLER                        PIC X(58)  VALUE
027300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027400 01  CCVS-H-3.
027500     02  FILLER                      PIC X(34)  VALUE
027600            " FOR OFFICIAL USE ONLY    ".
027700     02  FILLER                      PIC X(58)  VALUE
027800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
027900     02  FILLER                      PIC X(28)  VALUE
028000            "  COPYRIGHT   1985 ".
028100 01  CCVS-E-1.
028200     02 FILLER                       PIC X(52)  VALUE SPACE.
028300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
028400     02 ID-AGAIN                     PIC X(9).
028500     02 FILLER                       PIC X(45)  VALUE SPACES.
028600 01  CCVS-E-2.
028700     02  FILLER                      PIC X(31)  VALUE SPACE.
028800     02  FILLER                      PIC X(21)  VALUE SPACE.
028900     02 CCVS-E-2-2.
029000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
029100         03 FILLER                   PIC X      VALUE SPACE.
029200         03 ENDER-DESC               PIC X(44)  VALUE
029300            "ERRORS ENCOUNTERED".
029400 01  CCVS-E-3.
029500     02  FILLER                      PIC X(22)  VALUE
029600            " FOR OFFICIAL USE ONLY".
029700     02  FILLER                      PIC X(12)  VALUE SPACE.
029800     02  FILLER                      PIC X(58)  VALUE
029900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
030000     02  FILLER                      PIC X(13)  VALUE SPACE.
030100     02 FILLER                       PIC X(15)  VALUE
030200             " COPYRIGHT 1985".
030300 01  CCVS-E-4.
030400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
030500     02 FILLER                       PIC X(4)   VALUE " OF ".
030600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
030700     02 FILLER                       PIC X(40)  VALUE
030800      "  TESTS WERE EXECUTED SUCCESSFULLY".
030900 01  XXINFO.
031000     02 FILLER                       PIC X(19)  VALUE
031100            "*** INFORMATION ***".
031200     02 INFO-TEXT.
031300       04 FILLER                     PIC X(8)   VALUE SPACE.
031400       04 XXCOMPUTED                 PIC X(20).
031500       04 FILLER                     PIC X(5)   VALUE SPACE.
031600       04 XXCORRECT                  PIC X(20).
031700     02 INF-ANSI-REFERENCE           PIC X(48).
031800 01  HYPHEN-LINE.
031900     02 FILLER  PIC IS X VALUE IS SPACE.
032000     02 FILLER  PIC IS X(65)    VALUE IS "************************
032100-    "*****************************************".
032200     02 FILLER  PIC IS X(54)    VALUE IS "************************
032300-    "******************************".
032400 01  TEST-NO                         PIC 99.
032500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
032600     "IX114A".
032700 PROCEDURE DIVISION.
032800 DECLARATIVES.
032900
033000 SECT-IX105-0002 SECTION.
033100     USE AFTER EXCEPTION PROCEDURE ON IX-FS3.
033200 INPUT-PROCESS.
033300     IF TEST-NO = 5
033400        GO TO D-C-TEST-GF-01-1.
033500     IF STATUS-TEST-10 EQUAL TO 1
033600        IF  IX-FS3-STAT1 EQUAL TO "1"
033700            MOVE 1 TO EOF-FLAG
033800        ELSE
033900           IF  IX-FS3-STAT1 GREATER THAN "1"
034000           MOVE 1 TO PERM-ERRORS.
034100     GO TO DECL-EXIT.
034200 D-C-TEST-GF-01-1.
034300     IF IX-FS3-STATUS EQUAL TO "47"
034400         GO TO D-C-PASS-GF-01-0.
034500 D-C-FAIL-GF-01-0.
034600     MOVE IX-FS3-STATUS TO COMPUTED-A.
034700     MOVE "47" TO CORRECT-X.
034800     MOVE "IX-5, 1.3.4, (5) F" TO RE-MARK.
034900     PERFORM D-FAIL.
035000     GO TO D-C-WRITE-GF-01-0.
035100 D-C-PASS-GF-01-0.
035200     PERFORM D-PASS.
035300 D-C-WRITE-GF-01-0.
035400     PERFORM D-PRINT-DETAIL.
035500 D-CLOSE-FILES.
035600P    OPEN I-O RAW-DATA.
035700P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
035800P    READ RAW-DATA INVALID KEY GO TO D-END-E-2.
035900P    MOVE "OK.     " TO C-ABORT.
036000P    MOVE PASS-COUNTER TO C-OK.
036100P    MOVE ERROR-HOLD   TO C-ALL.
036200P    MOVE ERROR-COUNTER TO C-FAIL.
036300P    MOVE DELETE-COUNTER TO C-DELETED.
036400P    MOVE INSPECT-COUNTER TO C-INSPECT.
036500P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO D-END-E-2.
036600PD-END-E-2.
036700P    CLOSE RAW-DATA.
036800     PERFORM D-END-ROUTINE THRU D-END-ROUTINE-13.
036900     CLOSE PRINT-FILE.
037000 D-TERMINATE-CCVS.
037100S    EXIT PROGRAM.
037200SD-TERMINATE-CALL.
037300     STOP     RUN.
037400 D-PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
037500 D-FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
037600 D-PRINT-DETAIL.
037700     IF   REC-CT NOT EQUAL TO ZERO
037800          MOVE "." TO PARDOT-X
037900          MOVE REC-CT TO DOTVALUE.
038000     MOVE TEST-RESULTS TO PRINT-REC.
038100     PERFORM D-WRITE-LINE.
038200     IF   P-OR-F EQUAL TO "FAIL*"
038300          PERFORM D-WRITE-LINE
038400          PERFORM D-FAIL-ROUTINE THRU D-FAIL-ROUTINE-EX
038500     ELSE
038600          PERFORM D-BAIL-OUT THRU D-BAIL-OUT-EX.
038700     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
038800     MOVE SPACE TO CORRECT-X.
038900     IF   REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
039000     MOVE SPACE TO RE-MARK.
039100 D-END-ROUTINE.
039200     MOVE HYPHEN-LINE TO DUMMY-RECORD.
039300     PERFORM D-WRITE-LINE 5 TIMES.
039400 D-END-RTN-EXIT.
039500     MOVE CCVS-E-1 TO DUMMY-RECORD.
039600     PERFORM D-WRITE-LINE 2 TIMES.
039700 D-END-ROUTINE-1.
039800     ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
039900     ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
040000     ADD PASS-COUNTER TO ERROR-HOLD.
040100     MOVE PASS-COUNTER TO CCVS-E-4-1.
040200     MOVE ERROR-HOLD TO CCVS-E-4-2.
040300     MOVE CCVS-E-4 TO CCVS-E-2-2.
040400     MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM D-WRITE-LINE.
040500  D-END-ROUTINE-12.
040600     MOVE "TEST(S) FAILED" TO ENDER-DESC.
040700     IF  ERROR-COUNTER IS EQUAL TO ZERO
040800         MOVE "NO " TO ERROR-TOTAL
040900     ELSE
041000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
041100     MOVE    CCVS-E-2 TO DUMMY-RECORD.
041200     PERFORM D-WRITE-LINE.
041300 D-END-ROUTINE-13.
041400     IF  DELETE-COUNTER IS EQUAL TO ZERO
041500         MOVE "NO " TO ERROR-TOTAL  ELSE
041600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
041700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
041800     MOVE CCVS-E-2 TO DUMMY-RECORD.
041900     PERFORM D-WRITE-LINE.
042000     IF   INSPECT-COUNTER EQUAL TO ZERO
042100          MOVE "NO " TO ERROR-TOTAL
042200     ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
042300     MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
042400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
042500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
042600 D-WRITE-LINE.
042700     ADD 1 TO RECORD-COUNT.
042800Y    IF RECORD-COUNT GREATER 42
042900Y       MOVE DUMMY-RECORD TO DUMMY-HOLD
043000Y       MOVE SPACE TO DUMMY-RECORD
043100Y       WRITE DUMMY-RECORD AFTER ADVANCING PAGE
043200Y       MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
043300Y       MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
043400Y       MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
043500Y       MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
043600Y       MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM D-WRT-LN
043700Y       MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM D-WRT-LN
043800Y       MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM D-WRT-LN
043900Y       MOVE DUMMY-HOLD TO DUMMY-RECORD
044000Y       MOVE ZERO TO RECORD-COUNT.
044100     PERFORM D-WRT-LN.
044200 D-WRT-LN.
044300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
044400     MOVE SPACE TO DUMMY-RECORD.
044500 D-FAIL-ROUTINE.
044600     IF   COMPUTED-X NOT EQUAL TO SPACE
044700          GO TO D-FAIL-ROUTINE-WRITE.
044800     IF   CORRECT-X NOT EQUAL TO SPACE GO TO D-FAIL-ROUTINE-WRITE.
044900     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
045000     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
045100     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
045200     MOVE SPACES TO INF-ANSI-REFERENCE.
045300     GO TO D-FAIL-ROUTINE-EX.
045400 D-FAIL-ROUTINE-WRITE.
045500     MOVE TEST-COMPUTED TO PRINT-REC PERFORM D-WRITE-LINE
045600     MOVE ANSI-REFERENCE TO COR-ANSI-REFERENCE.
045700     MOVE TEST-CORRECT TO PRINT-REC PERFORM D-WRITE-LINE 2 TIMES.
045800     MOVE SPACES TO COR-ANSI-REFERENCE.
045900 D-FAIL-ROUTINE-EX. EXIT.
046000 D-BAIL-OUT.
046100     IF  COMPUTED-A NOT EQUAL TO SPACE GO TO D-BAIL-OUT-WRITE.
046200     IF  CORRECT-A EQUAL TO SPACE GO TO D-BAIL-OUT-EX.
046300 D-BAIL-OUT-WRITE.
046400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
046500     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046600     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
046700     MOVE SPACES TO INF-ANSI-REFERENCE.
046800 D-BAIL-OUT-EX. EXIT.
046900 DECL-EXIT.  EXIT.
047000 END DECLARATIVES.
047100
047200
047300 CCVS1 SECTION.
047400 OPEN-FILES.
047500P    OPEN I-O RAW-DATA.
047600P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
047700P    READ RAW-DATA INVALID KEY GO TO END-E-1.
047800P    MOVE "ABORTED " TO C-ABORT.
047900P    ADD 1 TO C-NO-OF-TESTS.
048000P    ACCEPT C-DATE  FROM DATE.
048100P    ACCEPT C-TIME  FROM TIME.
048200P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
048300PEND-E-1.
048400P    CLOSE RAW-DATA.
048500     OPEN    OUTPUT PRINT-FILE.
048600     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
048700     MOVE    SPACE TO TEST-RESULTS.
048800     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
048900     MOVE    ZERO TO REC-SKL-SUB.
049000     PERFORM CCVS-INIT-FILE 9 TIMES.
049100 CCVS-INIT-FILE.
049200     ADD     1 TO REC-SKL-SUB.
049300     MOVE    FILE-RECORD-INFO-SKELETON
049400          TO FILE-RECORD-INFO (REC-SKL-SUB).
049500 CCVS-INIT-EXIT.
049600     GO TO CCVS1-EXIT.
049700 CLOSE-FILES.
049800P    OPEN I-O RAW-DATA.
049900P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
050000P    READ RAW-DATA INVALID KEY GO TO END-E-2.
050100P    MOVE "OK.     " TO C-ABORT.
050200P    MOVE PASS-COUNTER TO C-OK.
050300P    MOVE ERROR-HOLD   TO C-ALL.
050400P    MOVE ERROR-COUNTER TO C-FAIL.
050500P    MOVE DELETE-COUNTER TO C-DELETED.
050600P    MOVE INSPECT-COUNTER TO C-INSPECT.
050700P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
050800PEND-E-2.
050900P    CLOSE RAW-DATA.
051000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
051100 TERMINATE-CCVS.
051200S    EXIT PROGRAM.
051300STERMINATE-CALL.
051400     STOP     RUN.
051500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
051600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
051700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
051800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
051900     MOVE "****TEST DELETED****" TO RE-MARK.
052000 PRINT-DETAIL.
052100     IF REC-CT NOT EQUAL TO ZERO
052200             MOVE "." TO PARDOT-X
052300             MOVE REC-CT TO DOTVALUE.
052400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
052500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
052600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
052700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
052800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
052900     MOVE SPACE TO CORRECT-X.
053000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
053100     MOVE     SPACE TO RE-MARK.
053200 HEAD-ROUTINE.
053300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
053600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
053700 COLUMN-NAMES-ROUTINE.
053800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
053900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
054100 END-ROUTINE.
054200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
054300 END-RTN-EXIT.
054400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054500 END-ROUTINE-1.
054600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
054700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
054800      ADD PASS-COUNTER TO ERROR-HOLD.
054900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
055000      MOVE PASS-COUNTER TO CCVS-E-4-1.
055100      MOVE ERROR-HOLD TO CCVS-E-4-2.
055200      MOVE CCVS-E-4 TO CCVS-E-2-2.
055300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
055400  END-ROUTINE-12.
055500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
055600     IF       ERROR-COUNTER IS EQUAL TO ZERO
055700         MOVE "NO " TO ERROR-TOTAL
055800         ELSE
055900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
056000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
056100     PERFORM WRITE-LINE.
056200 END-ROUTINE-13.
056300     IF DELETE-COUNTER IS EQUAL TO ZERO
056400         MOVE "NO " TO ERROR-TOTAL  ELSE
056500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
056600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
056700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
056800      IF   INSPECT-COUNTER EQUAL TO ZERO
056900          MOVE "NO " TO ERROR-TOTAL
057000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
057100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
057200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057400 WRITE-LINE.
057500     ADD 1 TO RECORD-COUNT.
057600Y    IF RECORD-COUNT GREATER 42
057700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
057800Y        MOVE SPACE TO DUMMY-RECORD
057900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
058000Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
058100Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
058200Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
058300Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
058400Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
058500Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
058600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
058700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
058800Y        MOVE ZERO TO RECORD-COUNT.
058900     PERFORM WRT-LN.
059000 WRT-LN.
059100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
059200     MOVE SPACE TO DUMMY-RECORD.
059300 BLANK-LINE-PRINT.
059400     PERFORM WRT-LN.
059500 FAIL-ROUTINE.
059600     IF     COMPUTED-X NOT EQUAL TO SPACE
059700            GO TO   FAIL-ROUTINE-WRITE.
059800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
059900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
060000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
060100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
060200     MOVE   SPACES TO INF-ANSI-REFERENCE.
060300     GO TO  FAIL-ROUTINE-EX.
060400 FAIL-ROUTINE-WRITE.
060500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
060600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
060700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
060800     MOVE   SPACES TO COR-ANSI-REFERENCE.
060900 FAIL-ROUTINE-EX. EXIT.
061000 BAIL-OUT.
061100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
061200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
061300 BAIL-OUT-WRITE.
061400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
061500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
061600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
061700     MOVE   SPACES TO INF-ANSI-REFERENCE.
061800 BAIL-OUT-EX. EXIT.
061900 CCVS1-EXIT.
062000     EXIT.
062100
062200 SECT-IX114A-0003 SECTION.
062300 SEQ-INIT-010.
062400     MOVE ZERO TO TEST-NO.
062500     MOVE "IX-FS3" TO XFILE-NAME (1).
062600     MOVE "R1-F-G" TO XRECORD-NAME (1).
062700     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
062800     MOVE 000240 TO XRECORD-LENGTH (1).
062900     MOVE "RC" TO CHARS-OR-RECORDS (1).
063000     MOVE 0002 TO XBLOCK-SIZE (1).
063100     MOVE 000050 TO RECORDS-IN-FILE (1).
063200     MOVE "IX" TO XFILE-ORGANIZATION (1).
063300     MOVE "S" TO XLABEL-TYPE (1).
063400     MOVE 000001 TO XRECORD-NUMBER (1).
063500     MOVE 0 TO COUNT-OF-RECS.
063600
063700******************************************************************
063800*   TEST  1                                                      *
063900*         OPEN OUTPUT ...                 00 EXPECTED            *
064000*         IX-3, 1.3.4 (1) A                                      *
064100*    STATUS 00 CHECK ON OUTPUT FILE IX-FS3                       *
064200*    THE OUTPUT STATEMENT IS SUCCESSFULLY EXECUTED               *
064300******************************************************************
064400 OPN-INIT-GF-01-0.
064500     MOVE 1 TO STATUS-TEST-00.
064600     MOVE SPACES TO IX-FS3-STATUS.
064700     MOVE "OPEN I-O   : 00 EXP." TO FEATURE.
064800     MOVE "OPN-TEST-GF-01-0" TO PAR-NAME.
064900     OPEN
065000        I-O    IX-FS3.
065100     IF IX-FS3-STATUS EQUAL TO "00"
065200         GO TO OPN-PASS-GF-01-0.
065300 OPN-FAIL-GF-01-0.
065400     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
065500     PERFORM FAIL.
065600     MOVE IX-FS3-STATUS TO COMPUTED-A.
065700     MOVE "00" TO CORRECT-X.
065800     GO TO OPN-WRITE-GF-01-0.
065900 OPN-PASS-GF-01-0.
066000     PERFORM PASS.
066100 OPN-WRITE-GF-01-0.
066200     PERFORM PRINT-DETAIL.
066300******************************************************************
066400*   TEST  4                                                      *
066500*         CLOSE I-O                       00 EXPECTED            *
066600*         IX-3, 1.3.4 (1) A                                      *
066700******************************************************************
066800 CLO-INIT-GF-01-0.
066900     MOVE SPACES TO IX-FS3-STATUS.
067000     MOVE "CLOSE I-O   :00 EXP." TO FEATURE.
067100     MOVE "CLO-TEST-GF-01-0" TO PAR-NAME.
067200 CLO-TEST-GF-01-0.
067300     CLOSE IX-FS3.
067400     IF IX-FS3-STATUS = "00"
067500         GO TO CLO-PASS-GF-01-0.
067600 CLO-FAIL-GF-01-0.
067700     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
067800     PERFORM FAIL.
067900     MOVE IX-FS3-STATUS TO COMPUTED-A.
068000     MOVE "00" TO CORRECT-X.
068100     GO TO CLO-WRITE-GF-01-0.
068200 CLO-PASS-GF-01-0.
068300     PERFORM PASS.
068400 CLO-WRITE-GF-01-0.
068500     PERFORM PRINT-DETAIL.
068600
068700******************************************************************
068800*    A INDEXED FILE WITH 50 RECORDS HAS BEEN CREATED.            *
068900******************************************************************
069000
069100******************************************************************
069200*   TEST  5                                                      *
069300*         READ ...  A FILE NOT IN THE OPEN MODE                  *
069400*         FILE STATUS 47 EXPECTED IX-5, 1.3.4 (5) F              *
069500******************************************************************
069600 REA-TEST-GF-01-0.
069700     MOVE  5 TO TEST-NO.
069800     MOVE SPACES TO IX-FS3-STATUS.
069900     MOVE "READ.        47 EXP." TO FEATURE
070000     MOVE "REA-TEST-GF-01-0" TO PAR-NAME.
070100     READ IX-FS3 AT END GO TO REA-TEST-GF-01-1.
070200 REA-TEST-GF-01-1.
070300     IF IX-FS3-STATUS EQUAL TO "47"
070400        MOVE "SHOULD HAVE EXECUTED DECLARATIVES IX-3,1.3.4(4)"
070500          TO RE-MARK
070600        GO TO REA-WRITE-GF-01-0.
070700 REA-FAIL-GF-01-0.
070800     MOVE "IX-5, 1.3.4, (5) F" TO RE-MARK.
070900 REA-WRITE-GF-01-0.
071000     MOVE IX-FS3-STATUS TO COMPUTED-A.
071100     MOVE "47" TO CORRECT-X.
071200     PERFORM FAIL.
071300     PERFORM PRINT-DETAIL.
071400
071500 TERMINATE-ROUTINE.
071600     EXIT.
071700
071800 CCVS-EXIT SECTION.
071900 CCVS-999999.
072000     GO TO CLOSE-FILES.
