000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX115A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    THIS ROUTINE USES THE MASS STORAGE FILE IX-FS3 CREATED IN
001500*    IX113A.
001600*    THE FILE IS OPENED I-O AND THE STATUS CHECKED (00 EXPECTED)
001700*    THEN CLOSED AND THE STATUS CHECKED AGAIN (00 EXPECTED).  AN
001800*    ATTEMPT IS THEN MADE TO WRITE A RECORD TO THE CLOSED FILE
001900*    AT WHICH POINT THE USE AFTER STANDARD EXCEPTION PROCEDURE   *
002000*    STATEMENTS IN THE DECLARATIVES SHOULD BE EXECUTED AND THE
002100*    FILE STATUS SHOULD BE 48 (IX-5, 1.3.4 (5) G.
002200*
002300*    4. X-CARDS USED IN THIS PROGRAM:
002400*
002500*                 XXXXX024
002600*                 XXXXX055.
002700*         P       XXXXX062.
002800*                 XXXXX082.
002900*                 XXXXX083.
003000*         C       XXXXX084
003100*
003200*
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.
003600     XXXXX082.
003700 OBJECT-COMPUTER.
003800     XXXXX083.
003900 INPUT-OUTPUT SECTION.
004000 FILE-CONTROL.
004100P    SELECT RAW-DATA   ASSIGN TO
004200P    XXXXX062
004300P           ORGANIZATION IS INDEXED
004400P           ACCESS MODE IS RANDOM
004500P           RECORD KEY IS RAW-DATA-KEY.
004600*
004700     SELECT PRINT-FILE ASSIGN TO
004800     XXXXX055.
004900*
005000     SELECT IX-FS3 ASSIGN
005100     XXXXX024
005200     ORGANIZATION IS INDEXED
005300     ACCESS MODE IS SEQUENTIAL
005400     RECORD KEY IS IX-FS3-KEY
005500     FILE STATUS IS IX-FS3-STATUS.
005600
005700 DATA DIVISION.
005800
005900 FILE SECTION.
006000P
006100PFD  RAW-DATA.
006200P
006300P01  RAW-DATA-SATZ.
006400P    05  RAW-DATA-KEY        PIC X(6).
006500P    05  C-DATE              PIC 9(6).
006600P    05  C-TIME              PIC 9(8).
006700P    05  C-NO-OF-TESTS       PIC 99.
006800P    05  C-OK                PIC 999.
006900P    05  C-ALL               PIC 999.
007000P    05  C-FAIL              PIC 999.
007100P    05  C-DELETED           PIC 999.
007200P    05  C-INSPECT           PIC 999.
007300P    05  C-NOTE              PIC X(13).
007400P    05  C-INDENT            PIC X.
007500P    05  C-ABORT             PIC X(8).
007600
007700 FD  PRINT-FILE.
007800
007900 01  PRINT-REC               PIC X(120).
008000
008100 01  DUMMY-RECORD            PIC X(120).
008200
008300 FD  IX-FS3
008400C       DATA RECORDS IX-FS3R1-F-G-240
008500C       LABEL RECORD STANDARD
008600        RECORD 240
008700        BLOCK CONTAINS 2 RECORDS.
008800
008900 01  IX-FS3R1-F-G-240.
009000     05  IX-FS3-REC-120      PIC X(120).
009100     05  IX-FS3-REC-120-240.
009200         10  FILLER          PIC X(8).
009300         10  IX-FS3-KEY      PIC X(29).
009400         10  FILLER          PIC X(9).
009500         10  IX-FS3-ALTER-KEY  PIC X(29).
009600         10  FILLER            PIC X(45).
009700
009800
009900 WORKING-STORAGE SECTION.
010000
010100 01  GRP-0101.
010200     05  FILLER              PIC X(10) VALUE "RECORD-KEY".
010300     05  GRP-0101-KEY        PIC 9(9)  VALUE ZERO.
010400     05  FILLER              PIC X(10) VALUE "END-OF-KEY".
010500
010600 01  GRP-0102.
010700     05  FILLER              PIC X(10) VALUE "ALTERN-KEY".
010800     05  GRP-0102-KEY        PIC 9(9)  VALUE ZERO.
010900     05  FILLER              PIC X(10) VALUE "END-AL-KEY".
011000
011100 01  WRK-CS-09V00            PIC S9(9) COMP VALUE ZERO.
011200
011300 01  EOF-FLAG                PIC 9 VALUE ZERO.
011400
011500 01  RECORDS-IN-ERROR        PIC S9(5) COMP VALUE ZERO.
011600
011700 01  ERROR-FLAG              PIC 9 VALUE ZERO.
011800
011900 01  PERM-ERRORS             PIC S9(5) COMP VALUE ZERO.
012000
012100 01  STATUS-TEST-00          PIC 9 VALUE ZERO.
012200
012300 01  STATUS-TEST-10          PIC 9 VALUE ZERO.
012400 01  STATUS-TEST-READ        PIC 9 VALUE ZERO.
012500
012600 01  IX-FS3-STATUS.
012700     05  IX-FS3-STAT1        PIC X.
012800     05  IX-FS3-STAT2        PIC X.
012900
013000 01  COUNT-OF-RECS           PIC 9(5).
013100
013200 01  COUNT-OF-RECORDS REDEFINES COUNT-OF-RECS  PIC 9(5).
013300
013400 01  FILE-RECORD-INFORMATION-REC.
013500     05  FILE-RECORD-INFO-SKELETON.
013600         10  FILLER          PIC X(48) VALUE
013700              "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
013800         10  FILLER          PIC X(46) VALUE
013900                ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
014000         10  FILLER          PIC X(26) VALUE
014100                                    ",LFIL=000000,ORG=  ,LBLR= ".
014200         10  FILLER          PIC X(37) VALUE
014300                         ",RECKEY=                             ".
014400         10  FILLER          PIC X(38) VALUE
014500                        ",ALTKEY1=                             ".
014600         10  FILLER          PIC X(38) VALUE
014700                        ",ALTKEY2=                             ".
014800         10  FILLER          PIC X(7) VALUE SPACE.
014900     05  FILE-RECORD-INFO             OCCURS 10.
015000         10  FILE-RECORD-INFO-P1-120.
015100             15  FILLER      PIC X(5).
015200             15  XFILE-NAME  PIC X(6).
015300             15  FILLER      PIC X(8).
015400             15  XRECORD-NAME  PIC X(6).
015500             15  FILLER        PIC X(1).
015600             15  REELUNIT-NUMBER  PIC 9(1).
015700             15  FILLER           PIC X(7).
015800             15  XRECORD-NUMBER   PIC 9(6).
015900             15  FILLER           PIC X(6).
016000             15  UPDATE-NUMBER    PIC 9(2).
016100             15  FILLER           PIC X(5).
016200             15  ODO-NUMBER       PIC 9(4).
016300             15  FILLER           PIC X(5).
016400             15  XPROGRAM-NAME    PIC X(5).
016500             15  FILLER           PIC X(7).
016600             15  XRECORD-LENGTH   PIC 9(6).
016700             15  FILLER           PIC X(7).
016800             15  CHARS-OR-RECORDS  PIC X(2).
016900             15  FILLER            PIC X(1).
017000             15  XBLOCK-SIZE       PIC 9(4).
017100             15  FILLER            PIC X(6).
017200             15  RECORDS-IN-FILE   PIC 9(6).
017300             15  FILLER            PIC X(5).
017400             15  XFILE-ORGANIZATION  PIC X(2).
017500             15  FILLER              PIC X(6).
017600             15  XLABEL-TYPE         PIC X(1).
017700         10  FILE-RECORD-INFO-P121-240.
017800             15  FILLER              PIC X(8).
017900             15  XRECORD-KEY         PIC X(29).
018000             15  FILLER              PIC X(9).
018100             15  ALTERNATE-KEY1      PIC X(29).
018200             15  FILLER              PIC X(9).
018300             15  ALTERNATE-KEY2      PIC X(29).
018400             15  FILLER              PIC X(7).
018500
018600 01  TEST-RESULTS.
018700     02 FILLER                   PIC X      VALUE SPACE.
018800     02 FEATURE                  PIC X(20)  VALUE SPACE.
018900     02 FILLER                   PIC X      VALUE SPACE.
019000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
019100     02 FILLER                   PIC X      VALUE SPACE.
019200     02  PAR-NAME.
019300       03 FILLER                 PIC X(19)  VALUE SPACE.
019400       03  PARDOT-X              PIC X      VALUE SPACE.
019500       03 DOTVALUE               PIC 99     VALUE ZERO.
019600     02 FILLER                   PIC X(8)   VALUE SPACE.
019700     02 RE-MARK                  PIC X(61).
019800 01  TEST-COMPUTED.
019900     02 FILLER                   PIC X(30)  VALUE SPACE.
020000     02 FILLER                   PIC X(17)  VALUE
020100            "       COMPUTED=".
020200     02 COMPUTED-X.
020300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
020400     03 COMPUTED-N               REDEFINES COMPUTED-A
020500                                 PIC -9(9).9(9).
020600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
020700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
020800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
020900     03       CM-18V0 REDEFINES COMPUTED-A.
021000         04 COMPUTED-18V0                    PIC -9(18).
021100         04 FILLER                           PIC X.
021200     03 FILLER PIC X(50) VALUE SPACE.
021300 01  TEST-CORRECT.
021400     02 FILLER PIC X(30) VALUE SPACE.
021500     02 FILLER PIC X(17) VALUE "       CORRECT =".
021600     02 CORRECT-X.
021700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
021800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
021900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
022000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
022100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
022200     03      CR-18V0 REDEFINES CORRECT-A.
022300         04 CORRECT-18V0                     PIC -9(18).
022400         04 FILLER                           PIC X.
022500     03 FILLER PIC X(2) VALUE SPACE.
022600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
022700 01  CCVS-C-1.
022800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
022900-    "SS  PARAGRAPH-NAME
023000-    "       REMARKS".
023100     02 FILLER                     PIC X(20)    VALUE SPACE.
023200 01  CCVS-C-2.
023300     02 FILLER                     PIC X        VALUE SPACE.
023400     02 FILLER                     PIC X(6)     VALUE "TESTED".
023500     02 FILLER                     PIC X(15)    VALUE SPACE.
023600     02 FILLER                     PIC X(4)     VALUE "FAIL".
023700     02 FILLER                     PIC X(94)    VALUE SPACE.
023800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
023900 01  REC-CT                        PIC 99       VALUE ZERO.
024000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
024100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
024200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
024300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
024400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
024500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
024600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
024700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
024800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
024900 01  CCVS-H-1.
025000     02  FILLER                    PIC X(39)    VALUE SPACES.
025100     02  FILLER                    PIC X(42)    VALUE
025200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
025300     02  FILLER                    PIC X(39)    VALUE SPACES.
025400 01  CCVS-H-2A.
025500   02  FILLER                        PIC X(40)  VALUE SPACE.
025600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
025700   02  FILLER                        PIC XXXX   VALUE
025800     "4.2 ".
025900   02  FILLER                        PIC X(28)  VALUE
026000            " COPY - NOT FOR DISTRIBUTION".
026100   02  FILLER                        PIC X(41)  VALUE SPACE.
026200
026300 01  CCVS-H-2B.
026400   02  FILLER                        PIC X(15)  VALUE
026500            "TEST RESULT OF ".
026600   02  TEST-ID                       PIC X(9).
026700   02  FILLER                        PIC X(4)   VALUE
026800            " IN ".
026900   02  FILLER                        PIC X(12)  VALUE
027000     " HIGH       ".
027100   02  FILLER                        PIC X(22)  VALUE
027200            " LEVEL VALIDATION FOR ".
027300   02  FILLER                        PIC X(58)  VALUE
027400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027500 01  CCVS-H-3.
027600     02  FILLER                      PIC X(34)  VALUE
027700            " FOR OFFICIAL USE ONLY    ".
027800     02  FILLER                      PIC X(58)  VALUE
027900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
028000     02  FILLER                      PIC X(28)  VALUE
028100            "  COPYRIGHT   1985 ".
028200 01  CCVS-E-1.
028300     02 FILLER                       PIC X(52)  VALUE SPACE.
028400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
028500     02 ID-AGAIN                     PIC X(9).
028600     02 FILLER                       PIC X(45)  VALUE SPACES.
028700 01  CCVS-E-2.
028800     02  FILLER                      PIC X(31)  VALUE SPACE.
028900     02  FILLER                      PIC X(21)  VALUE SPACE.
029000     02 CCVS-E-2-2.
029100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
029200         03 FILLER                   PIC X      VALUE SPACE.
029300         03 ENDER-DESC               PIC X(44)  VALUE
029400            "ERRORS ENCOUNTERED".
029500 01  CCVS-E-3.
029600     02  FILLER                      PIC X(22)  VALUE
029700            " FOR OFFICIAL USE ONLY".
029800     02  FILLER                      PIC X(12)  VALUE SPACE.
029900     02  FILLER                      PIC X(58)  VALUE
030000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
030100     02  FILLER                      PIC X(13)  VALUE SPACE.
030200     02 FILLER                       PIC X(15)  VALUE
030300             " COPYRIGHT 1985".
030400 01  CCVS-E-4.
030500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
030600     02 FILLER                       PIC X(4)   VALUE " OF ".
030700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
030800     02 FILLER                       PIC X(40)  VALUE
030900      "  TESTS WERE EXECUTED SUCCESSFULLY".
031000 01  XXINFO.
031100     02 FILLER                       PIC X(19)  VALUE
031200            "*** INFORMATION ***".
031300     02 INFO-TEXT.
031400       04 FILLER                     PIC X(8)   VALUE SPACE.
031500       04 XXCOMPUTED                 PIC X(20).
031600       04 FILLER                     PIC X(5)   VALUE SPACE.
031700       04 XXCORRECT                  PIC X(20).
031800     02 INF-ANSI-REFERENCE           PIC X(48).
031900 01  HYPHEN-LINE.
032000     02 FILLER  PIC IS X VALUE IS SPACE.
032100     02 FILLER  PIC IS X(65)    VALUE IS "************************
032200-    "*****************************************".
032300     02 FILLER  PIC IS X(54)    VALUE IS "************************
032400-    "******************************".
032500 01  TEST-NO                         PIC 99.
032600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
032700     "IX115A".
032800 PROCEDURE DIVISION.
032900 DECLARATIVES.
033000
033100 SECT-IX105-0002 SECTION.
033200     USE AFTER EXCEPTION PROCEDURE ON IX-FS3.
033300 INPUT-PROCESS.
033400     IF TEST-NO = 5
033500        GO TO D-C-TEST-GF-01-1.
033600     IF STATUS-TEST-10 EQUAL TO 1
033700        IF  IX-FS3-STAT1 EQUAL TO "1"
033800            MOVE 1 TO EOF-FLAG
033900        ELSE
034000           IF  IX-FS3-STAT1 GREATER THAN "1"
034100           MOVE 1 TO PERM-ERRORS.
034200     GO TO DECL-EXIT.
034300 D-C-TEST-GF-01-1.
034400     IF IX-FS3-STATUS EQUAL TO "48"
034500         GO TO D-C-PASS-GF-01-0.
034600 D-C-FAIL-GF-01-0.
034700     MOVE IX-FS3-STATUS TO COMPUTED-A.
034800     MOVE "48" TO CORRECT-X.
034900     MOVE "IX-5, 1.3.4, (5) G" TO RE-MARK.
035000     PERFORM D-FAIL.
035100     GO TO D-C-WRITE-GF-01-0.
035200 D-C-PASS-GF-01-0.
035300     PERFORM D-PASS.
035400 D-C-WRITE-GF-01-0.
035500     PERFORM D-PRINT-DETAIL.
035600 D-CLOSE-FILES.
035700P    OPEN I-O RAW-DATA.
035800P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
035900P    READ RAW-DATA INVALID KEY GO TO D-END-E-2.
036000P    MOVE "OK.     " TO C-ABORT.
036100P    MOVE PASS-COUNTER TO C-OK.
036200P    MOVE ERROR-HOLD   TO C-ALL.
036300P    MOVE ERROR-COUNTER TO C-FAIL.
036400P    MOVE DELETE-COUNTER TO C-DELETED.
036500P    MOVE INSPECT-COUNTER TO C-INSPECT.
036600P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO D-END-E-2.
036700PD-END-E-2.
036800P    CLOSE RAW-DATA.
036900     PERFORM D-END-ROUTINE THRU D-END-ROUTINE-13.
037000     CLOSE PRINT-FILE.
037100 D-TERMINATE-CCVS.
037200S    EXIT PROGRAM.
037300SD-TERMINATE-CALL.
037400     STOP     RUN.
037500 D-PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
037600 D-FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
037700 D-PRINT-DETAIL.
037800     IF   REC-CT NOT EQUAL TO ZERO
037900          MOVE "." TO PARDOT-X
038000          MOVE REC-CT TO DOTVALUE.
038100     MOVE TEST-RESULTS TO PRINT-REC.
038200     PERFORM D-WRITE-LINE.
038300     IF   P-OR-F EQUAL TO "FAIL*"
038400          PERFORM D-WRITE-LINE
038500          PERFORM D-FAIL-ROUTINE THRU D-FAIL-ROUTINE-EX
038600     ELSE
038700          PERFORM D-BAIL-OUT THRU D-BAIL-OUT-EX.
038800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
038900     MOVE SPACE TO CORRECT-X.
039000     IF   REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
039100     MOVE SPACE TO RE-MARK.
039200 D-END-ROUTINE.
039300     MOVE HYPHEN-LINE TO DUMMY-RECORD.
039400     PERFORM D-WRITE-LINE 5 TIMES.
039500 D-END-RTN-EXIT.
039600     MOVE CCVS-E-1 TO DUMMY-RECORD.
039700     PERFORM D-WRITE-LINE 2 TIMES.
039800 D-END-ROUTINE-1.
039900     ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
040000     ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
040100     ADD PASS-COUNTER TO ERROR-HOLD.
040200     MOVE PASS-COUNTER TO CCVS-E-4-1.
040300     MOVE ERROR-HOLD TO CCVS-E-4-2.
040400     MOVE CCVS-E-4 TO CCVS-E-2-2.
040500     MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM D-WRITE-LINE.
040600  D-END-ROUTINE-12.
040700     MOVE "TEST(S) FAILED" TO ENDER-DESC.
040800     IF  ERROR-COUNTER IS EQUAL TO ZERO
040900         MOVE "NO " TO ERROR-TOTAL
041000     ELSE
041100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
041200     MOVE    CCVS-E-2 TO DUMMY-RECORD.
041300     PERFORM D-WRITE-LINE.
041400 D-END-ROUTINE-13.
041500     IF  DELETE-COUNTER IS EQUAL TO ZERO
041600         MOVE "NO " TO ERROR-TOTAL  ELSE
041700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
041800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
041900     MOVE CCVS-E-2 TO DUMMY-RECORD.
042000     PERFORM D-WRITE-LINE.
042100     IF   INSPECT-COUNTER EQUAL TO ZERO
042200          MOVE "NO " TO ERROR-TOTAL
042300     ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
042400     MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
042500     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
042600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
042700 D-WRITE-LINE.
042800     ADD 1 TO RECORD-COUNT.
042900Y    IF RECORD-COUNT GREATER 42
043000Y       MOVE DUMMY-RECORD TO DUMMY-HOLD
043100Y       MOVE SPACE TO DUMMY-RECORD
043200Y       WRITE DUMMY-RECORD AFTER ADVANCING PAGE
043300Y       MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
043400Y       MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
043500Y       MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
043600Y       MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
043700Y       MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM D-WRT-LN
043800Y       MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM D-WRT-LN
043900Y       MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM D-WRT-LN
044000Y       MOVE DUMMY-HOLD TO DUMMY-RECORD
044100Y       MOVE ZERO TO RECORD-COUNT.
044200     PERFORM D-WRT-LN.
044300 D-WRT-LN.
044400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
044500     MOVE SPACE TO DUMMY-RECORD.
044600 D-FAIL-ROUTINE.
044700     IF   COMPUTED-X NOT EQUAL TO SPACE
044800          GO TO D-FAIL-ROUTINE-WRITE.
044900     IF   CORRECT-X NOT EQUAL TO SPACE GO TO D-FAIL-ROUTINE-WRITE.
045000     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
045100     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
045200     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
045300     MOVE SPACES TO INF-ANSI-REFERENCE.
045400     GO TO D-FAIL-ROUTINE-EX.
045500 D-FAIL-ROUTINE-WRITE.
045600     MOVE TEST-COMPUTED TO PRINT-REC PERFORM D-WRITE-LINE
045700     MOVE ANSI-REFERENCE TO COR-ANSI-REFERENCE.
045800     MOVE TEST-CORRECT TO PRINT-REC PERFORM D-WRITE-LINE 2 TIMES.
045900     MOVE SPACES TO COR-ANSI-REFERENCE.
046000 D-FAIL-ROUTINE-EX. EXIT.
046100 D-BAIL-OUT.
046200     IF  COMPUTED-A NOT EQUAL TO SPACE GO TO D-BAIL-OUT-WRITE.
046300     IF  CORRECT-A EQUAL TO SPACE GO TO D-BAIL-OUT-EX.
046400 D-BAIL-OUT-WRITE.
046500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
046600     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046700     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
046800     MOVE SPACES TO INF-ANSI-REFERENCE.
046900 D-BAIL-OUT-EX. EXIT.
047000 DECL-EXIT.  EXIT.
047100 END DECLARATIVES.
047200
047300
047400 CCVS1 SECTION.
047500 OPEN-FILES.
047600P    OPEN I-O RAW-DATA.
047700P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
047800P    READ RAW-DATA INVALID KEY GO TO END-E-1.
047900P    MOVE "ABORTED " TO C-ABORT.
048000P    ADD 1 TO C-NO-OF-TESTS.
048100P    ACCEPT C-DATE  FROM DATE.
048200P    ACCEPT C-TIME  FROM TIME.
048300P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
048400PEND-E-1.
048500P    CLOSE RAW-DATA.
048600     OPEN    OUTPUT PRINT-FILE.
048700     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
048800     MOVE    SPACE TO TEST-RESULTS.
048900     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
049000     MOVE    ZERO TO REC-SKL-SUB.
049100     PERFORM CCVS-INIT-FILE 9 TIMES.
049200 CCVS-INIT-FILE.
049300     ADD     1 TO REC-SKL-SUB.
049400     MOVE    FILE-RECORD-INFO-SKELETON
049500          TO FILE-RECORD-INFO (REC-SKL-SUB).
049600 CCVS-INIT-EXIT.
049700     GO TO CCVS1-EXIT.
049800 CLOSE-FILES.
049900P    OPEN I-O RAW-DATA.
050000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
050100P    READ RAW-DATA INVALID KEY GO TO END-E-2.
050200P    MOVE "OK.     " TO C-ABORT.
050300P    MOVE PASS-COUNTER TO C-OK.
050400P    MOVE ERROR-HOLD   TO C-ALL.
050500P    MOVE ERROR-COUNTER TO C-FAIL.
050600P    MOVE DELETE-COUNTER TO C-DELETED.
050700P    MOVE INSPECT-COUNTER TO C-INSPECT.
050800P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
050900PEND-E-2.
051000P    CLOSE RAW-DATA.
051100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
051200 TERMINATE-CCVS.
051300S    EXIT PROGRAM.
051400STERMINATE-CALL.
051500     STOP     RUN.
051600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
051700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
051800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
051900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
052000     MOVE "****TEST DELETED****" TO RE-MARK.
052100 PRINT-DETAIL.
052200     IF REC-CT NOT EQUAL TO ZERO
052300             MOVE "." TO PARDOT-X
052400             MOVE REC-CT TO DOTVALUE.
052500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
052600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
052700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
052800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
052900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
053000     MOVE SPACE TO CORRECT-X.
053100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
053200     MOVE     SPACE TO RE-MARK.
053300 HEAD-ROUTINE.
053400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
053700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
053800 COLUMN-NAMES-ROUTINE.
053900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
054200 END-ROUTINE.
054300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
054400 END-RTN-EXIT.
054500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054600 END-ROUTINE-1.
054700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
054800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
054900      ADD PASS-COUNTER TO ERROR-HOLD.
055000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
055100      MOVE PASS-COUNTER TO CCVS-E-4-1.
055200      MOVE ERROR-HOLD TO CCVS-E-4-2.
055300      MOVE CCVS-E-4 TO CCVS-E-2-2.
055400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
055500  END-ROUTINE-12.
055600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
055700     IF       ERROR-COUNTER IS EQUAL TO ZERO
055800         MOVE "NO " TO ERROR-TOTAL
055900         ELSE
056000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
056100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
056200     PERFORM WRITE-LINE.
056300 END-ROUTINE-13.
056400     IF DELETE-COUNTER IS EQUAL TO ZERO
056500         MOVE "NO " TO ERROR-TOTAL  ELSE
056600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
056700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
056800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
056900      IF   INSPECT-COUNTER EQUAL TO ZERO
057000          MOVE "NO " TO ERROR-TOTAL
057100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
057200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
057300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057500 WRITE-LINE.
057600     ADD 1 TO RECORD-COUNT.
057700Y    IF RECORD-COUNT GREATER 42
057800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
057900Y        MOVE SPACE TO DUMMY-RECORD
058000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
058100Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
058200Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
058300Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
058400Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
058500Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
058600Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
058700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
058800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
058900Y        MOVE ZERO TO RECORD-COUNT.
059000     PERFORM WRT-LN.
059100 WRT-LN.
059200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
059300     MOVE SPACE TO DUMMY-RECORD.
059400 BLANK-LINE-PRINT.
059500     PERFORM WRT-LN.
059600 FAIL-ROUTINE.
059700     IF     COMPUTED-X NOT EQUAL TO SPACE
059800            GO TO   FAIL-ROUTINE-WRITE.
059900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
060000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
060100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
060200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
060300     MOVE   SPACES TO INF-ANSI-REFERENCE.
060400     GO TO  FAIL-ROUTINE-EX.
060500 FAIL-ROUTINE-WRITE.
060600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
060700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
060800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
060900     MOVE   SPACES TO COR-ANSI-REFERENCE.
061000 FAIL-ROUTINE-EX. EXIT.
061100 BAIL-OUT.
061200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
061300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
061400 BAIL-OUT-WRITE.
061500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
061600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
061700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
061800     MOVE   SPACES TO INF-ANSI-REFERENCE.
061900 BAIL-OUT-EX. EXIT.
062000 CCVS1-EXIT.
062100     EXIT.
062200
062300 SECT-IX115A-0003 SECTION.
062400 SEQ-INIT-010.
062500     MOVE ZERO TO TEST-NO.
062600     MOVE "IX-FS3" TO XFILE-NAME (1).
062700     MOVE "R1-F-G" TO XRECORD-NAME (1).
062800     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
062900     MOVE 000240 TO XRECORD-LENGTH (1).
063000     MOVE "RC" TO CHARS-OR-RECORDS (1).
063100     MOVE 0002 TO XBLOCK-SIZE (1).
063200     MOVE 000050 TO RECORDS-IN-FILE (1).
063300     MOVE "IX" TO XFILE-ORGANIZATION (1).
063400     MOVE "S" TO XLABEL-TYPE (1).
063500     MOVE 000001 TO XRECORD-NUMBER (1).
063600     MOVE 0 TO COUNT-OF-RECS.
063700
063800******************************************************************
063900*   TEST  1                                                      *
064000*         OPEN I-O
064100*         IX-3, 1.3.4 (1) A                                      *
064200*    STATUS 00 CHECK ON OUTPUT FILE IX-FS3                       *
064300*    THE OPEN   STATEMENT IS SUCCESSFULLY EXECUTED               *
064400******************************************************************
064500 OPN-INIT-GF-01-0.
064600     MOVE 1 TO STATUS-TEST-00.
064700     MOVE SPACES TO IX-FS3-STATUS.
064800     MOVE "OPEN I-O   : 00 EXP." TO FEATURE.
064900     MOVE "OPN-TEST-GF-01-0" TO PAR-NAME.
065000     OPEN
065100        I-O    IX-FS3.
065200     IF IX-FS3-STATUS EQUAL TO "00"
065300         GO TO OPN-PASS-GF-01-0.
065400 OPN-FAIL-GF-01-0.
065500     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
065600     PERFORM FAIL.
065700     MOVE IX-FS3-STATUS TO COMPUTED-A.
065800     MOVE "00" TO CORRECT-X.
065900     GO TO OPN-WRITE-GF-01-0.
066000 OPN-PASS-GF-01-0.
066100     PERFORM PASS.
066200 OPN-WRITE-GF-01-0.
066300     PERFORM PRINT-DETAIL.
066400******************************************************************
066500*   TEST  4                                                      *
066600*         CLOSE I-O                       00 EXPECTED            *
066700*         IX-3, 1.3.4 (1) A                                      *
066800******************************************************************
066900 CLO-INIT-GF-01-0.
067000     MOVE SPACES TO IX-FS3-STATUS.
067100     MOVE "CLOSE I-O   :00 EXP." TO FEATURE.
067200     MOVE "CLO-TEST-GF-01-0" TO PAR-NAME.
067300 CLO-TEST-GF-01-0.
067400     CLOSE IX-FS3.
067500     IF IX-FS3-STATUS = "00"
067600         GO TO CLO-PASS-GF-01-0.
067700 CLO-FAIL-GF-01-0.
067800     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
067900     PERFORM FAIL.
068000     MOVE IX-FS3-STATUS TO COMPUTED-A.
068100     MOVE "00" TO CORRECT-X.
068200     GO TO CLO-WRITE-GF-01-0.
068300 CLO-PASS-GF-01-0.
068400     PERFORM PASS.
068500 CLO-WRITE-GF-01-0.
068600     PERFORM PRINT-DETAIL.
068700
068800******************************************************************
068900*    A INDEXED FILE WITH 50 RECORDS HAS BEEN CREATED.            *
069000******************************************************************
069100
069200******************************************************************
069300*   TEST  5                                                      *
069400*         WRITE...  A FILE NOT IN THE OPEN MODE                  *
069500*         FILE STATUS 48 EXPECTED IX-5, 1.3.4 (5) G              *
069600******************************************************************
069700 WRI-TEST-GF-01-0.
069800     MOVE  5 TO TEST-NO.
069900     MOVE SPACES TO IX-FS3-STATUS.
070000     MOVE "WRITE.       48 EXP." TO FEATURE
070100     MOVE "WRI-TEST-GF-01-0" TO PAR-NAME.
070200     WRITE IX-FS3R1-F-G-240.
070300 WRI-TEST-GF-01-1.
070400     IF IX-FS3-STATUS EQUAL TO "48"
070500        MOVE "SHOULD HAVE EXECUTED DECLARATIVES IX-3,1.3.4(4)"
070600          TO RE-MARK
070700        GO TO WRI-WRITE-GF-01-0.
070800 WRI-FAIL-GF-01-0.
070900     MOVE "IX-5, 1.3.4, (5) G" TO RE-MARK.
071000 WRI-WRITE-GF-01-0.
071100     MOVE IX-FS3-STATUS TO COMPUTED-A.
071200     MOVE "48" TO CORRECT-X.
071300     PERFORM FAIL.
071400     PERFORM PRINT-DETAIL.
071500
071600 TERMINATE-ROUTINE.
071700     EXIT.
071800
071900 CCVS-EXIT SECTION.
072000 CCVS-999999.
072100     GO TO CLOSE-FILES.
