000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX110A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    1. THE ROUTINE USES THE FILE IX-FS3 WHICH HAS BEEN CREATED
001500*       BY  IX109. THIS FILE IS OPENED IN I-O MODE.
001600
001700*    2. THE ROUTINE CHECKS THE FILE STATUS CODES:
001800*           00  -  AFTER OPEN I-O
001900*           22  -  AFTER WRITE  (DUPLIACATE PRIMARY RECORD KEY)
002000*    00 OR  22  -  AFTER REWRITE  (DUPLIACATE PRIMARY RECORD KEY)
002100*           23  -  AFTER READ  (A NOT EXISTING RECORD KEY)
002200
002300*    3. X-CARDS USED IN THIS PROGRAM (WITH THE OPT CODE):
002400*
002500*                 XXXXX024
002600*                 XXXXX055.
002700*          P      XXXXX062.
002800*                 XXXXX082.
002900*                 XXXXX083.
003000*                 XXXXX084
003100*
003200*
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.
003600     XXXXX082.
003700 OBJECT-COMPUTER.
003800     XXXXX083.
003900 INPUT-OUTPUT SECTION.
004000 FILE-CONTROL.
004100P    SELECT RAW-DATA   ASSIGN TO
004200P    XXXXX062
004300P           ORGANIZATION IS INDEXED
004400P           ACCESS MODE IS RANDOM
004500P           RECORD KEY IS RAW-DATA-KEY.
004600*
004700     SELECT PRINT-FILE ASSIGN TO
004800     XXXXX055.
004900*
005000     SELECT IX-FS3 ASSIGN
005100     XXXXX024
005200     ORGANIZATION IS INDEXED
005300     ACCESS MODE IS RANDOM
005400     RECORD KEY IS IX-FS3-KEY
005500     FILE STATUS IS IX-FS3-STATUS.
005600
005700 DATA DIVISION.
005800
005900 FILE SECTION.
006000P
006100PFD  RAW-DATA.
006200P
006300P01  RAW-DATA-SATZ.
006400P    05  RAW-DATA-KEY        PIC X(6).
006500P    05  C-DATE              PIC 9(6).
006600P    05  C-TIME              PIC 9(8).
006700P    05  C-NO-OF-TESTS       PIC 99.
006800P    05  C-OK                PIC 999.
006900P    05  C-ALL               PIC 999.
007000P    05  C-FAIL              PIC 999.
007100P    05  C-DELETED           PIC 999.
007200P    05  C-INSPECT           PIC 999.
007300P    05  C-NOTE              PIC X(13).
007400P    05  C-INDENT            PIC X.
007500P    05  C-ABORT             PIC X(8).
007600
007700 FD  PRINT-FILE.
007800
007900 01  PRINT-REC               PIC X(120).
008000
008100 01  DUMMY-RECORD            PIC X(120).
008200
008300 FD  IX-FS3
008400C       DATA RECORDS IX-FS3R1-F-G-240
008500C       LABEL RECORD STANDARD
008600        RECORD 240
008700        BLOCK CONTAINS 2 RECORDS.
008800
008900 01  IX-FS3R1-F-G-240.
009000     05  IX-FS3-REC-120      PIC X(120).
009100     05  IX-FS3-REC-120-240.
009200         10  FILLER          PIC X(8).
009300         10  IX-FS3-KEY      PIC X(29).
009400         10  FILLER          PIC X(9).
009500         10  IX-FS3-ALTER-KEY  PIC X(29).
009600         10  FILLER            PIC X(45).
009700
009800
009900 WORKING-STORAGE SECTION.
010000
010100 01  GRP-0101.
010200     05  FILLER              PIC X(10) VALUE "RECORD-KEY".
010300     05  GRP-0101-KEY        PIC 9(9)  VALUE ZERO.
010400     05  FILLER              PIC X(10) VALUE "END-OF-KEY".
010500
010600 01  GRP-0102.
010700     05  FILLER              PIC X(10) VALUE "ALTERN-KEY".
010800     05  GRP-0102-KEY        PIC 9(9)  VALUE ZERO.
010900     05  FILLER              PIC X(10) VALUE "END-AL-KEY".
011000
011100 01  WRK-CS-09V00            PIC S9(9) COMP VALUE ZERO.
011200
011300 01  EOF-FLAG                PIC 9 VALUE ZERO.
011400
011500 01  RECORDS-IN-ERROR        PIC S9(5) COMP VALUE ZERO.
011600
011700 01  ERROR-FLAG              PIC 9 VALUE ZERO.
011800
011900 01  PERM-ERRORS             PIC S9(5) COMP VALUE ZERO.
012000
012100 01  STATUS-TEST-00          PIC 9 VALUE ZERO.
012200
012250 01  STATUS-TEST-10          PIC P VALUE ZERO.
012300
012400 01  IX-FS3-STATUS.
012500     05  IX-FS3-STAT1        PIC X.
012600     05  IX-FS3-STAT2        PIC X.
012700
012800 01  COUNT-OF-RECS           PIC 9(5).
012900
013000 01  COUNT-OF-RECORDS REDEFINES COUNT-OF-RECS  PIC 9(5).
013100
013200 01  FILE-RECORD-INFORMATION-REC.
013300     05  FILE-RECORD-INFO-SKELETON.
013400         10  FILLER          PIC X(48) VALUE
013500              "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
013600         10  FILLER          PIC X(46) VALUE
013700                ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
013800         10  FILLER          PIC X(26) VALUE
013900                                    ",LFIL=000000,ORG=  ,LBLR= ".
014000         10  FILLER          PIC X(37) VALUE
014100                         ",RECKEY=                             ".
014200         10  FILLER          PIC X(38) VALUE
014300                        ",ALTKEY1=                             ".
014400         10  FILLER          PIC X(38) VALUE
014500                        ",ALTKEY2=                             ".
014600         10  FILLER          PIC X(7) VALUE SPACE.
014700     05  FILE-RECORD-INFO             OCCURS 10.
014800         10  FILE-RECORD-INFO-P1-120.
014900             15  FILLER      PIC X(5).
015000             15  XFILE-NAME  PIC X(6).
015100             15  FILLER      PIC X(8).
015200             15  XRECORD-NAME  PIC X(6).
015300             15  FILLER        PIC X(1).
015400             15  REELUNIT-NUMBER  PIC 9(1).
015500             15  FILLER           PIC X(7).
015600             15  XRECORD-NUMBER   PIC 9(6).
015700             15  FILLER           PIC X(6).
015800             15  UPDATE-NUMBER    PIC 9(2).
015900             15  FILLER           PIC X(5).
016000             15  ODO-NUMBER       PIC 9(4).
016100             15  FILLER           PIC X(5).
016200             15  XPROGRAM-NAME    PIC X(5).
016300             15  FILLER           PIC X(7).
016400             15  XRECORD-LENGTH   PIC 9(6).
016500             15  FILLER           PIC X(7).
016600             15  CHARS-OR-RECORDS  PIC X(2).
016700             15  FILLER            PIC X(1).
016800             15  XBLOCK-SIZE       PIC 9(4).
016900             15  FILLER            PIC X(6).
017000             15  RECORDS-IN-FILE   PIC 9(6).
017100             15  FILLER            PIC X(5).
017200             15  XFILE-ORGANIZATION  PIC X(2).
017300             15  FILLER              PIC X(6).
017400             15  XLABEL-TYPE         PIC X(1).
017500         10  FILE-RECORD-INFO-P121-240.
017600             15  FILLER              PIC X(8).
017700             15  XRECORD-KEY         PIC X(29).
017800             15  FILLER              PIC X(9).
017900             15  ALTERNATE-KEY1      PIC X(29).
018000             15  FILLER              PIC X(9).
018100             15  ALTERNATE-KEY2      PIC X(29).
018200             15  FILLER              PIC X(7).
018300
018400 01  TEST-RESULTS.
018500     02 FILLER                   PIC X      VALUE SPACE.
018600     02 FEATURE                  PIC X(20)  VALUE SPACE.
018700     02 FILLER                   PIC X      VALUE SPACE.
018800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
018900     02 FILLER                   PIC X      VALUE SPACE.
019000     02  PAR-NAME.
019100       03 FILLER                 PIC X(19)  VALUE SPACE.
019200       03  PARDOT-X              PIC X      VALUE SPACE.
019300       03 DOTVALUE               PIC 99     VALUE ZERO.
019400     02 FILLER                   PIC X(8)   VALUE SPACE.
019500     02 RE-MARK                  PIC X(61).
019600 01  TEST-COMPUTED.
019700     02 FILLER                   PIC X(30)  VALUE SPACE.
019800     02 FILLER                   PIC X(17)  VALUE
019900            "       COMPUTED=".
020000     02 COMPUTED-X.
020100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
020200     03 COMPUTED-N               REDEFINES COMPUTED-A
020300                                 PIC -9(9).9(9).
020400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
020500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
020600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
020700     03       CM-18V0 REDEFINES COMPUTED-A.
020800         04 COMPUTED-18V0                    PIC -9(18).
020900         04 FILLER                           PIC X.
021000     03 FILLER PIC X(50) VALUE SPACE.
021100 01  TEST-CORRECT.
021200     02 FILLER PIC X(30) VALUE SPACE.
021300     02 FILLER PIC X(17) VALUE "       CORRECT =".
021400     02 CORRECT-X.
021500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
021600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
021700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
021800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
021900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
022000     03      CR-18V0 REDEFINES CORRECT-A.
022100         04 CORRECT-18V0                     PIC -9(18).
022200         04 FILLER                           PIC X.
022300     03 FILLER PIC X(2) VALUE SPACE.
022400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
022500 01  CCVS-C-1.
022600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
022700-    "SS  PARAGRAPH-NAME
022800-    "       REMARKS".
022900     02 FILLER                     PIC X(20)    VALUE SPACE.
023000 01  CCVS-C-2.
023100     02 FILLER                     PIC X        VALUE SPACE.
023200     02 FILLER                     PIC X(6)     VALUE "TESTED".
023300     02 FILLER                     PIC X(15)    VALUE SPACE.
023400     02 FILLER                     PIC X(4)     VALUE "FAIL".
023500     02 FILLER                     PIC X(94)    VALUE SPACE.
023600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
023700 01  REC-CT                        PIC 99       VALUE ZERO.
023800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
023900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
024000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
024100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
024200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
024300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
024400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
024500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
024600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
024700 01  CCVS-H-1.
024800     02  FILLER                    PIC X(39)    VALUE SPACES.
024900     02  FILLER                    PIC X(42)    VALUE
025000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
025100     02  FILLER                    PIC X(39)    VALUE SPACES.
025200 01  CCVS-H-2A.
025300   02  FILLER                        PIC X(40)  VALUE SPACE.
025400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
025500   02  FILLER                        PIC XXXX   VALUE
025600     "4.2 ".
025700   02  FILLER                        PIC X(28)  VALUE
025800            " COPY - NOT FOR DISTRIBUTION".
025900   02  FILLER                        PIC X(41)  VALUE SPACE.
026000
026100 01  CCVS-H-2B.
026200   02  FILLER                        PIC X(15)  VALUE
026300            "TEST RESULT OF ".
026400   02  TEST-ID                       PIC X(9).
026500   02  FILLER                        PIC X(4)   VALUE
026600            " IN ".
026700   02  FILLER                        PIC X(12)  VALUE
026800     " HIGH       ".
026900   02  FILLER                        PIC X(22)  VALUE
027000            " LEVEL VALIDATION FOR ".
027100   02  FILLER                        PIC X(58)  VALUE
027200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027300 01  CCVS-H-3.
027400     02  FILLER                      PIC X(34)  VALUE
027500            " FOR OFFICIAL USE ONLY    ".
027600     02  FILLER                      PIC X(58)  VALUE
027700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
027800     02  FILLER                      PIC X(28)  VALUE
027900            "  COPYRIGHT   1985 ".
028000 01  CCVS-E-1.
028100     02 FILLER                       PIC X(52)  VALUE SPACE.
028200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
028300     02 ID-AGAIN                     PIC X(9).
028400     02 FILLER                       PIC X(45)  VALUE SPACES.
028500 01  CCVS-E-2.
028600     02  FILLER                      PIC X(31)  VALUE SPACE.
028700     02  FILLER                      PIC X(21)  VALUE SPACE.
028800     02 CCVS-E-2-2.
028900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
029000         03 FILLER                   PIC X      VALUE SPACE.
029100         03 ENDER-DESC               PIC X(44)  VALUE
029200            "ERRORS ENCOUNTERED".
029300 01  CCVS-E-3.
029400     02  FILLER                      PIC X(22)  VALUE
029500            " FOR OFFICIAL USE ONLY".
029600     02  FILLER                      PIC X(12)  VALUE SPACE.
029700     02  FILLER                      PIC X(58)  VALUE
029800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029900     02  FILLER                      PIC X(13)  VALUE SPACE.
030000     02 FILLER                       PIC X(15)  VALUE
030100             " COPYRIGHT 1985".
030200 01  CCVS-E-4.
030300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
030400     02 FILLER                       PIC X(4)   VALUE " OF ".
030500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
030600     02 FILLER                       PIC X(40)  VALUE
030700      "  TESTS WERE EXECUTED SUCCESSFULLY".
030800 01  XXINFO.
030900     02 FILLER                       PIC X(19)  VALUE
031000            "*** INFORMATION ***".
031100     02 INFO-TEXT.
031200       04 FILLER                     PIC X(8)   VALUE SPACE.
031300       04 XXCOMPUTED                 PIC X(20).
031400       04 FILLER                     PIC X(5)   VALUE SPACE.
031500       04 XXCORRECT                  PIC X(20).
031600     02 INF-ANSI-REFERENCE           PIC X(48).
031700 01  HYPHEN-LINE.
031800     02 FILLER  PIC IS X VALUE IS SPACE.
031900     02 FILLER  PIC IS X(65)    VALUE IS "************************
032000-    "*****************************************".
032100     02 FILLER  PIC IS X(54)    VALUE IS "************************
032200-    "******************************".
032300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
032400     "IX110A".
032500 PROCEDURE DIVISION.
032600 DECLARATIVES.
032700
032800 SECT-IX110-0002 SECTION.
032900     USE AFTER EXCEPTION PROCEDURE ON IX-FS3.
033000 INPUT-PROCESS.
033100     IF STATUS-TEST-10 EQUAL TO 1
033200        GO TO FINAL-CHECK
033300     ELSE
033400        GO TO DECL-EXIT.
033500 FINAL-CHECK.
033600     IF     IX-FS3-STAT1 EQUAL TO "1"
033700         MOVE 1 TO EOF-FLAG.
033800     IF
033900            IX-FS3-STAT1 GREATER THAN "1"
034000         MOVE 1 TO PERM-ERRORS.
034100 DECL-EXIT.
034200 END DECLARATIVES.
034300
034400
034500 CCVS1 SECTION.
034600 OPEN-FILES.
034700P    OPEN I-O RAW-DATA.
034800P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
034900P    READ RAW-DATA INVALID KEY GO TO END-E-1.
035000P    MOVE "ABORTED " TO C-ABORT.
035100P    ADD 1 TO C-NO-OF-TESTS.
035200P    ACCEPT C-DATE  FROM DATE.
035300P    ACCEPT C-TIME  FROM TIME.
035400P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
035500PEND-E-1.
035600P    CLOSE RAW-DATA.
035700     OPEN    OUTPUT PRINT-FILE.
035800     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
035900     MOVE    SPACE TO TEST-RESULTS.
036000     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
036100     MOVE    ZERO TO REC-SKL-SUB.
036200     PERFORM CCVS-INIT-FILE 9 TIMES.
036300 CCVS-INIT-FILE.
036400     ADD     1 TO REC-SKL-SUB.
036500     MOVE    FILE-RECORD-INFO-SKELETON
036600          TO FILE-RECORD-INFO (REC-SKL-SUB).
036700 CCVS-INIT-EXIT.
036800     GO TO CCVS1-EXIT.
036900 CLOSE-FILES.
037000P    OPEN I-O RAW-DATA.
037100P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
037200P    READ RAW-DATA INVALID KEY GO TO END-E-2.
037300P    MOVE "OK.     " TO C-ABORT.
037400P    MOVE PASS-COUNTER TO C-OK.
037500P    MOVE ERROR-HOLD   TO C-ALL.
037600P    MOVE ERROR-COUNTER TO C-FAIL.
037700P    MOVE DELETE-COUNTER TO C-DELETED.
037800P    MOVE INSPECT-COUNTER TO C-INSPECT.
037900P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
038000PEND-E-2.
038100P    CLOSE RAW-DATA.
038200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
038300 TERMINATE-CCVS.
038400S    EXIT PROGRAM.
038500STERMINATE-CALL.
038600     STOP     RUN.
038700 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
038800 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
038900 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
039000 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
039100     MOVE "****TEST DELETED****" TO RE-MARK.
039200 PRINT-DETAIL.
039300     IF REC-CT NOT EQUAL TO ZERO
039400             MOVE "." TO PARDOT-X
039500             MOVE REC-CT TO DOTVALUE.
039600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
039700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
039800        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
039900          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
040000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
040100     MOVE SPACE TO CORRECT-X.
040200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
040300     MOVE     SPACE TO RE-MARK.
040400 HEAD-ROUTINE.
040500     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040600     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040700     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
040800     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
040900 COLUMN-NAMES-ROUTINE.
041000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
041300 END-ROUTINE.
041400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
041500 END-RTN-EXIT.
041600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041700 END-ROUTINE-1.
041800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
041900      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
042000      ADD PASS-COUNTER TO ERROR-HOLD.
042100*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
042200      MOVE PASS-COUNTER TO CCVS-E-4-1.
042300      MOVE ERROR-HOLD TO CCVS-E-4-2.
042400      MOVE CCVS-E-4 TO CCVS-E-2-2.
042500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
042600  END-ROUTINE-12.
042700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
042800     IF       ERROR-COUNTER IS EQUAL TO ZERO
042900         MOVE "NO " TO ERROR-TOTAL
043000         ELSE
043100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
043200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
043300     PERFORM WRITE-LINE.
043400 END-ROUTINE-13.
043500     IF DELETE-COUNTER IS EQUAL TO ZERO
043600         MOVE "NO " TO ERROR-TOTAL  ELSE
043700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
043800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
043900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
044000      IF   INSPECT-COUNTER EQUAL TO ZERO
044100          MOVE "NO " TO ERROR-TOTAL
044200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
044300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
044400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
044500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
044600 WRITE-LINE.
044700     ADD 1 TO RECORD-COUNT.
044800Y    IF RECORD-COUNT GREATER 42
044900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
045000Y        MOVE SPACE TO DUMMY-RECORD
045100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
045200Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
045300Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
045400Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
045500Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
045600Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
045700Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
045800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
045900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
046000Y        MOVE ZERO TO RECORD-COUNT.
046100     PERFORM WRT-LN.
046200 WRT-LN.
046300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
046400     MOVE SPACE TO DUMMY-RECORD.
046500 BLANK-LINE-PRINT.
046600     PERFORM WRT-LN.
046700 FAIL-ROUTINE.
046800     IF     COMPUTED-X NOT EQUAL TO SPACE
046900            GO TO   FAIL-ROUTINE-WRITE.
047000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
047100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
047200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
047300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
047400     MOVE   SPACES TO INF-ANSI-REFERENCE.
047500     GO TO  FAIL-ROUTINE-EX.
047600 FAIL-ROUTINE-WRITE.
047700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
047800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
047900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
048000     MOVE   SPACES TO COR-ANSI-REFERENCE.
048100 FAIL-ROUTINE-EX. EXIT.
048200 BAIL-OUT.
048300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
048400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
048500 BAIL-OUT-WRITE.
048600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
048700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
048800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
048900     MOVE   SPACES TO INF-ANSI-REFERENCE.
049000 BAIL-OUT-EX. EXIT.
049100 CCVS1-EXIT.
049200     EXIT.
049300
049400 SECT-IX110A-0003 SECTION.
049500 SEQ-INIT-010.
049600
049700******************************************************************
049800*   TEST  1                                                      *
049900*         OPEN I-O                        00 EXPECTED            *
050000*         IX-3, 1.3.4 (1) a                                      *
050100*    STATUS 00 CHECK ON OUTPUT FILE IX-FS3                       *
050200*    THE OUTPUT STATEMENT IS SUCCESSFULLY EXECUTED               *
050300******************************************************************
050400 OPN-INIT-GF-01-0.
050500     MOVE 1 TO STATUS-TEST-00.
050600     MOVE SPACES TO IX-FS3-STATUS.
050700     MOVE "OPEN I-O:    00 EXP." TO FEATURE.
050800     MOVE "OPN-TEST-GF-01-0" TO PAR-NAME.
050900     OPEN
051000        I-O    IX-FS3.
051100     IF IX-FS3-STATUS EQUAL TO "00"
051200         GO TO OPN-PASS-GF-01-0.
051300 OPN-FAIL-GF-01-0.
051400     MOVE "IX-3, 1.3.4, (1) a. " TO RE-MARK.
051500     PERFORM FAIL.
051600     MOVE IX-FS3-STATUS TO COMPUTED-A.
051700     MOVE "00" TO CORRECT-X.
051800     GO TO OPN-WRITE-GF-01-0.
051900 OPN-PASS-GF-01-0.
052000     PERFORM PASS.
052100 OPN-WRITE-GF-01-0.
052200     PERFORM PRINT-DETAIL.
052300
052400******************************************************************
052500*   TEST  2                                                      *
052600*         WRITE     (DUPLICATE PRIME RECORD KEY)  22 EXPECTED    *
052700*         IX-4, 1.3.4 (3) b                                      *
052800*EXISTING KEYS: FROM 000000001 TO 000000050; WRITE: 000000010    *
052900******************************************************************
053000 WRI-INIT-GF-01-0.
053100     MOVE SPACES TO IX-FS3-STATUS.
053200     MOVE 0 TO STATUS-TEST-00.
053300     MOVE "WRITE: (DUP) 22 EXP." TO FEATURE.
053400     MOVE "WRI-TEST-GF-01-0" TO PAR-NAME.
053500 WRI-TEST-GF-01-0.
053600     MOVE SPACES TO IX-FS3-REC-120-240.
053700     MOVE "RECORD-KEY000000010END-OF-KEY" TO IX-FS3-KEY.
053800     WRITE IX-FS3R1-F-G-240.
053900     IF IX-FS3-STATUS      = "22"
054000         MOVE 1 TO STATUS-TEST-00
054100         GO TO WRI-PASS-GF-01-0.
054200 WRI-FAIL-GF-01-0.
054300     MOVE "IX-4, 1.3.4, (3) b. " TO RE-MARK.
054400     PERFORM FAIL.
054500     MOVE  IX-FS3-STATUS      TO COMPUTED-A.
054600     MOVE "22" TO CORRECT-X.
054700     GO TO WRI-WRITE-GF-01-0.
054800 WRI-PASS-GF-01-0.
054900     PERFORM PASS.
055000 WRI-WRITE-GF-01-0.
055100     PERFORM PRINT-DETAIL.
055200
055300******************************************************************
055400*   TEST  3                                                      *
055500*         REWRITE  (DUPLICATE PRIMARY RECORD KEY)   22 EXPECTED  *
055600*         IX-4, 1.3.4 (3) b                                      *
055700*    KEY:        000000049                                       *
055800******************************************************************
055900 RWR-INIT-GF-01-0.
056000     MOVE SPACES TO IX-FS3-STATUS.
056100     MOVE ZERO TO STATUS-TEST-00.
056200     MOVE "REWRITE:00 / 22 EXP." TO FEATURE.
056300     MOVE "RWR-TEST-GF-01-0" TO PAR-NAME.
056400     MOVE "RECORD-KEY000000049END-OF-KEY" TO IX-FS3-KEY.
056500 RWR-TEST-GF-01-0.
056600     READ IX-FS3    INVALID KEY   GO TO RWR-TEST-GF-01-1.
056700     MOVE SPACES TO IX-FS3-REC-120-240.
056800     MOVE "RECORD-KEY000000039END-OF-KEY" TO IX-FS3-KEY.
056900     REWRITE IX-FS3R1-F-G-240 INVALID KEY GO TO RWR-TEST-GF-01-1.
057000 RWR-TEST-GF-01-1.
057100     IF IX-FS3-STATUS  = "00"
057200         GO TO RWR-PASS-GF-01-0.
057300     IF IX-FS3-STATUS  = "22"
057400         GO TO RWR-PASS-GF-01-0.
057500 RWR-FAIL-GF-01-0.
057600     MOVE "IX-4, 1.3.4, (3) b. " TO RE-MARK.
057700     PERFORM FAIL.
057800     MOVE  IX-FS3-STATUS      TO COMPUTED-A.
057900     MOVE "00 OR 22" TO CORRECT-X.
058000     GO TO RWR-WRITE-GF-01-0.
058100 RWR-PASS-GF-01-0.
058200     PERFORM PASS.
058300 RWR-WRITE-GF-01-0.
058400     PERFORM PRINT-DETAIL.
058500
058600******************************************************************
058700*   TEST  4                                                      *
058800*         READ  (A RECORD THAT DOES NOT EXIST)   23 EXPECTED     *
058900*         IX-4, 1.3.4 (3) c 1)     KEY:   000000100              *
059000******************************************************************
059100 REA-INIT-GF-01-0.
059200     MOVE SPACES TO IX-FS3-STATUS.
059300     MOVE "READ:        23 EXP." TO FEATURE.
059400     MOVE "REA-TEST-GF-01-0" TO PAR-NAME.
059500 REA-TEST-GF-01-0.
059600     MOVE "RECORD-KEY000000100END-OF-KEY" TO IX-FS3-KEY.
059700     READ  IX-FS3 INVALID KEY GO TO REA-TEST-GF-01-1.
059800 REA-TEST-GF-01-1.
059900     IF IX-FS3-STATUS = "23"
060000         GO TO REA-PASS-GF-01-0.
060100 REA-FAIL-GF-01-0.
060200     MOVE "IX-3, 1.3.4, (3) c 1)" TO RE-MARK.
060300     PERFORM FAIL.
060400     MOVE IX-FS3-STATUS TO COMPUTED-A.
060500     MOVE "23" TO CORRECT-X.
060600     GO TO REA-WRITE-GF-01-0.
060700 REA-PASS-GF-01-0.
060800     PERFORM PASS.
060900 REA-WRITE-GF-01-0.
061000     PERFORM PRINT-DETAIL.
061100
061200     CLOSE IX-FS3.
061300
061400 TERMINATE-ROUTINE.
061500     EXIT.
061600
061700 CCVS-EXIT SECTION.
061800 CCVS-999999.
061900     GO TO CLOSE-FILES.
