000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX121A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    1.  THE  ROUTINE  CREATES  THE  MASS  STORAGE  FILE  IX-VS2
001500*        CONTAINING  50  RECORDS. EACH BLOCK CONTAINS 2 RECORDS,
001600*        EACH  RECORD  CONTAINS  240 CHARACTERS, ORGANIZATION IS
001700*        INDEXED,  ACCESS  IS SEQUENTIAL. THEN THE FILE IS OPENED
001800*        AS I-O AND IT IS ATTEMTED TO REWRITE A RECORD WITH A
001900*        WRONG RECORD LENGTH.  THE RECORD REWRITTEN IS LONGER
002000*        THAN THE RECORD READ.
002100*
002200*    NOTE: THIS PROGRAM IS A SUPPLEMENT TO PROGRAM IX112A, WHICH
002300*        REWRITES A RECORD SHORTER THAN THE RECORD READ.
002400*
002500*    2. THE ROUTINE READS THE CREATED FILE, VERIFIES IT AND
002600*       CHECKS THE FILE STATUS CODE:
002700*           44  -  AFTER REWRITE   (WITH WRONG RECORD LENGTH)
002800*
002900*    3. X-CARDS USED IN THIS PROGRAM:
003000*
003100*                 XXXXX024
003200*                 XXXXX055.
003300*                 XXXXX062.
003400*                 XXXXX082.
003500*                 XXXXX083.
003600*                 XXXXX084
003700*
003800*
003900 ENVIRONMENT DIVISION.
004000 CONFIGURATION SECTION.
004100 SOURCE-COMPUTER.
004200     XXXXX082.
004300 OBJECT-COMPUTER.
004400     XXXXX083.
004500 INPUT-OUTPUT SECTION.
004600 FILE-CONTROL.
004700P    SELECT RAW-DATA   ASSIGN TO
004800P    XXXXX062
004900P           ORGANIZATION IS INDEXED
005000P           ACCESS MODE IS RANDOM
005100P           RECORD KEY IS RAW-DATA-KEY.
005200*
005300     SELECT PRINT-FILE ASSIGN TO
005400     XXXXX055.
005500*
005600     SELECT IX-VS2 ASSIGN
005700     XXXXX024
005800     ORGANIZATION IS INDEXED
005900     ACCESS MODE IS SEQUENTIAL
006000     RECORD KEY IS IX-VS2-KEY
006100     FILE STATUS IS IX-VS2-STATUS.
006200
006300 DATA DIVISION.
006400
006500 FILE SECTION.
006600P
006700PFD  RAW-DATA.
006800P
006900P01  RAW-DATA-SATZ.
007000P    05  RAW-DATA-KEY        PIC X(6).
007100P    05  C-DATE              PIC 9(6).
007200P    05  C-TIME              PIC 9(8).
007300P    05  C-NO-OF-TESTS       PIC 99.
007400P    05  C-OK                PIC 999.
007500P    05  C-ALL               PIC 999.
007600P    05  C-FAIL              PIC 999.
007700P    05  C-DELETED           PIC 999.
007800P    05  C-INSPECT           PIC 999.
007900P    05  C-NOTE              PIC X(13).
008000P    05  C-INDENT            PIC X.
008100P    05  C-ABORT             PIC X(8).
008200
008300 FD  PRINT-FILE.
008400
008500 01  PRINT-REC               PIC X(120).
008600
008700 01  DUMMY-RECORD            PIC X(120).
008800
008900 FD  IX-VS2
009000C       DATA RECORDS IX-VS2R1-F-G-240 IX-VS2R1-F-G-200
009100C                                     IX-VS2R1-F-G-280
009200C       LABEL RECORD STANDARD
009300        RECORD 200 TO 280
009400        BLOCK CONTAINS 2 RECORDS.
009500
009600 01  IX-VS2R1-F-G-240.
009700     05  IX-VS2-REC-120      PIC X(120).
009800     05  IX-VS2-REC-120-240.
009900         10  FILLER          PIC X(8).
010000         10  IX-VS2-KEY      PIC X(29).
010100         10  FILLER          PIC X(9).
010200         10  IX-VS2-ALTER-KEY  PIC X(29).
010300         10  FILLER            PIC X(45).
010400
010500 01  IX-VS2R1-F-G-200.
010600     05  IX-VS2-REC-SHORT    PIC X(120).
010700     05  IX-VS2-REC-120-200  PIC X(80).
010800
010900 01  IX-VS2R1-F-G-280.
011000     05  IX-VS2-REC-LONG     PIC X(120).
011100     05  IX-VS2-REC-120-239  PIC X(120).
011200     05  IX-VS2-REC-240-280  PIC X(40).
011300
011400 WORKING-STORAGE SECTION.
011500
011600 01  GRP-0101.
011700     05  FILLER              PIC X(10) VALUE "RECORD-KEY".
011800     05  GRP-0101-KEY        PIC 9(9)  VALUE ZERO.
011900     05  FILLER              PIC X(10) VALUE "END-OF-KEY".
012000
012100 01  GRP-0102.
012200     05  FILLER              PIC X(10) VALUE "ALTERN-KEY".
012300     05  GRP-0102-KEY        PIC 9(9)  VALUE ZERO.
012400     05  FILLER              PIC X(10) VALUE "END-AL-KEY".
012500
012600 01  WRK-CS-09V00            PIC S9(9) COMP VALUE ZERO.
012700
012800 01  EOF-FLAG                PIC 9 VALUE ZERO.
012900
013000 01  RECORDS-IN-ERROR        PIC S9(5) COMP VALUE ZERO.
013100
013200 01  ERROR-FLAG              PIC 9 VALUE ZERO.
013300
013400 01  PERM-ERRORS             PIC S9(5) COMP VALUE ZERO.
013500
013600 01  STATUS-TEST-00          PIC 9 VALUE ZERO.
013700
013800 01  STATUS-TEST-10          PIC 9 VALUE ZERO.
013900 01  STATUS-TEST-READ        PIC 9 VALUE ZERO.
014000
014100 01  IX-VS2-STATUS.
014200     05  IX-VS2-STAT1        PIC X.
014300     05  IX-VS2-STAT2        PIC X.
014400
014500 01  COUNT-OF-RECS           PIC 9(5).
014600
014700 01  COUNT-OF-RECORDS REDEFINES COUNT-OF-RECS  PIC 9(5).
014800
014900 01  FILE-RECORD-INFORMATION-REC.
015000     05  FILE-RECORD-INFO-SKELETON.
015100         10  FILLER          PIC X(48) VALUE
015200              "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
015300         10  FILLER          PIC X(46) VALUE
015400                ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
015500         10  FILLER          PIC X(26) VALUE
015600                                    ",LFIL=000000,ORG=  ,LBLR= ".
015700         10  FILLER          PIC X(37) VALUE
015800                         ",RECKEY=                             ".
015900         10  FILLER          PIC X(38) VALUE
016000                        ",ALTKEY1=                             ".
016100         10  FILLER          PIC X(38) VALUE
016200                        ",ALTKEY2=                             ".
016300         10  FILLER          PIC X(7) VALUE SPACE.
016400     05  FILE-RECORD-INFO             OCCURS 10.
016500         10  FILE-RECORD-INFO-P1-120.
016600             15  FILLER      PIC X(5).
016700             15  XFILE-NAME  PIC X(6).
016800             15  FILLER      PIC X(8).
016900             15  XRECORD-NAME  PIC X(6).
017000             15  FILLER        PIC X(1).
017100             15  REELUNIT-NUMBER  PIC 9(1).
017200             15  FILLER           PIC X(7).
017300             15  XRECORD-NUMBER   PIC 9(6).
017400             15  FILLER           PIC X(6).
017500             15  UPDATE-NUMBER    PIC 9(2).
017600             15  FILLER           PIC X(5).
017700             15  ODO-NUMBER       PIC 9(4).
017800             15  FILLER           PIC X(5).
017900             15  XPROGRAM-NAME    PIC X(5).
018000             15  FILLER           PIC X(7).
018100             15  XRECORD-LENGTH   PIC 9(6).
018200             15  FILLER           PIC X(7).
018300             15  CHARS-OR-RECORDS  PIC X(2).
018400             15  FILLER            PIC X(1).
018500             15  XBLOCK-SIZE       PIC 9(4).
018600             15  FILLER            PIC X(6).
018700             15  RECORDS-IN-FILE   PIC 9(6).
018800             15  FILLER            PIC X(5).
018900             15  XFILE-ORGANIZATION  PIC X(2).
019000             15  FILLER              PIC X(6).
019100             15  XLABEL-TYPE         PIC X(1).
019200         10  FILE-RECORD-INFO-P121-240.
019300             15  FILLER              PIC X(8).
019400             15  XRECORD-KEY         PIC X(29).
019500             15  FILLER              PIC X(9).
019600             15  ALTERNATE-KEY1      PIC X(29).
019700             15  FILLER              PIC X(9).
019800             15  ALTERNATE-KEY2      PIC X(29).
019900             15  FILLER              PIC X(7).
020000
020100 01  TEST-RESULTS.
020200     02 FILLER                   PIC X      VALUE SPACE.
020300     02 FEATURE                  PIC X(20)  VALUE SPACE.
020400     02 FILLER                   PIC X      VALUE SPACE.
020500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
020600     02 FILLER                   PIC X      VALUE SPACE.
020700     02  PAR-NAME.
020800       03 FILLER                 PIC X(19)  VALUE SPACE.
020900       03  PARDOT-X              PIC X      VALUE SPACE.
021000       03 DOTVALUE               PIC 99     VALUE ZERO.
021100     02 FILLER                   PIC X(8)   VALUE SPACE.
021200     02 RE-MARK                  PIC X(61).
021300 01  TEST-COMPUTED.
021400     02 FILLER                   PIC X(30)  VALUE SPACE.
021500     02 FILLER                   PIC X(17)  VALUE
021600            "       COMPUTED=".
021700     02 COMPUTED-X.
021800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
021900     03 COMPUTED-N               REDEFINES COMPUTED-A
022000                                 PIC -9(9).9(9).
022100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
022200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
022300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
022400     03       CM-18V0 REDEFINES COMPUTED-A.
022500         04 COMPUTED-18V0                    PIC -9(18).
022600         04 FILLER                           PIC X.
022700     03 FILLER PIC X(50) VALUE SPACE.
022800 01  TEST-CORRECT.
022900     02 FILLER PIC X(30) VALUE SPACE.
023000     02 FILLER PIC X(17) VALUE "       CORRECT =".
023100     02 CORRECT-X.
023200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
023300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
023400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
023500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
023600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
023700     03      CR-18V0 REDEFINES CORRECT-A.
023800         04 CORRECT-18V0                     PIC -9(18).
023900         04 FILLER                           PIC X.
024000     03 FILLER PIC X(2) VALUE SPACE.
024100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
024200 01  CCVS-C-1.
024300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
024400-    "SS  PARAGRAPH-NAME
024500-    "       REMARKS".
024600     02 FILLER                     PIC X(20)    VALUE SPACE.
024700 01  CCVS-C-2.
024800     02 FILLER                     PIC X        VALUE SPACE.
024900     02 FILLER                     PIC X(6)     VALUE "TESTED".
025000     02 FILLER                     PIC X(15)    VALUE SPACE.
025100     02 FILLER                     PIC X(4)     VALUE "FAIL".
025200     02 FILLER                     PIC X(94)    VALUE SPACE.
025300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
025400 01  REC-CT                        PIC 99       VALUE ZERO.
025500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
025600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
025700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
025800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
025900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
026000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
026100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
026200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
026300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
026400 01  CCVS-H-1.
026500     02  FILLER                    PIC X(39)    VALUE SPACES.
026600     02  FILLER                    PIC X(42)    VALUE
026700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
026800     02  FILLER                    PIC X(39)    VALUE SPACES.
026900 01  CCVS-H-2A.
027000   02  FILLER                        PIC X(40)  VALUE SPACE.
027100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
027200   02  FILLER                        PIC XXXX   VALUE
027300     "4.2 ".
027400   02  FILLER                        PIC X(28)  VALUE
027500            " COPY - NOT FOR DISTRIBUTION".
027600   02  FILLER                        PIC X(41)  VALUE SPACE.
027700
027800 01  CCVS-H-2B.
027900   02  FILLER                        PIC X(15)  VALUE
028000            "TEST RESULT OF ".
028100   02  TEST-ID                       PIC X(9).
028200   02  FILLER                        PIC X(4)   VALUE
028300            " IN ".
028400   02  FILLER                        PIC X(12)  VALUE
028500     " HIGH       ".
028600   02  FILLER                        PIC X(22)  VALUE
028700            " LEVEL VALIDATION FOR ".
028800   02  FILLER                        PIC X(58)  VALUE
028900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029000 01  CCVS-H-3.
029100     02  FILLER                      PIC X(34)  VALUE
029200            " FOR OFFICIAL USE ONLY    ".
029300     02  FILLER                      PIC X(58)  VALUE
029400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
029500     02  FILLER                      PIC X(28)  VALUE
029600            "  COPYRIGHT   1985 ".
029700 01  CCVS-E-1.
029800     02 FILLER                       PIC X(52)  VALUE SPACE.
029900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
030000     02 ID-AGAIN                     PIC X(9).
030100     02 FILLER                       PIC X(45)  VALUE SPACES.
030200 01  CCVS-E-2.
030300     02  FILLER                      PIC X(31)  VALUE SPACE.
030400     02  FILLER                      PIC X(21)  VALUE SPACE.
030500     02 CCVS-E-2-2.
030600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
030700         03 FILLER                   PIC X      VALUE SPACE.
030800         03 ENDER-DESC               PIC X(44)  VALUE
030900            "ERRORS ENCOUNTERED".
031000 01  CCVS-E-3.
031100     02  FILLER                      PIC X(22)  VALUE
031200            " FOR OFFICIAL USE ONLY".
031300     02  FILLER                      PIC X(12)  VALUE SPACE.
031400     02  FILLER                      PIC X(58)  VALUE
031500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
031600     02  FILLER                      PIC X(13)  VALUE SPACE.
031700     02 FILLER                       PIC X(15)  VALUE
031800             " COPYRIGHT 1985".
031900 01  CCVS-E-4.
032000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
032100     02 FILLER                       PIC X(4)   VALUE " OF ".
032200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
032300     02 FILLER                       PIC X(40)  VALUE
032400      "  TESTS WERE EXECUTED SUCCESSFULLY".
032500 01  XXINFO.
032600     02 FILLER                       PIC X(19)  VALUE
032700            "*** INFORMATION ***".
032800     02 INFO-TEXT.
032900       04 FILLER                     PIC X(8)   VALUE SPACE.
033000       04 XXCOMPUTED                 PIC X(20).
033100       04 FILLER                     PIC X(5)   VALUE SPACE.
033200       04 XXCORRECT                  PIC X(20).
033300     02 INF-ANSI-REFERENCE           PIC X(48).
033400 01  HYPHEN-LINE.
033500     02 FILLER  PIC IS X VALUE IS SPACE.
033600     02 FILLER  PIC IS X(65)    VALUE IS "************************
033700-    "*****************************************".
033800     02 FILLER  PIC IS X(54)    VALUE IS "************************
033900-    "******************************".
034000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
034100     "IX121A".
034200 01 TEST-NUMBER                      PIC 9 VALUE ZERO.
034300
034400 PROCEDURE DIVISION.
034500 DECLARATIVES.
034600
034700 SECT-IX105-0002 SECTION.
034800     USE AFTER EXCEPTION PROCEDURE ON IX-VS2.
034900 INPUT-PROCESS.
035000         MOVE 1 TO PERM-ERRORS.
035100         IF TEST-NUMBER NOT = 3 GO TO END-DECL.
035200 D-RWR-TEST-GF-01-1.
035300     IF IX-VS2-STATUS  = "00"
035400         GO TO D-RWR-PASS-GF-01-0.
035500     IF IX-VS2-STATUS  = "44"
035600         GO TO D-RWR-PASS-GF-01-0.
035700 D-RWR-FAIL-GF-01-0.
035800     MOVE "IX-5, 1.3.4, (5) d 1 & 2;  SHORT RECORD" TO RE-MARK.
035900     PERFORM D-FAIL.
036000     MOVE  IX-VS2-STATUS      TO COMPUTED-A.
036100     MOVE "00 OR 44" TO CORRECT-X.
036200     GO TO D-RWR-WRITE-GF-01-0.
036300 D-RWR-PASS-GF-01-0.
036400     PERFORM D-PASS.
036500 D-RWR-WRITE-GF-01-0.
036600     PERFORM D-PRINT-DETAIL.
036700 D-CLOSE-FILES.
036800P    OPEN I-O RAW-DATA.
036900P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
037000P    READ RAW-DATA INVALID KEY GO TO D-END-E-2.
037100P    MOVE "OK.     " TO C-ABORT.
037200P    MOVE PASS-COUNTER TO C-OK.
037300P    MOVE ERROR-HOLD   TO C-ALL.
037400P    MOVE ERROR-COUNTER TO C-FAIL.
037500P    MOVE DELETE-COUNTER TO C-DELETED.
037600P    MOVE INSPECT-COUNTER TO C-INSPECT.
037700P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO D-END-E-2.
037800PD-END-E-2.
037900P    CLOSE RAW-DATA.
038000     PERFORM D-END-ROUTINE THRU D-END-ROUTINE-13.
038100     CLOSE PRINT-FILE.
038200 D-TERMINATE-CCVS.
038300S    EXIT PROGRAM.
038400SD-TERMINATE-CALL.
038500     STOP     RUN.
038600 D-PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
038700 D-FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
038800 D-PRINT-DETAIL.
038900     IF REC-CT NOT EQUAL TO ZERO
039000             MOVE "." TO PARDOT-X
039100             MOVE REC-CT TO DOTVALUE.
039200     MOVE TEST-RESULTS TO PRINT-REC. PERFORM D-WRITE-LINE.
039300     IF P-OR-F EQUAL TO "FAIL*"  PERFORM D-WRITE-LINE
039400        PERFORM D-FAIL-ROUTINE THRU D-FAIL-ROUTINE-EX
039500     ELSE PERFORM D-BAIL-OUT THRU D-BAIL-OUT-EX.
039600     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
039700     MOVE SPACE TO CORRECT-X.
039800     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
039900     MOVE     SPACE TO RE-MARK.
040000 D-END-ROUTINE.
040100     MOVE HYPHEN-LINE TO DUMMY-RECORD.
040200     PERFORM D-WRITE-LINE 5 TIMES.
040300 D-END-RTN-EXIT.
040400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
040500 D-END-ROUTINE-1.
040600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
040700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
040800      ADD PASS-COUNTER TO ERROR-HOLD.
040900      MOVE PASS-COUNTER TO CCVS-E-4-1.
041000      MOVE ERROR-HOLD TO CCVS-E-4-2.
041100      MOVE CCVS-E-4 TO CCVS-E-2-2.
041200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM D-WRITE-LINE.
041300 D-END-ROUTINE-12.
041400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
041500     IF       ERROR-COUNTER IS EQUAL TO ZERO
041600         MOVE "NO " TO ERROR-TOTAL
041700         ELSE
041800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
041900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
042000     PERFORM D-WRITE-LINE.
042100 D-END-ROUTINE-13.
042200     IF DELETE-COUNTER IS EQUAL TO ZERO
042300         MOVE "NO " TO ERROR-TOTAL  ELSE
042400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
042500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
042600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
042700      IF   INSPECT-COUNTER EQUAL TO ZERO
042800          MOVE "NO " TO ERROR-TOTAL
042900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
043000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
043100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
043200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
043300 D-WRITE-LINE.
043400     ADD 1 TO RECORD-COUNT.
043500Y    IF RECORD-COUNT GREATER 42
043600Y      MOVE DUMMY-RECORD TO DUMMY-HOLD
043700Y      MOVE SPACE TO DUMMY-RECORD
043800Y      WRITE DUMMY-RECORD AFTER ADVANCING PAGE
043900Y      MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
044000Y      MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
044100Y      MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
044200Y      MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
044300Y      MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM D-WRT-LN
044400Y      MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM D-WRT-LN
044500Y      MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM D-WRT-LN
044600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
044700Y        MOVE ZERO TO RECORD-COUNT.
044800     PERFORM D-WRT-LN.
044900 D-WRT-LN.
045000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
045100     MOVE SPACE TO DUMMY-RECORD.
045200 D-BLANK-LINE-PRINT.
045300     PERFORM D-WRT-LN.
045400 D-FAIL-ROUTINE.
045500     IF     COMPUTED-X NOT EQUAL TO SPACE
045600            GO TO  D-FAIL-ROUTINE-WRITE.
045700     IF  CORRECT-X NOT EQUAL TO SPACE GO TO D-FAIL-ROUTINE-WRITE.
045800     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
045900     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
046000     MOVE  XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
046100     MOVE  SPACES TO INF-ANSI-REFERENCE.
046200     GO TO D-FAIL-ROUTINE-EX.
046300 D-FAIL-ROUTINE-WRITE.
046400     MOVE  TEST-COMPUTED TO PRINT-REC PERFORM D-WRITE-LINE
046500     MOVE  ANSI-REFERENCE TO COR-ANSI-REFERENCE.
046600     MOVE TEST-CORRECT TO PRINT-REC PERFORM D-WRITE-LINE 2 TIMES.
046700     MOVE  SPACES TO COR-ANSI-REFERENCE.
046800 D-FAIL-ROUTINE-EX. EXIT.
046900 D-BAIL-OUT.
047000     IF  COMPUTED-A NOT EQUAL TO SPACE GO TO D-BAIL-OUT-WRITE.
047100     IF  CORRECT-A EQUAL TO SPACE GO TO D-BAIL-OUT-EX.
047200 D-BAIL-OUT-WRITE.
047300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
047400     MOVE  ANSI-REFERENCE TO INF-ANSI-REFERENCE.
047500     MOVE  XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
047600     MOVE  SPACES TO INF-ANSI-REFERENCE.
047700 D-BAIL-OUT-EX. EXIT.
047800
047900 END-DECL.
048000 END DECLARATIVES.
048100
048200
048300 CCVS1 SECTION.
048400 OPEN-FILES.
048500P    OPEN I-O RAW-DATA.
048600P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
048700P    READ RAW-DATA INVALID KEY GO TO END-E-1.
048800P    MOVE "ABORTED " TO C-ABORT.
048900P    ADD 1 TO C-NO-OF-TESTS.
049000P    ACCEPT C-DATE  FROM DATE.
049100P    ACCEPT C-TIME  FROM TIME.
049200P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
049300PEND-E-1.
049400P    CLOSE RAW-DATA.
049500     OPEN    OUTPUT PRINT-FILE.
049600     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
049700     MOVE    SPACE TO TEST-RESULTS.
049800     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
049900     MOVE    ZERO TO REC-SKL-SUB.
050000     PERFORM CCVS-INIT-FILE 9 TIMES.
050100 CCVS-INIT-FILE.
050200     ADD     1 TO REC-SKL-SUB.
050300     MOVE    FILE-RECORD-INFO-SKELETON
050400          TO FILE-RECORD-INFO (REC-SKL-SUB).
050500 CCVS-INIT-EXIT.
050600     GO TO CCVS1-EXIT.
050700 CLOSE-FILES.
050800P    OPEN I-O RAW-DATA.
050900P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
051000P    READ RAW-DATA INVALID KEY GO TO END-E-2.
051100P    MOVE "OK.     " TO C-ABORT.
051200P    MOVE PASS-COUNTER TO C-OK.
051300P    MOVE ERROR-HOLD   TO C-ALL.
051400P    MOVE ERROR-COUNTER TO C-FAIL.
051500P    MOVE DELETE-COUNTER TO C-DELETED.
051600P    MOVE INSPECT-COUNTER TO C-INSPECT.
051700P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
051800PEND-E-2.
051900P    CLOSE RAW-DATA.
052000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
052100 TERMINATE-CCVS.
052200S    EXIT PROGRAM.
052300STERMINATE-CALL.
052400     STOP     RUN.
052500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
052600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
052700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
052800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
052900     MOVE "****TEST DELETED****" TO RE-MARK.
053000 PRINT-DETAIL.
053100     IF REC-CT NOT EQUAL TO ZERO
053200             MOVE "." TO PARDOT-X
053300             MOVE REC-CT TO DOTVALUE.
053400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
053500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
053600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
053700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
053800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
053900     MOVE SPACE TO CORRECT-X.
054000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
054100     MOVE     SPACE TO RE-MARK.
054200 HEAD-ROUTINE.
054300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
054600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
054700 COLUMN-NAMES-ROUTINE.
054800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
055100 END-ROUTINE.
055200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
055300 END-RTN-EXIT.
055400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055500 END-ROUTINE-1.
055600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
055700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
055800      ADD PASS-COUNTER TO ERROR-HOLD.
055900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
056000      MOVE PASS-COUNTER TO CCVS-E-4-1.
056100      MOVE ERROR-HOLD TO CCVS-E-4-2.
056200      MOVE CCVS-E-4 TO CCVS-E-2-2.
056300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
056400  END-ROUTINE-12.
056500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
056600     IF       ERROR-COUNTER IS EQUAL TO ZERO
056700         MOVE "NO " TO ERROR-TOTAL
056800         ELSE
056900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
057000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
057100     PERFORM WRITE-LINE.
057200 END-ROUTINE-13.
057300     IF DELETE-COUNTER IS EQUAL TO ZERO
057400         MOVE "NO " TO ERROR-TOTAL  ELSE
057500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
057600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
057700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057800      IF   INSPECT-COUNTER EQUAL TO ZERO
057900          MOVE "NO " TO ERROR-TOTAL
058000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
058100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
058200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
058300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
058400 WRITE-LINE.
058500     ADD 1 TO RECORD-COUNT.
058600Y    IF RECORD-COUNT GREATER 42
058700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
058800Y        MOVE SPACE TO DUMMY-RECORD
058900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
059000Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
059100Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
059200Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
059300Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
059400Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
059500Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
059600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
059700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
059800Y        MOVE ZERO TO RECORD-COUNT.
059900     PERFORM WRT-LN.
060000 WRT-LN.
060100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
060200     MOVE SPACE TO DUMMY-RECORD.
060300 BLANK-LINE-PRINT.
060400     PERFORM WRT-LN.
060500 FAIL-ROUTINE.
060600     IF     COMPUTED-X NOT EQUAL TO SPACE
060700            GO TO   FAIL-ROUTINE-WRITE.
060800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
060900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
061000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
061100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
061200     MOVE   SPACES TO INF-ANSI-REFERENCE.
061300     GO TO  FAIL-ROUTINE-EX.
061400 FAIL-ROUTINE-WRITE.
061500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
061600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
061700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
061800     MOVE   SPACES TO COR-ANSI-REFERENCE.
061900 FAIL-ROUTINE-EX. EXIT.
062000 BAIL-OUT.
062100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
062200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
062300 BAIL-OUT-WRITE.
062400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
062500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
062600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
062700     MOVE   SPACES TO INF-ANSI-REFERENCE.
062800 BAIL-OUT-EX. EXIT.
062900 CCVS1-EXIT.
063000     EXIT.
063100
063200 SECT-IX121A-0003 SECTION.
063300 SEQ-INIT-010.
063400     MOVE "IX-VS2" TO XFILE-NAME (1).
063500     MOVE "R1-F-G" TO XRECORD-NAME (1).
063600     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
063700     MOVE 000240 TO XRECORD-LENGTH (1).
063800     MOVE "RC" TO CHARS-OR-RECORDS (1).
063900     MOVE 0002 TO XBLOCK-SIZE (1).
064000     MOVE 000050 TO RECORDS-IN-FILE (1).
064100     MOVE "IX" TO XFILE-ORGANIZATION (1).
064200     MOVE "S" TO XLABEL-TYPE (1).
064300     MOVE 000001 TO XRECORD-NUMBER (1).
064400     MOVE 0 TO COUNT-OF-RECS.
064500
064600******************************************************************
064700*   TEST  1                                                      *
064800*         OPEN OUTPUT ...                 00 EXPECTED            *
064900*         IX-3, 1.3.4 (1) a                                      *
065000*    STATUS 00 CHECK ON OUTPUT FILE IX-VS2                       *
065100*    THE OUTPUT STATEMENT IS SUCCESSFULLY EXECUTED               *
065200******************************************************************
065300 OPN-INIT-GF-01-0.
065400     ADD  1 TO TEST-NUMBER.
065500     MOVE 1 TO STATUS-TEST-00.
065600     MOVE SPACES TO IX-VS2-STATUS.
065700     MOVE "OPEN OUTPUT: 00 EXP." TO FEATURE.
065800     MOVE "OPN-TEST-GF-01-0" TO PAR-NAME.
065900     OPEN
066000        OUTPUT IX-VS2.
066100     IF IX-VS2-STATUS EQUAL TO "00"
066200         GO TO OPN-PASS-GF-01-0.
066300 OPN-FAIL-GF-01-0.
066400     MOVE "IX-3, 1.3.4, (1) a. " TO RE-MARK.
066500     PERFORM FAIL.
066600     MOVE IX-VS2-STATUS TO COMPUTED-A.
066700     MOVE "00" TO CORRECT-X.
066800     GO TO OPN-WRITE-GF-01-0.
066900 OPN-PASS-GF-01-0.
067000     PERFORM PASS.
067100 OPN-WRITE-GF-01-0.
067200     PERFORM PRINT-DETAIL.
067300******************************************************************
067400*   TEST  2                                                      *
067500*         WRITE                           00 EXPECTED            *
067600*         IX-3, 1.3.4 (1) a                                      *
067700*    CREATING A INDEXED FILE WITH 50 RECORDS                     *
067800*    KEY:  FROM  000000001 TO 000000050                          *
067900******************************************************************
068000 WRI-INIT-GF-01-0.
068100     ADD  1 TO TEST-NUMBER.
068200     MOVE SPACES TO IX-VS2-STATUS.
068300     MOVE 0 TO STATUS-TEST-00.
068400     MOVE "WRITE: 00 EXPECTED" TO FEATURE.
068500     MOVE "WRI-TEST-GF-01-0" TO PAR-NAME.
068600 WRI-TEST-GF-01-0.
068700     MOVE XRECORD-NUMBER (1) TO GRP-0101-KEY, COUNT-OF-RECS.
068800     MOVE GRP-0101 TO XRECORD-KEY (1).
068900     MOVE GRP-0102 TO ALTERNATE-KEY1 (1).
069000*    THE VALUE OF THE ALTERNATE KEY IS 50 TIMES UNCHANGED        *
069100     MOVE FILE-RECORD-INFO (1) TO IX-VS2R1-F-G-240.
069200     WRITE IX-VS2R1-F-G-240.
069300     IF IX-VS2-STATUS  NOT = "00"
069400         MOVE 1 TO STATUS-TEST-00
069500         GO TO WRI-FAIL-GF-01-0.
069600     IF XRECORD-NUMBER (1) EQUAL TO 50
069700         GO TO WRI-TEST-GF-01-1.
069800     ADD 1 TO XRECORD-NUMBER (1).
069900     GO TO WRI-TEST-GF-01-0.
070000 WRI-TEST-GF-01-1.
070100     IF RECORDS-IN-ERROR EQUAL TO ZERO
070200         GO TO WRI-PASS-GF-01-0.
070300     MOVE "ERROR IN CREATING FILE" TO RE-MARK.
070400 WRI-FAIL-GF-01-0.
070500     MOVE "IX-3, 1.3.4, (1) a. " TO RE-MARK.
070600     PERFORM FAIL.
070700     MOVE "RECORDS WRITTEN =" TO COMPUTED-A.
070800     GO TO WRI-WRITE-GF-01-0.
070900 WRI-PASS-GF-01-0.
071000     PERFORM PASS.
071100 WRI-WRITE-GF-01-0.
071200     PERFORM PRINT-DETAIL.
071300     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
071400     MOVE "CREATE FILE IX-VS2" TO FEATURE.
071500     MOVE "WRI-TEST-GF-01-1" TO PAR-NAME.
071600     MOVE COUNT-OF-RECS TO CORRECT-18V0.
071700     PERFORM PRINT-DETAIL.
071800******************************************************************
071900*   TEST  3                                                      *
072000*         REWRITE   (WITH WRONG RECORD LENGTH (SHORTER))         *
072100*         IX-5, 1.3.4 (5) d 1 & 2                                *
072200*         FILE STATUS  00   OR  44   EXPECTED                    *
072300*    KEY:        000000005                                       *
072400******************************************************************
072500 RWR-INIT-GF-01-0.
072600     ADD  1 TO TEST-NUMBER.
072700     CLOSE IX-VS2.
072800     OPEN I-O IX-VS2.
072900     MOVE SPACES TO IX-VS2-STATUS.
073000     MOVE 0 TO STATUS-TEST-00.
073100     MOVE "RWRTE LG. 00/44 EXP." TO FEATURE.
073200     MOVE "RWR-TEST-GF-01-0" TO PAR-NAME.
073300     READ IX-VS2 AT END       GO TO RWR-TEST-GF-01-0.
073400     READ IX-VS2 AT END       GO TO RWR-TEST-GF-01-0.
073500     READ IX-VS2 AT END       GO TO RWR-TEST-GF-01-0.
073600     READ IX-VS2 AT END       GO TO RWR-TEST-GF-01-0.
073700     READ IX-VS2 AT END       GO TO RWR-TEST-GF-01-0.
073800 RWR-TEST-GF-01-0.
073900     MOVE "WRONG RECORD LENGTH ( LONGER )" TO IX-VS2-REC-LONG.
074000     REWRITE IX-VS2R1-F-G-280.
074100 RWR-TEST-GF-01-1.
074200     IF IX-VS2-STATUS  = "00"
074300         GO TO RWR-PASS-GF-01-0.
074400     IF IX-VS2-STATUS  = "44"
074500         GO TO RWR-PASS-GF-01-0.
074600 RWR-FAIL-GF-01-0.
074700     MOVE "IX-5, 1.3.4, (5) D 1 & 2;   LONG RECORD" TO RE-MARK.
074800     PERFORM FAIL.
074900     MOVE  IX-VS2-STATUS      TO COMPUTED-A.
075000     MOVE "00 OR 44" TO CORRECT-X.
075100     GO TO RWR-WRITE-GF-01-0.
075200 RWR-PASS-GF-01-0.
075300     PERFORM PASS.
075400 RWR-WRITE-GF-01-0.
075500     PERFORM PRINT-DETAIL.
075600
075700 TERMINATE-ROUTINE.
075800     EXIT.
075900
076000 CCVS-EXIT SECTION.
076100 CCVS-999999.
076200     GO TO CLOSE-FILES.
