000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX120A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    THIS ROUTINE USES THE MASS STORAGE FILE IX-FS3 CREATED IN
001500*    IX113A.
001600*    THE FILE IS OPENED I-O AND THE STATUS CHECKED (00 EXPECTED),
001700*    THE FILE IS THEN READ UNTIL THE AT END CONDITION IS REACHED
001800*    AND THEN READ ONCE MORE.  AN ATTEMPT IS THEN MADE TO REWRITE
001900*    A RECORD, AT WHICH POINT THE DECLARATIVES
002000*    SHOULD BE ACTIONED AND THE FILE STATUS SHOULD BE 43 .
002100*
002200*    STANDARD REFERENCE IX-5, 1.3.4 (5) C
002300*
002400*    X-CARDS USED IN THIS PROGRAM:
002500*
002600*                 XXXXX024
002700*                 XXXXX055.
002800*         P       XXXXX062.
002900*                 XXXXX082.
003000*                 XXXXX083.
003100*         C       XXXXX084
003200*
003300*
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.
003700     XXXXX082.
003800 OBJECT-COMPUTER.
003900     XXXXX083.
004000 INPUT-OUTPUT SECTION.
004100 FILE-CONTROL.
004200P    SELECT RAW-DATA   ASSIGN TO
004300P    XXXXX062
004400P           ORGANIZATION IS INDEXED
004500P           ACCESS MODE IS RANDOM
004600P           RECORD KEY IS RAW-DATA-KEY.
004700*
004800     SELECT PRINT-FILE ASSIGN TO
004900     XXXXX055.
005000*
005100     SELECT IX-FS3 ASSIGN
005200     XXXXX024
005300     ORGANIZATION IS INDEXED
005400     ACCESS MODE IS SEQUENTIAL
005500     RECORD KEY IS IX-FS3-KEY
005600     FILE STATUS IS IX-FS3-STATUS.
005700
005800 DATA DIVISION.
005900
006000 FILE SECTION.
006100P
006200PFD  RAW-DATA.
006300P
006400P01  RAW-DATA-SATZ.
006500P    05  RAW-DATA-KEY        PIC X(6).
006600P    05  C-DATE              PIC 9(6).
006700P    05  C-TIME              PIC 9(8).
006800P    05  C-NO-OF-TESTS       PIC 99.
006900P    05  C-OK                PIC 999.
007000P    05  C-ALL               PIC 999.
007100P    05  C-FAIL              PIC 999.
007200P    05  C-DELETED           PIC 999.
007300P    05  C-INSPECT           PIC 999.
007400P    05  C-NOTE              PIC X(13).
007500P    05  C-INDENT            PIC X.
007600P    05  C-ABORT             PIC X(8).
007700
007800 FD  PRINT-FILE.
007900
008000 01  PRINT-REC               PIC X(120).
008100
008200 01  DUMMY-RECORD            PIC X(120).
008300
008400 FD  IX-FS3
008500C       DATA RECORDS IX-FS3R1-F-G-240
008600C       LABEL RECORD STANDARD
008700        RECORD 240
008800        BLOCK CONTAINS 2 RECORDS.
008900
009000 01  IX-FS3R1-F-G-240.
009100     05  IX-FS3-REC-120      PIC X(120).
009200     05  IX-FS3-REC-120-240.
009300         10  FILLER          PIC X(8).
009400         10  IX-FS3-KEY      PIC X(29).
009500         10  FILLER          PIC X(9).
009600         10  IX-FS3-ALTER-KEY  PIC X(29).
009700         10  FILLER            PIC X(45).
009800
009900
010000 WORKING-STORAGE SECTION.
010100
010200 01  GRP-0101.
010300     05  FILLER              PIC X(10) VALUE "RECORD-KEY".
010400     05  GRP-0101-KEY        PIC 9(9)  VALUE ZERO.
010500     05  FILLER              PIC X(10) VALUE "END-OF-KEY".
010600
010700 01  GRP-0102.
010800     05  FILLER              PIC X(10) VALUE "ALTERN-KEY".
010900     05  GRP-0102-KEY        PIC 9(9)  VALUE ZERO.
011000     05  FILLER              PIC X(10) VALUE "END-AL-KEY".
011100
011200 01  WRK-CS-09V00            PIC S9(9) COMP VALUE ZERO.
011300
011400 01  EOF-FLAG                PIC 9 VALUE ZERO.
011500
011600 01  RECORDS-IN-ERROR        PIC S9(5) COMP VALUE ZERO.
011700
011800 01  ERROR-FLAG              PIC 9 VALUE ZERO.
011900
012000 01  PERM-ERRORS             PIC S9(5) COMP VALUE ZERO.
012100
012200 01  STATUS-TEST-00          PIC 9 VALUE ZERO.
012300
012400 01  STATUS-TEST-10          PIC 9 VALUE ZERO.
012500 01  STATUS-TEST-READ        PIC 9 VALUE ZERO.
012600
012700 01  IX-FS3-STATUS.
012800     05  IX-FS3-STAT1        PIC X.
012900     05  IX-FS3-STAT2        PIC X.
013000
013100 01  COUNT-OF-RECS           PIC 9(5).
013200
013300 01  COUNT-OF-RECORDS REDEFINES COUNT-OF-RECS  PIC 9(5).
013400
013500 01  FILE-RECORD-INFORMATION-REC.
013600     05  FILE-RECORD-INFO-SKELETON.
013700         10  FILLER          PIC X(48) VALUE
013800              "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
013900         10  FILLER          PIC X(46) VALUE
014000                ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
014100         10  FILLER          PIC X(26) VALUE
014200                                    ",LFIL=000000,ORG=  ,LBLR= ".
014300         10  FILLER          PIC X(37) VALUE
014400                         ",RECKEY=                             ".
014500         10  FILLER          PIC X(38) VALUE
014600                        ",ALTKEY1=                             ".
014700         10  FILLER          PIC X(38) VALUE
014800                        ",ALTKEY2=                             ".
014900         10  FILLER          PIC X(7) VALUE SPACE.
015000     05  FILE-RECORD-INFO             OCCURS 10.
015100         10  FILE-RECORD-INFO-P1-120.
015200             15  FILLER      PIC X(5).
015300             15  XFILE-NAME  PIC X(6).
015400             15  FILLER      PIC X(8).
015500             15  XRECORD-NAME  PIC X(6).
015600             15  FILLER        PIC X(1).
015700             15  REELUNIT-NUMBER  PIC 9(1).
015800             15  FILLER           PIC X(7).
015900             15  XRECORD-NUMBER   PIC 9(6).
016000             15  FILLER           PIC X(6).
016100             15  UPDATE-NUMBER    PIC 9(2).
016200             15  FILLER           PIC X(5).
016300             15  ODO-NUMBER       PIC 9(4).
016400             15  FILLER           PIC X(5).
016500             15  XPROGRAM-NAME    PIC X(5).
016600             15  FILLER           PIC X(7).
016700             15  XRECORD-LENGTH   PIC 9(6).
016800             15  FILLER           PIC X(7).
016900             15  CHARS-OR-RECORDS  PIC X(2).
017000             15  FILLER            PIC X(1).
017100             15  XBLOCK-SIZE       PIC 9(4).
017200             15  FILLER            PIC X(6).
017300             15  RECORDS-IN-FILE   PIC 9(6).
017400             15  FILLER            PIC X(5).
017500             15  XFILE-ORGANIZATION  PIC X(2).
017600             15  FILLER              PIC X(6).
017700             15  XLABEL-TYPE         PIC X(1).
017800         10  FILE-RECORD-INFO-P121-240.
017900             15  FILLER              PIC X(8).
018000             15  XRECORD-KEY         PIC X(29).
018100             15  FILLER              PIC X(9).
018200             15  ALTERNATE-KEY1      PIC X(29).
018300             15  FILLER              PIC X(9).
018400             15  ALTERNATE-KEY2      PIC X(29).
018500             15  FILLER              PIC X(7).
018600
018700 01  TEST-RESULTS.
018800     02 FILLER                   PIC X      VALUE SPACE.
018900     02 FEATURE                  PIC X(20)  VALUE SPACE.
019000     02 FILLER                   PIC X      VALUE SPACE.
019100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
019200     02 FILLER                   PIC X      VALUE SPACE.
019300     02  PAR-NAME.
019400       03 FILLER                 PIC X(19)  VALUE SPACE.
019500       03  PARDOT-X              PIC X      VALUE SPACE.
019600       03 DOTVALUE               PIC 99     VALUE ZERO.
019700     02 FILLER                   PIC X(8)   VALUE SPACE.
019800     02 RE-MARK                  PIC X(61).
019900 01  TEST-COMPUTED.
020000     02 FILLER                   PIC X(30)  VALUE SPACE.
020100     02 FILLER                   PIC X(17)  VALUE
020200            "       COMPUTED=".
020300     02 COMPUTED-X.
020400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
020500     03 COMPUTED-N               REDEFINES COMPUTED-A
020600                                 PIC -9(9).9(9).
020700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
020800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
020900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
021000     03       CM-18V0 REDEFINES COMPUTED-A.
021100         04 COMPUTED-18V0                    PIC -9(18).
021200         04 FILLER                           PIC X.
021300     03 FILLER PIC X(50) VALUE SPACE.
021400 01  TEST-CORRECT.
021500     02 FILLER PIC X(30) VALUE SPACE.
021600     02 FILLER PIC X(17) VALUE "       CORRECT =".
021700     02 CORRECT-X.
021800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
021900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
022000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
022100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
022200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
022300     03      CR-18V0 REDEFINES CORRECT-A.
022400         04 CORRECT-18V0                     PIC -9(18).
022500         04 FILLER                           PIC X.
022600     03 FILLER PIC X(2) VALUE SPACE.
022700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
022800 01  CCVS-C-1.
022900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
023000-    "SS  PARAGRAPH-NAME
023100-    "       REMARKS".
023200     02 FILLER                     PIC X(20)    VALUE SPACE.
023300 01  CCVS-C-2.
023400     02 FILLER                     PIC X        VALUE SPACE.
023500     02 FILLER                     PIC X(6)     VALUE "TESTED".
023600     02 FILLER                     PIC X(15)    VALUE SPACE.
023700     02 FILLER                     PIC X(4)     VALUE "FAIL".
023800     02 FILLER                     PIC X(94)    VALUE SPACE.
023900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
024000 01  REC-CT                        PIC 99       VALUE ZERO.
024100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
024200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
024300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
024400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
024500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
024600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
024700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
024800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
024900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
025000 01  CCVS-H-1.
025100     02  FILLER                    PIC X(39)    VALUE SPACES.
025200     02  FILLER                    PIC X(42)    VALUE
025300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
025400     02  FILLER                    PIC X(39)    VALUE SPACES.
025500 01  CCVS-H-2A.
025600   02  FILLER                        PIC X(40)  VALUE SPACE.
025700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
025800   02  FILLER                        PIC XXXX   VALUE
025900     "4.2 ".
026000   02  FILLER                        PIC X(28)  VALUE
026100            " COPY - NOT FOR DISTRIBUTION".
026200   02  FILLER                        PIC X(41)  VALUE SPACE.
026300
026400 01  CCVS-H-2B.
026500   02  FILLER                        PIC X(15)  VALUE
026600            "TEST RESULT OF ".
026700   02  TEST-ID                       PIC X(9).
026800   02  FILLER                        PIC X(4)   VALUE
026900            " IN ".
027000   02  FILLER                        PIC X(12)  VALUE
027100     " HIGH       ".
027200   02  FILLER                        PIC X(22)  VALUE
027300            " LEVEL VALIDATION FOR ".
027400   02  FILLER                        PIC X(58)  VALUE
027500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027600 01  CCVS-H-3.
027700     02  FILLER                      PIC X(34)  VALUE
027800            " FOR OFFICIAL USE ONLY    ".
027900     02  FILLER                      PIC X(58)  VALUE
028000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
028100     02  FILLER                      PIC X(28)  VALUE
028200            "  COPYRIGHT   1985 ".
028300 01  CCVS-E-1.
028400     02 FILLER                       PIC X(52)  VALUE SPACE.
028500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
028600     02 ID-AGAIN                     PIC X(9).
028700     02 FILLER                       PIC X(45)  VALUE SPACES.
028800 01  CCVS-E-2.
028900     02  FILLER                      PIC X(31)  VALUE SPACE.
029000     02  FILLER                      PIC X(21)  VALUE SPACE.
029100     02 CCVS-E-2-2.
029200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
029300         03 FILLER                   PIC X      VALUE SPACE.
029400         03 ENDER-DESC               PIC X(44)  VALUE
029500            "ERRORS ENCOUNTERED".
029600 01  CCVS-E-3.
029700     02  FILLER                      PIC X(22)  VALUE
029800            " FOR OFFICIAL USE ONLY".
029900     02  FILLER                      PIC X(12)  VALUE SPACE.
030000     02  FILLER                      PIC X(58)  VALUE
030100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
030200     02  FILLER                      PIC X(13)  VALUE SPACE.
030300     02 FILLER                       PIC X(15)  VALUE
030400             " COPYRIGHT 1985".
030500 01  CCVS-E-4.
030600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
030700     02 FILLER                       PIC X(4)   VALUE " OF ".
030800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
030900     02 FILLER                       PIC X(40)  VALUE
031000      "  TESTS WERE EXECUTED SUCCESSFULLY".
031100 01  XXINFO.
031200     02 FILLER                       PIC X(19)  VALUE
031300            "*** INFORMATION ***".
031400     02 INFO-TEXT.
031500       04 FILLER                     PIC X(8)   VALUE SPACE.
031600       04 XXCOMPUTED                 PIC X(20).
031700       04 FILLER                     PIC X(5)   VALUE SPACE.
031800       04 XXCORRECT                  PIC X(20).
031900     02 INF-ANSI-REFERENCE           PIC X(48).
032000 01  HYPHEN-LINE.
032100     02 FILLER  PIC IS X VALUE IS SPACE.
032200     02 FILLER  PIC IS X(65)    VALUE IS "************************
032300-    "*****************************************".
032400     02 FILLER  PIC IS X(54)    VALUE IS "************************
032500-    "******************************".
032600 01  TEST-NO                         PIC 99.
032700 01  CCVS-PGM-ID                     PIC X(9)   VALUE
032800     "IX120A".
032900 PROCEDURE DIVISION.
033000 DECLARATIVES.
033100
033200 SECT-IX105-0002 SECTION.
033300     USE AFTER EXCEPTION PROCEDURE ON IX-FS3.
033400 INPUT-PROCESS.
033500     IF TEST-NO = 5
033600        GO TO D-C-TEST-GF-01-1.
033700     IF STATUS-TEST-10 EQUAL TO 1
033800        IF  IX-FS3-STAT1 EQUAL TO "1"
033900            MOVE 1 TO EOF-FLAG
034000        ELSE
034100           IF  IX-FS3-STAT1 GREATER THAN "1"
034200           MOVE 1 TO PERM-ERRORS.
034300     GO TO DECL-EXIT.
034400 D-C-TEST-GF-01-1.
034500     IF IX-FS3-STATUS EQUAL TO "43"
034600         GO TO D-C-PASS-GF-01-0.
034700 D-C-FAIL-GF-01-0.
034800     MOVE IX-FS3-STATUS TO COMPUTED-A.
034900     MOVE "43" TO CORRECT-X.
035000     MOVE "IX-5, 1.3.4, (5) C" TO RE-MARK.
035100     PERFORM D-FAIL.
035200     GO TO D-C-WRITE-GF-01-0.
035300 D-C-PASS-GF-01-0.
035400     PERFORM D-PASS.
035500 D-C-WRITE-GF-01-0.
035600     PERFORM D-PRINT-DETAIL.
035700 D-CLOSE-FILES.
035800     CLOSE IX-FS3.
035900P    OPEN I-O RAW-DATA.
036000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
036100P    READ RAW-DATA INVALID KEY GO TO D-END-E-2.
036200P    MOVE "OK.     " TO C-ABORT.
036300P    MOVE PASS-COUNTER TO C-OK.
036400P    MOVE ERROR-HOLD   TO C-ALL.
036500P    MOVE ERROR-COUNTER TO C-FAIL.
036600P    MOVE DELETE-COUNTER TO C-DELETED.
036700P    MOVE INSPECT-COUNTER TO C-INSPECT.
036800P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO D-END-E-2.
036900PD-END-E-2.
037000P    CLOSE RAW-DATA.
037100     PERFORM D-END-ROUTINE THRU D-END-ROUTINE-13.
037200     CLOSE PRINT-FILE.
037300 D-TERMINATE-CCVS.
037400S    EXIT PROGRAM.
037500SD-TERMINATE-CALL.
037600     STOP     RUN.
037700 D-PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
037800 D-FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
037900 D-PRINT-DETAIL.
038000     IF   REC-CT NOT EQUAL TO ZERO
038100          MOVE "." TO PARDOT-X
038200          MOVE REC-CT TO DOTVALUE.
038300     MOVE TEST-RESULTS TO PRINT-REC.
038400     PERFORM D-WRITE-LINE.
038500     IF   P-OR-F EQUAL TO "FAIL*"
038600          PERFORM D-WRITE-LINE
038700          PERFORM D-FAIL-ROUTINE THRU D-FAIL-ROUTINE-EX
038800     ELSE
038900          PERFORM D-BAIL-OUT THRU D-BAIL-OUT-EX.
039000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
039100     MOVE SPACE TO CORRECT-X.
039200     IF   REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
039300     MOVE SPACE TO RE-MARK.
039400 D-END-ROUTINE.
039500     MOVE HYPHEN-LINE TO DUMMY-RECORD.
039600     PERFORM D-WRITE-LINE 5 TIMES.
039700 D-END-RTN-EXIT.
039800     MOVE CCVS-E-1 TO DUMMY-RECORD.
039900     PERFORM D-WRITE-LINE 2 TIMES.
040000 D-END-ROUTINE-1.
040100     ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
040200     ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
040300     ADD PASS-COUNTER TO ERROR-HOLD.
040400     MOVE PASS-COUNTER TO CCVS-E-4-1.
040500     MOVE ERROR-HOLD TO CCVS-E-4-2.
040600     MOVE CCVS-E-4 TO CCVS-E-2-2.
040700     MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM D-WRITE-LINE.
040800  D-END-ROUTINE-12.
040900     MOVE "TEST(S) FAILED" TO ENDER-DESC.
041000     IF  ERROR-COUNTER IS EQUAL TO ZERO
041100         MOVE "NO " TO ERROR-TOTAL
041200     ELSE
041300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
041400     MOVE    CCVS-E-2 TO DUMMY-RECORD.
041500     PERFORM D-WRITE-LINE.
041600 D-END-ROUTINE-13.
041700     IF  DELETE-COUNTER IS EQUAL TO ZERO
041800         MOVE "NO " TO ERROR-TOTAL  ELSE
041900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
042000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
042100     MOVE CCVS-E-2 TO DUMMY-RECORD.
042200     PERFORM D-WRITE-LINE.
042300     IF   INSPECT-COUNTER EQUAL TO ZERO
042400          MOVE "NO " TO ERROR-TOTAL
042500     ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
042600     MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
042700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
042800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM D-WRITE-LINE.
042900 D-WRITE-LINE.
043000     ADD 1 TO RECORD-COUNT.
043100Y    IF RECORD-COUNT GREATER 42
043200Y       MOVE DUMMY-RECORD TO DUMMY-HOLD
043300Y       MOVE SPACE TO DUMMY-RECORD
043400Y       WRITE DUMMY-RECORD AFTER ADVANCING PAGE
043500Y       MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
043600Y       MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM D-WRT-LN 2 TIMES
043700Y       MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
043800Y       MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM D-WRT-LN 3 TIMES
043900Y       MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM D-WRT-LN
044000Y       MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM D-WRT-LN
044100Y       MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM D-WRT-LN
044200Y       MOVE DUMMY-HOLD TO DUMMY-RECORD
044300Y       MOVE ZERO TO RECORD-COUNT.
044400     PERFORM D-WRT-LN.
044500 D-WRT-LN.
044600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
044700     MOVE SPACE TO DUMMY-RECORD.
044800 D-FAIL-ROUTINE.
044900     IF   COMPUTED-X NOT EQUAL TO SPACE
045000          GO TO D-FAIL-ROUTINE-WRITE.
045100     IF   CORRECT-X NOT EQUAL TO SPACE GO TO D-FAIL-ROUTINE-WRITE.
045200     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
045300     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
045400     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
045500     MOVE SPACES TO INF-ANSI-REFERENCE.
045600     GO TO D-FAIL-ROUTINE-EX.
045700 D-FAIL-ROUTINE-WRITE.
045800     MOVE TEST-COMPUTED TO PRINT-REC PERFORM D-WRITE-LINE
045900     MOVE ANSI-REFERENCE TO COR-ANSI-REFERENCE.
046000     MOVE TEST-CORRECT TO PRINT-REC PERFORM D-WRITE-LINE 2 TIMES.
046100     MOVE SPACES TO COR-ANSI-REFERENCE.
046200 D-FAIL-ROUTINE-EX. EXIT.
046300 D-BAIL-OUT.
046400     IF  COMPUTED-A NOT EQUAL TO SPACE GO TO D-BAIL-OUT-WRITE.
046500     IF  CORRECT-A EQUAL TO SPACE GO TO D-BAIL-OUT-EX.
046600 D-BAIL-OUT-WRITE.
046700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
046800     MOVE ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046900     MOVE XXINFO TO DUMMY-RECORD. PERFORM D-WRITE-LINE 2 TIMES.
047000     MOVE SPACES TO INF-ANSI-REFERENCE.
047100 D-BAIL-OUT-EX. EXIT.
047200 DECL-EXIT.  EXIT.
047300 END DECLARATIVES.
047400
047500
047600 CCVS1 SECTION.
047700 OPEN-FILES.
047800P    OPEN I-O RAW-DATA.
047900P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
048000P    READ RAW-DATA INVALID KEY GO TO END-E-1.
048100P    MOVE "ABORTED " TO C-ABORT.
048200P    ADD 1 TO C-NO-OF-TESTS.
048300P    ACCEPT C-DATE  FROM DATE.
048400P    ACCEPT C-TIME  FROM TIME.
048500P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
048600PEND-E-1.
048700P    CLOSE RAW-DATA.
048800     OPEN    OUTPUT PRINT-FILE.
048900     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
049000     MOVE    SPACE TO TEST-RESULTS.
049100     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
049200     MOVE    ZERO TO REC-SKL-SUB.
049300     PERFORM CCVS-INIT-FILE 9 TIMES.
049400 CCVS-INIT-FILE.
049500     ADD     1 TO REC-SKL-SUB.
049600     MOVE    FILE-RECORD-INFO-SKELETON
049700          TO FILE-RECORD-INFO (REC-SKL-SUB).
049800 CCVS-INIT-EXIT.
049900     GO TO CCVS1-EXIT.
050000 CLOSE-FILES.
050100P    OPEN I-O RAW-DATA.
050200P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
050300P    READ RAW-DATA INVALID KEY GO TO END-E-2.
050400P    MOVE "OK.     " TO C-ABORT.
050500P    MOVE PASS-COUNTER TO C-OK.
050600P    MOVE ERROR-HOLD   TO C-ALL.
050700P    MOVE ERROR-COUNTER TO C-FAIL.
050800P    MOVE DELETE-COUNTER TO C-DELETED.
050900P    MOVE INSPECT-COUNTER TO C-INSPECT.
051000P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
051100PEND-E-2.
051200P    CLOSE RAW-DATA.
051300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
051400 TERMINATE-CCVS.
051500S    EXIT PROGRAM.
051600STERMINATE-CALL.
051700     STOP     RUN.
051800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
051900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
052000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
052100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
052200     MOVE "****TEST DELETED****" TO RE-MARK.
052300 PRINT-DETAIL.
052400     IF REC-CT NOT EQUAL TO ZERO
052500             MOVE "." TO PARDOT-X
052600             MOVE REC-CT TO DOTVALUE.
052700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
052800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
052900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
053000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
053100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
053200     MOVE SPACE TO CORRECT-X.
053300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
053400     MOVE     SPACE TO RE-MARK.
053500 HEAD-ROUTINE.
053600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
053900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
054000 COLUMN-NAMES-ROUTINE.
054100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
054400 END-ROUTINE.
054500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
054600 END-RTN-EXIT.
054700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
054800 END-ROUTINE-1.
054900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
055000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
055100      ADD PASS-COUNTER TO ERROR-HOLD.
055200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
055300      MOVE PASS-COUNTER TO CCVS-E-4-1.
055400      MOVE ERROR-HOLD TO CCVS-E-4-2.
055500      MOVE CCVS-E-4 TO CCVS-E-2-2.
055600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
055700  END-ROUTINE-12.
055800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
055900     IF       ERROR-COUNTER IS EQUAL TO ZERO
056000         MOVE "NO " TO ERROR-TOTAL
056100         ELSE
056200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
056300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
056400     PERFORM WRITE-LINE.
056500 END-ROUTINE-13.
056600     IF DELETE-COUNTER IS EQUAL TO ZERO
056700         MOVE "NO " TO ERROR-TOTAL  ELSE
056800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
056900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
057000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057100      IF   INSPECT-COUNTER EQUAL TO ZERO
057200          MOVE "NO " TO ERROR-TOTAL
057300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
057400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
057500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057700 WRITE-LINE.
057800     ADD 1 TO RECORD-COUNT.
057900Y    IF RECORD-COUNT GREATER 42
058000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
058100Y        MOVE SPACE TO DUMMY-RECORD
058200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
058300Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
058400Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
058500Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
058600Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
058700Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
058800Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
058900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
059000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
059100Y        MOVE ZERO TO RECORD-COUNT.
059200     PERFORM WRT-LN.
059300 WRT-LN.
059400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
059500     MOVE SPACE TO DUMMY-RECORD.
059600 BLANK-LINE-PRINT.
059700     PERFORM WRT-LN.
059800 FAIL-ROUTINE.
059900     IF     COMPUTED-X NOT EQUAL TO SPACE
060000            GO TO   FAIL-ROUTINE-WRITE.
060100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
060200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
060300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
060400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
060500     MOVE   SPACES TO INF-ANSI-REFERENCE.
060600     GO TO  FAIL-ROUTINE-EX.
060700 FAIL-ROUTINE-WRITE.
060800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
060900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
061000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
061100     MOVE   SPACES TO COR-ANSI-REFERENCE.
061200 FAIL-ROUTINE-EX. EXIT.
061300 BAIL-OUT.
061400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
061500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
061600 BAIL-OUT-WRITE.
061700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
061800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
061900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
062000     MOVE   SPACES TO INF-ANSI-REFERENCE.
062100 BAIL-OUT-EX. EXIT.
062200 CCVS1-EXIT.
062300     EXIT.
062400
062500 SECT-IX120A-0003 SECTION.
062600 SEQ-INIT-010.
062700     MOVE ZERO TO TEST-NO.
062800     MOVE "IX-FS3" TO XFILE-NAME (1).
062900     MOVE "R1-F-G" TO XRECORD-NAME (1).
063000     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
063100     MOVE 000240 TO XRECORD-LENGTH (1).
063200     MOVE "RC" TO CHARS-OR-RECORDS (1).
063300     MOVE 0002 TO XBLOCK-SIZE (1).
063400     MOVE 000050 TO RECORDS-IN-FILE (1).
063500     MOVE "IX" TO XFILE-ORGANIZATION (1).
063600     MOVE "S" TO XLABEL-TYPE (1).
063700     MOVE 000001 TO XRECORD-NUMBER (1).
063800     MOVE 0 TO COUNT-OF-RECS.
063900
064000******************************************************************
064100*   TEST  1                                                      *
064200*         OPEN OUTPUT ...                 00 EXPECTED            *
064300*         IX-3, 1.3.4 (1) A                                      *
064400*    STATUS 00 CHECK ON OUTPUT FILE IX-FS3                       *
064500*    THE OUTPUT STATEMENT IS SUCCESSFULLY EXECUTED               *
064600******************************************************************
064700 OPN-INIT-GF-01-0.
064800     MOVE 1 TO STATUS-TEST-00.
064900     MOVE SPACES TO IX-FS3-STATUS.
065000     MOVE "OPEN I-O   : 00 EXP." TO FEATURE.
065100     MOVE "OPN-TEST-GF-01-0" TO PAR-NAME.
065200     OPEN
065300        I-O    IX-FS3.
065400     IF IX-FS3-STATUS EQUAL TO "00"
065500         GO TO OPN-PASS-GF-01-0.
065600 OPN-FAIL-GF-01-0.
065700     MOVE "IX-3, 1.3.4, (1) A. " TO RE-MARK.
065800     PERFORM FAIL.
065900     MOVE IX-FS3-STATUS TO COMPUTED-A.
066000     MOVE "00" TO CORRECT-X.
066100     GO TO OPN-WRITE-GF-01-0.
066200 OPN-PASS-GF-01-0.
066300     PERFORM PASS.
066400 OPN-WRITE-GF-01-0.
066500     PERFORM PRINT-DETAIL.
066600******************************************************************
066700*   TEST  5                                                      *
066800*         REWRITE WHERE THE LAST EXECUTED I-O STATEMENT PRIOR TO *
066900*         THE REWRITE WAS NOT A SUCCESSFULLY EXECUTED READ
067000*         STATEMENT.       STATUS 43 EXPECTED.
067100*         IX-3, 1.3.4 (3) A                                      *
067200******************************************************************
067300 RWR-INIT-GF-01-0.
067400     MOVE  5 TO TEST-NO.
067500     MOVE SPACES TO IX-FS3-STATUS.
067600     MOVE 0 TO STATUS-TEST-00.
067700     MOVE "REWRITE:     43 EXP." TO FEATURE.
067800     MOVE "RWR-TEST-GF-01-0" TO PAR-NAME.
067900*RWR-READ-GF-01-0.
068000*    READ IX-FS3 AT END GO TO RWR-TEST-GF-01-0.
068100*    GO TO RWR-READ-GF-01-0.
068200*RWR-TEST-GF-01-0.
068300*    READ IX-FS3 AT END GO TO RWR-TEST-GF-01-1.
068400*    MOVE FILE-RECORD-INFO (1) TO IX-FS3R1-F-G-240.
068500 RWR-TEST-GF-01-1.
068600     REWRITE IX-FS3R1-F-G-240.
068700     IF IX-FS3-STATUS EQUAL TO "43"
068800        MOVE "SHOULD HAVE EXECUTED DECLARATIVES IX-3,1.3.4(4)"
068900          TO RE-MARK
069000        GO TO RWR-WRITE-GF-01-0.
069100 RWR-FAIL-GF-01-0.
069200     MOVE "IX-5, 1.3.4, (5) C" TO RE-MARK.
069300 RWR-WRITE-GF-01-0.
069400     MOVE IX-FS3-STATUS TO COMPUTED-A.
069500     MOVE "43" TO CORRECT-X.
069600     PERFORM FAIL.
069700     PERFORM PRINT-DETAIL.
069800     CLOSE IX-FS3.
069900
070000 TERMINATE-ROUTINE.
070100     EXIT.
070200
070300 CCVS-EXIT SECTION.
070400 CCVS-999999.
070500     GO TO CLOSE-FILES.
