000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX209A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*         "IX209A"
002200******************************************************************
002300*    THE PURPOSE OF THIS PROGRAM IS TO TEST USE OF THE
002400*    START --- EQUAL TO --- STATEMENT USING FIRST THE PRIME
002500*    RECORD KEY AND THEN WITH EACH OF THE ALTERNATE RECORD KEYS
002600*    AS THE KEY OF REFERENCE.   THE START STATEMENT NAMES,
002700*    IN ITS CONSTRUCT , EITHER THE DATA NAME SPECIFIED IN THE
002800*    KEY CLAUSE OR A DATA ITEM THAT IS SUBORDINATE TO THE
002900*    KEY NAME.   DIFFERENT KEY VALUES ARE USED FOR TESTING.
003000*    IF A KEY VALUE IS PROVIDED WHICH MATCHES A RECORD IN THE FILE
003100*    WHEN THE START IS EXECUTED THEN THE RECORD IS EXPECTED TO
003200*    MADE AVAILABLE BY THE SUBSEQUENT READ STATEMENT.  IF A KEY
003300*    VALUE IS PROVIDED WHICH DOES NOT  MATCH ANY RECORD IN THE
003400*    FILE THEN THE INVALID KEY PATH IS EXPECTED TO BE TAKEN.
003500*    THE FILE STATUS CONTENTS RESULTING FROM EXECUTION OF THE
003600*    START TESTS ARE SAVED AND CHECKED IN LATER TESTS.
003700*
003800*            REFERENCE   AMERICAN NATIONAL STANDARD
003900*                        PROGRAMMING LANGUAGE COBOL, X3.23-198X.
004000*                        SECTION IX, INDEX I-O, THE START
004100*                        STATEMENT. PARAGRAPHS 4.7.3 (3), (4);
004200*                                              4.7.4 (1), (4), (5)
004300*                                                        AND
004400*                        THE FILE STATUS PARAGRAPH 1.3.4
004500*
004600*    BEFORE EXECUTION OF THE START IN EACH TEST, A RECORD IS MADE
004700*    AVAILABLE FROM THE FILE THAT IS DIFFERENT THAN WILL RESULT
004800*    FROM THE TEST, AND THE RECORD KEY IS LOADED WITH A KEY VALUE.
004900*    DEPENDING ON THE NATURE OF THE TEST THE KEY VALUE MAY OR
005000*    MAY NOT BE A VALID KEY FOR THE FILE.
005100*
005200*    THIS PROGRAM FIRST CREATES AN  INDEXED SEQUENTIAL FILE
005300*    CONTAINING TWO ALTERNATE KEYS AND  THE ONE REQUIRED RECORD
005400*    KEY FOR THE FILE.  IMMEDIATELY FOLLOWING FILE CREATION THE
005500*    FILE IS READ AND THE RECORDS OF THE FILE VERIFIED FOR
005600*    ACCURACY.  NEXT THE TESTS ARE EXECUTED USING THE START ---
005700*    EQUAL TO --- STATEMENT.
005800*    THE RECORDS IN THE FILE ARE CREATED IN SEQUENTIAL ORDER BY
005900*    RECORD KEY VALUE.  FOLLOWING  IS A SAMPLE OF THE DATA
006000*    CONTENTS FOR THE RECORD KEY AND TWO ALTERNATE RECORD KEYS IN
006100*    THE FILE.
006200*
006300*   REC-NO  RECORD-KEY      ALTERNATE-KEY-1     ALTERNATE-KEY-2
006400*   ------  ----------      ---------------     ---------------
006500*    001   BBBBBBBBBC002 EEEEEEEEEF000ALTKEY1 WWWWWWWWWV398ALTKEY2
006600*    002   BBBBBBBBCC004 EEEEEEEEFF004ALTKEY1 WWWWWWWWVV396ALTKEY2
006700*    003   BBBBBBBCCC006 EEEEEEEFFF006ALTKEY1 WWWWWWWVVV394ALTKEY2
006800*     .          .                 .                    .
006900*     .          .                 .                    .
007000*     .          .                 .                    .
007100*    010   CCCCCCCCCC020 FFFFFFFFFF020ALTKEY1 VVVVVVVVVV380ALTKEY2
007200*    011   CCCCCCCCCD022 FFFFFFFFFG022ALTKEY1 VVVVVVVVVV380ALTKEY2
007300*    012   CCCCCCCCDD024 FFFFFFFFGG024ALTKEY1 VVVVVVVVUU376ALTKEY2
007400*     .          .                 .                    .
007500*     .          .                 .                    .
007600*     .          .                 .                    .
007700*    200   UUUUUUUUUU400 YYYYYYYYYY400ALTKEY1 DDDDDDDDDD000ALTKEY2
007800*
007900*     NOTE 1 - ALTERNATE KEY NUMBER 2 CONTAINS DUPLICATE KEYS
008000*              EVERY 10TH AND 11TH RECORDS.
008100*
008200*     NOTE 2 - THE FIRST 50 RECORDS AND LAST 25 RECORDS OF THE
008300*    FILE FOLLOW THE ABOVE SEQUENTIAL KEY PATTERN.  FOR THE MIDDLE
008400*    125 RECORDS ONLY THE NUMBER PART OF THE KEYS ARE VARIED
008500*    AND VARIED IN THE SEQUENCE SHOWN ABOVE.  THAT IS, RECORD-KEY
008600*    AND ALTERNATE-KEY-1 ARE INCREMENTED BY 2 AND THE ALTERNATE-
008700*    KEY-2 IS DECREMENTED BY 2 EACH TIME A RECORD IS WRITTEN TO
008800*    THE FILE.  THE FILE IS DESIGNED TO BE LARGE ENOUGH SO THAT
008900*    AN I-O OPERATION IS REQUIRED FOR EACH RECORD ACCESSED FROM
009000*    THE FILE.
009100*
009200*    FILE CHARACTERISTICS ARE: FILE SIZE            = 200 RECORDS
009300*                              RECORD SIZE          = 240 CHARS.
009400*                              RECORD KEY SIZE      = 13  CHARS.
009500*                              ALTERNATE KEY 1 SIZE = 20  CHARS.
009600*                              ALTERNATE KEY 2 SIZE = 20  CHARS.
009700*                              ACCESS MODE          = SEQUENTIAL
009800*
009900*    A LIST OF COBOL ELEMENTS WITH THE PARAGRAPH NAME IN PARENTH-
010000*    ESIS THAT TESTS THE ELEMENT AND A SHORT DESCRIPTION OF THE
010100*    TEST FOLLOWS.
010200*
010300*      WRITE --- INVALID KEY---. (INX-TEST-001) - THIS TEST CREATE
010400*            A FILE OF 200 RECORDS CONTAINING ONE RECORD KEY AND
010500*            TWO ALTERNATE KEYS.
010600*      READ ---AT END ---. (INX-TEST-002) - THIS TEST READS THE
010700*            FILE CREATED IN INX-TEST-001 AND VERIFIES THAT   THE
010800*            FILE WAS CREATED CORRECTLY.
010900*      START --- KEY IS EQUAL TO RECORD-KEY INVALID KEY ---. (INX-
011000*            TEST-003.01 THRU INX-TEST-003.04) - THE START
011100*            STATEMENT IS EXECUTED USING THE RECORD-KEY FOR THE
011200*            FILE CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
011300*            RECORD IN THE FILE (.01), BETWEEN TWO EXISTING KEY
011400*            VALUES (02), LESS THAN THE FIRST RECORD IN THE FILE
011500*            (.03) AND GREATER THAN THAN THE LAST RECORD IN THE
011600*            FILE (.04).
011700*      START --- KEY IS EQUAL TO DATA-ITEM  INVALID KEY ---. (INX-
011800*            TEST-003.05 THRU INX-TEST-003.09) - THE START
011900*            STATEMENT IS EXECUTED USING A DATA ITEM WHICH IS
012000*            SUBORDINATE TO  THE RECORD-KEY NAME OF THE FILE
012100*            AND  CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
012200*            RECORD IN THE FILE (.05), EQUAL A VALUE PRESENT IN
012300*            IN MORE THAN ONE RECORD IN THE FILE (.06),
012400*            NOT EQUAL TO ANY RECORD IN THE FILE (.07, LESS THAN
012500*            THE FIRST RECORD IN THE FILE (.08) AND GREATER THAN
012600*            THE LAST RECORD IN THE FILE (.09.
012700*      FILE STATUS. (INX-TEST-004.01 THRU INX-TEST-004.09) - THESE
012800*            TESTS CHECK THE CONTENTS OF THE FILE STATUS RESULTING
012900*            FROM THE START IN INX-TEST-003.01 THRU
013000*            INX-TEST-003.09.
013100*      START --- KEY IS EQUAL TO ALTNATE-KEY INVALID KEY --. (INX-
013200*            TEST-005.01 THRU INX-TEST-005.04) - THE START
013300*            STATEMENT IS EXECUTED USING THE ALTERNATE-KEY FOR THE
013400*            FILE CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
013500*            RECORD IN THE FILE (.01), BETWEEN TWO EXISTING KEY
013600*            VALUES (02), LESS THAN THE FIRST RECORD IN THE FILE
013700*            (.03) AND GREATER THAN THAN THE LAST RECORD IN THE
013800*            FILE (.04).
013900*      START --- KEY IS EQUAL TO DATA-ITEM  INVALID KEY ---. (INX-
014000*            TEST-005.05 THRU INX-TEST-005.09) - THE START
014100*            STATEMENT IS EXECUTED USING A DATA ITEM WHICH IS
014200*            SUBORDINATE TO THE ALTERNATE-KEY NAME OF THE FILE
014300*            AND  CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
014400*            RECORD IN THE FILE (.05), EQUAL A VALUE PRESENT IN
014500*            IN MORE THAN ONE RECORD IN THE FILE (.06),
014600*            NOT EQUAL TO ANY RECORD IN THE FILE (.07, LESS THAN
014700*            THE FIRST RECORD IN THE FILE (.08) AND GREATER THAN
014800*            THE LAST RECORD IN THE FILE (.09.
014900*      FILE STATUS. (INX-TEST-006.01 THRU INX-TEST-006.09) - THESE
015000*            TESTS CHECK THE CONTENTS OF THE FILE STATUS RESULTING
015100*            FROM THE START IN INX-TEST-005.01 THRU
015200*            INX-TEST-005.09.
015300*      START --- KEY IS EQUAL TO ALTNATE-KEY INVALID KEY --. (INX-
015400*            TEST-007.01 THRU INX-TEST-007.04) - THE START
015500*            STATEMENT IS EXECUTED USING THE ALTERNATE-KEY
015600*            WHICH SPECIFIES THE DUPLICATES OPTION FOR THE FILE
015700*            AND  CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
015800*            RECORD IN THE FILE (.01), BETWEEN TWO EXISTING KEY
015900*            VALUES (02), LESS THAN THE FIRST RECORD IN THE FILE
016000*            (.03) AND GREATER THAN THAN THE LAST RECORD IN THE
016100*            FILE (.04).
016200*      START --- KEY IS EQUAL TO DATA-ITEM  INVALID KEY ---. (INX-
016300*            TEST-007.05 THRU INX-TEST-007.09) - THE START
016400*            STATEMENT IS EXECUTED USING A DATA ITEM WHICH IS
016500*            SUBORDINATE TO THE ALTERNATE-KEY W/DUP FOR THE FILE
016600*            AND  CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
016700*            RECORD IN THE FILE (.05), EQUAL A VALUE PRESENT IN
016800*            IN MORE THAN ONE RECORD IN THE FILE (.06),
016900*            NOT EQUAL TO ANY RECORD IN THE FILE (.07, LESS THAN
017000*            THE FIRST RECORD IN THE FILE (.08) AND GREATER THAN
017100*            THE LAST RECORD IN THE FILE (.09.
017200*      FILE STATUS. (INX-TEST-008.01 THRU INX-TEST-008.09) - THESE
017300*            TESTS CHECK THE CONTENTS OF THE FILE STATUS RESULTING
017400*            FROM THE START IN INX-TEST-007.01 THRU
017500*            INX-TEST-007.09.
017600*
017700******************************************************************
017800 ENVIRONMENT DIVISION.
017900 CONFIGURATION SECTION.
018000 SOURCE-COMPUTER.
018100     XXXXX082.
018200 OBJECT-COMPUTER.
018300     XXXXX083.
018400 INPUT-OUTPUT SECTION.
018500 FILE-CONTROL.
018600P    SELECT RAW-DATA   ASSIGN TO
018700P    XXXXX062
018800P           ORGANIZATION IS INDEXED
018900P           ACCESS MODE IS RANDOM
019000P           RECORD KEY IS RAW-DATA-KEY.
019100     SELECT PRINT-FILE ASSIGN TO
019200     XXXXX055.
019300     SELECT  IX-FS1
019400     ASSIGN TO
019500     XXXXX024
019600J    XXXXX044
019700        ACCESS MODE IS SEQUENTIAL
019800        ORGANIZATION IS INDEXED
019900        RECORD KEY IS IX-FS1-KEY
020000        ALTERNATE RECORD KEY IS IX-FS1-ALTKEY1
020100        ALTERNATE RECORD KEY IS IX-FS1-ALTKEY2 WITH DUPLICATES
020200        FILE STATUS IS FS1-STATUS.
020300 DATA DIVISION.
020400 FILE SECTION.
020500P
020600PFD  RAW-DATA.
020700P
020800P01  RAW-DATA-SATZ.
020900P    05  RAW-DATA-KEY        PIC X(6).
021000P    05  C-DATE              PIC 9(6).
021100P    05  C-TIME              PIC 9(8).
021200P    05  C-NO-OF-TESTS       PIC 99.
021300P    05  C-OK                PIC 999.
021400P    05  C-ALL               PIC 999.
021500P    05  C-FAIL              PIC 999.
021600P    05  C-DELETED           PIC 999.
021700P    05  C-INSPECT           PIC 999.
021800P    05  C-NOTE              PIC X(13).
021900P    05  C-INDENT            PIC X.
022000P    05  C-ABORT             PIC X(8).
022100 FD  PRINT-FILE.
022200 01  PRINT-REC PICTURE X(120).
022300 01  DUMMY-RECORD PICTURE X(120).
022400 FD  IX-FS1
022500C    LABEL RECORDS ARE STANDARD
022600C    DATA RECORD IS IX-FS1R1-F-G-240
022700     RECORD CONTAINS 240 CHARACTERS.
022800 01  IX-FS1R1-F-G-240.
022900     05 IX-FS1-REC-120           PICTURE X(120).
023000     05 IX-FS1-REC-121-240.
023100        10 FILLER                PICTURE X(8).
023200        10 IX-REC-KEY-AREA.
023300           15 IX-FS1-KEY.
023400              20 IX-FS1-KEY-1-10.
023500                 25 IX-FS1-KEY-1-5      PICTURE X(5).
023600                 25 IX-FS1-KEY-6-10     PICTURE X(5).
023700               20 IX-FS1-KEY-11-13      PICTURE X(3).
023800           15 FILLER             PICTURE X(16).
023900        10 FILLER                PICTURE X(9).
024000        10 IX-ALT-KEY1-AREA.
024100           15 IX-FS1-ALTKEY1.
024200              20 IX-FS1-ALTKEY1-1-10.
024300                 25 IX-FS1-ALTKEY1-1-5  PICTURE X(5).
024400                 25 IX-FS1-ALTKEY1-6-10 PICTURE X(5).
024500              20 IX-FS1-ALTKEY1-11-13   PICTURE X(3).
024600              20 IX-FS1-ALTKEY1-14-20   PICTURE X(7).
024700           15 FILLER             PICTURE X(9).
024800        10 FILLER                PICTURE X(9).
024900        10 IX-ALT-KEY2-AREA.
025000           15 IX-FS1-ALTKEY2.
025100              20 IX-FS1-ALTKEY2-1-10.
025200                 25 IX-FS1-ALTKEY2-1-5  PICTURE X(5).
025300                 25 IX-FS1-ALTKEY2-6-10 PICTURE X(5).
025400              20 IX-FS1-ALTKEY2-11-13   PICTURE X(3).
025500              20 IX-FS1-ALTKEY2-14-20   PICTURE X(7).
025600           15 FILLER             PICTURE X(9).
025700        10 FILLER                PICTURE X(7).
025800 WORKING-STORAGE SECTION.
025900 01  WRK-FS1-RECKEY.
026000     05 FS1-RECKEY-1-13.
026100        10 FS1-RECKEY-1-10       PICTURE X(10).
026200        10 FS1-RECKEY-11-13      PICTURE 9(3).
026300     05 FILLER                   PICTURE X(16)  VALUE SPACE.
026400 01  WRK-FS1-ALTKEY1.
026500      05 FS1-ALTKEY1-1-20.
026600       10  FS1-ALTKEY1-1-10.
026700        15 FS1-ALTKEY1-1-5       PICTURE X(5).
026800        15 FS1-ALTKEY1-6-10      PICTURE X(5).
026900       10 FS1-ALTKEY1-11-13      PICTURE 9(3).
027000       10 FS1-ALTKEY1-14-20      PICTURE X(7).
027100     05 FILLER                   PICTURE X(9)  VALUE SPACE.
027200 01  WRK-FS1-ALTKEY2.
027300     05 FS1-ALTKEY2-1-20.
027400        10 FS1-ALTKEY2-1-10.
027500           15 FS1-ALTKEY2-1-5    PICTURE X(5).
027600           15 FS1-ALTKEY2-6-10   PICTURE X(5).
027700        10 FS1-ALTKEY2-11-13     PICTURE 9(3).
027800        10 FS1-ALTKEY2-14-20     PICTURE X(7).
027900     05 FILLER                   PICTURE X(9) VALUE SPACE.
028000 01  RECNO                       PICTURE 9(5)  VALUE ZERO.
028100 01  FS1-STATUS                  PICTURE XX   VALUE SPACE.
028200 01  EXCUT-COUNTER-06V00         PICTURE 9(6) VALUE ZERO.
028300 01  KEYSUB                      PICTURE 9(3) COMPUTATIONAL.
028400 01  INVKEY-COUNTER              PICTURE 9(3) COMPUTATIONAL.
028500 01  RECORDS-WRITTEN             PICTURE 9(3).
028600 01  RECKEY-NUM                  PICTURE 9(3).
028700 01  ALTKEY1-NUM                 PICTURE 9(3).
028800 01  ALTKEY2-NUM                 PICTURE 9(3).
028900 01  RECORD-KEY-CONTENT.
029000     05 FILLER PIC X(53) VALUE
029100          "BBBBBBBBBC002EEEEEEEEEF002ALTKEY1WWWWWWWWWV398ALTKEY2".
029200     05 FILLER PIC X(53) VALUE
029300          "BBBBBBBBCC004EEEEEEEEFF004ALTKEY1WWWWWWWWVV396ALTKEY2".
029400     05 FILLER PIC X(53) VALUE
029500          "BBBBBBBCCC006EEEEEEEFFF006ALTKEY1WWWWWWWVVV394ALTKEY2".
029600     05 FILLER PIC X(53) VALUE
029700          "BBBBBBCCCC008EEEEEEFFFF008ALTKEY1WWWWWWVVVV392ALTKEY2".
029800     05 FILLER PIC X(53) VALUE
029900          "BBBBBCCCCC010EEEEEFFFFF010ALTKEY1WWWWWVVVVV390ALTKEY2".
030000     05 FILLER PIC X(53) VALUE
030100          "BBBBCCCCCC012EEEEFFFFFF012ALTKEY1WWWWVVVVVV388ALTKEY2".
030200     05 FILLER PIC X(53) VALUE
030300          "BBBCCCCCCC014EEEFFFFFFF014ALTKEY1WWWVVVVVVV386ALTKEY2".
030400     05 FILLER PIC X(53) VALUE
030500          "BBCCCCCCCC016EEFFFFFFFF016ALTKEY1WWVVVVVVVV384ALTKEY2".
030600     05 FILLER PIC X(53) VALUE
030700          "BCCCCCCCCC018EFFFFFFFFF018ALTKEY1WVVVVVVVVV382ALTKEY2".
030800     05 FILLER PIC X(53) VALUE
030900          "CCCCCCCCCC020FFFFFFFFFF020ALTKEY1VVVVVVVVVV380ALTKEY2".
031000     05 FILLER PIC X(53) VALUE
031100          "CCCCCCCCCD022FFFFFFFFFG022ALTKEY1VVVVVVVVVV380ALTKEY2".
031200     05 FILLER PIC X(53) VALUE
031300          "CCCCCCCCDD024FFFFFFFFGG024ALTKEY1VVVVVVVVUU376ALTKEY2".
031400     05 FILLER PIC X(53) VALUE
031500          "CCCCCCCDDD026FFFFFFFGGG026ALTKEY1VVVVVVVUUU374ALTKEY2".
031600     05 FILLER PIC X(53) VALUE
031700          "CCCCCCDDDD028FFFFFFGGGG028ALTKEY1VVVVVVUUUU372ALTKEY2".
031800     05 FILLER PIC X(53) VALUE
031900          "CCCCCDDDDD030FFFFFGGGGG030ALTKEY1VVVVVUUUUU370ALTKEY2".
032000     05 FILLER PIC X(53) VALUE
032100          "CCCCDDDDDD032FFFFGGGGGG032ALTKEY1VVVVUUUUUU368ALTKEY2".
032200     05 FILLER PIC X(53) VALUE
032300          "CCCDDDDDDD034FFFGGGGGGG034ALTKEY1VVVUUUUUUU366ALTKEY2".
032400     05 FILLER PIC X(53) VALUE
032500          "CCDDDDDDDD036FFGGGGGGGG036ALTKEY1VVUUUUUUUU364ALTKEY2".
032600     05 FILLER PIC X(53) VALUE
032700          "CDDDDDDDDD038FGGGGGGGGG038ALTKEY1VUUUUUUUUU362ALTKEY2".
032800     05 FILLER PIC X(53) VALUE
032900          "DDDDDDDDDD040GGGGGGGGGG040ALTKEY1UUUUUUUUUU360ALTKEY2".
033000     05 FILLER PIC X(53) VALUE
033100          "DDDDDDDDDE042GGGGGGGGGH042ALTKEY1UUUUUUUUUU360ALTKEY2".
033200     05 FILLER PIC X(53) VALUE
033300          "DDDDDDDDEE044GGGGGGGGHH044ALTKEY1UUUUUUUUTT356ALTKEY2".
033400     05 FILLER PIC X(53) VALUE
033500          "DDDDDDDEEE046GGGGGGGHHH046ALTKEY1UUUUUUUTTT354ALTKEY2".
033600     05 FILLER PIC X(53) VALUE
033700          "DDDDDDEEEE048GGGGGGHHHH048ALTKEY1UUUUUUTTTT352ALTKEY2".
033800     05 FILLER PIC X(53) VALUE
033900          "DDDDDEEEEE050GGGGGHHHHH050ALTKEY1UUUUUTTTTT350ALTKEY2".
034000     05 FILLER PIC X(53) VALUE
034100          "DDDDEEEEEE052GGGGHHHHHH052ALTKEY1UUUUTTTTTT348ALTKEY2".
034200     05 FILLER PIC X(53) VALUE
034300          "DDDEEEEEEE054GGGHHHHHHH054ALTKEY1UUUTTTTTTT346ALTKEY2".
034400     05 FILLER PIC X(53) VALUE
034500          "DDEEEEEEEE056GGHHHHHHHH056ALTKEY1UUTTTTTTTT344ALTKEY2".
034600     05 FILLER PIC X(53) VALUE
034700          "DEEEEEEEEE058GHHHHHHHHH058ALTKEY1UTTTTTTTTT342ALTKEY2".
034800     05 FILLER PIC X(53) VALUE
034900          "EEEEEEEEEE060HHHHHHHHHH060ALTKEY1TTTTTTTTTT340ALTKEY2".
035000     05 FILLER PIC X(53) VALUE
035100          "EEEEEEEEEF062HHHHHHHHHI062ALTKEY1TTTTTTTTTT340ALTKEY2".
035200     05 FILLER PIC X(53) VALUE
035300          "EEEEEEEEFF064HHHHHHHHII064ALTKEY1TTTTTTTTSS336ALTKEY2".
035400     05 FILLER PIC X(53) VALUE
035500          "EEEEEEEFFF066HHHHHHHIII066ALTKEY1TTTTTTTSSS334ALTKEY2".
035600     05 FILLER PIC X(53) VALUE
035700          "EEEEEEFFFF068HHHHHHIIII068ALTKEY1TTTTTTSSSS332ALTKEY2".
035800     05 FILLER PIC X(53) VALUE
035900          "EEEEEFFFFF070HHHHHIIIII070ALTKEY1TTTTTSSSSS330ALTKEY2".
036000     05 FILLER PIC X(53) VALUE
036100          "EEEEFFFFFF072HHHHIIIIII072ALTKEY1TTTTSSSSSS328ALTKEY2".
036200     05 FILLER PIC X(53) VALUE
036300          "EEEFFFFFFF074HHHIIIIIII074ALTKEY1TTTSSSSSSS326ALTKEY2".
036400     05 FILLER PIC X(53) VALUE
036500          "EEFFFFFFFF076HHIIIIIIII076ALTKEY1TTSSSSSSSS324ALTKEY2".
036600     05 FILLER PIC X(53) VALUE
036700          "EFFFFFFFFF078HIIIIIIIII078ALTKEY1TSSSSSSSSS322ALTKEY2".
036800     05 FILLER PIC X(53) VALUE
036900          "FFFFFFFFFF080IIIIIIIIII080ALTKEY1SSSSSSSSSS320ALTKEY2".
037000     05 FILLER PIC X(53) VALUE
037100          "FFFFFFFFFG082IIIIIIIIIJ082ALTKEY1SSSSSSSSSS320ALTKEY2".
037200     05 FILLER PIC X(53) VALUE
037300          "FFFFFFFFGG084IIIIIIIIJJ084ALTKEY1SSSSSSSSRR316ALTKEY2".
037400     05 FILLER PIC X(53) VALUE
037500          "FFFFFFFGGG086IIIIIIIJJJ086ALTKEY1SSSSSSSRRR314ALTKEY2".
037600     05 FILLER PIC X(53) VALUE
037700          "FFFFFFGGGG088IIIIIIJJJJ088ALTKEY1SSSSSSRRRR312ALTKEY2".
037800     05 FILLER PIC X(53) VALUE
037900          "FFFFFGGGGG090IIIIIJJJJJ090ALTKEY1SSSSSRRRRR310ALTKEY2".
038000     05 FILLER PIC X(53) VALUE
038100          "FFFFGGGGGG092IIIIJJJJJJ092ALTKEY1SSSSRRRRRR308ALTKEY2".
038200     05 FILLER PIC X(53) VALUE
038300          "FFFGGGGGGG094IIIJJJJJJJ094ALTKEY1SSSRRRRRRR306ALTKEY2".
038400     05 FILLER PIC X(53) VALUE
038500          "FFGGGGGGGG096IIJJJJJJJJ096ALTKEY1SSRRRRRRRR304ALTKEY2".
038600     05 FILLER PIC X(53) VALUE
038700          "FGGGGGGGGG098IJJJJJJJJJ098ALTKEY1SRRRRRRRRR302ALTKEY2".
038800     05 FILLER PIC X(53) VALUE
038900          "GGGGGGGGGG100JJJJJJJJJJ100ALTKEY1RRRRRRRRRR300ALTKEY2".
039000     05 FILLER PIC X(53) VALUE
039100          "RRRRSSSSSS352VVVVWWWWWW352ALTKEY1GGGGFFFFFF048ALTKEY2".
039200     05 FILLER PIC X(53) VALUE
039300          "RRRSSSSSSS354VVVWWWWWWW354ALTKEY1GGGFFFFFFF046ALTKEY2".
039400     05 FILLER PIC X(53) VALUE
039500          "RRSSSSSSSS356VVWWWWWWWW356ALTKEY1GGFFFFFFFF044ALTKEY2".
039600     05 FILLER PIC X(53) VALUE
039700          "RSSSSSSSSS358VWWWWWWWWW358ALTKEY1GFFFFFFFFF042ALTKEY2".
039800     05 FILLER PIC X(53) VALUE
039900          "SSSSSSSSSS360WWWWWWWWWW360ALTKEY1FFFFFFFFFF040ALTKEY2".
040000     05 FILLER PIC X(53) VALUE
040100          "SSSSSSSSST362WWWWWWWWWX362ALTKEY1FFFFFFFFFF040ALTKEY2".
040200     05 FILLER PIC X(53) VALUE
040300          "SSSSSSSSTT364WWWWWWWWXX364ALTKEY1FFFFFFFFEE036ALTKEY2".
040400     05 FILLER PIC X(53) VALUE
040500          "SSSSSSSTTT366WWWWWWWXXX366ALTKEY1FFFFFFFEEE034ALTKEY2".
040600     05 FILLER PIC X(53) VALUE
040700          "SSSSSSTTTT368WWWWWWXXXX368ALTKEY1FFFFFFEEEE032ALTKEY2".
040800     05 FILLER PIC X(53) VALUE
040900          "SSSSSTTTTT370WWWWWXXXXX370ALTKEY1FFFFFEEEEE030ALTKEY2".
041000     05 FILLER PIC X(53) VALUE
041100          "SSSSTTTTTT372WWWWXXXXXX372ALTKEY1FFFFEEEEEE028ALTKEY2".
041200     05 FILLER PIC X(53) VALUE
041300          "SSSTTTTTTT374WWWXXXXXXX374ALTKEY1FFFEEEEEEE026ALTKEY2".
041400     05 FILLER PIC X(53) VALUE
041500          "SSTTTTTTTT376WWXXXXXXXX376ALTKEY1FFEEEEEEEE024ALTKEY2".
041600     05 FILLER PIC X(53) VALUE
041700          "STTTTTTTTT378WXXXXXXXXX378ALTKEY1FEEEEEEEEE022ALTKEY2".
041800     05 FILLER PIC X(53) VALUE
041900          "TTTTTTTTTT380XXXXXXXXXX380ALTKEY1EEEEEEEEEE020ALTKEY2".
042000     05 FILLER PIC X(53) VALUE
042100          "TTTTTTTTTU382XXXXXXXXXY382ALTKEY1EEEEEEEEEE020ALTKEY2".
042200     05 FILLER PIC X(53) VALUE
042300          "TTTTTTTTUU384XXXXXXXXYY384ALTKEY1EEEEEEEEDD016ALTKEY2".
042400     05 FILLER PIC X(53) VALUE
042500          "TTTTTTTUUU386XXXXXXXYYY386ALTKEY1EEEEEEEDDD014ALTKEY2".
042600     05 FILLER PIC X(53) VALUE
042700          "TTTTTTUUUU388XXXXXXYYYY388ALTKEY1EEEEEEDDDD012ALTKEY2".
042800     05 FILLER PIC X(53) VALUE
042900          "TTTTTUUUUU390XXXXXYYYYY390ALTKEY1EEEEEDDDDD010ALTKEY2".
043000     05 FILLER PIC X(53) VALUE
043100          "TTTTUUUUUU392XXXXYYYYYY392ALTKEY1EEEEDDDDDD008ALTKEY2".
043200     05 FILLER PIC X(53) VALUE
043300          "TTTUUUUUUU394XXXYYYYYYY394ALTKEY1EEEDDDDDDD006ALTKEY2".
043400     05 FILLER PIC X(53) VALUE
043500          "TTUUUUUUUU396XXYYYYYYYY396ALTKEY1EEDDDDDDDD004ALTKEY2".
043600     05 FILLER PIC X(53) VALUE
043700          "TUUUUUUUUU398XYYYYYYYYY398ALTKEY1EDDDDDDDDD002ALTKEY2".
043800     05 FILLER PIC X(53) VALUE
043900          "UUUUUUUUUU400YYYYYYYYYY400ALTKEY1DDDDDDDDDD000ALTKEY2".
044000 01  RECORD-KEY-DATA   REDEFINES  RECORD-KEY-CONTENT.
044100     05 KEY-VALUES                  OCCURS 75  TIMES.
044200       10 RECKEY-VALUE           PICTURE X(13).
044300       10 ALTKEY1-VALUE          PICTURE X(20).
044400       10 ALTKEY2-VALUE          PICTURE X(20).
044500 01  INIT-FLAG                   PICTURE 9.
044600 01  HOLD-FILESTATUS-RECORD.
044700     05 FILESTATUS               PICTURE XX  OCCURS 10 TIMES.
044800 01  FILE-RECORD-INFORMATION-REC.
044900     03 FILE-RECORD-INFO-SKELETON.
045000        05 FILLER                 PICTURE X(48)       VALUE
045100             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
045200        05 FILLER                 PICTURE X(46)       VALUE
045300             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
045400        05 FILLER                 PICTURE X(26)       VALUE
045500             ",LFIL=000000,ORG=  ,LBLR= ".
045600        05 FILLER                 PICTURE X(37)       VALUE
045700             ",RECKEY=                             ".
045800        05 FILLER                 PICTURE X(38)       VALUE
045900             ",ALTKEY1=                             ".
046000        05 FILLER                 PICTURE X(38)       VALUE
046100             ",ALTKEY2=                             ".
046200        05 FILLER                 PICTURE X(7)        VALUE SPACE.
046300     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
046400        05 FILE-RECORD-INFO-P1-120.
046500           07 FILLER              PIC X(5).
046600           07 XFILE-NAME           PIC X(6).
046700           07 FILLER              PIC X(8).
046800           07 XRECORD-NAME         PIC X(6).
046900           07 FILLER              PIC X(1).
047000           07 REELUNIT-NUMBER     PIC 9(1).
047100           07 FILLER              PIC X(7).
047200           07 XRECORD-NUMBER       PIC 9(6).
047300           07 FILLER              PIC X(6).
047400           07 UPDATE-NUMBER       PIC 9(2).
047500           07 FILLER              PIC X(5).
047600           07 ODO-NUMBER          PIC 9(4).
047700           07 FILLER              PIC X(5).
047800           07 XPROGRAM-NAME        PIC X(5).
047900           07 FILLER              PIC X(7).
048000           07 XRECORD-LENGTH       PIC 9(6).
048100           07 FILLER              PIC X(7).
048200           07 CHARS-OR-RECORDS    PIC X(2).
048300           07 FILLER              PIC X(1).
048400           07 XBLOCK-SIZE          PIC 9(4).
048500           07 FILLER              PIC X(6).
048600           07 RECORDS-IN-FILE     PIC 9(6).
048700           07 FILLER              PIC X(5).
048800           07 XFILE-ORGANIZATION   PIC X(2).
048900           07 FILLER              PIC X(6).
049000           07 XLABEL-TYPE          PIC X(1).
049100        05 FILE-RECORD-INFO-P121-240.
049200           07 FILLER              PIC X(8).
049300           07 XRECORD-KEY          PIC X(29).
049400           07 FILLER              PIC X(9).
049500           07 ALTERNATE-KEY1      PIC X(29).
049600           07 FILLER              PIC X(9).
049700           07 ALTERNATE-KEY2      PIC X(29).
049800           07 FILLER              PIC X(7).
049900 01  TEST-RESULTS.
050000     02 FILLER                   PIC X      VALUE SPACE.
050100     02 FEATURE                  PIC X(20)  VALUE SPACE.
050200     02 FILLER                   PIC X      VALUE SPACE.
050300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
050400     02 FILLER                   PIC X      VALUE SPACE.
050500     02  PAR-NAME.
050600       03 FILLER                 PIC X(19)  VALUE SPACE.
050700       03  PARDOT-X              PIC X      VALUE SPACE.
050800       03 DOTVALUE               PIC 99     VALUE ZERO.
050900     02 FILLER                   PIC X(8)   VALUE SPACE.
051000     02 RE-MARK                  PIC X(61).
051100 01  TEST-COMPUTED.
051200     02 FILLER                   PIC X(30)  VALUE SPACE.
051300     02 FILLER                   PIC X(17)  VALUE
051400            "       COMPUTED=".
051500     02 COMPUTED-X.
051600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
051700     03 COMPUTED-N               REDEFINES COMPUTED-A
051800                                 PIC -9(9).9(9).
051900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
052000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
052100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
052200     03       CM-18V0 REDEFINES COMPUTED-A.
052300         04 COMPUTED-18V0                    PIC -9(18).
052400         04 FILLER                           PIC X.
052500     03 FILLER PIC X(50) VALUE SPACE.
052600 01  TEST-CORRECT.
052700     02 FILLER PIC X(30) VALUE SPACE.
052800     02 FILLER PIC X(17) VALUE "       CORRECT =".
052900     02 CORRECT-X.
053000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
053100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
053200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
053300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
053400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
053500     03      CR-18V0 REDEFINES CORRECT-A.
053600         04 CORRECT-18V0                     PIC -9(18).
053700         04 FILLER                           PIC X.
053800     03 FILLER PIC X(2) VALUE SPACE.
053900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
054000 01  CCVS-C-1.
054100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
054200-    "SS  PARAGRAPH-NAME
054300-    "       REMARKS".
054400     02 FILLER                     PIC X(20)    VALUE SPACE.
054500 01  CCVS-C-2.
054600     02 FILLER                     PIC X        VALUE SPACE.
054700     02 FILLER                     PIC X(6)     VALUE "TESTED".
054800     02 FILLER                     PIC X(15)    VALUE SPACE.
054900     02 FILLER                     PIC X(4)     VALUE "FAIL".
055000     02 FILLER                     PIC X(94)    VALUE SPACE.
055100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
055200 01  REC-CT                        PIC 99       VALUE ZERO.
055300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
055400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
055500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
055600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
055700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
055800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
055900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
056000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
056100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
056200 01  CCVS-H-1.
056300     02  FILLER                    PIC X(39)    VALUE SPACES.
056400     02  FILLER                    PIC X(42)    VALUE
056500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
056600     02  FILLER                    PIC X(39)    VALUE SPACES.
056700 01  CCVS-H-2A.
056800   02  FILLER                        PIC X(40)  VALUE SPACE.
056900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
057000   02  FILLER                        PIC XXXX   VALUE
057100     "4.2 ".
057200   02  FILLER                        PIC X(28)  VALUE
057300            " COPY - NOT FOR DISTRIBUTION".
057400   02  FILLER                        PIC X(41)  VALUE SPACE.
057500
057600 01  CCVS-H-2B.
057700   02  FILLER                        PIC X(15)  VALUE
057800            "TEST RESULT OF ".
057900   02  TEST-ID                       PIC X(9).
058000   02  FILLER                        PIC X(4)   VALUE
058100            " IN ".
058200   02  FILLER                        PIC X(12)  VALUE
058300     " HIGH       ".
058400   02  FILLER                        PIC X(22)  VALUE
058500            " LEVEL VALIDATION FOR ".
058600   02  FILLER                        PIC X(58)  VALUE
058700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
058800 01  CCVS-H-3.
058900     02  FILLER                      PIC X(34)  VALUE
059000            " FOR OFFICIAL USE ONLY    ".
059100     02  FILLER                      PIC X(58)  VALUE
059200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
059300     02  FILLER                      PIC X(28)  VALUE
059400            "  COPYRIGHT   1985 ".
059500 01  CCVS-E-1.
059600     02 FILLER                       PIC X(52)  VALUE SPACE.
059700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
059800     02 ID-AGAIN                     PIC X(9).
059900     02 FILLER                       PIC X(45)  VALUE SPACES.
060000 01  CCVS-E-2.
060100     02  FILLER                      PIC X(31)  VALUE SPACE.
060200     02  FILLER                      PIC X(21)  VALUE SPACE.
060300     02 CCVS-E-2-2.
060400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
060500         03 FILLER                   PIC X      VALUE SPACE.
060600         03 ENDER-DESC               PIC X(44)  VALUE
060700            "ERRORS ENCOUNTERED".
060800 01  CCVS-E-3.
060900     02  FILLER                      PIC X(22)  VALUE
061000            " FOR OFFICIAL USE ONLY".
061100     02  FILLER                      PIC X(12)  VALUE SPACE.
061200     02  FILLER                      PIC X(58)  VALUE
061300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
061400     02  FILLER                      PIC X(13)  VALUE SPACE.
061500     02 FILLER                       PIC X(15)  VALUE
061600             " COPYRIGHT 1985".
061700 01  CCVS-E-4.
061800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
061900     02 FILLER                       PIC X(4)   VALUE " OF ".
062000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
062100     02 FILLER                       PIC X(40)  VALUE
062200      "  TESTS WERE EXECUTED SUCCESSFULLY".
062300 01  XXINFO.
062400     02 FILLER                       PIC X(19)  VALUE
062500            "*** INFORMATION ***".
062600     02 INFO-TEXT.
062700       04 FILLER                     PIC X(8)   VALUE SPACE.
062800       04 XXCOMPUTED                 PIC X(20).
062900       04 FILLER                     PIC X(5)   VALUE SPACE.
063000       04 XXCORRECT                  PIC X(20).
063100     02 INF-ANSI-REFERENCE           PIC X(48).
063200 01  HYPHEN-LINE.
063300     02 FILLER  PIC IS X VALUE IS SPACE.
063400     02 FILLER  PIC IS X(65)    VALUE IS "************************
063500-    "*****************************************".
063600     02 FILLER  PIC IS X(54)    VALUE IS "************************
063700-    "******************************".
063800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
063900     "IX209A".
064000 PROCEDURE DIVISION.
064100 CCVS1 SECTION.
064200 OPEN-FILES.
064300P    OPEN I-O RAW-DATA.
064400P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
064500P    READ RAW-DATA INVALID KEY GO TO END-E-1.
064600P    MOVE "ABORTED " TO C-ABORT.
064700P    ADD 1 TO C-NO-OF-TESTS.
064800P    ACCEPT C-DATE  FROM DATE.
064900P    ACCEPT C-TIME  FROM TIME.
065000P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
065100PEND-E-1.
065200P    CLOSE RAW-DATA.
065300     OPEN    OUTPUT PRINT-FILE.
065400     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
065500     MOVE    SPACE TO TEST-RESULTS.
065600     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
065700     MOVE    ZERO TO REC-SKL-SUB.
065800     PERFORM CCVS-INIT-FILE 9 TIMES.
065900 CCVS-INIT-FILE.
066000     ADD     1 TO REC-SKL-SUB.
066100     MOVE    FILE-RECORD-INFO-SKELETON
066200          TO FILE-RECORD-INFO (REC-SKL-SUB).
066300 CCVS-INIT-EXIT.
066400     GO TO CCVS1-EXIT.
066500 CLOSE-FILES.
066600P    OPEN I-O RAW-DATA.
066700P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
066800P    READ RAW-DATA INVALID KEY GO TO END-E-2.
066900P    MOVE "OK.     " TO C-ABORT.
067000P    MOVE PASS-COUNTER TO C-OK.
067100P    MOVE ERROR-HOLD   TO C-ALL.
067200P    MOVE ERROR-COUNTER TO C-FAIL.
067300P    MOVE DELETE-COUNTER TO C-DELETED.
067400P    MOVE INSPECT-COUNTER TO C-INSPECT.
067500P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
067600PEND-E-2.
067700P    CLOSE RAW-DATA.
067800     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
067900 TERMINATE-CCVS.
068000S    EXIT PROGRAM.
068100STERMINATE-CALL.
068200     STOP     RUN.
068300 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
068400 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
068500 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
068600 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
068700     MOVE "****TEST DELETED****" TO RE-MARK.
068800 PRINT-DETAIL.
068900     IF REC-CT NOT EQUAL TO ZERO
069000             MOVE "." TO PARDOT-X
069100             MOVE REC-CT TO DOTVALUE.
069200     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
069300     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
069400        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
069500          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
069600     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
069700     MOVE SPACE TO CORRECT-X.
069800     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
069900     MOVE     SPACE TO RE-MARK.
070000 HEAD-ROUTINE.
070100     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
070200     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
070300     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
070400     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
070500 COLUMN-NAMES-ROUTINE.
070600     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
070700     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
070800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
070900 END-ROUTINE.
071000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
071100 END-RTN-EXIT.
071200     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
071300 END-ROUTINE-1.
071400      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
071500      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
071600      ADD PASS-COUNTER TO ERROR-HOLD.
071700*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
071800      MOVE PASS-COUNTER TO CCVS-E-4-1.
071900      MOVE ERROR-HOLD TO CCVS-E-4-2.
072000      MOVE CCVS-E-4 TO CCVS-E-2-2.
072100      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
072200  END-ROUTINE-12.
072300      MOVE "TEST(S) FAILED" TO ENDER-DESC.
072400     IF       ERROR-COUNTER IS EQUAL TO ZERO
072500         MOVE "NO " TO ERROR-TOTAL
072600         ELSE
072700         MOVE ERROR-COUNTER TO ERROR-TOTAL.
072800     MOVE     CCVS-E-2 TO DUMMY-RECORD.
072900     PERFORM WRITE-LINE.
073000 END-ROUTINE-13.
073100     IF DELETE-COUNTER IS EQUAL TO ZERO
073200         MOVE "NO " TO ERROR-TOTAL  ELSE
073300         MOVE DELETE-COUNTER TO ERROR-TOTAL.
073400     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
073500     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
073600      IF   INSPECT-COUNTER EQUAL TO ZERO
073700          MOVE "NO " TO ERROR-TOTAL
073800      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
073900      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
074000      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
074100     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
074200 WRITE-LINE.
074300     ADD 1 TO RECORD-COUNT.
074400Y    IF RECORD-COUNT GREATER 42
074500Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
074600Y        MOVE SPACE TO DUMMY-RECORD
074700Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
074800Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
074900Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
075000Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
075100Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
075200Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
075300Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
075400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
075500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
075600Y        MOVE ZERO TO RECORD-COUNT.
075700     PERFORM WRT-LN.
075800 WRT-LN.
075900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
076000     MOVE SPACE TO DUMMY-RECORD.
076100 BLANK-LINE-PRINT.
076200     PERFORM WRT-LN.
076300 FAIL-ROUTINE.
076400     IF     COMPUTED-X NOT EQUAL TO SPACE
076500            GO TO   FAIL-ROUTINE-WRITE.
076600     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
076700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
076800     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
076900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
077000     MOVE   SPACES TO INF-ANSI-REFERENCE.
077100     GO TO  FAIL-ROUTINE-EX.
077200 FAIL-ROUTINE-WRITE.
077300     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
077400     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
077500     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
077600     MOVE   SPACES TO COR-ANSI-REFERENCE.
077700 FAIL-ROUTINE-EX. EXIT.
077800 BAIL-OUT.
077900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
078000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
078100 BAIL-OUT-WRITE.
078200     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
078300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
078400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
078500     MOVE   SPACES TO INF-ANSI-REFERENCE.
078600 BAIL-OUT-EX. EXIT.
078700 CCVS1-EXIT.
078800     EXIT.
078900 SECT-0001-IX209A SECTION.
079000 WRITE-INT-GF-01.
079100     OPEN    OUTPUT IX-FS1.
079200     MOVE    "IX-FS1" TO XFILE-NAME           (1).
079300     MOVE    "R1-F-G" TO  XRECORD-NAME        (1).
079400     MOVE    ZERO     TO  XRECORD-NUMBER      (1).
079500     MOVE    "RC"     TO  CHARS-OR-RECORDS    (1).
079600     MOVE    CCVS-PGM-ID  TO  XPROGRAM-NAME       (1).
079700     MOVE    240      TO  XRECORD-LENGTH      (1).
079800     MOVE    001      TO  XBLOCK-SIZE         (1).
079900     MOVE    "IX"     TO  XFILE-ORGANIZATION  (1).
080000     MOVE    "S"      TO  XLABEL-TYPE         (1).
080100     MOVE    200      TO  RECORDS-IN-FILE     (1).
080200     MOVE    "CREATE-FILE-FS1" TO FEATURE.
080300     MOVE    "WRITE-TEST-GF-01" TO PAR-NAME.
080400     MOVE    ZERO TO KEYSUB.
080500     MOVE    ZERO TO INVKEY-COUNTER.
080600 WRITE-INIT-GF-01-01.
080700     PERFORM WRITE-TEST-GF-01-1  50 TIMES.
080800     PERFORM WRITE-TEST-GF-01-2  125 TIMES.
080900     PERFORM WRITE-TEST-GF-01-1  25 TIMES.
081000     GO TO   WRITE-TEST-GF-01.
081100 WRITE-TEST-GF-01-1.
081200     ADD     001  TO XRECORD-NUMBER (1).
081300     ADD     001  TO  KEYSUB.
081400     MOVE    RECKEY-VALUE (KEYSUB) TO FS1-RECKEY-1-13.
081500     MOVE    ALTKEY1-VALUE (KEYSUB) TO FS1-ALTKEY1-1-20.
081600     MOVE    ALTKEY2-VALUE (KEYSUB) TO FS1-ALTKEY2-1-20.
081700     MOVE    WRK-FS1-RECKEY   TO    XRECORD-KEY (1).
081800     MOVE    WRK-FS1-ALTKEY1  TO ALTERNATE-KEY1 (1).
081900     MOVE    WRK-FS1-ALTKEY2  TO ALTERNATE-KEY2 (1).
082000     MOVE    FILE-RECORD-INFO (1)  TO IX-FS1R1-F-G-240.
082100     WRITE   IX-FS1R1-F-G-240
082200                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
082300     ADD     001 TO  EXCUT-COUNTER-06V00.
082400 WRITE-TEST-GF-01-2.
082500     ADD     002  TO FS1-RECKEY-11-13.
082600     ADD     002 TO FS1-ALTKEY1-11-13.
082700     SUBTRACT  002 FROM FS1-ALTKEY2-11-13.
082800     ADD     001  TO XRECORD-NUMBER (1).
082900     MOVE    WRK-FS1-RECKEY   TO    XRECORD-KEY (1).
083000     MOVE    WRK-FS1-ALTKEY1  TO ALTERNATE-KEY1 (1).
083100     MOVE    WRK-FS1-ALTKEY2  TO ALTERNATE-KEY2 (1).
083200     MOVE    FILE-RECORD-INFO (1) TO IX-FS1R1-F-G-240.
083300     WRITE   IX-FS1R1-F-G-240
083400                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
083500     ADD     001 TO EXCUT-COUNTER-06V00.
083600 WRITE-TEST-GF-01.
083700     SUBTRACT INVKEY-COUNTER FROM EXCUT-COUNTER-06V00
083800             GIVING RECORDS-WRITTEN.
083900     MOVE    200  TO CORRECT-18V0.
084000     MOVE    RECORDS-WRITTEN TO COMPUTED-18V0.
084100     IF      RECORDS-WRITTEN EQUAL TO 200
084200             PERFORM  PASS
084300             ELSE
084400             PERFORM FAIL.
084500     MOVE    "RECORDS IN FILE" TO RE-MARK.
084600     PERFORM PRINT-DETAIL.
084700     GO TO   WRITE-TEST-GF-01-END.
084800 WRITE-DELETE-GF-01.
084900     MOVE    "WRITE-TEST-GF-01" TO PAR-NAME.
085000     PERFORM DE-LETE.
085100     PERFORM  PRINT-DETAIL.
085200 WRITE-TEST-GF-01-END.
085300     CLOSE   IX-FS1.
085400 READ-INIT-F1-01.
085500     OPEN    INPUT  IX-FS1.
085600     MOVE    "READ-TEST-F1-01" TO PAR-NAME.
085700     MOVE    "READ FILE IX-FS1" TO FEATURE.
085800     MOVE    ZERO TO EXCUT-COUNTER-06V00.
085900     MOVE    02   TO RECKEY-NUM.
086000     MOVE    002 TO ALTKEY1-NUM.
086100 READ-TEST-F1-01-R1.
086200     READ    IX-FS1  AT END  GO TO READ-TEST-F1-01.
086300     MOVE    IX-REC-KEY-AREA TO WRK-FS1-RECKEY.
086400     MOVE    IX-ALT-KEY1-AREA TO WRK-FS1-ALTKEY1.
086500     IF      FS1-RECKEY-11-13 EQUAL TO RECKEY-NUM
086600             AND FS1-ALTKEY1-11-13 EQUAL TO ALTKEY1-NUM
086700             NEXT SENTENCE
086800             ELSE
086900             PERFORM  READ-FAIL-F1-01.
087000     ADD     001  TO EXCUT-COUNTER-06V00.
087100     ADD     002  TO RECKEY-NUM
087200     ADD     002  TO ALTKEY1-NUM.
087300     GO TO   READ-TEST-F1-01-R1.
087400 READ-TEST-F1-01.
087500     IF      EXCUT-COUNTER-06V00 EQUAL TO 200
087600             PERFORM PASS ELSE
087700     MOVE "IX-28; 4.5.2 OR IX-41; 4.9.2 NOT COORECTLY EXECUTED"
087800                  TO RE-MARK
087900             PERFORM FAIL.
088000     MOVE    EXCUT-COUNTER-06V00 TO  COMPUTED-18V0.
088100     MOVE    200  TO  CORRECT-18V0.
088200     MOVE    "RECORDS IN FILE" TO RE-MARK.
088300     PERFORM PRINT-DETAIL.
088400     GO TO   READ-EXIT-F1-01.
088500 READ-FAIL-F1-01.
088600     PERFORM FAIL.
088700     MOVE    FS1-RECKEY-11-13  TO COMPUTED-18V0.
088800     MOVE    RECKEY-NUM  TO CORRECT-18V0.
088900     MOVE    "NUM EMBEDDED IN RECKEY"  TO RE-MARK.
089000     PERFORM PRINT-DETAIL.
089100 READ-EXIT-F1-01.
089200     CLOSE   IX-FS1.
089300 START-INIT-GF-01.
089400     OPEN    INPUT  IX-FS1.
089500     MOVE    "START EQ TO RECKEY"  TO FEATURE.
089600     MOVE    "START-TEST-GF-01" TO PAR-NAME.
089700     MOVE    "********************" TO HOLD-FILESTATUS-RECORD.
089800*
089900* THIS TEST TESTS THE  "START -- EQUAL TO" FOR PROPER POSITIONING
090000* OF THE RECORD POINTER FOR THE SUBSEQUENT READ STATEMENT.
090100* START-TEST-GF-01 USE ONLY THE PRIME RECORD KEY FOR ESTABLISHING
090200* THE CURRENT RECORD POINTER FOR THE FILE.  THE FOLLOWING IS A
090300* SUMMARY OF THE TEST CONDITIONS AND THE EXPECTED ACTION TO BE
090400* TAKEN FOR THE  TESTS.
090500*
090600*                      CONDITIONS (CONTENTS OF KEY) / ACTION
090700*
090800*   START-TEST-GF-01 - EQUAL A RECORD IN FILE / RECORD FOUND
090900*   START-TEST-GF-02 - BETWEEN 2 EXISTING KEY VALUES / INVALID KEY
091000*   START-TEST-GF-03 - LESS THAN FIRST FILE RECORD / INVALID KEY
091100*   START-TEST-GF-04 - GREATER THAN LAST FILE RECORD / INVALID KEY
091200*   START-TEST-GF-05 - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOUN
091300*   START-TEST-GF-06 - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOUN
091400*   START-TEST-GF-07 - UNEQUAL SIZE OPERANDS (UNEQUAL) / INVLD KEY
091500*   START-TEST-GF-08 - UNEQUAL SIZE OPERANDS (UNEQUAL) / INVLD KEY
091600*   START-TEST-GF-09 - UNEQUAL SIZE OPERANDS (UNEQUAL) /INVLD KEY
091700*
091800*  BEFORE EACH TEST A RECORD IS MADE AVAILABLE WHICH IS DIFFERENT
091900*  THAN THE ONE WHICH IS EXPECTED TO BE PRESENT FOLLOWING A TEST.
092000*  IF AN INVALID KEY IS EXPECTED FROM THE TEST, THE KEYS
092100*  ASSOCIATED WITH THE FILE WHICH ARE NOT PARTICIPATING IN THE
092200*  START STATEMENT WILL BE LOADED WITH VALUES WHICH WOULD
092300*  MATCH RECORDS IN THE FILE.  IF KEY MATCH IS EXPECTED FROM
092400*  THE TEST, THE KEYS ASSOCIATED WITH THE FILE WHICH ARE NOT
092500*  PARTICIPATING IN THE START STATEMENT WILL BE LOADED WITH
092600*  VALUES WHICH WOULD NOT MATCH RECORDS IN THE FILE.  THE FILE
092700*  STATUS FROM EXECUTION OF EACH START IS CAPTURED FOR LATER TESTS
092800*
092900 START-INIT-GF-01-01.
093000     PERFORM START-INITIALIZE-RECORD.
093100     MOVE    "START-TEST-GF-01" TO PAR-NAME.
093200     IF      INIT-FLAG NOT EQUAL TO ZERO
093300             MOVE   "**"  TO FILESTATUS (1)
093400             MOVE   "TEST IMPROPERLY INITIALIZED" TO RE-MARK
093500             GO TO START-DELETE-GF-01.
093600     MOVE    "CCCCCCCCCD022" TO FS1-RECKEY-1-13.
093700     MOVE    "EEEEEFFFFF022ALTKEY1"  TO FS1-ALTKEY1-1-20.
093800     MOVE    "EEEEEFFFFF022ALTKEY2" TO FS1-ALTKEY2-1-20.
093900     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
094000     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
094100     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
094200 START-TEST-GF-01.
094300*
094400*  START-TEST-GF-01 - THE START SHOULD FIND A RECORD IN THE FILE
094500*                    WHICH HAS A RECORD KEY VALUE OF
094600*                    CCCCCCCCCD022 (RECORD NUMBER 11).
094700*
094800     START   IX-FS1
094900                    KEY IS EQUAL TO IX-FS1-KEY
095000          INVALID KEY   MOVE FS1-STATUS TO FILESTATUS (1)
095100                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
095200                        GO TO START-FAIL-GF-01.
095300     MOVE    FS1-STATUS TO FILESTATUS (1).
095400     READ    IX-FS1  AT END
095500                     MOVE  "AT END ON READ" TO COMPUTED-A
095600                     GO TO START-FAIL-GF-01.
095700     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
095800     IF      XRECORD-NUMBER (1) EQUAL TO 11
095900             PERFORM PASS
096000             MOVE SPACE TO RE-MARK
096100             GO TO START-WRITE-GF-01.
096200     MOVE    11  TO RECNO.
096300     PERFORM DISPLAY-RECORD-KEYS.
096400     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
096500 START-FAIL-GF-01.
096600     PERFORM FAIL.
096700     MOVE    11   TO CORRECT-18V0.
096800     MOVE "IX-36; 4.7.2 ETC." TO RE-MARK.
096900     GO TO   START-WRITE-GF-01.
097000 START-DELETE-GF-01.
097100     PERFORM DE-LETE.
097200 START-WRITE-GF-01.
097300     PERFORM PRINT-DETAIL.
097400 START-INIT-GF-02.
097500     MOVE    "START-TEST-GF-02" TO PAR-NAME.
097600     PERFORM START-INITIALIZE-RECORD.
097700     IF      INIT-FLAG NOT EQUAL TO ZERO
097800             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
097900             MOVE   "**"  TO FILESTATUS (2)
098000             GO TO   START-DELETE-GF-02.
098100     MOVE    "EEEEEEEFFF067" TO FS1-RECKEY-1-13.
098200     MOVE    "HHHHHHHIII066ALTKEY1" TO FS1-ALTKEY1-1-20.
098300     MOVE    "TTTTTTTSSS334ALTKEY2" TO FS1-ALTKEY2-1-20.
098400     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
098500     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
098600     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
098700 START-TEST-GF-02.
098800*
098900*  START-TEST-GF-02 - THE START SHOULD NOT FIND A RECORD IN THE
099000*                    FILE WHICH HAS A RECORD KEY VALUE OF
099100*                    "EEEEEEEFFF067". THIS KEY VALUE IS
099200*                    SEQUENTIALLY LOCATED BETWEEN TWO CURRENTLY
099300*                    EXISTING RECORD KEYS IN THE FILE.
099400*
099500     START   IX-FS1
099600                     KEY IS EQUAL TO IX-FS1-KEY
099700          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (2)
099800                         GO TO START-PASS-GF-02.
099900     MOVE    FS1-STATUS TO FILESTATUS (2).
100000     READ    IX-FS1 AT END
100100                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
100200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
100300     PERFORM FAIL.
100400     MOVE "IX-36; 4.7.2 ETC." TO RE-MARK.
100500     MOVE    XRECORD-KEY (1) TO COMPUTED-A.
100600     MOVE    "INVALID KEY" TO CORRECT-A.
100700     GO TO   START-WRITE-GF-02.
100800 START-PASS-GF-02.
100900     PERFORM  PASS.
101000     GO TO   START-WRITE-GF-02.
101100 START-DELETE-GF-02.
101200     PERFORM DE-LETE.
101300 START-WRITE-GF-02.
101400     PERFORM PRINT-DETAIL.
101500 START-INIT-GF-03.
101600     PERFORM START-INITIALIZE-RECORD.
101700     MOVE    "START-TEST-GF-03" TO PAR-NAME.
101800     IF      INIT-FLAG NOT EQUAL TO ZERO
101900             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
102000             MOVE   "**"  TO FILESTATUS (3)
102100             GO TO   START-DELETE-GF-03.
102200     MOVE    "BBBBBBBBBC001"  TO FS1-RECKEY-1-13.
102300     MOVE    "EEEEEEEEEF002ALTKEY1"  TO FS1-ALTKEY1-1-20.
102400     MOVE    "WWWWWWWWWV398ALTKEY2"  TO FS1-ALTKEY2-1-20.
102500     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
102600     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
102700     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
102800 START-TEST-GF-03.
102900*
103000*  START-TEST-GF-03  - THE START STATEMENT SHOULD NOT FIND A
103100*                    RECORD IN THE FILE WHICH HAS A RECORD
103200*                    KEY VALUE OF "BBBBBBBBBC001".  THIS KEY
103300*                    VALUE IS SEQUENTIALLY LOWER THAN ANY
103400*                    CURRENTLY EXISTING KEY IN THE FILE.
103500*
103600     START   IX-FS1
103700                     KEY IS EQUAL TO IX-FS1-KEY
103800          INVALID KEY    MOVE FS1-STATUS TO FILESTATUS (3)
103900                     GO TO START-PASS-GF-03.
104000     MOVE    FS1-STATUS TO FILESTATUS (3).
104100     READ    IX-FS1  AT END
104200                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
104300     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
104400     MOVE "IX-36; 4.7.2 ETC." TO RE-MARK.
104500     PERFORM FAIL.
104600     MOVE    XRECORD-KEY (1)  TO COMPUTED-A.
104700     MOVE    "INVALID KEY"  TO CORRECT-A.
104800     GO TO START-WRITE-GF-03.
104900 START-PASS-GF-03.
105000     PERFORM PASS.
105100     GO TO   START-WRITE-GF-03.
105200 START-DELETE-GF-03.
105300     PERFORM DE-LETE.
105400 START-WRITE-GF-03.
105500     PERFORM PRINT-DETAIL.
105600 START-INIT-GF-04.
105700     MOVE "START-TEST-GF-04" TO PAR-NAME.
105800     PERFORM START-INITIALIZE-RECORD.
105900     IF      INIT-FLAG NOT EQUAL TO ZERO
106000             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
106100             MOVE   "**"  TO FILESTATUS (4)
106200             GO TO   START-DELETE-GF-04.
106300     MOVE    "UUUUUUUUUU401"  TO FS1-RECKEY-1-13.
106400     MOVE    "YYYYYYYYYY400ALTKEY1"  TO FS1-ALTKEY1-1-20.
106500     MOVE    "DDDDDDDDDD000ALTKEY2"  TO FS1-ALTKEY2-1-20.
106600     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
106700     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
106800     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
106900 START-TEST-GF-04.
107000*
107100*  START-TEST-GF-04  - THE START STATEMENT SHOULD NOT FIND A
107200*                    RECORD IN THE  FILE WHICH HAS A RECORD
107300*                    KEY VALUE OF "UUUUUUUUUU401".  THIS
107400*                    VALUE IS SEQUENTIALLY  ONE GREATER THAN
107500*                    ANY RECORD KEY CURRENTLY EXISTING IN
107600*                    THE FILE.  AN INVALID KEY CONDITION
107700*                    IS EXPECTED WHEN THE START IS EXECUTED.
107800*
107900     START   IX-FS1
108000                     KEY IS EQUAL TO IX-FS1-KEY
108100          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (4)
108200                         GO TO START-PASS-GF-04.
108300     MOVE    FS1-STATUS TO FILESTATUS (4).
108400     READ    IX-FS1 AT END
108500                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
108600     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
108700     MOVE "IX-36; 4.7.2 ETC." TO RE-MARK.
108800     PERFORM FAIL.
108900     MOVE    XRECORD-KEY (1) TO COMPUTED-A.
109000     MOVE    "INVALID KEY" TO CORRECT-A.
109100     GO TO   START-WRITE-GF-04.
109200 START-PASS-GF-04.
109300     PERFORM  PASS.
109400     GO TO   START-WRITE-GF-04.
109500 START-DELETE-GF-04.
109600     PERFORM DE-LETE.
109700 START-WRITE-GF-04.
109800     PERFORM PRINT-DETAIL.
109900 START-INIT-GF-05.
110000     MOVE "START-TEST-GF-05" TO PAR-NAME.
110100     PERFORM START-INITIALIZE-RECORD.
110200     IF      INIT-FLAG NOT EQUAL TO ZERO
110300             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
110400             MOVE   "**"  TO FILESTATUS (5)
110500             GO TO   START-DELETE-GF-05.
110600     MOVE    "CDDDDDDDDD039" TO FS1-RECKEY-1-13.
110700     MOVE    "IIIIIIIIJJ083ALTKEY1"  TO FS1-ALTKEY1-1-20.
110800     MOVE    "ABCXXXXXXX400ALTKEY2" TO FS1-ALTKEY2-1-20.
110900     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
111000     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
111100     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
111200 START-TEST-GF-05.
111300*  START-TEST-GF-05  - THE START STATEMENT USES AN OPERAND
111400*                    IN THE KEY PHRASE WHICH IS NOT THE NAME
111500*                    OF A RECORD   KEY BUT IS THE NAME OF A
111600*                    DATA ITEM WHICH IS SUBORDINATE TO THE
111700*                    RECORD KEY.  THE CONTENTS OF THE DATA ITEM
111800*                    (POSITIONS 1 THRU 5 OF THE RECORD KEY)
111900*                    IS A UNIQUE KEY VALUE FOR THE FILE. THE
112000*                    BALANCE OF THE KEY (POSITIONS 6 THRU 13) IS
112100*                    NOT A VALID KEY VALUE FOR THE FILE.  THE
112200*                    RECORD WITH THE RECORD KEY "CDDDDDDDDD038"
112300*                    (RECORD NUMBER 19) IS EXPECTED TO BE FOUND.
112400*
112500     START   IX-FS1
112600                    KEY IS EQUAL TO IX-FS1-KEY-1-5
112700          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (5)
112800                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
112900                     GO TO START-FAIL-GF-05.
113000     MOVE    FS1-STATUS TO FILESTATUS (5).
113100     READ    IX-FS1  AT END
113200                     MOVE  "AT END ON READ" TO COMPUTED-A
113300                     GO TO  START-FAIL-GF-05.
113400     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
113500     IF      XRECORD-NUMBER (1) EQUAL TO 19
113600             PERFORM  PASS
113700             GO TO START-WRITE-GF-05.
113800     MOVE    19  TO RECNO.
113900     PERFORM DISPLAY-RECORD-KEYS.
114000     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
114100 START-FAIL-GF-05.
114200     PERFORM  FAIL.
114300     MOVE    19  TO CORRECT-18V0.
114400     MOVE "IX-36; 4.7.2 ETC.; SUBORDINATE D-I OF KEY" TO RE-MARK.
114500     GO TO   START-WRITE-GF-05.
114600 START-DELETE-GF-05.
114700     PERFORM DE-LETE.
114800 START-WRITE-GF-05.
114900     PERFORM PRINT-DETAIL.
115000 START-INIT-GF-06.
115100     MOVE "START-TEST-GF-06" TO PAR-NAME.
115200     PERFORM START-INITIALIZE-RECORD.
115300     IF      INIT-FLAG NOT EQUAL TO ZERO
115400             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
115500             MOVE   "**"  TO FILESTATUS (6)
115600             GO TO   START-DELETE-GF-06.
115700     MOVE    "TTTTTUUUUU390"  TO FS1-RECKEY-1-13.
115800     MOVE    "XYYYYYYYYY399ALTKEY1"  TO FS1-ALTKEY1-1-20.
115900     MOVE    "WWWWWWWWWV399ALTKEY2"  TO FS1-ALTKEY2-1-20.
116000     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
116100     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
116200     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
116300 START-TEST-GF-06.
116400*
116500*  START-TEST-GF-06  - THE START STATEMENT USES AN OPERAND IN THE
116600*                    KEY PHRASE WHICH IS NOT THE NAME OF A RECORD
116700*                    KEY BUT IS THE NAME OF A DATA ITEM THAT IS
116800*                    SUBORDINATE TO THE RECORD KEY.  THE CONTENTS
116900*                    OF THE DATA ITEM (POSITIONS 1 THRU 5 OF THE
117000*                    RECORD KEY)  IS A DUPLICATE OF THE FIRST
117100*                    5 POSITIONS OF 5 OTHER RECORDS IN THE FILE.
117200*                    THIS TEST EXPECTS THE RECORD POINTER
117300*                    TO BE POSITIONED TO RECORD KEY TTTTTTTTTT380
117400*                    (RECORD NUMBER 190) WHICH WAS THE
117500*                    FIRST RECORD WRITTEN TO THE FILE THAT
117600*                    CONTAINS TTTTT IN THE FIRST 5 POSITIONS OF
117700*                    THE KEY.  THE RECORD KEY WAS LOADED WITH THE
117800*                    VALUE "TTTTTUUUUU390" (KEY FOR RECORD NUMBER
117900*                    195) BEFORE THE START WAS EXECUTED.
118000*
118100     START   IX-FS1
118200                    KEY IS EQUAL TO IX-FS1-KEY-1-5
118300          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (6)
118400                     MOVE  "INVALID KEY ON START"  TO COMPUTED-A
118500                     GO TO START-FAIL-GF-06.
118600     MOVE    FS1-STATUS TO FILESTATUS (6).
118700     READ    IX-FS1  AT END
118800                     MOVE "AT END ON READ" TO COMPUTED-A
118900                     GO TO START-FAIL-GF-06.
119000     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
119100     IF      XRECORD-NUMBER (1) EQUAL TO 190
119200             PERFORM  PASS
119300             GO TO START-WRITE-GF-06.
119400     MOVE    65  TO RECNO.
119500     PERFORM DISPLAY-RECORD-KEYS.
119600     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
119700 START-FAIL-GF-06.
119800     MOVE "IX-36; 4.7.2 ETC.; SUBORDINATE D-I OF KEY" TO RE-MARK.
119900     PERFORM  FAIL.
120000     MOVE    190   TO CORRECT-18V0.
120100     GO TO   START-WRITE-GF-06.
120200 START-DELETE-GF-06.
120300     PERFORM DE-LETE.
120400 START-WRITE-GF-06.
120500     PERFORM PRINT-DETAIL.
120600 START-INIT-GF-07.
120700     MOVE "START-TEST-GF-07" TO PAR-NAME.
120800     PERFORM START-INITIALIZE-RECORD.
120900     IF      INIT-FLAG NOT EQUAL TO ZERO
121000             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
121100             MOVE   "**"  TO FILESTATUS (7)
121200             GO TO   START-DELETE-GF-07.
121300     MOVE    "CCCCCCD022   " TO FS1-RECKEY-1-13.
121400     MOVE    "FFFFFFFFFG022ALTKEY1"  TO FS1-ALTKEY1-1-20.
121500     MOVE    "VVVVVVVVVV380ALTKEY2"  TO FS1-ALTKEY2-1-20.
121600     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
121700     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
121800     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
121900 START-TEST-GF-07.
122000*
122100*  START-TEST-GF-07  - THE START STATEMENT USES AN OPERAND IN THE
122200*                    KEY PHRASE OF THE START STATEMENT WHICH IS
122300*                    A DATA ITEM SUBORDINATE TO THE RECORD KEY
122400*                    NAME.  THE CONTENTS OF THE DATA ITEM
122500*                    (POSITIONS 1 THRU 10 OF THE RECORD KEY)
122600*                    IS LOADED WITH "CCCCCCD022".  NO SUCH RECORD
122700*                    SHOULD BE IN THE FILE.  IF IN THE COMPARSION,
122800*                    THE LONGER OPERAND IS TRUNCATED ON THE LEFT
122900*                    INSTEAD OF ON THE RIGHT THE CONTENTS OF
123000*                    THE DATA ITEM WILL MATCH A RECORD IN THE
123100*                    FILE.  THIS TEST EXPECTS THE LONGER OPERAND
123200*                    TO BE TRUNCATED ON THE RIGHT CAUSING NO
123300*                    DATA ITEM MATCH AND RESULTING IN AN INVALID
123400*                    KEY CONDITION WHEN THE START IS EXECUTED.
123500*
123600     START   IX-FS1
123700                    KEY IS EQUAL TO IX-FS1-KEY-1-10
123800          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (7)
123900                     GO TO START-PASS-GF-07.
124000     MOVE    FS1-STATUS TO FILESTATUS (7).
124100     READ    IX-FS1  AT END
124200                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
124300     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
124400     MOVE "IX-36; 4.7.2 ETC." TO RE-MARK.
124500     PERFORM FAIL.
124600     MOVE    XRECORD-KEY (1) TO COMPUTED-A.
124700     MOVE    "INVALID KEY" TO CORRECT-A.
124800     GO TO   START-WRITE-GF-07.
124900 START-PASS-GF-07.
125000     PERFORM PASS.
125100     GO TO   START-WRITE-GF-07.
125200 START-DELETE-GF-07.
125300     PERFORM DE-LETE.
125400 START-WRITE-GF-07.
125500     PERFORM PRINT-DETAIL.
125600 START-INIT-GF-08.
125700     MOVE "START-TEST-GF-08" TO PAR-NAME.
125800     PERFORM START-INITIALIZE-RECORD.
125900     IF      INIT-FLAG NOT EQUAL TO ZERO
126000             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
126100             MOVE   "**"  TO FILESTATUS (8)
126200             GO TO   START-DELETE-GF-08.
126300     MOVE    "ABBBBBBBBC002"  TO FS1-RECKEY-1-13.
126400     MOVE    "EEEEEEEEEF002ALTKEY1"  TO FS1-ALTKEY1-1-20.
126500     MOVE    "WWWWWWWWWW400ALTKEY2"  TO FS1-ALTKEY2-1-20.
126600     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
126700     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
126800     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
126900 START-TEST-GF-08.
127000*
127100*  START-TEST-GF-08  - THIS TEST USES AN OPERAND IN THE
127200*                    KEY PHRASE OF THE START STATEMENT WHICH IS
127300*                    A DATA ITEM SUBORDINATE TO THE RECORD KEY
127400*                    NAME.  THE CONTENTS OF THE DATA ITEM
127500*                    (POSITIONS 1 THRU 10 OF THE RECORD KEY) IS
127600*                    LOADED WITH "ABBBBBBBBC".  THIS KEY VALUE
127700*                    IS LOWER THAN ANY RECORD KEY VALUE IN
127800*                    POSITION 1 THRU 10 EXISTING IN THE FILE
127900*                    THEREFORE AN INVALID KEY CONDITION IS
128000*                    EXPECTED WHEN THE START STATEMENT IS
128100*                    EXECUTED.
128200*
128300     START   IX-FS1
128400                    KEY IS EQUAL TO IX-FS1-KEY-1-10
128500          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (8)
128600                     GO TO START-PASS-GF-08.
128700     MOVE    FS1-STATUS TO FILESTATUS (8).
128800     READ    IX-FS1  AT END
128900                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
129000     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
129100     MOVE "IX-36; 4.7.2 ETC." TO RE-MARK.
129200     PERFORM FAIL.
129300     MOVE    XRECORD-KEY (1)  TO COMPUTED-A.
129400     MOVE     "INVALID KEY" TO CORRECT-A.
129500     GO TO   START-WRITE-GF-08.
129600 START-PASS-GF-08.
129700     PERFORM PASS.
129800     GO TO   START-WRITE-GF-08.
129900 START-DELETE-GF-08.
130000     PERFORM DE-LETE.
130100 START-WRITE-GF-08.
130200     PERFORM PRINT-DETAIL.
130300 START-INIT-GF-09.
130400     MOVE "START-TEST-GF-09" TO PAR-NAME.
130500     PERFORM START-INITIALIZE-RECORD.
130600     IF      INIT-FLAG NOT EQUAL TO ZERO
130700             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
130800             MOVE   "**"  TO FILESTATUS (9)
130900             GO TO   START-DELETE-GF-09.
131000     MOVE    "UUUUUUUUUV400"  TO FS1-RECKEY-1-13.
131100     MOVE    "EEEEEEEEEF002ALTKEY1"  TO FS1-ALTKEY1-1-20.
131200     MOVE    "WWWWWWWWWV398ALTKEY2"  TO FS1-ALTKEY2-1-20.
131300     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
131400     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
131500     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
131600 START-TEST-GF-09.
131700*
131800*  START-TEST-GF-09  - THIS TEST USES AN OPERAND IN THE
131900*                    KEY PHRASE OF THE START STATEMENT WHICH IS
132000*                    A DATA ITEM SUBORDINATE TO THE RECORD KEY
132100*                    NAME.  THE CONTENTS OF THE DATA ITEM
132200*                    (POSITIONS 1 THRU 10 OF THE RECORD KEY) IS
132300*                    LOADED WITH "UUUUUUUUUV".  THIS KEY VALUE
132400*                    IS GREATER THAN ANY RECORD KEY VALUE IN
132500*                    POSITION 1 THRU 10 EXISTING IN THE FILE
132600*                    THEREFORE AN INVALID KEY CONDITION IS
132700*                    EXPECTED WHEN THE START STATEMENT IS
132800*                    EXECUTED.
132900*
133000     START   IX-FS1
133100                    KEY IS EQUAL TO IX-FS1-KEY-1-10
133200          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (9)
133300                     GO TO START-PASS-GF-09.
133400     MOVE    FS1-STATUS TO FILESTATUS (9).
133500     READ    IX-FS1  AT END
133600                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
133700     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
133800     MOVE "IX-36; 4.7.2 ETC." TO RE-MARK.
133900     PERFORM FAIL.
134000     MOVE    XRECORD-KEY (1)  TO COMPUTED-A.
134100     MOVE     "INVALID KEY" TO CORRECT-A.
134200     GO TO   START-WRITE-GF-09.
134300 START-PASS-GF-09.
134400     PERFORM PASS.
134500     GO TO   START-WRITE-GF-09.
134600 START-DELETE-GF-09.
134700     PERFORM DE-LETE.
134800 START-WRITE-GF-09.
134900     PERFORM PRINT-DETAIL.
135000     CLOSE   IX-FS1.
135100 START-INIT-GF-FILE-STATUS.
135200     MOVE "FILE STATUS START:00"   TO FEATURE.
135300     MOVE   "START-TEST-GF-10" TO PAR-NAME.
135400*
135500*  THIS SERIES OF TESTS CHECKS THE CONTENTS OF THE FILE STATUS
135600*
135700 START-TEST-GF-10.
135800     IF      FILESTATUS (1)  EQUAL TO "**"
135900             PERFORM DE-LETE
136000             GO TO  START-WRITE-GF-10.
136100*
136200*  START-TEST-GF-10 - THIS TEST CHECKS THE FILE STATUS CONTENTS
136300*                    RESULTING FROM START-TEST-GF-01.  THE FILE
136400*                    STATUS CONTENTS IS EXPECTED TO BE "00".
136500*
136600     IF      FILESTATUS (1)  EQUAL TO "00"
136700             PERFORM PASS
136800     ELSE
136900     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-01  " TO RE-MARK
137000             PERFORM  FAIL
137100             MOVE  "00"  TO CORRECT-A
137200             MOVE   FILESTATUS (1)  TO COMPUTED-A.
137300 START-WRITE-GF-10.
137400     PERFORM  PRINT-DETAIL.
137500 START-TEST-GF-11.
137600     MOVE "FILE STATUS START:23"   TO FEATURE.
137700     MOVE "START-TEST-GF-11" TO PAR-NAME.
137800     IF      FILESTATUS (2)  EQUAL TO "**"
137900             PERFORM DE-LETE
138000             GO TO  START-WRITE-GF-11.
138100*
138200*  START-TEST-GF-11 - THIS TEST CHECKS THE FILE STATUS CONTENTS
138300*                    RESULTING FROM START-TEST-GF-02. THE FILE
138400*                    STATUS CONTENTS IS EXPECTED TO BE "23".
138500*
138600     IF      FILESTATUS (2)  EQUAL TO "23"
138700             PERFORM  PASS
138800             ELSE  PERFORM  FAIL
138900     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-02  " TO RE-MARK
139000             MOVE    "23"  TO CORRECT-A
139100             MOVE   FILESTATUS (2)  TO COMPUTED-A.
139200 START-WRITE-GF-11.
139300     PERFORM  PRINT-DETAIL.
139400 START-TEST-GF-12.
139500     MOVE "FILE STATUS START:23"   TO FEATURE.
139600     MOVE "START-TEST-GF-12" TO PAR-NAME.
139700     IF      FILESTATUS (3)  EQUAL TO "**"
139800             PERFORM DE-LETE
139900             GO TO  START-WRITE-GF-12.
140000*
140100*  START-TEST-GF-12 - THIS TEST CHECKS THE FILE STATUS CONTENTS
140200*                    RESULTING FROM START-TEST-GF-03. THE FILE
140300*                    STATUS CONTENTS IS EXPECTED TO BE "23".
140400*
140500     IF      FILESTATUS (3)  EQUAL TO "23"
140600             PERFORM  PASS
140700             ELSE  PERFORM  FAIL
140800     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-03  " TO RE-MARK
140900             MOVE    "23"  TO CORRECT-A
141000             MOVE   FILESTATUS (3)  TO COMPUTED-A.
141100 START-WRITE-GF-12.
141200     PERFORM  PRINT-DETAIL.
141300 START-TEST-GF-13.
141400     MOVE "START-TEST-GF-13" TO PAR-NAME.
141500     MOVE "FILE STATUS START:23"   TO FEATURE.
141600     IF      FILESTATUS (4)  EQUAL TO "**"
141700             PERFORM DE-LETE
141800             GO TO  START-WRITE-GF-13.
141900*
142000*  START-TEST-GF-13 - THIS TEST CHECKS THE FILE STATUS CONTENTS
142100*                    RESULTING FROM START-TEST-GF-04. THE FILE
142200*                    STATUS CONTENTS IS EXPECTED TO BE "23".
142300*
142400     IF      FILESTATUS (4)  EQUAL TO "23"
142500             PERFORM  PASS
142600             ELSE  PERFORM  FAIL
142700     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-04  " TO RE-MARK
142800             MOVE    "23"  TO CORRECT-A
142900             MOVE   FILESTATUS (4)  TO COMPUTED-A.
143000 START-WRITE-GF-13.
143100     PERFORM  PRINT-DETAIL.
143200 START-TEST-GF-14.
143300     MOVE "START-TEST-GF-14" TO PAR-NAME.
143400     MOVE "FILE STATUS START:00"   TO FEATURE.
143500     IF      FILESTATUS (5)  EQUAL TO "**"
143600             PERFORM DE-LETE
143700             GO TO  START-WRITE-GF-14.
143800*
143900*  START-TEST-GF-14 - THIS TEST CHECKS THE FILE STATUS CONTENTS
144000*                    RESULTING FROM START-TEST-GF-05. THE FILE
144100*                    STATUS CONTENTS IS EXPECTED TO BE "00"
144200*
144300     IF      FILESTATUS (5)  EQUAL TO "00"
144400             PERFORM  PASS
144500             ELSE  PERFORM  FAIL
144600     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-05   " TO RE-MARK
144700             MOVE    "00"  TO CORRECT-A
144800             MOVE   FILESTATUS (5)  TO COMPUTED-A.
144900 START-WRITE-GF-14.
145000     PERFORM  PRINT-DETAIL.
145100 START-TEST-GF-15.
145200     MOVE "START-TEST-GF-15" TO PAR-NAME.
145300     MOVE "FILE STATUS START:00"   TO FEATURE.
145400     IF      FILESTATUS (6)  EQUAL TO "**"
145500             PERFORM DE-LETE
145600             GO TO  START-WRITE-GF-15.
145700*
145800*  START-TEST-GF-15 - THIS TEST CHECKS THE FILE STATUS CONTENTS
145900*                    RESULTING FROM START-TEST-GF-06. THE FILE
146000*                    STATUS CONTENTS IS EXPECTED TO BE "00"
146100*
146200     IF      FILESTATUS (6)  EQUAL TO "00"
146300             PERFORM  PASS
146400             ELSE  PERFORM  FAIL
146500     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-06   " TO RE-MARK
146600             MOVE   "00"  TO CORRECT-A
146700             MOVE   FILESTATUS (6)  TO COMPUTED-A.
146800 START-WRITE-GF-15.
146900     PERFORM  PRINT-DETAIL.
147000 START-TEST-GGF-16.
147100     MOVE "START-TEST-GF-16" TO PAR-NAME.
147200     MOVE "FILE STATUS START:23"   TO FEATURE.
147300     IF      FILESTATUS (7)  EQUAL TO "**"
147400             PERFORM DE-LETE
147500             GO TO  START-WRITE-GF-16.
147600*
147700*  START-TEST-GF-16 - THIS TEST CHECKS THE FILE STATUS CONTENTS
147800*                    RESULTING FROM START-TEST-GF-07. THE FILE
147900*                    STATUS CONTENTS IS EXPECTED TO BE "23"
148000*
148100     IF      FILESTATUS (7)  EQUAL TO "23"
148200             PERFORM  PASS
148300             ELSE  PERFORM  FAIL
148400     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-07   " TO RE-MARK
148500             MOVE    "23"  TO CORRECT-A
148600             MOVE   FILESTATUS (7)  TO COMPUTED-A.
148700 START-WRITE-GF-16.
148800     PERFORM  PRINT-DETAIL.
148900 START-TEST-GF-17.
149000     MOVE "START-TEST-GF-17" TO PAR-NAME.
149100     MOVE "FILE STATUS START:23"   TO FEATURE.
149200     IF      FILESTATUS (8)  EQUAL TO "**"
149300             PERFORM DE-LETE
149400             GO TO  START-WRITE-GF-17.
149500*
149600*  START-TEST-GF-07 - THIS TEST CHECKS THE FILE STATUS CONTENTS
149700*                    RESULTING FROM START-TEST-GF-08. THE FILE
149800*                    STATUS CONTENTS IS EXPECTED TO BE "23".
149900*
150000     IF      FILESTATUS (8)  EQUAL TO "23"
150100             PERFORM  PASS
150200             ELSE  PERFORM  FAIL
150300     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-08   " TO RE-MARK
150400             MOVE    "23"  TO CORRECT-A
150500             MOVE   FILESTATUS (8)  TO COMPUTED-A.
150600 START-WRITE-GF-17.
150700     PERFORM  PRINT-DETAIL.
150800 START-TEST-GF-18.
150900     MOVE "START-TEST-GF-18" TO PAR-NAME.
151000     MOVE "FILE STATUS START:23"   TO FEATURE.
151100     IF      FILESTATUS (9)  EQUAL TO "**"
151200             PERFORM DE-LETE
151300             GO TO  START-WRITE-GF-18.
151400*
151500*  START-TEST-GF-18 - THIS TEST CHECKS THE FILE STATUS CONTENTS
151600*                    RESULTING FROM START-TEST-GF-09. THE FILE
151700*                    STATUS CONTENTS IS EXPECTED TO BE "23".
151800*
151900     IF      FILESTATUS (9)  EQUAL TO "23"
152000             PERFORM PASS
152100     ELSE    PERFORM FAIL
152200     MOVE "IX-3; 1.3.4 (1) A; FROM START-TEST-GF-09   " TO RE-MARK
152300             MOVE  "23"  TO CORRECT-A
152400             MOVE   FILESTATUS (9)  TO COMPUTED-A.
152500 START-WRITE-GF-18.
152600     PERFORM  PRINT-DETAIL.
152700******************************************************************
152800
152900 START-INIT-005.
153000     OPEN    INPUT  IX-FS1.
153100     MOVE    "STR EQ ALTKY W/O DUP" TO FEATURE.
153200     MOVE    "START-TEST-GF-19" TO PAR-NAME.
153300     MOVE    "********************" TO HOLD-FILESTATUS-RECORD.
153400*
153500* THIS TEST TESTS THE  "START -- EQUAL TO" FOR PROPER POSITIONING
153600* OF THE RECORD POINTER FOR THE SUBSEQUENT READ STATEMENT.
153700* START-TEST-GF-19/27 USES ONLY THE ALTERNATE RECORD KEY WITHOUT
153800* THE DUPLICATES OPTION FOR ESTABLISHING THE CURRENT RECORD
153900* POINTER FOR THE FILE.  THE FOLLOWING IS A SUMMARY OF THE TEST
154000* CONDITIONS AND THE EXPECTED ACTION TO BE TAKEN FOR THE TESTS.
154100*
154200*                      CONDITIONS (CONTENTS OF KEY) / ACTION
154300*
154400*   START-TEST-GF-19  - EQUAL A RECORD IN FILE / RECORD FOUND
154500*   START-TEST-GF-20  - BETWEEN 2 EXISTING KEY VALUES / INVALID KE
154600*   START-TEST-GF-21  - LESS THAN FIRST FILE RECORD / INVALID KEY
154700*   START-TEST-GF-22  - GREATER THAN LAST FILE RECORD / INVALID KE
154800*   START-TEST-GF-23  - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOU
154900*   START-TEST-GF-24  - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOU
155000*   START-TEST-GF-25  - UNEQUAL SIZE OPERANDS (UNEQUAL) / INVLD KE
155100*   START-TEST-GF-26  - UNEQUAL SIZE OPERANDS (UNEQUAL) / INVLD KE
155200*   START-TEST-GF-27  - UNEQUAL SIZE OPERANDS (UNEQUAL) /INVLD KEY
155300*
155400*  BEFORE EACH TEST A RECORD IS MADE AVAILABLE WHICH IS DIFFERENT
155500*  THAN THE ONE WHICH IS EXPECTED TO BE PRESENT FOLLOWING A TEST.
155600*  IF AN INVALID KEY IS EXPECTED FROM THE TEST, THE KEYS
155700*  ASSOCIATED WITH THE FILE WHICH ARE NOT PARTICIPATING IN THE
155800*  START STATEMENT WILL BE LOADED WITH VALUES WHICH WOULD
155900*  MATCH RECORDS IN THE FILE.  IF KEY MATCH IS EXPECTED FROM
156000*  THE TEST, THE KEYS ASSOCIATED WITH THE FILE WHICH ARE NOT
156100*  PARTICIPATING IN THE START STATEMENT WILL BE LOADED WITH
156200*  VALUES WHICH WOULD NOT MATCH RECORDS IN THE FILE.  THE FILE
156300*  STATUS FROM EXECUTION OF EACH START IS CAPTURED FOR LATER TESTS
156400*
156500 START-INIT-GF-19.
156600     PERFORM START-INITIALIZE-RECORD.
156700     IF      INIT-FLAG NOT EQUAL TO ZERO
156800             MOVE   "**"  TO FILESTATUS (1)
156900             MOVE   "TEST IMPROPERLY INITIALIZED" TO RE-MARK
157000             GO TO START-DELETE-GF-19.
157100     MOVE    "CCCCCDDDDD022"  TO FS1-RECKEY-1-13.
157200     MOVE    "XXXXXXXXXY382ALTKEY1"  TO FS1-ALTKEY1-1-20.
157300     MOVE    "EEEEEFFFFF022ALTKEY2" TO FS1-ALTKEY2-1-20.
157400     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
157500     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
157600     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
157700 START-TEST-GF-19.
157800*
157900*  START-TEST-GF-19 - THE START SHOULD FIND A RECORD IN THE FILE
158000*                    WHICH HAS AN ALTERNATE KEY VALUE OF
158100*                    XXXXXXXXXY382ALTKEY1 (RECORD NUMBER 191).
158200*
158300     START   IX-FS1
158400                    KEY IS EQUAL TO IX-FS1-ALTKEY1
158500        INVALID KEY     MOVE FS1-STATUS TO FILESTATUS (1)
158600                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
158700                        GO TO START-FAIL-GF-19.
158800     MOVE    FS1-STATUS TO FILESTATUS (1).
158900     READ    IX-FS1  AT END
159000                     MOVE  "AT END ON READ" TO COMPUTED-A
159100                     GO TO START-FAIL-GF-19.
159200     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
159300     IF      XRECORD-NUMBER (1)  EQUAL TO 191
159400             PERFORM PASS
159500             MOVE SPACE TO RE-MARK
159600             GO TO START-WRITE-GF-19.
159700     MOVE    66  TO RECNO.
159800     PERFORM DISPLAY-ALTERNATE-KEY1.
159900     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
160000 START-FAIL-GF-19.
160100     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
160200     PERFORM FAIL.
160300     MOVE    191  TO CORRECT-18V0.
160400     GO TO   START-WRITE-GF-19.
160500 START-DELETE-GF-19.
160600     PERFORM DE-LETE.
160700 START-WRITE-GF-19.
160800     PERFORM PRINT-DETAIL.
160900 START-INIT-GF-20.
161000     MOVE "START-TEST-GF-20" TO PAR-NAME.
161100     PERFORM START-INITIALIZE-RECORD.
161200     IF      INIT-FLAG NOT EQUAL TO ZERO
161300             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
161400             MOVE   "**"  TO FILESTATUS (2)
161500             GO TO   START-DELETE-GF-20.
161600     MOVE    "EEEEEEEFFF066"  TO FS1-RECKEY-1-13.
161700     MOVE    "HHHHHHHIII067ALTKEY1"  TO FS1-ALTKEY1-1-20.
161800     MOVE    "TTTTTTTSSS334ALTKEY2" TO FS1-ALTKEY2-1-20.
161900     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
162000     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
162100     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
162200 START-TEST-GF-20.
162300*
162400*  START-TEST-GF.02  - THE START SHOULD NOT FIND A RECORD IN THE
162500*                    FILE WHICH HAS AN ALTERNATE KEY VALUE OF
162600*                    HHHHHHHIII067ALTKEY1.  THIS KEY VALUE IS
162700*                    SEQUENTIALLY LOCATED BETWEEN TWO CURRENTLY
162800*                    EXISTING ALTERNATE KEYS IN THE FILE.
162900*
163000     START   IX-FS1
163100                    KEY IS EQUAL TO IX-FS1-ALTKEY1
163200          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (2)
163300                         GO TO START-PASS-GF-20.
163400     MOVE    FS1-STATUS TO FILESTATUS (2).
163500     READ    IX-FS1 AT END
163600                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
163700     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
163800     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
163900     PERFORM FAIL.
164000     MOVE    ALTERNATE-KEY1 (1) TO COMPUTED-A.
164100     MOVE    "INVALID KEY" TO CORRECT-A.
164200     GO TO   START-WRITE-GF-20.
164300 START-PASS-GF-20.
164400     PERFORM  PASS.
164500     MOVE     "INVALID KEY"  TO RE-MARK.
164600     GO TO   START-WRITE-GF-20.
164700 START-DELETE-GF-20.
164800     PERFORM DE-LETE.
164900 START-WRITE-GF-20.
165000     PERFORM PRINT-DETAIL.
165100 START-INIT-GF-21.
165200     MOVE "START-TEST-GF-21" TO PAR-NAME.
165300     PERFORM START-INITIALIZE-RECORD.
165400     IF      INIT-FLAG NOT EQUAL TO ZERO
165500             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
165600             MOVE   "**"  TO FILESTATUS (3)
165700             GO TO   START-DELETE-GF-21.
165800     MOVE    "BBBBBBBBBC002"  TO FS1-RECKEY-1-13.
165900     MOVE   "EEEEEEEEEF001ALTKEY1"  TO FS1-ALTKEY1-1-20.
166000     MOVE    "WWWWWWWWWV398ALTKEY2"  TO FS1-ALTKEY2-1-20.
166100     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
166200     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
166300     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
166400 START-TEST-GF-21.
166500*
166600*  START-TEST-GF-21 - THE START STATEMENT SHOULD NOT FIND A
166700*                    RECORD IN THE FILE WHICH HAS AN ALTERNATE
166800*                    KEY VALUE OF EEEEEEEEEF001ALTKEY1.  THIS KEY
166900*                    VALUE IS SEQUENTIALLY LOWER THAN ANY
167000*                    CURRENTLY EXISTING KEY IN THE FILE.
167100*
167200     START   IX-FS1
167300                    KEY IS EQUAL TO IX-FS1-ALTKEY1
167400          INVALID KEY    MOVE FS1-STATUS TO FILESTATUS (3)
167500                     GO TO START-PASS-GF-21.
167600     MOVE    FS1-STATUS TO FILESTATUS (3).
167700     READ    IX-FS1  AT END
167800                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
167900     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
168000     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
168100     PERFORM FAIL.
168200     MOVE    ALTERNATE-KEY1 (1) TO COMPUTED-A.
168300     MOVE    "INVALID KEY"  TO CORRECT-A.
168400     GO TO START-WRITE-GF-21.
168500 START-PASS-GF-21.
168600     PERFORM PASS.
168700     MOVE    "INVALID KEY"  TO RE-MARK.
168800     GO TO   START-WRITE-GF-21.
168900 START-DELETE-GF-21.
169000     PERFORM DE-LETE.
169100 START-WRITE-GF-21.
169200     PERFORM PRINT-DETAIL.
169300 START-INIT-GF-22.
169400     MOVE "START-TEST-GF-22" TO PAR-NAME.
169500     PERFORM START-INITIALIZE-RECORD.
169600     IF      INIT-FLAG NOT EQUAL TO ZERO
169700             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
169800             MOVE   "**"  TO FILESTATUS (4)
169900             GO TO   START-DELETE-GF-22.
170000     MOVE    "UUUUUUUUUU400"  TO FS1-RECKEY-1-13.
170100     MOVE    "YYYYYYYYYY401ALTKEY1"  TO FS1-ALTKEY1-1-20.
170200     MOVE    "DDDDDDDDDD000ALTKEY2" TO FS1-ALTKEY2-1-20.
170300     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
170400     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
170500     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
170600 START-TEST-GF-22.
170700*
170800*  START-TEST-GF-22 - THE START STATEMENT SHOULD NOT FIND A
170900*                    RECORD IN THE FILE WHICH HAS AN ALTERNATE
171000*                    KEY VALUE OF YYYYYYYYYY401ALTKEY1.  THIS
171100*                    VALUE IS SEQUENTIALLY GREATER THAN
171200*                    ANY ALTERNATE KEY CURRENTLY EXISTING IN
171300*                    THE FILE.  AN INVALID KEY CONDITION
171400*                    IS EXPECTED WHEN THE START IS EXECUTED.
171500*
171600     START   IX-FS1
171700                    KEY IS EQUAL TO IX-FS1-ALTKEY1
171800          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (4)
171900                         GO TO START-PASS-GF-22.
172000     MOVE    FS1-STATUS TO FILESTATUS (4).
172100     READ    IX-FS1 AT END
172200                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
172300     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
172400     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
172500     PERFORM FAIL.
172600     MOVE    ALTERNATE-KEY1 (1) TO COMPUTED-A.
172700     MOVE    "INVALID KEY" TO CORRECT-A.
172800     GO TO   START-WRITE-GF-22.
172900 START-PASS-GF-22.
173000     PERFORM  PASS.
173100     GO TO   START-WRITE-GF-22.
173200 START-DELETE-GF-22.
173300     PERFORM DE-LETE.
173400 START-WRITE-GF-22.
173500     PERFORM PRINT-DETAIL.
173600 START-INIT-GF-23.
173700     MOVE "START-TEST-GF-23" TO PAR-NAME.
173800     PERFORM START-INITIALIZE-RECORD.
173900     IF      INIT-FLAG NOT EQUAL TO ZERO
174000             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
174100             MOVE   "**"  TO FILESTATUS (5)
174200             GO TO   START-DELETE-GF-23.
174300     MOVE    "CDDDDDDDDD039"  TO FS1-RECKEY-1-13.
174400     MOVE    "GGGGHXXXXX052ALTKEY1" TO FS1-ALTKEY1-1-20.
174500     MOVE    "ABCXXXXXXX400ALTKEY2"  TO FS1-ALTKEY2-1-20.
174600     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
174700     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
174800     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
174900 START-TEST-GF-23.
175000*  START-TEST-GF-23 - THE START STATEMENT USES AN OPERAND
175100*                    IN THE KEY PHRASE WHICH IS NOT THE NAME
175200*                    OF AN ALTERNATE KEY BUT IS THE NAME OF A
175300*                    DATA ITEM WHICH IS SUBORDINATE TO THE
175400*                    ALTERNATE KEY.  THE CONTENTS OF THE DATA ITEM
175500*                    (POSITIONS 1 THRU 5 OF THE ALTERNATE KEY)
175600*                    IS A UNIQUE KEY VALUE FOR THE FILE.  THE
175700*                    BALANCE OF THE KEY (POSITIONS 6 THRU 13 OF
175800*                    THE ALTERNATE KEY IS NOT A VALID KEY VALUE
175900*                    FOR THE FILE.  THE
176000*                    RECORD WITH THE ALTERNATE KEY "GGGGHHHHHH052
176100*                    ALTKEY1 (RECORD NUMBER 26) IS EXPECTED TO
176200*                    BE FOUND.
176300*
176400     START   IX-FS1
176500                    KEY IS EQUAL TO IX-FS1-ALTKEY1-1-5
176600          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (5)
176700                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
176800                     GO TO START-FAIL-GF-23.
176900     MOVE    FS1-STATUS TO FILESTATUS (5).
177000     READ    IX-FS1  AT END
177100                     MOVE  "AT END ON READ" TO COMPUTED-A
177200                     GO TO  START-FAIL-GF-23.
177300     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
177400     IF      XRECORD-NUMBER (1)  EQUAL TO 26
177500             PERFORM  PASS
177600             GO TO START-WRITE-GF-23.
177700     MOVE    26  TO RECNO.
177800     PERFORM DISPLAY-ALTERNATE-KEY1.
177900     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
178000 START-FAIL-GF-23.
178100     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
178200     PERFORM  FAIL.
178300     MOVE    26  TO CORRECT-18V0.
178400     GO TO   START-WRITE-GF-23.
178500 START-DELETE-GF-23.
178600     PERFORM DE-LETE.
178700 START-WRITE-GF-23.
178800     PERFORM PRINT-DETAIL.
178900 START-INIT-GF-24.
179000     MOVE "START-TEST-GF-24" TO PAR-NAME.
179100     PERFORM START-INITIALIZE-RECORD.
179200     IF      INIT-FLAG NOT EQUAL TO ZERO
179300             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
179400             MOVE   "**"  TO FILESTATUS (6)
179500             GO TO   START-DELETE-GF-24.
179600     MOVE    "YYYYYUUUUU390"  TO FS1-RECKEY-1-13.
179700     MOVE    "XXXXXYYYYY390ALTKEY1"  TO FS1-ALTKEY1-1-20.
179800     MOVE    "WWWWWWWWWV399ALTKEY2"  TO FS1-ALTKEY2-1-20.
179900     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
180000     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
180100     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
180200 START-TEST-GF-24.
180300*
180400*  START-TEST-GF-24 - THE START STATEMENT USES AN OPERAND IN THE
180500*                    KEY PHRASE WHICH IS NOT THE NAME OF AN
180600*                    ALTERNATE KEY BUT IS THE NAME OF A DATA ITEM
180700*                    THAT IS SUBORDINATE TO THE KEY.  THE CONTENTS
180800*                    OF THE DATA ITEM (POSITIONS 1 THRU 5 OF THE
180900*                    ALTERNATE KEY) IS A DUPLICATE OF THE FIRST
181000*                    5 POSITIONS OF 5 OTHER RECORDS IN THE FILE.
181100*                    THIS TEST EXPECTS THE RECORD POINTER
181200*                    TO BE POSITIONED TO RECORD KEY XXXXXXXXXX380
181300*                    ALTKEY1 (RECORD NUMBER 190) WHICH WAS THE
181400*                    FIRST RECORD WRITTEN TO THE FILE THAT
181500*                    CONTAINS XXXXX IN THE FIRST 5 POSITIONS OF
181600*                  THE KEY.  THE ALTERNATE KEY WAS LOADED WITH THE
181700*                    VALUE XXXXXYYYYY390ALTKEY1 (KEY FOR RECORD
181800*                     NUMBER 195) BEFORE THE START WAS EXECUTED.
181900*
182000     START   IX-FS1
182100                    KEY IS EQUAL TO IX-FS1-ALTKEY1-1-5
182200          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (6)
182300                     MOVE  "INVALID KEY ON START"  TO COMPUTED-A
182400                     GO TO START-FAIL-GF-24.
182500     MOVE    FS1-STATUS TO FILESTATUS (6).
182600     READ    IX-FS1  AT END
182700                     MOVE "AT END ON READ" TO COMPUTED-A
182800                     GO TO START-FAIL-GF-24.
182900     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
183000     IF      XRECORD-NUMBER (1) EQUAL TO 190
183100             PERFORM  PASS
183200             GO TO START-WRITE-GF-24.
183300     MOVE    65  TO RECNO.
183400     PERFORM DISPLAY-ALTERNATE-KEY1.
183500     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
183600 START-FAIL-GF-24.
183700     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
183800     PERFORM  FAIL.
183900     MOVE    190   TO CORRECT-18V0.
184000     GO TO   START-WRITE-GF-24.
184100 START-DELETE-GF-24.
184200     PERFORM DE-LETE.
184300 START-WRITE-GF-24.
184400     PERFORM PRINT-DETAIL.
184500 START-INIT-GF-25.
184600     MOVE "START-TEST-GF-25" TO PAR-NAME.
184700     PERFORM START-INITIALIZE-RECORD.
184800     IF      INIT-FLAG NOT EQUAL TO ZERO
184900             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
185000             MOVE   "**"  TO FILESTATUS (7)
185100             GO TO   START-DELETE-GF-25.
185200     MOVE    "CCCCCCCCCD022"  TO FS1-RECKEY-1-13.
185300     MOVE    "022ALTKEY1          "  TO FS1-ALTKEY1-1-20.
185400     MOVE    "VVVVVVVVVV380ALTKEY2"  TO FS1-ALTKEY2-1-20.
185500     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
185600     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
185700     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
185800 START-TEST-GF-25.
185900*
186000*  START-TEST-GF-25 - THE START STATEMENT USES AN OPERAND IN THE
186100*                    KEY PHRASE OF THE START STATEMENT WHICH IS
186200*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
186300*                    NAME.  THE CONTENTS OF THE DATA ITEM
186400*                    POSITIONS 1 THRU 10 OF THE ALTERNATE KEY)
186500*                    IS LOADED WITH "022ALTKEY1". NO SUCH RECORD
186600*                    SHOULD BE IN THE FILE.  IF IN THE COMPARSION,
186700*                    THE LONGER OPERAND IS TRUNCATED ON THE LEFT
186800*                    INSTEAD OF ON THE RIGHT THE CONTENTS OF
186900*                    THE DATA ITEM WILL MATCH A RECORD IN THE
187000*                    FILE.  THIS TEST EXPECTS THE LONGER OPERAND
187100*                    TO BE TRUNCATED ON THE RIGHT CAUSING NO
187200*                    DATA ITEM MATCH AND RESULTING IN AN INVALID
187300*                    KEY CONDITION WHEN THE START IS EXECUTED.
187400*
187500     START  IX-FS1
187600                   KEY IS EQUAL TO IX-FS1-ALTKEY1-1-10
187700          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (7)
187800                     GO TO START-PASS-GF-25.
187900     MOVE    FS1-STATUS TO FILESTATUS (7).
188000     READ    IX-FS1  AT END
188100                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
188200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
188300     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
188400     PERFORM FAIL.
188500     MOVE    XRECORD-KEY (1) TO COMPUTED-A.
188600     MOVE    "INVALID KEY" TO CORRECT-A.
188700     GO TO   START-WRITE-GF-25.
188800 START-PASS-GF-25.
188900     PERFORM PASS.
189000     GO TO   START-WRITE-GF-25.
189100 START-DELETE-GF-25.
189200     PERFORM DE-LETE.
189300 START-WRITE-GF-25.
189400     PERFORM PRINT-DETAIL.
189500 START-INIT-GF-26.
189600     MOVE "START-TEST-GF-26" TO PAR-NAME.
189700     PERFORM START-INITIALIZE-RECORD.
189800     IF      INIT-FLAG NOT EQUAL TO ZERO
189900             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
190000             MOVE   "**"  TO FILESTATUS (8)
190100             GO TO   START-DELETE-GF-26.
190200     MOVE    "BBBBBBBBBC002"  TO FS1-RECKEY-1-13.
190300     MOVE    "EEEEEEEEEE002ALTKEY1"  TO FS1-ALTKEY1-1-20.
190400     MOVE    "WWWWWWWWWV398ALTKEY2"  TO FS1-ALTKEY2-1-20.
190500     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
190600     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
190700     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
190800 START-TEST-GF-26.
190900*
191000*  START-TEST-GF-26 - THIS TEST USES AN OPERAND IN THE
191100*                    KEY PHRASE OF THE START STATEMENT WHICH IS
191200*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
191300*                    NAME.  THE CONTENTS OF THE DATA ITEM
191400*                    (POSITIONS 1 THRU 10 OF THE RECORD KEY) IS
191500*                    LOADED WITH "EEEEEEEEEE". THIS KEY VALUE
191600*                    IS LOWER THAN ANY ALTERNATE KEY VALUE IN
191700*                    POSITION 1 THRU 10 EXISTING IN THE FILE
191800*                    THEREFORE AN INVALID KEY CONDITION IS
191900*                    EXPECTED WHEN THE START STATEMENT IS
192000*                    EXECUTED.
192100*
192200     START  IX-FS1
192300                   KEY IS EQUAL TO IX-FS1-ALTKEY1-1-10
192400          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (8)
192500                     GO TO START-PASS-GF-26.
192600     MOVE    FS1-STATUS TO FILESTATUS (8).
192700     READ    IX-FS1  AT END
192800                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
192900     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
193000     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
193100     PERFORM FAIL.
193200     MOVE    XRECORD-KEY (1)  TO COMPUTED-A.
193300     MOVE     "INVALID KEY" TO CORRECT-A.
193400     GO TO   START-WRITE-GF-26.
193500 START-PASS-GF-26.
193600     PERFORM PASS.
193700     GO TO   START-WRITE-GF-26.
193800 START-DELETE-GF-26.
193900     PERFORM DE-LETE.
194000 START-WRITE-GF-26.
194100     PERFORM PRINT-DETAIL.
194200 START-INIT-GF-27.
194300     MOVE "START-TEST-GF-27" TO PAR-NAME.
194400     PERFORM START-INITIALIZE-RECORD.
194500     IF      INIT-FLAG NOT EQUAL TO ZERO
194600             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
194700             MOVE   "**"  TO FILESTATUS (9)
194800             GO TO   START-DELETE-GF-27.
194900     MOVE    "UUUUUUUUUU400"  TO FS1-RECKEY-1-13.
195000     MOVE    "YYYYYZYYYY400ALTKEY1"  TO FS1-ALTKEY1-1-20.
195100     MOVE    "WWWWWWWWWV398ALTKEY2"  TO FS1-ALTKEY2-1-20.
195200     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
195300     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
195400     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
195500 START-TEST-GF-27.
195600*
195700*  START-TEST-GF-27 - THIS TEST USES AN OPERAND IN THE
195800*                    KEY PHRASE OF THE START STATEMENT WHICH IS
195900*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
196000*                    NAME.  THE CONTENTS OF THE DATA ITEM
196100*                    (POSITIONS 1 THRU 10 OF THE RECORD KEY) IS
196200*                    LOADED WITH "YYYYYZYYYY". THIS KEY VALUE
196300*                    IS GREATER THAN ANY ALTERNATE KEY VALUE IN
196400*                    POSITION 1 THRU 10 EXISTING IN THE FILE
196500*                    THEREFORE AN INVALID KEY CONDITION IS
196600*                    EXPECTED WHEN THE START STATEMENT IS
196700*                    EXECUTED.
196800*
196900     START  IX-FS1
197000                   KEY IS EQUAL TO IX-FS1-ALTKEY1-1-10
197100          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (9)
197200                     GO TO START-PASS-GF-27.
197300     MOVE    FS1-STATUS TO FILESTATUS (9).
197400     READ    IX-FS1  AT END
197500                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
197600     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
197700     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
197800     PERFORM FAIL.
197900     MOVE    XRECORD-KEY (1)  TO COMPUTED-A.
198000     MOVE     "INVALID KEY" TO CORRECT-A.
198100     GO TO   START-WRITE-GF-27.
198200 START-PASS-GF-27.
198300     PERFORM PASS.
198400     GO TO   START-WRITE-GF-27.
198500 START-DELETE-GF-27.
198600     PERFORM DE-LETE.
198700 START-WRITE-GF-27.
198800     PERFORM PRINT-DETAIL.
198900
199000     CLOSE   IX-FS1.
199100
199200 START-INIT-FILE-STATUS-2.
199300     MOVE             "FILE STATUS START:00"   TO FEATURE.
199400     MOVE "START-TEST-GF-28" TO PAR-NAME.
199500*
199600*  THIS SERIES OF TESTS CHECKS THE CONTENTS OF THE FILE STATUS
199700*  CAPTURED FROM THE LAST NINE TSTS.
199800*
199900 START-TEST-GF-28.
200000     IF      FILESTATUS (1)  EQUAL TO "**"
200100             PERFORM DE-LETE
200200             GO TO  START-WRITE-GF-28.
200300*
200400*  START-TEST-GF-28 - THIS TEST CHECKS THE FILE STATUS CONTENTS
200500*                    RESULTING FROM START-TEST-GF-19. THE FILE
200600*                    STATUS CONTENTS IS EXPECTED TO BE "00".
200700*
200800     IF      FILESTATUS (1)  EQUAL TO "00"
200900             PERFORM PASS
201000     ELSE
201100     MOVE "IX-3; 1.3.4 (1) A FROM START-TEST-GF-19    " TO RE-MARK
201200             PERFORM  FAIL
201300             MOVE  "00"  TO CORRECT-A
201400             MOVE   FILESTATUS (1)  TO COMPUTED-A.
201500 START-WRITE-GF-28.
201600     PERFORM  PRINT-DETAIL.
201700 START-TEST-GF-29.
201800     MOVE             "FILE STATUS START:23"   TO FEATURE.
201900     MOVE "START-TEST-GF-29" TO PAR-NAME.
202000     IF      FILESTATUS (2)  EQUAL TO "**"
202100             PERFORM DE-LETE
202200             GO TO  START-WRITE-GF-29.
202300*
202400*  START-TEST-GF-29 - THIS TEST CHECKS THE FILE STATUS CONTENTS
202500*                    RESULTING FROM START-TEST-GF-20. THE FILE
202600*                    STATUS CONTENTS IS EXPECTED TO BE "23".
202700*
202800     IF      FILESTATUS (2)  EQUAL TO "23"
202900             PERFORM  PASS
203000             ELSE  PERFORM  FAIL
203100     MOVE "IX-4; 1.3.4 (3) C ; SEE START-TEST-GF-20   " TO RE-MARK
203200             MOVE    "23"  TO CORRECT-A
203300             MOVE   FILESTATUS (2)  TO COMPUTED-A.
203400 START-WRITE-GF-29.
203500     PERFORM  PRINT-DETAIL.
203600 START-TEST-GF-30.
203700     MOVE             "FILE STATUS START:23"   TO FEATURE.
203800     MOVE "START-TEST-GF-30" TO PAR-NAME.
203900     IF      FILESTATUS (3)  EQUAL TO "**"
204000             PERFORM DE-LETE
204100             GO TO  START-WRITE-GF-30.
204200*
204300*  START-TEST-GF-30 - THIS TEST CHECKS THE FILE STATUS CONTENTS
204400*                    RESULTING FROM START-TEST-GF-21. THE FILE
204500*                    STATUS CONTENTS IS EXPECTED TO BE "23".
204600*
204700     IF      FILESTATUS (3)  EQUAL TO "23"
204800             PERFORM  PASS
204900             ELSE  PERFORM  FAIL
205000     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-21    " TO RE-MARK
205100             MOVE    "23"  TO CORRECT-A
205200             MOVE   FILESTATUS (3)  TO COMPUTED-A.
205300 START-WRITE-GF-30.
205400     PERFORM  PRINT-DETAIL.
205500 START-TEST-GF-31.
205600     MOVE             "FILE STATUS START:23"   TO FEATURE.
205700     MOVE "START-TEST-GF-31" TO PAR-NAME.
205800     IF      FILESTATUS (4)  EQUAL TO "**"
205900             PERFORM DE-LETE
206000             GO TO  START-WRITE-GF-31.
206100*
206200*  START-TEST-GF-31 - THIS TEST CHECKS THE FILE STATUS CONTENTS
206300*                    RESULTING FROM START-TEST-GF-22. THE FILE
206400*                    STATUS CONTENTS IS EXPECTED TO BE "23".
206500*
206600     IF      FILESTATUS (4)  EQUAL TO "23"
206700             PERFORM  PASS
206800             ELSE  PERFORM  FAIL
206900     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-22    " TO RE-MARK
207000             MOVE    "23"  TO CORRECT-A
207100             MOVE   FILESTATUS (4)  TO COMPUTED-A.
207200 START-WRITE-GF-31.
207300     PERFORM  PRINT-DETAIL.
207400 START-TEST-GF-32.
207500     MOVE             "FILE STATUS START:00"   TO FEATURE.
207600     MOVE "START-TEST-GF-32" TO PAR-NAME.
207700     IF      FILESTATUS (5)  EQUAL TO "**"
207800             PERFORM DE-LETE
207900             GO TO  START-WRITE-GF-32.
208000*
208100*  START-TEST-GF.05  - THIS TEST CHECKS THE FILE STATUS CONTENTS
208200*                    RESULTING FROM START-TEST-GF-23. THE FILE
208300*                    STATUS CONTENTS IS EXPECTED TO BE "00"
208400*
208500     IF      FILESTATUS (5)  EQUAL TO "00"
208600             PERFORM  PASS
208700             ELSE  PERFORM  FAIL
208800     MOVE "IX-3; 1.3.4 (1) A; SEE START-TEST-GF-23    " TO RE-MARK
208900             MOVE    "00"  TO CORRECT-A
209000             MOVE   FILESTATUS (5)  TO COMPUTED-A.
209100 START-WRITE-GF-32.
209200     PERFORM  PRINT-DETAIL.
209300 START-TEST-GF-33.
209400     MOVE             "FILE STATUS START:00"   TO FEATURE.
209500     MOVE "START-TEST-GF-33" TO PAR-NAME.
209600     IF      FILESTATUS (6)  EQUAL TO "**"
209700             PERFORM DE-LETE
209800             GO TO  START-WRITE-GF-33.
209900*
210000*  START-TEST-GF-33  - THIS TEST CHECKS THE FILE STATUS CONTENTS
210100*                    RESULTING FROM START-TEST-GF-24. THE FILE
210200*                    STATUS CONTENTS IS EXPECTED TO BE "00"
210300*
210400     IF      FILESTATUS (6)  EQUAL TO "00"
210500             PERFORM  PASS
210600             ELSE  PERFORM  FAIL
210700     MOVE "IX-3; 1.3.4 (1) A; SEE START-TEST-GF-24    " TO RE-MARK
210800             MOVE   "00"  TO CORRECT-A
210900             MOVE   FILESTATUS (6)  TO COMPUTED-A.
211000 START-WRITE-GF-33.
211100     PERFORM  PRINT-DETAIL.
211200 START-TEST-GF-34.
211300     MOVE             "FILE STATUS START:23"   TO FEATURE.
211400     MOVE "START-TEST-GF-34" TO PAR-NAME.
211500     IF      FILESTATUS (7)  EQUAL TO "**"
211600             PERFORM DE-LETE
211700             GO TO  START-WRITE-GF-34.
211800*
211900*  START-TEST-GF-34  - THIS TEST CHECKS THE FILE STATUS CONTENTS
212000*                    RESULTING FROM START-TEST-GF-25. THE FILE
212100*                    STATUS CONTENTS IS EXPECTED TO BE "23"
212200*
212300     IF      FILESTATUS (7)  EQUAL TO "23"
212400             PERFORM  PASS
212500             ELSE  PERFORM  FAIL
212600     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-25    " TO RE-MARK
212700             MOVE    "23"  TO CORRECT-A
212800             MOVE   FILESTATUS (7)  TO COMPUTED-A.
212900 START-WRITE-GF-34.
213000     PERFORM  PRINT-DETAIL.
213100 START-TEST-GF-35.
213200     MOVE             "FILE STATUS START:23"   TO FEATURE.
213300     MOVE "START-TEST-GF-35" TO PAR-NAME.
213400     IF      FILESTATUS (8)  EQUAL TO "**"
213500             PERFORM DE-LETE
213600             GO TO  START-WRITE-GF-35.
213700*
213800*  START-TEST-GF-35  - THIS TEST CHECKS THE FILE STATUS CONTENTS
213900*                    RESULTING FROM START-TEST-GF-26. THE FILE
214000*                    STATUS CONTENTS IS EXPECTED TO BE "23".
214100*
214200     IF      FILESTATUS (8)  EQUAL TO "23"
214300             PERFORM  PASS
214400             ELSE  PERFORM  FAIL
214500     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-26    " TO RE-MARK
214600             MOVE    "23"  TO CORRECT-A
214700             MOVE   FILESTATUS (8)  TO COMPUTED-A.
214800 START-WRITE-GF-35.
214900     PERFORM  PRINT-DETAIL.
215000 START-TEST-GF-36.
215100     MOVE             "FILE STATUS START:23"   TO FEATURE.
215200     MOVE "START-TEST-GF-36" TO PAR-NAME.
215300     IF      FILESTATUS (9)  EQUAL TO "**"
215400             PERFORM DE-LETE
215500             GO TO  START-WRITE-GF-36.
215600*
215700*  START-TEST-GF-36 - THIS TEST CHECKS THE FILE STATUS CONTENTS
215800*                    RESULTING FROM START-TEST-GF-27. THE FILE
215900*                    STATUS CONTENTS IS EXPECTED TO BE "23".
216000*
216100     IF      FILESTATUS (9)  EQUAL TO "23"
216200             PERFORM PASS
216300     ELSE    PERFORM FAIL
216400     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-27    " TO RE-MARK
216500             MOVE  "23"  TO CORRECT-A
216600             MOVE   FILESTATUS (9)  TO COMPUTED-A.
216700 START-WRITE-GF-36.
216800     PERFORM  PRINT-DETAIL.
216900
217000
217100 START-INIT-GF-37-ETC.
217200     OPEN    INPUT  IX-FS1.
217300     MOVE    "STRT EQ ALTKY W/DUP"  TO FEATURE.
217400     MOVE    "START-TEST-GF-37" TO PAR-NAME.
217500     MOVE    "********************" TO HOLD-FILESTATUS-RECORD.
217600*
217700* THIS TEST TESTS THE  "START -- EQUAL TO" FOR PROPER POSITIONING
217800* OF THE RECORD POINTER FOR THE SUBSEQUENT READ STATEMENT.
217900* START-TEST-007 USES ONLY THE ALTERNATE RECORD KEY WITH DUPLI-
218000* CATES OPTION (ALTERNATE-KEY2) FOR ESTABLISHING
218100* THE CURRENT RECORD POINTER FOR THE FILE.  THE FOLLOWING IS A
218200* SUMMARY OF THE TEST CONDITIONS AND THE EXPECTED ACTION TO BE
218300* TAKEN FOR THE  TESTS.
218400*
218500*                      CONDITIONS (CONTENTS OF KEY) / ACTION
218600*
218700*   START-TEST-GF-37 - EQUAL A RECORD IN FILE / RECORD FOUND
218800*   START-TEST-GF-38 - BETWEEN 2 EXISTING KEY VALUES / INVALID KEY
218900*   START-TEST-GF-39 - LESS THAN FIRST FILE RECORD / INVALID KEY
219000*   START-TEST-GF-40 - GREATER THAN LAST FILE RECORD / INVALID KEY
219100*   START-TEST-GF-41 - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOUN
219200*   START-TEST-GF-42 - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOUN
219300*   START-TEST-GF-43 - UNEQUAL SIZE OPERANDS (UNEQUAL) / INVLD KEY
219400*   START-TEST-GF-44 - UNEQUAL SIZE OPERANDS (UNEQUAL) / INVLD KEY
219500*   START-TEST-GF-45 - UNEQUAL SIZE OPERANDS (UNEQUAL) /INVLD KEY
219600*
219700*  BEFORE EACH TEST A RECORD IS MADE AVAILABLE WHICH IS DIFFERENT
219800*  THAN THE ONE WHICH IS EXPECTED TO BE PRESENT FOLLOWING A TEST.
219900*  IF AN INVALID KEY IS EXPECTED FROM THE TEST, THE KEYS
220000*  ASSOCIATED WITH THE FILE WHICH ARE NOT PARTICIPATING IN THE
220100*  START STATEMENT WILL BE LOADED WITH VALUES WHICH WOULD MATCH
220200*  RECORDS IN THE FILE.  IF A KEY MATCH IS EXPECTED FROM
220300*  THE TEST, THE KEYS ASSOCIATED WITH THE FILE WHICH ARE NOT
220400*  PARTICIPATING IN THE START STATEMENT WILL BE LOADED WITH
220500*  VALUES WHICH WOULD NOT MATCH RECORDS IN THE FILE.  THE FILE
220600*  STATUS FROM EXECUTION OF EACH START IS CAPTURED FOR LATER TESTS
220700*
220800 START-INIT-GF-37.
220900     MOVE "START-TEST-GF-37" TO PAR-NAME.
221000     PERFORM START-INITIALIZE-RECORD.
221100     IF      INIT-FLAG NOT EQUAL TO ZERO
221200             MOVE   "**"  TO FILESTATUS (1)
221300             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
221400             GO TO START-DELETE-GF-37.
221500     MOVE    "CCCCCDDDDD022" TO FS1-RECKEY-1-13.
221600     MOVE    "EEEEEFFFFF022ALTKEY1"  TO FS1-ALTKEY1-1-20.
221700     MOVE    "VVVVVVVVUU376ALTKEY2"  TO FS1-ALTKEY2-1-20.
221800     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
221900     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
222000     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
222100 START-TEST-GF-37.
222200*
222300*  START-TEST-GF-37 - THE START SHOULD FIND A RECORD IN THE FILE
222400*                    WHICH HAS AN ALTERNATE RECORD KEY VALUE OF
222500*                    VVVVVVVVUU376ALTKEY2 (RECORD NUMBER 12).
222600*
222700     START  IX-FS1
222800                   KEY IS EQUAL TO IX-FS1-ALTKEY2
222900          INVALID KEY   MOVE FS1-STATUS TO FILESTATUS (1)
223000                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
223100                        GO TO START-FAIL-GF-37.
223200     MOVE    FS1-STATUS TO FILESTATUS (1).
223300     READ    IX-FS1  AT END
223400                     MOVE  "AT END ON READ" TO COMPUTED-A
223500                     GO TO START-FAIL-GF-37.
223600     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
223700     IF      XRECORD-NUMBER (1) EQUAL TO 12
223800             PERFORM PASS
223900             MOVE SPACE TO RE-MARK
224000             GO TO START-WRITE-GF-37.
224100     MOVE    12 TO RECNO.
224200     PERFORM DISPLAY-ALTERNATE-KEY2.
224300     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
224400 START-FAIL-GF-37.
224500     PERFORM FAIL.
224600     MOVE    12   TO CORRECT-18V0.
224700     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
224800     GO TO   START-WRITE-GF-37.
224900 START-DELETE-GF-37.
225000     PERFORM DE-LETE.
225100 START-WRITE-GF-37.
225200     PERFORM PRINT-DETAIL.
225300 START-INIT-GF-38.
225400     MOVE "START-TEST-GF-38" TO PAR-NAME.
225500     PERFORM START-INITIALIZE-RECORD.
225600     IF      INIT-FLAG NOT EQUAL TO ZERO
225700             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
225800             MOVE   "**"  TO FILESTATUS (2)
225900             GO TO   START-DELETE-GF-38.
226000     MOVE    "EEEEEEEEFF064" TO FS1-RECKEY-1-13.
226100     MOVE    "HHHHHHHIII066ALTKEY1" TO FS1-ALTKEY1-1-20.
226200     MOVE    "TTTTTTTSSS335ALTKEY2" TO FS1-ALTKEY2-1-20.
226300     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
226400     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
226500     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
226600 START-TEST-GF-38.
226700*
226800*  START-TEST-GF-38- THE START SHOULD NOT FIND A RECORD IN THE
226900*                    FILE WHICH HAS AN ALTERNATE RECORD KEY VALUE
227000*                    OF TTTTTTTSSS335ALTKEY2.  THIS KEY VALUE IS
227100*                    SEQUENTIALLY LOCATED BETWEEN TWO CURRENTLY
227200*                    EXISTING ALTERNATE KEYS IN THE FILE.
227300*
227400     START  IX-FS1
227500                   KEY IS EQUAL TO IX-FS1-ALTKEY2
227600          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (2)
227700                         GO TO START-PASS-GF-38.
227800     MOVE    FS1-STATUS TO FILESTATUS (2).
227900     READ    IX-FS1 AT END
228000                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
228100     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
228200     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
228300     PERFORM FAIL.
228400     MOVE    ALTERNATE-KEY2 (1) TO COMPUTED-A.
228500     MOVE    "INVALID KEY" TO CORRECT-A.
228600     GO TO   START-WRITE-GF-38.
228700 START-PASS-GF-38.
228800     PERFORM  PASS.
228900     GO TO   START-WRITE-GF-38.
229000 START-DELETE-GF-38.
229100     PERFORM DE-LETE.
229200 START-WRITE-GF-38.
229300     PERFORM PRINT-DETAIL.
229400 START-INIT-GF-39.
229500     MOVE "START-TEST-GF-39" TO PAR-NAME.
229600     PERFORM START-INITIALIZE-RECORD.
229700     IF      INIT-FLAG NOT EQUAL TO ZERO
229800             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
229900             MOVE   "**"  TO FILESTATUS (3)
230000             GO TO   START-DELETE-GF-39.
230100     MOVE    "UUUUUUUUUU400" TO FS1-RECKEY-1-13.
230200     MOVE    "YYYYYYYYYY400ALTKEY1" TO FS1-ALTKEY1-1-20.
230300     MOVE    "DDDDDDDDDC000ALTKEY2" TO FS1-ALTKEY2-1-20.
230400     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
230500     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
230600     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
230700 START-TEST-GF-39.
230800*
230900*  START-TEST-GF-39 - THE START STATEMENT SHOULD NOT FIND A
231000*                    RECORD IN THE FILE WHICH HAS AN ALTERNATE
231100*                    KEY VALUE OF DDDDDDDDDC000ALTKEY2.  THIS KEY
231200*                    VALUE IS SEQUENTIALLY LOWER THAN ANY
231300*                    CURRENTLY EXISTING KEY IN THE FILE.
231400*
231500     START  IX-FS1
231600                   KEY IS EQUAL TO IX-FS1-ALTKEY2
231700          INVALID KEY    MOVE FS1-STATUS TO FILESTATUS (3)
231800                     GO TO START-PASS-GF-39.
231900     MOVE    FS1-STATUS TO FILESTATUS (3).
232000     READ    IX-FS1  AT END
232100                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
232200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
232300     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
232400     PERFORM FAIL.
232500     MOVE    ALTERNATE-KEY2 (1) TO COMPUTED-A.
232600     MOVE    "INVALID KEY"  TO CORRECT-A.
232700     GO TO START-WRITE-GF-39.
232800 START-PASS-GF-39.
232900     PERFORM PASS.
233000     GO TO   START-WRITE-GF-39.
233100 START-DELETE-GF-39.
233200     PERFORM DE-LETE.
233300 START-WRITE-GF-39.
233400     PERFORM PRINT-DETAIL.
233500 START-INIT-GF-40.
233600     MOVE "START-TEST-GF-40" TO PAR-NAME.
233700     PERFORM START-INITIALIZE-RECORD.
233800     IF      INIT-FLAG NOT EQUAL TO ZERO
233900             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
234000             MOVE   "**"  TO FILESTATUS (4)
234100             GO TO   START-DELETE-GF-40.
234200     MOVE    "BBBBBBBBBC002"  TO FS1-RECKEY-1-13.
234300     MOVE    "YYYYYYYYYY400ALTKEY1"  TO FS1-ALTKEY1-1-20.
234400     MOVE    "WWWWWWWWWV399ALTKEY2"  TO FS1-ALTKEY2-1-20.
234500     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
234600     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
234700     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
234800 START-TEST-GF-40.
234900*
235000*  START-TEST-GF-40 - THE START STATEMENT SHOULD NOT FIND A
235100*                    RECORD IN THE FILE WHICH HAS AN ALTERNATE
235200*                    KEY VALUE OF WWWWWWWWWV399ALTKEY2.  THIS
235300*                    VALUE IS SEQUENTIALLY  ONE GREATER THAN
235400*                    ANY ALTERNATE KEY CURRENTLY EXISTING IN
235500*                    THE FILE.  AN INVALID KEY CONDITION
235600*                    IS EXPECTED WHEN THE START IS EXECUTED.
235700*
235800     START  IX-FS1
235900                   KEY IS EQUAL TO IX-FS1-ALTKEY2
236000          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (4)
236100                         GO TO START-PASS-GF-40.
236200     MOVE    FS1-STATUS TO FILESTATUS (4).
236300     READ    IX-FS1 AT END
236400                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
236500     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
236600     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
236700     PERFORM FAIL.
236800     MOVE    ALTERNATE-KEY2 (1) TO COMPUTED-A.
236900     MOVE    "INVALID KEY" TO CORRECT-A.
237000     GO TO   START-WRITE-GF-40.
237100 START-PASS-GF-40.
237200     PERFORM  PASS.
237300     GO TO   START-WRITE-GF-40.
237400 START-DELETE-GF-40.
237500     PERFORM DE-LETE.
237600 START-WRITE-GF-40.
237700     PERFORM PRINT-DETAIL.
237800 START-INIT-GF-41.
237900     MOVE "START-TEST-GF-41" TO PAR-NAME.
238000     PERFORM START-INITIALIZE-RECORD.
238100     IF      INIT-FLAG NOT EQUAL TO ZERO
238200             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
238300             MOVE   "**"  TO FILESTATUS (5)
238400             GO TO   START-DELETE-GF-41.
238500     MOVE    "CCCCCCCCCC038"  TO FS1-RECKEY-1-13.
238600     MOVE    "IIIIIIIIJJ083ALTKEY1" TO FS1-ALTKEY1-1-20.
238700     MOVE    "VUUUUVVVVV362ALTKEY2"  TO FS1-ALTKEY2-1-20.
238800     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
238900     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
239000     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
239100 START-TEST-GF-41.
239200*
239300*  START-TEST-GF-41 - THE START STATEMENT USES AN OPERAND
239400*                    IN THE KEY PHRASE WHICH IS NOT THE NAME
239500*                    OF AN ALTERNATE KEY BUT IS THE NAME OF A
239600*                    DATA ITEM WHICH IS SUBORDINATE TO THE
239700*                    ALTERNATE KEY.  THE CONTENTS OF THE DATA ITEM
239800*                    (POSITIONS 1 THRU 5 OF THE ALTERNATE KEY)
239900*                    IS A UNIQUE KEY VALUE FOR THE FILE. THE
240000*                    BALANCE OF THE ALTERNATE KEY (POSITIONS 6
240100*                    THRU 20)  IN NOT A VALID KEY VALUE FOR THE
240200*                    FILE.   THE
240300*                    RECORD WITH THE ALTERNATE KEY
240400*                    VUUUUUUUUU362ALTKEY2 (RECORD NUMBER 19) IS
240500*                    EXPECTED TO BE FOUND.
240600*
240700     START  IX-FS1
240800                   KEY IS EQUAL TO IX-FS1-ALTKEY2-1-5
240900          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (5)
241000                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
241100                     GO TO START-FAIL-GF-41.
241200     MOVE    FS1-STATUS TO FILESTATUS (5).
241300     READ    IX-FS1  AT END
241400                     MOVE  "AT END ON READ" TO COMPUTED-A
241500                     GO TO  START-FAIL-GF-41.
241600     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
241700     IF      XRECORD-NUMBER (1) EQUAL TO 19
241800             PERFORM  PASS
241900             GO TO START-WRITE-GF-41.
242000     MOVE    19  TO RECNO.
242100     PERFORM DISPLAY-ALTERNATE-KEY2.
242200     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
242300 START-FAIL-GF-41.
242400     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
242500     PERFORM  FAIL.
242600     MOVE    19  TO CORRECT-18V0.
242700     GO TO   START-WRITE-GF-41.
242800 START-DELETE-GF-41.
242900     PERFORM DE-LETE.
243000 START-WRITE-GF-41.
243100     PERFORM PRINT-DETAIL.
243200 START-INIT-GF-42.
243300     MOVE "START-TEST-GF-42" TO PAR-NAME.
243400     PERFORM START-INITIALIZE-RECORD.
243500     IF      INIT-FLAG NOT EQUAL TO ZERO
243600             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
243700             MOVE   "**"  TO FILESTATUS (6)
243800             GO TO   START-DELETE-GF-42.
243900     MOVE    "TTTTTTTTTT390" TO FS1-RECKEY-1-13.
244000     MOVE    "XYYYYYYYYY399ALTKEY1"  TO FS1-ALTKEY1-1-20.
244100     MOVE    "EEEEEDDDDD010ALTKEY2" TO FS1-ALTKEY2-1-20.
244200     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
244300     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
244400     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
244500 START-TEST-GF-42.
244600*
244700*  START-TEST-GF-42 - THE START STATEMENT USES AN OPERAND IN THE
244800*                    KEY PHRASE WHICH IS NOT THE NAME OF AN ALTER-
244900*                    NATE KEY BUT IS THE NAME OF A DATA ITEM THAT
245000*                    SUBORDINATE TO THE ALTERNATE KEY. THE CONTENT
245100*                    OF THE DATA ITEM (POSITIONS 1 THRU 5 OF THE
245200*                    ALTERNATE KEY) IS A DUPLICATE OF THE FIRST
245300*                    5 POSITIONS OF 5 OTHER RECORDS IN THE FILE.
245400*                    THIS TEST EXPECTS THE RECORD POINTER
245500*                    TO BE POSITIONED TO ALTERNATE KEY
245600*                    EEEEEDDDDD020ALTKEY2 (RECORD NO 195) WHICH
245700*                    IS THE FIRST RECORD ALPHABETICALLY IN THE
245800*                    FILE THAT CONTAINS EEEEE IN THE FIRST 5
245900*                    POSITIONS OF THE KEY.  NOTE THIS IS ALSO
246000*                    A RECORD IN WHICH THE VALUE OF THE FULL
246100*                    20 POSITION KEY IS A DUPLICATE OF ANOTHER
246200*                    RECORD (RECORD NUMBER 191).  THE ALTERNATE
246300*                    KEY WAS LOADED WITH THE VALUE
246400*                    EEEEEDDDDD010ALTKEY2 (KEY FOR RECORD NUMBER
246500*                    195) BEFORE THE START WAS EXECUTED.
246600*
246700     START  IX-FS1
246800                   KEY IS EQUAL TO IX-FS1-ALTKEY2-1-5
246900          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (6)
247000                     MOVE  "INVALID KEY ON START"  TO COMPUTED-A
247100                     GO TO START-FAIL-GF-42.
247200     MOVE    FS1-STATUS TO FILESTATUS (6).
247300     READ    IX-FS1  AT END
247400                     MOVE "AT END ON READ" TO COMPUTED-A
247500                     GO TO START-FAIL-GF-42.
247600     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
247700     IF      XRECORD-NUMBER (1) EQUAL TO 195
247800             PERFORM  PASS
247900             GO TO START-WRITE-GF-42.
248000     MOVE    65  TO RECNO.
248100     PERFORM DISPLAY-ALTERNATE-KEY2.
248200     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
248300 START-FAIL-GF-42.
248400     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
248500     PERFORM  FAIL.
248600     MOVE    195   TO CORRECT-18V0.
248700     GO TO   START-WRITE-GF-42.
248800 START-DELETE-GF-42.
248900     PERFORM DE-LETE.
249000 START-WRITE-GF-42.
249100     PERFORM PRINT-DETAIL.
249200 START-INIT-GF-43.
249300     MOVE "START-TEST-GF-43" TO PAR-NAME.
249400     PERFORM START-INITIALIZE-RECORD.
249500     IF      INIT-FLAG NOT EQUAL TO ZERO
249600             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
249700             MOVE   "**"  TO FILESTATUS (7)
249800             GO TO   START-DELETE-GF-43.
249900     MOVE    "CCCCCCCCCD022"  TO FS1-RECKEY-1-13.
250000     MOVE    "FFFFFFFFFG022ALTKEY1"  TO FS1-ALTKEY1-1-20.
250100     MOVE    "380ALTKEY2          "  TO FS1-ALTKEY2-1-20.
250200     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
250300     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
250400     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
250500 START-TEST-GF-43.
250600*
250700*  START-TEST-GF-43 - THE START STATEMENT USES AN OPERAND IN THE
250800*                    KEY PHRASE OF THE START STATEMENT WHICH IS
250900*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
251000*                    NAME.  THE CONTENTS OF THE DATA ITEM
251100*                    (POSITIONS 1 THRU 10 OF THE RECORD KEY)
251200*                    IS LOADED WITH "380ALTKEY2".  NO SUCH RECORD
251300*                    SHOULD BE IN THE FILE.  IF IN THE COMPARSION,
251400*                    THE LONGER OPERAND IS TRUNCATED ON THE LEFT
251500*                    INSTEAD OF ON THE RIGHT THE CONTENTS OF
251600*                    THE DATA ITEM WILL MATCH A RECORD IN THE
251700*                    FILE.  THIS TEST EXPECTS THE LONGER OPERAND
251800*                    TO BE TRUNCATED ON THE RIGHT CAUSING NO
251900*                    DATA ITEM MATCH AND RESULTING IN AN INVALID
252000*                    KEY CONDITION WHEN THE START IS EXECUTED.
252100*
252200     START  IX-FS1
252300                   KEY IS EQUAL TO IX-FS1-ALTKEY2-1-10
252400          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (7)
252500                     GO TO START-PASS-GF-43.
252600     MOVE    FS1-STATUS TO FILESTATUS (7).
252700     READ    IX-FS1  AT END
252800                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
252900     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
253000     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
253100     PERFORM FAIL.
253200     MOVE    ALTERNATE-KEY2 (1) TO COMPUTED-A.
253300     MOVE    "INVALID KEY" TO CORRECT-A.
253400     GO TO   START-WRITE-GF-43.
253500 START-PASS-GF-43.
253600     PERFORM PASS.
253700     GO TO   START-WRITE-GF-43.
253800 START-DELETE-GF-43.
253900     PERFORM DE-LETE.
254000 START-WRITE-GF-43.
254100     PERFORM PRINT-DETAIL.
254200 START-INIT-GF-44.
254300     MOVE "START-TEST-GF-44" TO PAR-NAME.
254400     PERFORM START-INITIALIZE-RECORD.
254500     IF      INIT-FLAG NOT EQUAL TO ZERO
254600             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
254700             MOVE   "**"  TO FILESTATUS (8)
254800             GO TO   START-DELETE-GF-44.
254900     MOVE    "UUUUUUUUUU400"  TO FS1-RECKEY-1-13.
255000     MOVE    "YYYYYYYYYY400ALTKEY1"  TO FS1-ALTKEY1-1-20.
255100     MOVE    "DDDDDDDDDC000ALTKEY2"  TO FS1-ALTKEY2-1-20.
255200     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
255300     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
255400     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
255500 START-TEST-GF-44.
255600*
255700*  START-TEST-GF-44 - THIS TEST USES AN OPERAND IN THE
255800*                    KEY PHRASE OF THE START STATEMENT WHICH IS
255900*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
256000*                    NAME.  THE CONTENTS OF THE DATA ITEM
256100*                    (POSITIONS 1 THRU 10 OF THE ALTERNATE KEY) IS
256200*                    LOADED WITH "DDDDDDDDDC".  THIS KEY VALUE
256300*                    IS LOWER THAN ANY ALTERNATE KEY VALUE IN
256400*                    POSITION 1 THRU 10 EXISTING IN THE FILE
256500*                    THEREFORE AN INVALID KEY CONDITION IS
256600*                    EXPECTED WHEN THE START STATEMENT IS
256700*                    EXECUTED.
256800*
256900     START  IX-FS1
257000                   KEY IS EQUAL TO IX-FS1-ALTKEY2-1-10
257100          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (8)
257200                     GO TO START-PASS-GF-44.
257300     MOVE    FS1-STATUS TO FILESTATUS (8).
257400     READ    IX-FS1  AT END
257500                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
257600     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
257700     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
257800     PERFORM FAIL.
257900     MOVE    ALTERNATE-KEY2 (1) TO COMPUTED-A.
258000     MOVE     "INVALID KEY" TO CORRECT-A.
258100     GO TO   START-WRITE-GF-44.
258200 START-PASS-GF-44.
258300     PERFORM PASS.
258400     GO TO   START-WRITE-GF-44.
258500 START-DELETE-GF-44.
258600     PERFORM DE-LETE.
258700 START-WRITE-GF-44.
258800     PERFORM PRINT-DETAIL.
258900 START-INIT-GF-45.
259000     MOVE "START-TEST-GF-45" TO PAR-NAME.
259100     PERFORM START-INITIALIZE-RECORD.
259200     IF      INIT-FLAG NOT EQUAL TO ZERO
259300             MOVE    "TEST IMPROPERLY INITIALIZED"  TO RE-MARK
259400             MOVE   "**"  TO FILESTATUS (9)
259500             GO TO   START-DELETE-GF-45.
259600     MOVE    "UUUUUUUUUU400"  TO FS1-RECKEY-1-13.
259700     MOVE    "YYYYYYYYYY400ALTKEY1"  TO FS1-ALTKEY1-1-20.
259800     MOVE    "WWWWWWWWWW400ALTKEY2"  TO FS1-ALTKEY2-1-20.
259900     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
260000     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
260100     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
260200 START-TEST-GF-45.
260300*
260400*  START-TEST-GF-45 - THIS TEST USES AN OPERAND IN THE
260500*                    KEY PHRASE OF THE START STATEMENT WHICH IS
260600*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
260700*                    NAME.  THE CONTENTS OF THE DATA ITEM
260800*                    (POSITIONS 1 THRU 10 OF THE ALTERNATE KEY) IS
260900*                    LOADED WITH "WWWWWWWWWW".  THIS KEY VALUE
261000*                    IS GREATER THAN ANY ALTERNATE KEY VALUE IN
261100*                    POSITION 1 THRU 10 EXISTING IN THE FILE
261200*                    THEREFORE AN INVALID KEY CONDITION IS
261300*                    EXPECTED WHEN THE START STATEMENT IS
261400*                    EXECUTED.
261500*
261600     START  IX-FS1
261700                   KEY IS EQUAL TO IX-FS1-ALTKEY2-1-10
261800          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (9)
261900                     GO TO START-PASS-GF-45.
262000     MOVE    FS1-STATUS TO FILESTATUS (9).
262100     READ    IX-FS1  AT END
262200                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
262300     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
262400     MOVE "IX-36; 4.7.2 ETC.                          " TO RE-MARK
262500     PERFORM FAIL.
262600     MOVE    XRECORD-KEY (1)  TO COMPUTED-A.
262700     MOVE     "INVALID KEY" TO CORRECT-A.
262800     GO TO   START-WRITE-GF-45.
262900 START-PASS-GF-45.
263000     PERFORM PASS.
263100     GO TO   START-WRITE-GF-45.
263200 START-DELETE-GF-45.
263300     PERFORM DE-LETE.
263400 START-WRITE-GF-45.
263500     PERFORM PRINT-DETAIL.
263600
263700     CLOSE   IX-FS1.
263800
263900 START-INIT-FILE-STATUS-03.
264000     MOVE             "FILE STATUS START:00"   TO FEATURE.
264100     MOVE "START-TEST-GF-46" TO PAR-NAME.
264200*
264300*  THIS SERIES OF TESTS CHECKS THE CONTENTS OF THE FILE STATUS
264400*  CAPTURED FROM THE NINE TESTS BEFORE.
264500*
264600 START-TEST-GF-46.
264700     IF      FILESTATUS (1)  EQUAL TO "**"
264800             PERFORM DE-LETE
264900             GO TO  START-WRITE-GF-46.
265000*
265100*  START-TEST-GF-046 - THIS TEST CHECKS THE FILE STATUS CONTENTS
265200*                    RESULTING FROM START-TEST-GF-37. THE FILE
265300*                    STATUS CONTENTS IS EXPECTED TO BE "00".
265400*
265500     IF      FILESTATUS (1)  EQUAL TO "00"
265600             PERFORM PASS
265700     ELSE
265800     MOVE "IX-3; 1.3.4 (1) A; SEE START-TEST-GF-37    " TO RE-MARK
265900             PERFORM  FAIL
266000             MOVE  "00"  TO CORRECT-A
266100             MOVE   FILESTATUS (1)  TO COMPUTED-A.
266200 START-WRITE-GF-46.
266300     PERFORM  PRINT-DETAIL.
266400 START-TEST-GF-47.
266500     MOVE             "FILE STATUS START:23"   TO FEATURE.
266600     MOVE "START-TEST-GF-47" TO PAR-NAME.
266700     IF      FILESTATUS (2)  EQUAL TO "**"
266800             PERFORM DE-LETE
266900             GO TO  START-WRITE-GF-47.
267000*
267100*  START-TEST-GF-47 - THIS TEST CHECKS THE FILE STATUS CONTENTS
267200*                    RESULTING FROM START-TEST-GF-38. THE FILE
267300*                    STATUS CONTENTS IS EXPECTED TO BE "23".
267400*
267500     IF      FILESTATUS (2)  EQUAL TO "23"
267600             PERFORM  PASS
267700             ELSE  PERFORM  FAIL
267800     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-38    " TO RE-MARK
267900             MOVE    "23"  TO CORRECT-A
268000             MOVE   FILESTATUS (2)  TO COMPUTED-A.
268100 START-WRITE-GF-47.
268200     PERFORM  PRINT-DETAIL.
268300 START-TEST-GF-48.
268400     MOVE             "FILE STATUS START:23"   TO FEATURE.
268500     MOVE "START-TEST-GF-48" TO PAR-NAME.
268600     IF      FILESTATUS (3)  EQUAL TO "**"
268700             PERFORM DE-LETE
268800             GO TO  START-WRITE-GF-48.
268900*
269000*  START-TEST-GF-48 - THIS TEST CHECKS THE FILE STATUS CONTENTS
269100*                    RESULTING FROM START-TEST-GF-39. THE FILE
269200*                    STATUS CONTENTS IS EXPECTED TO BE "23".
269300*
269400     IF      FILESTATUS (3)  EQUAL TO "23"
269500             PERFORM  PASS
269600     ELSE PERFORM FAIL
269700     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-39    " TO RE-MARK
269800             MOVE    "23"  TO CORRECT-A
269900             MOVE  FILESTATUS (3) TO COMPUTED-A.
270000 START-WRITE-GF-48.
270100     PERFORM  PRINT-DETAIL.
270200 START-TEST-GF-49.
270300     MOVE             "FILE STATUS START:23"   TO FEATURE.
270400     MOVE "START-TEST-GF-49" TO PAR-NAME.
270500     IF      FILESTATUS (4)  EQUAL TO "**"
270600             PERFORM DE-LETE
270700             GO TO  START-WRITE-GF-49.
270800*
270900*  START-TEST-GF-49 - THIS TEST CHECKS THE FILE STATUS CONTENTS
271000*                    STATUS CONTENTS IS EXPECTED TO BE "23".
271100*                    RESULTING FROM START-TEST-GF-40. THE FILE
271200*
271300     IF      FILESTATUS (4)  EQUAL TO "23"
271400             PERFORM  PASS
271500             ELSE  PERFORM  FAIL
271600     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-40    " TO RE-MARK
271700             MOVE    "23"  TO CORRECT-A
271800             MOVE   FILESTATUS (4)  TO COMPUTED-A.
271900 START-WRITE-GF-49.
272000     PERFORM  PRINT-DETAIL.
272100 START-TEST-GF-50.
272200     MOVE             "FILE STATUS START:00"   TO FEATURE.
272300     MOVE "START-TEST-GF-50" TO PAR-NAME.
272400     IF      FILESTATUS (5)  EQUAL TO "**"
272500             PERFORM DE-LETE
272600             GO TO  START-WRITE-GF-50.
272700*
272800*  START-TEST-GF-50 - THIS TEST CHECKS THE FILE STATUS CONTENTS
272900*                    RESULTING FROM START-TEST-GF-41. THE FILE
273000*                    STATUS CONTENTS IS EXPECTED TO BE "00"
273100*
273200     IF      FILESTATUS (5)  EQUAL TO "00"
273300             PERFORM  PASS
273400     MOVE "IX-3; 1.3.4 (1) A; SEE START-TEST-GF-41    " TO RE-MARK
273500             ELSE  PERFORM  FAIL
273600             MOVE    "00"  TO CORRECT-A
273700             MOVE   FILESTATUS (5)  TO COMPUTED-A.
273800 START-WRITE-GF-50.
273900     MOVE    "FROM START-TEST-007.05" TO RE-MARK.
274000     PERFORM  PRINT-DETAIL.
274100 START-TEST-GF-51.
274200     MOVE             "FILE STATUS START:00"   TO FEATURE.
274300     MOVE "START-TEST-GF-51" TO PAR-NAME.
274400     IF      FILESTATUS (6)  EQUAL TO "**"
274500             PERFORM DE-LETE
274600             GO TO  START-WRITE-GF-51.
274700*
274800*  START-TEST-GF-51 - THIS TEST CHECKS THE FILE STATUS CONTENTS
274900*                    RESULTING FROM START-TEST-GF-42. THE FILE
275000*                    STATUS CONTENTS IS EXPECTED TO BE "00"
275100*
275200     IF      FILESTATUS (6)  EQUAL TO "00"
275300             PERFORM  PASS
275400             ELSE  PERFORM  FAIL
275500     MOVE "IX-3; 1.3.4 (1) A; SEE START-TEST-GF-42    " TO RE-MARK
275600             MOVE   "00"  TO CORRECT-A
275700             MOVE   FILESTATUS (6)  TO COMPUTED-A.
275800 START-WRITE-GF-51.
275900     PERFORM  PRINT-DETAIL.
276000 START-TEST-GF-52.
276100     MOVE             "FILE STATUS START:23"   TO FEATURE.
276200     MOVE "START-TEST-GF-52" TO PAR-NAME.
276300     IF      FILESTATUS (7)  EQUAL TO "**"
276400             PERFORM DE-LETE
276500             GO TO  START-WRITE-GF-52.
276600*
276700*  START-TEST-GF-52 - THIS TEST CHECKS THE FILE STATUS CONTENTS
276800*                    RESULTING FROM START-TEST-GF-43. THE FILE
276900*                    STATUS CONTENTS IS EXPECTED TO BE "23"
277000*
277100     IF      FILESTATUS (7)  EQUAL TO "23"
277200             PERFORM  PASS
277300             ELSE  PERFORM  FAIL
277400     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-43    " TO RE-MARK
277500             MOVE    "23"  TO CORRECT-A
277600             MOVE   FILESTATUS (7)  TO COMPUTED-A.
277700 START-WRITE-GF-52.
277800     PERFORM  PRINT-DETAIL.
277900 START-TEST-GF-53.
278000     MOVE             "FILE STATUS START:23"   TO FEATURE.
278100     MOVE "START-TEST-GF-53" TO PAR-NAME.
278200     IF      FILESTATUS (8)  EQUAL TO "**"
278300             PERFORM DE-LETE
278400             GO TO  START-WRITE-GF-53.
278500*
278600*  START-TEST-GF-53 - THIS TEST CHECKS THE FILE STATUS CONTENTS
278700*                    RESULTING FROM START-TEST-GF-44. THE FILE
278800*                    STATUS CONTENTS IS EXPECTED TO BE "23".
278900*
279000     IF      FILESTATUS (8)  EQUAL TO "23"
279100             PERFORM  PASS
279200             ELSE  PERFORM  FAIL
279300     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-44    " TO RE-MARK
279400             MOVE    "23"  TO CORRECT-A
279500             MOVE   FILESTATUS (8)  TO COMPUTED-A.
279600 START-WRITE-GF-53.
279700     PERFORM  PRINT-DETAIL.
279800 START-TEST-GF-54.
279900     MOVE             "FILE STATUS START:23"   TO FEATURE.
280000     MOVE "START-TEST-GF-54" TO PAR-NAME.
280100     IF      FILESTATUS (9)  EQUAL TO "**"
280200             PERFORM DE-LETE
280300             GO TO  START-WRITE-GF-54.
280400*
280500*  START-TEST-GF-54 - THIS TEST CHECKS THE FILE STATUS CONTENTS
280600*                    RESULTING FROM START-TEST-GF-45. THE FILE
280700*                    STATUS CONTENTS IS EXPECTED TO BE "23".
280800*
280900     IF      FILESTATUS (9)  EQUAL TO "23"
281000             PERFORM  PASS
281100     ELSE    PERFORM FAIL
281200     MOVE "IX-4; 1.3.4 (3) C; SEE START-TEST-GF-45    " TO RE-MARK
281300             MOVE  "23"  TO CORRECT-A
281400             MOVE   FILESTATUS (9)  TO COMPUTED-A.
281500 START-WRITE-GF-54.
281600     PERFORM  PRINT-DETAIL.
281700*START-WRITE-008.
281800     GO TO   START-TEST-COMPLETE.
281900*START-CLOSE-FILES.
282000*    GO TO   START-TEST-COMPLETE.
282100 START-INITIALIZE-RECORD.
282200     MOVE    "GGGGGGGGGG200" TO  FS1-RECKEY-1-13.
282300     MOVE    ZERO  TO INIT-FLAG.
282400     MOVE    9999  TO XRECORD-NUMBER (1).
282500     MOVE    SPACE TO IX-FS1R1-F-G-240.
282600     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
282700     START   IX-FS1  KEY IS EQUAL TO IX-FS1-KEY INVALID KEY
282800                     MOVE   1  TO INIT-FLAG.
282900     READ    IX-FS1  INTO  FILE-RECORD-INFO (1)
283000                     AT END  MOVE  1 TO INIT-FLAG.
283100     IF      XRECORD-NUMBER (1) NOT EQUAL TO 100
283200             MOVE 1 TO INIT-FLAG.
283300     MOVE        "**"  TO FS1-STATUS.
283400 DISPLAY-RECORD-KEYS.
283500     MOVE    XRECORD-KEY (1)  TO WRK-FS1-RECKEY.
283600     MOVE    FS1-RECKEY-1-13  TO COMPUTED-A.
283700     MOVE    RECKEY-VALUE (RECNO)  TO CORRECT-A.
283800     MOVE    SPACE TO P-OR-F.
283900     MOVE    "RECORD KEY VALUES" TO RE-MARK.
284000     PERFORM PRINT-DETAIL.
284100 DISPLAY-ALTERNATE-KEY1.
284200     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FS1-ALTKEY1.
284300     MOVE    FS1-ALTKEY1-1-20  TO COMPUTED-A.
284400     MOVE    ALTKEY1-VALUE (RECNO)  TO CORRECT-A.
284500     MOVE    SPACE TO P-OR-F.
284600     MOVE    "ALTERNATE RECORD KEY1 VALUES"  TO RE-MARK.
284700     PERFORM PRINT-DETAIL.
284800 DISPLAY-ALTERNATE-KEY2.
284900     MOVE    ALTERNATE-KEY2 (1) TO WRK-FS1-ALTKEY2.
285000     MOVE    FS1-ALTKEY2-1-20  TO COMPUTED-A.
285100     MOVE    ALTKEY2-VALUE (RECNO)  TO CORRECT-A.
285200     MOVE    SPACE TO P-OR-F.
285300     MOVE    "ALTERNATE RECORD KEY2 VALUES"  TO RE-MARK.
285400     PERFORM PRINT-DETAIL.
285500 START-TEST-COMPLETE.
285600     EXIT.
285700 CCVS-EXIT SECTION.
285800 CCVS-999999.
285900     GO TO CLOSE-FILES.
