000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX201A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*    THIS PROGRAM IS THE FIRST OF A SERIES WHICH PROCESSES AN
001400*    INDEXED FILE.  THE FUNCTION OF THIS PROGRAM IS TO CREATE AN
001500*    INDEXED FILE SEQUENTIALLY (ACCESS MODE SEQUENTIAL) AND VERIFY
001600*    THAT IT WAS CREATED CORRECTLY.  THE FILE IS IDENTIFIED AS
001700*    "IX-FS1" AND IS PASSED TO IX202 FOR PROCESSING.
001800*
001900*
002000*       X-CARDS  WHICH MUST BE REPLACED FOR THIS PROGRAM ARE
002100*
002200*             X-24   INDEXED FILE IMPLEMENTOR-NAME IN ASSGN TO
002300*                    CLAUSE FOR DATA FILE IX-FS1
002400*             X-44   INDEXED FILE IMPLEMENTOR-NAME IN ASSGN TO
002500*                    CLAUSE FOR INDEX FILE IX-FS1
002600*             X-55   IMPLEMENTOR-NAME FOR SYSTEM PRINTER
002700*             X-62   FOR RAW-DATA
002800*             X-82   IMPLEMENTOR-NAME FOR SOURCE-COMPUTER
002900*             X-83   IMPLEMENTOR-NAME FOR OBJECT-COMPUTER
003000*
003100*         NOTE:  X-CARDS 44 AND 62       ARE OPTIONAL
003200*               AND NEED ONLY TO BE PRESENT IF THE COMPILER RE-
003300*               QUIRES THIS CODE BE AVAILABLE FOR PROPER PROGRAM
003400*               COMPILATION AND EXECUTION. IF THE VP-ROUTINE IS
003500*               USED THE  X-CARDS MAY BE AUTOMATICALLY SELECTED
003600*               FOR INCLUSION IN THE PROGRAM BY SPECIFYING THE
003700*               APPROPRIATE LETTER IN THE "*OPT" VP-ROUTINE
003800*               CONTROL CARD. THE LETTER  CORRESPONDS TO A
003900*               CHARACTER IN POSITION 7 OF THE SOURCE LINE AND
004000*               THEY ARE AS FOLLOWS
004100*
004200*                  P  SELECTS X-CARDS 62
004300*                  J  SELECTS X-CARD 44
004400*
004500******************************************************
004600 ENVIRONMENT DIVISION.
004700 CONFIGURATION SECTION.
004800 SOURCE-COMPUTER.
004900     XXXXX082.
005000 OBJECT-COMPUTER.
005100     XXXXX083.
005200 INPUT-OUTPUT SECTION.
005300 FILE-CONTROL.
005400P    SELECT RAW-DATA   ASSIGN TO
005500P    XXXXX062
005600P           ORGANIZATION IS INDEXED
005700P           ACCESS MODE IS RANDOM
005800P           RECORD KEY IS RAW-DATA-KEY.
005900     SELECT PRINT-FILE ASSIGN TO
006000     XXXXX055.
006100     SELECT   IX-FS1 ASSIGN TO
006200     XXXXP024
006300J    XXXXP044
006400     ORGANIZATION IS INDEXED
006500     RECORD KEY IS IX-FS1-KEY
006600     ACCESS MODE IS SEQUENTIAL.
006700 DATA DIVISION.
006800 FILE SECTION.
006900P
007000PFD  RAW-DATA.
007100P
007200P01  RAW-DATA-SATZ.
007300P    05  RAW-DATA-KEY        PIC X(6).
007400P    05  C-DATE              PIC 9(6).
007500P    05  C-TIME              PIC 9(8).
007600P    05  C-NO-OF-TESTS       PIC 99.
007700P    05  C-OK                PIC 999.
007800P    05  C-ALL               PIC 999.
007900P    05  C-FAIL              PIC 999.
008000P    05  C-DELETED           PIC 999.
008100P    05  C-INSPECT           PIC 999.
008200P    05  C-NOTE              PIC X(13).
008300P    05  C-INDENT            PIC X.
008400P    05  C-ABORT             PIC X(8).
008500 FD  PRINT-FILE.
008600 01  PRINT-REC PICTURE X(120).
008700 01  DUMMY-RECORD PICTURE X(120).
008800 FD  IX-FS1
008900C    LABEL RECORD IS STANDARD
009000C    DATA RECORD IS IX-FS1R1-F-G-240
009100     BLOCK CONTAINS 1 RECORDS
009200     RECORD CONTAINS 240 CHARACTERS.
009300 01  IX-FS1R1-F-G-240.
009400     03 IX-FS1-WRK-120 PIC X(120).
009500     03 IX-FS1-GRP-120.
009600     05 FILLER   PIC   X(8).
009700     05 IX-FS1-KEY  PIC X(29).
009800     05 FILLER PIC X(83).
009900 WORKING-STORAGE SECTION.
010000 01  GRP-0101.
010100     02 FILLER   PIC X(10)  VALUE "ABCDLKJXYZ".
010200     02 WRK-DU-09V00-001 PIC 9(9)  VALUE ZERO.
010300     02 FILLER  PIC X(10)  VALUE "ZIF,.$-+CD".
010400 01  FILE-RECORD-INFORMATION-REC.
010500     03 FILE-RECORD-INFO-SKELETON.
010600        05 FILLER                 PICTURE X(48)       VALUE
010700             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
010800        05 FILLER                 PICTURE X(46)       VALUE
010900             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
011000        05 FILLER                 PICTURE X(26)       VALUE
011100             ",LFIL=000000,ORG=  ,LBLR= ".
011200        05 FILLER                 PICTURE X(37)       VALUE
011300             ",RECKEY=                             ".
011400        05 FILLER                 PICTURE X(38)       VALUE
011500             ",ALTKEY1=                             ".
011600        05 FILLER                 PICTURE X(38)       VALUE
011700             ",ALTKEY2=                             ".
011800        05 FILLER                 PICTURE X(7)        VALUE SPACE.
011900     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
012000        05 FILE-RECORD-INFO-P1-120.
012100           07 FILLER              PIC X(5).
012200           07 XFILE-NAME           PIC X(6).
012300           07 FILLER              PIC X(8).
012400           07 XRECORD-NAME         PIC X(6).
012500           07 FILLER              PIC X(1).
012600           07 REELUNIT-NUMBER     PIC 9(1).
012700           07 FILLER              PIC X(7).
012800           07 XRECORD-NUMBER       PIC 9(6).
012900           07 FILLER              PIC X(6).
013000           07 UPDATE-NUMBER       PIC 9(2).
013100           07 FILLER              PIC X(5).
013200           07 ODO-NUMBER          PIC 9(4).
013300           07 FILLER              PIC X(5).
013400           07 XPROGRAM-NAME        PIC X(5).
013500           07 FILLER              PIC X(7).
013600           07 XRECORD-LENGTH       PIC 9(6).
013700           07 FILLER              PIC X(7).
013800           07 CHARS-OR-RECORDS    PIC X(2).
013900           07 FILLER              PIC X(1).
014000           07 XBLOCK-SIZE          PIC 9(4).
014100           07 FILLER              PIC X(6).
014200           07 RECORDS-IN-FILE     PIC 9(6).
014300           07 FILLER              PIC X(5).
014400           07 XFILE-ORGANIZATION   PIC X(2).
014500           07 FILLER              PIC X(6).
014600           07 XLABEL-TYPE          PIC X(1).
014700        05 FILE-RECORD-INFO-P121-240.
014800           07 FILLER              PIC X(8).
014900           07 XRECORD-KEY          PIC X(29).
015000           07 FILLER              PIC X(9).
015100           07 ALTERNATE-KEY1      PIC X(29).
015200           07 FILLER              PIC X(9).
015300           07 ALTERNATE-KEY2      PIC X(29).
015400           07 FILLER              PIC X(7).
015500 01  TEST-RESULTS.
015600     02 FILLER                   PIC X      VALUE SPACE.
015700     02 FEATURE                  PIC X(20)  VALUE SPACE.
015800     02 FILLER                   PIC X      VALUE SPACE.
015900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
016000     02 FILLER                   PIC X      VALUE SPACE.
016100     02  PAR-NAME.
016200       03 FILLER                 PIC X(19)  VALUE SPACE.
016300       03  PARDOT-X              PIC X      VALUE SPACE.
016400       03 DOTVALUE               PIC 99     VALUE ZERO.
016500     02 FILLER                   PIC X(8)   VALUE SPACE.
016600     02 RE-MARK                  PIC X(61).
016700 01  TEST-COMPUTED.
016800     02 FILLER                   PIC X(30)  VALUE SPACE.
016900     02 FILLER                   PIC X(17)  VALUE
017000            "       COMPUTED=".
017100     02 COMPUTED-X.
017200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
017300     03 COMPUTED-N               REDEFINES COMPUTED-A
017400                                 PIC -9(9).9(9).
017500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
017600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
017700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
017800     03       CM-18V0 REDEFINES COMPUTED-A.
017900         04 COMPUTED-18V0                    PIC -9(18).
018000         04 FILLER                           PIC X.
018100     03 FILLER PIC X(50) VALUE SPACE.
018200 01  TEST-CORRECT.
018300     02 FILLER PIC X(30) VALUE SPACE.
018400     02 FILLER PIC X(17) VALUE "       CORRECT =".
018500     02 CORRECT-X.
018600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
018700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
018800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
018900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
019000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
019100     03      CR-18V0 REDEFINES CORRECT-A.
019200         04 CORRECT-18V0                     PIC -9(18).
019300         04 FILLER                           PIC X.
019400     03 FILLER PIC X(2) VALUE SPACE.
019500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
019600 01  CCVS-C-1.
019700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
019800-    "SS  PARAGRAPH-NAME
019900-    "       REMARKS".
020000     02 FILLER                     PIC X(20)    VALUE SPACE.
020100 01  CCVS-C-2.
020200     02 FILLER                     PIC X        VALUE SPACE.
020300     02 FILLER                     PIC X(6)     VALUE "TESTED".
020400     02 FILLER                     PIC X(15)    VALUE SPACE.
020500     02 FILLER                     PIC X(4)     VALUE "FAIL".
020600     02 FILLER                     PIC X(94)    VALUE SPACE.
020700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
020800 01  REC-CT                        PIC 99       VALUE ZERO.
020900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
021000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
021100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
021200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
021300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
021400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
021500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
021600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
021700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
021800 01  CCVS-H-1.
021900     02  FILLER                    PIC X(39)    VALUE SPACES.
022000     02  FILLER                    PIC X(42)    VALUE
022100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
022200     02  FILLER                    PIC X(39)    VALUE SPACES.
022300 01  CCVS-H-2A.
022400   02  FILLER                        PIC X(40)  VALUE SPACE.
022500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
022600   02  FILLER                        PIC XXXX   VALUE
022700     "4.2 ".
022800   02  FILLER                        PIC X(28)  VALUE
022900            " COPY - NOT FOR DISTRIBUTION".
023000   02  FILLER                        PIC X(41)  VALUE SPACE.
023100
023200 01  CCVS-H-2B.
023300   02  FILLER                        PIC X(15)  VALUE
023400            "TEST RESULT OF ".
023500   02  TEST-ID                       PIC X(9).
023600   02  FILLER                        PIC X(4)   VALUE
023700            " IN ".
023800   02  FILLER                        PIC X(12)  VALUE
023900     " HIGH       ".
024000   02  FILLER                        PIC X(22)  VALUE
024100            " LEVEL VALIDATION FOR ".
024200   02  FILLER                        PIC X(58)  VALUE
024300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024400 01  CCVS-H-3.
024500     02  FILLER                      PIC X(34)  VALUE
024600            " FOR OFFICIAL USE ONLY    ".
024700     02  FILLER                      PIC X(58)  VALUE
024800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
024900     02  FILLER                      PIC X(28)  VALUE
025000            "  COPYRIGHT   1985 ".
025100 01  CCVS-E-1.
025200     02 FILLER                       PIC X(52)  VALUE SPACE.
025300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
025400     02 ID-AGAIN                     PIC X(9).
025500     02 FILLER                       PIC X(45)  VALUE SPACES.
025600 01  CCVS-E-2.
025700     02  FILLER                      PIC X(31)  VALUE SPACE.
025800     02  FILLER                      PIC X(21)  VALUE SPACE.
025900     02 CCVS-E-2-2.
026000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
026100         03 FILLER                   PIC X      VALUE SPACE.
026200         03 ENDER-DESC               PIC X(44)  VALUE
026300            "ERRORS ENCOUNTERED".
026400 01  CCVS-E-3.
026500     02  FILLER                      PIC X(22)  VALUE
026600            " FOR OFFICIAL USE ONLY".
026700     02  FILLER                      PIC X(12)  VALUE SPACE.
026800     02  FILLER                      PIC X(58)  VALUE
026900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027000     02  FILLER                      PIC X(13)  VALUE SPACE.
027100     02 FILLER                       PIC X(15)  VALUE
027200             " COPYRIGHT 1985".
027300 01  CCVS-E-4.
027400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
027500     02 FILLER                       PIC X(4)   VALUE " OF ".
027600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
027700     02 FILLER                       PIC X(40)  VALUE
027800      "  TESTS WERE EXECUTED SUCCESSFULLY".
027900 01  XXINFO.
028000     02 FILLER                       PIC X(19)  VALUE
028100            "*** INFORMATION ***".
028200     02 INFO-TEXT.
028300       04 FILLER                     PIC X(8)   VALUE SPACE.
028400       04 XXCOMPUTED                 PIC X(20).
028500       04 FILLER                     PIC X(5)   VALUE SPACE.
028600       04 XXCORRECT                  PIC X(20).
028700     02 INF-ANSI-REFERENCE           PIC X(48).
028800 01  HYPHEN-LINE.
028900     02 FILLER  PIC IS X VALUE IS SPACE.
029000     02 FILLER  PIC IS X(65)    VALUE IS "************************
029100-    "*****************************************".
029200     02 FILLER  PIC IS X(54)    VALUE IS "************************
029300-    "******************************".
029400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
029500     "IX201A".
029600 PROCEDURE DIVISION.
029700 CCVS1 SECTION.
029800 OPEN-FILES.
029900P    OPEN I-O RAW-DATA.
030000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
030100P    READ RAW-DATA INVALID KEY GO TO END-E-1.
030200P    MOVE "ABORTED " TO C-ABORT.
030300P    ADD 1 TO C-NO-OF-TESTS.
030400P    ACCEPT C-DATE  FROM DATE.
030500P    ACCEPT C-TIME  FROM TIME.
030600P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
030700PEND-E-1.
030800P    CLOSE RAW-DATA.
030900     OPEN    OUTPUT PRINT-FILE.
031000     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
031100     MOVE    SPACE TO TEST-RESULTS.
031200     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
031300     MOVE    ZERO TO REC-SKL-SUB.
031400     PERFORM CCVS-INIT-FILE 9 TIMES.
031500 CCVS-INIT-FILE.
031600     ADD     1 TO REC-SKL-SUB.
031700     MOVE    FILE-RECORD-INFO-SKELETON
031800          TO FILE-RECORD-INFO (REC-SKL-SUB).
031900 CCVS-INIT-EXIT.
032000     GO TO CCVS1-EXIT.
032100 CLOSE-FILES.
032200P    OPEN I-O RAW-DATA.
032300P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
032400P    READ RAW-DATA INVALID KEY GO TO END-E-2.
032500P    MOVE "OK.     " TO C-ABORT.
032600P    MOVE PASS-COUNTER TO C-OK.
032700P    MOVE ERROR-HOLD   TO C-ALL.
032800P    MOVE ERROR-COUNTER TO C-FAIL.
032900P    MOVE DELETE-COUNTER TO C-DELETED.
033000P    MOVE INSPECT-COUNTER TO C-INSPECT.
033100P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
033200PEND-E-2.
033300P    CLOSE RAW-DATA.
033400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
033500 TERMINATE-CCVS.
033600S    EXIT PROGRAM.
033700STERMINATE-CALL.
033800     STOP     RUN.
033900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
034000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
034100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
034200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
034300     MOVE "****TEST DELETED****" TO RE-MARK.
034400 PRINT-DETAIL.
034500     IF REC-CT NOT EQUAL TO ZERO
034600             MOVE "." TO PARDOT-X
034700             MOVE REC-CT TO DOTVALUE.
034800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
034900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
035000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
035100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
035200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
035300     MOVE SPACE TO CORRECT-X.
035400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
035500     MOVE     SPACE TO RE-MARK.
035600 HEAD-ROUTINE.
035700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
036000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
036100 COLUMN-NAMES-ROUTINE.
036200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
036500 END-ROUTINE.
036600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
036700 END-RTN-EXIT.
036800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036900 END-ROUTINE-1.
037000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
037100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
037200      ADD PASS-COUNTER TO ERROR-HOLD.
037300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
037400      MOVE PASS-COUNTER TO CCVS-E-4-1.
037500      MOVE ERROR-HOLD TO CCVS-E-4-2.
037600      MOVE CCVS-E-4 TO CCVS-E-2-2.
037700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
037800  END-ROUTINE-12.
037900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
038000     IF       ERROR-COUNTER IS EQUAL TO ZERO
038100         MOVE "NO " TO ERROR-TOTAL
038200         ELSE
038300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
038400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
038500     PERFORM WRITE-LINE.
038600 END-ROUTINE-13.
038700     IF DELETE-COUNTER IS EQUAL TO ZERO
038800         MOVE "NO " TO ERROR-TOTAL  ELSE
038900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
039000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
039100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039200      IF   INSPECT-COUNTER EQUAL TO ZERO
039300          MOVE "NO " TO ERROR-TOTAL
039400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
039500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
039600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039800 WRITE-LINE.
039900     ADD 1 TO RECORD-COUNT.
040000Y    IF RECORD-COUNT GREATER 42
040100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
040200Y        MOVE SPACE TO DUMMY-RECORD
040300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
040400Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
040500Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
040600Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
040700Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
040800Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
040900Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
041000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
041100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
041200Y        MOVE ZERO TO RECORD-COUNT.
041300     PERFORM WRT-LN.
041400 WRT-LN.
041500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
041600     MOVE SPACE TO DUMMY-RECORD.
041700 BLANK-LINE-PRINT.
041800     PERFORM WRT-LN.
041900 FAIL-ROUTINE.
042000     IF     COMPUTED-X NOT EQUAL TO SPACE
042100            GO TO   FAIL-ROUTINE-WRITE.
042200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
042300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
042400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
042500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042600     MOVE   SPACES TO INF-ANSI-REFERENCE.
042700     GO TO  FAIL-ROUTINE-EX.
042800 FAIL-ROUTINE-WRITE.
042900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
043000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
043100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
043200     MOVE   SPACES TO COR-ANSI-REFERENCE.
043300 FAIL-ROUTINE-EX. EXIT.
043400 BAIL-OUT.
043500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
043600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
043700 BAIL-OUT-WRITE.
043800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
043900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
044000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044100     MOVE   SPACES TO INF-ANSI-REFERENCE.
044200 BAIL-OUT-EX. EXIT.
044300 CCVS1-EXIT.
044400     EXIT.
044500 SECT-IX-01-001 SECTION.
044600 WRITE-INIT-GF-01.
044700     MOVE     "WRITE       IX-FS1" TO FEATURE.
044800     OPEN     OUTPUT    IX-FS1.
044900     MOVE     "IX-FS1" TO XFILE-NAME (1).
045000     MOVE     "IX-F-G" TO XRECORD-NAME (1).
045100     MOVE     CCVS-PGM-ID TO XPROGRAM-NAME (1).
045200     MOVE     000240  TO XRECORD-LENGTH (1).
045300     MOVE     "RC"     TO CHARS-OR-RECORDS (1).
045400     MOVE     0001     TO XBLOCK-SIZE (1).
045500     MOVE     000500   TO RECORDS-IN-FILE (1).
045600     MOVE     "IX"  TO XFILE-ORGANIZATION (1).
045700     MOVE     "S"      TO XLABEL-TYPE (1).
045800     MOVE     000001   TO XRECORD-NUMBER (1).
045900 WRITE-TEST-GF-01.
046000     MOVE     XRECORD-NUMBER (1) TO WRK-DU-09V00-001.
046100     MOVE     GRP-0101 TO XRECORD-KEY (1).
046200     MOVE     FILE-RECORD-INFO (1) TO IX-FS1R1-F-G-240.
046300     WRITE    IX-FS1R1-F-G-240
046400              INVALID KEY GO TO WRITE-FAIL-GF-01.
046500     IF       XRECORD-NUMBER (1) EQUAL TO 500
046600              PERFORM PASS
046700              GO TO WRITE-WRITE-GF-01.
046800     ADD      000001 TO XRECORD-NUMBER (1).
046900     GO       TO WRITE-TEST-GF-01.
047000 WRITE-FAIL-GF-01.
047100     MOVE "BOUNDARY VIOLATION. WRITE FAILED; IX-41" TO RE-MARK.
047200     PERFORM FAIL.
047300 WRITE-WRITE-GF-01.
047400     MOVE     "WRITE-TEST-GF-01" TO PAR-NAME
047500     MOVE     "FILE CREATED, LFILE "  TO COMPUTED-A.
047600     MOVE     XRECORD-NUMBER (1) TO CORRECT-18V0.
047700     PERFORM  PRINT-DETAIL.
047800     CLOSE    IX-FS1.
047900 READ-INIT-F1-01.
048000     OPEN     INPUT     IX-FS1.
048100     MOVE     ZERO TO WRK-DU-09V00-001.
048200 READ-TEST-F1-01.
048300     READ     IX-FS1
048400              AT END GO TO READ-TEST-F1-01-1.
048500     MOVE     IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
048600     ADD      1  TO WRK-DU-09V00-001.
048700     IF       WRK-DU-09V00-001 GREATER 500
048800              MOVE "MORE THAN 500 RECORDS" TO RE-MARK
048900              GO TO READ-TEST-F1-01-1.
049000     GO       TO READ-TEST-F1-01.
049100 READ-TEST-F1-01-1.
049200     IF       XRECORD-NUMBER (1) NOT EQUAL TO 500
049300              MOVE "READ FAILED; IX-28, 4.5.2" TO RE-MARK
049400              PERFORM FAIL
049500              ELSE
049600              PERFORM PASS.
049700 READ-WRITE-F1-01.
049800     MOVE     "READ-TEST-F1-01" TO PAR-NAME.
049900     MOVE     "READ TO VERIFY " TO FEATURE.
050000     MOVE     "FILE VERIFIED, LFILE" TO COMPUTED-A.
050100     MOVE     XRECORD-NUMBER (1) TO CORRECT-18V0.
050200     PERFORM  PRINT-DETAIL.
050300     CLOSE    IX-FS1.
050400 CCVS-EXIT SECTION.
050500 CCVS-999999.
050600     GO TO CLOSE-FILES.
