000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX205A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*    THE FUNCTION OF THIS PROGRAM IS TO TEST THE PERMISSIBLE
001400*    SYNTACTICAL CONSTRUCTS OF COBOL ELEMENTS ASSOCIATED WITH
001500*    LEVEL 2 OF INDEXED I-O.  THE ELEMENTS TESTED IN THIS ROU-
001600*    TINE ARE:
001700*
001800*    (1) ACCESS MODE DYNAMIC;
001900*    (2) ALTERNATE RECORD KEY WITHOUT THE DUPLICATES OPTION;
002000*    (3) RESERVE CLAUSE;
002100*    (4) SAME CLAUSE;
002200*    (5) BLOCK CONTAINS INTEGER-1 TO INTEGER-2 CLAUSE;
002300*    (6) VALUE OF IMPLEMENTOR-NAME.
002400*
002500*   NEW TEST:   START ...
002600*              KEY IS GREATER THAN OR EQUAL TO  ...
002700*
002800*    EACH ELEMENT TESTED WILL BE EXERCISED SEMANTICALLY BY THIS
002900*    ROUTINE.  FILES ARE CREATED AND ACCESSED USING THE ACCESS
003000*    MODE IS DYNAMIC.
003100*
003200*
003300*       X-CARDS  WHICH MUST BE REPLACED FOR THIS PROGRAM ARE
003400*
003500*             X-24   INDEXED FILE IMPLEMENTOR-NAME IN ASSGN TO
003600*                    CLAUSE FOR DATA FILE IX-FS1
003700*             X-25   INDEXED FILE IMPLEMENTOR-NAME IN ASSIGN TO
003800*                    CLAUSE FOR DATA FILE IX-FD2
003900*             X-44   INDEXED FILE IMPLEMENTOR-NAME IN ASSGN TO
004000*                    CLAUSE FOR INDEX FILE IX-FS1
004100*             X-45   INDEXED FILE IMPLEMENTOR-NAME IN ASSIGN TO
004200*                    CLAUSE FOR INDEX FILE IX-FD2
004300*             X-55   IMPLEMENTOR-NAME FOR SYSTEM PRINTER
004400*             X-62   FOR RAW-DATA
004500*             X-82   IMPLEMENTOR-NAME FOR SOURCE-COMPUTER
004600*             X-83   IMPLEMENTOR-NAME FOR OBJECT-COMPUTER
004700*             X-84   LABEL RECORDS  FOR PRINT-FILE
004800*
004900*        NOTE:  X-CARDS 44, 45, 62 AND 84     ARE OPTIONAL
005000*               AND NEED ONLY TO BE PRESENT IF THE COMPILER RE-
005100*               QUIRES THIS CODE BE AVAILABLE FOR PROPER PROGRAM
005200*               COMPILATION AND EXECUTION. IF THE VP-ROUTINE IS
005300*               USED THE  X-CARDS MAY BE AUTOMATICALLY SELECTED
005400*               FOR INCLUSION IN THE PROGRAM BY SPECIFYING THE
005500*               APPROPRIATE LETTER IN THE "*OPT" VP-ROUTINE
005600*               CONTROL CARD. THE LETTER  CORRESPONDS TO A
005700*               CHARACTER IN POSITION 7 OF THE SOURCE LINE AND
005800*               THEY ARE AS FOLLOWS
005900*
006000*                  P  SELECTS X-CARDS 62
006100*                  J  SELECTS X-CARDS 44 AND 45
006200*                  C  SELECTS X-CARDS 84
006300*
006400******************************************************
006500 ENVIRONMENT DIVISION.
006600 CONFIGURATION SECTION.
006700 SOURCE-COMPUTER.
006800     XXXXX082.
006900 OBJECT-COMPUTER.
007000     XXXXX083.
007100 INPUT-OUTPUT SECTION.
007200 FILE-CONTROL.
007300P    SELECT RAW-DATA   ASSIGN TO
007400P    XXXXX062
007500P           ORGANIZATION IS INDEXED
007600P           ACCESS MODE IS RANDOM
007700P           RECORD KEY IS RAW-DATA-KEY.
007800     SELECT PRINT-FILE ASSIGN TO
007900     XXXXX055.
008000     SELECT   IX-FD1  ASSIGN TO
008100     XXXXX024
008200J    XXXXX044
008300              RESERVE  3  AREA
008400              ORGANIZATION IS INDEXED
008500              ACCESS MODE IS DYNAMIC
008600              RECORD  KEY IS IX-FD1-KEY
008700              ALTERNATE RECORD KEY IS IX-FD1-ALTKEY1.
008800     SELECT   IX-FD2    ASSIGN TO
008900     XXXXX025
009000J    XXXXX045
009100              RESERVE  2  AREAS
009200              ACCESS MODE  DYNAMIC
009300              ORGANIZATION INDEXED
009400              RECORD KEY  IX-FD2-KEY
009500              ALTERNATE RECORD        IX-FD2-ALTKEY1.
009600 I-O-CONTROL.
009700     SAME   RECORD  IX-FD1  IX-FD2.
009800 DATA DIVISION.
009900 FILE SECTION.
010000P
010100PFD  RAW-DATA.
010200P
010300P01  RAW-DATA-SATZ.
010400P    05  RAW-DATA-KEY        PIC X(6).
010500P    05  C-DATE              PIC 9(6).
010600P    05  C-TIME              PIC 9(8).
010700P    05  C-NO-OF-TESTS       PIC 99.
010800P    05  C-OK                PIC 999.
010900P    05  C-ALL               PIC 999.
011000P    05  C-FAIL              PIC 999.
011100P    05  C-DELETED           PIC 999.
011200P    05  C-INSPECT           PIC 999.
011300P    05  C-NOTE              PIC X(13).
011400P    05  C-INDENT            PIC X.
011500P    05  C-ABORT             PIC X(8).
011600 FD  PRINT-FILE.
011700 01  PRINT-REC PICTURE X(120).
011800 01  DUMMY-RECORD PICTURE X(120).
011900 FD  IX-FD1
012000C    LABEL  RECORDS ARE STANDARD
012100     RECORD CONTAINS  240  CHARACTERS.
012200 01  IX-FD1R1-F-G-240.
012300     05 IX-FD1-REC-120           PIC X(120).
012400     05 IX-FD1-REC-120-240.
012500              10 FILLER          PIC X(8).
012600              10 IX-FD1-REC-KEY.
012700                 15 FILLER       PIC X(19).
012800                 15 IX-FD1-KEY   PIC X(10).
012900              10 FILLER          PIC X(9).
013000              10 IX-FD1-ALT1-KEY.
013100                 15 FILLER       PIC X(19).
013200                 15 IX-FD1-ALTKEY1  PIC X(10).
013300              10 FILLER          PIC X(45).
013400 FD  IX-FD2
013500C    LABEL RECORDS ARE STANDARD
013600     BLOCK CONTAINS  5  TO  25  RECORDS
013700     RECORD CONTAINS  240  CHARACTERS.
013800 01  IX-FD2R1-F-G-240.
013900     05 IX-FD2-REC-120           PIC X(120).
014000     05 IX-FD2-REC-120-240.
014100              10 FILLER          PIC X(8).
014200              10 IX-FD2-REC-KEY.
014300                 15 FILLER       PIC X(19).
014400                 15 IX-FD2-KEY   PIC X(10).
014500              10 FILLER          PIC X(9).
014600              10 IX-FD2-ALT1-KEY.
014700                 15 FILLER       PIC X(19).
014800                 15 IX-FD2-ALTKEY1 PIC X(10).
014900              10 FILLER          PIC X(45).
015000 WORKING-STORAGE SECTION.
015100*01  IX-FD2-ID
015200*    XXXXX086.
015300 01  WRK-CS-09V00-001            PIC S9(9)    COMPUTATIONAL.
015400 01  WRK-REC-KEY-FD1.
015500     03 FILLER                   PIC X(19)         VALUE SPACE.
015600     03 WRK-DU-10V00-001         PIC 9(10)      VALUE ZERO.
015700 01  WRK-ALT1-KEY-FD1.
015800     03 FILLER                   PIC X(19)        VALUE SPACE.
015900     03 WRK-DU-10V00-002         PIC 9(10)     VALUE ZERO.
016000 01  FD1-FILE-SIZE               PIC 9(10)  VALUE 200.
016100 01  WRK-REC-KEY-FD2.
016200     03 FILLER                   PIC X(19)      VALUE SPACE.
016300     03 WRK-DU-10V00-003         PIC 9(10)    VALUE ZERO.
016400 01  WRK-ALT1-KEY-FD2.
016500     03 FILLER                   PIC X(19)      VALUE SPACE.
016600     03 WRK-DU-10V00-004         PIC 9(10)   VALUE ZERO.
016700 01  FD2-FILE-SIZE               PIC 9(10)  VALUE 200.
016800 01  FILE-RECORD-INFORMATION-REC.
016900     03 FILE-RECORD-INFO-SKELETON.
017000        05 FILLER                 PICTURE X(48)       VALUE
017100             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
017200        05 FILLER                 PICTURE X(46)       VALUE
017300             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
017400        05 FILLER                 PICTURE X(26)       VALUE
017500             ",LFIL=000000,ORG=  ,LBLR= ".
017600        05 FILLER                 PICTURE X(37)       VALUE
017700             ",RECKEY=                             ".
017800        05 FILLER                 PICTURE X(38)       VALUE
017900             ",ALTKEY1=                             ".
018000        05 FILLER                 PICTURE X(38)       VALUE
018100             ",ALTKEY2=                             ".
018200        05 FILLER                 PICTURE X(7)        VALUE SPACE.
018300     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
018400        05 FILE-RECORD-INFO-P1-120.
018500           07 FILLER              PIC X(5).
018600           07 XFILE-NAME           PIC X(6).
018700           07 FILLER              PIC X(8).
018800           07 XRECORD-NAME         PIC X(6).
018900           07 FILLER              PIC X(1).
019000           07 REELUNIT-NUMBER     PIC 9(1).
019100           07 FILLER              PIC X(7).
019200           07 XRECORD-NUMBER       PIC 9(6).
019300           07 FILLER              PIC X(6).
019400           07 UPDATE-NUMBER       PIC 9(2).
019500           07 FILLER              PIC X(5).
019600           07 ODO-NUMBER          PIC 9(4).
019700           07 FILLER              PIC X(5).
019800           07 XPROGRAM-NAME        PIC X(5).
019900           07 FILLER              PIC X(7).
020000           07 XRECORD-LENGTH       PIC 9(6).
020100           07 FILLER              PIC X(7).
020200           07 CHARS-OR-RECORDS    PIC X(2).
020300           07 FILLER              PIC X(1).
020400           07 XBLOCK-SIZE          PIC 9(4).
020500           07 FILLER              PIC X(6).
020600           07 RECORDS-IN-FILE     PIC 9(6).
020700           07 FILLER              PIC X(5).
020800           07 XFILE-ORGANIZATION   PIC X(2).
020900           07 FILLER              PIC X(6).
021000           07 XLABEL-TYPE          PIC X(1).
021100        05 FILE-RECORD-INFO-P121-240.
021200           07 FILLER              PIC X(8).
021300           07 XRECORD-KEY          PIC X(29).
021400           07 FILLER              PIC X(9).
021500           07 ALTERNATE-KEY1      PIC X(29).
021600           07 FILLER              PIC X(9).
021700           07 ALTERNATE-KEY2      PIC X(29).
021800           07 FILLER              PIC X(7).
021900 01  TEST-RESULTS.
022000     02 FILLER                   PIC X      VALUE SPACE.
022100     02 FEATURE                  PIC X(20)  VALUE SPACE.
022200     02 FILLER                   PIC X      VALUE SPACE.
022300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
022400     02 FILLER                   PIC X      VALUE SPACE.
022500     02  PAR-NAME.
022600       03 FILLER                 PIC X(19)  VALUE SPACE.
022700       03  PARDOT-X              PIC X      VALUE SPACE.
022800       03 DOTVALUE               PIC 99     VALUE ZERO.
022900     02 FILLER                   PIC X(8)   VALUE SPACE.
023000     02 RE-MARK                  PIC X(61).
023100 01  TEST-COMPUTED.
023200     02 FILLER                   PIC X(30)  VALUE SPACE.
023300     02 FILLER                   PIC X(17)  VALUE
023400            "       COMPUTED=".
023500     02 COMPUTED-X.
023600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
023700     03 COMPUTED-N               REDEFINES COMPUTED-A
023800                                 PIC -9(9).9(9).
023900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
024000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
024100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
024200     03       CM-18V0 REDEFINES COMPUTED-A.
024300         04 COMPUTED-18V0                    PIC -9(18).
024400         04 FILLER                           PIC X.
024500     03 FILLER PIC X(50) VALUE SPACE.
024600 01  TEST-CORRECT.
024700     02 FILLER PIC X(30) VALUE SPACE.
024800     02 FILLER PIC X(17) VALUE "       CORRECT =".
024900     02 CORRECT-X.
025000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
025100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
025200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
025300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
025400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
025500     03      CR-18V0 REDEFINES CORRECT-A.
025600         04 CORRECT-18V0                     PIC -9(18).
025700         04 FILLER                           PIC X.
025800     03 FILLER PIC X(2) VALUE SPACE.
025900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
026000 01  CCVS-C-1.
026100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
026200-    "SS  PARAGRAPH-NAME
026300-    "       REMARKS".
026400     02 FILLER                     PIC X(20)    VALUE SPACE.
026500 01  CCVS-C-2.
026600     02 FILLER                     PIC X        VALUE SPACE.
026700     02 FILLER                     PIC X(6)     VALUE "TESTED".
026800     02 FILLER                     PIC X(15)    VALUE SPACE.
026900     02 FILLER                     PIC X(4)     VALUE "FAIL".
027000     02 FILLER                     PIC X(94)    VALUE SPACE.
027100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
027200 01  REC-CT                        PIC 99       VALUE ZERO.
027300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
027400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
027500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
027600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
027700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
027800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
027900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
028000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
028100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
028200 01  CCVS-H-1.
028300     02  FILLER                    PIC X(39)    VALUE SPACES.
028400     02  FILLER                    PIC X(42)    VALUE
028500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
028600     02  FILLER                    PIC X(39)    VALUE SPACES.
028700 01  CCVS-H-2A.
028800   02  FILLER                        PIC X(40)  VALUE SPACE.
028900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
029000   02  FILLER                        PIC XXXX   VALUE
029100     "4.2 ".
029200   02  FILLER                        PIC X(28)  VALUE
029300            " COPY - NOT FOR DISTRIBUTION".
029400   02  FILLER                        PIC X(41)  VALUE SPACE.
029500
029600 01  CCVS-H-2B.
029700   02  FILLER                        PIC X(15)  VALUE
029800            "TEST RESULT OF ".
029900   02  TEST-ID                       PIC X(9).
030000   02  FILLER                        PIC X(4)   VALUE
030100            " IN ".
030200   02  FILLER                        PIC X(12)  VALUE
030300     " HIGH       ".
030400   02  FILLER                        PIC X(22)  VALUE
030500            " LEVEL VALIDATION FOR ".
030600   02  FILLER                        PIC X(58)  VALUE
030700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
030800 01  CCVS-H-3.
030900     02  FILLER                      PIC X(34)  VALUE
031000            " FOR OFFICIAL USE ONLY    ".
031100     02  FILLER                      PIC X(58)  VALUE
031200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
031300     02  FILLER                      PIC X(28)  VALUE
031400            "  COPYRIGHT   1985 ".
031500 01  CCVS-E-1.
031600     02 FILLER                       PIC X(52)  VALUE SPACE.
031700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
031800     02 ID-AGAIN                     PIC X(9).
031900     02 FILLER                       PIC X(45)  VALUE SPACES.
032000 01  CCVS-E-2.
032100     02  FILLER                      PIC X(31)  VALUE SPACE.
032200     02  FILLER                      PIC X(21)  VALUE SPACE.
032300     02 CCVS-E-2-2.
032400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
032500         03 FILLER                   PIC X      VALUE SPACE.
032600         03 ENDER-DESC               PIC X(44)  VALUE
032700            "ERRORS ENCOUNTERED".
032800 01  CCVS-E-3.
032900     02  FILLER                      PIC X(22)  VALUE
033000            " FOR OFFICIAL USE ONLY".
033100     02  FILLER                      PIC X(12)  VALUE SPACE.
033200     02  FILLER                      PIC X(58)  VALUE
033300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
033400     02  FILLER                      PIC X(13)  VALUE SPACE.
033500     02 FILLER                       PIC X(15)  VALUE
033600             " COPYRIGHT 1985".
033700 01  CCVS-E-4.
033800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
033900     02 FILLER                       PIC X(4)   VALUE " OF ".
034000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
034100     02 FILLER                       PIC X(40)  VALUE
034200      "  TESTS WERE EXECUTED SUCCESSFULLY".
034300 01  XXINFO.
034400     02 FILLER                       PIC X(19)  VALUE
034500            "*** INFORMATION ***".
034600     02 INFO-TEXT.
034700       04 FILLER                     PIC X(8)   VALUE SPACE.
034800       04 XXCOMPUTED                 PIC X(20).
034900       04 FILLER                     PIC X(5)   VALUE SPACE.
035000       04 XXCORRECT                  PIC X(20).
035100     02 INF-ANSI-REFERENCE           PIC X(48).
035200 01  HYPHEN-LINE.
035300     02 FILLER  PIC IS X VALUE IS SPACE.
035400     02 FILLER  PIC IS X(65)    VALUE IS "************************
035500-    "*****************************************".
035600     02 FILLER  PIC IS X(54)    VALUE IS "************************
035700-    "******************************".
035800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
035900     "IX205A".
036000 PROCEDURE DIVISION.
036100 CCVS1 SECTION.
036200 OPEN-FILES.
036300P    OPEN I-O RAW-DATA.
036400P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
036500P    READ RAW-DATA INVALID KEY GO TO END-E-1.
036600P    MOVE "ABORTED " TO C-ABORT.
036700P    ADD 1 TO C-NO-OF-TESTS.
036800P    ACCEPT C-DATE  FROM DATE.
036900P    ACCEPT C-TIME  FROM TIME.
037000P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
037100PEND-E-1.
037200P    CLOSE RAW-DATA.
037300     OPEN    OUTPUT PRINT-FILE.
037400     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
037500     MOVE    SPACE TO TEST-RESULTS.
037600     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
037700     MOVE    ZERO TO REC-SKL-SUB.
037800     PERFORM CCVS-INIT-FILE 9 TIMES.
037900 CCVS-INIT-FILE.
038000     ADD     1 TO REC-SKL-SUB.
038100     MOVE    FILE-RECORD-INFO-SKELETON
038200          TO FILE-RECORD-INFO (REC-SKL-SUB).
038300 CCVS-INIT-EXIT.
038400     GO TO CCVS1-EXIT.
038500 CLOSE-FILES.
038600P    OPEN I-O RAW-DATA.
038700P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
038800P    READ RAW-DATA INVALID KEY GO TO END-E-2.
038900P    MOVE "OK.     " TO C-ABORT.
039000P    MOVE PASS-COUNTER TO C-OK.
039100P    MOVE ERROR-HOLD   TO C-ALL.
039200P    MOVE ERROR-COUNTER TO C-FAIL.
039300P    MOVE DELETE-COUNTER TO C-DELETED.
039400P    MOVE INSPECT-COUNTER TO C-INSPECT.
039500P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
039600PEND-E-2.
039700P    CLOSE RAW-DATA.
039800     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
039900 TERMINATE-CCVS.
040000S    EXIT PROGRAM.
040100STERMINATE-CALL.
040200     STOP     RUN.
040300 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
040400 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
040500 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
040600 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
040700     MOVE "****TEST DELETED****" TO RE-MARK.
040800 PRINT-DETAIL.
040900     IF REC-CT NOT EQUAL TO ZERO
041000             MOVE "." TO PARDOT-X
041100             MOVE REC-CT TO DOTVALUE.
041200     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
041300     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
041400        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
041500          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
041600     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
041700     MOVE SPACE TO CORRECT-X.
041800     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
041900     MOVE     SPACE TO RE-MARK.
042000 HEAD-ROUTINE.
042100     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042200     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042300     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
042400     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
042500 COLUMN-NAMES-ROUTINE.
042600     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
042700     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
042900 END-ROUTINE.
043000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
043100 END-RTN-EXIT.
043200     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043300 END-ROUTINE-1.
043400      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
043500      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
043600      ADD PASS-COUNTER TO ERROR-HOLD.
043700*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
043800      MOVE PASS-COUNTER TO CCVS-E-4-1.
043900      MOVE ERROR-HOLD TO CCVS-E-4-2.
044000      MOVE CCVS-E-4 TO CCVS-E-2-2.
044100      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
044200  END-ROUTINE-12.
044300      MOVE "TEST(S) FAILED" TO ENDER-DESC.
044400     IF       ERROR-COUNTER IS EQUAL TO ZERO
044500         MOVE "NO " TO ERROR-TOTAL
044600         ELSE
044700         MOVE ERROR-COUNTER TO ERROR-TOTAL.
044800     MOVE     CCVS-E-2 TO DUMMY-RECORD.
044900     PERFORM WRITE-LINE.
045000 END-ROUTINE-13.
045100     IF DELETE-COUNTER IS EQUAL TO ZERO
045200         MOVE "NO " TO ERROR-TOTAL  ELSE
045300         MOVE DELETE-COUNTER TO ERROR-TOTAL.
045400     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
045500     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
045600      IF   INSPECT-COUNTER EQUAL TO ZERO
045700          MOVE "NO " TO ERROR-TOTAL
045800      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
045900      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
046000      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046100     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046200 WRITE-LINE.
046300     ADD 1 TO RECORD-COUNT.
046400Y    IF RECORD-COUNT GREATER 42
046500Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
046600Y        MOVE SPACE TO DUMMY-RECORD
046700Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
046800Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
046900Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
047000Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
047100Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
047200Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
047300Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
047400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
047500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
047600Y        MOVE ZERO TO RECORD-COUNT.
047700     PERFORM WRT-LN.
047800 WRT-LN.
047900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
048000     MOVE SPACE TO DUMMY-RECORD.
048100 BLANK-LINE-PRINT.
048200     PERFORM WRT-LN.
048300 FAIL-ROUTINE.
048400     IF     COMPUTED-X NOT EQUAL TO SPACE
048500            GO TO   FAIL-ROUTINE-WRITE.
048600     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
048700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
048800     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
048900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049000     MOVE   SPACES TO INF-ANSI-REFERENCE.
049100     GO TO  FAIL-ROUTINE-EX.
049200 FAIL-ROUTINE-WRITE.
049300     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
049400     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
049500     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
049600     MOVE   SPACES TO COR-ANSI-REFERENCE.
049700 FAIL-ROUTINE-EX. EXIT.
049800 BAIL-OUT.
049900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
050000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
050100 BAIL-OUT-WRITE.
050200     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
050300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
050400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050500     MOVE   SPACES TO INF-ANSI-REFERENCE.
050600 BAIL-OUT-EX. EXIT.
050700 CCVS1-EXIT.
050800     EXIT.
050900 SECT-IX-01-001  SECTION.
051000 WRITE-INIT-GF-01.
051100     OPEN     OUTPUT   IX-FD1.
051200     MOVE     ZERO TO WRK-CS-09V00-001.
051300     MOVE     ZERO TO WRK-DU-10V00-001.
051400     MOVE     "IX-FD1"  TO XFILE-NAME (1).
051500     MOVE     "R1-F-G"  TO XRECORD-NAME (1).
051600     MOVE     000001    TO XRECORD-NUMBER (1).
051700     MOVE     CCVS-PGM-ID TO XPROGRAM-NAME (1).
051800     MOVE     200  TO RECORDS-IN-FILE (1).
051900     MOVE     240  TO XRECORD-LENGTH (1).
052000     MOVE     0001      TO XBLOCK-SIZE (1).
052100     MOVE     "RC"      TO CHARS-OR-RECORDS (1).
052200     MOVE     "IX"      TO XFILE-ORGANIZATION (1).
052300     MOVE     "S"       TO XLABEL-TYPE (1).
052400     MOVE     000200    TO WRK-DU-10V00-002
052500     MOVE     "FILE CREATED"  TO RE-MARK.
052600     MOVE     "WRITE-TEST-GF-01" TO PAR-NAME.
052700     MOVE     "WRITE DYNAMIC MODE " TO FEATURE.
052800 WRITE-TEST-GF-01-R.
052900     MOVE     XRECORD-NUMBER (1) TO WRK-DU-10V00-001.
053000     MOVE     WRK-REC-KEY-FD1  TO XRECORD-KEY (1).
053100     MOVE     WRK-ALT1-KEY-FD1  TO ALTERNATE-KEY1 (1).
053200     MOVE     FILE-RECORD-INFO (1)  TO IX-FD1R1-F-G-240.
053300     WRITE    IX-FD1R1-F-G-240
053400                        INVALID KEY GO TO WRITE-TEST-GF-01.
053500     IF     XRECORD-NUMBER (1)  NOT LESS THAN FD1-FILE-SIZE
053600              GO TO    WRITE-TEST-GF-01.
053700     ADD      000001   TO XRECORD-NUMBER (1).
053800     SUBTRACT  000001   FROM WRK-DU-10V00-002.
053900     GO TO    WRITE-TEST-GF-01-R.
054000 WRITE-TEST-GF-01.
054100     MOVE     XRECORD-NUMBER  (1)  TO COMPUTED-18V0.
054200     MOVE     FD1-FILE-SIZE   TO CORRECT-18V0.
054300     IF       XRECORD-NUMBER (1)  EQUAL TO FD1-FILE-SIZE
054400              PERFORM  PASS
054500          ELSE
054600             MOVE     "FILE CREATION PREMATURE" TO RE-MARK
054700             PERFORM  FAIL.
054800     PERFORM   PRINT-DETAIL.
054900*
055000*    01
055100*
055200     CLOSE  IX-FD1.
055300 READ-INIT-F1-01.
055400     OPEN     INPUT  IX-FD1.
055500     MOVE     ZERO TO WRK-DU-10V00-001.
055600     MOVE     ZERO TO WRK-DU-10V00-002.
055700     MOVE    ZERO TO WRK-CS-09V00-001.
055800     MOVE     "READ-TEST-F1-01  "  TO PAR-NAME.
055900     MOVE     "READ NEXT RECORD "  TO FEATURE.
056000 READ-TEST-F1-01-3.
056100     ADD      1   TO WRK-DU-10V00-001.
056200     READ    IX-FD1
056300        NEXT RECORD
056400         AT END
056500              ADD    1000  TO WRK-DU-10V00-002.
056600*
056700*    COMPUTED RESULTS IN INCREMENTS OF 1000  INDICATE AT END PATH
056800*         HAS BEEN TAKEN.
056900*
057000     MOVE     IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
057100     IF       XRECORD-NUMBER (1)  NOT EQUAL TO WRK-DU-10V00-001
057200              ADD     1  TO WRK-DU-10V00-002.
057300*
057400*    COMPUTED RESULTS IN INCREMENTS OF 1  INDICATE THAT THE
057500*       RECORD RETRIEVED WAS NOT THE ONE EXPECTED.
057600*
057700     ADD     1  TO WRK-CS-09V00-001.
057800     IF      WRK-CS-09V00-001  GREATER THAN 24
057900              NEXT  SENTENCE  ELSE
058000              GO TO   READ-TEST-F1-01-3.
058100     IF       WRK-DU-10V00-002  GREATER THAN ZERO
058200              PERFORM  FAIL
058300              MOVE    WRK-DU-10V00-002 TO COMPUTED-18V0
058400              MOVE    ZERO TO CORRECT-18V0
058500              MOVE    "SEE  PROGRAM"  TO RE-MARK
058600              ELSE  PERFORM PASS.
058700     PERFORM   PRINT-DETAIL.
058800*
058900*    02
059000*
059100 READ-INIT-F2-02.
059200     MOVE  "READ-TEST-F1-02  "  TO PAR-NAME.
059300     MOVE  "READ . RECORD INVALID"  TO FEATURE.
059400     MOVE     ZERO TO WRK-DU-10V00-001.
059500     MOVE     ZERO TO WRK-CS-09V00-001.
059600     MOVE     ZERO TO WRK-DU-10V00-002.
059700 READ-TEST-F1-02-5.
059800     ADD      10  TO WRK-DU-10V00-001.
059900     MOVE     WRK-DU-10V00-001  TO IX-FD1-KEY
060000     READ     IX-FD1  RECORD
060100          INVALID KEY
060200              ADD   1000 TO WRK-DU-10V00-002.
060300*
060400*    COMPUTED RESULTS IN INCREMENTS OF 1000 INDICATE INVALID KEY
060500*       PATH HAS BEEN TAKEN.
060600*
060700     MOVE     IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
060800     IF       XRECORD-NUMBER (1)  NOT EQUAL TO WRK-DU-10V00-001
060900              ADD    1    TO WRK-DU-10V00-002.
061000*
061100*    COMPUTED RESULTS IN INCREMENTS OF 1  INDICAT THAT THE
061200*       RECORD RETRIEVED WAS NOT THE ONE EXPECTED.
061300*
061400     ADD     1  TO WRK-CS-09V00-001.
061500     IF      WRK-CS-09V00-001  GREATER THAN   10
061600              NEXT SENTENCE  ELSE
061700              GO TO    READ-TEST-F1-02-5.
061800 READ-TEST-F1-02.
061900     IF       WRK-DU-10V00-002  GREATER THAN ZERO
062000              PERFORM  FAIL
062100              MOVE    WRK-DU-10V00-002  TO COMPUTED-18V0
062200              MOVE    ZERO  TO CORRECT-18V0
062300              MOVE    "SEE PROGRAM"  TO RE-MARK
062400              ELSE  PERFORM  PASS.
062500     PERFORM   PRINT-DETAIL.
062600*
062700*    03
062800*
062900 READ-INIT-GF-03.
063000     MOVE  "READ-TEST-F1-03  "  TO PAR-NAME.
063100     MOVE  "START = READ  ALTERN."  TO FEATURE.
063200     MOVE    0000000200  TO WRK-DU-10V00-001.
063300     MOVE    WRK-REC-KEY-FD1  TO IX-FD1-REC-KEY.
063400     MOVE     FD1-FILE-SIZE TO WRK-DU-10V00-001.
063500     MOVE     0000000001 TO WRK-DU-10V00-002.
063600     MOVE    ZERO  TO  WRK-CS-09V00-001.
063700     MOVE    WRK-ALT1-KEY-FD1  TO IX-FD1-ALT1-KEY.
063800     MOVE    ZERO  TO WRK-DU-10V00-002.
063900     START    IX-FD1
064000                     KEY IS EQUAL TO IX-FD1-ALTKEY1
064100          INVALID KEY
064200                          ADD 1000000  TO WRK-DU-10V00-002.
064300*
064400*    COMPUTED RESULTS VALUE IN INCREMENTS OF 1000000 INDICATE
064500*        INVALID KEY PATH HAS BEEN TAKEN ON START STATEMENT.
064600*
064700 READ-TEST-F1-03.
064800     READ    IX-FD1
064900        NEXT RECORD
065000         AT END
065100              ADD   1000  TO WRK-DU-10V00-002.
065200*
065300*    COMPUTED RESULTS IN INCREMENTS OF 1000 INDICATE AT END PATH
065400*       HAS BEEN TAKEN ON THE READ STATEMENT.
065500*
065600     MOVE     IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
065700     IF       XRECORD-NUMBER (1)  NOT EQUAL TO WRK-DU-10V00-001
065800              ADD    1   TO WRK-DU-10V00-002.
065900*
066000*     COMPUTED RESULTS IN INCREMENTS OF 1 INDICATE THAT
066100*       RECORD  RETRIEVED WAS NOT THE ONE EXPECTED.
066200*
066300     SUBTRACT  1  FROM WRK-DU-10V00-001.
066400     ADD     1  TO WRK-CS-09V00-001.
066500     IF      WRK-CS-09V00-001  GREATER THAN 25
066600              NEXT  SENTENCE  ELSE
066700              GO TO READ-TEST-F1-03.
066800     IF       WRK-DU-10V00-002  GREATER THAN ZERO
066900              PERFORM  FAIL
067000              MOVE    WRK-DU-10V00-002 TO COMPUTED-18V0
067100              MOVE     ZERO TO CORRECT-18V0
067200              MOVE    "SEE PROGRAM"  TO RE-MARK
067300              ELSE    PERFORM  PASS.
067400     PERFORM   PRINT-DETAIL.
067500*
067600*    04
067700*
067800 READ-INIT-GF-04.
067900     MOVE  "READ-TEST-F1-04  "  TO PAR-NAME.
068000     MOVE  "START >= READ  ALTERN."  TO FEATURE.
068100     MOVE    0000000200  TO WRK-DU-10V00-001.
068200     MOVE    WRK-REC-KEY-FD1  TO IX-FD1-REC-KEY.
068300     MOVE     FD1-FILE-SIZE TO WRK-DU-10V00-001.
068400     MOVE     0000000001 TO WRK-DU-10V00-002.
068500     MOVE    ZERO  TO  WRK-CS-09V00-001.
068600     MOVE    WRK-ALT1-KEY-FD1  TO IX-FD1-ALT1-KEY.
068700     MOVE    ZERO  TO WRK-DU-10V00-002.
068800     START    IX-FD1
068900        KEY IS GREATER THAN OR EQUAL TO IX-FD1-ALTKEY1
069000          INVALID KEY
069100                          ADD 1000000  TO WRK-DU-10V00-002.
069200*
069300*    COMPUTED RESULTS VALUE IN INCREMENTS OF 1000000 INDICATE
069400*        INVALID KEY PATH HAS BEEN TAKEN ON START STATEMENT.
069500*
069600 READ-TEST-F1-04.
069700     READ    IX-FD1
069800        NEXT RECORD
069900         AT END
070000              ADD   1000  TO WRK-DU-10V00-002.
070100*
070200*    COMPUTED RESULTS IN INCREMENTS OF 1000 INDICATE AT END PATH
070300*       HAS BEEN TAKEN ON THE READ STATEMENT.
070400*
070500     MOVE     IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
070600     IF       XRECORD-NUMBER (1)  NOT EQUAL TO WRK-DU-10V00-001
070700              ADD    1   TO WRK-DU-10V00-002.
070800*
070900*     COMPUTED RESULTS IN INCREMENTS OF 1 INDICATE THAT
071000*       RECORD  RETRIEVED WAS NOT THE ONE EXPECTED.
071100*
071200     SUBTRACT  1  FROM WRK-DU-10V00-001.
071300     ADD     1  TO WRK-CS-09V00-001.
071400     IF      WRK-CS-09V00-001  GREATER THAN 25
071500              NEXT  SENTENCE  ELSE
071600              GO TO READ-TEST-F1-04.
071700     IF       WRK-DU-10V00-002  GREATER THAN ZERO
071800              PERFORM  FAIL
071900              MOVE    WRK-DU-10V00-002 TO COMPUTED-18V0
072000              MOVE     ZERO TO CORRECT-18V0
072100              MOVE    "SEE PROGRAM"  TO RE-MARK
072200              ELSE    PERFORM  PASS.
072300     PERFORM   PRINT-DETAIL.
072400     CLOSE    IX-FD1.
072500 READ-EXIT-F1.
072600     EXIT.
072700 SECT-IX-01-002 SECTION.
072800 WRITE-INIT-GF-02.
072900     OPEN     OUTPUT   IX-FD2.
073000     MOVE     ZERO TO  WRK-CS-09V00-001.
073100     MOVE     ZERO TO  WRK-DU-10V00-003.
073200     MOVE     "IX-FD2"  TO XFILE-NAME (2).
073300     MOVE     "R1-F-G"  TO XRECORD-NAME (2).
073400     MOVE     000001   TO XRECORD-NUMBER (2).
073500     MOVE     CCVS-PGM-ID  TO XPROGRAM-NAME (2).
073600     MOVE     000240     TO XRECORD-LENGTH (2).
073700     MOVE     "RC"      TO CHARS-OR-RECORDS (2).
073800     MOVE     0025    TO XBLOCK-SIZE (2).
073900     MOVE     0000200   TO RECORDS-IN-FILE (2).
074000     MOVE     "IX"     TO XFILE-ORGANIZATION (2).
074100     MOVE     "S"      TO XLABEL-TYPE (2).
074200     MOVE     000200    TO WRK-DU-10V00-004.
074300     MOVE     "FILE CREATED"  TO RE-MARK.
074400     MOVE     "WRITE-TEST-GF-02" TO PAR-NAME.
074500     MOVE     "DYNAMIC MODE"  TO FEATURE.
074600 WRITE-TEST-GF-02-R.
074700     MOVE     XRECORD-NUMBER (2) TO WRK-DU-10V00-003.
074800     MOVE     WRK-REC-KEY-FD2  TO XRECORD-KEY (2).
074900     MOVE     WRK-ALT1-KEY-FD2  TO ALTERNATE-KEY1 (2).
075000     MOVE     FILE-RECORD-INFO (2)  TO IX-FD2R1-F-G-240.
075100     WRITE    IX-FD2R1-F-G-240
075200              INVALID KEY GO TO WRITE-TEST-GF-02.
075300     IF       XRECORD-NUMBER (2)  NOT LESS THAN FD2-FILE-SIZE
075400              GO TO    WRITE-TEST-GF-02.
075500     ADD      000001  TO XRECORD-NUMBER (2).
075600     SUBTRACT 000001  FROM  WRK-DU-10V00-004.
075700     GO TO    WRITE-TEST-GF-02-R.
075800 WRITE-TEST-GF-02.
075900     MOVE     XRECORD-NUMBER  (2)  TO COMPUTED-18V0.
076000     MOVE     FD2-FILE-SIZE   TO CORRECT-18V0.
076100     IF       XRECORD-NUMBER (2)  EQUAL TO FD2-FILE-SIZE
076200              PERFORM  PASS
076300     ELSE
076400         MOVE     "FILE CREATION PREMATURE; IX-41" TO RE-MARK
076500         PERFORM  FAIL.
076600     PERFORM   PRINT-DETAIL.
076700*
076800*    02
076900*
077000     CLOSE    IX-FD2.
077100 READ-INIT-F1-05.
077200     OPEN     INPUT  IX-FD2.
077300     MOVE     ZERO TO WRK-DU-10V00-003.
077400     MOVE     ZERO TO WRK-DU-10V00-004.
077500     MOVE     "  READ SEQUENTIAL"  TO FEATURE.
077600     MOVE     ZERO TO WRK-CS-09V00-001.
077700 READ-TEST-F1-05-3.
077800     ADD      1   TO WRK-DU-10V00-003.
077900     READ     IX-FD2
078000              NEXT RECORD
078100         AT END
078200              ADD    1000  TO WRK-DU-10V00-004.
078300*
078400*    COMPUTED RESULTS IN INCREMENTS OF 1000  INDICATE AT END PATH
078500*         HAS BEEN TAKEN.
078600*
078700     MOVE     IX-FD2R1-F-G-240  TO FILE-RECORD-INFO (2).
078800     IF       XRECORD-NUMBER (2)  NOT EQUAL TO WRK-DU-10V00-003
078900              ADD     1  TO WRK-DU-10V00-004.
079000*
079100*    COMPUTED RESULTS IN INCREMENTS OF 1  INDICATE THAT THE
079200*       RECORD RETRIEVED WAS NOT THE ONE EXPECTED.
079300*
079400     ADD     000000001  TO WRK-CS-09V00-001.
079500     IF      WRK-CS-09V00-001  GREATER THAN  24
079600              NEXT  SENTENCE  ELSE
079700              GO TO   READ-TEST-F1-05-3.
079800 READ-TEST-F1-05.
079900     MOVE "READ-TEST-F1-05" TO PAR-NAME.
080000     IF       WRK-DU-10V00-004  GREATER THAN ZERO
080100              MOVE "RETRIEVED A NOT EXPECTED RECORD " TO RE-MARK
080200              PERFORM  FAIL
080300              MOVE    WRK-DU-10V00-004 TO COMPUTED-18V0
080400              MOVE    ZERO TO CORRECT-18V0
080500              MOVE    "SEE  PROGRAM"  TO RE-MARK
080600              ELSE  PERFORM PASS.
080700     PERFORM   PRINT-DETAIL.
080800*
080900*    06
081000*
081100 READ-TEST-F1-06-4.
081200     MOVE     ZERO TO WRK-DU-10V00-003.
081300     MOVE     ZERO TO WRK-DU-10V00-004.
081400     MOVE    ZERO  TO  WRK-CS-09V00-001.
081500     MOVE     "  READ RANDOM"  TO FEATURE.
081600 READ-TEST-F1-06-5.
081700     ADD      10  TO WRK-DU-10V00-003.
081800     MOVE     WRK-DU-10V00-003  TO IX-FD2-KEY
081900     READ     IX-FD2  RECORD
082000          INVALID KEY
082100              ADD   1000 TO WRK-DU-10V00-004.
082200*
082300*    COMPUTED RESULTS IN INCREMENTS OF 1000 INDICATE INVALID KEY
082400*       PATH HAS BEEN TAKEN.
082500*
082600     MOVE     IX-FD2R1-F-G-240  TO FILE-RECORD-INFO (2).
082700     IF       XRECORD-NUMBER (2)  NOT EQUAL TO WRK-DU-10V00-003
082800              ADD    1    TO WRK-DU-10V00-004.
082900*
083000*    COMPUTED RESULTS IN INCREMENTS OF 1  INDICAT THAT THE
083100*       RECORD RETRIEVED WAS NOT THE ONE EXPECTED.
083200*
083300     ADD     1  TO WRK-CS-09V00-001.
083400     IF      WRK-CS-09V00-001  GREATER THAN   10
083500              NEXT SENTENCE  ELSE
083600              GO TO    READ-TEST-F1-06-5.
083700 READ-TEST-F1-06.
083800     MOVE "READ-TEST-F1-06" TO PAR-NAME.
083900     IF       WRK-DU-10V00-004  GREATER THAN ZERO
084000              MOVE "RETRIEVED A NOT EXPECTED RECORD " TO RE-MARK
084100              PERFORM  FAIL
084200              MOVE    WRK-DU-10V00-004  TO COMPUTED-18V0
084300              MOVE    ZERO  TO CORRECT-18V0
084400              MOVE    "SEE PROGRAM"  TO RE-MARK
084500              ELSE  PERFORM  PASS.
084600     PERFORM   PRINT-DETAIL.
084700*
084800*    07
084900*
085000 READ-TEST-F1-07-6.
085100     MOVE    00000200  TO WRK-DU-10V00-003.
085200     MOVE    WRK-REC-KEY-FD2  TO IX-FD2-REC-KEY.
085300     MOVE     FD2-FILE-SIZE TO WRK-DU-10V00-003.
085400     MOVE     000000001 TO WRK-DU-10V00-004.
085500     MOVE    ZERO  TO  WRK-CS-09V00-001.
085600     MOVE    WRK-ALT1-KEY-FD2  TO IX-FD2-ALT1-KEY.
085700     MOVE     "  READ ALTERNATE KEY"  TO FEATURE.
085800     MOVE    ZERO TO WRK-DU-10V00-004.
085900     START   IX-FD2
086000                   KEY IS EQUAL TO IX-FD2-ALTKEY1
086100              INVALID KEY ADD 1000000  TO WRK-DU-10V00-004.
086200*
086300*    COMPUTED RESULTS VALUE IN INCREMENTS OF 1000000 INDICATE
086400*        INVALID KEY PATH HAS BEEN TAKEN ON START STATEMENT.
086500*
086600 READ-TEST-F1-07-7.
086700     READ    IX-FD2
086800        NEXT RECORD
086900         AT END
087000              ADD   1000  TO WRK-DU-10V00-004.
087100*
087200*    COMPUTED RESULTS IN INCREMENTS OF 1000 INDICATE AT END PATH
087300*       HAS BEEN TAKEN.
087400*
087500     MOVE     IX-FD2R1-F-G-240  TO FILE-RECORD-INFO (2).
087600     IF       XRECORD-NUMBER (2)  NOT EQUAL TO WRK-DU-10V00-003
087700              ADD    1   TO WRK-DU-10V00-004.
087800*
087900*     COMPUTED RESULTS IN INCREMENTS OF 1 INDICATE THAT
088000*       RECORD  RETRIEVED WAS NOT THE ONE EXPECTED.
088100*
088200     SUBTRACT  1  FROM WRK-DU-10V00-003.
088300     ADD     1  TO WRK-CS-09V00-001.
088400     IF      WRK-CS-09V00-001  GREATER THAN 25
088500              NEXT  SENTENCE  ELSE
088600              GO TO    READ-TEST-F1-07-7.
088700 READ-TEST-F1-07.
088800     MOVE "READ-TEST-F1-07" TO PAR-NAME.
088900     IF       WRK-DU-10V00-004  GREATER THAN ZERO
089000              PERFORM  FAIL
089100              MOVE    WRK-DU-10V00-004 TO COMPUTED-18V0
089200              MOVE     ZERO TO CORRECT-18V0
089300              MOVE    "SEE PROGRAM"  TO RE-MARK
089400              ELSE    PERFORM  PASS.
089500     PERFORM   PRINT-DETAIL.
089600     CLOSE    IX-FD2.
089700 INX-EXIT-002.
089800     EXIT.
089900 READ-INIT-F1-08.
090000     OPEN     INPUT    IX-FD1.
090100     OPEN     INPUT   IX-FD2.
090200     MOVE     SPACE TO FILE-RECORD-INFO (9).
090300     MOVE    SPACE TO FILE-RECORD-INFO (1).
090400     MOVE     ZERO TO WRK-DU-10V00-004.
090500     MOVE     SPACES   TO IX-FD1R1-F-G-240.
090600     MOVE     SPACES TO IX-FD2R1-F-G-240.
090700     MOVE    "SAME AREA" TO FEATURE.
090800 READ-TEST-F1-08-1.
090900     READ    IX-FD1
091000                NEXT RECORD
091100                AT END
091200              ADD     1000  TO WRK-DU-10V00-004.
091300     MOVE     IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
091400 READ-TEST-F1-08.
091500     MOVE "READ-TEST-F1-08" TO PAR-NAME.
091600     IF       XFILE-NAME (1)  EQUAL TO "IX-FD1"
091700              PERFORM  PASS
091800              ELSE
091900              MOVE "RETRIEVED A RECORD NOT EXPECTED " TO RE-MARK
092000              PERFORM FAIL
092100              MOVE    XFILE-NAME (1)  TO COMPUTED-A
092200              MOVE     "IX-FD1"  TO CORRECT-A.
092300     PERFORM   PRINT-DETAIL.
092400*
092500*    09
092600*
092700     READ    IX-FD2
092800               NEXT RECORD
092900                       AT END
093000              ADD    1000 TO WRK-DU-10V00-004.
093100*
093200*    COMPUTED RESULTS IN INCREMENTS OF 1000 INDICATE INVALID KEY
093300*       PATH HAS BEEN TAKEN.
093400*
093500 READ-TEST-F1-09.
093600     MOVE "READ-TEST-F1-09" TO PAR-NAME.
093700     IF       WRK-DU-10V00-004    EQUAL TO ZERO
093800              PERFORM PASS
093900            ELSE
094000              MOVE "RETRIEVED A RECORD NOT EXPECTED " TO RE-MARK
094100              PERFORM FAIL
094200              MOVE     WRK-DU-10V00-004  TO COMPUTED-A
094300              MOVE      ZERO TO CORRECT-A
094400              MOVE      "SEE PROGRAM"  TO RE-MARK.
094500     PERFORM   PRINT-DETAIL.
094600*
094700*    10
094800*
094900 READ-TEST-F1-10.
095000     MOVE "READ-TEST-F1-10" TO PAR-NAME.
095100     MOVE    IX-FD1R1-F-G-240  TO FILE-RECORD-INFO  (9).
095200*
095300*    NOTE    IN TESTING THE SAME AREA CLAUSE THE RECORD AREA
095400*       SHOULD BE SHARED BY BOTH FILES IX-FD1 AND IX-FD2,
095500*       THEREFORE FILE IX-FD2 IS READ AND THE RECORD
095600*       IDENTIFIED FOR IX-FD1 IS ACCESSED AND TESTED FOR
095700*       EXPECTED PRESENCE OF IX-FD2 FILE RECORD CONTENTS.
095800*
095900     IF       XFILE-NAME (9)  EQUAL TO "IX-FD2"
096000              PERFORM   PASS
096100              ELSE
096200              PERFORM   FAIL
096300              MOVE     XFILE-NAME (9)  TO COMPUTED-A
096400              MOVE "IX-FD2" TO CORRECT-A
096500              MOVE    "SEE PROGRAM"  TO RE-MARK.
096600     PERFORM   PRINT-DETAIL.
096700     CLOSE    IX-FD2.
096800     CLOSE    IX-FD1.
096900 INX-EXIT-003.
097000     EXIT.
097100 CCVS-EXIT SECTION.
097200 CCVS-999999.
097300     GO TO CLOSE-FILES.
