000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX214A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*         "IX214A"
002200******************************************************************
002300*    THE PURPOSE OF THE  PROGRAM IS TO TEST USE OF THE
002400*    START --- NOT LESS THAN --- STATEMENT USING FIRST THE PRIME
002500*    RECORD KEY AND THEN WITH AN ALTERNATE RECORD KEY
002600*    AS THE KEY OF REFERENCE.   THE START STATEMENT NAMES,
002700*    IN ITS CONSTRUCT , EITHER THE DATA NAME SPECIFIED IN THE
002800*    KEY CLAUSE OR A DATA ITEM THAT IS SUBORDINATE TO THE
002900*    KEY NAME.   DIFFERENT KEY VALUES ARE USED FOR TESTING.
003000*    IF A KEY VALUE IS PROVIDED WHICH MATCHES A RECORD IN THE FILE
003100*    WHEN THE START IS EXECUTED THEN THE RECORD IS EXPECTED TO
003200*    MADE AVAILABLE BY THE SUBSEQUENT READ STATEMENT.  IF A KEY
003300*    VALUE IS PROVIDED WHICH DOES NOT  MATCH ANY RECORD IN THE
003400*    FILE THEN THE INVALID KEY PATH IS EXPECTED TO BE TAKEN.
003500*    THE FILE STATUS CONTENTS RESULTING FROM EXECUTION OF THE
003600*    START TESTS ARE SAVED AND CHECKED IN LATER TESTS.
003700*
003800*            REFERENCE   AMERICAN NATIONAL STANDARD
003900*                        PROGRAMMING LANGUAGE COBOL, X3.23-1985.
004000*                        SECTION IX, INDEX I-O, THE START
004100*                        STATEMENT. PARAGRAPHS 4.7.3 (3), (4);
004200*                                              4.7.4 (1), (4), (5)
004300*                                                        AND
004400*                        THE FILE STATUS PARAGRAPH 1.3.4
004500*
004600*    BEFORE EXECUTION OF THE START IN EACH TEST, A RECORD IS MADE
004700*    AVAILABLE FROM THE FILE THAT IS DIFFERENT THAN WILL RESULT
004800*    FROM THE TEST.  IF DURING THIS PROCEDURE AN INVALID KEY OCCUR
004900*    THE TEST IS DELETED.  ALSO BEFORE EACH TEST THE RECORD KEY IS
005000*    LOADED WITH A KEY VALUE AND DEPENDING ON THE NATURE OF THE TE
005100*    THE KEY VALUE MAY OR MAY NOT BE A VALID KEY FOR THE FILE.
005200*
005300*    THIS PROGRAM FIRST CREATES AN  INDEXED SEQUENTIAL FILE
005400*    CONTAINING TWO ALTERNATE KEYS AND  THE ONE REQUIRED RECORD
005500*    KEY FOR THE FILE.  IMMEDIATELY FOLLOWING FILE CREATION THE
005600*    FILE IS READ AND THE RECORDS OF THE FILE VERIFIED FOR
005700*    ACCURACY.  NEXT THE TESTS ARE EXECUTED USING THE START ---
005800*    NOT LESS THAN ---STATEMENT.
005900*    THE RECORDS IN THE FILE ARE CREATED IN SEQUENTIAL ORDER BY
006000*    RECORD KEY VALUE.  FOLLOWING  IS A SAMPLE OF THE DATA
006100*    CONTENTS FOR THE RECORD KEY AND TWO ALTERNATE RECORD KEYS IN
006200*    THE FILE.
006300*
006400*   REC-NO  RECORD-KEY      ALTERNATE-KEY-1     ALTERNATE-KEY-2
006500*   ------  ----------      ---------------     ---------------
006600*    001   BBBBBBBBBC002 EEEEEEEEEF000ALTKEY1 WWWWWWWWWV398ALTKEY2
006700*    002   BBBBBBBBCC004 EEEEEEEEFF004ALTKEY1 WWWWWWWWVV396ALTKEY2
006800*    003   BBBBBBBCCC006 EEEEEEEFFF006ALTKEY1 WWWWWWWVVV394ALTKEY2
006900*     .          .                 .                    .
007000*     .          .                 .                    .
007100*     .          .                 .                    .
007200*    010   CCCCCCCCCC020 FFFFFFFFFF020ALTKEY1 VVVVVVVVVV380ALTKEY2
007300*    011   CCCCCCCCCD022 FFFFFFFFFG022ALTKEY1 VVVVVVVVVV380ALTKEY2
007400*    012   CCCCCCCCDD024 FFFFFFFFGG024ALTKEY1 VVVVVVVVUU376ALTKEY2
007500*     .          .                 .                    .
007600*     .          .                 .                    .
007700*     .          .                 .                    .
007800*    200   UUUUUUUUUU400 YYYYYYYYYY400ALTKEY1 DDDDDDDDDD000ALTKEY2
007900*
008000*     NOTE 1 - ALTERNATE KEY NUMBER 2 CONTAINS DUPLICATE KEYS
008100*              EVERY 10TH AND 11TH RECORDS.
008200*
008300*     NOTE 2 - THE FIRST 50 RECORDS AND LAST 25 RECORDS OF THE
008400*    FILE FOLLOW THE ABOVE SEQUENTIAL KEY PATTERN.  FOR THE MIDDLE
008500*    125 RECORDS ONLY THE NUMBER PART OF THE KEYS ARE VARIED
008600*    AND VARIED IN THE SEQUENCE SHOWN ABOVE.  THAT IS, RECORD-KEY
008700*    AND ALTERNATE-KEY-1 ARE INCREMENTED BY 2 AND THE ALTERNATE-
008800*    KEY-2 IS DECREMENTED BY 2 EACH TIME A RECORD IS WRITTEN TO
008900*    THE FILE.  THE FILE IS DESIGNED TO BE LARGE ENOUGH SO THAT
009000*    AN I-O OPERATION IS REQUIRED FOR EACH RECORD ACCESSED FROM
009100*    THE FILE.
009200*
009300*    FILE CHARACTERISTICS ARE: FILE SIZE            = 200 RECORDS
009400*                              RECORD SIZE          = 240 CHARS.
009500*                              RECORD KEY SIZE      = 13  CHARS.
009600*                              ALTERNATE KEY 1 SIZE = 20  CHARS.
009700*                              ALTERNATE KEY 2 SIZE = 20  CHARS.
009800*                              ACCESS MODE          = SEQUENTIAL
009900*
010000*    A LIST OF COBOL ELEMENTS WITH THE PARAGRAPH NAME IN PARENTH-
010100*    ESIS THAT TESTS THE ELEMENT AND A SHORT DESCRIPTION OF THE
010200*    TEST FOLLOWS.
010300*
010400*      PROGRAM COLLATING SEQUENCE CLAUSE. (ALL START TESTS) -
010500*            THE PROGRAM COLLATING SEQUENCE CLAUSE SHOULD HAVE NO
010600*            EFFECT ON THE COMARAISIONS ASSOCIATED WITH THE START
010700*            STATEMENT.  THIS PROGRAM ASSUMES THAT THE PROGRAM
010800*            COLLATING SEQUENCE CLAUSE ALSO DOES NOT IN ANY WAY
010900*            EFFECT THE SEQUENTIAL ORDER OF RECORDS ACCESSED
011000*            FROM OR WRITTEN TO THE FILE.
011100*      WRITE --- INVALID KEY---. (INX-TEST-001) - THIS TEST CREATE
011200*            A FILE OF 200 RECORDS CONTAINING ONE RECORD KEY AND
011300*            TWO ALTERNATE KEYS.
011400*      READ ---AT END ---. (INX-TEST-002) - THIS TEST READS THE
011500*            FILE CREATED IN INX-TEST-001 AND VERIFIES THAT   THE
011600*            FILE WAS CREATED CORRECTLY.
011700*      START ---KEY NOT LESS THAN RECORD-KEY INVALID KEY ---. (INX
011800*            TEST-003.01 THRU INX-TEST-003.04) - THE START
011900*            STATEMENT IS EXECUTED USING THE RECORD-KEY FOR THE
012000*            FILE CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
012100*            RECORD IN THE FILE (.01), BETWEEN TWO EXISTING KEY
012200*            VALUES (02), LESS THAN THE FIRST RECORD IN THE FILE
012300*            (.03) AND NOT LESS THAN THAN THE LAST RECORD IN THE
012400*            FILE (.04).
012500*      START ---KEY NOT LESS THAN DATA-ITEM  INVALID KEY ---. (INX
012600*            TEST-003.05 THRU INX-TEST-003.09) - THE START
012700*            STATEMENT IS EXECUTED USING A DATA ITEM WHICH IS
012800*            SUBORDINATE TO  THE RECORD-KEY NAME OF THE FILE
012900*            AND  CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
013000*            RECORD IN THE FILE (.05), EQUAL A VALUE PRESENT IN
013100*            IN MORE THAN ONE RECORD IN THE FILE (.06),
013200*            NOT EQUAL TO ANY RECORD IN THE FILE (.07, LESS THAN
013300*            THE FIRST RECORD IN THE FILE (.08) AND NOT LESS THAN
013400*            THE LAST RECORD IN THE FILE (.09.
013500*
013600*            NOTE -- IN SOME OF THE TESTS THE DATA ITEM SPECIFIED
013700*                    IS AN ENTRY SUBORDINATE TO A REDEFINES
013800*                    ENTRY WHICH USES AS ITS OBJECT THE KEY
013900*                   NAMED BY THE RECORD KEY CLAUSE.
014000*
014100*      FILE STATUS. (INX-TEST-004.01 THRU INX-TEST-004.09) - THESE
014200*            TESTS CHECK THE CONTENTS OF THE FILE STATUS RESULTING
014300*            FROM THE START IN INX-TEST-003.01 THRU
014400*            INX-TEST-003.09.
014500*      START ---KEY NOT LESS THAN ALTNATE-KEY INVALID KEY --. (INX
014600*            TEST-005.01 THRU INX-TEST-005.04) - THE START
014700*            STATEMENT IS EXECUTED USING THE ALTERNATE-KEY FOR THE
014800*            FILE CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
014900*            RECORD IN THE FILE (.01), BETWEEN TWO EXISTING KEY
015000*            VALUES (02), LESS THAN THE FIRST RECORD IN THE FILE
015100*            (.03) AND NOT LESS THAN THAN THE LAST RECORD IN THE
015200*            FILE (.04).
015300*      START ---KEY NOT LESS THAN DATA-ITEM   INVALID KEY --. (INX
015400*            TEST-005.05 THRU INX-TEST-005.09) - THE START
015500*            STATEMENT IS EXECUTED USING A DATA ITEM WHICH IS
015600*            SUBORDINATE TO THE ALTERNATE-KEY NAME OF THE FILE
015700*            AND  CONTAINING KEY VALUES WHICH RESPECTIVELY EQUAL A
015800*            RECORD IN THE FILE (.05), EQUAL A VALUE PRESENT IN
015900*            IN MORE THAN ONE RECORD IN THE FILE (.06),
016000*            NOT EQUAL TO ANY RECORD IN THE FILE (.07, LESS THAN
016100*            THE FIRST RECORD IN THE FILE (.08) AND NOT LESS THAN
016200*            THE LAST RECORD IN THE FILE (.09.
016300*
016400*            NOTE -- IN SOME OF THE TESTS THE DATA ITEM SPECIFIED
016500*                    IS AN ENTRY SUBORDINATE TO A REDEFINES
016600*                    ENTRY WHICH USES AS ITS OBJECT THE KEY
016700*                   NAMED BY THE RECORD KEY CLAUSE.
016800*
016900*      FILE STATUS. (INX-TEST-006.01 THRU INX-TEST-006.09) - THESE
017000*            TESTS CHECK THE CONTENTS OF THE FILE STATUS RESULTING
017100*            FROM THE START IN INX-TEST-005.01 THRU
017200*            INX-TEST-005.09.
017300*      MULTIPLE STARTS. (INX-TEST-007) -  THIS TEST EXECUTES
017400*            SEVERAL START STATEMENTS FOLLOWED BY A READ STATEMENT
017500*            AND EXPECTS THE RECORD  DESIGNATED BY THE LAST
017600*            START BE MADE AVAILABLE.
017700*
017800******************************************************************
017900*
018000 ENVIRONMENT DIVISION.
018100 CONFIGURATION SECTION.
018200 SOURCE-COMPUTER.
018300     XXXXX082.
018400 OBJECT-COMPUTER.
018500     XXXXX083
018600          PROGRAM COLLATING SEQUENCE IS FOR-INX-START-TEST.
018700 SPECIAL-NAMES.
018800     ALPHABET
018900     FOR-INX-START-TEST IS "WVUTSRJIHGFEDCB".
019000 INPUT-OUTPUT SECTION.
019100 FILE-CONTROL.
019200P    SELECT RAW-DATA   ASSIGN TO
019300P    XXXXX062
019400P           ORGANIZATION IS INDEXED
019500P           ACCESS MODE IS RANDOM
019600P           RECORD KEY IS RAW-DATA-KEY.
019700     SELECT PRINT-FILE ASSIGN TO
019800     XXXXX055.
019900     SELECT  IX-FS1
020000     ASSIGN TO
020100     XXXXX024
020200J    XXXXX044
020300        ACCESS MODE IS SEQUENTIAL
020400        ORGANIZATION IS INDEXED
020500        RECORD KEY IS IX-FS1-KEY
020600        ALTERNATE RECORD KEY IS IX-FS1-ALTKEY1
020700        ALTERNATE RECORD KEY IS IX-FS1-ALTKEY2 WITH DUPLICATES
020800        FILE STATUS IS FS1-STATUS.
020900 DATA DIVISION.
021000 FILE SECTION.
021100P
021200PFD  RAW-DATA.
021300P
021400P01  RAW-DATA-SATZ.
021500P    05  RAW-DATA-KEY        PIC X(6).
021600P    05  C-DATE              PIC 9(6).
021700P    05  C-TIME              PIC 9(8).
021800P    05  C-NO-OF-TESTS       PIC 99.
021900P    05  C-OK                PIC 999.
022000P    05  C-ALL               PIC 999.
022100P    05  C-FAIL              PIC 999.
022200P    05  C-DELETED           PIC 999.
022300P    05  C-INSPECT           PIC 999.
022400P    05  C-NOTE              PIC X(13).
022500P    05  C-INDENT            PIC X.
022600P    05  C-ABORT             PIC X(8).
022700 FD  PRINT-FILE.
022800 01  PRINT-REC PICTURE X(120).
022900 01  DUMMY-RECORD PICTURE X(120).
023000 FD  IX-FS1
023100C    LABEL RECORDS ARE STANDARD
023200C    DATA RECORD IS IX-FS1R1-F-G-240
023300     RECORD CONTAINS 240 CHARACTERS.
023400 01  IX-FS1R1-F-G-240.
023500     05 IX-FS1-REC-120           PICTURE X(120).
023600     05 IX-FS1-REC-121-240.
023700        10 FILLER                PICTURE X(8).
023800        10 IX-REC-KEY-AREA.
023900           15 IX-FS1-KEY.
024000              20 IX-FS1-KEY-1-10.
024100                 25 IX-FS1-KEY-1-5      PICTURE X(5).
024200                 25 IX-FS1-KEY-6-10     PICTURE X(5).
024300               20 IX-FS1-KEY-11-13      PICTURE X(3).
024400           15 IX-REDF-RECKEY REDEFINES IX-FS1-KEY.
024500              20 R-RECKEY-1-7    PICTURE X(7).
024600              20 R-RECKEY-8-13   PICTURE X(6).
024700           15 FILLER             PICTURE X(16).
024800        10 FILLER                PICTURE X(9).
024900        10 IX-ALT-KEY1-AREA.
025000           15 IX-FS1-ALTKEY1.
025100              20 IX-FS1-ALTKEY1-1-10.
025200                 25 IX-FS1-ALTKEY1-1-5  PICTURE X(5).
025300                 25 IX-FS1-ALTKEY1-6-10 PICTURE X(5).
025400              20 IX-FS1-ALTKEY1-11-13   PICTURE X(3).
025500              20 IX-FS1-ALTKEY1-14-20   PICTURE X(7).
025600           15 IX-REDF-ALTKEY1 REDEFINES IX-FS1-ALTKEY1.
025700              20 R-ALTKEY1-1-6   PICTURE X(6).
025800              20 R-ALTKEY1-7-10  PICTURE X(4).
025900              20 R-ALTKEY1-11-20 PICTURE X(10).
026000           15 FILLER             PICTURE X(9).
026100        10 FILLER                PICTURE X(9).
026200        10 IX-ALT-KEY2-AREA.
026300           15 IX-FS1-ALTKEY2.
026400              20 IX-FS1-ALTKEY2-1-10.
026500                 25 IX-FS1-ALTKEY2-1-5  PICTURE X(5).
026600                 25 IX-FS1-ALTKEY2-6-10 PICTURE X(5).
026700              20 IX-FS1-ALTKEY2-11-13   PICTURE X(3).
026800              20 IX-FS1-ALTKEY2-14-20   PICTURE X(7).
026900           15 FILLER             PICTURE X(9).
027000        10 FILLER                PICTURE X(7).
027100 WORKING-STORAGE SECTION.
027200 01  WRK-FS1-RECKEY.
027300     05 FS1-RECKEY-1-13.
027400        10 FS1-RECKEY-1-10       PICTURE X(10).
027500        10 FS1-RECKEY-11-13      PICTURE 9(3).
027600     05 FILLER                   PICTURE X(16)  VALUE SPACE.
027700 01  WRK-FS1-ALTKEY1.
027800      05 FS1-ALTKEY1-1-20.
027900       10  FS1-ALTKEY1-1-10.
028000        15 FS1-ALTKEY1-1-5       PICTURE X(5).
028100        15 FS1-ALTKEY1-6-10      PICTURE X(5).
028200       10 FS1-ALTKEY1-11-13      PICTURE 9(3).
028300       10 FS1-ALTKEY1-14-20      PICTURE X(7).
028400     05 FILLER                   PICTURE X(9)  VALUE SPACE.
028500 01  WRK-FS1-ALTKEY2.
028600     05 FS1-ALTKEY2-1-20.
028700        10 FS1-ALTKEY2-1-10.
028800           15 FS1-ALTKEY2-1-5    PICTURE X(5).
028900           15 FS1-ALTKEY2-6-10   PICTURE X(5).
029000        10 FS1-ALTKEY2-11-13     PICTURE 9(3).
029100        10 FS1-ALTKEY2-14-20     PICTURE X(7).
029200     05 FILLER                   PICTURE X(9) VALUE SPACE.
029300 01  RECNO                       PICTURE 9(5)  VALUE ZERO.
029400 01  FS1-STATUS                  PICTURE XX   VALUE SPACE.
029500 01  EXCUT-COUNTER-06V00         PICTURE 9(6) VALUE ZERO.
029600 01  KEYSUB                      PICTURE 9(3) COMPUTATIONAL.
029700 01  INVKEY-COUNTER              PICTURE 9(3) COMPUTATIONAL.
029800 01  RECORDS-WRITTEN             PICTURE 9(3).
029900 01  RECKEY-NUM                  PICTURE 9(3).
030000 01  ALTKEY1-NUM                 PICTURE 9(3).
030100 01  ALTKEY2-NUM                 PICTURE 9(3).
030200 01  RECORD-KEY-CONTENT.
030300     05 FILLER PIC X(53) VALUE
030400          "BBBBBBBBBC002EEEEEEEEEF002ALTKEY1WWWWWWWWWV398ALTKEY2".
030500     05 FILLER PIC X(53) VALUE
030600          "BBBBBBBBCC004EEEEEEEEFF004ALTKEY1WWWWWWWWVV396ALTKEY2".
030700     05 FILLER PIC X(53) VALUE
030800          "BBBBBBBCCC006EEEEEEEFFF006ALTKEY1WWWWWWWVVV394ALTKEY2".
030900     05 FILLER PIC X(53) VALUE
031000          "BBBBBBCCCC008EEEEEEFFFF008ALTKEY1WWWWWWVVVV392ALTKEY2".
031100     05 FILLER PIC X(53) VALUE
031200          "BBBBBCCCCC010EEEEEFFFFF010ALTKEY1WWWWWVVVVV390ALTKEY2".
031300     05 FILLER PIC X(53) VALUE
031400          "BBBBCCCCCC012EEEEFFFFFF012ALTKEY1WWWWVVVVVV388ALTKEY2".
031500     05 FILLER PIC X(53) VALUE
031600          "BBBCCCCCCC014EEEFFFFFFF014ALTKEY1WWWVVVVVVV386ALTKEY2".
031700     05 FILLER PIC X(53) VALUE
031800          "BBCCCCCCCC016EEFFFFFFFF016ALTKEY1WWVVVVVVVV384ALTKEY2".
031900     05 FILLER PIC X(53) VALUE
032000          "BCCCCCCCCC018EFFFFFFFFF018ALTKEY1WVVVVVVVVV382ALTKEY2".
032100     05 FILLER PIC X(53) VALUE
032200          "CCCCCCCCCC020FFFFFFFFFF020ALTKEY1VVVVVVVVVV380ALTKEY2".
032300     05 FILLER PIC X(53) VALUE
032400          "CCCCCCCCCD022FFFFFFFFFG022ALTKEY1VVVVVVVVVV380ALTKEY2".
032500     05 FILLER PIC X(53) VALUE
032600          "CCCCCCCCDD024FFFFFFFFGG024ALTKEY1VVVVVVVVUU376ALTKEY2".
032700     05 FILLER PIC X(53) VALUE
032800          "CCCCCCCDDD026FFFFFFFGGG026ALTKEY1VVVVVVVUUU374ALTKEY2".
032900     05 FILLER PIC X(53) VALUE
033000          "CCCCCCDDDD028FFFFFFGGGG028ALTKEY1VVVVVVUUUU372ALTKEY2".
033100     05 FILLER PIC X(53) VALUE
033200          "CCCCCDDDDD030FFFFFGGGGG030ALTKEY1VVVVVUUUUU370ALTKEY2".
033300     05 FILLER PIC X(53) VALUE
033400          "CCCCDDDDDD032FFFFGGGGGG032ALTKEY1VVVVUUUUUU368ALTKEY2".
033500     05 FILLER PIC X(53) VALUE
033600          "CCCDDDDDDD034FFFGGGGGGG034ALTKEY1VVVUUUUUUU366ALTKEY2".
033700     05 FILLER PIC X(53) VALUE
033800          "CCDDDDDDDD036FFGGGGGGGG036ALTKEY1VVUUUUUUUU364ALTKEY2".
033900     05 FILLER PIC X(53) VALUE
034000          "CDDDDDDDDD038FGGGGGGGGG038ALTKEY1VUUUUUUUUU362ALTKEY2".
034100     05 FILLER PIC X(53) VALUE
034200          "DDDDDDDDDD040GGGGGGGGGG040ALTKEY1UUUUUUUUUU360ALTKEY2".
034300     05 FILLER PIC X(53) VALUE
034400          "DDDDDDDDDE042GGGGGGGGGH042ALTKEY1UUUUUUUUUU360ALTKEY2".
034500     05 FILLER PIC X(53) VALUE
034600          "DDDDDDDDEE044GGGGGGGGHH044ALTKEY1UUUUUUUUTT356ALTKEY2".
034700     05 FILLER PIC X(53) VALUE
034800          "DDDDDDDEEE046GGGGGGGHHH046ALTKEY1UUUUUUUTTT354ALTKEY2".
034900     05 FILLER PIC X(53) VALUE
035000          "DDDDDDEEEE048GGGGGGHHHH048ALTKEY1UUUUUUTTTT352ALTKEY2".
035100     05 FILLER PIC X(53) VALUE
035200          "DDDDDEEEEE050GGGGGHHHHH050ALTKEY1UUUUUTTTTT350ALTKEY2".
035300     05 FILLER PIC X(53) VALUE
035400          "DDDDEEEEEE052GGGGHHHHHH052ALTKEY1UUUUTTTTTT348ALTKEY2".
035500     05 FILLER PIC X(53) VALUE
035600          "DDDEEEEEEE054GGGHHHHHHH054ALTKEY1UUUTTTTTTT346ALTKEY2".
035700     05 FILLER PIC X(53) VALUE
035800          "DDEEEEEEEE056GGHHHHHHHH056ALTKEY1UUTTTTTTTT344ALTKEY2".
035900     05 FILLER PIC X(53) VALUE
036000          "DEEEEEEEEE058GHHHHHHHHH058ALTKEY1UTTTTTTTTT342ALTKEY2".
036100     05 FILLER PIC X(53) VALUE
036200          "EEEEEEEEEE060HHHHHHHHHH060ALTKEY1TTTTTTTTTT340ALTKEY2".
036300     05 FILLER PIC X(53) VALUE
036400          "EEEEEEEEEF062HHHHHHHHHI062ALTKEY1TTTTTTTTTT340ALTKEY2".
036500     05 FILLER PIC X(53) VALUE
036600          "EEEEEEEEFF064HHHHHHHHII064ALTKEY1TTTTTTTTSS336ALTKEY2".
036700     05 FILLER PIC X(53) VALUE
036800          "EEEEEEEFFF066HHHHHHHIII066ALTKEY1TTTTTTTSSS334ALTKEY2".
036900     05 FILLER PIC X(53) VALUE
037000          "EEEEEEFFFF068HHHHHHIIII068ALTKEY1TTTTTTSSSS332ALTKEY2".
037100     05 FILLER PIC X(53) VALUE
037200          "EEEEEFFFFF070HHHHHIIIII070ALTKEY1TTTTTSSSSS330ALTKEY2".
037300     05 FILLER PIC X(53) VALUE
037400          "EEEEFFFFFF072HHHHIIIIII072ALTKEY1TTTTSSSSSS328ALTKEY2".
037500     05 FILLER PIC X(53) VALUE
037600          "EEEFFFFFFF074HHHIIIIIII074ALTKEY1TTTSSSSSSS326ALTKEY2".
037700     05 FILLER PIC X(53) VALUE
037800          "EEFFFFFFFF076HHIIIIIIII076ALTKEY1TTSSSSSSSS324ALTKEY2".
037900     05 FILLER PIC X(53) VALUE
038000          "EFFFFFFFFF078HIIIIIIIII078ALTKEY1TSSSSSSSSS322ALTKEY2".
038100     05 FILLER PIC X(53) VALUE
038200          "FFFFFFFFFF080IIIIIIIIII080ALTKEY1SSSSSSSSSS320ALTKEY2".
038300     05 FILLER PIC X(53) VALUE
038400          "FFFFFFFFFG082IIIIIIIIIJ082ALTKEY1SSSSSSSSSS320ALTKEY2".
038500     05 FILLER PIC X(53) VALUE
038600          "FFFFFFFFGG084IIIIIIIIJJ084ALTKEY1SSSSSSSSRR316ALTKEY2".
038700     05 FILLER PIC X(53) VALUE
038800          "FFFFFFFGGG086IIIIIIIJJJ086ALTKEY1SSSSSSSRRR314ALTKEY2".
038900     05 FILLER PIC X(53) VALUE
039000          "FFFFFFGGGG088IIIIIIJJJJ088ALTKEY1SSSSSSRRRR312ALTKEY2".
039100     05 FILLER PIC X(53) VALUE
039200          "FFFFFGGGGG090IIIIIJJJJJ090ALTKEY1SSSSSRRRRR310ALTKEY2".
039300     05 FILLER PIC X(53) VALUE
039400          "FFFFGGGGGG092IIIIJJJJJJ092ALTKEY1SSSSRRRRRR308ALTKEY2".
039500     05 FILLER PIC X(53) VALUE
039600          "FFFGGGGGGG094IIIJJJJJJJ094ALTKEY1SSSRRRRRRR306ALTKEY2".
039700     05 FILLER PIC X(53) VALUE
039800          "FFGGGGGGGG096IIJJJJJJJJ096ALTKEY1SSRRRRRRRR304ALTKEY2".
039900     05 FILLER PIC X(53) VALUE
040000          "FGGGGGGGGG098IJJJJJJJJJ098ALTKEY1SRRRRRRRRR302ALTKEY2".
040100     05 FILLER PIC X(53) VALUE
040200          "GGGGGGGGGG100JJJJJJJJJJ100ALTKEY1RRRRRRRRRR300ALTKEY2".
040300     05 FILLER PIC X(53) VALUE
040400          "RRRRSSSSSS352VVVVWWWWWW352ALTKEY1GGGGFFFFFF048ALTKEY2".
040500     05 FILLER PIC X(53) VALUE
040600          "RRRSSSSSSS354VVVWWWWWWW354ALTKEY1GGGFFFFFFF046ALTKEY2".
040700     05 FILLER PIC X(53) VALUE
040800          "RRSSSSSSSS356VVWWWWWWWW356ALTKEY1GGFFFFFFFF044ALTKEY2".
040900     05 FILLER PIC X(53) VALUE
041000          "RSSSSSSSSS358VWWWWWWWWW358ALTKEY1GFFFFFFFFF042ALTKEY2".
041100     05 FILLER PIC X(53) VALUE
041200          "SSSSSSSSSS360WWWWWWWWWW360ALTKEY1FFFFFFFFFF040ALTKEY2".
041300     05 FILLER PIC X(53) VALUE
041400          "SSSSSSSSST362WWWWWWWWWX362ALTKEY1FFFFFFFFFF040ALTKEY2".
041500     05 FILLER PIC X(53) VALUE
041600          "SSSSSSSSTT364WWWWWWWWXX364ALTKEY1FFFFFFFFEE036ALTKEY2".
041700     05 FILLER PIC X(53) VALUE
041800          "SSSSSSSTTT366WWWWWWWXXX366ALTKEY1FFFFFFFEEE034ALTKEY2".
041900     05 FILLER PIC X(53) VALUE
042000          "SSSSSSTTTT368WWWWWWXXXX368ALTKEY1FFFFFFEEEE032ALTKEY2".
042100     05 FILLER PIC X(53) VALUE
042200          "SSSSSTTTTT370WWWWWXXXXX370ALTKEY1FFFFFEEEEE030ALTKEY2".
042300     05 FILLER PIC X(53) VALUE
042400          "SSSSTTTTTT372WWWWXXXXXX372ALTKEY1FFFFEEEEEE028ALTKEY2".
042500     05 FILLER PIC X(53) VALUE
042600          "SSSTTTTTTT374WWWXXXXXXX374ALTKEY1FFFEEEEEEE026ALTKEY2".
042700     05 FILLER PIC X(53) VALUE
042800          "SSTTTTTTTT376WWXXXXXXXX376ALTKEY1FFEEEEEEEE024ALTKEY2".
042900     05 FILLER PIC X(53) VALUE
043000          "STTTTTTTTT378WXXXXXXXXX378ALTKEY1FEEEEEEEEE022ALTKEY2".
043100     05 FILLER PIC X(53) VALUE
043200          "TTTTTTTTTT380XXXXXXXXXX380ALTKEY1EEEEEEEEEE020ALTKEY2".
043300     05 FILLER PIC X(53) VALUE
043400          "TTTTTTTTTU382XXXXXXXXXY382ALTKEY1EEEEEEEEEE020ALTKEY2".
043500     05 FILLER PIC X(53) VALUE
043600          "TTTTTTTTUU384XXXXXXXXYY384ALTKEY1EEEEEEEEDD016ALTKEY2".
043700     05 FILLER PIC X(53) VALUE
043800          "TTTTTTTUUU386XXXXXXXYYY386ALTKEY1EEEEEEEDDD014ALTKEY2".
043900     05 FILLER PIC X(53) VALUE
044000          "TTTTTTUUUU388XXXXXXYYYY388ALTKEY1EEEEEEDDDD012ALTKEY2".
044100     05 FILLER PIC X(53) VALUE
044200          "TTTTTUUUUU390XXXXXYYYYY390ALTKEY1EEEEEDDDDD010ALTKEY2".
044300     05 FILLER PIC X(53) VALUE
044400          "TTTTUUUUUU392XXXXYYYYYY392ALTKEY1EEEEDDDDDD008ALTKEY2".
044500     05 FILLER PIC X(53) VALUE
044600          "TTTUUUUUUU394XXXYYYYYYY394ALTKEY1EEEDDDDDDD006ALTKEY2".
044700     05 FILLER PIC X(53) VALUE
044800          "TTUUUUUUUU396XXYYYYYYYY396ALTKEY1EEDDDDDDDD004ALTKEY2".
044900     05 FILLER PIC X(53) VALUE
045000          "TUUUUUUUUU398XYYYYYYYYY398ALTKEY1EDDDDDDDDD002ALTKEY2".
045100     05 FILLER PIC X(53) VALUE
045200          "UUUUUUUUUU400YYYYYYYYYY400ALTKEY1DDDDDDDDDD000ALTKEY2".
045300 01  RECORD-KEY-DATA   REDEFINES  RECORD-KEY-CONTENT.
045400     05 KEY-VALUES                  OCCURS 75  TIMES.
045500       10 RECKEY-VALUE           PICTURE X(13).
045600       10 ALTKEY1-VALUE          PICTURE X(20).
045700       10 ALTKEY2-VALUE          PICTURE X(20).
045800 01  INIT-FLAG                   PICTURE 9.
045900 01  HOLD-FILESTATUS-RECORD.
046000     05 FILESTATUS               PICTURE XX  OCCURS 10 TIMES.
046100 01  FILE-RECORD-INFORMATION-REC.
046200     03 FILE-RECORD-INFO-SKELETON.
046300        05 FILLER                 PICTURE X(48)       VALUE
046400             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
046500        05 FILLER                 PICTURE X(46)       VALUE
046600             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
046700        05 FILLER                 PICTURE X(26)       VALUE
046800             ",LFIL=000000,ORG=  ,LBLR= ".
046900        05 FILLER                 PICTURE X(37)       VALUE
047000             ",RECKEY=                             ".
047100        05 FILLER                 PICTURE X(38)       VALUE
047200             ",ALTKEY1=                             ".
047300        05 FILLER                 PICTURE X(38)       VALUE
047400             ",ALTKEY2=                             ".
047500        05 FILLER                 PICTURE X(7)        VALUE SPACE.
047600     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
047700        05 FILE-RECORD-INFO-P1-120.
047800           07 FILLER              PIC X(5).
047900           07 XFILE-NAME           PIC X(6).
048000           07 FILLER              PIC X(8).
048100           07 XRECORD-NAME         PIC X(6).
048200           07 FILLER              PIC X(1).
048300           07 REELUNIT-NUMBER     PIC 9(1).
048400           07 FILLER              PIC X(7).
048500           07 XRECORD-NUMBER       PIC 9(6).
048600           07 FILLER              PIC X(6).
048700           07 UPDATE-NUMBER       PIC 9(2).
048800           07 FILLER              PIC X(5).
048900           07 ODO-NUMBER          PIC 9(4).
049000           07 FILLER              PIC X(5).
049100           07 XPROGRAM-NAME        PIC X(5).
049200           07 FILLER              PIC X(7).
049300           07 XRECORD-LENGTH       PIC 9(6).
049400           07 FILLER              PIC X(7).
049500           07 CHARS-OR-RECORDS    PIC X(2).
049600           07 FILLER              PIC X(1).
049700           07 XBLOCK-SIZE          PIC 9(4).
049800           07 FILLER              PIC X(6).
049900           07 RECORDS-IN-FILE     PIC 9(6).
050000           07 FILLER              PIC X(5).
050100           07 XFILE-ORGANIZATION   PIC X(2).
050200           07 FILLER              PIC X(6).
050300           07 XLABEL-TYPE          PIC X(1).
050400        05 FILE-RECORD-INFO-P121-240.
050500           07 FILLER              PIC X(8).
050600           07 XRECORD-KEY          PIC X(29).
050700           07 FILLER              PIC X(9).
050800           07 ALTERNATE-KEY1      PIC X(29).
050900           07 FILLER              PIC X(9).
051000           07 ALTERNATE-KEY2      PIC X(29).
051100           07 FILLER              PIC X(7).
051200 01  TEST-RESULTS.
051300     02 FILLER                   PIC X      VALUE SPACE.
051400     02 FEATURE                  PIC X(20)  VALUE SPACE.
051500     02 FILLER                   PIC X      VALUE SPACE.
051600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
051700     02 FILLER                   PIC X      VALUE SPACE.
051800     02  PAR-NAME.
051900       03 FILLER                 PIC X(19)  VALUE SPACE.
052000       03  PARDOT-X              PIC X      VALUE SPACE.
052100       03 DOTVALUE               PIC 99     VALUE ZERO.
052200     02 FILLER                   PIC X(8)   VALUE SPACE.
052300     02 RE-MARK                  PIC X(61).
052400 01  TEST-COMPUTED.
052500     02 FILLER                   PIC X(30)  VALUE SPACE.
052600     02 FILLER                   PIC X(17)  VALUE
052700            "       COMPUTED=".
052800     02 COMPUTED-X.
052900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
053000     03 COMPUTED-N               REDEFINES COMPUTED-A
053100                                 PIC -9(9).9(9).
053200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
053300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
053400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
053500     03       CM-18V0 REDEFINES COMPUTED-A.
053600         04 COMPUTED-18V0                    PIC -9(18).
053700         04 FILLER                           PIC X.
053800     03 FILLER PIC X(50) VALUE SPACE.
053900 01  TEST-CORRECT.
054000     02 FILLER PIC X(30) VALUE SPACE.
054100     02 FILLER PIC X(17) VALUE "       CORRECT =".
054200     02 CORRECT-X.
054300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
054400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
054500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
054600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
054700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
054800     03      CR-18V0 REDEFINES CORRECT-A.
054900         04 CORRECT-18V0                     PIC -9(18).
055000         04 FILLER                           PIC X.
055100     03 FILLER PIC X(2) VALUE SPACE.
055200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
055300 01  CCVS-C-1.
055400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
055500-    "SS  PARAGRAPH-NAME
055600-    "       REMARKS".
055700     02 FILLER                     PIC X(20)    VALUE SPACE.
055800 01  CCVS-C-2.
055900     02 FILLER                     PIC X        VALUE SPACE.
056000     02 FILLER                     PIC X(6)     VALUE "TESTED".
056100     02 FILLER                     PIC X(15)    VALUE SPACE.
056200     02 FILLER                     PIC X(4)     VALUE "FAIL".
056300     02 FILLER                     PIC X(94)    VALUE SPACE.
056400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
056500 01  REC-CT                        PIC 99       VALUE ZERO.
056600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
056700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
056800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
056900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
057000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
057100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
057200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
057300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
057400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
057500 01  CCVS-H-1.
057600     02  FILLER                    PIC X(39)    VALUE SPACES.
057700     02  FILLER                    PIC X(42)    VALUE
057800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
057900     02  FILLER                    PIC X(39)    VALUE SPACES.
058000 01  CCVS-H-2A.
058100   02  FILLER                        PIC X(40)  VALUE SPACE.
058200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
058300   02  FILLER                        PIC XXXX   VALUE
058400     "4.2 ".
058500   02  FILLER                        PIC X(28)  VALUE
058600            " COPY - NOT FOR DISTRIBUTION".
058700   02  FILLER                        PIC X(41)  VALUE SPACE.
058800
058900 01  CCVS-H-2B.
059000   02  FILLER                        PIC X(15)  VALUE
059100            "TEST RESULT OF ".
059200   02  TEST-ID                       PIC X(9).
059300   02  FILLER                        PIC X(4)   VALUE
059400            " IN ".
059500   02  FILLER                        PIC X(12)  VALUE
059600     " HIGH       ".
059700   02  FILLER                        PIC X(22)  VALUE
059800            " LEVEL VALIDATION FOR ".
059900   02  FILLER                        PIC X(58)  VALUE
060000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
060100 01  CCVS-H-3.
060200     02  FILLER                      PIC X(34)  VALUE
060300            " FOR OFFICIAL USE ONLY    ".
060400     02  FILLER                      PIC X(58)  VALUE
060500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
060600     02  FILLER                      PIC X(28)  VALUE
060700            "  COPYRIGHT   1985 ".
060800 01  CCVS-E-1.
060900     02 FILLER                       PIC X(52)  VALUE SPACE.
061000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
061100     02 ID-AGAIN                     PIC X(9).
061200     02 FILLER                       PIC X(45)  VALUE SPACES.
061300 01  CCVS-E-2.
061400     02  FILLER                      PIC X(31)  VALUE SPACE.
061500     02  FILLER                      PIC X(21)  VALUE SPACE.
061600     02 CCVS-E-2-2.
061700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
061800         03 FILLER                   PIC X      VALUE SPACE.
061900         03 ENDER-DESC               PIC X(44)  VALUE
062000            "ERRORS ENCOUNTERED".
062100 01  CCVS-E-3.
062200     02  FILLER                      PIC X(22)  VALUE
062300            " FOR OFFICIAL USE ONLY".
062400     02  FILLER                      PIC X(12)  VALUE SPACE.
062500     02  FILLER                      PIC X(58)  VALUE
062600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
062700     02  FILLER                      PIC X(13)  VALUE SPACE.
062800     02 FILLER                       PIC X(15)  VALUE
062900             " COPYRIGHT 1985".
063000 01  CCVS-E-4.
063100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
063200     02 FILLER                       PIC X(4)   VALUE " OF ".
063300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
063400     02 FILLER                       PIC X(40)  VALUE
063500      "  TESTS WERE EXECUTED SUCCESSFULLY".
063600 01  XXINFO.
063700     02 FILLER                       PIC X(19)  VALUE
063800            "*** INFORMATION ***".
063900     02 INFO-TEXT.
064000       04 FILLER                     PIC X(8)   VALUE SPACE.
064100       04 XXCOMPUTED                 PIC X(20).
064200       04 FILLER                     PIC X(5)   VALUE SPACE.
064300       04 XXCORRECT                  PIC X(20).
064400     02 INF-ANSI-REFERENCE           PIC X(48).
064500 01  HYPHEN-LINE.
064600     02 FILLER  PIC IS X VALUE IS SPACE.
064700     02 FILLER  PIC IS X(65)    VALUE IS "************************
064800-    "*****************************************".
064900     02 FILLER  PIC IS X(54)    VALUE IS "************************
065000-    "******************************".
065100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
065200     "IX214A".
065300 PROCEDURE DIVISION.
065400 CCVS1 SECTION.
065500 OPEN-FILES.
065600P    OPEN I-O RAW-DATA.
065700P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
065800P    READ RAW-DATA INVALID KEY GO TO END-E-1.
065900P    MOVE "ABORTED " TO C-ABORT.
066000P    ADD 1 TO C-NO-OF-TESTS.
066100P    ACCEPT C-DATE  FROM DATE.
066200P    ACCEPT C-TIME  FROM TIME.
066300P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
066400PEND-E-1.
066500P    CLOSE RAW-DATA.
066600     OPEN    OUTPUT PRINT-FILE.
066700     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
066800     MOVE    SPACE TO TEST-RESULTS.
066900     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
067000     MOVE    ZERO TO REC-SKL-SUB.
067100     PERFORM CCVS-INIT-FILE 9 TIMES.
067200 CCVS-INIT-FILE.
067300     ADD     1 TO REC-SKL-SUB.
067400     MOVE    FILE-RECORD-INFO-SKELETON
067500          TO FILE-RECORD-INFO (REC-SKL-SUB).
067600 CCVS-INIT-EXIT.
067700     GO TO CCVS1-EXIT.
067800 CLOSE-FILES.
067900P    OPEN I-O RAW-DATA.
068000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
068100P    READ RAW-DATA INVALID KEY GO TO END-E-2.
068200P    MOVE "OK.     " TO C-ABORT.
068300P    MOVE PASS-COUNTER TO C-OK.
068400P    MOVE ERROR-HOLD   TO C-ALL.
068500P    MOVE ERROR-COUNTER TO C-FAIL.
068600P    MOVE DELETE-COUNTER TO C-DELETED.
068700P    MOVE INSPECT-COUNTER TO C-INSPECT.
068800P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
068900PEND-E-2.
069000P    CLOSE RAW-DATA.
069100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
069200 TERMINATE-CCVS.
069300S    EXIT PROGRAM.
069400STERMINATE-CALL.
069500     STOP     RUN.
069600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
069700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
069800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
069900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
070000     MOVE "****TEST DELETED****" TO RE-MARK.
070100 PRINT-DETAIL.
070200     IF REC-CT NOT EQUAL TO ZERO
070300             MOVE "." TO PARDOT-X
070400             MOVE REC-CT TO DOTVALUE.
070500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
070600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
070700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
070800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
070900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
071000     MOVE SPACE TO CORRECT-X.
071100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
071200     MOVE     SPACE TO RE-MARK.
071300 HEAD-ROUTINE.
071400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
071500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
071600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
071700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
071800 COLUMN-NAMES-ROUTINE.
071900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
072000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
072100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
072200 END-ROUTINE.
072300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
072400 END-RTN-EXIT.
072500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
072600 END-ROUTINE-1.
072700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
072800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
072900      ADD PASS-COUNTER TO ERROR-HOLD.
073000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
073100      MOVE PASS-COUNTER TO CCVS-E-4-1.
073200      MOVE ERROR-HOLD TO CCVS-E-4-2.
073300      MOVE CCVS-E-4 TO CCVS-E-2-2.
073400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
073500  END-ROUTINE-12.
073600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
073700     IF       ERROR-COUNTER IS EQUAL TO ZERO
073800         MOVE "NO " TO ERROR-TOTAL
073900         ELSE
074000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
074100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
074200     PERFORM WRITE-LINE.
074300 END-ROUTINE-13.
074400     IF DELETE-COUNTER IS EQUAL TO ZERO
074500         MOVE "NO " TO ERROR-TOTAL  ELSE
074600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
074700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
074800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
074900      IF   INSPECT-COUNTER EQUAL TO ZERO
075000          MOVE "NO " TO ERROR-TOTAL
075100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
075200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
075300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
075400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
075500 WRITE-LINE.
075600     ADD 1 TO RECORD-COUNT.
075700Y    IF RECORD-COUNT GREATER 42
075800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
075900Y        MOVE SPACE TO DUMMY-RECORD
076000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
076100Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
076200Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
076300Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
076400Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
076500Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
076600Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
076700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
076800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
076900Y        MOVE ZERO TO RECORD-COUNT.
077000     PERFORM WRT-LN.
077100 WRT-LN.
077200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
077300     MOVE SPACE TO DUMMY-RECORD.
077400 BLANK-LINE-PRINT.
077500     PERFORM WRT-LN.
077600 FAIL-ROUTINE.
077700     IF     COMPUTED-X NOT EQUAL TO SPACE
077800            GO TO   FAIL-ROUTINE-WRITE.
077900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
078000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
078100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
078200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
078300     MOVE   SPACES TO INF-ANSI-REFERENCE.
078400     GO TO  FAIL-ROUTINE-EX.
078500 FAIL-ROUTINE-WRITE.
078600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
078700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
078800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
078900     MOVE   SPACES TO COR-ANSI-REFERENCE.
079000 FAIL-ROUTINE-EX. EXIT.
079100 BAIL-OUT.
079200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
079300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
079400 BAIL-OUT-WRITE.
079500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
079600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
079700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
079800     MOVE   SPACES TO INF-ANSI-REFERENCE.
079900 BAIL-OUT-EX. EXIT.
080000 CCVS1-EXIT.
080100     EXIT.
080200 SECT-0001-IX214A SECTION.
080300 WRITE-INT-GF-01.
080400     OPEN    OUTPUT IX-FS1.
080500     MOVE    "IX-FS1" TO XFILE-NAME           (1).
080600     MOVE    "R1-F-G" TO  XRECORD-NAME        (1).
080700     MOVE    ZERO     TO  XRECORD-NUMBER      (1).
080800     MOVE    "RC"     TO  CHARS-OR-RECORDS    (1).
080900     MOVE "IX214A"    TO  XPROGRAM-NAME       (1).
081000     MOVE    240      TO  XRECORD-LENGTH      (1).
081100     MOVE    001      TO  XBLOCK-SIZE         (1).
081200     MOVE    "IX"     TO  XFILE-ORGANIZATION  (1).
081300     MOVE    "S"      TO  XLABEL-TYPE         (1).
081400     MOVE    200      TO  RECORDS-IN-FILE     (1).
081500     MOVE    "CREATE-FILE-FS1" TO FEATURE.
081600     MOVE    "WRITE-TEST-GF-01" TO PAR-NAME.
081700     MOVE    ZERO TO KEYSUB.
081800     MOVE    ZERO TO INVKEY-COUNTER.
081900 WRITE-INIT-GF-01-01.
082000     PERFORM WRITE-TEST-GF-01-R1 50 TIMES.
082100     PERFORM WRITE-TEST-GF-01-R2 125 TIMES.
082200     PERFORM WRITE-TEST-GF-01-R1 25 TIMES.
082300     GO TO   WRITE-TEST-GF-01.
082400 WRITE-TEST-GF-01-R1.
082500     ADD     001  TO XRECORD-NUMBER (1).
082600     ADD     001  TO  KEYSUB.
082700     MOVE    RECKEY-VALUE (KEYSUB) TO FS1-RECKEY-1-13.
082800     MOVE    ALTKEY1-VALUE (KEYSUB) TO FS1-ALTKEY1-1-20.
082900     MOVE    ALTKEY2-VALUE (KEYSUB) TO FS1-ALTKEY2-1-20.
083000     MOVE    WRK-FS1-RECKEY   TO    XRECORD-KEY (1).
083100     MOVE    WRK-FS1-ALTKEY1  TO ALTERNATE-KEY1 (1).
083200     MOVE    WRK-FS1-ALTKEY2  TO ALTERNATE-KEY2 (1).
083300     MOVE    FILE-RECORD-INFO (1)  TO IX-FS1R1-F-G-240.
083400     WRITE   IX-FS1R1-F-G-240
083500                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
083600     ADD     001 TO  EXCUT-COUNTER-06V00.
083700 WRITE-TEST-GF-01-R2.
083800     ADD     002  TO FS1-RECKEY-11-13.
083900     ADD     002 TO FS1-ALTKEY1-11-13.
084000     SUBTRACT  002 FROM FS1-ALTKEY2-11-13.
084100     ADD     001  TO XRECORD-NUMBER (1).
084200     MOVE    WRK-FS1-RECKEY   TO    XRECORD-KEY (1).
084300     MOVE    WRK-FS1-ALTKEY1  TO ALTERNATE-KEY1 (1).
084400     MOVE    WRK-FS1-ALTKEY2  TO ALTERNATE-KEY2 (1).
084500     MOVE    FILE-RECORD-INFO (1) TO IX-FS1R1-F-G-240.
084600     WRITE   IX-FS1R1-F-G-240
084700                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
084800     ADD     001 TO EXCUT-COUNTER-06V00.
084900 WRITE-TEST-GF-01.
085000     SUBTRACT INVKEY-COUNTER FROM EXCUT-COUNTER-06V00
085100             GIVING RECORDS-WRITTEN.
085200     MOVE    200  TO CORRECT-18V0.
085300     MOVE    RECORDS-WRITTEN TO COMPUTED-18V0.
085400     IF      RECORDS-WRITTEN EQUAL TO 200
085500             PERFORM  PASS
085600             ELSE
085700             PERFORM FAIL.
085800     MOVE    "RECORDS IN FILE" TO RE-MARK.
085900     GO TO   WRITE-TEST-GF-01-END.
086000 WRITE-DELETE-GF-01.
086100     PERFORM DE-LETE.
086200 WRITE-TEST-GF-01-END.
086300     PERFORM  PRINT-DETAIL.
086400     CLOSE   IX-FS1.
086500
086600
086700 READ-INIT-F1-01.
086800     OPEN    INPUT  IX-FS1.
086900     MOVE    "READ-TEST-F1-01" TO PAR-NAME.
087000     MOVE    "READ FILE IX-FS1" TO FEATURE.
087100     MOVE    ZERO TO EXCUT-COUNTER-06V00.
087200     MOVE    02   TO RECKEY-NUM.
087300     MOVE    002 TO ALTKEY1-NUM.
087400 READ-TEST-F1-01-R1.
087500     READ    IX-FS1  AT END  GO TO READ-TEST-F1-01.
087600     MOVE    IX-REC-KEY-AREA TO WRK-FS1-RECKEY.
087700     MOVE    IX-ALT-KEY1-AREA TO WRK-FS1-ALTKEY1.
087800     IF      FS1-RECKEY-11-13 EQUAL TO RECKEY-NUM
087900             AND FS1-ALTKEY1-11-13 EQUAL TO ALTKEY1-NUM
088000             NEXT SENTENCE
088100             ELSE
088200             PERFORM  READ-FAIL-F1-01.
088300     IF      EXCUT-COUNTER-06V00 NOT LESS THAN 200
088400             GO TO READ-TEST-F1-01.
088500     ADD     001  TO EXCUT-COUNTER-06V00.
088600     ADD     002  TO RECKEY-NUM
088700     ADD     002  TO ALTKEY1-NUM.
088800     GO TO   READ-TEST-F1-01-R1.
088900 READ-TEST-F1-01.
089000     IF      EXCUT-COUNTER-06V00 EQUAL TO 200
089100             PERFORM PASS ELSE
089200             PERFORM FAIL.
089300     MOVE    EXCUT-COUNTER-06V00 TO  COMPUTED-18V0.
089400     MOVE    200  TO  CORRECT-18V0.
089500     MOVE    "RECORDS IN FILE" TO RE-MARK.
089600     GO TO   READ-WRITE-F1-01.
089700 READ-FAIL-F1-01.
089800     PERFORM FAIL.
089900     MOVE    FS1-RECKEY-11-13  TO COMPUTED-18V0.
090000     MOVE    RECKEY-NUM  TO CORRECT-18V0.
090100     MOVE    "NUM EMBEDDED IN RECKEY"  TO RE-MARK.
090200 READ-WRITE-F1-01.
090300     PERFORM PRINT-DETAIL.
090400     CLOSE   IX-FS1.
090500 START-INIT.
090600     OPEN    INPUT  IX-FS1.
090700     MOVE    "START NLT RECKEY " TO FEATURE.
090800     MOVE "START-TEST-GF-01" TO PAR-NAME.
090900     MOVE    SPACE TO HOLD-FILESTATUS-RECORD.
091000*
091100* THE "START -- NOT LESS THAN--" IS CHECKED FOR PROPER POSITIONING
091200* OF THE RECORD POINTER FOR THE SUBSEQUENT READ STATEMENT.
091300* START-TEST-GF- USE ONLY THE PRIME RECORD KEY FOR ESTABLISHING
091400* THE CURRENT RECORD POINTER FOR THE FILE.  THE FOLLOWING IS A
091500* SUMMARY OF THE TEST CONDITIONS AND THE EXPECTED ACTION TO BE
091600* TAKEN FOR THE  TESTS.
091700*
091800*                      CONDITIONS (CONTENTS OF KEY) / ACTION
091900*
092000*   START-TEST-GF-01 - EQUAL A RECORD IN FILE / RECORD FOUND
092100*   START-TEST-GF-02 - BETWEEN 2 KEY VALUES / RECORD FOUND
092200*   START-TEST-GF-03 - LESS THAN FIRST FILE REC. / REC. FOUND
092300*   START-TEST-GF-04 - NOT LESS THAN LAST FILE RECORD / INVALID KE
092400*   START-TEST-GF-05 - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOUN
092500*   START-TEST-GF-06 - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOUN
092600*   START-TEST-GF-07 - UNEQUAL SIZE OPERANDS (UNEQUAL) / INVLD KEY
092700*   START-TEST-GF-08 - UNEQUAL SIZE OPERANDS (UNEQUAL) / REC FOUND
092800*   START-TEST-GF-09 - UNEQUAL SIZE OPERANDS (UNEQUAL) /INVLD KEY
092900*
093000*  BEFORE EACH TEST A RECORD IS MADE AVAILABLE WHICH IS DIFFERENT
093100*  THAN THE ONE WHICH IS EXPECTED TO BE PRESENT FOLLOWING A TEST.
093200*  IF DURING THIS INITIALIZATION AN INVALID KEY OCCURS THE TEST
093300*  WILL BE DELETED AND CONTROL WILL BE PASSED TO THE NEXT TEST.
093400*  WHEN TESTING IF AN INVALID KEY IS EXPECTED, THE KEYS
093500*  ASSOCIATED WITH THE FILE WHICH ARE NOT PARTICIPATING IN THE
093600*  START STATEMENT WILL BE LOADED WITH VALUES WHICH WOULD
093700*  MATCH RECORDS IN THE FILE.  BUT IF A KEY MATCH IS EXPECTED FROM
093800*  THE TEST, THE KEYS ASSOCIATED WITH THE FILE WHICH ARE NOT
093900*  PARTICIPATING IN THE START STATEMENT WILL BE LOADED WITH
094000*  VALUES WHICH WOULD NOT MATCH RECORDS IN THE FILE.  THE FILE
094100*  STATUS FROM EXECUTION OF EACH START IS CAPTURED FOR LATER TESTS
094200*
094300 START-INIT-GF-01.
094400     PERFORM START-INITIALIZE-RECORD.
094500     IF      INIT-FLAG NOT EQUAL ZERO
094600             PERFORM START-INIT-ERROR
094700             GO TO START-DELETE-GF-01.
094800     MOVE    "CCCCCCCCCD022" TO FS1-RECKEY-1-13.
094900     MOVE    "EEEEEFFFFF022ALTKEY1"  TO FS1-ALTKEY1-1-20.
095000     MOVE    "EEEEEFFFFF022ALTKEY2" TO FS1-ALTKEY2-1-20.
095100     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
095200     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
095300     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
095400 START-TEST-GF-01.
095500*
095600*  START-TEST-GF-.01 - THE START SHOULD FIND A RECORD IN THE FILE
095700*                    WHICH HAS A RECORD KEY VALUE OF
095800*                    CCCCCCCCDD022  (RECORD NUMBER 11).
095900*
096000     START   IX-FS1
096100                    KEY IS NOT LESS THAN IX-FS1-KEY
096200       INVALID KEY     MOVE FS1-STATUS TO FILESTATUS (1)
096300                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
096400                        GO TO START-FAIL-GF-01.
096500     MOVE    FS1-STATUS TO FILESTATUS (1).
096600     READ    IX-FS1  AT END
096700                     MOVE  "AT END ON READ" TO COMPUTED-A
096800                     GO TO START-FAIL-GF-01.
096900     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
097000     IF      XRECORD-NUMBER (1)  EQUAL TO 11
097100             PERFORM PASS
097200             MOVE SPACE TO RE-MARK
097300             GO TO START-WRITE-GF-01.
097400     MOVE    11  TO RECNO.
097500     PERFORM DISPLAY-RECORD-KEYS.
097600     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
097700 START-FAIL-GF-01.
097800     PERFORM FAIL.
097900     MOVE    11  TO CORRECT-18V0.
098000     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
098100           TO RE-MARK.
098200     GO TO   START-WRITE-GF-01.
098300 START-DELETE-GF-01.
098400     PERFORM DE-LETE.
098500 START-WRITE-GF-01.
098600     PERFORM PRINT-DETAIL.
098700 START-INIT-GF-02.
098800     PERFORM START-INITIALIZE-RECORD.
098900     MOVE "START-TEST-GF-02" TO PAR-NAME.
099000     IF      INIT-FLAG NOT EQUAL ZERO
099100             PERFORM START-INIT-ERROR
099200             GO TO START-DELETE-GF-02.
099300     MOVE    "EEEEEEEFFF067" TO FS1-RECKEY-1-13.
099400     MOVE    "HHHHHHHHII064ALTKEY1"  TO FS1-ALTKEY1-1-20.
099500     MOVE    "TTTTTTTTSS336ALTKEY2" TO FS1-ALTKEY2-1-20.
099600     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
099700     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
099800     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
099900 START-TEST-GF-02.
100000*
100100*  START-TEST-GF-.02 - THE START SHOULD FIND A RECORD IN THE FILE
100200*                    WHICH HAS A RECORD KEY VALUE OF EEEEEEFFFF068
100300*                    (RECORD NUMBER 34).  THIS KEY VALUE IS
100400*                    SEQUENTIALLY A LOGICAL RECORD HIGHER THAN
100500*                    THE RECORD CONTAINING THE KEY VALUE  LOADED
100600*                    INTO THE RECORD KEY BEFORE THE START WAS
100700*                    EXECUTED.  THE KEY VALUE INITIALLY LOADED
100800*                    WAS A VALUE BETWEEN TWO EXISTING KEY VALUES.
100900*
101000     START   IX-FS1
101100                    KEY NOT LESS THAN IX-FS1-KEY
101200        INVALID KEY    MOVE FS1-STATUS TO FILESTATUS (2)
101300                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
101400                        GO TO START-FAIL-GF-02.
101500     MOVE    FS1-STATUS TO FILESTATUS (2).
101600     READ    IX-FS1  AT END
101700                     MOVE  "AT END ON READ" TO COMPUTED-A
101800                     GO TO START-FAIL-GF-02.
101900     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
102000     IF      XRECORD-NUMBER (1) EQUAL TO 34
102100             PERFORM PASS
102200             MOVE SPACE TO RE-MARK
102300             GO TO START-WRITE-GF-02.
102400     MOVE    34  TO RECNO.
102500     PERFORM DISPLAY-RECORD-KEYS.
102600     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
102700 START-FAIL-GF-02.
102800     PERFORM FAIL.
102900     MOVE    34   TO CORRECT-18V0.
103000     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
103100           TO RE-MARK.
103200     GO TO   START-WRITE-GF-02.
103300 START-DELETE-GF-02.
103400     PERFORM DE-LETE.
103500 START-WRITE-GF-02.
103600     PERFORM PRINT-DETAIL.
103700 START-INIT-GF-03.
103800     PERFORM START-INITIALIZE-RECORD.
103900     MOVE "START-TEST-GF-03" TO PAR-NAME.
104000     IF      INIT-FLAG NOT EQUAL ZERO
104100             PERFORM START-INIT-ERROR
104200             GO TO START-DELETE-GF-03.
104300     MOVE    "BBBBBBBBBC001" TO FS1-RECKEY-1-13.
104400     MOVE    "EEEEEEEEEF003ALTKEY1"  TO FS1-ALTKEY1-1-20.
104500     MOVE    "WWWWWWWWWV399ALTKEY2" TO FS1-ALTKEY2-1-20.
104600     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
104700     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
104800     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
104900 START-TEST-GF-03.
105000*
105100*  START-TEST-GF-.03 - THE START STATEMENT SHOULD FIND A
105200*                    RECORD IN THE FILE WHICH HAS A RECORD KEY
105300*                    VALUE OF "BBBBBBBBBC002" (RECORD NUMBER 1).
105400*                    THE KEY WAS LOADED BEFORE THE START IS
105500*                    EXECUTED WITH THE VALUE THAT IS SEQUENTIALLY
105600*                    LOWER THAN ANY CURRENTLY EXISTING KEY IN
105700*                    THE FILE.
105800*
105900     START   IX-FS1
106000                    KEY IS NOT LESS THAN IX-FS1-KEY
106100       INVALID KEY      MOVE FS1-STATUS TO FILESTATUS (3)
106200                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
106300                        GO TO START-FAIL-GF-03.
106400     MOVE    FS1-STATUS TO FILESTATUS (3).
106500     READ    IX-FS1  AT END
106600                     MOVE  "AT END ON READ" TO COMPUTED-A
106700                     GO TO START-FAIL-GF-03.
106800     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
106900     IF      XRECORD-NUMBER (1) EQUAL TO 01
107000             PERFORM PASS
107100             MOVE SPACE TO RE-MARK
107200             GO TO START-WRITE-GF-03.
107300     MOVE    01  TO RECNO.
107400     PERFORM DISPLAY-RECORD-KEYS.
107500     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
107600 START-FAIL-GF-03.
107700     PERFORM FAIL.
107800     MOVE    01   TO CORRECT-18V0.
107900     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
108000           TO RE-MARK.
108100     GO TO   START-WRITE-GF-03.
108200 START-DELETE-GF-03.
108300     PERFORM DE-LETE.
108400 START-WRITE-GF-03.
108500     PERFORM PRINT-DETAIL.
108600 START-INIT-GF-04.
108700     PERFORM START-INITIALIZE-RECORD.
108800     MOVE "START-TEST-GF-04" TO PAR-NAME.
108900     IF      INIT-FLAG NOT EQUAL ZERO
109000             PERFORM START-INIT-ERROR
109100             GO TO START-DELETE-GF-04.
109200     MOVE    "UUUUUUUUUU401"  TO FS1-RECKEY-1-13.
109300     MOVE    "YYYYYYYYYY400ALTKEY1"  TO FS1-ALTKEY1-1-20.
109400     MOVE    "DDDDDDDDDD000ALTKEY2"  TO FS1-ALTKEY2-1-20.
109500     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
109600     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
109700     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
109800 START-TEST-GF-04.
109900*
110000*  START-TEST-GF-.04 - THE START STATEMENT SHOULD NOT FIND A
110100*                    RECORD IN THE  FILE WHICH HAS A RECORD
110200*                    KEY VALUE NOT LESS THAN "UUUUUUUUUU401". THIS
110300*                    VALUE IS SEQUENTIALLY NOT LESS THAN
110400*                    ANY RECORD KEY CURRENTLY EXISTING IN
110500*                    THE FILE.  AN INVALID KEY CONDITION
110600*                    IS EXPECTED WHEN THE START IS EXECUTED.
110700*
110800     START   IX-FS1
110900                    KEY IS NOT LESS THAN IX-FS1-KEY
111000          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (4)
111100                         GO TO START-PASS-GF-04.
111200     MOVE    FS1-STATUS TO FILESTATUS (4).
111300     READ    IX-FS1 AT END
111400                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
111500     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
111600     PERFORM FAIL.
111700     MOVE    XRECORD-KEY (1) TO COMPUTED-A.
111800     MOVE    "INVALID KEY" TO CORRECT-A.
111900     MOVE "IX-36 INVALID KEY PATH NOT BE TAKEN OR AT END ON READ"
112000           TO RE-MARK.
112100     GO TO   START-WRITE-GF-04.
112200 START-PASS-GF-04.
112300     PERFORM  PASS.
112400     MOVE     "INVALID KEY"  TO RE-MARK.
112500     GO TO   START-WRITE-GF-04.
112600 START-DELETE-GF-04.
112700     PERFORM DE-LETE.
112800 START-WRITE-GF-04.
112900     PERFORM PRINT-DETAIL.
113000 START-INIT-GF-05.
113100     PERFORM START-INITIALIZE-RECORD.
113200     MOVE "START-TEST-GF-05" TO PAR-NAME.
113300     IF      INIT-FLAG NOT EQUAL ZERO
113400             PERFORM START-INIT-ERROR
113500             GO TO START-DELETE-GF-05.
113600     MOVE    "CDDDDDDDDD039" TO FS1-RECKEY-1-13.
113700     MOVE    "IIIIIIIIJJ083ALTKEY1"  TO FS1-ALTKEY1-1-20.
113800     MOVE    "ABCXXXXXXX400ALTKEY2" TO FS1-ALTKEY2-1-20.
113900     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
114000     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
114100     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
114200 START-TEST-GF-05.
114300*  START-TEST-GF-.05 - THE START STATEMENT USES AN OPERAND
114400*                    IN THE KEY PHRASE WHICH IS NOT THE NAME
114500*                    OF A RECORD   KEY BUT IS THE NAME OF A
114600*                    DATA ITEM WHICH IS SUBORDINATE TO THE
114700*                    RECORD KEY.  THE CONTENTS OF THE DATA ITEM
114800*                    (POSITIONS 1 THRU 7 OF THE RECORD KEY)
114900*                    IS A UNIQUE KEY VALUE FOR THE FILE. THE
115000*                    BALANCE OF THE KEY (POSITIONS 8 THRU 13) IS
115100*                    NOT A VALID KEY VALUE FOR THE FILE.  THE
115200*                    RECORD WITH THE RECORD KEY "CDDDDDDDDD038"
115300*                    (RECORD NUMBER 19) IS EXPECTED TO BE FOUND.
115400*
115500     START   IX-FS1
115600                    KEY IS NOT LESS THAN R-RECKEY-1-7
115700          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (5)
115800                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
115900                     GO TO START-FAIL-GF-05.
116000     MOVE    FS1-STATUS TO FILESTATUS (5).
116100     READ    IX-FS1  AT END
116200                     MOVE  "AT END ON READ" TO COMPUTED-A
116300                     GO TO  START-FAIL-GF-05.
116400     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
116500     IF      XRECORD-NUMBER (1) EQUAL TO 19
116600             PERFORM  PASS
116700             MOVE  "SUBORDINATE DATA ITEM OF KEY" TO RE-MARK
116800             GO TO START-WRITE-GF-05.
116900     MOVE    19  TO RECNO.
117000     PERFORM DISPLAY-RECORD-KEYS.
117100     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
117200 START-FAIL-GF-05.
117300     PERFORM  FAIL.
117400     MOVE    19  TO CORRECT-18V0.
117500     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
117600           TO RE-MARK.
117700     GO TO   START-WRITE-GF-05.
117800 START-DELETE-GF-05.
117900     PERFORM DE-LETE.
118000 START-WRITE-GF-05.
118100     PERFORM PRINT-DETAIL.
118200 START-INIT-GF-06.
118300     PERFORM START-INITIALIZE-RECORD.
118400     MOVE "START-TEST-GF-06" TO PAR-NAME.
118500     IF      INIT-FLAG NOT EQUAL ZERO
118600             PERFORM START-INIT-ERROR
118700             GO TO START-DELETE-GF-06.
118800     MOVE    "TTTTTUUUUU390"  TO FS1-RECKEY-1-13.
118900     MOVE    "XYYYYYYYYY399ALTKEY1"  TO FS1-ALTKEY1-1-20.
119000     MOVE    "WWWWWWWWWV399ALTKEY2"  TO FS1-ALTKEY2-1-20.
119100     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
119200     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
119300     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
119400 START-TEST-GF-06.
119500*
119600*  START-TEST-GF-.06 - THE START STATEMENT USES AN OPERAND IN THE
119700*                    KEY PHRASE WHICH IS NOT THE NAME OF A RECORD
119800*                    KEY BUT IS THE NAME OF A DATA ITEM THAT IS
119900*                    SUBORDINATE TO THE RECORD KEY.  THE CONTENTS
120000*                    OF THE DATA ITEM (POSITIONS 1 THRU 5 OF THE
120100*                    RECORD KEY)  IS A DUPLICATE OF THE FIRST
120200*                    5 POSITIONS OF 6 OTHER RECORDS IN THE FILE.
120300*                    THIS TEST EXPECTS THE RECORD POINTER
120400*                    TO BE POSITIONED TO RECORD KEY TTTTTTTTTT380
120500*                    (RECORD NUMBER 190) WHICH WAS THE FIRST
120600*                    RECORD WRITTEN TO THE FILE
120700*                    THAT CONTAINS TTTTT IN THE FIRST 5 POSITIONS
120800*                    OF THE KEY.  THE RECORD KEY WAS LOADED WITH
120900*                    THE VALUE "TTTTTUUUUU390" (KEY FOR RECORD
121000*                    NUMBER 195) BEFORE THE START WAS EXECUTED.
121100*
121200     START   IX-FS1
121300                    KEY IS NOT LESS THAN IX-FS1-KEY-1-5
121400                INVALID KEY  MOVE  FS1-STATUS TO FILESTATUS (6)
121500                     MOVE  "INVALID KEY ON START"  TO COMPUTED-A
121600                     GO TO START-FAIL-GF-06.
121700     MOVE    FS1-STATUS TO FILESTATUS (6).
121800     READ    IX-FS1  AT END
121900                     MOVE "AT END ON READ" TO COMPUTED-A
122000                     GO TO START-FAIL-GF-06.
122100     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
122200     IF      XRECORD-NUMBER (1) EQUAL TO 190
122300             PERFORM  PASS
122400             MOVE  "SUBORDINATE DATA ITEM IN KEY"  TO RE-MARK
122500             GO TO START-WRITE-GF-06.
122600     MOVE    65  TO RECNO.
122700     PERFORM DISPLAY-RECORD-KEYS.
122800     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
122900 START-FAIL-GF-06.
123000     PERFORM  FAIL.
123100     MOVE    190  TO CORRECT-18V0.
123200     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
123300           TO RE-MARK.
123400     GO TO   START-WRITE-GF-06.
123500 START-DELETE-GF-06.
123600     PERFORM DE-LETE.
123700 START-WRITE-GF-06.
123800     PERFORM PRINT-DETAIL.
123900 START-INIT-GF-07.
124000     PERFORM START-INITIALIZE-RECORD.
124100     MOVE "START-TEST-GF-07" TO PAR-NAME.
124200     IF      INIT-FLAG NOT EQUAL ZERO
124300             PERFORM START-INIT-ERROR
124400             GO TO START-DELETE-GF-07.
124500     MOVE    "UUUUUUVUUU410"  TO FS1-RECKEY-1-13.
124600     MOVE    "FFFFFFFFFG022ALTKEY1"  TO FS1-ALTKEY1-1-20.
124700     MOVE    "VVVVVVVVVV380ALTKEY2"  TO FS1-ALTKEY2-1-20.
124800     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
124900     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
125000     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
125100 START-TEST-GF-07.
125200*
125300*  START-TEST-GF-.07 - THE START STATEMENT USES AN OPERAND IN THE
125400*                    KEY PHRASE OF THE START STATEMENT WHICH IS
125500*                    A DATA ITEM SUBORDINATE TO THE RECORD KEY
125600*                    NAME.  THE CONTENTS OF THE DATA ITEM
125700*                    (POSITIONS 1 THRU 7 OF THE RECORD KEY)
125800*                    IS LOADED WITH "UUUUUUV" WHICH IS HIGHER THAN
125900*                    THE KEY VALUE OF THE LAST RECORD IN THE FILE.
126000*                    THERE SHOULD BE NO RECORD IN THE FILE NOT
126100*                    LESS THAN THIS KEY VALUE THUS AND INVALID KEY
126200*                    IS EXPECTED WHEN THE START IS EXECUTED.
126300*
126400     START  IX-FS1
126500                   KEY IS NOT LESS THAN R-RECKEY-1-7
126600          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (7)
126700                     GO TO START-PASS-GF-07.
126800     MOVE    FS1-STATUS TO FILESTATUS (7).
126900     READ    IX-FS1  AT END
127000                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
127100     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
127200     PERFORM FAIL.
127300     MOVE    XRECORD-KEY (1) TO COMPUTED-A.
127400     MOVE    "INVALID KEY" TO CORRECT-A.
127500     MOVE "IX-36 INVALID KEY PATH NOT BE TAKEN OR AT END ON READ"
127600           TO RE-MARK.
127700     GO TO   START-WRITE-GF-07.
127800 START-PASS-GF-07.
127900     PERFORM PASS.
128000     MOVE    "INVALID KEY"  TO RE-MARK.
128100     GO TO   START-WRITE-GF-07.
128200 START-DELETE-GF-07.
128300     PERFORM DE-LETE.
128400 START-WRITE-GF-07.
128500     PERFORM PRINT-DETAIL.
128600 START-INIT-GF-08.
128700     PERFORM START-INITIALIZE-RECORD.
128800     MOVE "START-TEST-GF-08" TO PAR-NAME.
128900     IF      INIT-FLAG NOT EQUAL ZERO
129000             PERFORM START-INIT-ERROR
129100             GO TO START-DELETE-GF-08.
129200     MOVE    "ABBBBBBBBC002"  TO FS1-RECKEY-1-13.
129300     MOVE    "XYYYYYYYYY399ALTKEY1"  TO FS1-ALTKEY1-1-20.
129400     MOVE    "WWWWWWWWWV399ALTKEY2"  TO FS1-ALTKEY2-1-20.
129500     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
129600     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
129700     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
129800 START-TEST-GF-08.
129900*
130000*  START-TEST-GF-.08 - THIS TEST USES AN OPERAND IN THE KEY
130100*                    PHRASE OF THE START STATEMENT WHICH IS A DATA
130200*                    ITEM SUBORDINATE TO THE RECORD KEY NAME.  THE
130300*                    CONTENTS OF THE DATA ITEM (POSITIONS 1 THRU
130400*                    7 OF THE RECORD KEY) IS LOADED WITH "ABBBBBB"
130500*                    THIS KEY VALUE IS LOWER THAN ANY RECORD
130600*                    KEY VALUE IN POSITIONS 1 THRU 7 EXISTING
130700*                    IN THE FILE.  THE START STATEMENT WITH THE
130800*                    KEY IS NOT LESS THAN PHRASE IS EXECUTED AND
130900*                    SHOULD FIND THE RECORD WITH THE KEY VALUE
131000*                    "BBBBBBBBBC002" (RECORD NUMBER 01).
131100*
131200     START   IX-FS1
131300                    KEY IS NOT LESS THAN R-RECKEY-1-7
131400          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (8)
131500                     MOVE  "INVALID KEY ON START"  TO COMPUTED-A
131600                     GO TO START-FAIL-GF-08.
131700     MOVE    FS1-STATUS TO FILESTATUS (8).
131800     READ    IX-FS1  AT END
131900                     MOVE "AT END ON READ" TO COMPUTED-A
132000                     GO TO START-FAIL-GF-08.
132100     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
132200     IF      XRECORD-NUMBER (1) EQUAL TO 001
132300             PERFORM  PASS
132400             MOVE  "SUBORDINATE DATA ITEM IN KEY"  TO RE-MARK
132500             GO TO START-WRITE-GF-08.
132600     MOVE    01  TO RECNO.
132700     PERFORM DISPLAY-RECORD-KEYS.
132800     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
132900 START-FAIL-GF-08.
133000     PERFORM  FAIL.
133100     MOVE    001   TO CORRECT-18V0.
133200     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
133300           TO RE-MARK.
133400     GO TO   START-WRITE-GF-08.
133500 START-DELETE-GF-08.
133600     PERFORM DE-LETE.
133700 START-WRITE-GF-08.
133800     PERFORM PRINT-DETAIL.
133900 START-INIT-GF-09.
134000     PERFORM START-INITIALIZE-RECORD.
134100     MOVE "START-TEST-GF-09" TO PAR-NAME.
134200     IF      INIT-FLAG NOT EQUAL ZERO
134300             PERFORM START-INIT-ERROR
134400             GO TO START-DELETE-GF-09.
134500     MOVE    "UUUUUUVVVV400"  TO FS1-RECKEY-1-13.
134600     MOVE    "EEEEEEEEEF002ALTKEY1"  TO FS1-ALTKEY1-1-20.
134700     MOVE    "WWWWWWWWWV398ALTKEY2"  TO FS1-ALTKEY2-1-20.
134800     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
134900     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
135000     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
135100 START-TEST-GF-09.
135200*
135300*  START-TEST-GF-.09 - THIS TEST USES AN OPERAND IN THE
135400*                    KEY PHRASE OF THE START STATEMENT WHICH IS
135500*                    A DATA ITEM SUBORDINATE TO THE RECORD KEY
135600*                    NAME.  THE CONTENTS OF THE DATA ITEM
135700*                    (POSITIONS 1 THRU 7  OF THE RECORD KEY) IS
135800*                    LOADED WITH "UUUUUUV".  THIS KEY VALUE
135900*                    IS NOT LESS THAN ANY RECORD KEY VALUE IN
136000*                    POSITION 1 THRU 7 EXISTING IN THE FILE
136100*                    THEREFORE AN INVALID KEY CONDITION IS
136200*                    EXPECTED WHEN THE START STATEMENT IS
136300*                    EXECUTED.
136400*
136500     START   IX-FS1
136600                    KEY IS NOT LESS THAN R-RECKEY-1-7
136700          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (9)
136800                     GO TO START-PASS-GF-09.
136900     MOVE    FS1-STATUS TO FILESTATUS (9).
137000     READ    IX-FS1  AT END
137100                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
137200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
137300     PERFORM FAIL.
137400     MOVE    XRECORD-KEY (1)  TO COMPUTED-A.
137500     MOVE     "INVALID KEY" TO CORRECT-A.
137600     MOVE "IX-36 INVALID KEY PATH NOT BE TAKEN OR AT END ON READ"
137700           TO RE-MARK.
137800     GO TO   START-WRITE-GF-09.
137900 START-PASS-GF-09.
138000     PERFORM PASS.
138100     MOVE    "INVALID KEY"  TO RE-MARK.
138200     GO TO   START-WRITE-GF-09.
138300 START-DELETE-GF-09.
138400     PERFORM DE-LETE.
138500 START-WRITE-GF-09.
138600     PERFORM PRINT-DETAIL.
138700     CLOSE   IX-FS1.
138800
138900*
139000*  THIS SERIES OF TESTS CHECKS THE CONTENTS OF THE FILE STATUS
139100*  CAPTURED FROM THE TESTS IN START-TEST-GF-.
139200*
139300 START-TEST-GF-10.
139400     MOVE              "FILE STATUS START:00"  TO FEATURE.
139500     MOVE "START-TEST-GF-10" TO PAR-NAME.
139600     IF      FILESTATUS (1)  EQUAL TO "**"
139700             PERFORM DE-LETE
139800             MOVE "FROM START-TEST-GF-01"  TO CORRECT-A
139900             GO TO  START-TEST-GF-10A.
140000*
140100*  START-TEST-004.01 - THIS TEST CHECKS THE FILE STATUS CONTENTS
140200*                    RESULTING FROM START-TEST-GF-01.  THE FILE
140300*                    STATUS CONTENTS IS EXPECTED TO BE "00".
140400*
140500     IF      FILESTATUS (1)  EQUAL TO "00"
140600             PERFORM PASS
140700     ELSE
140800         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-01" TO RE-MARK
140900             PERFORM  FAIL
141000             MOVE  "00"  TO CORRECT-A
141100             MOVE   FILESTATUS (1)  TO COMPUTED-A.
141200 START-TEST-GF-10A.
141300     PERFORM  PRINT-DETAIL.
141400 START-TEST-GF-11.
141500     MOVE              "FILE STATUS START:00"  TO FEATURE.
141600     MOVE "START-TEST-GF-11" TO PAR-NAME.
141700     IF      FILESTATUS (2)  EQUAL TO "**"
141800             PERFORM DE-LETE
141900             MOVE "FROM START-TEST-GF-02"  TO CORRECT-A
142000             GO TO  START-TEST-GF-11A.
142100*
142200*  START-TEST-004.02 - THIS TEST CHECKS THE FILE STATUS CONTENTS
142300*                    RESULTING FROM START-TEST-GF-02.  THE FILE
142400*                    STATUS CONTENTS IS EXPECTED TO BE "00"
142500*
142600     IF      FILESTATUS (2) EQUAL TO "00"
142700             PERFORM  PASS
142800             ELSE  PERFORM  FAIL
142900         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-02" TO RE-MARK
143000             MOVE    "00"  TO CORRECT-A
143100             MOVE   FILESTATUS (2)  TO COMPUTED-A.
143200 START-TEST-GF-11A.
143300     PERFORM  PRINT-DETAIL.
143400 START-TEST-GF-12.
143500     MOVE "START-TEST-GF-12" TO PAR-NAME.
143600     IF      FILESTATUS (3)  EQUAL TO "**"
143700             PERFORM DE-LETE
143800             MOVE "FROM START-TEST-GF-03"  TO CORRECT-A
143900             GO TO  START-TEST-GF-12A.
144000*
144100*  START-TEST-004.03 - THIS TEST CHECKS THE FILE STATUS CONTENTS
144200*                    RESULTING FROM START-TEST-GF-03.  THE FILE
144300*                    STATUS CONTENTS IS EXPECTED TO BE "00"
144400*
144500     IF      FILESTATUS (3) EQUAL TO "00"
144600             PERFORM  PASS
144700             ELSE  PERFORM  FAIL
144800         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-03" TO RE-MARK
144900             MOVE    "00"  TO CORRECT-A
145000             MOVE   FILESTATUS (3)  TO COMPUTED-A.
145100 START-TEST-GF-12A.
145200     PERFORM  PRINT-DETAIL.
145300 START-TEST-GF-13.
145400     MOVE              "FILE STATUS START:23"  TO FEATURE.
145500     MOVE "START-TEST-GF-13" TO PAR-NAME.
145600     IF      FILESTATUS (4)  EQUAL TO "**"
145700             PERFORM DE-LETE
145800             MOVE "FROM START-TEST-GF-04"  TO CORRECT-A
145900             GO TO  START-TEST-GF-13A.
146000*
146100*  START-TEST-004.04 - THIS TEST CHECKS THE FILE STATUS CONTENTS
146200*                    RESULTING FROM START-TEST-GF-04.  THE FILE
146300*                    STATUS CONTENTS IS EXPECTED TO BE "23".
146400*
146500     IF      FILESTATUS (4)  EQUAL TO "23"
146600             PERFORM  PASS
146700             ELSE  PERFORM  FAIL
146800         MOVE "FROM START-TEST-GF-04; IX-4 1.3.4 (3) C" TO RE-MARK
146900             MOVE    "23"  TO CORRECT-A
147000             MOVE   FILESTATUS (4)  TO COMPUTED-A.
147100 START-TEST-GF-13A.
147200     PERFORM  PRINT-DETAIL.
147300 START-TEST-GF-14.
147400     MOVE              "FILE STATUS START:00"  TO FEATURE.
147500     MOVE "START-TEST-GF-14" TO PAR-NAME.
147600     IF      FILESTATUS (5)  EQUAL TO "**"
147700             PERFORM DE-LETE
147800             MOVE "FROM START-TEST-GF-05"  TO CORRECT-A
147900             GO TO  START-TEST-GF-14A.
148000*
148100*  START-TEST-004.05 - THIS TEST CHECKS THE FILE STATUS CONTENTS
148200*                    RESULTING FROM START-TEST-GF-05.  THE FILE
148300*                    STATUS CONTENTS IS EXPECTED TO BE "00"
148400*
148500     IF      FILESTATUS (5)  EQUAL TO "00"
148600             PERFORM  PASS
148700             ELSE  PERFORM  FAIL
148800         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-05" TO RE-MARK
148900             MOVE    "00"  TO CORRECT-A
149000             MOVE   FILESTATUS (5)  TO COMPUTED-A.
149100 START-TEST-GF-14A.
149200     PERFORM  PRINT-DETAIL.
149300 START-TEST-GF-15.
149400     MOVE "START-TEST-GF-15" TO PAR-NAME.
149500     IF      FILESTATUS (6)  EQUAL TO "**"
149600             PERFORM DE-LETE
149700             MOVE "FROM START-TEST-GF-06"  TO CORRECT-A
149800             GO TO  START-TEST-GF-15A.
149900*
150000*  START-TEST-004.06 - THIS TEST CHECKS THE FILE STATUS CONTENTS
150100*                    RESULTING FROM START-TEST-GF-06.  THE FILE
150200*                    STATUS CONTENTS IS EXPECTED TO BE "00"
150300*
150400     IF      FILESTATUS (6)  EQUAL TO "00"
150500             PERFORM  PASS
150600             ELSE  PERFORM  FAIL
150700         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-06" TO RE-MARK
150800             MOVE   "00"  TO CORRECT-A
150900             MOVE   FILESTATUS (6)  TO COMPUTED-A.
151000 START-TEST-GF-15A.
151100     PERFORM  PRINT-DETAIL.
151200 START-TEST-GF-16.
151300     MOVE              "FILE STATUS START:23"  TO FEATURE.
151400     MOVE "START-TEST-GF-16" TO PAR-NAME.
151500     IF      FILESTATUS (7)  EQUAL TO "**"
151600             PERFORM DE-LETE
151700             MOVE "FROM START-TEST-GF-07"  TO CORRECT-A
151800             GO TO  START-TEST-GF-16A.
151900*
152000*  START-TEST-004.07 - THIS TEST CHECKS THE FILE STATUS CONTENTS
152100*                    RESULTING FROM START-TEST-GF-07.  THE FILE
152200*                    STATUS CONTENTS IS EXPECTED TO BE "23"
152300*
152400     IF      FILESTATUS (7)  EQUAL TO "23"
152500             PERFORM  PASS
152600             ELSE  PERFORM  FAIL
152700         MOVE "FROM START-TEST-GF-07; IX-4 1.3.4 (3) C" TO RE-MARK
152800             MOVE    "23"  TO CORRECT-A
152900             MOVE   FILESTATUS (7)  TO COMPUTED-A.
153000 START-TEST-GF-16A.
153100     PERFORM  PRINT-DETAIL.
153200 START-TEST-GF-17.
153300     MOVE              "FILE STATUS START:00"  TO FEATURE.
153400     MOVE "START-TEST-GF-17" TO PAR-NAME.
153500     IF      FILESTATUS (8)  EQUAL TO "**"
153600             PERFORM DE-LETE
153700             MOVE "FROM START-TEST-GF-08"  TO CORRECT-A
153800             GO TO  START-TEST-GF-17A.
153900*
154000*  START-TEST-004.08 - THIS TEST CHECKS THE FILE STATUS CONTENTS
154100*                    RESULTING FROM START-TEST-GF-08.  THE FILE
154200*                    STATUS CONTENTS IS EXPECTED TO BE "00"
154300*
154400     IF      FILESTATUS (8) EQUAL TO "00"
154500             PERFORM  PASS
154600             ELSE  PERFORM  FAIL
154700         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-08" TO RE-MARK
154800             MOVE    "00"  TO CORRECT-A
154900             MOVE   FILESTATUS (8)  TO COMPUTED-A.
155000 START-TEST-GF-17A.
155100     PERFORM  PRINT-DETAIL.
155200 START-TEST-GF-18.
155300     MOVE              "FILE STATUS START:23"  TO FEATURE.
155400     MOVE "START-TEST-GF-18" TO PAR-NAME.
155500     IF      FILESTATUS (9)  EQUAL TO "**"
155600             PERFORM DE-LETE
155700             MOVE "FROM START-TEST-GF-09"  TO CORRECT-A
155800             GO TO  START-TEST-GF-18A.
155900*
156000*  START-TEST-004.09 - THIS TEST CHECKS THE FILE STATUS CONTENTS
156100*                    RESULTING FROM START-TEST-GF-09.  THE FILE
156200*                    STATUS CONTENTS IS EXPECTED TO BE "23".
156300*
156400     IF      FILESTATUS (9)  EQUAL TO "23"
156500             PERFORM PASS
156600     ELSE    PERFORM FAIL
156700         MOVE "FROM START-TEST-GF-09; IX-4 1.3.4 (3) C" TO RE-MARK
156800             MOVE  "23"  TO CORRECT-A
156900             MOVE   FILESTATUS (9)  TO COMPUTED-A.
157000 START-TEST-GF-18A.
157100     PERFORM  PRINT-DETAIL.
157200
157300
157400*START-INIT-005.
157500     OPEN    INPUT  IX-FS1.
157600     MOVE    "STR NLT ALTKY W/O DUP" TO FEATURE.
157700     MOVE    SPACE TO HOLD-FILESTATUS-RECORD.
157800*
157900* THE "START -  NOT LESS THAN--" IS CHECKED FOR PROPER POSITIONING
158000* OF THE RECORD POINTER FOR THE SUBSEQUENT READ STATEMENT.
158100* START-TEST-GF  USES ONLY THE ALTERNATE RECORD KEY WITHOUT THE
158200* THE DUPLICATES OPTION FOR ESTABLISHING THE CURRENT RECORD
158300* POINTER FOR THE FILE.  THE FOLLOWING IS A SUMMARY OF THE TEST
158400* CONDITIONS AND THE EXPECTED ACTION TO BE TAKEN FOR THE TESTS.
158500*
158600*                      CONDITIONS (CONTENTS OF KEY) / ACTION
158700*
158800*   START-TEST-GF-19  - EQUAL A RECORD IN FILE / RECORD FOUND
158900*   START-TEST-GF-20  - BETWEEN 2 KEY VALUES / RECORD FOUND
159000*   START-TEST-GF-21  - LESS THAN FIRST FILE REC. / REC. FOUND
159100*   START-TEST-GF-22  - NOT LESS THAN LAST FILE RECORD / INVALID K
159200*   START-TEST-GF-23  - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOU
159300*   START-TEST-GF-24  - UNEQUAL SIZE OPERANDS (EQUAL) / RECORD FOU
159400*   START-TEST-GF-25  - UNEQUAL SIZE OPERANDS (UNEQUAL) / INVLD KE
159500*   START-TEST-GF-26  - UNEQUAL SIZE OPERANDS (UNEQUAL) / REC FOUN
159600*   START-TEST-GF-27  - UNEQUAL SIZE OPERANDS (UNEQUAL) /INVLD KEY
159700*
159800*  BEFORE EACH TEST A RECORD IS MADE AVAILABLE WHICH IS DIFFERENT
159900*  THAN THE ONE WHICH IS EXPECTED TO BE PRESENT FOLLOWING A TEST.
160000*  IF DURING THIS INITIALIZATION AN INVALID KEY OCCURS THE TEST
160100*  WILL BE DELETED AND CONTROL WILL BE PASSED TO THE NEXT TEST.
160200*  WHEN TESTING IF AN INVALID KEY IS EXPECTED, THE KEYS
160300*  ASSOCIATED WITH THE FILE WHICH ARE NOT PARTICIPATING IN THE
160400*  START STATEMENT WILL BE LOADED WITH VALUES WHICH WOULD
160500*  MATCH RECORDS IN THE FILE.  BUT IF A KEY MATCH IS EXPECTED FROM
160600*  THE TEST, THE KEYS ASSOCIATED WITH THE FILE WHICH ARE NOT
160700*  PARTICIPATING IN THE START STATEMENT WILL BE LOADED WITH
160800*  VALUES WHICH WOULD NOT MATCH RECORDS IN THE FILE.  THE FILE
160900*  STATUS FROM EXECUTION OF EACH START IS CAPTURED FOR LATER TESTS
161000*
161100 START-INIT-GF-19.
161200     PERFORM START-INITIALIZE-RECORD.
161300     MOVE "START-TEST-GF-19"  TO PAR-NAME.
161400     IF      INIT-FLAG NOT EQUAL ZERO
161500             PERFORM START-INIT-ERROR
161600             GO TO START-DELETE-GF-19.
161700     MOVE    "CCCCCDDDDD022"  TO FS1-RECKEY-1-13.
161800     MOVE    "XXXXXXXXYY384ALTKEY1"  TO FS1-ALTKEY1-1-20.
161900     MOVE    "EEEEEFFFFF022ALTKEY2" TO FS1-ALTKEY2-1-20.
162000     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
162100     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
162200     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
162300 START-TEST-GF-19.
162400*
162500*  START-TEST-GF.01  - THE START SHOULD FIND A RECORD IN THE FILE
162600*                    WHICH HAS AN ALTERNATE KEY VALUE OF
162700*                    XXXXXXXXYY384ALTKEY1 (RECORD NUMBER 192).
162800*
162900     START   IX-FS1
163000                    KEY IS NOT LESS THAN IX-FS1-ALTKEY1
163100                INVALID KEY  MOVE FS1-STATUS TO FILESTATUS (1)
163200                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
163300                        GO TO START-FAIL-GF-19.
163400     MOVE    FS1-STATUS TO FILESTATUS (1).
163500     READ    IX-FS1  AT END
163600                     MOVE  "AT END ON READ" TO COMPUTED-A
163700                     GO TO START-FAIL-GF-19.
163800     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
163900     IF      XRECORD-NUMBER (1)  EQUAL TO 192
164000             PERFORM PASS
164100             MOVE SPACE TO RE-MARK
164200             GO TO START-WRITE-GF-19.
164300     MOVE    67  TO RECNO.
164400     PERFORM DISPLAY-ALTERNATE-KEY1.
164500     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
164600 START-FAIL-GF-19.
164700     PERFORM FAIL.
164800     MOVE    192  TO CORRECT-18V0.
164900     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
165000           TO RE-MARK.
165100     GO TO   START-WRITE-GF-19.
165200 START-DELETE-GF-19.
165300     PERFORM DE-LETE.
165400 START-WRITE-GF-19.
165500     PERFORM PRINT-DETAIL.
165600 START-INIT-GF-20.
165700     PERFORM START-INITIALIZE-RECORD.
165800     MOVE "START-TEST-GF-20"  TO PAR-NAME.
165900     IF      INIT-FLAG NOT EQUAL ZERO
166000             PERFORM START-INIT-ERROR
166100             GO TO START-DELETE-GF-20.
166200     MOVE    "CCCCCDDDDD022"  TO FS1-RECKEY-1-13.
166300     MOVE    "HHHHHHHIII67ALTKEY1"  TO FS1-ALTKEY1-1-20.
166400     MOVE    "EEEEEFFFFF022ALTKEY2" TO FS1-ALTKEY2-1-20.
166500     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
166600     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
166700     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
166800 START-TEST-GF-20.
166900*
167000*  START-TEST-GF.02  - THE START SHOULD FIND A RECORD IN THE FILE
167100*                    WHICH HAS AN ALTERNATE KEY VALUE OF
167200*                    HHHHHHIIII068ALTKEY1 (RECORD NUMBER 34).
167300*                    THE DATA ITEM WAS LOADED WITH A KEY VALUE
167400*                    SEQUENTIALLY LOCATED BETWEEN TWO CURRENTLY
167500*                    EXISTING ALTERNATE KEYS IN THE FILE.
167600*
167700     START   IX-FS1
167800                    KEY IS NOT LESS THAN IX-FS1-ALTKEY1
167900                INVALID KEY  MOVE FS1-STATUS TO FILESTATUS (2)
168000                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
168100                        GO TO START-FAIL-GF-20.
168200     MOVE    FS1-STATUS TO FILESTATUS (2).
168300     READ    IX-FS1  AT END
168400                     MOVE  "AT END ON READ" TO COMPUTED-A
168500                     GO TO START-FAIL-GF-20.
168600     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
168700     IF      XRECORD-NUMBER (1)  EQUAL TO 034
168800             PERFORM PASS
168900             MOVE SPACE TO RE-MARK
169000             GO TO START-WRITE-GF-20.
169100     MOVE    34  TO RECNO.
169200     PERFORM DISPLAY-ALTERNATE-KEY1.
169300     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
169400 START-FAIL-GF-20.
169500     PERFORM FAIL.
169600     MOVE    034  TO CORRECT-18V0.
169700     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
169800           TO RE-MARK.
169900     GO TO   START-WRITE-GF-20.
170000 START-DELETE-GF-20.
170100     PERFORM DE-LETE.
170200 START-WRITE-GF-20.
170300     PERFORM PRINT-DETAIL.
170400 START-INIT-GF-21.
170500     PERFORM START-INITIALIZE-RECORD.
170600     MOVE "START-TEST-GF-21"  TO PAR-NAME.
170700     IF      INIT-FLAG NOT EQUAL ZERO
170800             PERFORM START-INIT-ERROR
170900             GO TO START-DELETE-GF-21.
171000     MOVE    "CCCCCDDDDD022"  TO FS1-RECKEY-1-13.
171100     MOVE    "EEEEEEEEEF001ALTKEY1"  TO FS1-ALTKEY1-1-20.
171200     MOVE    "EEEEEFFFFF022ALTKEY2" TO FS1-ALTKEY2-1-20.
171300     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
171400     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
171500     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
171600 START-TEST-GF-21.
171700*
171800*  START-TEST-GF.03  - THE START STATEMENT SHOULD FIND A
171900*                    RECORD IN THE FILE WHICH HAS AN ALTERNATE
172000*                    KEY VALUE OF EEEEEEEEEF002ALTKEY1 (RECORD
172100*                    NUMBER 01).  THE ALTERNATE KEY WAS LOADED
172200*                    WITH A VALUE THAT IS SEQUENTIALLY LOWER
172300*                    THAN ANY CURRENTLY EXISTNNG KEY IN THE FILE
172400*                    BEFORE THE START WAS EXECUTED.
172500*
172600     START   IX-FS1
172700                    KEY IS NOT LESS THAN IX-FS1-ALTKEY1
172800                INVALID KEY  MOVE FS1-STATUS TO FILESTATUS (3)
172900                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
173000                        GO TO START-FAIL-GF-21.
173100     MOVE    FS1-STATUS TO FILESTATUS (3).
173200     READ    IX-FS1  AT END
173300                     MOVE  "AT END ON READ" TO COMPUTED-A
173400                     GO TO START-FAIL-GF-21.
173500     MOVE    IX-FS1R1-F-G-240  TO  FILE-RECORD-INFO (1).
173600     IF      XRECORD-NUMBER (1)  EQUAL TO 001
173700             PERFORM PASS
173800             MOVE SPACE TO RE-MARK
173900             GO TO START-WRITE-GF-21.
174000     MOVE    01  TO RECNO.
174100     PERFORM DISPLAY-ALTERNATE-KEY1.
174200     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
174300 START-FAIL-GF-21.
174400     PERFORM FAIL.
174500     MOVE    001  TO CORRECT-18V0.
174600     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
174700           TO RE-MARK.
174800     GO TO   START-WRITE-GF-21.
174900 START-DELETE-GF-21.
175000     PERFORM DE-LETE.
175100 START-WRITE-GF-21.
175200     PERFORM PRINT-DETAIL.
175300 START-INIT-GF-22.
175400     PERFORM START-INITIALIZE-RECORD.
175500     MOVE "START-TEST-GF-22"  TO PAR-NAME.
175600     IF      INIT-FLAG NOT EQUAL ZERO
175700             PERFORM START-INIT-ERROR
175800             GO TO START-DELETE-GF-22.
175900     MOVE    "UUUUUUUUUU400"  TO FS1-RECKEY-1-13.
176000     MOVE    "YYYYYYYYYY401ALTKEY1"  TO FS1-ALTKEY1-1-20.
176100     MOVE    "DDDDDDDDDD000ALTKEY2" TO FS1-ALTKEY2-1-20.
176200     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
176300     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
176400     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
176500 START-TEST-GF-22.
176600*
176700*  START-TEST-GF.04  - THE START STATEMENT SHOULD NOT FIND A
176800*                    RECORD IN THE FILE WHICH HAS AN ALTERNATE
176900*                    KEY VALUE OF YYYYYYYYYY401ALTKEY1.  THIS
177000*                    VALUE IS SEQUENTIALLY NOT LESS THAN
177100*                    ANY ALTERNATE KEY CURRENTLY EXISTING IN
177200*                    THE FILE.  AN INVALID KEY CONDITION
177300*                    IS EXPECTED WHEN THE START IS EXECUTED.
177400*
177500     START   IX-FS1
177600                    KEY IS NOT LESS THAN IX-FS1-ALTKEY1
177700                INVALID KEY  MOVE  FS1-STATUS TO FILESTATUS (4)
177800                         GO TO START-PASS-GF-22.
177900     MOVE    FS1-STATUS TO FILESTATUS (4).
178000     READ    IX-FS1 AT END
178100                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
178200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
178300     PERFORM FAIL.
178400     MOVE    ALTERNATE-KEY1 (1) TO COMPUTED-A.
178500     MOVE    "INVALID KEY" TO CORRECT-A.
178600     MOVE "IX-36 INVALID KEY PATH NOT BE TAKEN OR AT END ON READ"
178700           TO RE-MARK.
178800     GO TO   START-WRITE-GF-22.
178900 START-PASS-GF-22.
179000     PERFORM  PASS.
179100     MOVE     "INVALID KEY"  TO RE-MARK.
179200     GO TO   START-WRITE-GF-22.
179300 START-DELETE-GF-22.
179400     PERFORM DE-LETE.
179500 START-WRITE-GF-22.
179600     PERFORM PRINT-DETAIL.
179700 START-INIT-GF-23.
179800     PERFORM START-INITIALIZE-RECORD.
179900     MOVE "START-TEST-GF-23"  TO PAR-NAME.
180000     IF      INIT-FLAG NOT EQUAL ZERO
180100             PERFORM START-INIT-ERROR
180200             GO TO START-DELETE-GF-23.
180300     MOVE    "CDDDDDDDDD039"  TO FS1-RECKEY-1-13.
180400     MOVE    "GGGGHHHHHH100ALTKEY1"  TO FS1-ALTKEY1-1-20.
180500     MOVE    "ABCXXXXXXX400ALTKEY2"  TO FS1-ALTKEY2-1-20.
180600     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
180700     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
180800     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
180900 START-TEST-GF-23.
181000*
181100*  START-TEST-GF.05  - THE START STATEMENT USES AN OPERAND
181200*                    IN THE KEY PHRASE WHICH IS NOT THE NAME
181300*                    OF AN ALTERNATE KEY BUT IS THE NAME OF A
181400*                    DATA ITEM WHICH IS SUBORDINATE TO THE
181500*                    ALTERNATE KEY.  THE CONTENTS OF THE DATA ITEM
181600*                    (POSITIONS 1 THRU 6 OF THE ALTERNATE KEY)
181700*                    IS A UNIQUE KEY VALUE FOR THE FILE.  THE
181800*                    BALANCE OF THE KEY (POSITIONS 7 THRU 20 OF
181900*                    THE ALTERNATE KEY IS NOT A VALID KEY VALUE
182000*                    FOR THE FILE.  THE
182100*                    RECORD WITH THE ALTERNATE KEY GGGGHHHHHH052
182200*                    ALTKEY1 (RECORD NUMBER 26) IS EXPECTED TO
182300*                    BE FOUND.
182400*
182500     START   IX-FS1
182600                    KEY IS NOT LESS THAN R-ALTKEY1-1-6
182700          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (5)
182800                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
182900                     GO TO START-FAIL-GF-23.
183000     MOVE    FS1-STATUS TO FILESTATUS (5).
183100     READ    IX-FS1  AT END
183200                     MOVE  "AT END ON READ" TO COMPUTED-A
183300                     GO TO  START-FAIL-GF-23.
183400     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
183500     IF      XRECORD-NUMBER (1)  EQUAL TO 26
183600             PERFORM  PASS
183700             MOVE  "SUBORDINATE DATA ITEM OF KEY" TO RE-MARK
183800             GO TO START-WRITE-GF-23.
183900     MOVE    26  TO RECNO.
184000     PERFORM DISPLAY-ALTERNATE-KEY1.
184100     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
184200 START-FAIL-GF-23.
184300     PERFORM  FAIL.
184400     MOVE    26  TO CORRECT-18V0.
184500     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
184600           TO RE-MARK.
184700     GO TO   START-WRITE-GF-23.
184800 START-DELETE-GF-23.
184900     PERFORM DE-LETE.
185000 START-WRITE-GF-23.
185100     PERFORM PRINT-DETAIL.
185200 START-INIT-GF-24.
185300     PERFORM START-INITIALIZE-RECORD.
185400     MOVE "START-TEST-GF-24"  TO PAR-NAME.
185500     IF      INIT-FLAG NOT EQUAL ZERO
185600             PERFORM START-INIT-ERROR
185700             GO TO START-DELETE-GF-24.
185800     MOVE    "YYYYYUUUUU390"  TO FS1-RECKEY-1-13.
185900     MOVE    "XXXXXYYYYY390ALTKEY1" TO FS1-ALTKEY1-1-20.
186000     MOVE    "WWWWWWWWWV399ALTKEY2"  TO FS1-ALTKEY2-1-20.
186100     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
186200     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
186300     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
186400 START-TEST-GF-24.
186500*
186600*  START-TEST-GF.06  - THE START STATEMENT USES AN OPERAND IN THE
186700*                    KEY PHRASE WHICH IS NOT THE NAME OF AN
186800*                    ALTERNATE KEY BUT IS THE NAME OF A DATA ITEM
186900*                    THAT IS SUBORDINATE TO THE KEY.  THE CONTENTS
187000*                    OF THE DATA ITEM (POSITIONS 1 THRU 5 OF THE
187100*                    ALTERNATE KEY) IS A DUPLICATE OF THE FIRST
187200*                    5 POSITIONS OF 6 OTHER RECORDS IN THE FILE.
187300*                    THIS TEST EXPECTS THE RECORD POINTER
187400*                    TO BE POSITIONED TO RECORD KEY XXXXXXXXXX380
187500*                    ALTKEY1 (RECORD NUMBER 190) WHICH WAS THE FIR
187600*                    RECORD WRITTEN THAT
187700*                    CONTAINS XXXXX IN THE FIRST 5 POSITIONS OF TH
187800*                    KEY.  THE ALTERNATE KEY WAS LOADED WITH THE
187900*                    VALUE XXXXXYYYYY390ALTKEY1 (KEY FOR RECORD
188000*                    NUMBER 195) BEFORE THE START WAS EXECUTED.
188100*
188200     START   IX-FS1
188300                    KEY IS NOT LESS THAN IX-FS1-ALTKEY1-1-5
188400                     INVALID KEY
188500                         MOVE  FS1-STATUS TO FILESTATUS (6)
188600                     MOVE  "INVALID KEY ON START"  TO COMPUTED-A
188700                     GO TO START-FAIL-GF-24.
188800     MOVE    FS1-STATUS TO FILESTATUS (6).
188900     READ    IX-FS1  AT END
189000                     MOVE "AT END ON READ" TO COMPUTED-A
189100                     GO TO START-FAIL-GF-24.
189200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
189300     IF      XRECORD-NUMBER (1) EQUAL TO 190
189400             PERFORM  PASS
189500             MOVE  "SUBORDINATE DATA ITEM IN KEY"  TO RE-MARK
189600             GO TO START-WRITE-GF-24.
189700     MOVE    65  TO RECNO.
189800     PERFORM DISPLAY-ALTERNATE-KEY1.
189900     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
190000 START-FAIL-GF-24.
190100     PERFORM  FAIL.
190200     MOVE    190  TO CORRECT-18V0.
190300     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
190400           TO RE-MARK.
190500     GO TO   START-WRITE-GF-24.
190600 START-DELETE-GF-24.
190700     PERFORM DE-LETE.
190800 START-WRITE-GF-24.
190900     PERFORM PRINT-DETAIL.
191000 START-INIT-GF-25.
191100     PERFORM START-INITIALIZE-RECORD.
191200     MOVE "START-TEST-GF-25"  TO PAR-NAME.
191300     IF      INIT-FLAG NOT EQUAL ZERO
191400             PERFORM START-INIT-ERROR
191500             GO TO START-DELETE-GF-25.
191600     MOVE    "CCCCCCCCCD022"  TO FS1-RECKEY-1-13.
191700     MOVE    "YYYYYZYYYY410ALTKEY1"  TO FS1-ALTKEY1-1-20.
191800     MOVE    "VVVVVVVVVV380ALTKEY2"  TO FS1-ALTKEY2-1-20.
191900     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
192000     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
192100     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
192200 START-TEST-GF-25.
192300*
192400*  START-TEST-GF.07  - THE START STATEMENT USES AN OPERAND IN THE
192500*                    KEY PHRASE OF THE START STATEMENT WHICH IS
192600*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
192700*                    NAME.  THE CONTENTS OF THE DATA ITEM
192800*                    POSITIONS 1 THRU 6 OF THE ALTERNATE KEY)
192900*                    IS LOADED WITH YYYYYZ WHICH IS HIGHER THAN TH
193000*                    KEY VALUE OF THE LAST RECORD IN THE FILE.  TH
193100*                    SHOULD BE NO RECORD IN THE FILE NOT LESS THAN
193200*                    KEY VALUE THUS AN INVALID KEY IS EXPECTED
193300*                    WHEN THE START IS EXECUTED.
193400*
193500     START   IX-FS1
193600                    KEY IS NOT LESS THAN R-ALTKEY1-1-6
193700          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (7)
193800                     GO TO START-PASS-GF-25.
193900     MOVE    FS1-STATUS TO FILESTATUS (7).
194000     READ    IX-FS1  AT END
194100                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
194200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
194300     PERFORM FAIL.
194400     MOVE    XRECORD-KEY (1) TO COMPUTED-A.
194500     MOVE    "INVALID KEY" TO CORRECT-A.
194600     MOVE "IX-36 INVALID KEY PATH NOT BE TAKEN OR AT END ON READ"
194700           TO RE-MARK.
194800     GO TO   START-WRITE-GF-25.
194900 START-PASS-GF-25.
195000     PERFORM PASS.
195100     MOVE    "INVALID KEY"  TO RE-MARK.
195200     GO TO   START-WRITE-GF-25.
195300 START-DELETE-GF-25.
195400     PERFORM DE-LETE.
195500 START-WRITE-GF-25.
195600     PERFORM PRINT-DETAIL.
195700 START-INIT-GF-26.
195800     PERFORM START-INITIALIZE-RECORD.
195900     MOVE "START-TEST-GF-26"  TO PAR-NAME.
196000     IF      INIT-FLAG NOT EQUAL ZERO
196100             PERFORM START-INIT-ERROR
196200             GO TO START-DELETE-GF-26.
196300     MOVE    "YYYYYUUUUU390"  TO FS1-RECKEY-1-13.
196400     MOVE    "EEEEDEEEEE002ALTKEY1"  TO FS1-ALTKEY1-1-20.
196500     MOVE    "WWWWWWWWWV399ALTKEY2"  TO FS1-ALTKEY2-1-20.
196600     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
196700     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
196800     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
196900 START-TEST-GF-26.
197000*
197100*  START-TEST-GF.08  - THIS TEST USES AN OPERAND IN THE
197200*                    KEY PHRASE OF THE START STATEMENT WHICH IS
197300*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
197400*                    NAME.  THE CONTENTS OF THE DATA ITEM
197500*                    (POSITIONS 1 THRU 6 OF THE ALTERNATE KEY) IS
197600*                    LOADED WITH "EEEEDE".  THIS KEY VALUE
197700*                    IS LOWER THAN ANY ALTERNATE KEY VALUE IN
197800*                    POSITION 1 THRU 6 EXISTING IN THE FILE
197900*                    THE START STATEMENT WITH THE KEY IS NOT LESS
198000*                    THAN PHRASE IS EXECUTED AND SHOULD FIND A
198100*                    RECORD WITH THE KEY VALUE "EEEEEEEEEF002
198200*                    ALTKEY1 (RECORD NUMBER 01).
198300*
198400     START   IX-FS1
198500                    KEY IS NOT LESS THAN R-ALTKEY1-1-6
198600          INVALID KEY    MOVE  FS1-STATUS TO FILESTATUS (8)
198700                     MOVE  "INVALID KEY ON START"  TO COMPUTED-A
198800                     GO TO START-FAIL-GF-26.
198900     MOVE    FS1-STATUS TO FILESTATUS (8).
199000     READ    IX-FS1  AT END
199100                     MOVE "AT END ON READ" TO COMPUTED-A
199200                     GO TO START-FAIL-GF-26.
199300     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
199400     IF      XRECORD-NUMBER (1) EQUAL TO 001
199500             PERFORM  PASS
199600             MOVE  "SUBORDINATE DATA ITEM IN KEY"  TO RE-MARK
199700             GO TO START-WRITE-GF-26.
199800     MOVE    01  TO RECNO.
199900     PERFORM DISPLAY-ALTERNATE-KEY1.
200000     MOVE    XRECORD-NUMBER (1)  TO COMPUTED-18V0.
200100 START-FAIL-GF-26.
200200     PERFORM  FAIL.
200300     MOVE    001   TO CORRECT-18V0.
200400     MOVE "IX-36; IX-6: INVALID KEY PATH TAKEN OR AT END ON READ"
200500           TO RE-MARK.
200600     GO TO   START-WRITE-GF-26.
200700 START-DELETE-GF-26.
200800     PERFORM DE-LETE.
200900 START-WRITE-GF-26.
201000     PERFORM PRINT-DETAIL.
201100 START-INIT-GF-27.
201200     PERFORM START-INITIALIZE-RECORD.
201300     MOVE "START-TEST-GF-27"  TO PAR-NAME.
201400     IF      INIT-FLAG NOT EQUAL ZERO
201500             PERFORM START-INIT-ERROR
201600             GO TO START-DELETE-GF-27.
201700     MOVE    "UUUUUUUUUU400"  TO FS1-RECKEY-1-13.
201800     MOVE    "YYYYYZYYYY400ALTKEY1"  TO FS1-ALTKEY1-1-20.
201900     MOVE    "WWWWWWWWWV398ALTKEY2"  TO FS1-ALTKEY2-1-20.
202000     MOVE    WRK-FS1-RECKEY   TO IX-REC-KEY-AREA.
202100     MOVE    WRK-FS1-ALTKEY1  TO IX-ALT-KEY1-AREA.
202200     MOVE    WRK-FS1-ALTKEY2  TO IX-ALT-KEY2-AREA.
202300 START-TEST-GF-27.
202400*
202500*  START-TEST-GF.09  - THIS TEST USES AN OPERAND IN THE
202600*                    KEY PHRASE OF THE START STATEMENT WHICH IS
202700*                    A DATA ITEM SUBORDINATE TO THE ALTERNATE KEY
202800*                    NAME.  THE CONTENTS OF THE DATA ITEM
202900*                    (POSITIONS 1 THRU 10 OF THE RECORD KEY) IS
203000*                    LOADED WITH "YYYYYZYYYY". THIS KEY VALUE
203100*                    IS NOT LESS THAN ANY ALTERNATE KEY VALUE IN
203200*                    POSITION 1 THRU 10 EXISTING IN THE FILE
203300*                    THEREFORE AN INVALID KEY CONDITION IS
203400*                    EXPECTED WHEN THE START STATEMENT IS
203500*                    EXECUTED.
203600*
203700     START   IX-FS1
203800                    KEY IS NOT LESS THAN IX-FS1-ALTKEY1-1-10
203900                                 INVALID KEY
204000                         MOVE  FS1-STATUS TO FILESTATUS (9)
204100                     GO TO START-PASS-GF-27.
204200     MOVE    FS1-STATUS TO FILESTATUS (9).
204300     READ    IX-FS1  AT END
204400                     MOVE  "AT END PATH TAKEN ON READ" TO RE-MARK.
204500     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
204600     PERFORM FAIL.
204700     MOVE    XRECORD-KEY (1)  TO COMPUTED-A.
204800     MOVE     "INVALID KEY" TO CORRECT-A.
204900     MOVE "IX-36 INVALID KEY PATH NOT BE TAKEN OR AT END ON READ"
205000           TO RE-MARK.
205100     GO TO   START-WRITE-GF-27.
205200 START-PASS-GF-27.
205300     PERFORM PASS.
205400     MOVE    "INVALID KEY"  TO RE-MARK.
205500     GO TO   START-WRITE-GF-27.
205600 START-DELETE-GF-27.
205700     PERFORM DE-LETE.
205800 START-WRITE-GF-27.
205900     PERFORM PRINT-DETAIL.
206000     CLOSE   IX-FS1.
206100
206200*
206300*  THIS SERIES OF TESTS CHECKS THE CONTENTS OF THE FILE STATUS
206400*  CAPTURED FROM THE TESTS IN START-TEST-GF.
206500*
206600 START-TEST-GF-28.
206700     MOVE              "FILE STATUS START:00" TO FEATURE.
206800     MOVE "START-TEST-GF-28" TO PAR-NAME.
206900     IF      FILESTATUS (1)  EQUAL TO "**"
207000             PERFORM DE-LETE
207100             MOVE "FROM START-TEST-GF-19"  TO CORRECT-A
207200             GO TO  START-TEST-GF-28A.
207300*
207400*  START-TEST-006.01 - THIS TEST CHECKS THE FILE STATUS CONTENTS
207500*                    RESULTING FROM START-TEST-GF-19.  THE FILE
207600*                    STATUS CONTENTS IS EXPECTED TO BE "00".
207700*
207800     IF      FILESTATUS (1)  EQUAL TO "00"
207900             PERFORM PASS
208000     ELSE
208100         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-19" TO RE-MARK
208200             PERFORM  FAIL
208300             MOVE  "00"  TO CORRECT-A
208400             MOVE   FILESTATUS (1)  TO COMPUTED-A.
208500 START-TEST-GF-28A.
208600     PERFORM  PRINT-DETAIL.
208700 START-TEST-GF-29.
208800     MOVE "START-TEST-GF-20" TO PAR-NAME.
208900     IF      FILESTATUS (2)  EQUAL TO "**"
209000             PERFORM DE-LETE
209100             MOVE "FROM START-TEST-GF-20"  TO CORRECT-A
209200             GO TO  START-TEST-GF-29A.
209300*
209400*  START-TEST-006.02 - THIS TEST CHECKS THE FILE STATUS CONTENTS
209500*                    RESULTING FROM START-TEST-GF-20.  THE FILE
209600*                    STATUS CONTENTS IS EXPECTED TO BE "00"
209700*
209800     IF      FILESTATUS (2) EQUAL TO "00"
209900             PERFORM  PASS
210000             ELSE  PERFORM  FAIL
210100         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-20" TO RE-MARK
210200             MOVE    "00"  TO CORRECT-A
210300             MOVE   FILESTATUS (2)  TO COMPUTED-A.
210400 START-TEST-GF-29A.
210500     PERFORM  PRINT-DETAIL.
210600 START-TEST-GF-30.
210700     MOVE "START-TEST-GF-30" TO PAR-NAME.
210800     IF      FILESTATUS (3)  EQUAL TO "**"
210900             PERFORM DE-LETE
211000             MOVE "FROM START-TEST-GF.21"  TO CORRECT-A
211100             GO TO  START-TEST-GF-30A.
211200*
211300*  START-TEST-006.03 - THIS TEST CHECKS THE FILE STATUS CONTENTS
211400*                    RESULTING FROM START-TEST-GF-21.  THE FILE
211500*                    STATUS CONTENTS IS EXPECTED TO BE "00"
211600*
211700     IF      FILESTATUS (3) EQUAL TO "00"
211800             PERFORM  PASS
211900             ELSE  PERFORM  FAIL
212000         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-21" TO RE-MARK
212100             MOVE    "00"  TO CORRECT-A
212200             MOVE   FILESTATUS (3)  TO COMPUTED-A.
212300 START-TEST-GF-30A.
212400     PERFORM  PRINT-DETAIL.
212500 START-TEST-GF-31.
212600     MOVE              "FILE STATUS START:23" TO FEATURE.
212700     MOVE "START-TEST-GF-31" TO PAR-NAME.
212800     IF      FILESTATUS (4)  EQUAL TO "**"
212900             PERFORM DE-LETE
213000             MOVE "FROM START-TEST-GF-22"  TO CORRECT-A
213100             GO TO  START-TEST-GF-31A.
213200*
213300*  START-TEST-006.04 - THIS TEST CHECKS THE FILE STATUS CONTENTS
213400*                    RESULTING FROM START-TEST-GF-22.  THE FILE
213500*                    STATUS CONTENTS IS EXPECTED TO BE "23".
213600*
213700     IF      FILESTATUS (4)  EQUAL TO "23"
213800             PERFORM  PASS
213900             ELSE  PERFORM  FAIL
214000         MOVE "FROM START-TEST-GF-04; IX-4 1.3.4 (3) C" TO RE-MARK
214100             MOVE    "23"  TO CORRECT-A
214200             MOVE   FILESTATUS (4)  TO COMPUTED-A.
214300 START-TEST-GF-31A.
214400     PERFORM  PRINT-DETAIL.
214500 START-TEST-GF-32.
214600     MOVE              "FILE STATUS START:00" TO FEATURE.
214700     MOVE "START-TEST-GF-32" TO PAR-NAME.
214800     IF      FILESTATUS (5)  EQUAL TO "**"
214900             PERFORM DE-LETE
215000             MOVE "FROM START-TEST-GF-23"  TO CORRECT-A
215100             GO TO  START-TEST-GF-32A.
215200*
215300*  START-TEST-006.05 - THIS TEST CHECKS THE FILE STATUS CONTENTS
215400*                    RESULTING FROM START-TEST-GF-23.  THE FILE
215500*                    STATUS CONTENTS IS EXPECTED TO BE "00"
215600*
215700     IF      FILESTATUS (5)  EQUAL TO "00"
215800             PERFORM  PASS
215900             ELSE  PERFORM  FAIL
216000         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-23" TO RE-MARK
216100             MOVE    "00"  TO CORRECT-A
216200             MOVE   FILESTATUS (5)  TO COMPUTED-A.
216300 START-TEST-GF-32A.
216400     PERFORM  PRINT-DETAIL.
216500 START-TEST-GF-33.
216600     MOVE              "FILE STATUS START:00" TO FEATURE.
216700     MOVE "START-TEST-GF-33" TO PAR-NAME.
216800     IF      FILESTATUS (6)  EQUAL TO "**"
216900             PERFORM DE-LETE
217000             MOVE "FROM START-TEST-GF-24"  TO CORRECT-A
217100             GO TO  START-TEST-GF-33A.
217200*
217300*  START-TEST-006.06 - THIS TEST CHECKS THE FILE STATUS CONTENTS
217400*                    RESULTING FROM START-TEST-GF-24.  THE FILE
217500*                    STATUS CONTENTS IS EXPECTED TO BE "00"
217600*
217700     IF      FILESTATUS (6)  EQUAL TO "00"
217800             PERFORM  PASS
217900             ELSE  PERFORM  FAIL
218000         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-24" TO RE-MARK
218100             MOVE   "00"  TO CORRECT-A
218200             MOVE   FILESTATUS (6)  TO COMPUTED-A.
218300 START-TEST-GF-33A.
218400     PERFORM  PRINT-DETAIL.
218500 START-TEST-GF-34.
218600     MOVE              "FILE STATUS START:23" TO FEATURE.
218700     MOVE "START-TEST-GF-34" TO PAR-NAME.
218800     IF      FILESTATUS (7)  EQUAL TO "**"
218900             PERFORM DE-LETE
219000             MOVE "FROM START-TEST-GF-25" TO CORRECT-A
219100             GO TO  START-TEST-GF-34A.
219200*
219300*  START-TEST-006.07 - THIS TEST CHECKS THE FILE STATUS CONTENTS
219400*                    RESULTING FROM START-TEST-GF-25.  THE FILE
219500*                    STATUS CONTENTS IS EXPECTED TO BE "23"
219600*
219700     IF      FILESTATUS (7)  EQUAL TO "23"
219800             PERFORM  PASS
219900             ELSE  PERFORM  FAIL
220000         MOVE "FROM START-TEST-GF-25; IX-4 1.3.4 (3) C" TO RE-MARK
220100             MOVE    "23"  TO CORRECT-A
220200             MOVE   FILESTATUS (7)  TO COMPUTED-A.
220300 START-TEST-GF-34A.
220400     PERFORM  PRINT-DETAIL.
220500 START-TEST-GF-35.
220600     MOVE              "FILE STATUS START:00" TO FEATURE.
220700     MOVE "START-TEST-GF-35" TO PAR-NAME.
220800     IF      FILESTATUS (8)  EQUAL TO "**"
220900             PERFORM DE-LETE
221000             MOVE "FROM START-TEST-GF-26" TO CORRECT-A
221100             GO TO  START-TEST-GF-35A.
221200*
221300*  START-TEST-006.08 - THIS TEST CHECKS THE FILE STATUS CONTENTS
221400*                    RESULTING FROM START-TEST-GF-26.  THE FILE
221500*                    STATUS CONTENTS IS EXPECTED TO BE "00"
221600*
221700     IF      FILESTATUS (8) EQUAL TO "00"
221800             PERFORM  PASS
221900             ELSE  PERFORM  FAIL
222000         MOVE "IX-3; 1.3.4 (1) A;FROM START-TEST-GF-26" TO RE-MARK
222100             MOVE    "00"  TO CORRECT-A
222200             MOVE   FILESTATUS (8)  TO COMPUTED-A.
222300 START-TEST-GF-35A.
222400     PERFORM  PRINT-DETAIL.
222500 START-TEST-GF-36.
222600     MOVE              "FILE STATUS START:23" TO FEATURE.
222700     MOVE "START-TEST-GF-36" TO PAR-NAME.
222800     IF      FILESTATUS (9)  EQUAL TO "**"
222900             PERFORM DE-LETE
223000             MOVE "FROM START-TEST-GF-27"  TO CORRECT-A
223100             GO TO  START-TEST-GF-36A.
223200*
223300*  START-TEST-006.09 - THIS TEST CHECKS THE FILE STATUS CONTENTS
223400*                    RESULTING FROM START-TEST-GF-27.  THE FILE
223500*                    STATUS CONTENTS IS EXPECTED TO BE "23".
223600*
223700     IF      FILESTATUS (9)  EQUAL TO "23"
223800             PERFORM PASS
223900     ELSE    PERFORM FAIL
224000         MOVE "FROM START-TEST-GF-27; IX-4 1.3.4 (3) C" TO RE-MARK
224100             MOVE  "23"  TO CORRECT-A
224200             MOVE   FILESTATUS (9)  TO COMPUTED-A.
224300 START-TEST-GF-36A.
224400     PERFORM  PRINT-DETAIL.
224500
224600
224700
224800 START-INIT-GF-37.
224900     OPEN  I-O   IX-FS1.
225000     MOVE     "START SERIES" TO FEATURE.
225100     MOVE    "START-TEST-GF-37" TO PAR-NAME.
225200     MOVE    ZERO TO INVKEY-COUNTER.
225300*
225400*    THIS TEST EXECUTES SEVERAL START STATEMENTS USING DIFFERENT
225500*    KEY VALUES.  FOLLOWING EXECUTION OF THE LAST START
225600*    STATEMENT THE READ STATEMENT IS EXECUTED.  THE START
225700*    STATEMENT SHOULD HAVE POSITION THE RECORD POINTER
225800*    SUCH THAT RECORD NUMBER 50 IS MADE AVAILABLE
225900*    TO THE READ STATEMENT.  THE KEY OF REFERENCE
226000*    SHOULD BE ALTERNATE-KEY-2.
226100*
226200 START-TEST-GF-37.
226300     MOVE    "FGGGGGGGGG098"  TO FS1-RECKEY-1-13.
226400     MOVE    "WWWWWWWXXX366ALTKEY1"  TO FS1-ALTKEY1-1-20.
226500     MOVE    "RRRRRRRRRR300ALTKEY2"  TO FS1-ALTKEY2-1-20.
226600     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
226700     MOVE    WRK-FS1-ALTKEY1 TO IX-ALT-KEY1-AREA.
226800     MOVE    WRK-FS1-ALTKEY2 TO IX-ALT-KEY2-AREA.
226900     START   IX-FS1
227000                     KEY IS EQUAL TO IX-FS1-ALTKEY2
227100                       INVALID KEY ADD 1  TO INVKEY-COUNTER.
227200     START   IX-FS1   INVALID KEY  ADD  01  TO INVKEY-COUNTER.
227300     START   IX-FS1
227400                    KEY IS NOT LESS THAN R-ALTKEY1-1-6
227500                       INVALID KEY ADD 1  TO INVKEY-COUNTER.
227600     START   IX-FS1
227700                     KEY IS NOT LESS THAN IX-FS1-ALTKEY2-1-5
227800                       INVALID KEY ADD 1  TO INVKEY-COUNTER.
227900     READ    IX-FS1  AT END
228000                     MOVE  "AT END ON READ"  TO COMPUTED-A
228100                     GO TO  START-FAIL-GF-37.
228200     MOVE    IX-FS1R1-F-G-240 TO FILE-RECORD-INFO (1).
228300     IF      XRECORD-NUMBER (1) EQUAL TO 175
228400             PERFORM  PASS
228500             MOVE    "MULTIPLE STARTS BEFORE READ " TO RE-MARK
228600             GO TO  START-WRITE-GF-37.
228700     MOVE    "RRRRRRRRRR050ALTKEY2" TO CORRECT-A.
228800     MOVE    ALTERNATE-KEY2 (1) TO WRK-FS1-ALTKEY2.
228900     MOVE    FS1-ALTKEY2-1-20 TO COMPUTED-A.
229000     MOVE    SPACE TO P-OR-F.
229100     MOVE    "ALTERNATE RECORD KEY2 VALUES" TO RE-MARK.
229200     PERFORM PRINT-DETAIL.
229300     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
229400 START-FAIL-GF-37.
229500     PERFORM FAIL.
229600     MOVE    175 TO CORRECT-18V0.
229700     MOVE "WRONG RECORD NUMBER; IX-28 OR IX-36" TO RE-MARK.
229800     GO TO START-WRITE-GF-37.
229900 START-DELETE-GF-37.
230000     PERFORM DE-LETE.
230100 START-WRITE-GF-37.
230200     PERFORM  PRINT-DETAIL.
230300
230400     CLOSE   IX-FS1.
230500     GO TO  CCVS-EXIT.
230600
230700
230800 START-INITIALIZE-RECORD.
230900     MOVE    "**"  TO FS1-STATUS.
231000     MOVE    "GGGGGGGGGG200" TO  FS1-RECKEY-1-13.
231100     MOVE    ZERO  TO INIT-FLAG.
231200     MOVE    9999  TO XRECORD-NUMBER (1).
231300     MOVE    SPACE TO IX-FS1R1-F-G-240.
231400     MOVE    WRK-FS1-RECKEY TO IX-REC-KEY-AREA.
231500     START   IX-FS1
231600                     KEY IS EQUAL TO IX-FS1-KEY
231700         INVALID KEY MOVE  "INVALID KEY ON START" TO COMPUTED-A
231800                     MOVE 01 TO INIT-FLAG.
231900     READ    IX-FS1  INTO  FILE-RECORD-INFO (1)
232000                     AT END  MOVE  "AT END ON READ" TO COMPUTED-A
232100                     MOVE 01 TO INIT-FLAG.
232200     IF      XRECORD-NUMBER (1) NOT EQUAL TO 100
232300             MOVE 02 TO INIT-FLAG.
232400     MOVE    SPACE TO FS1-STATUS.
232500 START-INIT-ERROR.
232600     MOVE    "TEST IMPROPERLY INITIALIZED" TO RE-MARK.
232700     MOVE    "GGGGGGGGGG200" TO CORRECT-A.
232800     IF      INIT-FLAG NOT EQUAL 01
232900             MOVE    XRECORD-KEY (1)  TO WRK-FS1-RECKEY
233000             MOVE    FS1-RECKEY-1-13  TO COMPUTED-A.
233100     PERFORM PRINT-DETAIL.
233200     MOVE    "**" TO FILESTATUS (REC-CT).
233300 DISPLAY-RECORD-KEYS.
233400     MOVE    XRECORD-KEY (1)  TO WRK-FS1-RECKEY.
233500     MOVE    FS1-RECKEY-1-13  TO COMPUTED-A.
233600     MOVE    RECKEY-VALUE (RECNO)  TO CORRECT-A.
233700     MOVE    SPACE TO P-OR-F.
233800     MOVE    "RECORD KEY VALUES" TO RE-MARK.
233900     PERFORM PRINT-DETAIL.
234000 DISPLAY-ALTERNATE-KEY1.
234100     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FS1-ALTKEY1.
234200     MOVE    FS1-ALTKEY1-1-20  TO COMPUTED-A.
234300     MOVE    ALTKEY1-VALUE (RECNO)  TO CORRECT-A.
234400     MOVE    SPACE TO P-OR-F.
234500     MOVE    "ALTERNATE RECORD KEY1 VALUES"  TO RE-MARK.
234600     PERFORM PRINT-DETAIL.
234700 DISPLAY-ALTERNATE-KEY2.
234800     MOVE    ALTERNATE-KEY2 (1) TO WRK-FS1-ALTKEY2.
234900     MOVE    FS1-ALTKEY2-1-20  TO COMPUTED-A.
235000     MOVE    ALTKEY2-VALUE (RECNO)  TO CORRECT-A.
235100     MOVE    SPACE TO P-OR-F.
235200     MOVE    "ALTERNATE RECORD KEY2 VALUES"  TO RE-MARK.
235300     PERFORM PRINT-DETAIL.
235400
235500
235600 CCVS-EXIT SECTION.
235700 CCVS-999999.
235800     GO TO CLOSE-FILES.
