000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     IX215A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*    THE PURPOSE OF THIS PROGRAM IS TO TEST THE ABILITY TO
001400*    DESCRIBE THE PRIME RECORD KEY AND THE ALTERNATE RECORD KEYS
001500*    IN A REDEFINES CLAUSES AND TO TEST THE USE OF QUALIFICATION
001600*    OF THE RECORD KEYS.  THE PROGRAM IS BROKEN INTO THREE SEC-
001700*    TIONS.  THE FIRST SECTION TESTS THE ABILITY TO USE A
001800*    REDEFINED DATA ITEM OR A DATA ITEM SUBORDINATE TO IT CON-
001900*    TAINING THE LEFTMOST CHARACTER POSTIONS OF THE REDEFINED DATA
002000*    ITEM IN THE KEY PHRASE OF THE START STATEMENT.  THE SECOND
002100*    SECTION TESTS THE ABILITY TO USE A RECORD KEY WHICH IS NESTED
002200*    IN REDEFINES OR A DATA ITEM SUBORDINATE TO IT THAT CONTAINS
002300*    THE LEFTMOST CHARACTER POSITIONS OF A REDEFINED DATA ITEM
002400*    WHICH IS NESTED IN REDEFINES IN THE KEY PHRASE OF THE START
002500*    STATEMENT.  THE THIRD SECTION TESTS THE USE OF QUALIFICATION
002600*    OF THE RECORD KEYS.  DIFFERENT KEY VALUES ARE USED FOR
002700*    TESTING.  IF A KEY VALUE IS PROVIDED WHICH MATCHES A RECORD
002800*    IN THE FILE THE EXECUTION OF A START STATEMENT FOLLOWED BY A
002900*    READ NEXT STATEMENT IS EXPECTED TO MADE AVAILABLE THE RECORD.
003000*    IF A KEY VALUE IS PROVIDED WHICH DOES NOT MATCH ANY RECORD IN
003100*    THE FILE THEN THE INVALID KEY PATH IS EXPECTED TO BE TAKEN.
003200*
003300*       REFERENCE    AMERICAN NATIONAL STANDARD
003400*                    PROGRAMMING LANGUAGE COBOL, X3.23-1985.
003500*                    SECTION IX, INDEX I-O, THE START
003600*                    STATEMENT.  PARAGRAPHS 4.7.3 (2), (3), (4);
003700*                                           4.7.4 (1), (4), (5),
003800*                                           (10)   AND
003900*                    THE REDEFINES CLAUSE PAGE VI-39 5.10.4 (1),
004000*                                                          (2).
004100*
004200*    BEFORE EACH TEST THE RECORD KEY IS LOAD WITH A KEY VALUE
004300*    WHICH MAY OR MAY NOT BE A VALID KEY FOR THE FILE.  ALSO
004400*    BEFORE EACH STEP IN A TEST AN INITIALIZATION PROCEDURE MAY OR
004500*    MAY NOT BE PERFORMED WHICH MAKES AVAILABLE RECORD NUMBER 200.
004600*    IF DURING THIS PROCEDURE AN INVALID KEY OCCURS THE TEST IS
004700*    DELETED.
004800*
004900*    BEFORE EACH SECTION A INDEXED FILE IS CREATED CONTAINING TWO
005000*    ALTERNATE KEY AND THE ONE REQUIRED RECORD KEY FOR THE FILE.
005100*    IMMEDIATELY FOLLOWING FILE CREATION THE FILE IS READ AND THE
005200*    RECORDS OF THE FILE VERIFIED FOR ACCURACY.  NEXT THE TESTS
005300*    ARE EXECUTED USING THE READ, DELETE, REWRITE, and START
005400*    STATEMENTS.
005500*
005600*    THE RECORDS IN THE FILE ARE CREATED IN SEQUENTIAL ORDER BY
005700*    RECORD KEY VALUE.  FOLLOWING IS A SAMPLE OF THE DATA CONTENTS
005800*    FOR THE RECORD KEY AND TWO ALTERNATE RECORD KEYS IN THE FILE.
005900*
006000*  REC-NO RECORD-KEY     ALTERNATE-KEY-1      ALTERNATE-KEY-2
006100*  ------ ----------     ---------------      ---------------
006200*  001   BBBBBBBBBC002  EEEEEEEEEF002ALTKEY1  WWWWWWWWWV398ALTKEY2
006300*  002   BBBBBBBBCC004  EEEEEEEEFF004ALTKEY1  WWWWWWWWVV396ALTKEY2
006400*  003   BBBBBBBCCC006  EEEEEEEFFF006ALTKEY1  WWWWWWWVVV394ALTKEY2
006500*   .          .                  .                     .
006600*   .          .                  .                     .
006700*   .          .                  .                     .
006800*  010   CCCCCCCCCC020  FFFFFFFFFF020ALTKEY1  VVVVVVVVVV380ALTKEY2
006900*  011   CCCCCCCCCD022  FFFFFFFFFG022ALTKEY1  VVVVVVVVVV380ALTKEY2
007000*  012   CCCCCCCCDD024  FFFFFFFFGG024ALTKEY1  VVVVVVVVUU376ALTKEY2
007100*   .          .                  .                     .
007200*   .          .                  .                     .
007300*   .          .                  .                     .
007400*  200   UUUUUUUUUU400  YYYYYYYYYY400ALTKEY1   DDDDDDDDDD000ALTKEY
007500*
007600*   NOTE 1 - ALTERNATE-KEY-2 CONTAINS DUPLICATE KEYS EVERY 10TH
007700*            AND 11TH RECORDS.
007800*
007900*   NOTE 2 - THE FIRST 50 RECORDS AND LAST 25 RECORDS OF THE FILE
008000*            FOLLOW THE ABOVE SEQUENTIAL KEY PATTERN.  FOR THE
008100*            MIDDEL 125 RECORDS ONLY THE NUMBER PART OF THE KEYS
008200*            ARE VARIED AND VARIED IN THE SEQUENCE SHOWN ABOVE.
008300*            THAT IS, RECORD KEY AND ALTERNATE-KEY-1 ARE
008400*            INCREMENTED BY 2 ANDT THE ALTERNATE KEY-2 IS
008500*            DECREMENTED BY 2 EACH TIME A RECORD IS WRITTEN TO THE
008600*            FILE.  THE FILE IS DESIGNED TO BE LARGE ENOUGH SO
008700*            THAT AN I-O OPERATION IS REQUIRED FOR EACH RECORD
008800*            ACCESSED FROM THE FILE.
008900*
009000*   X-CARD'S WHICH MUST BE REPLACED WITH IMPLEMENTOR-NAMES' IN
009100*   THIS PROGRAM ARE:
009200*
009300*            X-24      IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR
009400*                        INDEXED FILE-1.
009500*            X-25      IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR
009600*                        INDEXED FILE-2.
009700*            X-26      IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR
009800*                        INDEXED FILE-3.
009900*            X-44      SYSTEM-NAME IN ASSIGN TO CLAUSE FOR INDEXED
010000*                        FILE-1 IF NEEDED.
010100*            X-45      SYSTEM-NAME IN ASSIGN TO CLAUSE FOR INDEXED
010200*                        FILE-2 IF NEEDED.
010300*            X-46      SYSTEM-NAME IN ASSIGN TO CLAUSE FOR INDEXED
010400*                        FILE-3 IF NEEDED.
010500*            X-55      SYSTEM PRINTER.
010600*            X-62   FOR RAW-DATA
010700*            X-82      SOURCE-COMPUTER.
010800*            X-83      OBJECT-COMPUTER.
010900*
011000******************************************************************
011100*
011200 ENVIRONMENT DIVISION.
011300 CONFIGURATION SECTION.
011400 SOURCE-COMPUTER.
011500     XXXXX082.
011600 OBJECT-COMPUTER.
011700     XXXXX083
011800          PROGRAM COLLATING SEQUENCE IS FOR-INX-START-TEST.
011900 SPECIAL-NAMES.
012000     ALPHABET
012100     FOR-INX-START-TEST IS "WVUTSRJIHGFEDCB".
012200 INPUT-OUTPUT SECTION.
012300 FILE-CONTROL.
012400P    SELECT RAW-DATA   ASSIGN TO
012500P    XXXXX062
012600P           ORGANIZATION IS INDEXED
012700P           ACCESS MODE IS RANDOM
012800P           RECORD KEY IS RAW-DATA-KEY.
012900     SELECT PRINT-FILE ASSIGN TO
013000     XXXXX055.
013100     SELECT  IX-FD1
013200     ASSIGN TO
013300     XXXXX024
013400J    XXXXX044
013500        ACCESS MODE IS DYNAMIC
013600        RECORD KEY IS IX-FD1-KEY
013700        ALTERNATE RECORD KEY IS IX-FD1-ALTKEY1
013800        ALTERNATE RECORD KEY IS IX-FD1-ALTKEY2 WITH DUPLICATES
013900        ORGANIZATION IS INDEXED.
014000     SELECT  IX-FD2
014100     ASSIGN TO
014200     XXXXX025
014300J    XXXXX045
014400        ACCESS MODE IS DYNAMIC
014500        ORGANIZATION IS INDEXED
014600        RECORD KEY IS IX-FD2-KEY
014700        ALTERNATE RECORD KEY IS IX-FD2-ALTKEY1
014800        ALTERNATE RECORD KEY IS IX-FD2-ALTKEY2 WITH DUPLICATES
014900                .
015000     SELECT  IX-FD3
015100     ASSIGN TO
015200     XXXXX026
015300J    XXXXX046
015400        ACCESS MODE IS DYNAMIC
015500        ORGANIZATION IS INDEXED
015600        RECORD KEY IS IX-FD3-KEY IN IX-FD3-RECKEY-AREA
015700        ALTERNATE RECORD KEY IS IX-FD3-KEY OF
015800         IX-FD3-ALTKEY1-AREA
015900        ALTERNATE RECORD KEY IS IX-FD3-KEY
016000         IN IX-FD3-ALTKEY2-AREA
016100        WITH DUPLICATES
016200              .
016300 DATA DIVISION.
016400 FILE SECTION.
016500P
016600PFD  RAW-DATA.
016700P
016800P01  RAW-DATA-SATZ.
016900P    05  RAW-DATA-KEY        PIC X(6).
017000P    05  C-DATE              PIC 9(6).
017100P    05  C-TIME              PIC 9(8).
017200P    05  C-NO-OF-TESTS       PIC 99.
017300P    05  C-OK                PIC 999.
017400P    05  C-ALL               PIC 999.
017500P    05  C-FAIL              PIC 999.
017600P    05  C-DELETED           PIC 999.
017700P    05  C-INSPECT           PIC 999.
017800P    05  C-NOTE              PIC X(13).
017900P    05  C-INDENT            PIC X.
018000P    05  C-ABORT             PIC X(8).
018100 FD  PRINT-FILE.
018200 01  PRINT-REC PICTURE X(120).
018300 01  DUMMY-RECORD PICTURE X(120).
018400 FD  IX-FD1
018500C    LABEL RECORDS ARE STANDARD
018600C    DATA RECORD IS IX-FD1R1-F-G-240
018700     RECORD CONTAINS 240 CHARACTERS.
018800 01  IX-FD1R1-F-G-240.
018900     05 IX-FD1-REC-120           PICTURE X(120).
019000     05 IX-FD1-REC-121-240.
019100        10 FILLER                PICTURE X(8).
019200        10 IX-REC-KEY-AREA.
019300           15 IX-FD1-KEY.
019400              20 IX-FD1-KEY-1-10.
019500                 25 IX-FD1-KEY-1-5      PICTURE X(5).
019600                 25 IX-FD1-KEY-6-10     PICTURE X(5).
019700               20 IX-FD1-KEY-11-13      PICTURE X(3).
019800           15 IX-REDF-RECKEY REDEFINES IX-FD1-KEY.
019900              20 R-RECKEY-1-7    PICTURE X(7).
020000              20 R-REDF-RECKEY-1-7 REDEFINES R-RECKEY-1-7.
020100                 25 R-RECKEY-1-5        PICTURE X(5).
020200                 25 R-RECKEY-6-7        PICTURE XX.
020300              20 R-RECKEY-8-13   PICTURE X(6).
020400           15 FILLER             PICTURE X(16).
020500        10 FILLER                PICTURE X(9).
020600        10 IX-ALT-KEY1-AREA.
020700           15 IX-FD1-ALTKEY1.
020800              20 IX-FDW-ALTKEY1-1-10.
020900                 25 IX-FDW-ALTKEY1-1-5  PICTURE X(5).
021000                 25 IX-FDW-ALTKEY1-6-10 PICTURE X(5).
021100              20 IX-FDW-ALTKEY1-11-13   PICTURE X(3).
021200              20 IX-FDW-ALTKEY1-14-20   PICTURE X(7).
021300           15 IX-REDF-ALTKEY1 REDEFINES IX-FD1-ALTKEY1.
021400              20 R-ALTKEY1-1-6   PICTURE X(6).
021500              20 R-REDF-ALTKEY1-1-6 REDEFINES R-ALTKEY1-1-6.
021600                 25 R-ALTKEY1-1-4       PICTURE X(4).
021700                 25 R-ALTKEY1-5-6       PICTURE XX.
021800              20 R-ALTKEY1-7-10  PICTURE X(4).
021900              20 R-ALTKEY1-11-20 PICTURE X(10).
022000           15 FILLER             PICTURE X(9).
022100        10 FILLER                PICTURE X(9).
022200        10 IX-ALT-KEY2-AREA.
022300           15 IX-FD1-ALTKEY2.
022400              20 IX-FDW-ALTKEY2-1-10.
022500                 25 IX-FDW-ALTKEY2-1-5  PICTURE X(5).
022600                 25 IX-FDW-ALTKEY2-6-10 PICTURE X(5).
022700              20 IX-FDW-ALTKEY2-11-13   PICTURE X(3).
022800              20 IX-FDW-ALTKEY2-14-20   PICTURE X(7).
022900           15 IX-REDF-ALTKEY2 REDEFINES IX-FD1-ALTKEY2.
023000              20 R-ALTKEY2-1-3          PICTURE XXX.
023100              20 R-REDF-ALTKEY2-1-3 REDEFINES R-ALTKEY2-1-3.
023200                 25 R-ALTKEY2-1-2       PICTURE XX.
023300                 25 R-ALTKEY2-3-3       PICTURE X.
023400              20 R-ALTKEY2-4-20         PICTURE X(17).
023500           15 FILLER             PICTURE X(9).
023600        10 FILLER                PICTURE X(7).
023700 FD  IX-FD2
023800C    LABEL RECORDS ARE STANDARD
023900C    DATA RECORD IS IX-FD2R1-F-G-241
024000     BLOCK CONTAINS 4 RECORDS
024100     RECORD CONTAINS 241 CHARACTERS.
024200 01  IX-FD2R1-F-G-241.
024300   03 IX-FD2-REC-241.
024400     05 IX-FD2-REC-120           PICTURE X(120).
024500     05 IX-FD2-REC-121-241.
024600        10 IX-FD2-RECKEY-AREA    PICTURE X(37).
024700        10 IX-FD2-RECKEY-AREA2 REDEFINES IX-FD2-RECKEY-AREA.
024800           15 IX-FD2-RECKEY-AREA2-1  PICTURE X(23).
024900           15 IX-FD2-RECKEY-AREA2-2  PICTURE X(14).
025000        10 IX-FD2-RECKEY-AREA3 REDEFINES IX-FD2-RECKEY-AREA.
025100           15 FILLER             PICTURE X(8).
025200           15 IX-FD2-KEY         PICTURE X(13).
025300           15 FILLER             PICTURE X(16).
025400        10 IX-FD2-RECKEY-AREA4 REDEFINES IX-FD2-RECKEY-AREA.
025500           15 FILLER             PICTURE X(8).
025600           15 IX-FD2-RECKEY-REDF PICTURE X(13).
025700           15 IX-FD2-RECKEY-REDF2 REDEFINES IX-FD2-RECKEY-REDF.
025800              20 IX-FD2-RECKEY-1-6  PICTURE X(6).
025900              20 IX-FD2-RECKEY-7-13  PICTURE X(7).
026000           15 FILLER             PICTURE X(16).
026100        10 FILLER                PICTURE X(9).
026200        10 IX-FD2-ALTKEY1-AREA   PICTURE X(29).
026300        10 IX-FD2-ALTKEY1-AREA2 REDEFINES IX-FD2-ALTKEY1-AREA.
026400           15 IX-FD2-ALTKEY1-1-6  PICTURE X(6).
026500           15 IX-FD2-ALTKEY1-7-20  PICTURE X(14).
026600           15 FILLER             PICTURE X(9).
026700        10 IX-FD2-ALTKEY1-AREA3 REDEFINES IX-FD2-ALTKEY1-AREA.
026800           15 IX-FD2-ALTKEY1.
026900              20 IX-FD2-ALTKEY1-10  PICTURE X(10).
027000              20 IX-FD2-ALTKEY1-11-20  PICTURE X(10).
027100           15 IX-FD2-REDF-ALTKEY1 REDEFINES IX-FD2-ALTKEY1.
027200              20 IX-FD2-ALTKEY1-1-5   PICTURE X(5).
027300              20 IX-FD2-ALTKEY1-6-20  PICTURE X(15).
027400           15 FILLER             PICTURE X(9).
027500        10 FILLER                PICTURE X(9).
027600        10 IX-FD2-ALTKEY2-AREA   PICTURE X(29).
027700        10 IX-FD2-ALTKEY2-AREA2 REDEFINES IX-FD2-ALTKEY2-AREA.
027800           15 IX-FD2-ALTKEY2     PICTURE X(20).
027900           15 FILLER             PICTURE X(9).
028000        10 IX-FD2-ALTKEY2-AREA3 REDEFINES IX-FD2-ALTKEY2-AREA.
028100           15 IX-FD2-ALTKEY2-1-6  PICTURE X(6).
028200           15 IX-FD2-REDF-ALTKEY2-1-6
028300              REDEFINES IX-FD2-ALTKEY2-1-6.
028400              20 IX-FD2-ALTKEY2-1-3  PICTURE XXX.
028500              20 IX-FD2-ALTKEY2-4-6  PICTURE XXX.
028600           15 IX-FD2-ALTKEY2-7-20  PICTURE X(14).
028700           15 FILLER             PICTURE X(9).
028800        10 FILLER                PICTURE X(8).
028900    03  IX-FD2-REC-241-240 REDEFINES IX-FD2-REC-241.
029000       05 IX-FD2-REC-240   PIC X(240).
029100       05 FILLER           PIC X.
029200 FD  IX-FD3
029300C    LABEL RECORDS ARE STANDARD
029400C    DATA RECORD IS IX-FD3R1-F-G-242
029500     RECORD CONTAINS 242 CHARACTERS
029600     BLOCK CONTAINS 1694 CHARACTERS.
029700 01  IX-FD3R1-F-G-242.
029800   03 IX-FD3-REC-242.
029900     05 IX-FD3-REC-120           PICTURE X(120).
030000     05 IX-FD3-REC-121-242.
030100        10 FILLER                PICTURE X(8).
030200        10 IX-FD3-RECKEY-AREA.
030300           15 IX-FD3-KEY         PICTURE X(13).
030400        10 FILLER                PICTURE X(25).
030500        10 IX-FD3-ALTKEY1-AREA.
030600           15 IX-FD3-KEY         PICTURE X(20).
030700        10 FILLER                PICTURE X(18).
030800        10 IX-FD3-ALTKEY2-AREA.
030900           15 IX-FD3-KEY         PICTURE X(20).
031000        10 FILLER                PICTURE X(18).
031100     03  IX-FD3-REC-240 REDEFINES IX-FD3-REC-242.
031200       05  IX-FD3-240            PICTURE X(240).
031300       05  FILLER                PICTURE XX.
031400
031500
031600 WORKING-STORAGE SECTION.
031700 01  WRK-FDW-RECKEY.
031800     05 FDW-RECKEY-1-13.
031900        10 FDW-RECKEY-1-10       PICTURE X(10).
032000        10 FDW-RECKEY-11-13      PICTURE 9(3).
032100     05 FILLER                   PICTURE X(16)  VALUE SPACE.
032200 01  WRK-FDW-ALTKEY1.
032300      05 FDW-ALTKEY1-1-20.
032400       10  FDW-ALTKEY1-1-10.
032500        15 FDW-ALTKEY1-1-5       PICTURE X(5).
032600        15 FDW-ALTKEY1-6-10      PICTURE X(5).
032700       10 FDW-ALTKEY1-11-13      PICTURE 9(3).
032800       10 FDW-ALTKEY1-14-20      PICTURE X(7).
032900     05 FILLER                   PICTURE X(9)  VALUE SPACE.
033000 01  WRK-FDW-ALTKEY2.
033100     05 FDW-ALTKEY2-1-20.
033200        10 FDW-ALTKEY2-1-10.
033300           15 FDW-ALTKEY2-1-5    PICTURE X(5).
033400           15 FDW-ALTKEY2-6-10   PICTURE X(5).
033500        10 FDW-ALTKEY2-11-13     PICTURE 9(3).
033600        10 FDW-ALTKEY2-14-20     PICTURE X(7).
033700     05 FILLER                   PICTURE X(9) VALUE SPACE.
033800 01  RECNO                       PICTURE 9(5)  VALUE ZERO.
033900 01  EXCUT-COUNTER-06V00         PICTURE 9(6) VALUE ZERO.
034000 01  KEYSUB                      PICTURE 9(3) COMPUTATIONAL.
034100 01  INVKEY-COUNTER              PICTURE 9(3) COMPUTATIONAL.
034200 01  RECORDS-WRITTEN             PICTURE 9(3).
034300 01  RECKEY-NUM                  PICTURE 9(3).
034400 01  ALTKEY1-NUM                 PICTURE 9(3).
034500 01  ALTKEY2-NUM                 PICTURE 9(3).
034600 01  FAIL-SW                     PICTURE 9 VALUE ZERO.
034700 01  RECORD-KEY-CONTENT.
034800     05 FILLER PIC X(53) VALUE
034900          "BBBBBBBBBC002EEEEEEEEEF002ALTKEY1WWWWWWWWWV398ALTKEY2".
035000     05 FILLER PIC X(53) VALUE
035100          "BBBBBBBBCC004EEEEEEEEFF004ALTKEY1WWWWWWWWVV396ALTKEY2".
035200     05 FILLER PIC X(53) VALUE
035300          "BBBBBBBCCC006EEEEEEEFFF006ALTKEY1WWWWWWWVVV394ALTKEY2".
035400     05 FILLER PIC X(53) VALUE
035500          "BBBBBBCCCC008EEEEEEFFFF008ALTKEY1WWWWWWVVVV392ALTKEY2".
035600     05 FILLER PIC X(53) VALUE
035700          "BBBBBCCCCC010EEEEEFFFFF010ALTKEY1WWWWWVVVVV390ALTKEY2".
035800     05 FILLER PIC X(53) VALUE
035900          "BBBBCCCCCC012EEEEFFFFFF012ALTKEY1WWWWVVVVVV388ALTKEY2".
036000     05 FILLER PIC X(53) VALUE
036100          "BBBCCCCCCC014EEEFFFFFFF014ALTKEY1WWWVVVVVVV386ALTKEY2".
036200     05 FILLER PIC X(53) VALUE
036300          "BBCCCCCCCC016EEFFFFFFFF016ALTKEY1WWVVVVVVVV384ALTKEY2".
036400     05 FILLER PIC X(53) VALUE
036500          "BCCCCCCCCC018EFFFFFFFFF018ALTKEY1WVVVVVVVVV382ALTKEY2".
036600     05 FILLER PIC X(53) VALUE
036700          "CCCCCCCCCC020FFFFFFFFFF020ALTKEY1VVVVVVVVVV380ALTKEY2".
036800     05 FILLER PIC X(53) VALUE
036900          "CCCCCCCCCD022FFFFFFFFFG022ALTKEY1VVVVVVVVVV380ALTKEY2".
037000     05 FILLER PIC X(53) VALUE
037100          "CCCCCCCCDD024FFFFFFFFGG024ALTKEY1VVVVVVVVUU376ALTKEY2".
037200     05 FILLER PIC X(53) VALUE
037300          "CCCCCCCDDD026FFFFFFFGGG026ALTKEY1VVVVVVVUUU374ALTKEY2".
037400     05 FILLER PIC X(53) VALUE
037500          "CCCCCCDDDD028FFFFFFGGGG028ALTKEY1VVVVVVUUUU372ALTKEY2".
037600     05 FILLER PIC X(53) VALUE
037700          "CCCCCDDDDD030FFFFFGGGGG030ALTKEY1VVVVVUUUUU370ALTKEY2".
037800     05 FILLER PIC X(53) VALUE
037900          "CCCCDDDDDD032FFFFGGGGGG032ALTKEY1VVVVUUUUUU368ALTKEY2".
038000     05 FILLER PIC X(53) VALUE
038100          "CCCDDDDDDD034FFFGGGGGGG034ALTKEY1VVVUUUUUUU366ALTKEY2".
038200     05 FILLER PIC X(53) VALUE
038300          "CCDDDDDDDD036FFGGGGGGGG036ALTKEY1VVUUUUUUUU364ALTKEY2".
038400     05 FILLER PIC X(53) VALUE
038500          "CDDDDDDDDD038FGGGGGGGGG038ALTKEY1VUUUUUUUUU362ALTKEY2".
038600     05 FILLER PIC X(53) VALUE
038700          "DDDDDDDDDD040GGGGGGGGGG040ALTKEY1UUUUUUUUUU360ALTKEY2".
038800     05 FILLER PIC X(53) VALUE
038900          "DDDDDDDDDE042GGGGGGGGGH042ALTKEY1UUUUUUUUUU360ALTKEY2".
039000     05 FILLER PIC X(53) VALUE
039100          "DDDDDDDDEE044GGGGGGGGHH044ALTKEY1UUUUUUUUTT356ALTKEY2".
039200     05 FILLER PIC X(53) VALUE
039300          "DDDDDDDEEE046GGGGGGGHHH046ALTKEY1UUUUUUUTTT354ALTKEY2".
039400     05 FILLER PIC X(53) VALUE
039500          "DDDDDDEEEE048GGGGGGHHHH048ALTKEY1UUUUUUTTTT352ALTKEY2".
039600     05 FILLER PIC X(53) VALUE
039700          "DDDDDEEEEE050GGGGGHHHHH050ALTKEY1UUUUUTTTTT350ALTKEY2".
039800     05 FILLER PIC X(53) VALUE
039900          "DDDDEEEEEE052GGGGHHHHHH052ALTKEY1UUUUTTTTTT348ALTKEY2".
040000     05 FILLER PIC X(53) VALUE
040100          "DDDEEEEEEE054GGGHHHHHHH054ALTKEY1UUUTTTTTTT346ALTKEY2".
040200     05 FILLER PIC X(53) VALUE
040300          "DDEEEEEEEE056GGHHHHHHHH056ALTKEY1UUTTTTTTTT344ALTKEY2".
040400     05 FILLER PIC X(53) VALUE
040500          "DEEEEEEEEE058GHHHHHHHHH058ALTKEY1UTTTTTTTTT342ALTKEY2".
040600     05 FILLER PIC X(53) VALUE
040700          "EEEEEEEEEE060HHHHHHHHHH060ALTKEY1TTTTTTTTTT340ALTKEY2".
040800     05 FILLER PIC X(53) VALUE
040900          "EEEEEEEEEF062HHHHHHHHHI062ALTKEY1TTTTTTTTTT340ALTKEY2".
041000     05 FILLER PIC X(53) VALUE
041100          "EEEEEEEEFF064HHHHHHHHII064ALTKEY1TTTTTTTTSS336ALTKEY2".
041200     05 FILLER PIC X(53) VALUE
041300          "EEEEEEEFFF066HHHHHHHIII066ALTKEY1TTTTTTTSSS334ALTKEY2".
041400     05 FILLER PIC X(53) VALUE
041500          "EEEEEEFFFF068HHHHHHIIII068ALTKEY1TTTTTTSSSS332ALTKEY2".
041600     05 FILLER PIC X(53) VALUE
041700          "EEEEEFFFFF070HHHHHIIIII070ALTKEY1TTTTTSSSSS330ALTKEY2".
041800     05 FILLER PIC X(53) VALUE
041900          "EEEEFFFFFF072HHHHIIIIII072ALTKEY1TTTTSSSSSS328ALTKEY2".
042000     05 FILLER PIC X(53) VALUE
042100          "EEEFFFFFFF074HHHIIIIIII074ALTKEY1TTTSSSSSSS326ALTKEY2".
042200     05 FILLER PIC X(53) VALUE
042300          "EEFFFFFFFF076HHIIIIIIII076ALTKEY1TTSSSSSSSS324ALTKEY2".
042400     05 FILLER PIC X(53) VALUE
042500          "EFFFFFFFFF078HIIIIIIIII078ALTKEY1TSSSSSSSSS322ALTKEY2".
042600     05 FILLER PIC X(53) VALUE
042700          "FFFFFFFFFF080IIIIIIIIII080ALTKEY1SSSSSSSSSS320ALTKEY2".
042800     05 FILLER PIC X(53) VALUE
042900          "FFFFFFFFFG082IIIIIIIIIJ082ALTKEY1SSSSSSSSSS320ALTKEY2".
043000     05 FILLER PIC X(53) VALUE
043100          "FFFFFFFFGG084IIIIIIIIJJ084ALTKEY1SSSSSSSSRR316ALTKEY2".
043200     05 FILLER PIC X(53) VALUE
043300          "FFFFFFFGGG086IIIIIIIJJJ086ALTKEY1SSSSSSSRRR314ALTKEY2".
043400     05 FILLER PIC X(53) VALUE
043500          "FFFFFFGGGG088IIIIIIJJJJ088ALTKEY1SSSSSSRRRR312ALTKEY2".
043600     05 FILLER PIC X(53) VALUE
043700          "FFFFFGGGGG090IIIIIJJJJJ090ALTKEY1SSSSSRRRRR310ALTKEY2".
043800     05 FILLER PIC X(53) VALUE
043900          "FFFFGGGGGG092IIIIJJJJJJ092ALTKEY1SSSSRRRRRR308ALTKEY2".
044000     05 FILLER PIC X(53) VALUE
044100          "FFFGGGGGGG094IIIJJJJJJJ094ALTKEY1SSSRRRRRRR306ALTKEY2".
044200     05 FILLER PIC X(53) VALUE
044300          "FFGGGGGGGG096IIJJJJJJJJ096ALTKEY1SSRRRRRRRR304ALTKEY2".
044400     05 FILLER PIC X(53) VALUE
044500          "FGGGGGGGGG098IJJJJJJJJJ098ALTKEY1SRRRRRRRRR302ALTKEY2".
044600     05 FILLER PIC X(53) VALUE
044700          "GGGGGGGGGG100JJJJJJJJJJ100ALTKEY1RRRRRRRRRR300ALTKEY2".
044800     05 FILLER PIC X(53) VALUE
044900          "RRRRSSSSSS352VVVVWWWWWW352ALTKEY1GGGGFFFFFF048ALTKEY2".
045000     05 FILLER PIC X(53) VALUE
045100          "RRRSSSSSSS354VVVWWWWWWW354ALTKEY1GGGFFFFFFF046ALTKEY2".
045200     05 FILLER PIC X(53) VALUE
045300          "RRSSSSSSSS356VVWWWWWWWW356ALTKEY1GGFFFFFFFF044ALTKEY2".
045400     05 FILLER PIC X(53) VALUE
045500          "RSSSSSSSSS358VWWWWWWWWW358ALTKEY1GFFFFFFFFF042ALTKEY2".
045600     05 FILLER PIC X(53) VALUE
045700          "SSSSSSSSSS360WWWWWWWWWW360ALTKEY1FFFFFFFFFF040ALTKEY2".
045800     05 FILLER PIC X(53) VALUE
045900          "SSSSSSSSST362WWWWWWWWWX362ALTKEY1FFFFFFFFFF040ALTKEY2".
046000     05 FILLER PIC X(53) VALUE
046100          "SSSSSSSSTT364WWWWWWWWXX364ALTKEY1FFFFFFFFEE036ALTKEY2".
046200     05 FILLER PIC X(53) VALUE
046300          "SSSSSSSTTT366WWWWWWWXXX366ALTKEY1FFFFFFFEEE034ALTKEY2".
046400     05 FILLER PIC X(53) VALUE
046500          "SSSSSSTTTT368WWWWWWXXXX368ALTKEY1FFFFFFEEEE032ALTKEY2".
046600     05 FILLER PIC X(53) VALUE
046700          "SSSSSTTTTT370WWWWWXXXXX370ALTKEY1FFFFFEEEEE030ALTKEY2".
046800     05 FILLER PIC X(53) VALUE
046900          "SSSSTTTTTT372WWWWXXXXXX372ALTKEY1FFFFEEEEEE028ALTKEY2".
047000     05 FILLER PIC X(53) VALUE
047100          "SSSTTTTTTT374WWWXXXXXXX374ALTKEY1FFFEEEEEEE026ALTKEY2".
047200     05 FILLER PIC X(53) VALUE
047300          "SSTTTTTTTT376WWXXXXXXXX376ALTKEY1FFEEEEEEEE024ALTKEY2".
047400     05 FILLER PIC X(53) VALUE
047500          "STTTTTTTTT378WXXXXXXXXX378ALTKEY1FEEEEEEEEE022ALTKEY2".
047600     05 FILLER PIC X(53) VALUE
047700          "TTTTTTTTTT380XXXXXXXXXX380ALTKEY1EEEEEEEEEE020ALTKEY2".
047800     05 FILLER PIC X(53) VALUE
047900          "TTTTTTTTTU382XXXXXXXXXY382ALTKEY1EEEEEEEEEE020ALTKEY2".
048000     05 FILLER PIC X(53) VALUE
048100          "TTTTTTTTUU384XXXXXXXXYY384ALTKEY1EEEEEEEEDD016ALTKEY2".
048200     05 FILLER PIC X(53) VALUE
048300          "TTTTTTTUUU386XXXXXXXYYY386ALTKEY1EEEEEEEDDD014ALTKEY2".
048400     05 FILLER PIC X(53) VALUE
048500          "TTTTTTUUUU388XXXXXXYYYY388ALTKEY1EEEEEEDDDD012ALTKEY2".
048600     05 FILLER PIC X(53) VALUE
048700          "TTTTTUUUUU390XXXXXYYYYY390ALTKEY1EEEEEDDDDD010ALTKEY2".
048800     05 FILLER PIC X(53) VALUE
048900          "TTTTUUUUUU392XXXXYYYYYY392ALTKEY1EEEEDDDDDD008ALTKEY2".
049000     05 FILLER PIC X(53) VALUE
049100          "TTTUUUUUUU394XXXYYYYYYY394ALTKEY1EEEDDDDDDD006ALTKEY2".
049200     05 FILLER PIC X(53) VALUE
049300          "TTUUUUUUUU396XXYYYYYYYY396ALTKEY1EEDDDDDDDD004ALTKEY2".
049400     05 FILLER PIC X(53) VALUE
049500          "TUUUUUUUUU398XYYYYYYYYY398ALTKEY1EDDDDDDDDD002ALTKEY2".
049600     05 FILLER PIC X(53) VALUE
049700          "UUUUUUUUUU400YYYYYYYYYY400ALTKEY1DDDDDDDDDD000ALTKEY2".
049800 01  RECORD-KEY-DATA   REDEFINES  RECORD-KEY-CONTENT.
049900     05 KEY-VALUES                  OCCURS 75  TIMES.
050000       10 RECKEY-VALUE           PICTURE X(13).
050100       10 ALTKEY1-VALUE          PICTURE X(20).
050200       10 ALTKEY2-VALUE          PICTURE X(20).
050300 01  INIT-FLAG                   PICTURE 9.
050400 01  FILE-RECORD-INFORMATION-REC.
050500     03 FILE-RECORD-INFO-SKELETON.
050600        05 FILLER                 PICTURE X(48)       VALUE
050700             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
050800        05 FILLER                 PICTURE X(46)       VALUE
050900             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
051000        05 FILLER                 PICTURE X(26)       VALUE
051100             ",LFIL=000000,ORG=  ,LBLR= ".
051200        05 FILLER                 PICTURE X(37)       VALUE
051300             ",RECKEY=                             ".
051400        05 FILLER                 PICTURE X(38)       VALUE
051500             ",ALTKEY1=                             ".
051600        05 FILLER                 PICTURE X(38)       VALUE
051700             ",ALTKEY2=                             ".
051800        05 FILLER                 PICTURE X(7)        VALUE SPACE.
051900     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
052000        05 FILE-RECORD-INFO-P1-120.
052100           07 FILLER              PIC X(5).
052200           07 XFILE-NAME           PIC X(6).
052300           07 FILLER              PIC X(8).
052400           07 XRECORD-NAME         PIC X(6).
052500           07 FILLER              PIC X(1).
052600           07 REELUNIT-NUMBER     PIC 9(1).
052700           07 FILLER              PIC X(7).
052800           07 XRECORD-NUMBER       PIC 9(6).
052900           07 FILLER              PIC X(6).
053000           07 UPDATE-NUMBER       PIC 9(2).
053100           07 FILLER              PIC X(5).
053200           07 ODO-NUMBER          PIC 9(4).
053300           07 FILLER              PIC X(5).
053400           07 XPROGRAM-NAME        PIC X(5).
053500           07 FILLER              PIC X(7).
053600           07 XRECORD-LENGTH       PIC 9(6).
053700           07 FILLER              PIC X(7).
053800           07 CHARS-OR-RECORDS    PIC X(2).
053900           07 FILLER              PIC X(1).
054000           07 XBLOCK-SIZE          PIC 9(4).
054100           07 FILLER              PIC X(6).
054200           07 RECORDS-IN-FILE     PIC 9(6).
054300           07 FILLER              PIC X(5).
054400           07 XFILE-ORGANIZATION   PIC X(2).
054500           07 FILLER              PIC X(6).
054600           07 XLABEL-TYPE          PIC X(1).
054700        05 FILE-RECORD-INFO-P121-240.
054800           07 FILLER              PIC X(8).
054900           07 XRECORD-KEY          PIC X(29).
055000           07 FILLER              PIC X(9).
055100           07 ALTERNATE-KEY1      PIC X(29).
055200           07 FILLER              PIC X(9).
055300           07 ALTERNATE-KEY2      PIC X(29).
055400           07 FILLER              PIC X(7).
055500 01  TEST-RESULTS.
055600     02 FILLER                   PIC X      VALUE SPACE.
055700     02 FEATURE                  PIC X(20)  VALUE SPACE.
055800     02 FILLER                   PIC X      VALUE SPACE.
055900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
056000     02 FILLER                   PIC X      VALUE SPACE.
056100     02  PAR-NAME.
056200       03 FILLER                 PIC X(19)  VALUE SPACE.
056300       03  PARDOT-X              PIC X      VALUE SPACE.
056400       03 DOTVALUE               PIC 99     VALUE ZERO.
056500     02 FILLER                   PIC X(8)   VALUE SPACE.
056600     02 RE-MARK                  PIC X(61).
056700 01  TEST-COMPUTED.
056800     02 FILLER                   PIC X(30)  VALUE SPACE.
056900     02 FILLER                   PIC X(17)  VALUE
057000            "       COMPUTED=".
057100     02 COMPUTED-X.
057200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
057300     03 COMPUTED-N               REDEFINES COMPUTED-A
057400                                 PIC -9(9).9(9).
057500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
057600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
057700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
057800     03       CM-18V0 REDEFINES COMPUTED-A.
057900         04 COMPUTED-18V0                    PIC -9(18).
058000         04 FILLER                           PIC X.
058100     03 FILLER PIC X(50) VALUE SPACE.
058200 01  TEST-CORRECT.
058300     02 FILLER PIC X(30) VALUE SPACE.
058400     02 FILLER PIC X(17) VALUE "       CORRECT =".
058500     02 CORRECT-X.
058600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
058700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
058800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
058900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
059000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
059100     03      CR-18V0 REDEFINES CORRECT-A.
059200         04 CORRECT-18V0                     PIC -9(18).
059300         04 FILLER                           PIC X.
059400     03 FILLER PIC X(2) VALUE SPACE.
059500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
059600 01  CCVS-C-1.
059700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
059800-    "SS  PARAGRAPH-NAME
059900-    "       REMARKS".
060000     02 FILLER                     PIC X(20)    VALUE SPACE.
060100 01  CCVS-C-2.
060200     02 FILLER                     PIC X        VALUE SPACE.
060300     02 FILLER                     PIC X(6)     VALUE "TESTED".
060400     02 FILLER                     PIC X(15)    VALUE SPACE.
060500     02 FILLER                     PIC X(4)     VALUE "FAIL".
060600     02 FILLER                     PIC X(94)    VALUE SPACE.
060700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
060800 01  REC-CT                        PIC 99       VALUE ZERO.
060900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
061000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
061100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
061200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
061300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
061400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
061500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
061600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
061700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
061800 01  CCVS-H-1.
061900     02  FILLER                    PIC X(39)    VALUE SPACES.
062000     02  FILLER                    PIC X(42)    VALUE
062100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
062200     02  FILLER                    PIC X(39)    VALUE SPACES.
062300 01  CCVS-H-2A.
062400   02  FILLER                        PIC X(40)  VALUE SPACE.
062500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
062600   02  FILLER                        PIC XXXX   VALUE
062700     "4.2 ".
062800   02  FILLER                        PIC X(28)  VALUE
062900            " COPY - NOT FOR DISTRIBUTION".
063000   02  FILLER                        PIC X(41)  VALUE SPACE.
063100
063200 01  CCVS-H-2B.
063300   02  FILLER                        PIC X(15)  VALUE
063400            "TEST RESULT OF ".
063500   02  TEST-ID                       PIC X(9).
063600   02  FILLER                        PIC X(4)   VALUE
063700            " IN ".
063800   02  FILLER                        PIC X(12)  VALUE
063900     " HIGH       ".
064000   02  FILLER                        PIC X(22)  VALUE
064100            " LEVEL VALIDATION FOR ".
064200   02  FILLER                        PIC X(58)  VALUE
064300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
064400 01  CCVS-H-3.
064500     02  FILLER                      PIC X(34)  VALUE
064600            " FOR OFFICIAL USE ONLY    ".
064700     02  FILLER                      PIC X(58)  VALUE
064800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
064900     02  FILLER                      PIC X(28)  VALUE
065000            "  COPYRIGHT   1985 ".
065100 01  CCVS-E-1.
065200     02 FILLER                       PIC X(52)  VALUE SPACE.
065300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
065400     02 ID-AGAIN                     PIC X(9).
065500     02 FILLER                       PIC X(45)  VALUE SPACES.
065600 01  CCVS-E-2.
065700     02  FILLER                      PIC X(31)  VALUE SPACE.
065800     02  FILLER                      PIC X(21)  VALUE SPACE.
065900     02 CCVS-E-2-2.
066000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
066100         03 FILLER                   PIC X      VALUE SPACE.
066200         03 ENDER-DESC               PIC X(44)  VALUE
066300            "ERRORS ENCOUNTERED".
066400 01  CCVS-E-3.
066500     02  FILLER                      PIC X(22)  VALUE
066600            " FOR OFFICIAL USE ONLY".
066700     02  FILLER                      PIC X(12)  VALUE SPACE.
066800     02  FILLER                      PIC X(58)  VALUE
066900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
067000     02  FILLER                      PIC X(13)  VALUE SPACE.
067100     02 FILLER                       PIC X(15)  VALUE
067200             " COPYRIGHT 1985".
067300 01  CCVS-E-4.
067400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
067500     02 FILLER                       PIC X(4)   VALUE " OF ".
067600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
067700     02 FILLER                       PIC X(40)  VALUE
067800      "  TESTS WERE EXECUTED SUCCESSFULLY".
067900 01  XXINFO.
068000     02 FILLER                       PIC X(19)  VALUE
068100            "*** INFORMATION ***".
068200     02 INFO-TEXT.
068300       04 FILLER                     PIC X(8)   VALUE SPACE.
068400       04 XXCOMPUTED                 PIC X(20).
068500       04 FILLER                     PIC X(5)   VALUE SPACE.
068600       04 XXCORRECT                  PIC X(20).
068700     02 INF-ANSI-REFERENCE           PIC X(48).
068800 01  HYPHEN-LINE.
068900     02 FILLER  PIC IS X VALUE IS SPACE.
069000     02 FILLER  PIC IS X(65)    VALUE IS "************************
069100-    "*****************************************".
069200     02 FILLER  PIC IS X(54)    VALUE IS "************************
069300-    "******************************".
069400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
069500     "IX215A".
069600 PROCEDURE DIVISION.
069700 CCVS1 SECTION.
069800 OPEN-FILES.
069900P    OPEN I-O RAW-DATA.
070000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
070100P    READ RAW-DATA INVALID KEY GO TO END-E-1.
070200P    MOVE "ABORTED " TO C-ABORT.
070300P    ADD 1 TO C-NO-OF-TESTS.
070400P    ACCEPT C-DATE  FROM DATE.
070500P    ACCEPT C-TIME  FROM TIME.
070600P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
070700PEND-E-1.
070800P    CLOSE RAW-DATA.
070900     OPEN    OUTPUT PRINT-FILE.
071000     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
071100     MOVE    SPACE TO TEST-RESULTS.
071200     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
071300     MOVE    ZERO TO REC-SKL-SUB.
071400     PERFORM CCVS-INIT-FILE 9 TIMES.
071500 CCVS-INIT-FILE.
071600     ADD     1 TO REC-SKL-SUB.
071700     MOVE    FILE-RECORD-INFO-SKELETON
071800          TO FILE-RECORD-INFO (REC-SKL-SUB).
071900 CCVS-INIT-EXIT.
072000     GO TO CCVS1-EXIT.
072100 CLOSE-FILES.
072200P    OPEN I-O RAW-DATA.
072300P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
072400P    READ RAW-DATA INVALID KEY GO TO END-E-2.
072500P    MOVE "OK.     " TO C-ABORT.
072600P    MOVE PASS-COUNTER TO C-OK.
072700P    MOVE ERROR-HOLD   TO C-ALL.
072800P    MOVE ERROR-COUNTER TO C-FAIL.
072900P    MOVE DELETE-COUNTER TO C-DELETED.
073000P    MOVE INSPECT-COUNTER TO C-INSPECT.
073100P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
073200PEND-E-2.
073300P    CLOSE RAW-DATA.
073400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
073500 TERMINATE-CCVS.
073600S    EXIT PROGRAM.
073700STERMINATE-CALL.
073800     STOP     RUN.
073900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
074000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
074100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
074200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
074300     MOVE "****TEST DELETED****" TO RE-MARK.
074400 PRINT-DETAIL.
074500     IF REC-CT NOT EQUAL TO ZERO
074600             MOVE "." TO PARDOT-X
074700             MOVE REC-CT TO DOTVALUE.
074800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
074900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
075000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
075100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
075200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
075300     MOVE SPACE TO CORRECT-X.
075400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
075500     MOVE     SPACE TO RE-MARK.
075600 HEAD-ROUTINE.
075700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
075800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
075900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
076000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
076100 COLUMN-NAMES-ROUTINE.
076200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
076300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
076400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
076500 END-ROUTINE.
076600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
076700 END-RTN-EXIT.
076800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
076900 END-ROUTINE-1.
077000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
077100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
077200      ADD PASS-COUNTER TO ERROR-HOLD.
077300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
077400      MOVE PASS-COUNTER TO CCVS-E-4-1.
077500      MOVE ERROR-HOLD TO CCVS-E-4-2.
077600      MOVE CCVS-E-4 TO CCVS-E-2-2.
077700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
077800  END-ROUTINE-12.
077900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
078000     IF       ERROR-COUNTER IS EQUAL TO ZERO
078100         MOVE "NO " TO ERROR-TOTAL
078200         ELSE
078300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
078400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
078500     PERFORM WRITE-LINE.
078600 END-ROUTINE-13.
078700     IF DELETE-COUNTER IS EQUAL TO ZERO
078800         MOVE "NO " TO ERROR-TOTAL  ELSE
078900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
079000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
079100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
079200      IF   INSPECT-COUNTER EQUAL TO ZERO
079300          MOVE "NO " TO ERROR-TOTAL
079400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
079500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
079600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
079700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
079800 WRITE-LINE.
079900     ADD 1 TO RECORD-COUNT.
080000Y    IF RECORD-COUNT GREATER 42
080100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
080200Y        MOVE SPACE TO DUMMY-RECORD
080300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
080400Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
080500Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
080600Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
080700Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
080800Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
080900Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
081000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
081100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
081200Y        MOVE ZERO TO RECORD-COUNT.
081300     PERFORM WRT-LN.
081400 WRT-LN.
081500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
081600     MOVE SPACE TO DUMMY-RECORD.
081700 BLANK-LINE-PRINT.
081800     PERFORM WRT-LN.
081900 FAIL-ROUTINE.
082000     IF     COMPUTED-X NOT EQUAL TO SPACE
082100            GO TO   FAIL-ROUTINE-WRITE.
082200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
082300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
082400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
082500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
082600     MOVE   SPACES TO INF-ANSI-REFERENCE.
082700     GO TO  FAIL-ROUTINE-EX.
082800 FAIL-ROUTINE-WRITE.
082900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
083000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
083100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
083200     MOVE   SPACES TO COR-ANSI-REFERENCE.
083300 FAIL-ROUTINE-EX. EXIT.
083400 BAIL-OUT.
083500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
083600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
083700 BAIL-OUT-WRITE.
083800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
083900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
084000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
084100     MOVE   SPACES TO INF-ANSI-REFERENCE.
084200 BAIL-OUT-EX. EXIT.
084300 CCVS1-EXIT.
084400     EXIT.
084500 SECT-0001-IX215A SECTION.
084600 WRITE-INT-GF-01.
084700     OPEN    OUTPUT IX-FD1.
084800     MOVE    "IX-FD1" TO XFILE-NAME           (1).
084900     MOVE    "R1-F-G" TO  XRECORD-NAME        (1).
085000     MOVE    ZERO     TO  XRECORD-NUMBER      (1).
085100     MOVE    "RC"     TO  CHARS-OR-RECORDS    (1).
085200     MOVE "IX215"     TO  XPROGRAM-NAME       (1).
085300     MOVE    240      TO  XRECORD-LENGTH      (1).
085400     MOVE    001      TO  XBLOCK-SIZE         (1).
085500     MOVE    "IX"     TO  XFILE-ORGANIZATION  (1).
085600     MOVE    "S"      TO  XLABEL-TYPE         (1).
085700     MOVE    200      TO  RECORDS-IN-FILE     (1).
085800     MOVE    "CREATE-FILE-FD1" TO FEATURE.
085900     MOVE    "WRITE-TEST-GF-01" TO PAR-NAME.
086000     MOVE    ZERO TO KEYSUB.
086100     MOVE    ZERO TO INVKEY-COUNTER.
086200 WRITE-INIT-GF-01-01.
086300     PERFORM WRITE-TEST-GF-01-R1 50 TIMES.
086400     PERFORM WRITE-TEST-GF-01-R2 125 TIMES.
086500     PERFORM WRITE-TEST-GF-01-R1 25 TIMES.
086600     GO TO   WRITE-TEST-GF-01.
086700 WRITE-TEST-GF-01-R1.
086800     ADD     001  TO XRECORD-NUMBER (1).
086900     ADD     001  TO  KEYSUB.
087000     MOVE    RECKEY-VALUE (KEYSUB) TO FDW-RECKEY-1-13.
087100     MOVE    ALTKEY1-VALUE (KEYSUB) TO FDW-ALTKEY1-1-20.
087200     MOVE    ALTKEY2-VALUE (KEYSUB) TO FDW-ALTKEY2-1-20.
087300     MOVE    WRK-FDW-RECKEY   TO    XRECORD-KEY (1).
087400     MOVE    WRK-FDW-ALTKEY1  TO ALTERNATE-KEY1 (1).
087500     MOVE    WRK-FDW-ALTKEY2  TO ALTERNATE-KEY2 (1).
087600     MOVE    FILE-RECORD-INFO (1)  TO IX-FD1R1-F-G-240.
087700     WRITE   IX-FD1R1-F-G-240
087800                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
087900     ADD     001 TO  EXCUT-COUNTER-06V00.
088000 WRITE-TEST-GF-01-R2.
088100     ADD     002  TO FDW-RECKEY-11-13.
088200     ADD     002 TO FDW-ALTKEY1-11-13.
088300     SUBTRACT  002 FROM FDW-ALTKEY2-11-13.
088400     ADD     001  TO XRECORD-NUMBER (1).
088500     MOVE    WRK-FDW-RECKEY   TO    XRECORD-KEY (1).
088600     MOVE    WRK-FDW-ALTKEY1  TO ALTERNATE-KEY1 (1).
088700     MOVE    WRK-FDW-ALTKEY2  TO ALTERNATE-KEY2 (1).
088800     MOVE    FILE-RECORD-INFO (1) TO IX-FD1R1-F-G-240.
088900     WRITE   IX-FD1R1-F-G-240
089000                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
089100     ADD     001 TO EXCUT-COUNTER-06V00.
089200 WRITE-TEST-GF-01.
089300     SUBTRACT INVKEY-COUNTER FROM EXCUT-COUNTER-06V00
089400             GIVING RECORDS-WRITTEN.
089500     IF      RECORDS-WRITTEN EQUAL TO 200
089600             PERFORM  PASS
089700             MOVE "FILE IX-FD1 CREATED (200 RECORDS)" TO RE-MARK
089800     ELSE    PERFORM FAIL
089900             MOVE
090000       "IX-41;WRONG NUMBER OF RECORDS WRITTEN (MAY ALREADY EXIST)"
090100            TO  RE-MARK
090200             MOVE RECORDS-WRITTEN TO COMPUTED-18V0.
090300     GO TO   WRITE-TEST-GF-01-END.
090400 WRITE-DELETE-GF-01.
090500     PERFORM DE-LETE.
090600 WRITE-TEST-GF-01-END.
090700     PERFORM  PRINT-DETAIL.
090800     CLOSE   IX-FD1.
090900 READ-INIT-F1-01.
091000     OPEN    INPUT  IX-FD1.
091100     MOVE    "READ-TEST-F1-01" TO PAR-NAME.
091200     MOVE    "READ FILE IX-FD1" TO FEATURE.
091300     MOVE    ZERO TO EXCUT-COUNTER-06V00.
091400     MOVE    02   TO RECKEY-NUM.
091500     MOVE    002 TO ALTKEY1-NUM.
091600 READ-TEST-F1-01-R1.
091700     READ    IX-FD1 NEXT RECORD AT END  GO TO READ-TEST-F1-01.
091800     MOVE    IX-REC-KEY-AREA TO WRK-FDW-RECKEY.
091900     MOVE    IX-ALT-KEY1-AREA TO WRK-FDW-ALTKEY1.
092000     IF      FDW-RECKEY-11-13 EQUAL TO RECKEY-NUM
092100             AND FDW-ALTKEY1-11-13 EQUAL TO ALTKEY1-NUM
092200             NEXT SENTENCE
092300             ELSE
092400             PERFORM  READ-FAIL-F1-01.
092500     IF      EXCUT-COUNTER-06V00 NOT LESS THAN 200
092600             GO TO READ-TEST-F1-01.
092700     ADD     001  TO EXCUT-COUNTER-06V00.
092800     ADD     002  TO RECKEY-NUM
092900     ADD     002  TO ALTKEY1-NUM.
093000     GO TO   READ-TEST-F1-01-R1.
093100 READ-TEST-F1-01.
093200     IF      FAIL-SW EQUAL TO 1 GO TO READ-EXIT-F1-01.
093300     IF      EXCUT-COUNTER-06V00 EQUAL TO 200
093400             PERFORM PASS
093500             MOVE "200 RECORDS VERIFIED" TO RE-MARK
093600     ELSE    PERFORM FAIL
093700     MOVE "INCORRECT NUMBER OF RECORDS; IX-41 OR IX-28" TO RE-MARK
093800             MOVE 200 TO CORRECT-18V0
093900             MOVE EXCUT-COUNTER-06V00 TO COMPUTED-18V0.
094000     PERFORM PRINT-DETAIL.
094100     GO TO   READ-EXIT-F1-01.
094200 READ-FAIL-F1-01.
094300     MOVE 1 TO FAIL-SW.
094400     PERFORM FAIL.
094500     MOVE    FDW-RECKEY-11-13  TO COMPUTED-18V0.
094600     MOVE    RECKEY-NUM  TO CORRECT-18V0.
094700     MOVE "READ-FAIL-F1-01; IX-41 OR IX-28" TO RE-MARK.
094800 READ-EXIT-F1-01.
094900     CLOSE   IX-FD1.
095000 START-INIT.
095100     OPEN    I-O  IX-FD1.
095200     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
095300     MOVE    "START-TEST-GF-01" TO PAR-NAME.
095400     MOVE    "START REDF REC-KEY" TO FEATURE.
095500     MOVE    "BBBBBBBBBC002" TO FDW-RECKEY-1-13.
095600     MOVE    WRK-FDW-RECKEY TO IX-REC-KEY-AREA.
095700 START-TEST-GF-01.
095800     DELETE  IX-FD1 INVALID KEY
095900             MOVE  "INVALID KEY (DELETE)" TO COMPUTED-A
096000             GO TO START-FAIL-GF-01.
096100     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
096200     IF      INIT-FLAG NOT EQUAL ZERO
096300             GO TO START-DELETE-GF-01.
096400     MOVE    "BBBBBBBBBC002" TO FDW-RECKEY-1-13.
096500     MOVE    WRK-FDW-RECKEY TO IX-REC-KEY-AREA.
096600     START   IX-FD1
096700                    KEY IS EQUAL TO IX-REDF-RECKEY
096800          INVALID KEY    PERFORM PASS
096900             MOVE "OK.; INVALID KEY ON START OF DELETED RECORD"
097000                  TO RE-MARK
097100             GO TO START-WRITE-GF-01.
097200     READ    IX-FD1 NEXT RECORD  AT END
097300             MOVE "AT END ON READ" TO COMPUTED-A
097400             GO TO START-FAIL-GF-01.
097500     MOVE    IX-FD1R1-F-G-240  TO  FILE-RECORD-INFO (1).
097600     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
097700 START-FAIL-GF-01.
097800     PERFORM FAIL.
097900     MOVE    "INVALID KEY ON START" TO CORRECT-A.
098000     MOVE "WRONG RECORD NUMBER FOUND; IX-28 OR IX-36" TO RE-MARK.
098100     GO TO   START-WRITE-GF-01.
098200 START-DELETE-GF-01.
098300     PERFORM DE-LETE.
098400 START-WRITE-GF-01.
098500     PERFORM PRINT-DETAIL.
098600 START-INIT-GF-02.
098700     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
098800     MOVE "START-TEST-GF-02" TO PAR-NAME.
098900     MOVE    "FGGGGGGGGG098" TO FDW-RECKEY-1-13.
099000     MOVE    WRK-FDW-RECKEY TO IX-REC-KEY-AREA.
099100 START-TEST-GF-02.
099200     DELETE  IX-FD1 INVALID KEY
099300             MOVE  "INVALID KEY (DELETE)" TO COMPUTED-A
099400             GO TO START-FAIL-GF-02.
099500     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
099600     IF      INIT-FLAG NOT EQUAL ZERO
099700             GO TO START-DELETE-GF-02.
099800     MOVE    "FGGGGGGAAA002" TO FDW-RECKEY-1-13.
099900     MOVE    WRK-FDW-RECKEY TO IX-REC-KEY-AREA.
100000     START   IX-FD1
100100                    KEY IS EQUAL TO R-RECKEY-1-7
100200          INVALID KEY    PERFORM PASS
100300             MOVE "OK.; INVALID KEY ON START OF DELETED RECORD"
100400                  TO RE-MARK
100500             GO TO START-WRITE-GF-02.
100600     READ    IX-FD1 NEXT RECORD  AT END
100700             MOVE "AT END ON READ" TO COMPUTED-A
100800             GO TO START-FAIL-GF-02.
100900     MOVE    IX-FD1R1-F-G-240  TO  FILE-RECORD-INFO (1).
101000     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
101100 START-FAIL-GF-02.
101200     PERFORM FAIL.
101300     MOVE    "INVALID KEY ON START" TO CORRECT-A.
101400     MOVE "IX-28 OR IX-36; WRONG RECORD NUMBER FOUND" TO RE-MARK.
101500     GO TO   START-WRITE-GF-02.
101600 START-DELETE-GF-02.
101700     PERFORM DE-LETE.
101800 START-WRITE-GF-02.
101900     PERFORM PRINT-DETAIL.
102000 START-INIT-GF-03.
102100     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
102200     MOVE "START-TEST-GF-03" TO PAR-NAME.
102300     MOVE    "UUUUUUUUUU400" TO FDW-RECKEY-1-13.
102400     MOVE    WRK-FDW-RECKEY TO IX-REC-KEY-AREA.
102500 START-TEST-GF-03.
102600     DELETE  IX-FD1 INVALID KEY
102700             MOVE  "INVALID KEY (DELETE)" TO COMPUTED-A
102800             GO TO START-FAIL-GF-03.
102900     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
103000     IF      INIT-FLAG NOT EQUAL ZERO
103100             GO TO START-DELETE-GF-03.
103200     MOVE    "UUUUURRRRR000" TO FDW-RECKEY-1-13.
103300     MOVE    WRK-FDW-RECKEY TO IX-REC-KEY-AREA.
103400     START   IX-FD1
103500                    KEY IS EQUAL TO R-RECKEY-1-5
103600          INVALID KEY    PERFORM PASS
103700             MOVE "OK.; INVALID KEY ON START OF DELETED RECORD"
103800                  TO RE-MARK
103900             GO TO START-WRITE-GF-03.
104000     READ    IX-FD1 NEXT RECORD  AT END
104100             MOVE "AT END ON READ" TO COMPUTED-A
104200             GO TO START-FAIL-GF-03.
104300     MOVE    IX-FD1R1-F-G-240  TO  FILE-RECORD-INFO (1).
104400     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
104500 START-FAIL-GF-03.
104600     PERFORM FAIL.
104700     MOVE    "INVALID KEY ON START" TO CORRECT-A.
104800     MOVE "WRONG RECORD NUMBER FOUND; IX-28 OR IX-36" TO RE-MARK.
104900     GO TO   START-WRITE-GF-03.
105000 START-DELETE-GF-03.
105100     PERFORM DE-LETE.
105200 START-WRITE-GF-03.
105300     PERFORM PRINT-DETAIL.
105400 START-INIT-GF-04.
105500     MOVE    "START REDF ALT-KEY-1" TO FEATURE.
105600     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
105700     MOVE "START-TEST-GF-04" TO PAR-NAME.
105800     MOVE    "TUUUUUUUUU398"  TO FDW-RECKEY-1-13.
105900     MOVE    WRK-FDW-RECKEY   TO IX-REC-KEY-AREA.
106000 START-TEST-GF-04.
106100     READ    IX-FD1
106200                     KEY IS IX-FD1-KEY
106300         INVALID KEY
106400     MOVE "ERROR IX-28 F2; INVALID KEY PATH TAKEN ON INITIAL READ"
106500                   TO RE-MARK
106600             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
106700             GO TO START-FAIL-GF-04.
106800     MOVE    IX-FD1R1-F-G-240 TO FILE-RECORD-INFO (3).
106900     IF      XRECORD-NUMBER (3) NOT EQUAL TO 199
107000     MOVE "WRONG RECORD NUMBER FOUND; IX-28 OR IX-36" TO RE-MARK
107100             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
107200             GO TO START-FAIL-GF-04.
107300     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
107400     IF      INIT-FLAG NOT EQUAL ZERO
107500             GO TO START-DELETE-GF-04.
107600     MOVE    "EEEEEEEEEE000ALTKEY1" TO ALTERNATE-KEY1 (3).
107700     MOVE    "WWWWWWWWWW400ALTKEY2" TO ALTERNATE-KEY2 (3).
107800     MOVE    FILE-RECORD-INFO (3) TO IX-FD1R1-F-G-240.
107900     REWRITE IX-FD1R1-F-G-240 INVALID KEY
108000             MOVE "ERROR IX-33; INVALID KEY PATH TAKEN ON REWRITE"
108100                    TO RE-MARK
108200             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
108300             GO TO START-FAIL-GF-04.
108400     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
108500     IF      INIT-FLAG NOT EQUAL ZERO
108600             GO TO START-FAIL-GF-04.
108700     MOVE    "EEEEEEEEEE000ALTKEY1"  TO FDW-ALTKEY1-1-20.
108800     MOVE    WRK-FDW-ALTKEY1  TO IX-ALT-KEY1-AREA.
108900     START   IX-FD1
109000                    KEY IS EQUAL TO IX-REDF-ALTKEY1
109100          INVALID KEY
109200             MOVE "ERROR IX-36; INVALID KEY PATH TAKEN ON START"
109300             TO RE-MARK
109400             MOVE  "INVALID KEY ON START" TO COMPUTED-A
109500             GO TO START-FAIL-GF-04.
109600     READ    IX-FD1 NEXT RECORD AT END
109700            MOVE "IX-28 F1; AT END ON READ AFTER START" TO RE-MARK
109800             MOVE "AT END ON READ" TO COMPUTED-A
109900             GO TO START-FAIL-GF-04.
110000     MOVE    IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
110100     IF      XRECORD-NUMBER (1) EQUAL TO 199
110200             PERFORM PASS
110300             GO TO START-WRITE-GF-04.
110400     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
110500     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
110600     MOVE    "EEEEEEEEEE000ALTKEY1"  TO CORRECT-A.
110700     MOVE "IX-28 F1; INCORRECT ALTERNATE RECORD KEY1"  TO RE-MARK.
110800     PERFORM PRINT-DETAIL.
110900     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY1"
111000             TO RE-MARK.
111100     MOVE XRECORD-NUMBER (1) TO COMPUTED-18V0.
111200 START-FAIL-GF-04.
111300     MOVE "START-TEST-GF-04" TO PAR-NAME.
111400     PERFORM FAIL.
111500     MOVE    199  TO CORRECT-18V0.
111600     GO TO   START-WRITE-GF-04.
111700 START-DELETE-GF-04.
111800     PERFORM DE-LETE.
111900 START-WRITE-GF-04.
112000     PERFORM PRINT-DETAIL.
112100 START-INIT-GF-05.
112200     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
112300     MOVE "START-TEST-GF-05" TO PAR-NAME.
112400     MOVE    "BCCCCCCCCC018"  TO FDW-RECKEY-1-13.
112500     MOVE    WRK-FDW-RECKEY   TO IX-REC-KEY-AREA.
112600 START-TEST-GF-05.
112700     READ    IX-FD1
112800                     KEY IS IX-FD1-KEY
112900         INVALID KEY
113000             MOVE "ERROR IX-33; INVALID KEY PATH TAKEN ON READ"
113100                    TO RE-MARK
113200             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
113300             GO TO START-FAIL-GF-05.
113400     MOVE    IX-FD1R1-F-G-240 TO FILE-RECORD-INFO (3).
113500     IF      XRECORD-NUMBER (3) NOT EQUAL TO 9
113600             MOVE 9 TO RECNO
113700             PERFORM DISPLAY-RECORD-KEYS
113800     MOVE "WRONG RECORD NUMBER FOUND; IX-28 OR IX-36" TO RE-MARK
113900             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
114000             GO TO START-FAIL-GF-05.
114100     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
114200     IF      INIT-FLAG NOT EQUAL ZERO
114300             GO TO START-DELETE-GF-05.
114400     MOVE    "AAAAAAAAAA400ALTKEY1" TO ALTERNATE-KEY1 (3).
114500     MOVE    "ZZZZZZZZZZ002ALTKEY2" TO ALTERNATE-KEY2 (3).
114600     MOVE    FILE-RECORD-INFO (3) TO IX-FD1R1-F-G-240.
114700     REWRITE IX-FD1R1-F-G-240 INVALID KEY
114800      MOVE "IX-33;  INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
114900             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
115000             GO TO START-FAIL-GF-05.
115100     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
115200     IF      INIT-FLAG NOT EQUAL ZERO
115300             GO TO START-FAIL-GF-05.
115400     MOVE    "AAAAAANNNN200ALTKEY1"  TO FDW-ALTKEY1-1-20.
115500     MOVE    WRK-FDW-ALTKEY1  TO IX-ALT-KEY1-AREA.
115600     START   IX-FD1
115700                    KEY IS EQUAL TO R-ALTKEY1-1-6
115800          INVALID KEY
115900      MOVE "IX-36; INVALID KEY ON START OF REWRITTEN RECORD"
116000             TO RE-MARK
116100             MOVE  "INVALID KEY ON START" TO COMPUTED-A
116200             GO TO START-FAIL-GF-05.
116300     READ    IX-FD1 NEXT RECORD AT END
116400      MOVE "IX-28 F1; AT END ON READ AFTER START" TO RE-MARK
116500             MOVE "AT END ON READ" TO COMPUTED-A
116600             GO TO START-FAIL-GF-05.
116700     MOVE    IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
116800     IF      XRECORD-NUMBER (1) EQUAL TO 9
116900             PERFORM PASS
117000             GO TO START-WRITE-GF-05.
117100     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
117200     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
117300     MOVE    "AAAAAAAAAA400ALTKEY1"  TO CORRECT-A.
117400     MOVE    "INCORRECT ALTERNATE RECORD KEY1"  TO RE-MARK.
117500     PERFORM PRINT-DETAIL.
117600     MOVE "IX-28 F1;WRONG RECORD NUMB FOUND READ ALTERN. REC KEY1"
117700             TO RE-MARK.
117800     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
117900 START-FAIL-GF-05.
118000     PERFORM FAIL.
118100     MOVE    9  TO CORRECT-18V0.
118200     GO TO   START-WRITE-GF-05.
118300 START-DELETE-GF-05.
118400     PERFORM DE-LETE.
118500 START-WRITE-GF-05.
118600     PERFORM PRINT-DETAIL.
118700 START-INIT-GF-06.
118800     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
118900     MOVE "START-TEST-GF-06" TO PAR-NAME.
119000     MOVE    "GGGGGGGGGG100"  TO FDW-RECKEY-1-13.
119100     MOVE    WRK-FDW-RECKEY   TO IX-REC-KEY-AREA.
119200 START-TEST-GF-06.
119300     READ    IX-FD1
119400                     KEY IS IX-FD1-KEY
119500         INVALID KEY
119600             MOVE "ERROR IX-28; INVALID KEY PATH TAKEN ON READ"
119700                    TO RE-MARK
119800             GO TO START-FAIL-GF-06.
119900     MOVE    IX-FD1R1-F-G-240 TO FILE-RECORD-INFO (3).
120000     IF      XRECORD-NUMBER (3) NOT EQUAL TO 50
120100             MOVE 50 TO RECNO
120200             MOVE  "WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
120300             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
120400             GO TO START-FAIL-GF-06.
120500     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
120600     IF      INIT-FLAG NOT EQUAL ZERO
120700             GO TO START-DELETE-GF-06.
120800     MOVE    "AAGGGGGGGG100ALTKEY1" TO ALTERNATE-KEY1 (3).
120900     MOVE    "GGGGGGGGGG100ALTKEY2" TO ALTERNATE-KEY2 (3).
121000     MOVE    FILE-RECORD-INFO (3) TO IX-FD1R1-F-G-240.
121100     REWRITE IX-FD1R1-F-G-240 INVALID KEY
121200             MOVE "ERROR IX-33; INVALID KEY PATH TAKEN ON REWRITE"
121300                    TO RE-MARK
121400             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
121500             GO TO START-FAIL-GF-06.
121600
121700     IF      INIT-FLAG NOT EQUAL ZERO
121800             GO TO START-FAIL-GF-06.
121900     MOVE    "AAGGZZZZZZ100ALTKEY1"  TO FDW-ALTKEY1-1-20.
122000     MOVE    WRK-FDW-ALTKEY1  TO IX-ALT-KEY1-AREA.
122100     START   IX-FD1
122200                    KEY IS EQUAL TO R-ALTKEY1-1-4
122300          INVALID KEY
122400             MOVE "ERROR IX-36; INVALID KEY PATH TAKEN ON START"
122500                    TO RE-MARK
122600             MOVE "INVALID KEY ON START OF REWRITTEN RECORD"
122700             TO RE-MARK
122800             MOVE  "INVALID KEY ON START" TO COMPUTED-A
122900             GO TO START-FAIL-GF-06.
123000     READ    IX-FD1 NEXT RECORD AT END
123100           MOVE "IX-28 F1; AT END ON READ AFTER START" TO RE-MARK
123200             MOVE "AT END ON READ" TO COMPUTED-A
123300             GO TO START-FAIL-GF-06.
123400     MOVE    IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
123500     IF      XRECORD-NUMBER (1) EQUAL TO 50
123600             PERFORM PASS
123700             GO TO START-WRITE-GF-06.
123800     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
123900     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
124000     MOVE    "AAGGGGGGGG100ALTKEY1"  TO CORRECT-A.
124100     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY1" TO RE-MARK.
124200     PERFORM PRINT-DETAIL.
124300     MOVE "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY1"
124400             TO RE-MARK.
124500     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
124600 START-FAIL-GF-06.
124700     PERFORM FAIL.
124800     MOVE    50  TO CORRECT-18V0.
124900     GO TO   START-WRITE-GF-06.
125000 START-DELETE-GF-06.
125100     PERFORM DE-LETE.
125200 START-WRITE-GF-06.
125300     PERFORM PRINT-DETAIL.
125400 START-INIT-GF-07.
125500     MOVE    "START REDF ALT-KEY-2" TO FEATURE.
125600     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
125700     MOVE "START-TEST-GF-07" TO PAR-NAME.
125800     MOVE    "DDDDDEEEEE050"  TO FDW-RECKEY-1-13.
125900     MOVE    WRK-FDW-RECKEY   TO IX-REC-KEY-AREA.
126000 START-TEST-GF-07.
126100     READ    IX-FD1
126200                     KEY IS IX-FD1-KEY
126300         INVALID KEY
126400      MOVE "IX-28 F2; INVALID KEY PATH TAKEN ON INITIAL READ"
126500                   TO RE-MARK
126600             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
126700             GO TO START-FAIL-GF-07.
126800     MOVE    IX-FD1R1-F-G-240 TO FILE-RECORD-INFO (3).
126900     IF      XRECORD-NUMBER (3) NOT EQUAL TO 25
127000             MOVE 25 TO RECNO
127100             PERFORM DISPLAY-RECORD-KEYS
127200     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
127300             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
127400             GO TO START-FAIL-GF-07.
127500     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
127600     IF      INIT-FLAG NOT EQUAL ZERO
127700             GO TO START-DELETE-GF-07.
127800     MOVE    "BCBCBCBCBC200ALTKEY1" TO ALTERNATE-KEY1 (3).
127900     MOVE    "CBCBCBCBCB100ALTKEY2" TO ALTERNATE-KEY2 (3).
128000     MOVE    FILE-RECORD-INFO (3) TO IX-FD1R1-F-G-240.
128100     REWRITE IX-FD1R1-F-G-240 INVALID KEY
128200     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
128300             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
128400             GO TO START-FAIL-GF-07.
128500     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
128600     IF      INIT-FLAG NOT EQUAL ZERO
128700             GO TO START-FAIL-GF-07.
128800     MOVE    "CBCBCBCBCB100ALTKEY2"  TO FDW-ALTKEY2-1-20.
128900     MOVE    WRK-FDW-ALTKEY2  TO IX-ALT-KEY2-AREA.
129000     START   IX-FD1
129100                    KEY IS EQUAL TO IX-REDF-ALTKEY2
129200          INVALID KEY
129300     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
129400             TO RE-MARK
129500             MOVE  "INVALID KEY ON START" TO COMPUTED-A
129600             GO TO START-FAIL-GF-07.
129700     READ    IX-FD1 NEXT RECORD AT END
129800      MOVE "IX-28; F1 AT END ON READ AFTER START" TO RE-MARK
129900             MOVE "AT END ON READ" TO COMPUTED-A
130000             GO TO START-FAIL-GF-07.
130100     MOVE    IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
130200     IF      XRECORD-NUMBER (1) EQUAL TO 25
130300             PERFORM PASS
130400             GO TO START-WRITE-GF-07.
130500     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
130600     MOVE    FDW-ALTKEY2-1-20  TO COMPUTED-A.
130700     MOVE    "CBCBCBCBCB100ALTKEY2"  TO CORRECT-A.
130800     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY2" TO RE-MARK.
130900     PERFORM PRINT-DETAIL.
131000     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY2"
131100             TO RE-MARK.
131200     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
131300 START-FAIL-GF-07.
131400     PERFORM FAIL.
131500     MOVE    25  TO CORRECT-18V0.
131600     GO TO   START-WRITE-GF-07.
131700 START-DELETE-GF-07.
131800     PERFORM DE-LETE.
131900 START-WRITE-GF-07.
132000     PERFORM PRINT-DETAIL.
132100 START-INIT-GF-08.
132200     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
132300     MOVE "START-TEST-GF-08" TO PAR-NAME.
132400     MOVE    "RRRRSSSSSS352"  TO FDW-RECKEY-1-13.
132500     MOVE    WRK-FDW-RECKEY   TO IX-REC-KEY-AREA.
132600 START-TEST-GF-08.
132700     READ    IX-FD1
132800                     KEY IS IX-FD1-KEY
132900         INVALID KEY
133000      MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
133100          TO RE-MARK
133200             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
133300             GO TO START-FAIL-GF-08.
133400     MOVE    IX-FD1R1-F-G-240 TO FILE-RECORD-INFO (3).
133500     IF      XRECORD-NUMBER (3) NOT EQUAL TO 176
133600             MOVE 51 TO RECNO
133700             PERFORM DISPLAY-RECORD-KEYS
133800     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
133900             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
134000             GO TO START-FAIL-GF-08.
134100     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
134200     IF      INIT-FLAG NOT EQUAL ZERO
134300             GO TO START-DELETE-GF-08.
134400     MOVE    "DCDCDCDCDC100ALTKEY1" TO ALTERNATE-KEY1 (3).
134500     MOVE    "DCDCDCDCDC100ALTKEY2" TO ALTERNATE-KEY2 (3).
134600     MOVE    FILE-RECORD-INFO (3) TO IX-FD1R1-F-G-240.
134700     REWRITE IX-FD1R1-F-G-240 INVALID KEY
134800     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
134900             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
135000             GO TO START-FAIL-GF-08.
135100     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
135200     IF      INIT-FLAG NOT EQUAL ZERO
135300             GO TO START-FAIL-GF-08.
135400     MOVE    "DCDAAAAAAA250ALTKEY2"  TO FDW-ALTKEY2-1-20.
135500     MOVE    WRK-FDW-ALTKEY2  TO IX-ALT-KEY2-AREA.
135600     START   IX-FD1
135700                    KEY IS EQUAL TO R-ALTKEY2-1-3
135800          INVALID KEY
135900     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
136000             TO RE-MARK
136100             MOVE  "INVALID KEY ON START" TO COMPUTED-A
136200             GO TO START-FAIL-GF-08.
136300     READ    IX-FD1 NEXT RECORD AT END
136400     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
136500             MOVE "AT END ON READ" TO COMPUTED-A
136600             GO TO START-FAIL-GF-08.
136700     MOVE    IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
136800     IF      XRECORD-NUMBER (1) EQUAL TO 176
136900             PERFORM PASS
137000             GO TO START-WRITE-GF-08.
137100     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
137200     MOVE    FDW-ALTKEY2-1-20  TO COMPUTED-A.
137300     MOVE    "DCDCDCDCDC100ALTKEY2"  TO CORRECT-A.
137400     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY2" TO RE-MARK.
137500     PERFORM PRINT-DETAIL.
137600     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY2"
137700             TO RE-MARK.
137800     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
137900 START-FAIL-GF-08.
138000     PERFORM FAIL.
138100     MOVE    176  TO CORRECT-18V0.
138200     GO TO   START-WRITE-GF-08.
138300 START-DELETE-GF-08.
138400     PERFORM DE-LETE.
138500 START-WRITE-GF-08.
138600     PERFORM PRINT-DETAIL.
138700 START-INIT-GF-09.
138800     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
138900     MOVE "START-TEST-GF-09" TO PAR-NAME.
139000     MOVE    "BBBBBBCCCC008"  TO FDW-RECKEY-1-13.
139100     MOVE    WRK-FDW-RECKEY   TO IX-REC-KEY-AREA.
139200 START-TEST-GF-09.
139300     READ    IX-FD1
139400                     KEY IS IX-FD1-KEY
139500         INVALID KEY
139600     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
139700                   TO RE-MARK
139800             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
139900             MOVE 4 TO CORRECT-18V0
140000             GO TO START-FAIL-GF-09.
140100     MOVE    IX-FD1R1-F-G-240 TO FILE-RECORD-INFO (3).
140200     IF      XRECORD-NUMBER (3) NOT EQUAL TO 4
140300             MOVE 4 TO RECNO
140400             PERFORM DISPLAY-RECORD-KEYS
140500     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
140600             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
140700             MOVE 4 TO CORRECT-18V0
140800             GO TO START-FAIL-GF-09.
140900     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
141000     IF      INIT-FLAG NOT EQUAL ZERO
141100             GO TO START-DELETE-GF-09.
141200     MOVE    "CDCDCDCDCD100ALTKEY1" TO ALTERNATE-KEY1 (3).
141300     MOVE    "DCDCDCDCDC100ALTKEY2" TO ALTERNATE-KEY2 (3).
141400     MOVE    FILE-RECORD-INFO (3) TO IX-FD1R1-F-G-240.
141500     REWRITE IX-FD1R1-F-G-240 INVALID KEY
141600     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
141700             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
141800             MOVE 4 TO CORRECT-18V0
141900             GO TO START-FAIL-GF-09.
142000     PERFORM START-INIT-FD1 THRU START-INIT-FD1-EXIT.
142100     IF      INIT-FLAG NOT EQUAL ZERO
142200             GO TO START-FAIL-GF-09.
142300     MOVE    "DCZZZZZZZZ400ALTKEY2"  TO FDW-ALTKEY2-1-20.
142400     MOVE    WRK-FDW-ALTKEY2  TO IX-ALT-KEY2-AREA.
142500     START   IX-FD1
142600                    KEY IS EQUAL TO R-ALTKEY2-1-2
142700          INVALID KEY
142800     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
142900             TO RE-MARK
143000             MOVE  "INVALID KEY ON START" TO COMPUTED-A
143100             MOVE 176 TO CORRECT-18V0
143200             GO TO START-FAIL-GF-09.
143300     READ    IX-FD1 NEXT RECORD AT END
143400     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
143500             MOVE "AT END ON READ" TO COMPUTED-A
143600             MOVE 176 TO CORRECT-18V0
143700             GO TO START-FAIL-GF-09.
143800     MOVE    IX-FD1R1-F-G-240  TO FILE-RECORD-INFO (1).
143900     IF      XRECORD-NUMBER (1) NOT EQUAL TO 176
144000             MOVE ALTERNATE-KEY2 (1) TO WRK-FDW-ALTKEY2
144100             MOVE FDW-ALTKEY2-1-20 TO COMPUTED-A
144200             MOVE "DCDCDCDCDC100" TO CORRECT-A
144300     MOVE
144400     "IX-28 OR IX-36; INCORR KEY FOUND ON FIRST READ DUPL KEYS"
144500             TO RE-MARK
144600             PERFORM PRINT-DETAIL
144700     MOVE "WRONG RECORD NUMBER FOUND ON FIRST READ DUPLICATE KEYS"
144800             TO RE-MARK
144900             MOVE XRECORD-NUMBER (1) TO COMPUTED-18V0
145000             MOVE 176 TO CORRECT-18V0
145100             GO TO START-FAIL-GF-09.
145200     READ    IX-FD1 NEXT RECORD AT END
145300     MOVE "IX-28;F1 AT END ON READ AFTER FIRST READ" TO RE-MARK
145400             MOVE "AT END ON READ" TO COMPUTED-A
145500             MOVE 4 TO CORRECT-18V0
145600             GO TO START-FAIL-GF-09.
145700     MOVE    IX-FD1R1-F-G-240 TO FILE-RECORD-INFO (1).
145800     IF      XRECORD-NUMBER (1) EQUAL TO 4
145900             PERFORM PASS
146000             PERFORM PRINT-DETAIL
146100             GO TO START-WRITE-GF-09.
146200     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
146300     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
146400     MOVE    "DCDCDCDCDC100ALTKEY2"  TO CORRECT-A.
146500     MOVE
146600     "IX-28OR IX-36; INCORR KEY FOUND ON SECOND READ DUPL.  KEYS"
146700             TO RE-MARK.
146800     PERFORM PRINT-DETAIL.
146900     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
147000     MOVE    4 TO CORRECT-18V0.
147100 START-FAIL-GF-09.
147200     PERFORM FAIL.
147300     GO TO   START-WRITE-GF-09.
147400 START-DELETE-GF-09.
147500     PERFORM DE-LETE.
147600 START-WRITE-GF-09.
147700     PERFORM PRINT-DETAIL.
147800 START-TERM-003.
147900     CLOSE   IX-FD1.
148000 WRITE-INT-GF-02.
148100     OPEN    OUTPUT IX-FD2.
148200     MOVE    "IX-FD2" TO XFILE-NAME           (1).
148300     MOVE    "R1-F-G" TO  XRECORD-NAME        (1).
148400     MOVE    ZERO     TO  XRECORD-NUMBER      (1).
148500     MOVE    "RC"     TO  CHARS-OR-RECORDS    (1).
148600     MOVE "IX215"     TO  XPROGRAM-NAME       (1).
148700     MOVE    241      TO  XRECORD-LENGTH      (1).
148800     MOVE    004      TO  XBLOCK-SIZE         (1).
148900     MOVE    "IX"     TO  XFILE-ORGANIZATION  (1).
149000     MOVE    "S"      TO  XLABEL-TYPE         (1).
149100     MOVE    200      TO  RECORDS-IN-FILE     (1).
149200     MOVE    "CREATE-FILE-FD2" TO FEATURE.
149300     MOVE    "WRITE-TEST-GF-02" TO PAR-NAME.
149400     MOVE    ZERO TO KEYSUB.
149500     MOVE    ZERO TO INVKEY-COUNTER.
149600     MOVE    ZERO TO EXCUT-COUNTER-06V00.
149700 WRITE-INIT-GF-02-01.
149800     PERFORM WRITE-TEST-GF-02-R1 50 TIMES.
149900     PERFORM WRITE-TEST-GF-02-R2 125 TIMES.
150000     PERFORM WRITE-TEST-GF-02-R1 25 TIMES.
150100     GO TO   WRITE-TEST-GF-02.
150200 WRITE-TEST-GF-02-R1.
150300     ADD     001  TO XRECORD-NUMBER (1).
150400     ADD     001  TO  KEYSUB.
150500     MOVE    RECKEY-VALUE (KEYSUB) TO FDW-RECKEY-1-13.
150600     MOVE    ALTKEY1-VALUE (KEYSUB) TO FDW-ALTKEY1-1-20.
150700     MOVE    ALTKEY2-VALUE (KEYSUB) TO FDW-ALTKEY2-1-20.
150800     MOVE    WRK-FDW-RECKEY   TO    XRECORD-KEY (1).
150900     MOVE    WRK-FDW-ALTKEY1  TO ALTERNATE-KEY1 (1).
151000     MOVE    WRK-FDW-ALTKEY2  TO ALTERNATE-KEY2 (1).
151100     MOVE    FILE-RECORD-INFO (1)  TO IX-FD2R1-F-G-241.
151200     WRITE   IX-FD2R1-F-G-241
151300                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
151400     ADD     001 TO  EXCUT-COUNTER-06V00.
151500 WRITE-TEST-GF-02-R2.
151600     ADD     002  TO FDW-RECKEY-11-13.
151700     ADD     002 TO FDW-ALTKEY1-11-13.
151800     SUBTRACT  002 FROM FDW-ALTKEY2-11-13.
151900     ADD     001  TO XRECORD-NUMBER (1).
152000     MOVE    WRK-FDW-RECKEY   TO    XRECORD-KEY (1).
152100     MOVE    WRK-FDW-ALTKEY1  TO ALTERNATE-KEY1 (1).
152200     MOVE    WRK-FDW-ALTKEY2  TO ALTERNATE-KEY2 (1).
152300     MOVE    FILE-RECORD-INFO (1) TO IX-FD2R1-F-G-241.
152400     WRITE   IX-FD2R1-F-G-241
152500                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
152600     ADD     001 TO EXCUT-COUNTER-06V00.
152700 WRITE-TEST-GF-02.
152800     SUBTRACT INVKEY-COUNTER FROM EXCUT-COUNTER-06V00
152900             GIVING RECORDS-WRITTEN.
153000     IF      RECORDS-WRITTEN EQUAL TO 200
153100             PERFORM  PASS
153200             MOVE "FILE IX-FD2 CREATED (200 RECORDS)" TO RE-MARK
153300     ELSE    PERFORM FAIL
153400             MOVE                                          "IX-41;
153500-       "WRONG NUMBER OF RECORDS WRITTEN (MAY ALREADY EXIST)"
153600             TO RE-MARK
153700             MOVE 200 TO CORRECT-18V0
153800             MOVE RECORDS-WRITTEN TO COMPUTED-18V0.
153900     GO TO   WRITE-TEST-GF-02-END.
154000 WRITE-DELETE-GF-02.
154100     PERFORM DE-LETE.
154200 WRITE-TEST-GF-02-END.
154300     PERFORM  PRINT-DETAIL.
154400     CLOSE   IX-FD2.
154500 READ-INIT-F1-02.
154600     OPEN    INPUT  IX-FD2.
154700     MOVE    "READ-TEST-F1-02" TO PAR-NAME.
154800     MOVE    "READ FILE IX-FD2" TO FEATURE.
154900     MOVE    ZERO TO EXCUT-COUNTER-06V00.
155000     MOVE    02   TO RECKEY-NUM.
155100     MOVE    002 TO ALTKEY1-NUM.
155200 READ-TEST-F1-02-R1.
155300     READ    IX-FD2 NEXT RECORD AT END  GO TO READ-TEST-F1-02.
155400     MOVE    IX-FD2-KEY TO FDW-RECKEY-1-13.
155500     MOVE    IX-FD2-ALTKEY1 TO FDW-ALTKEY1-1-20.
155600     IF      FDW-RECKEY-11-13 EQUAL TO RECKEY-NUM
155700             AND FDW-ALTKEY1-11-13 EQUAL TO ALTKEY1-NUM
155800             NEXT SENTENCE
155900             ELSE
156000             PERFORM  READ-FAIL-F1-02.
156100     IF      EXCUT-COUNTER-06V00 NOT LESS THAN 200
156200             GO TO READ-TEST-F1-02.
156300     ADD     001  TO EXCUT-COUNTER-06V00.
156400     ADD     002  TO RECKEY-NUM
156500     ADD     002  TO ALTKEY1-NUM.
156600     GO TO   READ-TEST-F1-02-R1.
156700 READ-TEST-F1-02.
156800     IF      FAIL-SW EQUAL TO 1 GO TO READ-EXIT-F1-02.
156900     IF      EXCUT-COUNTER-06V00 EQUAL TO 200
157000             PERFORM PASS
157100             MOVE "200 RECORDS VERIFIED" TO RE-MARK
157200     ELSE    PERFORM FAIL
157300             MOVE
157400          "INCORRECT NUMBER OF RECORDS; IX-28 OR IX-41" TO RE-MARK
157500             MOVE 200 TO CORRECT-18V0
157600             MOVE EXCUT-COUNTER-06V00 TO COMPUTED-18V0.
157700     PERFORM PRINT-DETAIL.
157800     GO TO   READ-EXIT-F1-02.
157900 READ-FAIL-F1-02.
158000     MOVE 1 TO FAIL-SW.
158100     PERFORM FAIL.
158200     MOVE    FDW-RECKEY-11-13  TO COMPUTED-18V0.
158300     MOVE    RECKEY-NUM  TO CORRECT-18V0.
158400     MOVE "NUM EMBEDDED IN RECKEY; IX-28 OR IX-41"  TO RE-MARK.
158500     PERFORM PRINT-DETAIL.
158600 READ-EXIT-F1-02.
158700     CLOSE   IX-FD2.
158800 START-INIT-GF-10.
158900     OPEN    I-O  IX-FD2.
159000     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
159100     MOVE "START-TEST-GF-10" TO PAR-NAME.
159200     MOVE    "START REDF REC-KEY" TO FEATURE.
159300     MOVE    "TTTTUUUUUU392" TO IX-FD2-KEY.
159400 START-TEST-GF-10.
159500     DELETE  IX-FD2 INVALID KEY
159600             MOVE  "INVALID KEY (DELETE)" TO COMPUTED-A
159700             GO TO START-FAIL-GF-10.
159800     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
159900     IF      INIT-FLAG NOT EQUAL ZERO
160000             GO TO START-DELETE-GF-10.
160100     MOVE    "TTTTUUUUUU392" TO IX-FD2-KEY.
160200     START   IX-FD2 KEY IS EQUAL TO IX-FD2-KEY
160300             INVALID KEY  PERFORM PASS
160400             GO TO START-WRITE-GF-10.
160500     READ    IX-FD2 NEXT RECORD  AT END
160600             MOVE "AT END ON READ" TO COMPUTED-A
160700             GO TO START-FAIL-GF-10.
160800     MOVE    IX-FD2-REC-240    TO  FILE-RECORD-INFO (1).
160900     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
161000 START-FAIL-GF-10.
161100     PERFORM FAIL.
161200     MOVE    "INVALID KEY ON START" TO CORRECT-A.
161300     MOVE "IX-36; WRONG RECORD NUMBER FOUND" TO RE-MARK.
161400     GO TO   START-WRITE-GF-10.
161500 START-DELETE-GF-10.
161600     PERFORM DE-LETE.
161700 START-WRITE-GF-10.
161800     PERFORM PRINT-DETAIL.
161900 START-INIT-GF-11.
162000     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
162100     MOVE "START-TEST-GF-11" TO PAR-NAME.
162200     MOVE    "FFFFFGGGGG090" TO IX-FD2-KEY.
162300 START-TEST-GF-11.
162400     DELETE  IX-FD2 INVALID KEY
162500             MOVE  "INVALID KEY (DELETE)" TO COMPUTED-A
162600             GO TO START-FAIL-GF-11.
162700     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
162800     IF      INIT-FLAG NOT EQUAL ZERO
162900             GO TO START-DELETE-GF-11.
163000     MOVE    "FFFFFGGGGG090" TO IX-FD2-KEY.
163100     START   IX-FD2 KEY IS EQUAL TO IX-FD2-RECKEY-REDF
163200             INVALID KEY  PERFORM PASS
163300     MOVE "OK.;    INVALID KEY ON START OF DELETED RECORD"
163400                  TO RE-MARK
163500             GO TO START-WRITE-GF-11.
163600     READ    IX-FD2 NEXT RECORD  AT END
163700             MOVE "AT END ON READ" TO COMPUTED-A
163800             GO TO START-FAIL-GF-11.
163900     MOVE    IX-FD2-REC-240    TO  FILE-RECORD-INFO (1).
164000     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
164100 START-FAIL-GF-11.
164200     PERFORM FAIL.
164300     MOVE    "INVALID KEY ON START" TO CORRECT-A.
164400     MOVE "IX-28 OR IX-36; WRONG RECORD NUMBER FOUND" TO RE-MARK.
164500     GO TO   START-WRITE-GF-11.
164600 START-DELETE-GF-11.
164700     PERFORM DE-LETE.
164800 START-WRITE-GF-11.
164900     PERFORM PRINT-DETAIL.
165000 START-INIT-GF-12.
165100     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
165200     MOVE "START-TEST-GF-12" TO PAR-NAME.
165300     MOVE    "BBBBCCCCCC012" TO IX-FD2-KEY.
165400 START-TEST-GF-12.
165500     DELETE  IX-FD2 INVALID KEY
165600             MOVE  "INVALID KEY (DELETE)" TO COMPUTED-A
165700             GO TO START-FAIL-GF-12.
165800     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
165900     IF      INIT-FLAG NOT EQUAL ZERO
166000             GO TO START-DELETE-GF-12.
166100     MOVE    "BBBBCCDDDD015" TO IX-FD2-KEY.
166200     START   IX-FD2
166300                    KEY IS EQUAL TO IX-FD2-RECKEY-1-6
166400          INVALID KEY    PERFORM PASS
166500             MOVE "OK.; INVALID KEY ON START OF DELETED RECORD"
166600                  TO RE-MARK
166700             GO TO START-WRITE-GF-12.
166800     READ    IX-FD2 NEXT RECORD  AT END
166900             MOVE "AT END ON READ" TO COMPUTED-A
167000             GO TO START-FAIL-GF-12.
167100     MOVE    IX-FD2-REC-240    TO  FILE-RECORD-INFO (1).
167200     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
167300 START-FAIL-GF-12.
167400     PERFORM FAIL.
167500     MOVE    "INVALID KEY ON START" TO CORRECT-A.
167600     MOVE    "WRONG RECORD NUMBER FOUND" TO RE-MARK.
167700     GO TO   START-WRITE-GF-12.
167800 START-DELETE-GF-12.
167900     PERFORM DE-LETE.
168000 START-WRITE-GF-12.
168100     PERFORM PRINT-DETAIL.
168200 START-INIT-GF-13.
168300     MOVE    "START REDF ALT-KEY-1" TO FEATURE.
168400     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
168500     MOVE "START-TEST-GF-13" TO PAR-NAME.
168600     MOVE    "RSSSSSSSSS358"  TO IX-FD2-KEY.
168700 START-TEST-GF-13.
168800     READ    IX-FD2
168900                     KEY IS IX-FD2-KEY
169000         INVALID KEY
169100     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
169200                   TO RE-MARK
169300             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
169400             GO TO START-FAIL-GF-13.
169500     MOVE    IX-FD2-REC-240   TO FILE-RECORD-INFO (3).
169600     IF      XRECORD-NUMBER (3) NOT EQUAL TO 179
169700             MOVE 54 TO RECNO
169800             PERFORM DISPLAY-RECORD-KEYS
169900             MOVE  "WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
170000             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
170100             GO TO START-FAIL-GF-13.
170200     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
170300     IF      INIT-FLAG NOT EQUAL ZERO
170400             GO TO START-DELETE-GF-13.
170500     MOVE    "EEEEEEEEEE000ALTKEY1" TO ALTERNATE-KEY1 (3).
170600     MOVE    "WWWWWWWWWW400ALTKEY2" TO ALTERNATE-KEY2 (3).
170700     MOVE    FILE-RECORD-INFO (3) TO IX-FD2R1-F-G-241.
170800     REWRITE IX-FD2R1-F-G-241 INVALID KEY
170900     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
171000             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
171100             GO TO START-FAIL-GF-13.
171200     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
171300     IF      INIT-FLAG NOT EQUAL ZERO
171400             GO TO START-FAIL-GF-13.
171500     MOVE    "EEEEEEEEEE000ALTKEY1"  TO IX-FD2-ALTKEY1.
171600     START   IX-FD2
171700                    KEY IS EQUAL TO IX-FD2-ALTKEY1
171800          INVALID KEY
171900     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
172000             TO RE-MARK
172100             MOVE  "INVALID KEY ON START" TO COMPUTED-A
172200             GO TO START-FAIL-GF-13.
172300     READ    IX-FD2 NEXT RECORD AT END
172400     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
172500             MOVE "AT END ON READ" TO COMPUTED-A
172600             GO TO START-FAIL-GF-13.
172700     MOVE    IX-FD2-REC-240    TO FILE-RECORD-INFO (1).
172800     IF      XRECORD-NUMBER (1) EQUAL TO 179
172900             PERFORM PASS
173000             GO TO START-WRITE-GF-13.
173100     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
173200     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
173300     MOVE    "EEEEEEEEEE000ALTKEY1"  TO CORRECT-A.
173400     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY1" TO RE-MARK.
173500     PERFORM PRINT-DETAIL.
173600     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY1"
173700             TO RE-MARK.
173800     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
173900 START-FAIL-GF-13.
174000     PERFORM FAIL.
174100     MOVE    179  TO CORRECT-18V0.
174200     GO TO   START-WRITE-GF-13.
174300 START-DELETE-GF-13.
174400     PERFORM DE-LETE.
174500 START-WRITE-GF-13.
174600     PERFORM PRINT-DETAIL.
174700 START-INIT-GF-14.
174800     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
174900     MOVE "START-TEST-GF-14" TO PAR-NAME.
175000     MOVE    "TTUUUUUUUU396"  TO IX-FD2-KEY.
175100 START-TEST-GF-14.
175200     READ    IX-FD2
175300                     KEY IS IX-FD2-KEY
175400         INVALID KEY
175500     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
175600                   TO RE-MARK
175700             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
175800             GO TO START-FAIL-GF-14.
175900     MOVE    IX-FD2-REC-240   TO FILE-RECORD-INFO (3).
176000     IF      XRECORD-NUMBER (3) NOT EQUAL TO 198
176100             MOVE 73 TO RECNO
176200             PERFORM DISPLAY-RECORD-KEYS
176300     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
176400             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
176500             GO TO START-FAIL-GF-14.
176600     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
176700     IF      INIT-FLAG NOT EQUAL ZERO
176800             GO TO START-DELETE-GF-14.
176900     MOVE    "AAAAAAAAAA400ALTKEY1" TO ALTERNATE-KEY1 (3).
177000     MOVE    "ZZZZZZZZZZ002ALTKEY2" TO ALTERNATE-KEY2 (3).
177100     MOVE    FILE-RECORD-INFO (3) TO IX-FD2R1-F-G-241.
177200     REWRITE IX-FD2R1-F-G-241 INVALID KEY
177300     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
177400             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
177500             GO TO START-FAIL-GF-14.
177600     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
177700     IF      INIT-FLAG NOT EQUAL ZERO
177800             GO TO START-FAIL-GF-14.
177900     MOVE    "AAAAAAAAAA400ALTKEY1"  TO IX-FD2-ALTKEY1.
178000     START   IX-FD2
178100                    KEY IS EQUAL TO IX-FD2-REDF-ALTKEY1
178200             INVALID KEY
178300     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
178400             TO RE-MARK
178500             MOVE  "INVALID KEY ON START" TO COMPUTED-A
178600             GO TO START-FAIL-GF-14.
178700     READ    IX-FD2 NEXT RECORD AT END
178800     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
178900             MOVE "AT END ON READ" TO COMPUTED-A
179000             GO TO START-FAIL-GF-14.
179100     MOVE    IX-FD2-REC-240    TO FILE-RECORD-INFO (1).
179200     IF      XRECORD-NUMBER (1) EQUAL TO 198
179300             PERFORM PASS
179400             GO TO START-WRITE-GF-14.
179500     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
179600     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
179700     MOVE    "AAAAAAAAAA400ALTKEY1"  TO CORRECT-A.
179800     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY1" TO RE-MARK.
179900     PERFORM PRINT-DETAIL.
180000     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY1"
180100             TO RE-MARK.
180200     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
180300 START-FAIL-GF-14.
180400     PERFORM FAIL.
180500     MOVE    198  TO CORRECT-18V0.
180600     GO TO   START-WRITE-GF-14.
180700 START-DELETE-GF-14.
180800     PERFORM DE-LETE.
180900 START-WRITE-GF-14.
181000     PERFORM PRINT-DETAIL.
181100 START-INIT-GF-15.
181200     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
181300     MOVE "START-TEST-GF-15" TO PAR-NAME.
181400     MOVE    "BBBBBBBBBC002"  TO IX-FD2-KEY.
181500 START-TEST-GF-15.
181600     READ    IX-FD2
181700                     KEY IS IX-FD2-KEY
181800         INVALID KEY
181900     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
182000                   TO RE-MARK
182100             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
182200             GO TO START-FAIL-GF-15.
182300     MOVE    IX-FD2-REC-240   TO FILE-RECORD-INFO (3).
182400     IF      XRECORD-NUMBER (3) NOT EQUAL TO 1
182500             MOVE 1 TO RECNO
182600             PERFORM DISPLAY-RECORD-KEYS
182700     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
182800             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
182900             GO TO START-FAIL-GF-15.
183000     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
183100     IF      INIT-FLAG NOT EQUAL ZERO
183200             GO TO START-DELETE-GF-15.
183300     MOVE    "AAGGGGGGGG100ALTKEY1" TO ALTERNATE-KEY1 (3).
183400     MOVE    "GGGGGGGGGG100ALTKEY2" TO ALTERNATE-KEY2 (3).
183500     MOVE    FILE-RECORD-INFO (3) TO IX-FD2R1-F-G-241.
183600     REWRITE IX-FD2R1-F-G-241 INVALID KEY
183700     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
183800             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
183900             GO TO START-FAIL-GF-15.
184000     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
184100     IF      INIT-FLAG NOT EQUAL ZERO
184200             GO TO START-FAIL-GF-15.
184300     MOVE    "AAGGGZZZZZ100ALTKEY1"  TO IX-FD2-ALTKEY1.
184400     START   IX-FD2
184500                    KEY IS EQUAL TO IX-FD2-ALTKEY1-1-5
184600             INVALID KEY
184700     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
184800             TO RE-MARK
184900             MOVE  "INVALID KEY ON START" TO COMPUTED-A
185000             GO TO START-FAIL-GF-15.
185100     READ    IX-FD2 NEXT RECORD AT END
185200     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
185300             MOVE "AT END ON READ" TO COMPUTED-A
185400             GO TO START-FAIL-GF-15.
185500     MOVE    IX-FD2-REC-240    TO FILE-RECORD-INFO (1).
185600     IF      XRECORD-NUMBER (1) EQUAL TO 1
185700             PERFORM PASS
185800             GO TO START-WRITE-GF-15.
185900     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
186000     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
186100     MOVE    "AAGGGGGGGG100ALTKEY1"  TO CORRECT-A.
186200     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY1" TO RE-MARK.
186300     PERFORM PRINT-DETAIL.
186400     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY1"
186500             TO RE-MARK.
186600     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
186700 START-FAIL-GF-15.
186800     PERFORM FAIL.
186900     MOVE    1  TO CORRECT-18V0.
187000     GO TO   START-WRITE-GF-15.
187100 START-DELETE-GF-15.
187200     PERFORM DE-LETE.
187300 START-WRITE-GF-15.
187400     PERFORM PRINT-DETAIL.
187500 START-INIT-GF-16.
187600     MOVE    "START REDF ALT-KEY-2" TO FEATURE.
187700     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
187800     MOVE "START-TEST-GF-16" TO PAR-NAME.
187900     MOVE    "SSSSSTTTTT370"  TO IX-FD2-KEY.
188000 START-TEST-GF-16.
188100     READ    IX-FD2
188200                     KEY IS IX-FD2-KEY
188300         INVALID KEY
188400     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
188500                   TO RE-MARK
188600             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
188700             GO TO START-FAIL-GF-16.
188800     MOVE    IX-FD2-REC-240   TO FILE-RECORD-INFO (3).
188900     IF      XRECORD-NUMBER (3) NOT EQUAL TO 185
189000             MOVE 60 TO RECNO
189100             PERFORM DISPLAY-RECORD-KEYS
189200     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
189300             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
189400             GO TO START-FAIL-GF-16.
189500     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
189600     IF      INIT-FLAG NOT EQUAL ZERO
189700             GO TO START-DELETE-GF-16.
189800     MOVE    "BCBCBCBCBC200ALTKEY1" TO ALTERNATE-KEY1 (3).
189900     MOVE    "CBCBCBCBCB100ALTKEY2" TO ALTERNATE-KEY2 (3).
190000     MOVE    FILE-RECORD-INFO (3) TO IX-FD2R1-F-G-241.
190100     REWRITE IX-FD2R1-F-G-241 INVALID KEY
190200     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
190300             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
190400             GO TO START-FAIL-GF-16.
190500     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
190600     IF      INIT-FLAG NOT EQUAL ZERO
190700             GO TO START-FAIL-GF-16.
190800     MOVE    "CBCBCBCBCB100ALTKEY2"  TO IX-FD2-ALTKEY2.
190900     START   IX-FD2
191000                    KEY IS EQUAL TO IX-FD2-ALTKEY2
191100          INVALID KEY
191200     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
191300             TO RE-MARK
191400             MOVE  "INVALID KEY ON START" TO COMPUTED-A
191500             GO TO START-FAIL-GF-16.
191600     READ    IX-FD2 NEXT RECORD AT END
191700     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
191800             MOVE "AT END ON READ" TO COMPUTED-A
191900             GO TO START-FAIL-GF-16.
192000     MOVE    IX-FD2-REC-240    TO FILE-RECORD-INFO (1).
192100     IF      XRECORD-NUMBER (1) EQUAL TO 185
192200             PERFORM PASS
192300             GO TO START-WRITE-GF-16.
192400     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
192500     MOVE    FDW-ALTKEY2-1-20  TO COMPUTED-A.
192600     MOVE    "CBCBCBCBCB100ALTKEY2"  TO CORRECT-A.
192700     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY2" TO RE-MARK.
192800     PERFORM PRINT-DETAIL.
192900     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY2"
193000             TO RE-MARK.
193100     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
193200 START-FAIL-GF-16.
193300     PERFORM FAIL.
193400     MOVE    185  TO CORRECT-18V0.
193500     GO TO   START-WRITE-GF-16.
193600 START-DELETE-GF-16.
193700     PERFORM DE-LETE.
193800 START-WRITE-GF-16.
193900     PERFORM PRINT-DETAIL.
194000 START-INIT-GF-17.
194100     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
194200     MOVE "START-TEST-GF-17" TO PAR-NAME.
194300     MOVE    "FFFFFFFFFG082"  TO IX-FD2-KEY.
194400 START-TEST-GF-17.
194500     READ    IX-FD2
194600                     KEY IS IX-FD2-KEY
194700         INVALID KEY
194800     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
194900                   TO RE-MARK
195000             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
195100             GO TO START-FAIL-GF-17.
195200     MOVE    IX-FD2-REC-240   TO FILE-RECORD-INFO (3).
195300     IF      XRECORD-NUMBER (3) NOT EQUAL TO 41
195400             MOVE 41 TO RECNO
195500             PERFORM DISPLAY-RECORD-KEYS
195600     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
195700             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
195800             GO TO START-FAIL-GF-17.
195900     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
196000     IF      INIT-FLAG NOT EQUAL ZERO
196100             GO TO START-DELETE-GF-17.
196200     MOVE    "DCDCDCDCDC100ALTKEY1" TO ALTERNATE-KEY1 (3).
196300     MOVE    "DCDCDCDCDC100ALTKEY2" TO ALTERNATE-KEY2 (3).
196400     MOVE    FILE-RECORD-INFO (3) TO IX-FD2R1-F-G-241.
196500     REWRITE IX-FD2R1-F-G-241 INVALID KEY
196600     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
196700             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
196800             GO TO START-FAIL-GF-17.
196900     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
197000     IF      INIT-FLAG NOT EQUAL ZERO
197100             GO TO START-FAIL-GF-17.
197200     MOVE    "DCDCDCZZZZ999ALTKEY2"  TO IX-FD2-ALTKEY2.
197300     START   IX-FD2
197400                    KEY IS EQUAL TO IX-FD2-ALTKEY2-1-6
197500          INVALID KEY
197600     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
197700             TO RE-MARK
197800             MOVE  "INVALID KEY ON START" TO COMPUTED-A
197900             GO TO START-FAIL-GF-17.
198000     READ    IX-FD2 NEXT RECORD AT END
198100     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
198200             MOVE "AT END ON READ" TO COMPUTED-A
198300             GO TO START-FAIL-GF-17.
198400     MOVE    IX-FD2-REC-240    TO FILE-RECORD-INFO (1).
198500     IF      XRECORD-NUMBER (1) EQUAL TO 41
198600             PERFORM PASS
198700             GO TO START-WRITE-GF-17.
198800     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
198900     MOVE    FDW-ALTKEY2-1-20  TO COMPUTED-A.
199000     MOVE    "DCDCDCDCDC100ALTKEY2"  TO CORRECT-A.
199100     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY2" TO RE-MARK.
199200     PERFORM PRINT-DETAIL.
199300     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY2"
199400             TO RE-MARK.
199500     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
199600 START-FAIL-GF-17.
199700     PERFORM FAIL.
199800     MOVE    41  TO CORRECT-18V0.
199900     GO TO   START-WRITE-GF-17.
200000 START-DELETE-GF-17.
200100     PERFORM DE-LETE.
200200 START-WRITE-GF-17.
200300     PERFORM PRINT-DETAIL.
200400 START-INIT-GF-18.
200500     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
200600     MOVE "START-TEST-GF-18" TO PAR-NAME.
200700     MOVE    "TTTTTTTTUU384"  TO IX-FD2-KEY.
200800 START-TEST-GF-18.
200900     READ    IX-FD2
201000                     KEY IS IX-FD2-KEY
201100         INVALID KEY
201200     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
201300                   TO RE-MARK
201400             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
201500             MOVE 192 TO CORRECT-18V0
201600             GO TO START-FAIL-GF-18.
201700     MOVE    IX-FD2-REC-240   TO FILE-RECORD-INFO (3).
201800     IF      XRECORD-NUMBER (3) NOT EQUAL TO 192
201900             MOVE 67 TO RECNO
202000             PERFORM DISPLAY-RECORD-KEYS
202100     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
202200             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
202300             MOVE 192 TO CORRECT-18V0
202400             GO TO START-FAIL-GF-18.
202500     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
202600     IF      INIT-FLAG NOT EQUAL ZERO
202700             GO TO START-DELETE-GF-18.
202800     MOVE    "CDCDCDCDCD100ALTKEY1" TO ALTERNATE-KEY1 (3).
202900     MOVE    "DCDCDCDCDC100ALTKEY2" TO ALTERNATE-KEY2 (3).
203000     MOVE    FILE-RECORD-INFO (3) TO IX-FD2R1-F-G-241.
203100     REWRITE IX-FD2R1-F-G-241 INVALID KEY
203200     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
203300             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
203400             MOVE 192 TO CORRECT-18V0
203500             GO TO START-FAIL-GF-18.
203600     PERFORM START-INIT-FD2 THRU START-INIT-FD2-EXIT.
203700     IF      INIT-FLAG NOT EQUAL ZERO
203800             GO TO START-FAIL-GF-18.
203900     MOVE    "DCDZZZZZZZ400ALTKEY2"  TO IX-FD2-ALTKEY2.
204000     START   IX-FD2
204100                    KEY IS EQUAL TO IX-FD2-ALTKEY2-1-3
204200             INVALID KEY
204300     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
204400             TO RE-MARK
204500             MOVE  "INVALID KEY ON START" TO COMPUTED-A
204600             MOVE 41 TO CORRECT-18V0
204700             GO TO START-FAIL-GF-18.
204800     READ    IX-FD2 NEXT RECORD AT END
204900     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
205000             MOVE "AT END ON READ" TO COMPUTED-A
205100             MOVE 41 TO CORRECT-18V0
205200             GO TO START-FAIL-GF-18.
205300     MOVE    IX-FD2-REC-240    TO FILE-RECORD-INFO (1).
205400     IF      XRECORD-NUMBER (1) NOT EQUAL TO 41
205500             MOVE ALTERNATE-KEY2 (1) TO WRK-FDW-ALTKEY2
205600             MOVE FDW-ALTKEY2-1-20 TO COMPUTED-A
205700             MOVE "DCDCDCDCDC100" TO CORRECT-A
205800     MOVE
205900     "IX-28/36; INCORRECT  KEY FOUND ON FIRST READ DUPLICATE KEYS"
206000             TO RE-MARK
206100             PERFORM PRINT-DETAIL
206200     MOVE "WRONG RECORD NUMBER FOUND ON FIRST READ DUPLICATE KEYS"
206300             TO RE-MARK
206400             MOVE XRECORD-NUMBER (1) TO COMPUTED-18V0
206500             MOVE 41 TO CORRECT-18V0
206600             GO TO START-FAIL-GF-18.
206700     READ    IX-FD2 NEXT RECORD AT END
206800     MOVE "IX-28;F1 AT END ON READ AFTER FIRST READ" TO RE-MARK
206900             MOVE "AT END ON READ" TO COMPUTED-A
207000             MOVE 192 TO CORRECT-18V0
207100             GO TO START-FAIL-GF-18.
207200     MOVE    IX-FD2-REC-240   TO FILE-RECORD-INFO (1).
207300     IF      XRECORD-NUMBER (1) EQUAL TO 192
207400             PERFORM PASS
207500             GO TO START-WRITE-GF-18.
207600     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
207700     MOVE    FDW-ALTKEY2-1-20  TO COMPUTED-A.
207800     MOVE    "DCDCDCDCDC100ALTKEY2"  TO CORRECT-A.
207900     MOVE
208000     "IX-28/-36INCORRECT KEY FOUND ON SECOND READ DUPLICATE KEYS"
208100             TO RE-MARK.
208200     PERFORM PRINT-DETAIL.
208300     MOVE "WRONG REC NUMBER FOUND ON SECOND READ DUPLICATE KEYS"
208400             TO RE-MARK.
208500     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
208600     MOVE    192 TO CORRECT-18V0.
208700 START-FAIL-GF-18.
208800     PERFORM FAIL.
208900     GO TO   START-WRITE-GF-18.
209000 START-DELETE-GF-18.
209100     PERFORM DE-LETE.
209200 START-WRITE-GF-18.
209300     PERFORM PRINT-DETAIL.
209400 WRITE-WRITE-03.
209500     CLOSE   IX-FD2.
209600 WRITE-INT-GF-03.
209700     OPEN    OUTPUT IX-FD3.
209800     MOVE    "IX-FD3" TO XFILE-NAME           (1).
209900     MOVE    "R1-F-G" TO  XRECORD-NAME        (1).
210000     MOVE    ZERO     TO  XRECORD-NUMBER      (1).
210100     MOVE    "RC"     TO  CHARS-OR-RECORDS    (1).
210200     MOVE "IX215"     TO  XPROGRAM-NAME       (1).
210300     MOVE    242      TO  XRECORD-LENGTH      (1).
210400     MOVE    007      TO  XBLOCK-SIZE         (1).
210500     MOVE    "IX"     TO  XFILE-ORGANIZATION  (1).
210600     MOVE    "S"      TO  XLABEL-TYPE         (1).
210700     MOVE    200      TO  RECORDS-IN-FILE     (1).
210800     MOVE    "CREATE-FILE-FD3" TO FEATURE.
210900     MOVE    "WRITE-TEST-GF-03" TO PAR-NAME.
211000     MOVE    ZERO TO KEYSUB.
211100     MOVE    ZERO TO INVKEY-COUNTER.
211200     MOVE    ZERO TO EXCUT-COUNTER-06V00.
211300 WRITE-INIT-GF-03.
211400     PERFORM WRITE-TEST-GF-03R1  50 TIMES.
211500     PERFORM WRITE-TEST-GF-03R2  125 TIMES.
211600     PERFORM WRITE-TEST-GF-03R1  25 TIMES.
211700     GO TO   WRITE-TEST-GF-03.
211800 WRITE-TEST-GF-03R1.
211900     ADD     001  TO XRECORD-NUMBER (1).
212000     ADD     001  TO  KEYSUB.
212100     MOVE    RECKEY-VALUE (KEYSUB) TO FDW-RECKEY-1-13.
212200     MOVE    ALTKEY1-VALUE (KEYSUB) TO FDW-ALTKEY1-1-20.
212300     MOVE    ALTKEY2-VALUE (KEYSUB) TO FDW-ALTKEY2-1-20.
212400     MOVE    WRK-FDW-RECKEY   TO    XRECORD-KEY (1).
212500     MOVE    WRK-FDW-ALTKEY1  TO ALTERNATE-KEY1 (1).
212600     MOVE    WRK-FDW-ALTKEY2  TO ALTERNATE-KEY2 (1).
212700     MOVE    FILE-RECORD-INFO (1)  TO IX-FD3R1-F-G-242.
212800     WRITE   IX-FD3R1-F-G-242
212900                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
213000     ADD     001 TO  EXCUT-COUNTER-06V00.
213100 WRITE-TEST-GF-03R2.
213200     ADD     002  TO FDW-RECKEY-11-13.
213300     ADD     002 TO FDW-ALTKEY1-11-13.
213400     SUBTRACT  002 FROM FDW-ALTKEY2-11-13.
213500     ADD     001  TO XRECORD-NUMBER (1).
213600     MOVE    WRK-FDW-RECKEY   TO    XRECORD-KEY (1).
213700     MOVE    WRK-FDW-ALTKEY1  TO ALTERNATE-KEY1 (1).
213800     MOVE    WRK-FDW-ALTKEY2  TO ALTERNATE-KEY2 (1).
213900     MOVE    FILE-RECORD-INFO (1) TO IX-FD3R1-F-G-242.
214000     WRITE   IX-FD3R1-F-G-242
214100                        INVALID KEY ADD 001 TO INVKEY-COUNTER.
214200     ADD     001 TO EXCUT-COUNTER-06V00.
214300 WRITE-TEST-GF-03.
214400     SUBTRACT INVKEY-COUNTER FROM EXCUT-COUNTER-06V00
214500             GIVING RECORDS-WRITTEN.
214600     IF      RECORDS-WRITTEN EQUAL TO 200
214700             PERFORM  PASS
214800             MOVE "FILE IX-FD3 CREATED (200 RECORDS)" TO RE-MARK
214900     ELSE    PERFORM FAIL
215000             MOVE                                          "IX-41;
215100-       "WRONG NUMBER OF RECORDS WRITTEN (MAY ALREADY EXIST)"
215200             TO RE-MARK
215300             MOVE 200 TO CORRECT-18V0
215400             MOVE RECORDS-WRITTEN TO COMPUTED-18V0.
215500     PERFORM PRINT-DETAIL.
215600     GO TO   WRITE-TEST-GF-03-END.
215700 WRITE-DELETE-GF-03.
215800     PERFORM DE-LETE.
215900     PERFORM  PRINT-DETAIL.
216000 WRITE-TEST-GF-03-END.
216100     CLOSE   IX-FD3.
216200 READ-INIT-F1-O3.
216300     OPEN    INPUT  IX-FD3.
216400     MOVE    "READ-TEST-F1-O3" TO PAR-NAME.
216500     MOVE    "READ FILE IX-FD3" TO FEATURE.
216600     MOVE    ZERO TO EXCUT-COUNTER-06V00.
216700     MOVE    02   TO RECKEY-NUM.
216800     MOVE    002 TO ALTKEY1-NUM.
216900 READ-TEST-F1-O3-R1.
217000     READ    IX-FD3 NEXT RECORD AT END  GO TO READ-TEST-F1-O3.
217100     MOVE    IX-FD3-RECKEY-AREA TO FDW-RECKEY-1-13.
217200     MOVE    IX-FD3-ALTKEY1-AREA TO FDW-ALTKEY1-1-20.
217300     IF      FDW-RECKEY-11-13 EQUAL TO RECKEY-NUM
217400             AND FDW-ALTKEY1-11-13 EQUAL TO ALTKEY1-NUM
217500             NEXT SENTENCE
217600             ELSE
217700             PERFORM  READ-FAIL-F1-O3.
217800     IF      EXCUT-COUNTER-06V00 NOT LESS THAN 200
217900             GO TO READ-TEST-F1-O3.
218000     ADD     001  TO EXCUT-COUNTER-06V00.
218100     ADD     002  TO RECKEY-NUM
218200     ADD     002  TO ALTKEY1-NUM.
218300     GO TO   READ-TEST-F1-O3-R1.
218400 READ-TEST-F1-O3.
218500     IF      FAIL-SW EQUAL TO 1 GO TO READ-EXIT-F1-O3.
218600     IF      EXCUT-COUNTER-06V00 EQUAL TO 200
218700             PERFORM PASS
218800             MOVE "200 RECORDS VERIFIED" TO RE-MARK
218900     ELSE    PERFORM FAIL
219000             MOVE
219100          "IX-28 OR IX-41; INCORRECT NUMBER OF RECORDS" TO RE-MARK
219200             MOVE 200 TO CORRECT-18V0
219300             MOVE EXCUT-COUNTER-06V00 TO COMPUTED-18V0.
219400     PERFORM PRINT-DETAIL.
219500     GO TO   READ-EXIT-F1-O3.
219600 READ-FAIL-F1-O3.
219700     MOVE 1 TO FAIL-SW.
219800     PERFORM FAIL.
219900     MOVE    FDW-RECKEY-11-13  TO COMPUTED-18V0.
220000     MOVE    RECKEY-NUM  TO CORRECT-18V0.
220100     ADD     01 TO REC-CT.
220200     MOVE    "NUM EMBEDDED IN RECKEY"  TO RE-MARK.
220300     PERFORM PRINT-DETAIL.
220400 READ-EXIT-F1-O3.
220500     CLOSE   IX-FD3.
220600 START-INIT-GF-19.
220700     OPEN    I-O  IX-FD3.
220800     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
220900     MOVE "START-TEST-GF-19" TO PAR-NAME.
221000     MOVE    "START QUAL REC-KEY" TO FEATURE.
221100     MOVE    "FFGGGGGGGG096" TO IX-FD3-RECKEY-AREA.
221200 START-TEST-GF-19.
221300     DELETE  IX-FD3 INVALID KEY
221400     MOVE "IX-21; INVALID KEY "         TO COMPUTED-A
221500             GO TO START-FAIL-GF-19.
221600     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
221700     IF      INIT-FLAG NOT EQUAL ZERO
221800             GO TO START-DELETE-GF-19.
221900     MOVE    "FFGGGGGGGG096" TO IX-FD3-RECKEY-AREA.
222000     START IX-FD3 KEY IS EQUAL TO IX-FD3-KEY IN IX-FD3-RECKEY-AREA
222100             INVALID KEY  PERFORM PASS
222200     MOVE "OK.;    INVALID KEY ON START OF DELETED RECORD"
222300                  TO RE-MARK
222400             GO TO START-WRITE-GF-19.
222500     READ    IX-FD3 NEXT RECORD  AT END
222600             MOVE "AT END ON READ" TO COMPUTED-A
222700             GO TO START-FAIL-GF-19.
222800     MOVE    IX-FD3-240        TO  FILE-RECORD-INFO (1).
222900     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
223000 START-FAIL-GF-19.
223100     PERFORM FAIL.
223200     MOVE    "INVALID KEY ON START" TO CORRECT-A.
223300     MOVE "WRONG RECORD NUMBER FOUND; IX-28 OR IX-36" TO RE-MARK.
223400     GO TO   START-WRITE-GF-19.
223500 START-DELETE-GF-19.
223600     PERFORM DE-LETE.
223700 START-WRITE-GF-19.
223800     PERFORM PRINT-DETAIL.
223900 START-INIT-GF-20.
224000     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
224100     MOVE "START-TEST-GF-20" TO PAR-NAME.
224200     MOVE    "CCCCCCCCCC020" TO IX-FD3-RECKEY-AREA.
224300 START-TEST-GF-20.
224400     DELETE  IX-FD3 INVALID KEY
224500             MOVE  "INVALID KEY (DELETE)" TO COMPUTED-A
224600             GO TO START-FAIL-GF-20.
224700     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
224800     IF      INIT-FLAG NOT EQUAL ZERO
224900             GO TO START-DELETE-GF-20.
225000     MOVE    "CCCCCCCCCC020" TO IX-FD3-RECKEY-AREA.
225100     START   IX-FD3 KEY IS EQUAL TO IX-FD3-KEY
225200             OF IX-FD3-RECKEY-AREA
225300             INVALID KEY  PERFORM PASS
225400      MOVE "OK.;   INVALID KEY ON START OF DELETED RECORD"
225500                  TO RE-MARK
225600             GO TO START-WRITE-GF-20.
225700     READ    IX-FD3 NEXT RECORD  AT END
225800             MOVE "AT END ON READ" TO COMPUTED-A
225900             GO TO START-FAIL-GF-20.
226000     MOVE    IX-FD3-240        TO  FILE-RECORD-INFO (1).
226100     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
226200 START-FAIL-GF-20.
226300     PERFORM FAIL.
226400     MOVE    "INVALID KEY ON START" TO CORRECT-A.
226500     MOVE "WRONG RECORD NUMBER FOUND; IX-28 OR IX-36" TO RE-MARK.
226600     GO TO   START-WRITE-GF-20.
226700 START-DELETE-GF-20.
226800     PERFORM DE-LETE.
226900 START-WRITE-GF-20.
227000     PERFORM PRINT-DETAIL.
227100 START-INIT-GF-21.
227200     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
227300     MOVE "START-TEST-GF-21" TO PAR-NAME.
227400     MOVE    "SSSSSSSSST362" TO IX-FD3-RECKEY-AREA.
227500 START-TEST-GF-21.
227600     DELETE  IX-FD3 INVALID KEY
227700             MOVE  "INVALID KEY (DELETE)" TO COMPUTED-A
227800             GO TO START-FAIL-GF-21.
227900     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
228000     IF      INIT-FLAG NOT EQUAL ZERO
228100             GO TO START-DELETE-GF-21.
228200     MOVE    "SSSSSSSSST362" TO IX-FD3-RECKEY-AREA.
228300     START   IX-FD3 KEY IS EQUAL TO
228400             IX-FD3-KEY IN
228500             IX-FD3-RECKEY-AREA
228600             INVALID KEY  PERFORM PASS
228700     MOVE "OK.;    INVALID KEY ON START OF DELETED RECORD"
228800                  TO RE-MARK
228900             GO TO START-WRITE-GF-21.
229000     READ    IX-FD3 NEXT RECORD  AT END
229100             MOVE "AT END ON READ" TO COMPUTED-A
229200             GO TO START-FAIL-GF-21.
229300     MOVE    IX-FD3-240        TO  FILE-RECORD-INFO (1).
229400     MOVE     XRECORD-NUMBER (1)  TO COMPUTED-18V0.
229500 START-FAIL-GF-21.
229600     PERFORM FAIL.
229700     MOVE    "INVALID KEY ON START" TO CORRECT-A.
229800     MOVE "WRONG RECORD NUMBER FOUND; IX-28 OR IX-36" TO RE-MARK.
229900     GO TO   START-WRITE-GF-21.
230000 START-DELETE-GF-21.
230100     PERFORM DE-LETE.
230200 START-WRITE-GF-21.
230300     PERFORM PRINT-DETAIL.
230400 START-INIT-GF-22.
230500     MOVE    "START QUAL ALT-KEY-1" TO FEATURE.
230600     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
230700     MOVE "START-TEST-GF-22" TO PAR-NAME.
230800     MOVE    "EEEEEEEEFF064"  TO IX-FD3-RECKEY-AREA.
230900 START-TEST-GF-22.
231000     READ    IX-FD3
231100             INVALID KEY  PERFORM FAIL
231200     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
231300                   TO RE-MARK
231400             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
231500             GO TO START-FAIL-GF-22.
231600     MOVE    IX-FD3-240       TO FILE-RECORD-INFO (3).
231700     IF      XRECORD-NUMBER (3) NOT EQUAL TO 32
231800             MOVE 32 TO RECNO
231900             PERFORM DISPLAY-RECORD-KEYS
232000     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
232100             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
232200             GO TO START-FAIL-GF-22.
232300     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
232400     IF      INIT-FLAG NOT EQUAL ZERO
232500             GO TO START-DELETE-GF-22.
232600     MOVE    "EEEEEEEEEE000ALTKEY1" TO ALTERNATE-KEY1 (3).
232700     MOVE    "WWWWWWWWWW400ALTKEY2" TO ALTERNATE-KEY2 (3).
232800     MOVE    FILE-RECORD-INFO (3) TO IX-FD3R1-F-G-242.
232900     REWRITE IX-FD3R1-F-G-242 INVALID KEY
233000     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
233100             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
233200             GO TO START-FAIL-GF-22.
233300     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
233400     IF      INIT-FLAG NOT EQUAL ZERO
233500             GO TO START-FAIL-GF-22.
233600     MOVE    "EEEEEEEEEE000ALTKEY1"  TO IX-FD3-ALTKEY1-AREA.
233700     START   IX-FD3
233800             KEY IS EQUAL TO IX-FD3-KEY OF
233900             IX-FD3-ALTKEY1-AREA
234000             INVALID KEY
234100     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
234200             TO RE-MARK
234300             MOVE  "INVALID KEY ON START" TO COMPUTED-A
234400             GO TO START-FAIL-GF-22.
234500     READ    IX-FD3 NEXT RECORD AT END
234600     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
234700             MOVE "AT END ON READ" TO COMPUTED-A
234800             GO TO START-FAIL-GF-22.
234900     MOVE    IX-FD3-240        TO FILE-RECORD-INFO (1).
235000     IF      XRECORD-NUMBER (1) EQUAL TO 32
235100             PERFORM PASS
235200             GO TO START-WRITE-GF-22.
235300     PERFORM FAIL.
235400     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
235500     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
235600     MOVE    "EEEEEEEEEE000ALTKEY1"  TO CORRECT-A.
235700     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY1" TO RE-MARK.
235800     PERFORM PRINT-DETAIL.
235900     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY1"
236000             TO RE-MARK.
236100     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
236200 START-FAIL-GF-22.
236300     PERFORM FAIL.
236400     MOVE    32  TO CORRECT-18V0.
236500     GO TO   START-WRITE-GF-22.
236600 START-DELETE-GF-22.
236700     PERFORM DE-LETE.
236800 START-WRITE-GF-22.
236900     PERFORM PRINT-DETAIL.
237000 START-INIT-GF-23.
237100     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
237200     MOVE "START-TEST-GF-23" TO PAR-NAME.
237300     MOVE    "BBBBBBBCCC006"  TO IX-FD3-RECKEY-AREA.
237400 START-TEST-GF-23.
237500     READ    IX-FD3
237600             INVALID KEY
237700     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
237800                   TO RE-MARK
237900             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
238000             GO TO START-FAIL-GF-23.
238100     MOVE    IX-FD3-240       TO FILE-RECORD-INFO (3).
238200     IF      XRECORD-NUMBER (3) NOT EQUAL TO 3
238300             MOVE 3 TO RECNO
238400             PERFORM DISPLAY-RECORD-KEYS
238500     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
238600             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
238700             GO TO START-FAIL-GF-23.
238800     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
238900     IF      INIT-FLAG NOT EQUAL ZERO
239000             GO TO START-DELETE-GF-23.
239100     MOVE    "AAAAAAAAAA400ALTKEY1" TO ALTERNATE-KEY1 (3).
239200     MOVE    "ZZZZZZZZZZ002ALTKEY2" TO ALTERNATE-KEY2 (3).
239300     MOVE    FILE-RECORD-INFO (3) TO IX-FD3R1-F-G-242.
239400     REWRITE IX-FD3R1-F-G-242 INVALID KEY
239500     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
239600             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
239700             GO TO START-FAIL-GF-23.
239800     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
239900     IF      INIT-FLAG NOT EQUAL ZERO
240000             GO TO START-FAIL-GF-23.
240100     MOVE    "AAAAAAAAAA400ALTKEY1"  TO IX-FD3-ALTKEY1-AREA.
240200     START   IX-FD3
240300                    KEY IS EQUAL TO
240400             IX-FD3-KEY
240500             IN IX-FD3-ALTKEY1-AREA
240600             INVALID KEY
240700     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
240800             TO RE-MARK
240900             MOVE  "INVALID KEY ON START" TO COMPUTED-A
241000             GO TO START-FAIL-GF-23.
241100     READ    IX-FD3 NEXT RECORD AT END
241200     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
241300             MOVE "AT END ON READ" TO COMPUTED-A
241400             GO TO START-FAIL-GF-23.
241500     MOVE    IX-FD3-240        TO FILE-RECORD-INFO (1).
241600     IF      XRECORD-NUMBER (1) EQUAL TO 3
241700             PERFORM PASS
241800             GO TO START-WRITE-GF-23.
241900     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
242000     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
242100     MOVE    "AAAAAAAAAA400ALTKEY1"  TO CORRECT-A.
242200     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY1" TO RE-MARK.
242300     PERFORM PRINT-DETAIL.
242400     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY1"
242500             TO RE-MARK.
242600     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
242700 START-FAIL-GF-23.
242800     PERFORM FAIL.
242900     MOVE 3 TO CORRECT-18V0.
243000     GO TO   START-WRITE-GF-23.
243100 START-DELETE-GF-23.
243200     PERFORM DE-LETE.
243300 START-WRITE-GF-23.
243400     PERFORM PRINT-DETAIL.
243500 START-INIT-GF-24.
243600     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
243700     MOVE "START-TEST-GF-24" TO PAR-NAME.
243800     MOVE    "SSSSSSSSSS360"  TO IX-FD3-RECKEY-AREA.
243900 START-TEST-GF-24.
244000     READ    IX-FD3
244100             INVALID KEY
244200     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
244300                   TO RE-MARK
244400             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
244500             GO TO START-FAIL-GF-24.
244600     MOVE    IX-FD3-240       TO FILE-RECORD-INFO (3).
244700     IF      XRECORD-NUMBER (3) NOT EQUAL TO 180
244800             MOVE 55 TO RECNO
244900             PERFORM DISPLAY-RECORD-KEYS
245000     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
245100             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
245200             GO TO START-FAIL-GF-24.
245300     IF      INIT-FLAG NOT EQUAL ZERO
245400             GO TO START-DELETE-GF-24.
245500     MOVE    "AAGGGGGGGG100ALTKEY1" TO ALTERNATE-KEY1 (3).
245600     MOVE    "GGGGGGGGGG100ALTKEY2" TO ALTERNATE-KEY2 (3).
245700     MOVE    FILE-RECORD-INFO (3) TO IX-FD3R1-F-G-242.
245800     REWRITE IX-FD3R1-F-G-242 INVALID KEY
245900     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
246000             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
246100             GO TO START-FAIL-GF-24.
246200     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
246300     IF      INIT-FLAG NOT EQUAL ZERO
246400             GO TO START-FAIL-GF-24.
246500     MOVE    "AAGGGGGGGG100ALTKEY1"  TO IX-FD3-ALTKEY1-AREA.
246600     START   IX-FD3
246700             KEY IS EQUAL TO
246800             IX-FD3-KEY
246900             OF IX-FD3-ALTKEY1-AREA
247000             INVALID KEY  PERFORM FAIL
247100     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
247200             TO RE-MARK
247300             MOVE  "INVALID KEY ON START" TO COMPUTED-A
247400             GO TO START-FAIL-GF-24.
247500     READ    IX-FD3 NEXT RECORD AT END
247600     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
247700             MOVE "AT END ON READ" TO COMPUTED-A
247800             GO TO START-FAIL-GF-24.
247900     MOVE    IX-FD3-240        TO FILE-RECORD-INFO (1).
248000     IF      XRECORD-NUMBER (1) EQUAL TO 180
248100             PERFORM PASS
248200             GO TO START-WRITE-GF-24.
248300     MOVE    ALTERNATE-KEY1 (1)  TO WRK-FDW-ALTKEY1.
248400     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
248500     MOVE    "AAGGGGGGGG100ALTKEY1"  TO CORRECT-A.
248600     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY1" TO RE-MARK.
248700     PERFORM PRINT-DETAIL.
248800     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY1"
248900             TO RE-MARK.
249000     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
249100 START-FAIL-GF-24.
249200     PERFORM FAIL.
249300     MOVE    180  TO CORRECT-18V0.
249400     GO TO   START-WRITE-GF-24.
249500 START-DELETE-GF-24.
249600     PERFORM DE-LETE.
249700 START-WRITE-GF-24.
249800     PERFORM PRINT-DETAIL.
249900 START-INIT-GF-25.
250000     MOVE    "START QUAL ALT-KEY-2" TO FEATURE.
250100     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
250200     MOVE "START-TEST-GF-25" TO PAR-NAME.
250300     MOVE    "CCCCCDDDDD030"  TO IX-FD3-RECKEY-AREA.
250400 START-TEST-GF-25.
250500     READ    IX-FD3
250600             INVALID KEY
250700     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
250800                   TO RE-MARK
250900             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
251000             GO TO START-FAIL-GF-25.
251100     MOVE    IX-FD3-240       TO FILE-RECORD-INFO (3).
251200     IF      XRECORD-NUMBER (3) NOT EQUAL TO 15
251300             MOVE 15 TO RECNO
251400             PERFORM DISPLAY-RECORD-KEYS
251500     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
251600             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
251700             GO TO START-FAIL-GF-25.
251800     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
251900     IF      INIT-FLAG NOT EQUAL ZERO
252000             GO TO START-DELETE-GF-25.
252100     MOVE    "BCBCBCBCBC200ALTKEY1" TO ALTERNATE-KEY1 (3).
252200     MOVE    "CBCBCBCBCB100ALTKEY2" TO ALTERNATE-KEY2 (3).
252300     MOVE    FILE-RECORD-INFO (3) TO IX-FD3R1-F-G-242.
252400     REWRITE IX-FD3R1-F-G-242 INVALID KEY
252500      MOVE "IX-33;  INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
252600             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
252700             GO TO START-FAIL-GF-25.
252800     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
252900     IF      INIT-FLAG NOT EQUAL ZERO
253000             GO TO START-FAIL-GF-25.
253100     MOVE    "CBCBCBCBCB100ALTKEY2"  TO IX-FD3-ALTKEY2-AREA.
253200     START   IX-FD3
253300                    KEY IS EQUAL TO
253400             IX-FD3-KEY
253500             IN
253600             IX-FD3-ALTKEY2-AREA
253700             INVALID KEY
253800     MOVE "IX-36;  INVALID KEY ON START OF REWRITTEN RECORD"
253900             TO RE-MARK
254000             MOVE  "INVALID KEY ON START" TO COMPUTED-A
254100             GO TO START-FAIL-GF-25.
254200     READ    IX-FD3 NEXT RECORD AT END
254300     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
254400             MOVE "AT END ON READ" TO COMPUTED-A
254500             GO TO START-FAIL-GF-25.
254600     MOVE    IX-FD3-240        TO FILE-RECORD-INFO (1).
254700     IF      XRECORD-NUMBER (1) EQUAL TO 15
254800             PERFORM PASS
254900             GO TO START-WRITE-GF-25.
255000     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
255100     MOVE    FDW-ALTKEY2-1-20  TO COMPUTED-A.
255200     MOVE    "CBCBCBCBCB100ALTKEY2"  TO CORRECT-A.
255300     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY2" TO RE-MARK.
255400     PERFORM PRINT-DETAIL.
255500     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY2"
255600             TO RE-MARK.
255700     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
255800 START-FAIL-GF-25.
255900     PERFORM FAIL.
256000     MOVE    15  TO CORRECT-18V0.
256100     GO TO   START-WRITE-GF-25.
256200 START-DELETE-GF-25.
256300     PERFORM DE-LETE.
256400 START-WRITE-GF-25.
256500     PERFORM PRINT-DETAIL.
256600 START-INIT-GF-26.
256700     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
256800     MOVE "START-TEST-GF-26" TO PAR-NAME.
256900     MOVE    "TTTTTTTTTT380"  TO IX-FD3-RECKEY-AREA.
257000 START-TEST-GF-26.
257100     READ    IX-FD3
257200             INVALID KEY
257300     MOVE "IX-28;F2 INVALID KEY PATH TAKEN ON INITIAL READ"
257400                   TO RE-MARK
257500             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
257600             GO TO START-FAIL-GF-26.
257700     MOVE    IX-FD3-240       TO FILE-RECORD-INFO (3).
257800     IF      XRECORD-NUMBER (3) NOT EQUAL TO 190
257900             MOVE 65 TO RECNO
258000             PERFORM DISPLAY-RECORD-KEYS
258100     MOVE "IX-28;F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
258200             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
258300             GO TO START-FAIL-GF-26.
258400     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
258500     IF      INIT-FLAG NOT EQUAL ZERO
258600             GO TO START-DELETE-GF-26.
258700     MOVE    "DCDCDCDCDC100ALTKEY1" TO ALTERNATE-KEY1 (3).
258800     MOVE    "DCDCDCDCDC100ALTKEY2" TO ALTERNATE-KEY2 (3).
258900     MOVE    FILE-RECORD-INFO (3) TO IX-FD3R1-F-G-242.
259000     REWRITE IX-FD3R1-F-G-242 INVALID KEY
259100      MOVE "IX-33;  INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
259200             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
259300             GO TO START-FAIL-GF-26.
259400     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
259500     IF      INIT-FLAG NOT EQUAL ZERO
259600             GO TO START-FAIL-GF-26.
259700     MOVE    "DCDCDCDCDC100ALTKEY2"  TO IX-FD3-ALTKEY2-AREA.
259800     START   IX-FD3
259900             KEY IS EQUAL TO
260000             IX-FD3-KEY OF IX-FD3-ALTKEY2-AREA
260100             INVALID KEY
260200      MOVE "IX-36; INVALID KEY ON START OF REWRITTEN RECORD"
260300             TO RE-MARK
260400             MOVE  "INVALID KEY ON START" TO COMPUTED-A
260500             GO TO START-FAIL-GF-26.
260600     READ    IX-FD3 NEXT RECORD AT END
260700     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
260800             MOVE "AT END ON READ" TO COMPUTED-A
260900             GO TO START-FAIL-GF-26.
261000     MOVE    IX-FD3-240        TO FILE-RECORD-INFO (1).
261100     IF      XRECORD-NUMBER (1) EQUAL TO 190
261200             PERFORM PASS
261300             GO TO START-WRITE-GF-26.
261400     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
261500     MOVE    FDW-ALTKEY2-1-20  TO COMPUTED-A.
261600     MOVE    "DCDCDCDCDC100ALTKEY2"  TO CORRECT-A.
261700     MOVE "IX-28 OR IX-36; INCORR ALTERN RECORD KEY2" TO RE-MARK.
261800     PERFORM PRINT-DETAIL.
261900     MOVE   "WRONG RECORD NUMBER FOUND ON READ ALTERNATE REC KEY2"
262000             TO RE-MARK.
262100     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
262200 START-FAIL-GF-26.
262300     PERFORM FAIL.
262400     MOVE    190  TO CORRECT-18V0.
262500     GO TO   START-WRITE-GF-26.
262600 START-DELETE-GF-26.
262700     PERFORM DE-LETE.
262800 START-WRITE-GF-26.
262900     PERFORM PRINT-DETAIL.
263000 START-INIT-GF-27.
263100     MOVE "----------" TO DUMMY-RECORD. PERFORM BLANK-LINE-PRINT.
263200     MOVE "START-TEST-GF-27" TO PAR-NAME.
263300     MOVE    "CCCCCCCCDD024"  TO IX-FD3-RECKEY-AREA.
263400 START-TEST-GF-27.
263500     READ    IX-FD3
263600             INVALID KEY
263700     MOVE "IX-28,F2 INVALID KEY PATH TAKEN ON INITIAL READ"
263800                   TO RE-MARK
263900             MOVE  "INVALID KEY ON READ" TO COMPUTED-A
264000             MOVE 12 TO CORRECT-18V0
264100             GO TO START-FAIL-GF-27.
264200     MOVE    IX-FD3-240       TO FILE-RECORD-INFO (3).
264300     IF      XRECORD-NUMBER (3) NOT EQUAL TO 12
264400             MOVE 12 TO RECNO
264500             PERFORM DISPLAY-RECORD-KEYS
264600     MOVE "IX-28,F2 WRONG RECORD FOUND ON INITIAL READ" TO RE-MARK
264700             MOVE  XRECORD-NUMBER (3) TO COMPUTED-18V0
264800             MOVE 4 TO CORRECT-18V0
264900             GO TO START-FAIL-GF-27.
265000     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
265100     IF      INIT-FLAG NOT EQUAL ZERO
265200             GO TO START-DELETE-GF-27.
265300     MOVE    "CDCDCDCDCD100ALTKEY1" TO ALTERNATE-KEY1 (3).
265400     MOVE    "DCDCDCDCDC100ALTKEY2" TO ALTERNATE-KEY2 (3).
265500     MOVE    FILE-RECORD-INFO (3) TO IX-FD3R1-F-G-242.
265600     REWRITE IX-FD3R1-F-G-242 INVALID KEY
265700     MOVE "IX-33;   INVALID KEY PATH TAKEN ON REWRITE" TO RE-MARK
265800             MOVE  "INVALID KEY; REWRITE" TO COMPUTED-A
265900             MOVE 12 TO CORRECT-18V0
266000             GO TO START-FAIL-GF-27.
266100     PERFORM START-INIT-FD3 THRU START-INIT-FD3-EXIT.
266200     IF      INIT-FLAG NOT EQUAL ZERO
266300             GO TO START-FAIL-GF-27.
266400     MOVE    "DCDCDCDCDC100ALTKEY2"  TO IX-FD3-ALTKEY2-AREA.
266500     START   IX-FD3
266600                    KEY IS EQUAL TO IX-FD3-KEY
266700             IN
266800             IX-FD3-ALTKEY2-AREA
266900             INVALID KEY
267000      MOVE "IX-36; INVALID KEY ON START OF REWRITTEN RECORD"
267100             TO RE-MARK
267200             MOVE  "INVALID KEY ON START" TO COMPUTED-A
267300             MOVE 190 TO CORRECT-18V0
267400             GO TO START-FAIL-GF-27.
267500     READ    IX-FD3 NEXT RECORD AT END
267600     MOVE "IX-28;F1 AT END ON READ AFTER START" TO RE-MARK
267700             MOVE "AT END ON READ" TO COMPUTED-A
267800             MOVE 190 TO CORRECT-18V0
267900             GO TO START-FAIL-GF-27.
268000     MOVE    IX-FD3-240        TO FILE-RECORD-INFO (1).
268100     IF      XRECORD-NUMBER (1) NOT EQUAL TO 190
268200             MOVE ALTERNATE-KEY2 (1) TO WRK-FDW-ALTKEY2
268300             MOVE FDW-ALTKEY2-1-20 TO COMPUTED-A
268400             MOVE "DCDCDCDCDC100" TO CORRECT-A
268500     MOVE
268600     "IX-28 OR IX-36; INCORR KEY FOUND ON FIRST READ DUPL KEYS"
268700             TO RE-MARK
268800             PERFORM PRINT-DETAIL
268900     MOVE "WRONG RECORD NUMBER FOUND ON FIRST READ DUPLICATE KEYS"
269000             TO RE-MARK
269100             MOVE XRECORD-NUMBER (1) TO COMPUTED-18V0
269200             MOVE 190 TO CORRECT-18V0
269300             GO TO START-FAIL-GF-27.
269400     READ    IX-FD3 NEXT RECORD AT END
269500     MOVE "IX-28;F1 AT END ON READ AFTER FIRST READ" TO RE-MARK
269600             MOVE "AT END ON READ" TO COMPUTED-A
269700             MOVE 12 TO CORRECT-18V0
269800             GO TO START-FAIL-GF-27.
269900     MOVE    IX-FD3-240       TO FILE-RECORD-INFO (1).
270000     IF      XRECORD-NUMBER (1) EQUAL TO 12
270100             PERFORM PASS
270200             GO TO START-WRITE-GF-27.
270300     PERFORM FAIL.
270400     MOVE    ALTERNATE-KEY2 (1)  TO WRK-FDW-ALTKEY2.
270500     MOVE    FDW-ALTKEY1-1-20  TO COMPUTED-A.
270600     MOVE
270700     "IX-28 OR IX-36; INCORR KEY FOUND ON SECOND READ DUPL KEYS"
270800             TO RE-MARK.
270900     PERFORM PRINT-DETAIL.
271000     MOVE "WRONG REC NUMBER FOUND ON SECOND READ DUPLICATE KEYS"
271100             TO RE-MARK.
271200     MOVE    XRECORD-NUMBER (1) TO COMPUTED-18V0.
271300     MOVE    12 TO CORRECT-18V0.
271400 START-FAIL-GF-27.
271500     PERFORM FAIL.
271600     GO TO   START-WRITE-GF-27.
271700 START-DELETE-GF-27.
271800     PERFORM DE-LETE.
271900 START-WRITE-GF-27.
272000     PERFORM PRINT-DETAIL.
272100 START-TERM-GF.
272200     CLOSE   IX-FD3.
272300 START-TEST-FINISH.
272400     GO TO   START-TEST-COMPLETE.
272500 START-INIT-FD1.
272600     MOVE    SPACE  TO FILE-RECORD-INFO (1).
272700     MOVE    ZERO  TO INIT-FLAG.
272800     MOVE    9999  TO XRECORD-NUMBER (2).
272900     MOVE    SPACE TO IX-FD1R1-F-G-240.
273000     MOVE    "GGGGGGGGGG200" TO  FDW-RECKEY-1-13.
273100     MOVE    WRK-FDW-RECKEY TO IX-REC-KEY-AREA.
273200     START   IX-FD1  KEY IS EQUAL TO IX-FD1-KEY INVALID KEY
273300                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
273400                     GO TO START-INIT-FD1-ERROR.
273500     READ    IX-FD1 NEXT RECORD INTO  FILE-RECORD-INFO (2)
273600                     AT END  MOVE  "AT END ON READ" TO COMPUTED-A
273700                     GO TO START-INIT-FD1-ERROR.
273800     IF      XRECORD-NUMBER (2) EQUAL TO 100
273900             GO TO START-INIT-FD1-EXIT.
274000     MOVE    XRECORD-KEY (2)  TO WRK-FDW-RECKEY.
274100     MOVE    FDW-RECKEY-1-13  TO COMPUTED-A.
274200 START-INIT-FD1-ERROR.
274300     MOVE     1 TO INIT-FLAG.
274400     MOVE    "TEST IMPROPERLY INITIALIZED" TO RE-MARK.
274500     MOVE    "GGGGGGGGGG200" TO CORRECT-A.
274600     PERFORM PRINT-DETAIL.
274700 START-INIT-FD1-EXIT.
274800     EXIT.
274900 START-INIT-FD2.
275000     MOVE    SPACE  TO FILE-RECORD-INFO (1).
275100     MOVE    ZERO  TO INIT-FLAG.
275200     MOVE    9999  TO XRECORD-NUMBER (2).
275300     MOVE    SPACE TO IX-FD2R1-F-G-241.
275400     MOVE    "GGGGGGGGGG200" TO  IX-FD2-KEY.
275500     START   IX-FD2  KEY IS EQUAL TO IX-FD2-KEY INVALID KEY
275600                     MOVE  "INVALID KEY ON START" TO COMPUTED-A
275700                     GO TO START-INIT-FD2-ERROR.
275800     READ    IX-FD2 NEXT RECORD INTO  FILE-RECORD-INFO (2)
275900                     AT END  MOVE  "AT END ON READ" TO COMPUTED-A
276000                     GO TO START-INIT-FD2-ERROR.
276100     IF      XRECORD-NUMBER (2) EQUAL TO 100
276200             GO TO START-INIT-FD2-EXIT.
276300     MOVE    XRECORD-KEY (2)  TO WRK-FDW-RECKEY.
276400     MOVE    FDW-RECKEY-1-13  TO COMPUTED-A.
276500 START-INIT-FD2-ERROR.
276600     MOVE     1 TO INIT-FLAG.
276700     MOVE    "TEST IMPROPERLY INITIALIZED" TO RE-MARK.
276800     MOVE    "GGGGGGGGGG200" TO CORRECT-A.
276900     PERFORM PRINT-DETAIL.
277000 START-INIT-FD2-EXIT.
277100     EXIT.
277200 START-INIT-FD3.
277300     MOVE    SPACE  TO FILE-RECORD-INFO (1).
277400     MOVE    ZERO  TO INIT-FLAG.
277500     MOVE    9999  TO XRECORD-NUMBER (2).
277600     MOVE    SPACE TO IX-FD3R1-F-G-242.
277700     MOVE    "GGGGGGGGGG200" TO  IX-FD3-RECKEY-AREA.
277800     START   IX-FD3
277900           INVALID KEY  MOVE  "INVALID KEY ON START" TO COMPUTED-A
278000                     GO TO START-INIT-FD3-ERROR.
278100     READ    IX-FD3 NEXT RECORD INTO FILE-RECORD-INFO (2)
278200                     AT END  MOVE  "AT END ON READ" TO COMPUTED-A
278300                     GO TO START-INIT-FD3-ERROR.
278400     IF      XRECORD-NUMBER (2) EQUAL TO 100
278500             GO TO START-INIT-FD3-EXIT.
278600     MOVE    XRECORD-KEY (2)  TO WRK-FDW-RECKEY.
278700     MOVE    FDW-RECKEY-1-13  TO COMPUTED-A.
278800 START-INIT-FD3-ERROR.
278900     MOVE     1 TO INIT-FLAG.
279000     MOVE    "TEST IMPROPERLY INITIALIZED" TO RE-MARK.
279100     MOVE    "GGGGGGGGGG200" TO CORRECT-A.
279200     PERFORM PRINT-DETAIL.
279300 START-INIT-FD3-EXIT.
279400     EXIT.
279500 DISPLAY-RECORD-KEYS.
279600     MOVE    XRECORD-KEY (3)  TO WRK-FDW-RECKEY.
279700     MOVE    FDW-RECKEY-1-13  TO COMPUTED-A.
279800     MOVE    RECKEY-VALUE (RECNO)  TO CORRECT-A.
279900     MOVE    "RECORD KEY VALUES" TO RE-MARK.
280000     PERFORM PRINT-DETAIL.
280100 START-TEST-COMPLETE.
280200     EXIT.
280300 CCVS-EXIT SECTION.
280400 CCVS-999999.
280500     GO TO CLOSE-FILES.
