000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC106A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC106A TESTS FORMAT 1  OF THE SUBTRACT
002300*    STATEMENT.  VARIOUS COMBINATINS OF DATA-ITEMS AND ALL
002400*    OPTIONAL PHRASES ARE TESTED.
002500*
002600
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 01  WRK-NE-X-1     PIC  9(16).99.
004400 01  WRK-NE-X-2     PIC -9(16).99.
004500 01  WRK-XN-00001 PIC X.
004600 01  WRK-XN-18-1 PIC X(18).
004700 01  WRK-AN-X-18-1, REDEFINES WRK-XN-18-1 PIC A(18).
004800 01  WRK-DU-X-18V0-1; REDEFINES WRK-XN-18-1 PIC 9(18).
004900 01  WRK-DU-0V1-1 PIC V9 VALUE .3.
005000 01  WRK-DU-0V2-1 PIC V99 VALUE .25.
005100 01  WRK-DU-0V12-1 PIC V9(12) VALUE .00001.
005200 01  WRK-DU-1V0-1 PIC 9 VALUE ZERO.
005300 01  WRK-DU-1V1-1 PIC 9V9 VALUE 1.1.
005400 01  WRK-DU-1V1-2 PIC 9V9 VALUE 2.4.
005500 01  WRK-DU-1V3-1 PIC 9V999 VALUE 1.001.
005600 01  WRK-DU-1V3-2 PIC 9V999 VALUE 1.001.
005700 01  WRK-DU-1V5-1 PIC 9V9(5).
005800 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
005900 01  WRK-DU-2P6-1 PIC 99P(6) VALUE 99000000.
006000 01  WRK-DU-2V0-1 PIC 99.
006100 01  WRK-DU-2V0-2 PIC 99.
006200 01  WRK-DU-2V0-3 PIC 99.
006300 01  WRK-DU-2V1-1 PIC 99V9.
006400 01  WRK-DU-2V1-2 PIC 99V9.
006500 01  WRK-DU-2V1-3 PIC 99V9.
006600 01  WRK-DU-2V2-1 PIC 99V99 VALUE 15.44.
006700 01  WRK-DU-2V2-2 PIC 99V99 VALUE 60.89.
006800 01  WRK-DU-2V2-3 PIC 99V99 VALUE 60.99.
006900 01  WRK-DU-2V2-4 PIC 99V99 VALUE 60.99.
007000 01  WRK-DU-2V2-5 PIC 99V99 VALUE 10.00.
007100 01  WRK-DU-2V5-1 PIC 99V9(5).
007200 01  WRK-DU-4P1-1 PIC P(4)9 VALUE .00001.
007300 01  WRK-DU-5V1-1 PIC 9(5)V9 VALUE 12345.6.
007400 01  WRK-DU-6V0-1 PIC 9(6) VALUE 99999.
007500 01  WRK-DU-6V0-2 PIC 9(6) VALUE 99999.
007600 01  WRK-DU-16V2-1 PIC 9(16)V99 VALUE 9999999999999999.99.
007700 01  WRK-DS-1V0-1 PIC S9 VALUE -3.
007800 01  WRK-DS-1V0-2 PIC S9 VALUE 2.
007900 01  WRK-DS-1V2-1 PIC S9V99 VALUE ZERO.
008000 01  WRK-DS-2V0-1 PIC S99 VALUE ZERO.
008100 01  WRK-DS-2V1-1 PIC S99V9 VALUE ZERO.
008200 01  WRK-DS-2V2-1 PIC S99V99 VALUE ZERO.
008300 01  WRK-DS-2V2-2 PIC S99V99 VALUE -12.34.
008400 01  WRK-DS-16V2-1 PIC S9(16)V99 VALUE -9999999999999999.99.
008500 01  42-DATANAMES.
008600     02  DNAME1   PICTURE 9      VALUE 1        COMPUTATIONAL.
008700     02  DNAME2   PICTURE 99      VALUE 1  COMPUTATIONAL.
008800     02  DNAME3   PICTURE 999     VALUE 1  COMPUTATIONAL.
008900     02  DNAME4   PICTURE 9(4)    VALUE 1  COMPUTATIONAL.
009000     02  DNAME5   PICTURE 9(5)    VALUE 1  COMPUTATIONAL.
009100     02  DNAME6   PICTURE 9(6)    VALUE 1  COMPUTATIONAL.
009200     02  DNAME7   PICTURE 9(7)    VALUE 1  COMPUTATIONAL.
009300     02  DNAME8   PICTURE 9(8)    VALUE 1  COMPUTATIONAL.
009400     02  DNAME9   PICTURE 9(9)    VALUE 1  COMPUTATIONAL.
009500     02  DNAME10  PICTURE 9(10)   VALUE 1.
009600     02  DNAME11  PICTURE 9(11)   VALUE 1.
009700     02  DNAME12  PICTURE 9(12)   VALUE 1.
009800     02  DNAME13  PICTURE 9(13)   VALUE 1.
009900     02  DNAME14  PICTURE 9(14)   VALUE 1.
010000     02  DNAME15  PICTURE 9(15)   VALUE 1.
010100     02  DNAME16  PICTURE 9(16)   VALUE 1.
010200     02  DNAME17  PICTURE 9(17)   VALUE 1.
010300     02  DNAME18  PICTURE 9(18)   VALUE 1.
010400     02  DNAME19  PICTURE 9       VALUE 1.
010500     02  DNAME20  PICTURE 99      VALUE 1.
010600     02  DNAME21  PICTURE 999     VALUE 1.
010700     02  DNAME22  PICTURE 9(18)  VALUE ZERO.
010800     02  DNAME23  PICTURE 9(18)  VALUE ZERO.
010900     02  DNAME24  PICTURE 9(18)  VALUE ZERO.
011000     02  DNAME25  PICTURE 9(18)  VALUE ZERO.
011100     02  DNAME26  PICTURE 9(18)  VALUE ZERO.
011200     02  DNAME27  PICTURE 9(18)  VALUE ZERO.
011300     02  DNAME28  PICTURE 9(18)  VALUE ZERO.
011400     02  DNAME29  PICTURE 9(18)  VALUE ZERO.
011500     02  DNAME30   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
011600     02  DNAME31   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
011700     02  DNAME32   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
011800     02  DNAME33   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
011900     02  DNAME34   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012000     02  DNAME35   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012100     02  DNAME36   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012200     02  DNAME37   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012300     02  DNAME38   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012400     02  DNAME39   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012500     02  DNAME40   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012600     02  DNAME41   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012700     02  DNAME42   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
012800 77  SIZE-ERR                     PICTURE X  VALUE SPACE.
012900 77  SIZE-ERR2                    PICTURE X  VALUE SPACE.
013000 77  SIZE-ERR3                    PICTURE X  VALUE SPACE.
013100 77  SIZE-ERR4                    PICTURE X  VALUE SPACE.
013200 77  A18TWOS-DS-18V00             PICTURE S9(18)
013300                                  VALUE 222222222222222222.
013400 77  A18ONES-DS-18V00             PICTURE S9(18)
013500                                  VALUE 111111111111111111.
013600 77  WRK-DS-10V00                 PICTURE S9(10).
013700 77  A10ONES-DS-10V00             PICTURE S9(10)
013800                                  VALUE 1111111111.
013900 77  A05ONES-DS-05V00             PICTURE S9(5)
014000                                  VALUE 11111.
014100 77  A02ONES-DS-02V00             PICTURE S99
014200                                  VALUE 11.
014300 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
014400 77  WRK-DS-18V00 REDEFINES WRK-DS-09V09
014500                                  PICTURE S9(18).
014600 77  A06THREES-DS-03V03           PICTURE S999V999
014700                                  VALUE 333.333.
014800 77  A12THREES-DS-06V06           PICTURE S9(6)V9(6)
014900                                  VALUE 333333.333333.
015000 77  WRK-DS-06V06                 PICTURE S9(6)V9(6).
015100 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06
015200                                  PICTURE S9(12).
015300 77  A05ONES-DS-00V05             PICTURE SV9(5)
015400                                  VALUE .11111.
015500 77  WRK-DS-05V00                 PICTURE S9(5).
015600 77  WRK-DS-02V00                 PICTURE S99.
015700 77  A12ONES-DS-12V00             PICTURE S9(12)
015800                                  VALUE 111111111111.
015900 77  WRK-DS-03V10                 PICTURE S999V9(10).
016000 77  WRK-DS-13V00-S REDEFINES WRK-DS-03V10
016100                                  PICTURE S9(13).
016200 77  A99-DS-02V00                 PICTURE S99
016300                                  VALUE 99.
016400 77  A03ONES-DS-02V01             PICTURE S99V9
016500                                  VALUE 11.1.
016600 77  A06ONES-DS-03V03             PICTURE S999V999
016700                                  VALUE 111.111.
016800 77  A08TWOS-DS-02V06             PICTURE S99V9(6)
016900                                  VALUE 22.222222.
017000 77  A01ONE-DS-P0801              PICTURE SP(8)9
017100                                  VALUE .000000001.
017200 77  WRK-CS-18V00                 PICTURE S9(18) COMPUTATIONAL.
017300 77  A18ONES-CS-18V00             PICTURE S9(18) COMPUTATIONAL
017400                                  VALUE 111111111111111111.
017500 77  WRK-CS-02V02                 PICTURE S99V99 COMPUTATIONAL.
017600 77  A99-CS-02V00                 PICTURE S99 COMPUTATIONAL
017700                                  VALUE 99.
017800 77  WRK-DS-0201P                 PICTURE S99P.
017900 77  WRK-DS-06V00                 PICTURE S9(6).
018000 77  AZERO-DS-05V05               PICTURE S9(5)V9(5)
018100                                  VALUE ZERO.
018200 77  NDATA-DS-09V09               PICTURE S9(9)V9(9)
018300                                  VALUE +012345678.876543210.
018400 77  XDATA-XN-00018               PICTURE X(18)
018500                                  VALUE "00ABCDEFGHI  4321 ".
018600 77  WRK-XN-00018                 PICTURE X(18).
018700 77  ADD-12    PICTURE PP9        VALUE .001.
018800 77  ADD-13    PICTURE 9PP        VALUE 100.
018900 77  ADD-14    PICTURE 999V999.
019000 77  WRK-CU-18V00      PICTURE 9(18) VALUE ZERO COMPUTATIONAL.
019100 77  A18EIGHTS-CS-18V00 PICTURE S9(18) VALUE -888888888888888888
019200             COMPUTATIONAL.
019300 77  A14TWOS-CS-18V00  PICTURE S9(18) VALUE -000022222222222222
019400             COMPUTATIONAL.
019500 77  A12THREES-CU-18V00 PICTURE 9(18) VALUE 000000333333333333
019600             COMPUTATIONAL.
019700 77  A16FOURS-CS-18V00 PICTURE S9(18) VALUE 004444444444444444
019800             COMPUTATIONAL.
019900 77  A18FIVES-CS-18V00 PICTURE S9(18) VALUE -555555555555555555
020000             COMPUTATIONAL.
020100 77  A18SIXES-CS-18V00 PICTURE S9(18) VALUE 666666666666666666
020200             COMPUTATIONAL.
020300 77  A12SEVENS-CU-18V00 PICTURE 9(18) VALUE 000000777777777777
020400             COMPUTATIONAL.
020500 77  WRK-DU-18V00      PICTURE 9(18) VALUE ZERO.
020600 77  A18THREES-CS-18V00 PICTURE S9(18) VALUE -333333333333333333
020700             COMPUTATIONAL.
020800 77  WRK-CS-03V00 PICTURE S999 COMPUTATIONAL SYNCHRONIZED RIGHT.
020900 01  SUBTRACT-DATA.
021000     02  SUBTR-1    PICTURE 9         VALUE 1.
021100     02  SUBTR-2    PICTURE S99       VALUE 99.
021200     02  SUBTR-3    PICTURE S9V99     VALUE -1.
021300     02  SUBTR-4    PICTURE SPP9      VALUE .001.
021400     02  SUBTR-5    PICTURE S9PP      VALUE 100.
021500     02  SUBTR-6    PICTURE 9  VALUE 1.
021600     02  SUBTR-7    PICTURE S99  VALUE 99.
021700     02  SUBTR-8    PICTURE S9V99  VALUE -9.99.
021800     02  SUBTR-10    PICTURE S999  VALUE 100.
021900     02  SUBTR-11   PICTURE S999V999.
022000 01  N-3                                PICTURE IS 99999.
022100 01  N-4                                PICTURE IS 9(5)
022200     VALUE IS 52800.
022300 01  N-5                                PICTURE IS S9(9)V99
022400     VALUE IS 000000001.00.
022500 01  N-7                                PICTURE IS S9(7)V9(4)
022600     VALUE IS 0000001.0000.
022700 01  X-8 REDEFINES N-7                  PICTURE IS X(11).
022800 01  N-10                               PICTURE IS S99999V
022900     VALUE IS -00001.
023000 01  N-11                               PICTURE IS 9 VALUE IS 9.
023100 01  N-12                               PICTURE IS 9 VALUE IS 9.
023200 01  N-13                               PICTURE IS 9(5)
023300     VALUE IS 99999.
023400 01  N-14                               PICTURE IS 9 VALUE IS 1.
023500 01  N-15                               PICTURE IS 9(16).
023600 01  N-16                               PICTURE IS S999999V99
023700     VALUE IS 5.90.
023800 01  N-17                               PICTURE IS S9(3)V99
023900     VALUE IS +3.6.
024000 01  N-18                               PICTURE IS S9(10)
024100     VALUE IS -5.
024200 01  N-19                               PICTURE IS $9.00.
024300 01  N-20                               PICTURE IS S9(9)
024400     VALUE IS -999999999.
024500 01  N-21                               PICTURE IS 9 VALUE IS 5.
024600 01  N-22                               PICTURE IS 999V99
024700     VALUE IS 005.55.
024800 01  N-23                               PICTURE IS $$$.99CR.
024900 01  N-25                               PICTURE IS 9 VALUE IS 1.
025000 01  N-26               PICTURE 9(5).
025100 01  N-27                               PICTURE IS 9999V9
025200     VALUE IS 9999.9.
025300 01  N-28                               PICTURE IS $9999.00.
025400 01  N-40                               PICTURE IS 9(7)
025500     VALUE IS 7777777.
025600 01  N-41                               PICTURE IS 9(7)
025700     VALUE IS 1111111.
025800 01  N-42                               PICTURE IS 9(3)P(4).
025900 01  TRUNC-DATA.
026000     02 N-43  PICTURE S9V9 VALUE +1.6.
026100     02 N-44  PICTURE S9V9 VALUE -1.6.
026200     02 N-45  PICTURE S9.
026300 01  MINUS-NAMES.
026400     02  MINUS-NAME1 PICTURE S9(18) VALUE -999999999999999999.
026500     02  MINUS-NAME2 PICTURE S9(18) VALUE -999999999999999999.
026600     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
026700     02  PLUS-NAME1  PICTURE S9(18) VALUE +999999999999999999.
026800     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
026900     02  MINUS-NAME3 PICTURE SV9(18) VALUE -.999999999999999999.
027000     02  MINUS-NAME4 PICTURE SV9(18) VALUE -.999999999999999999.
027100     02  EVEN-NAME2  PICTURE SV9(18)  VALUE +.1.
027200     02  PLUS-NAME3  PICTURE SV9(18) VALUE +.999999999999999999.
027300     02  PLUS-NAME4  PICTURE SV9(18) VALUE +.999999999999999999.
027400     02  WHOLE-FIELD   PICTURE S9(18).
027500     02  DECMAL-FIELD  PICTURE SV9(18).
027600 01  TEST-RESULTS.
027700     02 FILLER                   PIC X      VALUE SPACE.
027800     02 FEATURE                  PIC X(20)  VALUE SPACE.
027900     02 FILLER                   PIC X      VALUE SPACE.
028000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
028100     02 FILLER                   PIC X      VALUE SPACE.
028200     02  PAR-NAME.
028300       03 FILLER                 PIC X(19)  VALUE SPACE.
028400       03  PARDOT-X              PIC X      VALUE SPACE.
028500       03 DOTVALUE               PIC 99     VALUE ZERO.
028600     02 FILLER                   PIC X(8)   VALUE SPACE.
028700     02 RE-MARK                  PIC X(61).
028800 01  TEST-COMPUTED.
028900     02 FILLER                   PIC X(30)  VALUE SPACE.
029000     02 FILLER                   PIC X(17)  VALUE
029100            "       COMPUTED=".
029200     02 COMPUTED-X.
029300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
029400     03 COMPUTED-N               REDEFINES COMPUTED-A
029500                                 PIC -9(9).9(9).
029600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
029700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
029800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
029900     03       CM-18V0 REDEFINES COMPUTED-A.
030000         04 COMPUTED-18V0                    PIC -9(18).
030100         04 FILLER                           PIC X.
030200     03 FILLER PIC X(50) VALUE SPACE.
030300 01  TEST-CORRECT.
030400     02 FILLER PIC X(30) VALUE SPACE.
030500     02 FILLER PIC X(17) VALUE "       CORRECT =".
030600     02 CORRECT-X.
030700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
030800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
030900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
031000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
031100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
031200     03      CR-18V0 REDEFINES CORRECT-A.
031300         04 CORRECT-18V0                     PIC -9(18).
031400         04 FILLER                           PIC X.
031500     03 FILLER PIC X(2) VALUE SPACE.
031600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
031700 01  CCVS-C-1.
031800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
031900-    "SS  PARAGRAPH-NAME
032000-    "       REMARKS".
032100     02 FILLER                     PIC X(20)    VALUE SPACE.
032200 01  CCVS-C-2.
032300     02 FILLER                     PIC X        VALUE SPACE.
032400     02 FILLER                     PIC X(6)     VALUE "TESTED".
032500     02 FILLER                     PIC X(15)    VALUE SPACE.
032600     02 FILLER                     PIC X(4)     VALUE "FAIL".
032700     02 FILLER                     PIC X(94)    VALUE SPACE.
032800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
032900 01  REC-CT                        PIC 99       VALUE ZERO.
033000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
033100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
033200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
033300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
033400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
033500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
033600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
033700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
033800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
033900 01  CCVS-H-1.
034000     02  FILLER                    PIC X(39)    VALUE SPACES.
034100     02  FILLER                    PIC X(42)    VALUE
034200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
034300     02  FILLER                    PIC X(39)    VALUE SPACES.
034400 01  CCVS-H-2A.
034500   02  FILLER                        PIC X(40)  VALUE SPACE.
034600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
034700   02  FILLER                        PIC XXXX   VALUE
034800     "4.2 ".
034900   02  FILLER                        PIC X(28)  VALUE
035000            " COPY - NOT FOR DISTRIBUTION".
035100   02  FILLER                        PIC X(41)  VALUE SPACE.
035200
035300 01  CCVS-H-2B.
035400   02  FILLER                        PIC X(15)  VALUE
035500            "TEST RESULT OF ".
035600   02  TEST-ID                       PIC X(9).
035700   02  FILLER                        PIC X(4)   VALUE
035800            " IN ".
035900   02  FILLER                        PIC X(12)  VALUE
036000     " HIGH       ".
036100   02  FILLER                        PIC X(22)  VALUE
036200            " LEVEL VALIDATION FOR ".
036300   02  FILLER                        PIC X(58)  VALUE
036400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
036500 01  CCVS-H-3.
036600     02  FILLER                      PIC X(34)  VALUE
036700            " FOR OFFICIAL USE ONLY    ".
036800     02  FILLER                      PIC X(58)  VALUE
036900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
037000     02  FILLER                      PIC X(28)  VALUE
037100            "  COPYRIGHT   1985 ".
037200 01  CCVS-E-1.
037300     02 FILLER                       PIC X(52)  VALUE SPACE.
037400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
037500     02 ID-AGAIN                     PIC X(9).
037600     02 FILLER                       PIC X(45)  VALUE SPACES.
037700 01  CCVS-E-2.
037800     02  FILLER                      PIC X(31)  VALUE SPACE.
037900     02  FILLER                      PIC X(21)  VALUE SPACE.
038000     02 CCVS-E-2-2.
038100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
038200         03 FILLER                   PIC X      VALUE SPACE.
038300         03 ENDER-DESC               PIC X(44)  VALUE
038400            "ERRORS ENCOUNTERED".
038500 01  CCVS-E-3.
038600     02  FILLER                      PIC X(22)  VALUE
038700            " FOR OFFICIAL USE ONLY".
038800     02  FILLER                      PIC X(12)  VALUE SPACE.
038900     02  FILLER                      PIC X(58)  VALUE
039000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
039100     02  FILLER                      PIC X(13)  VALUE SPACE.
039200     02 FILLER                       PIC X(15)  VALUE
039300             " COPYRIGHT 1985".
039400 01  CCVS-E-4.
039500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
039600     02 FILLER                       PIC X(4)   VALUE " OF ".
039700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
039800     02 FILLER                       PIC X(40)  VALUE
039900      "  TESTS WERE EXECUTED SUCCESSFULLY".
040000 01  XXINFO.
040100     02 FILLER                       PIC X(19)  VALUE
040200            "*** INFORMATION ***".
040300     02 INFO-TEXT.
040400       04 FILLER                     PIC X(8)   VALUE SPACE.
040500       04 XXCOMPUTED                 PIC X(20).
040600       04 FILLER                     PIC X(5)   VALUE SPACE.
040700       04 XXCORRECT                  PIC X(20).
040800     02 INF-ANSI-REFERENCE           PIC X(48).
040900 01  HYPHEN-LINE.
041000     02 FILLER  PIC IS X VALUE IS SPACE.
041100     02 FILLER  PIC IS X(65)    VALUE IS "************************
041200-    "*****************************************".
041300     02 FILLER  PIC IS X(54)    VALUE IS "************************
041400-    "******************************".
041500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
041600     "NC106A".
041700 PROCEDURE DIVISION.
041800 CCVS1 SECTION.
041900 OPEN-FILES.
042000     OPEN     OUTPUT PRINT-FILE.
042100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
042200     MOVE    SPACE TO TEST-RESULTS.
042300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
042400     GO TO CCVS1-EXIT.
042500 CLOSE-FILES.
042600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
042700 TERMINATE-CCVS.
042800S    EXIT PROGRAM.
042900STERMINATE-CALL.
043000     STOP     RUN.
043100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
043200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
043300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
043400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
043500     MOVE "****TEST DELETED****" TO RE-MARK.
043600 PRINT-DETAIL.
043700     IF REC-CT NOT EQUAL TO ZERO
043800             MOVE "." TO PARDOT-X
043900             MOVE REC-CT TO DOTVALUE.
044000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
044100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
044200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
044300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
044400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
044500     MOVE SPACE TO CORRECT-X.
044600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
044700     MOVE     SPACE TO RE-MARK.
044800 HEAD-ROUTINE.
044900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
045200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
045300 COLUMN-NAMES-ROUTINE.
045400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
045500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
045700 END-ROUTINE.
045800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
045900 END-RTN-EXIT.
046000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046100 END-ROUTINE-1.
046200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
046300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
046400      ADD PASS-COUNTER TO ERROR-HOLD.
046500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
046600      MOVE PASS-COUNTER TO CCVS-E-4-1.
046700      MOVE ERROR-HOLD TO CCVS-E-4-2.
046800      MOVE CCVS-E-4 TO CCVS-E-2-2.
046900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
047000  END-ROUTINE-12.
047100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
047200     IF       ERROR-COUNTER IS EQUAL TO ZERO
047300         MOVE "NO " TO ERROR-TOTAL
047400         ELSE
047500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
047600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
047700     PERFORM WRITE-LINE.
047800 END-ROUTINE-13.
047900     IF DELETE-COUNTER IS EQUAL TO ZERO
048000         MOVE "NO " TO ERROR-TOTAL  ELSE
048100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
048200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
048300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
048400      IF   INSPECT-COUNTER EQUAL TO ZERO
048500          MOVE "NO " TO ERROR-TOTAL
048600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
048700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
048800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
048900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049000 WRITE-LINE.
049100     ADD 1 TO RECORD-COUNT.
049200Y    IF RECORD-COUNT GREATER 42
049300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
049400Y        MOVE SPACE TO DUMMY-RECORD
049500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
049600Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
049700Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
049800Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
049900Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
050000Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
050100Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
050200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
050300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
050400Y        MOVE ZERO TO RECORD-COUNT.
050500     PERFORM WRT-LN.
050600 WRT-LN.
050700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
050800     MOVE SPACE TO DUMMY-RECORD.
050900 BLANK-LINE-PRINT.
051000     PERFORM WRT-LN.
051100 FAIL-ROUTINE.
051200     IF     COMPUTED-X NOT EQUAL TO SPACE
051300            GO TO FAIL-ROUTINE-WRITE.
051400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
051500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
051600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
051700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051800     MOVE   SPACES TO INF-ANSI-REFERENCE.
051900     GO TO  FAIL-ROUTINE-EX.
052000 FAIL-ROUTINE-WRITE.
052100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
052200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
052300     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
052400     MOVE   SPACES TO COR-ANSI-REFERENCE.
052500 FAIL-ROUTINE-EX. EXIT.
052600 BAIL-OUT.
052700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
052800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
052900 BAIL-OUT-WRITE.
053000     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
053100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
053200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053300     MOVE   SPACES TO INF-ANSI-REFERENCE.
053400 BAIL-OUT-EX. EXIT.
053500 CCVS1-EXIT.
053600     EXIT.
053700 SECT-NC106A-001 SECTION.
053800 SUB-INIT-F1-1.
053900     MOVE "SUBTRACT" TO FEATURE.
054000     MOVE "VI-134 6.25.4 GR1" TO ANSI-REFERENCE.
054100 SUB-TEST-F1-1.
054200     SUBTRACT 1 FROM N-5.
054300     IF       N-5 EQUAL TO 0
054400              PERFORM PASS
054500              GO TO SUB-WRITE-F1-1.
054600     GO TO    SUB-FAIL-F1-1.
054700 SUB-DELETE-F1-1.
054800     PERFORM  DE-LETE.
054900     GO TO    SUB-WRITE-F1-1.
055000 SUB-FAIL-F1-1.
055100     MOVE     N-5 TO COMPUTED-N.
055200     MOVE     0 TO CORRECT-N.
055300     PERFORM  FAIL.
055400 SUB-WRITE-F1-1.
055500     MOVE "SUB-TEST-F1-1 " TO PAR-NAME.
055600     PERFORM  PRINT-DETAIL.
055700 SUB-TEST-F1-2.
055800     SUBTRACT N-17 FROM N-18 ROUNDED.
055900     IF       N-18 EQUAL TO -9
056000              PERFORM PASS
056100              GO TO SUB-WRITE-F1-2.
056200     GO TO    SUB-FAIL-F1-2.
056300 SUB-DELETE-F1-2.
056400     PERFORM  DE-LETE.
056500     GO TO    SUB-WRITE-F1-2.
056600 SUB-FAIL-F1-2.
056700     MOVE     N-18 TO COMPUTED-N.
056800     MOVE     -9 TO CORRECT-N.
056900     PERFORM  FAIL.
057000 SUB-WRITE-F1-2.
057100     MOVE "SUB-TEST-F1-2 " TO PAR-NAME.
057200     PERFORM  PRINT-DETAIL.
057300 SUB-INIT-F1-3.
057400     MOVE     -00001 TO N-10.
057500     MOVE      99999 TO N-13.
057600 SUB-TEST-F1-3-0.
057700     SUBTRACT N-10 FROM N-13 ON SIZE ERROR
057800              PERFORM PASS
057900              GO TO SUB-WRITE-F1-3-1.
058000     GO TO    SUB-FAIL-F1-3-1.
058100 SUB-DELETE-F1-3-1.
058200     PERFORM  DE-LETE.
058300     GO TO    SUB-WRITE-F1-3-1.
058400 SUB-FAIL-F1-3-1.
058500     MOVE     N-13 TO COMPUTED-N.
058600     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
058700     PERFORM  FAIL.
058800 SUB-WRITE-F1-3-1.
058900     MOVE "SUB-TEST-F1-3-1 " TO PAR-NAME.
059000     PERFORM  PRINT-DETAIL.
059100 SUB-TEST-F1-3-2.
059200     IF       N-13 = 99999
059300              PERFORM PASS
059400              GO TO SUB-WRITE-F1-3-2.
059500     GO TO    SUB-FAIL-F1-3-2.
059600 SUB-DELETE-F1-3-2.
059700     PERFORM  DE-LETE.
059800     GO TO    SUB-WRITE-F1-3-2.
059900 SUB-FAIL-F1-3-2.
060000     MOVE     N-13  TO COMPUTED-N.
060100     MOVE     99999 TO CORRECT-N.
060200     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
060300     PERFORM  FAIL.
060400 SUB-WRITE-F1-3-2.
060500     MOVE "SUB-TEST-F1-3-2 " TO PAR-NAME.
060600     PERFORM  PRINT-DETAIL.
060700 SUB-INIT-F1-4-1.
060800     MOVE  -999999999 TO N-20.
060900 SUB-TEST-F1-4-1.
061000     SUBTRACT .7 FROM N-20 ROUNDED ON SIZE ERROR
061100              PERFORM PASS
061200              GO TO SUB-WRITE-F1-4-1.
061300     GO TO    SUB-FAIL-F1-4-1.
061400 SUB-DELETE-F1-4-1.
061500     PERFORM  DE-LETE.
061600     GO TO    SUB-WRITE-F1-4-1.
061700 SUB-FAIL-F1-4-1.
061800     MOVE     N-20 TO COMPUTED-N.
061900     MOVE     -999999999 TO CORRECT-N.
062000     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
062100     PERFORM  FAIL.
062200 SUB-WRITE-F1-4-1.
062300     MOVE "SUB-TEST-F1-4-1 " TO PAR-NAME.
062400     PERFORM  PRINT-DETAIL.
062500 SUB-TEST-F1-4-2.
062600     IF       N-20 = -999999999
062700              PERFORM PASS
062800              GO TO SUB-WRITE-F1-4-2.
062900     GO TO    SUB-FAIL-F1-4-2.
063000 SUB-DELETE-F1-4-2.
063100     PERFORM  DE-LETE.
063200     GO TO    SUB-WRITE-F1-4-2.
063300 SUB-FAIL-F1-4-2.
063400     MOVE     N-20 TO COMPUTED-N.
063500     MOVE     -999999999 TO CORRECT-N.
063600     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
063700     PERFORM  FAIL.
063800 SUB-WRITE-F1-4-2.
063900     MOVE "SUB-TEST-F1-4-2 " TO PAR-NAME.
064000     PERFORM  PRINT-DETAIL.
064100 SUB-INIT-F1-5.
064200     MOVE     "SUBTRACT ---" TO FEATURE.
064300     PERFORM  PRINT-DETAIL.
064400     MOVE     "  FROM" TO FEATURE.
064500 SUB-TEST-F1-5.
064600     MOVE     A18TWOS-DS-18V00 TO WRK-DS-18V00.
064700     SUBTRACT A18ONES-DS-18V00 FROM WRK-DS-18V00.
064800     IF       WRK-DS-18V00 EQUAL TO 111111111111111111
064900              PERFORM PASS GO TO SUB-WRITE-F1-5.
065000     GO       TO SUB-FAIL-F1-5.
065100 SUB-DELETE-F1-5.
065200     PERFORM  DE-LETE.
065300     GO       TO SUB-WRITE-F1-5.
065400 SUB-FAIL-F1-5.
065500     MOVE     WRK-DS-18V00 TO COMPUTED-18V0.
065600     MOVE     111111111111111111 TO CORRECT-18V0.
065700     PERFORM  FAIL.
065800 SUB-WRITE-F1-5.
065900     MOVE     "SUB-TEST-F1-5" TO PAR-NAME.
066000     PERFORM  PRINT-DETAIL.
066100 SUB-TEST-F1-6.
066200     MOVE     A12THREES-DS-06V06 TO WRK-DS-06V06.
066300     SUBTRACT A05ONES-DS-05V00
066400              A05ONES-DS-00V05
066500              A06ONES-DS-03V03 FROM WRK-DS-06V06.
066600     IF       WRK-DS-06V06 EQUAL TO 322111.111223
066700              PERFORM PASS GO TO SUB-WRITE-F1-6.
066800     GO       TO SUB-FAIL-F1-6.
066900 SUB-DELETE-F1-6.
067000     PERFORM  DE-LETE.
067100     GO       TO SUB-WRITE-F1-6.
067200 SUB-FAIL-F1-6.
067300     MOVE     WRK-DS-06V06 TO COMPUTED-N.
067400     MOVE     322111.111223 TO CORRECT-N.
067500     PERFORM  FAIL.
067600 SUB-WRITE-F1-6.
067700     MOVE     "SUB-TEST-F1-6" TO PAR-NAME.
067800     PERFORM  PRINT-DETAIL.
067900 SUB-INIT-F1-7.
068000     MOVE     "  ROUNDED" TO FEATURE.
068100 SUB-TEST-F1-7.
068200     MOVE     ZERO TO WRK-DS-0201P.
068300     SUBTRACT A99-DS-02V00 FROM WRK-DS-0201P ROUNDED.
068400     IF       WRK-DS-0201P EQUAL TO -100
068500              PERFORM PASS GO TO SUB-WRITE-F1-7.
068600     GO       TO SUB-FAIL-F1-7.
068700 SUB-DELETE-F1-7.
068800     PERFORM  DE-LETE.
068900     GO       TO SUB-WRITE-F1-7.
069000 SUB-FAIL-F1-7.
069100     MOVE     WRK-DS-0201P TO COMPUTED-N.
069200     MOVE    -100 TO CORRECT-N.
069300     PERFORM  FAIL.
069400 SUB-WRITE-F1-7.
069500     MOVE     "SUB-TEST-F1-7" TO PAR-NAME.
069600     PERFORM  PRINT-DETAIL.
069700 SUB-INIT-F1-8-1.
069800     MOVE     "  SIZE ERROR" TO FEATURE.
069900     MOVE     -11 TO WRK-DS-02V00.
070000 SUB-TEST-F1-8-1.
070100     SUBTRACT A99-DS-02V00 FROM WRK-DS-02V00 ON SIZE ERROR
070200              PERFORM PASS GO TO SUB-WRITE-F1-8-1.
070300     GO       TO SUB-FAIL-F1-8-1.
070400 SUB-DELETE-F1-8-1.
070500     PERFORM  DE-LETE.
070600     GO       TO SUB-WRITE-F1-8-1.
070700 SUB-FAIL-F1-8-1.
070800     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
070900     PERFORM  FAIL.
071000 SUB-WRITE-F1-8-1.
071100     MOVE     "SUB-TEST-F1-8-1" TO PAR-NAME.
071200     PERFORM  PRINT-DETAIL.
071300 SUB-TEST-F1-8-2.
071400     IF       WRK-DS-02V00 EQUAL TO -11
071500              PERFORM PASS GO TO SUB-WRITE-F1-8-2.
071600*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-F1-8-1
071700     GO       TO SUB-FAIL-F1-8-2.
071800 SUB-DELETE-F1-8-2.
071900     PERFORM  DE-LETE.
072000     GO       TO SUB-WRITE-F1-8-2.
072100 SUB-FAIL-F1-8-2.
072200     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
072300     MOVE     WRK-DS-02V00 TO COMPUTED-N.
072400     MOVE     -11 TO CORRECT-N.
072500     PERFORM  FAIL.
072600 SUB-WRITE-F1-8-2.
072700     MOVE     "SUB-TEST-F1-8-2" TO PAR-NAME.
072800     PERFORM  PRINT-DETAIL.
072900 SUB-INIT-F1-9-1.
073000     MOVE     "  ROUNDED,SIZE ERROR" TO FEATURE.
073100 SUB-TEST-F1-9-1.
073200     MOVE     ZERO TO WRK-DS-05V00.
073300     SUBTRACT 33333
073400              A06THREES-DS-03V03
073500              A12THREES-DS-06V06
073600              FROM WRK-DS-05V00 ROUNDED ON SIZE ERROR
073700              PERFORM PASS GO TO SUB-WRITE-F1-9-1.
073800     GO       TO SUB-FAIL-F1-9-1.
073900 SUB-DELETE-F1-9-1.
074000     PERFORM  DE-LETE.
074100     GO       TO SUB-WRITE-F1-9-1.
074200 SUB-FAIL-F1-9-1.
074300     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
074400     PERFORM  FAIL.
074500 SUB-WRITE-F1-9-1.
074600     MOVE     "SUB-TEST-F1-9-1" TO PAR-NAME.
074700     PERFORM  PRINT-DETAIL.
074800 SUB-TEST-F1-9-2.
074900     IF       WRK-DS-05V00 EQUAL TO ZERO
075000              PERFORM PASS GO TO SUB-WRITE-F1-9-2.
075100*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-F1-9-1
075200     GO       TO SUB-FAIL-F1-9-2.
075300 SUB-DELETE-F1-9-2.
075400     PERFORM  DE-LETE.
075500     GO       TO SUB-WRITE-F1-9-2.
075600 SUB-FAIL-F1-9-2.
075700     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
075800     MOVE     WRK-DS-05V00 TO COMPUTED-N.
075900     MOVE     ZERO TO CORRECT-N.
076000     PERFORM  FAIL.
076100 SUB-WRITE-F1-9-2.
076200     MOVE     "SUB-TEST-F1-9-2" TO PAR-NAME.
076300     PERFORM  PRINT-DETAIL.
076400 SUB-INIT-F1-10.
076500     MOVE     ZERO TO WRK-DS-06V06.
076600 SUB-TEST-F1-10-1.
076700     SUBTRACT A12THREES-DS-06V06
076800              333333
076900              A06THREES-DS-03V03
077000              -0000009
077100              FROM WRK-DS-06V06 ROUNDED ON SIZE ERROR
077200              GO TO SUB-FAIL-F1-10-1.
077300     PERFORM  PASS.
077400     GO       TO SUB-WRITE-F1-10-1.
077500 SUB-DELETE-F1-10-1.
077600     PERFORM  DE-LETE.
077700     GO       TO SUB-WRITE-F1-10-1.
077800 SUB-FAIL-F1-10-1.
077900     MOVE     "SIZE ERR SHOULD NOT EXECUTE" TO RE-MARK.
078000     PERFORM  FAIL.
078100 SUB-WRITE-F1-10-1.
078200     MOVE     "SUB-TEST-F1-10-1" TO PAR-NAME.
078300     PERFORM  PRINT-DETAIL.
078400 SUB-TEST-F1-10-2.
078500     IF       WRK-DS-06V06 EQUAL TO -666990.666333
078600              PERFORM PASS GO TO SUB-WRITE-F1-10-2.
078700*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-F1-10-1
078800     GO       TO SUB-FAIL-F1-10-2.
078900 SUB-DELETE-F1-10-2.
079000     PERFORM  DE-LETE.
079100     GO       TO SUB-WRITE-F1-10-2.
079200 SUB-FAIL-F1-10-2.
079300     MOVE     WRK-DS-06V06 TO COMPUTED-N.
079400     MOVE     -666990.666333 TO CORRECT-N.
079500     PERFORM  FAIL.
079600 SUB-WRITE-F1-10-2.
079700     MOVE     "SUB-TEST-F1-10-2" TO PAR-NAME.
079800     PERFORM  PRINT-DETAIL.
079900 SUB-INIT-F1-11.
080000     MOVE     "  COMP VS. DISPLAY" TO FEATURE.
080100 SUB-TEST-F1-11.
080200     MOVE     ZERO TO WRK-CS-18V00
080300     SUBTRACT A18ONES-DS-18V00 FROM WRK-CS-18V00.
080400     IF       WRK-CS-18V00 EQUAL TO -111111111111111111
080500              PERFORM PASS GO TO SUB-WRITE-F1-11.
080600     GO       TO SUB-FAIL-F1-11.
080700 SUB-DELETE-F1-11.
080800     PERFORM  DE-LETE.
080900     GO       TO SUB-WRITE-F1-11.
081000 SUB-FAIL-F1-11.
081100     MOVE     WRK-CS-18V00 TO COMPUTED-18V0.
081200     MOVE     -111111111111111111 TO CORRECT-18V0.
081300     PERFORM  FAIL.
081400 SUB-WRITE-F1-11.
081500     MOVE     "SUB-TEST-F1-11" TO PAR-NAME.
081600     PERFORM  PRINT-DETAIL.
081700 SUB-TEST-F1-12.
081800     MOVE     ZERO TO WRK-DS-18V00.
081900     SUBTRACT A18ONES-CS-18V00 FROM WRK-DS-18V00.
082000     IF       WRK-DS-18V00 EQUAL TO -111111111111111111
082100              PERFORM PASS GO TO SUB-WRITE-F1-12.
082200     GO       TO SUB-FAIL-F1-12.
082300 SUB-DELETE-F1-12.
082400     PERFORM  DE-LETE.
082500     GO       TO SUB-WRITE-F1-12.
082600 SUB-FAIL-F1-12.
082700     MOVE     WRK-DS-18V00 TO COMPUTED-18V0.
082800     MOVE     -111111111111111111 TO CORRECT-18V0.
082900     PERFORM  FAIL.
083000 SUB-WRITE-F1-12.
083100     MOVE     "SUB-TEST-F1-12" TO PAR-NAME.
083200     PERFORM  PRINT-DETAIL.
083300 SUB-TEST-F1-13.
083400     MOVE     ZERO TO WRK-CS-02V02.
083500     SUBTRACT A99-CS-02V00 FROM WRK-CS-02V02.
083600     IF       WRK-CS-02V02 EQUAL TO -99.00
083700              PERFORM PASS GO TO SUB-WRITE-F1-13.
083800     GO       TO SUB-FAIL-F1-13.
083900 SUB-DELETE-F1-13.
084000     PERFORM  DE-LETE.
084100     GO       TO SUB-WRITE-F1-13.
084200 SUB-FAIL-F1-13.
084300     MOVE     WRK-CS-02V02 TO COMPUTED-N.
084400     MOVE     -99.00 TO CORRECT-N.
084500     PERFORM  FAIL.
084600 SUB-WRITE-F1-13.
084700     MOVE     "SUB-TEST-F1-13" TO PAR-NAME.
084800     PERFORM  PRINT-DETAIL.
084900 SUB-TEST-F1-14-1.
085000     MOVE     A99-CS-02V00 TO WRK-CS-02V02.
085100     SUBTRACT -99 FROM WRK-CS-02V02 ON SIZE ERROR
085200              PERFORM PASS GO TO SUB-WRITE-F1-14-1.
085300     GO       TO SUB-FAIL-F1-14-1.
085400 SUB-DELETE-F1-14-1.
085500     PERFORM  DE-LETE.
085600     GO       TO SUB-WRITE-F1-14-1.
085700 SUB-FAIL-F1-14-1.
085800     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
085900     PERFORM  FAIL.
086000 SUB-WRITE-F1-14-1.
086100     MOVE     "SUB-TEST-F1-14-1" TO PAR-NAME.
086200     PERFORM  PRINT-DETAIL.
086300 SUB-TEST-F1-14-2.
086400     IF       WRK-CS-02V02 EQUAL TO 99
086500              PERFORM PASS GO TO SUB-WRITE-F1-14-2.
086600*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-F1-14-1
086700     GO       TO SUB-FAIL-F1-14-2.
086800 SUB-DELETE-F1-14-2.
086900     PERFORM  DE-LETE.
087000     GO       TO SUB-WRITE-F1-14-2.
087100 SUB-FAIL-F1-14-2.
087200     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
087300     MOVE     WRK-CS-02V02 TO COMPUTED-N.
087400     MOVE     99 TO CORRECT-N.
087500     PERFORM  FAIL.
087600 SUB-WRITE-F1-14-2.
087700     MOVE     "SUB-TEST-F1-14-2" TO PAR-NAME.
087800     PERFORM  PRINT-DETAIL.
087900 SUB-TEST-F1-15.
088000     SUBTRACT SUBTR-1 SUBTR-3 FROM SUBTR-7.
088100     IF       SUBTR-7 EQUAL TO 99
088200              PERFORM PASS GO TO SUB-WRITE-F1-15.
088300     GO       TO SUB-FAIL-F1-15.
088400 SUB-DELETE-F1-15.
088500     PERFORM DE-LETE.
088600     GO       TO SUB-WRITE-F1-15.
088700 SUB-FAIL-F1-15.
088800     MOVE     SUBTR-7 TO COMPUTED-N.
088900     MOVE     99        TO CORRECT-N.
089000     PERFORM FAIL.
089100 SUB-WRITE-F1-15.
089200     MOVE     "SUB-TEST-F1-15" TO PAR-NAME.
089300     PERFORM PRINT-DETAIL.
089400 SUB-TEST-F1-16.
089500     SUBTRACT SUBTR-5 -98 SUBTR-3 -1 FROM SUBTR-10.
089600     IF       SUBTR-10 EQUAL TO 100
089700              PERFORM PASS GO TO SUB-WRITE-F1-16.
089800     GO       TO SUB-FAIL-F1-16.
089900 SUB-DELETE-F1-16.
090000     PERFORM DE-LETE.
090100     GO       TO SUB-WRITE-F1-16.
090200 SUB-FAIL-F1-16.
090300     MOVE     SUBTR-10  TO COMPUTED-N.
090400     MOVE     100       TO CORRECT-N.
090500     PERFORM FAIL.
090600 SUB-WRITE-F1-16.
090700     MOVE     "SUB-TEST-F1-16" TO PAR-NAME.
090800     PERFORM PRINT-DETAIL.
090900 SUB-TEST-F1-17.
091000     SUBTRACT SUBTR-4 FROM SUBTR-6 ROUNDED.
091100     IF       SUBTR-6 EQUAL TO 1
091200              PERFORM PASS GO TO SUB-WRITE-F1-17.
091300     GO       TO SUB-FAIL-F1-17.
091400 SUB-DELETE-F1-17.
091500     PERFORM DE-LETE.
091600     GO       TO SUB-WRITE-F1-17.
091700 SUB-FAIL-F1-17.
091800     MOVE     SUBTR-6   TO COMPUTED-N.
091900     MOVE     1         TO CORRECT-N.
092000     PERFORM FAIL.
092100 SUB-WRITE-F1-17.
092200     MOVE     "SUB-TEST-F1-17" TO PAR-NAME.
092300     PERFORM PRINT-DETAIL.
092400 SUB-TEST-F1-18-1.
092500     SUBTRACT .01 FROM SUBTR-8 ON SIZE ERROR
092600              PERFORM PASS GO TO SUB-WRITE-F1-18-1.
092700     GO       TO SUB-FAIL-F1-18-1.
092800 SUB-DELETE-F1-18-1.
092900     PERFORM DE-LETE.
093000     GO       TO SUB-WRITE-F1-18-1.
093100 SUB-FAIL-F1-18-1.
093200     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
093300     PERFORM FAIL.
093400 SUB-WRITE-F1-18-1.
093500     MOVE     "SUB-TEST-F1-18-1" TO PAR-NAME.
093600     PERFORM PRINT-DETAIL.
093700 SUB-TEST-F1-18-2.
093800     IF       SUBTR-8 EQUAL TO -9.99
093900              PERFORM PASS GO TO SUB-WRITE-F1-18-2.
094000*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-F1-18-1
094100     GO       TO SUB-FAIL-F1-18-2.
094200 SUB-DELETE-F1-18-2.
094300     PERFORM DE-LETE.
094400     GO       TO SUB-WRITE-F1-18-2.
094500 SUB-FAIL-F1-18-2.
094600     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
094700     MOVE     SUBTR-8   TO COMPUTED-N.
094800     MOVE     -9.99     TO CORRECT-N.
094900     PERFORM FAIL.
095000 SUB-WRITE-F1-18-2.
095100     MOVE     "SUB-TEST-F1-18-2" TO PAR-NAME.
095200     PERFORM PRINT-DETAIL.
095300 SUB-TEST-F1-19.
095400     MOVE A18FIVES-CS-18V00 TO WRK-CS-18V00.
095500     SUBTRACT A18THREES-CS-18V00 FROM WRK-CS-18V00.
095600     IF WRK-CS-18V00 EQUAL TO -222222222222222222
095700         PERFORM PASS
095800         GO TO SUB-WRITE-F1-19.
095900     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
096000     MOVE -222222222222222222 TO CORRECT-18V0.
096100     PERFORM FAIL.
096200     GO TO SUB-WRITE-F1-19.
096300 SUB-DELETE-F1-19.
096400     PERFORM DE-LETE.
096500 SUB-WRITE-F1-19.
096600     MOVE "SUB-TEST-F1-19 " TO PAR-NAME.
096700     PERFORM PRINT-DETAIL.
096800 SUB-TEST-F1-20.
096900     MOVE     -980 TO WRK-CS-03V00.
097000     MOVE     SPACE TO SIZE-ERR.
097100*        NOTE IN THIS TEST, 1 IS SUBTRACTED FROM A 3-DIGIT COMP
097200*             SYNC FIELD UNTIL A SIZE ERROR OCCURS --- IF THE
097300*             VALUE OF THE FIELD REACHES -1180 WITHOUT A SIZE
097400*             ERROR, THEN THE ATTEMPTED SUBTRACTIONS ARE STOPPED.
097500     PERFORM  SUB-A-F1-20 THRU SUB-B-F1-20 200 TIMES.
097600     IF       SIZE-ERR EQUAL TO SPACE
097700              MOVE "SIZE ERROR NOT ENCOUNTERED" TO RE-MARK
097800              MOVE "-1180 OR LESS" TO COMPUTED-A
097900              MOVE "-999 IN S999 FIELD" TO CORRECT-A
098000              PERFORM FAIL
098100              GO TO SUB-WRITE-F1-20.
098200     IF       WRK-CS-03V00 EQUAL TO -999
098300              PERFORM PASS GO TO SUB-WRITE-F1-20.
098400     PERFORM  FAIL.
098500     MOVE     WRK-CS-03V00 TO COMPUTED-N.
098600     MOVE     -999 TO CORRECT-N.
098700     GO       TO SUB-WRITE-F1-20.
098800 SUB-DELETE-F1-20.
098900     PERFORM  DE-LETE.
099000     GO       TO SUB-WRITE-F1-20.
099100 SUB-A-F1-20.
099200     IF       SIZE-ERR EQUAL TO "E" GO TO SUB-B-F1-20.
099300     SUBTRACT 1 FROM WRK-CS-03V00 ON SIZE ERROR
099400              MOVE "E" TO SIZE-ERR.
099500 SUB-B-F1-20.
099600     EXIT.
099700 SUB-WRITE-F1-20.
099800     MOVE     "SUBT, COMP, SIZE ERR" TO FEATURE.
099900     MOVE     "SUB-TEST-F1-20" TO PAR-NAME.
100000     PERFORM  PRINT-DETAIL.
100100*
100200 SUB-INIT-F1-21.
100300*    ==-->  NEW SIZE ERROR TESTS  <--==
100400     MOVE     "VI-67 6.4.2" TO ANSI-REFERENCE.
100500     MOVE     -11 TO WRK-DS-02V00.
100600 SUB-TEST-F1-21.
100700     SUBTRACT A99-DS-02V00 FROM WRK-DS-02V00
100800          NOT ON SIZE ERROR
100900              GO TO SUB-FAIL-F1-21.
101000     PERFORM  PASS GO TO SUB-WRITE-F1-21.
101100 SUB-DELETE-F1-21.
101200     PERFORM  DE-LETE.
101300     GO       TO SUB-WRITE-F1-21.
101400 SUB-FAIL-F1-21.
101500     MOVE  "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
101600     PERFORM  FAIL.
101700 SUB-WRITE-F1-21.
101800     MOVE     "SUB-TEST-F1-21" TO PAR-NAME.
101900     PERFORM  PRINT-DETAIL.
102000*
102100 SUB-INIT-F1-22.
102200*    ==-->  NEW SIZE ERROR TESTS  <--==
102300     MOVE     "VI-67 6.4.2" TO ANSI-REFERENCE.
102400     MOVE     ZERO TO WRK-DS-06V06.
102500 SUB-TEST-F1-22.
102600     SUBTRACT A12THREES-DS-06V06
102700              333333
102800              A06THREES-DS-03V03
102900              -0000009
103000              FROM WRK-DS-06V06 ROUNDED
103100          NOT ON SIZE ERROR
103200              PERFORM PASS
103300              GO TO   SUB-WRITE-F1-22.
103400     GO TO    SUB-FAIL-F1-22.
103500 SUB-DELETE-F1-22.
103600     PERFORM  DE-LETE.
103700     GO       TO SUB-WRITE-F1-22.
103800 SUB-FAIL-F1-22.
103900     MOVE     "NOT ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
104000     PERFORM  FAIL.
104100 SUB-WRITE-F1-22.
104200     MOVE     "SUB-TEST-F1-22" TO PAR-NAME.
104300     PERFORM  PRINT-DETAIL.
104400*
104500 SUB-INIT-F1-23.
104600*    ==-->  NEW SIZE ERROR TESTS  <--==
104700     MOVE     "VI-67 6.4.2" TO ANSI-REFERENCE.
104800     MOVE     -11 TO WRK-DS-02V00.
104900 SUB-TEST-F1-23.
105000     SUBTRACT A99-DS-02V00 FROM WRK-DS-02V00
105100              ON SIZE ERROR
105200              PERFORM  PASS GO TO SUB-WRITE-F1-23
105300          NOT ON SIZE ERROR
105400              GO TO SUB-FAIL-F1-23.
105500 SUB-DELETE-F1-23.
105600     PERFORM  DE-LETE.
105700     GO       TO SUB-WRITE-F1-23.
105800 SUB-FAIL-F1-23.
105900     MOVE  "ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
106000     PERFORM  FAIL.
106100 SUB-WRITE-F1-23.
106200     MOVE     "SUB-TEST-F1-23" TO PAR-NAME.
106300     PERFORM  PRINT-DETAIL.
106400*
106500 SUB-INIT-F1-24.
106600*    ==-->  NEW SIZE ERROR TESTS  <--==
106700     MOVE     "VI-67 6.4.2" TO ANSI-REFERENCE.
106800     MOVE     ZERO TO WRK-DS-06V06.
106900 SUB-TEST-F1-24.
107000     SUBTRACT A12THREES-DS-06V06
107100              333333
107200              A06THREES-DS-03V03
107300              -0000009
107400              FROM WRK-DS-06V06 ROUNDED
107500              ON SIZE ERROR
107600              GO TO    SUB-FAIL-F1-24
107700          NOT ON SIZE ERROR
107800              PERFORM PASS
107900              GO TO    SUB-WRITE-F1-24.
108000 SUB-DELETE-F1-24.
108100     PERFORM  DE-LETE.
108200     GO       TO SUB-WRITE-F1-24.
108300 SUB-FAIL-F1-24.
108400     MOVE     "ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
108500     PERFORM  FAIL.
108600 SUB-WRITE-F1-24.
108700     MOVE     "SUB-TEST-F1-24" TO PAR-NAME.
108800     PERFORM  PRINT-DETAIL.
108900*
109000 SUB-INIT-F1-25.
109100*    ==-->  MULTIPLE OPERANDS  <--==
109200     MOVE "VI-67 6.4.2" TO ANSI-REFERENCE.
109300     MOVE "SUBTR LIMIT TESTS " TO FEATURE.
109400     MOVE  1 TO DNAME1   DNAME2   DNAME3   DNAME4   DNAME5.
109500     MOVE  1 TO DNAME6   DNAME7   DNAME8   DNAME9   DNAME10.
109600     MOVE  1 TO DNAME11  DNAME12  DNAME13  DNAME14  DNAME14.
109700     MOVE  1 TO DNAME16  DNAME17  DNAME18  DNAME19  DNAME20.
109800     MOVE  1 TO DNAME21.
109900     MOVE 21 TO DNAME22  DNAME23  DNAME24  DNAME25  DNAME26.
110000     MOVE 21 TO DNAME27  DNAME28  DNAME29  DNAME30  DNAME31.
110100     MOVE 21 TO DNAME32  DNAME33  DNAME34  DNAME35  DNAME36.
110200     MOVE 21 TO DNAME37  DNAME38  DNAME39  DNAME40  DNAME41.
110300     MOVE 21 TO DNAME42.
110400*    THE FOLLOWING 22 TESTS VERIFY THE ABILITY OF THE COMPILER
110500*    TO HANDLE A MAXIMUM OF 42 OPERANDS IN A SUBTRACT STATEMENT.
110600*    A DELETION IN THIS PARAGRAPH WILL SKIP THE LIMIT TESTS.
110700     GO TO SUB-TEST-F1-25-0.
110800 SUB-DELETE-F1-25-0.
110900     PERFORM DE-LETE.
111000     MOVE "SUB-TEST-F1-25 - 26 " TO PAR-NAME.
111100     MOVE "SUBTR LIMITS TESTS " TO FEATURE.
111200     ADD 21 TO DELETE-COUNTER.
111300     PERFORM PRINT-DETAIL.
111400     GO TO SUB-INIT-F1-26.
111500 SUB-TEST-F1-25-0.
111600     SUBTRACT DNAME1
111700              DNAME2
111800              DNAME3
111900              DNAME4
112000              DNAME5
112100              DNAME6
112200              DNAME7
112300              DNAME8
112400              DNAME9
112500              DNAME10
112600              DNAME11
112700              DNAME12
112800              DNAME13
112900              DNAME14
113000              DNAME15
113100              DNAME16
113200              DNAME17
113300              DNAME18
113400              DNAME19
113500              DNAME20
113600              DNAME21
113700         FROM DNAME22.
113800 SUB-TEST-F1-25-1.
113900     IF DNAME22 EQUAL TO ZERO
114000         PERFORM PASS
114100         GO TO SUB-WRITE-F1-25.
114200     MOVE DNAME22 TO COMPUTED-18V0.
114300     MOVE ZERO TO CORRECT-18V0.
114400     PERFORM FAIL.
114500     GO TO SUB-WRITE-F1-25.
114600 SUB-DELETE-F1-25.
114700     PERFORM DE-LETE.
114800 SUB-WRITE-F1-25.
114900     MOVE   "SUB-TEST-F1-25" TO PAR-NAME.
115000     PERFORM PRINT-DETAIL.
115100 SUB-INIT-F1-26.
115200     MOVE 21 TO DNAME22  DNAME23  DNAME24  DNAME25  DNAME26.
115300     MOVE 21 TO DNAME27  DNAME28  DNAME29  DNAME30  DNAME31.
115400     MOVE 21 TO DNAME32  DNAME33  DNAME34  DNAME35  DNAME36.
115500     MOVE 21 TO DNAME37  DNAME38  DNAME39  DNAME40  DNAME41.
115600     MOVE 21 TO DNAME42.
115700 SUB-TEST-F1-26-0.
115800     SUBTRACT DNAME1
115900              DNAME2
116000              DNAME3
116100              DNAME4
116200              DNAME5
116300              DNAME6
116400              DNAME7
116500              DNAME8
116600              DNAME9
116700              DNAME10
116800              DNAME11
116900              DNAME12
117000              DNAME13
117100              DNAME14
117200              DNAME15
117300              DNAME16
117400              DNAME17
117500              DNAME18
117600              DNAME19
117700              DNAME20
117800              DNAME21
117900         FROM DNAME22
118000              DNAME23
118100              DNAME24
118200              DNAME25
118300              DNAME26
118400              DNAME27
118500              DNAME28
118600              DNAME29
118700              DNAME30
118800              DNAME31
118900              DNAME32
119000              DNAME33
119100              DNAME34
119200              DNAME35
119300              DNAME36
119400              DNAME37
119500              DNAME38
119600              DNAME39
119700              DNAME40
119800              DNAME41
119900              DNAME42.
120000 SUB-TEST-F1-26-1.
120100     IF DNAME22 EQUAL TO ZERO
120200         PERFORM PASS
120300         GO TO SUB-WRITE-F1-26-1.
120400     MOVE DNAME22 TO COMPUTED-18V0.
120500     MOVE ZERO TO CORRECT-18V0.
120600     PERFORM FAIL.
120700     GO TO SUB-WRITE-F1-26-1.
120800 SUB-DELETE-F1-26-1.
120900     PERFORM DE-LETE.
121000 SUB-WRITE-F1-26-1.
121100     MOVE "SUB-TEST-F1-26-1" TO PAR-NAME.
121200     PERFORM PRINT-DETAIL.
121300 SUB-TEST-F1-26-2.
121400     IF DNAME23 EQUAL TO ZERO
121500         PERFORM PASS
121600         GO TO SUB-WRITE-F1-26-2.
121700     MOVE ZERO TO CORRECT-18V0.
121800     MOVE DNAME23 TO COMPUTED-18V0.
121900     PERFORM FAIL.
122000     GO TO SUB-WRITE-F1-26-2.
122100 SUB-DELETE-F1-26-2.
122200     PERFORM DE-LETE.
122300 SUB-WRITE-F1-26-2.
122400     MOVE "SUB-TEST-F1-26-2 " TO PAR-NAME.
122500     PERFORM PRINT-DETAIL.
122600 SUB-TEST-F1-26-3.
122700     IF DNAME24 EQUAL TO ZERO
122800         PERFORM PASS
122900         GO TO SUB-WRITE-F1-26-3.
123000     MOVE ZERO TO CORRECT-18V0.
123100     MOVE DNAME24 TO COMPUTED-18V0.
123200     PERFORM FAIL.
123300     GO TO SUB-WRITE-F1-26-3.
123400 SUB-DELETE-F1-26-3.
123500     PERFORM DE-LETE.
123600 SUB-WRITE-F1-26-3.
123700     MOVE "SUB-TEST-F1-26-3 " TO PAR-NAME.
123800     PERFORM PRINT-DETAIL.
123900 SUB-TEST-F1-26-4.
124000     IF DNAME25 EQUAL TO ZERO
124100         PERFORM PASS
124200         GO TO SUB-WRITE-F1-26-4.
124300     MOVE ZERO TO CORRECT-18V0.
124400     MOVE DNAME25 TO COMPUTED-18V0.
124500     PERFORM FAIL.
124600     GO TO SUB-WRITE-F1-26-4.
124700 SUB-DELETE-F1-26-4.
124800     PERFORM DE-LETE.
124900 SUB-WRITE-F1-26-4.
125000     MOVE "SUB-TEST-F1-26-4 " TO PAR-NAME.
125100     PERFORM PRINT-DETAIL.
125200 SUB-TEST-F1-26-5.
125300     IF DNAME26 EQUAL TO ZERO
125400         PERFORM PASS
125500         GO TO SUB-WRITE-F1-26-5.
125600     MOVE ZERO TO CORRECT-18V0.
125700     MOVE DNAME26 TO COMPUTED-18V0.
125800     PERFORM FAIL.
125900     GO TO SUB-WRITE-F1-26-5.
126000 SUB-DELETE-F1-26-5.
126100     PERFORM DE-LETE.
126200 SUB-WRITE-F1-26-5.
126300     MOVE "SUB-TEST-F1-26-5 " TO PAR-NAME.
126400     PERFORM PRINT-DETAIL.
126500 SUB-TEST-F1-26-6.
126600     IF DNAME27 EQUAL TO ZERO
126700         PERFORM PASS
126800         GO TO SUB-WRITE-F1-26-6.
126900     MOVE ZERO TO CORRECT-18V0.
127000     MOVE DNAME27 TO COMPUTED-18V0.
127100     PERFORM FAIL.
127200     GO TO SUB-WRITE-F1-26-6.
127300 SUB-DELETE-F1-26-6.
127400     PERFORM DE-LETE.
127500 SUB-WRITE-F1-26-6.
127600     MOVE "SUB-TEST-F1-26-6 " TO PAR-NAME.
127700     PERFORM PRINT-DETAIL.
127800 SUB-TEST-F1-26-7.
127900     IF DNAME28 EQUAL TO ZERO
128000         PERFORM PASS
128100         GO TO SUB-WRITE-F1-26-7.
128200     MOVE ZERO TO CORRECT-18V0.
128300     MOVE DNAME28 TO COMPUTED-18V0.
128400     PERFORM FAIL.
128500     GO TO SUB-WRITE-F1-26-7.
128600 SUB-DELETE-F1-26-7.
128700     PERFORM DE-LETE.
128800 SUB-WRITE-F1-26-7.
128900     MOVE "SUB-TEST-F1-26-7 " TO PAR-NAME.
129000     PERFORM PRINT-DETAIL.
129100 SUB-TEST-F1-26-8.
129200     IF DNAME29 EQUAL TO ZERO
129300         PERFORM PASS
129400         GO TO SUB-WRITE-F1-26-8.
129500     MOVE ZERO TO CORRECT-18V0.
129600     MOVE DNAME29 TO COMPUTED-18V0.
129700     PERFORM FAIL.
129800     GO TO SUB-WRITE-F1-26-8.
129900 SUB-DELETE-F1-26-8.
130000     PERFORM DE-LETE.
130100 SUB-WRITE-F1-26-8.
130200     MOVE "SUB-TEST-F1-26-8 " TO PAR-NAME.
130300     PERFORM PRINT-DETAIL.
130400 SUB-TEST-F1-26-9.
130500     IF DNAME30 EQUAL TO ZERO
130600         PERFORM PASS
130700         GO TO SUB-WRITE-F1-26-9.
130800     MOVE ZERO TO CORRECT-18V0.
130900     MOVE DNAME30 TO COMPUTED-18V0.
131000     PERFORM FAIL.
131100     GO TO SUB-WRITE-F1-26-9.
131200 SUB-DELETE-F1-26-9.
131300     PERFORM DE-LETE.
131400 SUB-WRITE-F1-26-9.
131500     MOVE "SUB-TEST-F1-26-9 " TO PAR-NAME.
131600     PERFORM PRINT-DETAIL.
131700 SUB-TEST-F1-26-10.
131800     IF DNAME31 EQUAL TO ZERO
131900         PERFORM PASS
132000         GO TO SUB-WRITE-F1-26-10.
132100     MOVE ZERO TO CORRECT-18V0.
132200     MOVE DNAME31 TO COMPUTED-18V0.
132300     PERFORM FAIL.
132400     GO TO SUB-WRITE-F1-26-10.
132500 SUB-DELETE-F1-26-10.
132600     PERFORM DE-LETE.
132700 SUB-WRITE-F1-26-10.
132800     MOVE "SUB-TEST-F1-26-10 " TO PAR-NAME.
132900     PERFORM PRINT-DETAIL.
133000 SUB-TEST-F1-26-11.
133100     IF DNAME32 EQUAL TO ZERO
133200         PERFORM PASS
133300         GO TO SUB-WRITE-F1-26-11.
133400     MOVE ZERO TO CORRECT-18V0.
133500     MOVE DNAME32 TO COMPUTED-18V0.
133600     PERFORM FAIL.
133700     GO TO SUB-WRITE-F1-26-11.
133800 SUB-DELETE-F1-26-11.
133900     PERFORM DE-LETE.
134000 SUB-WRITE-F1-26-11.
134100     MOVE "SUB-TEST-F1-26-11 " TO PAR-NAME.
134200     PERFORM PRINT-DETAIL.
134300 SUB-TEST-F1-26-12.
134400     IF DNAME33 EQUAL TO ZERO
134500         PERFORM PASS
134600         GO TO SUB-WRITE-F1-26-12.
134700     MOVE ZERO TO CORRECT-18V0.
134800     MOVE DNAME33 TO COMPUTED-18V0.
134900     PERFORM FAIL.
135000     GO TO SUB-WRITE-F1-26-12.
135100 SUB-DELETE-F1-26-12.
135200     PERFORM DE-LETE.
135300 SUB-WRITE-F1-26-12.
135400     MOVE "SUB-TEST-F1-26-12 " TO PAR-NAME.
135500     PERFORM PRINT-DETAIL.
135600 SUB-TEST-F1-26-13.
135700     IF DNAME34 EQUAL TO ZERO
135800         PERFORM PASS
135900         GO TO SUB-WRITE-F1-26-13.
136000     MOVE ZERO TO CORRECT-18V0.
136100     MOVE DNAME34 TO COMPUTED-18V0.
136200     PERFORM FAIL.
136300     GO TO SUB-WRITE-F1-26-13.
136400 SUB-DELETE-F1-26-13.
136500     PERFORM DE-LETE.
136600 SUB-WRITE-F1-26-13.
136700     MOVE "SUB-TEST-F1-26-13 " TO PAR-NAME.
136800     PERFORM PRINT-DETAIL.
136900 SUB-TEST-F1-26-14.
137000     IF DNAME35 EQUAL TO ZERO
137100         PERFORM PASS
137200         GO TO SUB-WRITE-F1-26-14.
137300     MOVE ZERO TO CORRECT-18V0.
137400     MOVE DNAME35 TO COMPUTED-18V0.
137500     PERFORM FAIL.
137600     GO TO SUB-WRITE-F1-26-14.
137700 SUB-DELETE-F1-26-14.
137800     PERFORM DE-LETE.
137900 SUB-WRITE-F1-26-14.
138000     MOVE "SUB-TEST-F1-26-14 " TO PAR-NAME.
138100     PERFORM PRINT-DETAIL.
138200 SUB-TEST-F1-26-15.
138300     IF DNAME36 EQUAL TO ZERO
138400         PERFORM PASS
138500         GO TO SUB-WRITE-F1-26-15.
138600     MOVE ZERO TO CORRECT-18V0.
138700     MOVE DNAME36 TO COMPUTED-18V0.
138800     PERFORM FAIL.
138900     GO TO SUB-WRITE-F1-26-15.
139000 SUB-DELETE-F1-26-15.
139100     PERFORM DE-LETE.
139200 SUB-WRITE-F1-26-15.
139300     MOVE "SUB-TEST-F1-26-15 " TO PAR-NAME.
139400     PERFORM PRINT-DETAIL.
139500 SUB-TEST-F1-26-16.
139600     IF DNAME37 EQUAL TO ZERO
139700         PERFORM PASS
139800         GO TO SUB-WRITE-F1-26-16.
139900     MOVE ZERO TO CORRECT-18V0.
140000     MOVE DNAME37 TO COMPUTED-18V0.
140100     PERFORM FAIL.
140200     GO TO SUB-WRITE-F1-26-16.
140300 SUB-DELETE-F1-26-16.
140400     PERFORM DE-LETE.
140500 SUB-WRITE-F1-26-16.
140600     MOVE "SUB-TEST-F1-26-16 " TO PAR-NAME.
140700     PERFORM PRINT-DETAIL.
140800 SUB-TEST-F1-26-17.
140900     IF DNAME38 EQUAL TO ZERO
141000         PERFORM PASS
141100         GO TO SUB-WRITE-F1-26-17.
141200     MOVE ZERO TO CORRECT-18V0.
141300     MOVE DNAME38 TO COMPUTED-18V0.
141400     PERFORM FAIL.
141500     GO TO SUB-WRITE-F1-26-17.
141600 SUB-DELETE-F1-26-17.
141700     PERFORM DE-LETE.
141800 SUB-WRITE-F1-26-17.
141900     MOVE "SUB-TEST-F1-26-17 " TO PAR-NAME.
142000     PERFORM PRINT-DETAIL.
142100 SUB-TEST-F1-26-18.
142200     IF DNAME39 EQUAL TO ZERO
142300         PERFORM PASS
142400         GO TO SUB-WRITE-F1-26-18.
142500     MOVE ZERO TO CORRECT-18V0.
142600     MOVE DNAME39 TO COMPUTED-18V0.
142700     PERFORM FAIL.
142800     GO TO SUB-WRITE-F1-26-18.
142900 SUB-DELETE-F1-26-18.
143000     PERFORM DE-LETE.
143100 SUB-WRITE-F1-26-18.
143200     MOVE "SUB-TEST-F1-26-18 " TO PAR-NAME.
143300     PERFORM PRINT-DETAIL.
143400 SUB-TEST-F1-26-19.
143500     IF DNAME40 EQUAL TO ZERO
143600         PERFORM PASS
143700         GO TO SUB-WRITE-F1-26-19.
143800     MOVE ZERO TO CORRECT-18V0.
143900     MOVE DNAME40 TO COMPUTED-18V0.
144000     PERFORM FAIL.
144100     GO TO SUB-WRITE-F1-26-19.
144200 SUB-DELETE-F1-26-19.
144300     PERFORM DE-LETE.
144400 SUB-WRITE-F1-26-19.
144500     MOVE "SUB-TEST-F1-26-19 " TO PAR-NAME.
144600     PERFORM PRINT-DETAIL.
144700 SUB-TEST-F1-26-20.
144800     IF DNAME41 EQUAL TO ZERO
144900     PERFORM PASS
145000         GO TO SUB-WRITE-F1-26-20.
145100     MOVE DNAME41 TO COMPUTED-18V0.
145200     MOVE ZERO TO CORRECT-18V0.
145300     PERFORM FAIL.
145400     GO TO SUB-WRITE-F1-26-20.
145500 SUB-DELETE-F1-26-20.
145600     PERFORM DE-LETE.
145700 SUB-WRITE-F1-26-20.
145800     MOVE "SUB-TEST-F1-26-20 " TO PAR-NAME.
145900     PERFORM PRINT-DETAIL.
146000 SUB-TEST-F1-26-21.
146100     IF DNAME42 EQUAL TO ZERO
146200     PERFORM PASS
146300         GO TO SUB-WRITE-F1-26-21.
146400     MOVE DNAME42 TO COMPUTED-18V0.
146500     MOVE ZERO TO CORRECT-18V0.
146600     PERFORM FAIL.
146700     GO TO SUB-WRITE-F1-26-21.
146800 SUB-DELETE-F1-26-21.
146900     PERFORM DE-LETE.
147000 SUB-WRITE-F1-26-21.
147100     MOVE "SUB-TEST-F1-26-21 " TO PAR-NAME.
147200     PERFORM PRINT-DETAIL.
147300*
147400 SUB-INIT-F1-27.
147500*    ==-->  MULTIPLE RESULT FIELDS  <--==
147600     MOVE   "VI-134 6.25.4 GR1" TO ANSI-REFERENCE.
147700     MOVE   "SUB-TEST-F1-27" TO PAR-NAME.
147800     MOVE    ZERO  TO REC-CT.
147900     MOVE    10    TO WRK-DU-2V0-1.
148000     MOVE    .3    TO WRK-DU-0V1-1.
148100     MOVE    12.34 TO WRK-DU-2V2-1.
148200     MOVE    ZERO  TO WRK-DS-2V2-1.
148300     MOVE   -12.34 TO WRK-DS-2V2-2.
148400     MOVE    22.33 TO WRK-DU-2V2-2.
148500     MOVE   -9999999999999999.99 TO WRK-DS-16V2-1.
148600     MOVE    9999999999999999.99 TO WRK-DU-16V2-1.
148700 SUB-TEST-F1-27-0.
148800     SUBTRACT WRK-DU-2V0-1 2 WRK-DU-0V1-1 .04 FROM WRK-DU-2V2-1
148900         WRK-DS-2V2-1 ROUNDED WRK-DS-2V2-2 WRK-DU-2V2-2
149000         ROUNDED WRK-DU-16V2-1.
149100     GO TO   SUB-TEST-F1-27-1.
149200 SUB-DELETE-F1-27.
149300     PERFORM DE-LETE.
149400     PERFORM PRINT-DETAIL.
149500     GO TO   SUB-INIT-F1-28.
149600 SUB-TEST-F1-27-1.
149700     MOVE    "SUB-TEST-F1-27-1" TO PAR-NAME.
149800     MOVE 1 TO REC-CT.
149900     IF WRK-DU-2V2-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
150000     ELSE
150100     PERFORM FAIL MOVE WRK-DU-2V2-1 TO COMPUTED-N MOVE ZERO
150200     TO CORRECT-N PERFORM PRINT-DETAIL.
150300     ADD 1 TO REC-CT.
150400 SUB-TEST-F1-27-2.
150500     MOVE    "SUB-TEST-F1-27-2" TO PAR-NAME.
150600     IF WRK-DS-2V2-1 = -12.34 PERFORM PASS PERFORM PRINT-DETAIL
150700     ELSE
150800     PERFORM FAIL MOVE WRK-DS-2V2-1 TO COMPUTED-N MOVE -12.34
150900     TO CORRECT-N PERFORM PRINT-DETAIL.
151000     ADD 1 TO REC-CT.
151100 SUB-TEST-F1-27-3.
151200     MOVE    "SUB-TEST-F1-27-3" TO PAR-NAME.
151300     IF WRK-DS-2V2-2 = -24.68 PERFORM PASS PERFORM PRINT-DETAIL
151400     ELSE
151500     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE -24.68
151600     TO CORRECT-N PERFORM PRINT-DETAIL.
151700     ADD 1 TO REC-CT.
151800 SUB-TEST-F1-27-4.
151900     MOVE    "SUB-TEST-F1-27-4" TO PAR-NAME.
152000     IF WRK-DU-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
152100     ELSE
152200     PERFORM FAIL MOVE WRK-DU-2V2-2 TO COMPUTED-N MOVE 09.99
152300     TO CORRECT-N PERFORM PRINT-DETAIL.
152400     ADD 1 TO REC-CT.
152500 SUB-TEST-F1-27-5.
152600     MOVE    "SUB-TEST-F1-27-5" TO PAR-NAME.
152700     IF WRK-DU-16V2-1 = 9999999999999987.65 PERFORM PASS
152800     PERFORM PRINT-DETAIL ELSE
152900     PERFORM FAIL MOVE WRK-DU-16V2-1 TO WRK-NE-X-1
153000     MOVE WRK-NE-X-1 TO COMPUTED-A
153100     MOVE "9999999999999987.65" TO CORRECT-A PERFORM PRINT-DETAIL.
153200*
153300 SUB-INIT-F1-28.
153400*    ==-->  MULTIPLE RESULT FIELDS  <--==
153500*    ==-->      NO SIZE ERROR       <--==
153600     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
153700     MOVE   "SUB-TEST-F1-28" TO PAR-NAME.
153800     MOVE    ZERO  TO REC-CT.
153900     MOVE    SPACE TO SIZE-ERR2.
154000     MOVE    10    TO WRK-DU-2V0-1.
154100     MOVE    .3    TO WRK-DU-0V1-1.
154200     MOVE    12.34 TO WRK-DU-2V2-1.
154300     MOVE    ZERO  TO WRK-DS-2V2-1.
154400     MOVE   -12.34 TO WRK-DS-2V2-2.
154500     MOVE    22.33 TO WRK-DU-2V2-2.
154600     MOVE   -8888888888888888.88 TO WRK-DS-16V2-1.
154700     MOVE    9999999999999999.99 TO WRK-DU-16V2-1.
154800 SUB-TEST-F1-28-0.
154900     SUBTRACT WRK-DU-2V0-1 2 WRK-DU-0V1-1 .04 FROM WRK-DU-2V2-1
155000         WRK-DS-2V2-1 ROUNDED WRK-DS-2V2-2 WRK-DU-2V2-2
155100         ROUNDED WRK-DU-16V2-1 WRK-DS-16V2-1
155200          ON SIZE ERROR
155300             MOVE "A" TO SIZE-ERR2.
155400     GO TO   SUB-TEST-F1-28-1.
155500 SUB-DELETE-F1-28.
155600     PERFORM DE-LETE.
155700     PERFORM PRINT-DETAIL.
155800     GO TO   SUB-INIT-F1-29.
155900 SUB-TEST-F1-28-1.
156000     MOVE    "SUB-TEST-F1-28-1" TO PAR-NAME.
156100     MOVE 1 TO REC-CT.
156200     IF WRK-DU-2V2-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
156300     ELSE
156400     PERFORM FAIL MOVE WRK-DU-2V2-1 TO COMPUTED-N MOVE ZERO
156500     TO CORRECT-N PERFORM PRINT-DETAIL.
156600     ADD 1 TO REC-CT.
156700 SUB-TEST-F1-28-2.
156800     MOVE    "SUB-TEST-F1-28-2" TO PAR-NAME.
156900     IF WRK-DS-2V2-1 = -12.34 PERFORM PASS PERFORM PRINT-DETAIL
157000     ELSE
157100     PERFORM FAIL MOVE WRK-DS-2V2-1 TO COMPUTED-N MOVE -12.34
157200     TO CORRECT-N PERFORM PRINT-DETAIL.
157300     ADD 1 TO REC-CT.
157400 SUB-TEST-F1-28-3.
157500     MOVE    "SUB-TEST-F1-28-3" TO PAR-NAME.
157600     IF WRK-DS-2V2-2 = -24.68 PERFORM PASS PERFORM PRINT-DETAIL
157700     ELSE
157800     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE -24.68
157900     TO CORRECT-N PERFORM PRINT-DETAIL.
158000     ADD 1 TO REC-CT.
158100 SUB-TEST-F1-28-4.
158200     MOVE    "SUB-TEST-F1-28-4" TO PAR-NAME.
158300     IF WRK-DU-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
158400     ELSE
158500     PERFORM FAIL MOVE WRK-DU-2V2-2 TO COMPUTED-N MOVE 09.99
158600     TO CORRECT-N PERFORM PRINT-DETAIL.
158700     ADD 1 TO REC-CT.
158800 SUB-TEST-F1-28-5.
158900     MOVE    "SUB-TEST-F1-28-5" TO PAR-NAME.
159000     IF WRK-DU-16V2-1 = 9999999999999987.65 PERFORM PASS
159100     PERFORM PRINT-DETAIL ELSE
159200     PERFORM FAIL MOVE WRK-DU-16V2-1 TO WRK-NE-X-1
159300     MOVE WRK-NE-X-1 TO COMPUTED-A
159400     MOVE "9999999999999987.65" TO CORRECT-A PERFORM PRINT-DETAIL.
159500     ADD 1 TO REC-CT.
159600 SUB-TEST-F1-28-6.
159700     MOVE    "SUB-TEST-F1-28-6" TO PAR-NAME.
159800     IF WRK-DS-16V2-1 = -8888888888888901.22 PERFORM PASS
159900     PERFORM PRINT-DETAIL ELSE
160000     PERFORM FAIL MOVE WRK-DS-16V2-1 TO WRK-NE-X-2
160100     MOVE WRK-NE-X-2 TO COMPUTED-A
160200     MOVE "-8888888888888901.22" TO CORRECT-A
160300     PERFORM PRINT-DETAIL.
160400     ADD 1 TO REC-CT.
160500 SUB-TEST-F1-28-7.
160600     MOVE   "SUB-TEST-F1-28-7" TO PAR-NAME.
160700     IF      SIZE-ERR2 = SPACE
160800             PERFORM PASS
160900             PERFORM PRINT-DETAIL
161000     ELSE
161100             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
161200                  TO RE-MARK
161300             MOVE    SPACE     TO CORRECT-X
161400             MOVE    SIZE-ERR2 TO COMPUTED-X
161500             PERFORM FAIL
161600             PERFORM PRINT-DETAIL.
161700*
161800 SUB-INIT-F1-29.
161900*    ==-->  MULTIPLE RESULT FIELDS  <--==
162000*    ==-->       SIZE ERROR         <--==
162100     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
162200     MOVE   "SUB-TEST-F1-29" TO PAR-NAME.
162300     MOVE    ZERO  TO REC-CT.
162400     MOVE    SPACE TO SIZE-ERR2.
162500     MOVE    10    TO WRK-DU-2V0-1.
162600     MOVE    .3    TO WRK-DU-0V1-1.
162700     MOVE    12.34 TO WRK-DU-2V2-1.
162800     MOVE    ZERO  TO WRK-DS-2V2-1.
162900     MOVE   -12.34 TO WRK-DS-2V2-2.
163000     MOVE    22.33 TO WRK-DU-2V2-2.
163100     MOVE   -9999999999999999.99 TO WRK-DS-16V2-1.
163200     MOVE    9999999999999999.99 TO WRK-DU-16V2-1.
163300 SUB-TEST-F1-29-0.
163400     SUBTRACT WRK-DU-2V0-1 2 WRK-DU-0V1-1 .04 FROM WRK-DU-2V2-1
163500         WRK-DS-2V2-1 ROUNDED WRK-DS-2V2-2 WRK-DU-2V2-2
163600         ROUNDED WRK-DU-16V2-1 WRK-DS-16V2-1
163700          ON SIZE ERROR
163800             MOVE "A" TO SIZE-ERR2.
163900     GO TO   SUB-TEST-F1-29-1.
164000 SUB-DELETE-F1-29.
164100     PERFORM DE-LETE.
164200     PERFORM PRINT-DETAIL.
164300     GO TO   SUB-INIT-F1-30.
164400 SUB-TEST-F1-29-1.
164500     MOVE    "SUB-TEST-F1-29-1" TO PAR-NAME.
164600     MOVE 1 TO REC-CT.
164700     IF WRK-DU-2V2-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
164800     ELSE
164900     PERFORM FAIL MOVE WRK-DU-2V2-1 TO COMPUTED-N MOVE ZERO
165000     TO CORRECT-N PERFORM PRINT-DETAIL.
165100     ADD 1 TO REC-CT.
165200 SUB-TEST-F1-29-2.
165300     MOVE    "SUB-TEST-F1-29-2" TO PAR-NAME.
165400     IF WRK-DS-2V2-1 = -12.34 PERFORM PASS PERFORM PRINT-DETAIL
165500     ELSE
165600     PERFORM FAIL MOVE WRK-DS-2V2-1 TO COMPUTED-N MOVE -12.34
165700     TO CORRECT-N PERFORM PRINT-DETAIL.
165800     ADD 1 TO REC-CT.
165900 SUB-TEST-F1-29-3.
166000     MOVE    "SUB-TEST-F1-29-3" TO PAR-NAME.
166100     IF WRK-DS-2V2-2 = -24.68 PERFORM PASS PERFORM PRINT-DETAIL
166200     ELSE
166300     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE -24.68
166400     TO CORRECT-N PERFORM PRINT-DETAIL.
166500     ADD 1 TO REC-CT.
166600 SUB-TEST-F1-29-4.
166700     MOVE    "SUB-TEST-F1-29-4" TO PAR-NAME.
166800     IF WRK-DU-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
166900     ELSE
167000     PERFORM FAIL MOVE WRK-DU-2V2-2 TO COMPUTED-N MOVE 09.99
167100     TO CORRECT-N PERFORM PRINT-DETAIL.
167200     ADD 1 TO REC-CT.
167300 SUB-TEST-F1-29-5.
167400     MOVE    "SUB-TEST-F1-29-5" TO PAR-NAME.
167500     IF WRK-DU-16V2-1 = 9999999999999987.65 PERFORM PASS
167600     PERFORM PRINT-DETAIL ELSE
167700     PERFORM FAIL MOVE WRK-DU-16V2-1 TO WRK-NE-X-1
167800     MOVE WRK-NE-X-1 TO COMPUTED-A
167900     MOVE "9999999999999987.65" TO CORRECT-A PERFORM PRINT-DETAIL.
168000     ADD 1 TO REC-CT.
168100 SUB-TEST-F1-29-6.
168200     MOVE    "SUB-TEST-F1-29-6" TO PAR-NAME.
168300     IF WRK-DS-16V2-1 = -9999999999999999.99 PERFORM PASS
168400     PERFORM PRINT-DETAIL ELSE
168500     PERFORM FAIL MOVE WRK-DS-16V2-1 TO WRK-NE-X-2
168600     MOVE WRK-NE-X-2 TO COMPUTED-A
168700     MOVE "-9999999999999999.99" TO CORRECT-A
168800     PERFORM PRINT-DETAIL.
168900     ADD 1 TO REC-CT.
169000 SUB-TEST-F1-29-7.
169100     MOVE   "SUB-TEST-F1-29-7" TO PAR-NAME.
169200     IF      SIZE-ERR2 = "A"
169300             PERFORM PASS
169400             PERFORM PRINT-DETAIL
169500     ELSE
169600             MOVE   "ON SIZE ERROR SHOULD HAVE OCCURED"
169700                  TO RE-MARK
169800             MOVE   "A"        TO CORRECT-X
169900             MOVE    SIZE-ERR2 TO COMPUTED-X
170000             PERFORM FAIL
170100             PERFORM PRINT-DETAIL.
170200*
170300 SUB-INIT-F1-30.
170400*    ==-->  MULTIPLE RESULT FIELDS  <--==
170500*    ==-->      NO SIZE ERROR       <--==
170600     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
170700     MOVE   "SUB-TEST-F1-30" TO PAR-NAME.
170800     MOVE    ZERO  TO REC-CT.
170900     MOVE    SPACE TO SIZE-ERR2.
171000     MOVE    10    TO WRK-DU-2V0-1.
171100     MOVE    .3    TO WRK-DU-0V1-1.
171200     MOVE    12.34 TO WRK-DU-2V2-1.
171300     MOVE    ZERO  TO WRK-DS-2V2-1.
171400     MOVE   -12.34 TO WRK-DS-2V2-2.
171500     MOVE    22.33 TO WRK-DU-2V2-2.
171600     MOVE   -8888888888888888.88 TO WRK-DS-16V2-1.
171700     MOVE    9999999999999999.99 TO WRK-DU-16V2-1.
171800 SUB-TEST-F1-30-0.
171900     SUBTRACT WRK-DU-2V0-1 2 WRK-DU-0V1-1 .04 FROM WRK-DU-2V2-1
172000         WRK-DS-2V2-1 ROUNDED WRK-DS-2V2-2 WRK-DU-2V2-2
172100         ROUNDED WRK-DU-16V2-1 WRK-DS-16V2-1
172200      NOT ON SIZE ERROR
172300             MOVE "A" TO SIZE-ERR2.
172400     GO TO   SUB-TEST-F1-30-1.
172500 SUB-DELETE-F1-30.
172600     PERFORM DE-LETE.
172700     PERFORM PRINT-DETAIL.
172800     GO TO   SUB-INIT-F1-31.
172900 SUB-TEST-F1-30-1.
173000     MOVE    "SUB-TEST-F1-30-1" TO PAR-NAME.
173100     MOVE 1 TO REC-CT.
173200     IF WRK-DU-2V2-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
173300     ELSE
173400     PERFORM FAIL MOVE WRK-DU-2V2-1 TO COMPUTED-N MOVE ZERO
173500     TO CORRECT-N PERFORM PRINT-DETAIL.
173600     ADD 1 TO REC-CT.
173700 SUB-TEST-F1-30-2.
173800     MOVE    "SUB-TEST-F1-30-2" TO PAR-NAME.
173900     IF WRK-DS-2V2-1 = -12.34 PERFORM PASS PERFORM PRINT-DETAIL
174000     ELSE
174100     PERFORM FAIL MOVE WRK-DS-2V2-1 TO COMPUTED-N MOVE -12.34
174200     TO CORRECT-N PERFORM PRINT-DETAIL.
174300     ADD 1 TO REC-CT.
174400 SUB-TEST-F1-30-3.
174500     MOVE    "SUB-TEST-F1-30-3" TO PAR-NAME.
174600     IF WRK-DS-2V2-2 = -24.68 PERFORM PASS PERFORM PRINT-DETAIL
174700     ELSE
174800     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE -24.68
174900     TO CORRECT-N PERFORM PRINT-DETAIL.
175000     ADD 1 TO REC-CT.
175100 SUB-TEST-F1-30-4.
175200     MOVE    "SUB-TEST-F1-30-4" TO PAR-NAME.
175300     IF WRK-DU-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
175400     ELSE
175500     PERFORM FAIL MOVE WRK-DU-2V2-2 TO COMPUTED-N MOVE 09.99
175600     TO CORRECT-N PERFORM PRINT-DETAIL.
175700     ADD 1 TO REC-CT.
175800 SUB-TEST-F1-30-5.
175900     MOVE    "SUB-TEST-F1-30-5" TO PAR-NAME.
176000     IF WRK-DU-16V2-1 = 9999999999999987.65 PERFORM PASS
176100     PERFORM PRINT-DETAIL ELSE
176200     PERFORM FAIL MOVE WRK-DU-16V2-1 TO WRK-NE-X-1
176300     MOVE WRK-NE-X-1 TO COMPUTED-A
176400     MOVE "9999999999999987.65" TO CORRECT-A PERFORM PRINT-DETAIL.
176500     ADD 1 TO REC-CT.
176600 SUB-TEST-F1-30-6.
176700     MOVE    "SUB-TEST-F1-30-6" TO PAR-NAME.
176800     IF WRK-DS-16V2-1 = -8888888888888901.22 PERFORM PASS
176900     PERFORM PRINT-DETAIL ELSE
177000     PERFORM FAIL MOVE WRK-DS-16V2-1 TO WRK-NE-X-2
177100     MOVE WRK-NE-X-2 TO COMPUTED-A
177200     MOVE "-8888888888888901.22" TO CORRECT-A
177300     PERFORM PRINT-DETAIL.
177400     ADD 1 TO REC-CT.
177500 SUB-TEST-F1-30-7.
177600     MOVE   "SUB-TEST-F1-30-7" TO PAR-NAME.
177700     IF      SIZE-ERR2 = "A"
177800             PERFORM PASS
177900             PERFORM PRINT-DETAIL
178000     ELSE
178100             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
178200                  TO RE-MARK
178300             MOVE   "A"        TO CORRECT-X
178400             MOVE    SIZE-ERR2 TO COMPUTED-X
178500             PERFORM FAIL
178600             PERFORM PRINT-DETAIL.
178700*
178800 SUB-INIT-F1-31.
178900*    ==-->  MULTIPLE RESULT FIELDS  <--==
179000*    ==-->       SIZE ERROR         <--==
179100     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
179200     MOVE   "SUB-TEST-F1-31" TO PAR-NAME.
179300     MOVE    ZERO  TO REC-CT.
179400     MOVE    SPACE TO SIZE-ERR2.
179500     MOVE    10    TO WRK-DU-2V0-1.
179600     MOVE    .3    TO WRK-DU-0V1-1.
179700     MOVE    12.34 TO WRK-DU-2V2-1.
179800     MOVE    ZERO  TO WRK-DS-2V2-1.
179900     MOVE   -12.34 TO WRK-DS-2V2-2.
180000     MOVE    22.33 TO WRK-DU-2V2-2.
180100     MOVE   -9999999999999999.99 TO WRK-DS-16V2-1.
180200     MOVE    9999999999999999.99 TO WRK-DU-16V2-1.
180300 SUB-TEST-F1-31-0.
180400     SUBTRACT WRK-DU-2V0-1 2 WRK-DU-0V1-1 .04 FROM WRK-DU-2V2-1
180500         WRK-DS-2V2-1 ROUNDED WRK-DS-2V2-2 WRK-DU-2V2-2
180600         ROUNDED WRK-DU-16V2-1 WRK-DS-16V2-1
180700      NOT ON SIZE ERROR
180800             MOVE "A" TO SIZE-ERR2.
180900     GO TO   SUB-TEST-F1-31-1.
181000 SUB-DELETE-F1-31.
181100     PERFORM DE-LETE.
181200     PERFORM PRINT-DETAIL.
181300     GO TO   SUB-INIT-F1-32.
181400 SUB-TEST-F1-31-1.
181500     MOVE    "SUB-TEST-F1-31-1" TO PAR-NAME.
181600     MOVE 1 TO REC-CT.
181700     IF WRK-DU-2V2-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
181800     ELSE
181900     PERFORM FAIL MOVE WRK-DU-2V2-1 TO COMPUTED-N MOVE ZERO
182000     TO CORRECT-N PERFORM PRINT-DETAIL.
182100     ADD 1 TO REC-CT.
182200 SUB-TEST-F1-31-2.
182300     MOVE    "SUB-TEST-F1-31-2" TO PAR-NAME.
182400     IF WRK-DS-2V2-1 = -12.34 PERFORM PASS PERFORM PRINT-DETAIL
182500     ELSE
182600     PERFORM FAIL MOVE WRK-DS-2V2-1 TO COMPUTED-N MOVE -12.34
182700     TO CORRECT-N PERFORM PRINT-DETAIL.
182800     ADD 1 TO REC-CT.
182900 SUB-TEST-F1-31-3.
183000     MOVE    "SUB-TEST-F1-31-3" TO PAR-NAME.
183100     IF WRK-DS-2V2-2 = -24.68 PERFORM PASS PERFORM PRINT-DETAIL
183200     ELSE
183300     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE -24.68
183400     TO CORRECT-N PERFORM PRINT-DETAIL.
183500     ADD 1 TO REC-CT.
183600 SUB-TEST-F1-31-4.
183700     MOVE    "SUB-TEST-F1-31-4" TO PAR-NAME.
183800     IF WRK-DU-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
183900     ELSE
184000     PERFORM FAIL MOVE WRK-DU-2V2-2 TO COMPUTED-N MOVE 09.99
184100     TO CORRECT-N PERFORM PRINT-DETAIL.
184200     ADD 1 TO REC-CT.
184300 SUB-TEST-F1-31-5.
184400     MOVE    "SUB-TEST-F1-31-5" TO PAR-NAME.
184500     IF WRK-DU-16V2-1 = 9999999999999987.65 PERFORM PASS
184600     PERFORM PRINT-DETAIL ELSE
184700     PERFORM FAIL MOVE WRK-DU-16V2-1 TO WRK-NE-X-1
184800     MOVE WRK-NE-X-1 TO COMPUTED-A
184900     MOVE "9999999999999987.65" TO CORRECT-A PERFORM PRINT-DETAIL.
185000     ADD 1 TO REC-CT.
185100 SUB-TEST-F1-31-6.
185200     MOVE    "SUB-TEST-F1-31-6" TO PAR-NAME.
185300     IF WRK-DS-16V2-1 = -9999999999999999.99 PERFORM PASS
185400     PERFORM PRINT-DETAIL ELSE
185500     PERFORM FAIL MOVE WRK-DS-16V2-1 TO WRK-NE-X-2
185600     MOVE WRK-NE-X-2 TO COMPUTED-A
185700     MOVE "-9999999999999999.99" TO CORRECT-A
185800     PERFORM PRINT-DETAIL.
185900     ADD 1 TO REC-CT.
186000 SUB-TEST-F1-31-7.
186100     MOVE   "SUB-TEST-F1-31-7" TO PAR-NAME.
186200     IF      SIZE-ERR2 = SPACE
186300             PERFORM PASS
186400             PERFORM PRINT-DETAIL
186500     ELSE
186600             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
186700                  TO RE-MARK
186800             MOVE    SPACE     TO CORRECT-X
186900             MOVE    SIZE-ERR2 TO COMPUTED-X
187000             PERFORM FAIL
187100             PERFORM PRINT-DETAIL.
187200*
187300 SUB-INIT-F1-32.
187400*    ==-->  MULTIPLE RESULT FIELDS  <--==
187500*    ==-->      NO SIZE ERROR       <--==
187600     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
187700     MOVE   "SUB-TEST-F1-32" TO PAR-NAME.
187800     MOVE    ZERO  TO REC-CT.
187900     MOVE    SPACE TO SIZE-ERR2.
188000     MOVE    10    TO WRK-DU-2V0-1.
188100     MOVE    .3    TO WRK-DU-0V1-1.
188200     MOVE    12.34 TO WRK-DU-2V2-1.
188300     MOVE    ZERO  TO WRK-DS-2V2-1.
188400     MOVE   -12.34 TO WRK-DS-2V2-2.
188500     MOVE    22.33 TO WRK-DU-2V2-2.
188600     MOVE   -8888888888888888.88 TO WRK-DS-16V2-1.
188700     MOVE    9999999999999999.99 TO WRK-DU-16V2-1.
188800 SUB-TEST-F1-32-0.
188900     SUBTRACT WRK-DU-2V0-1 2 WRK-DU-0V1-1 .04 FROM WRK-DU-2V2-1
189000         WRK-DS-2V2-1 ROUNDED WRK-DS-2V2-2 WRK-DU-2V2-2
189100         ROUNDED WRK-DU-16V2-1 WRK-DS-16V2-1
189200          ON SIZE ERROR
189300             MOVE "Z" TO SIZE-ERR2
189400      NOT ON SIZE ERROR
189500             MOVE "A" TO SIZE-ERR2.
189600     GO TO   SUB-TEST-F1-32-1.
189700 SUB-DELETE-F1-32.
189800     PERFORM DE-LETE.
189900     PERFORM PRINT-DETAIL.
190000     GO TO   SUB-INIT-F1-33.
190100 SUB-TEST-F1-32-1.
190200     MOVE    "SUB-TEST-F1-32-1" TO PAR-NAME.
190300     MOVE 1 TO REC-CT.
190400     IF WRK-DU-2V2-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
190500     ELSE
190600     PERFORM FAIL MOVE WRK-DU-2V2-1 TO COMPUTED-N MOVE ZERO
190700     TO CORRECT-N PERFORM PRINT-DETAIL.
190800     ADD 1 TO REC-CT.
190900 SUB-TEST-F1-32-2.
191000     MOVE    "SUB-TEST-F1-32-2" TO PAR-NAME.
191100     IF WRK-DS-2V2-1 = -12.34 PERFORM PASS PERFORM PRINT-DETAIL
191200     ELSE
191300     PERFORM FAIL MOVE WRK-DS-2V2-1 TO COMPUTED-N MOVE -12.34
191400     TO CORRECT-N PERFORM PRINT-DETAIL.
191500     ADD 1 TO REC-CT.
191600 SUB-TEST-F1-32-3.
191700     MOVE    "SUB-TEST-F1-32-3" TO PAR-NAME.
191800     IF WRK-DS-2V2-2 = -24.68 PERFORM PASS PERFORM PRINT-DETAIL
191900     ELSE
192000     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE -24.68
192100     TO CORRECT-N PERFORM PRINT-DETAIL.
192200     ADD 1 TO REC-CT.
192300 SUB-TEST-F1-32-4.
192400     MOVE    "SUB-TEST-F1-32-4" TO PAR-NAME.
192500     IF WRK-DU-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
192600     ELSE
192700     PERFORM FAIL MOVE WRK-DU-2V2-2 TO COMPUTED-N MOVE 09.99
192800     TO CORRECT-N PERFORM PRINT-DETAIL.
192900     ADD 1 TO REC-CT.
193000 SUB-TEST-F1-32-5.
193100     MOVE    "SUB-TEST-F1-32-5" TO PAR-NAME.
193200     IF WRK-DU-16V2-1 = 9999999999999987.65 PERFORM PASS
193300     PERFORM PRINT-DETAIL ELSE
193400     PERFORM FAIL MOVE WRK-DU-16V2-1 TO WRK-NE-X-1
193500     MOVE WRK-NE-X-1 TO COMPUTED-A
193600     MOVE "9999999999999987.65" TO CORRECT-A PERFORM PRINT-DETAIL.
193700     ADD 1 TO REC-CT.
193800 SUB-TEST-F1-32-6.
193900     MOVE    "SUB-TEST-F1-32-6" TO PAR-NAME.
194000     IF WRK-DS-16V2-1 = -8888888888888901.22 PERFORM PASS
194100     PERFORM PRINT-DETAIL ELSE
194200     PERFORM FAIL MOVE WRK-DS-16V2-1 TO WRK-NE-X-2
194300     MOVE WRK-NE-X-2 TO COMPUTED-A
194400     MOVE "-8888888888888901.22" TO CORRECT-A
194500     PERFORM PRINT-DETAIL.
194600     ADD 1 TO REC-CT.
194700 SUB-TEST-F1-32-7.
194800     MOVE   "SUB-TEST-F1-32-7" TO PAR-NAME.
194900     IF      SIZE-ERR2 = "A"
195000             PERFORM PASS
195100             PERFORM PRINT-DETAIL
195200     ELSE
195300             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
195400                  TO RE-MARK
195500             MOVE   "A"        TO CORRECT-X
195600             MOVE    SIZE-ERR2 TO COMPUTED-X
195700             PERFORM FAIL
195800             PERFORM PRINT-DETAIL.
195900*
196000 SUB-INIT-F1-33.
196100*    ==-->  MULTIPLE RESULT FIELDS  <--==
196200*    ==-->       SIZE ERROR         <--==
196300     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
196400     MOVE   "SUB-TEST-F1-33" TO PAR-NAME.
196500     MOVE    ZERO  TO REC-CT.
196600     MOVE    SPACE TO SIZE-ERR2.
196700     MOVE    10    TO WRK-DU-2V0-1.
196800     MOVE    .3    TO WRK-DU-0V1-1.
196900     MOVE    12.34 TO WRK-DU-2V2-1.
197000     MOVE    ZERO  TO WRK-DS-2V2-1.
197100     MOVE   -12.34 TO WRK-DS-2V2-2.
197200     MOVE    22.33 TO WRK-DU-2V2-2.
197300     MOVE   -9999999999999999.99 TO WRK-DS-16V2-1.
197400     MOVE    9999999999999999.99 TO WRK-DU-16V2-1.
197500 SUB-TEST-F1-33-0.
197600     SUBTRACT WRK-DU-2V0-1 2 WRK-DU-0V1-1 .04 FROM WRK-DU-2V2-1
197700         WRK-DS-2V2-1 ROUNDED WRK-DS-2V2-2 WRK-DU-2V2-2
197800         ROUNDED WRK-DU-16V2-1 WRK-DS-16V2-1
197900          ON SIZE ERROR
198000             MOVE "A" TO SIZE-ERR2
198100      NOT ON SIZE ERROR
198200             MOVE "Z" TO SIZE-ERR2.
198300     GO TO   SUB-TEST-F1-33-1.
198400 SUB-DELETE-F1-33.
198500     PERFORM DE-LETE.
198600     PERFORM PRINT-DETAIL.
198700     GO TO   SUB-INIT-F1-34.
198800 SUB-TEST-F1-33-1.
198900     MOVE    "SUB-TEST-F1-33-1" TO PAR-NAME.
199000     MOVE 1 TO REC-CT.
199100     IF WRK-DU-2V2-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
199200     ELSE
199300     PERFORM FAIL MOVE WRK-DU-2V2-1 TO COMPUTED-N MOVE ZERO
199400     TO CORRECT-N PERFORM PRINT-DETAIL.
199500     ADD 1 TO REC-CT.
199600 SUB-TEST-F1-33-2.
199700     MOVE    "SUB-TEST-F1-33-2" TO PAR-NAME.
199800     IF WRK-DS-2V2-1 = -12.34 PERFORM PASS PERFORM PRINT-DETAIL
199900     ELSE
200000     PERFORM FAIL MOVE WRK-DS-2V2-1 TO COMPUTED-N MOVE -12.34
200100     TO CORRECT-N PERFORM PRINT-DETAIL.
200200     ADD 1 TO REC-CT.
200300 SUB-TEST-F1-33-3.
200400     MOVE    "SUB-TEST-F1-33-3" TO PAR-NAME.
200500     IF WRK-DS-2V2-2 = -24.68 PERFORM PASS PERFORM PRINT-DETAIL
200600     ELSE
200700     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE -24.68
200800     TO CORRECT-N PERFORM PRINT-DETAIL.
200900     ADD 1 TO REC-CT.
201000 SUB-TEST-F1-33-4.
201100     MOVE    "SUB-TEST-F1-33-4" TO PAR-NAME.
201200     IF WRK-DU-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
201300     ELSE
201400     PERFORM FAIL MOVE WRK-DU-2V2-2 TO COMPUTED-N MOVE 09.99
201500     TO CORRECT-N PERFORM PRINT-DETAIL.
201600     ADD 1 TO REC-CT.
201700 SUB-TEST-F1-33-5.
201800     MOVE    "SUB-TEST-F1-33-5" TO PAR-NAME.
201900     IF WRK-DU-16V2-1 = 9999999999999987.65 PERFORM PASS
202000     PERFORM PRINT-DETAIL ELSE
202100     PERFORM FAIL MOVE WRK-DU-16V2-1 TO WRK-NE-X-1
202200     MOVE WRK-NE-X-1 TO COMPUTED-A
202300     MOVE "9999999999999987.65" TO CORRECT-A PERFORM PRINT-DETAIL.
202400     ADD 1 TO REC-CT.
202500 SUB-TEST-F1-33-6.
202600     MOVE    "SUB-TEST-F1-33-6" TO PAR-NAME.
202700     IF WRK-DS-16V2-1 = -9999999999999999.99 PERFORM PASS
202800     PERFORM PRINT-DETAIL ELSE
202900     PERFORM FAIL MOVE WRK-DS-16V2-1 TO WRK-NE-X-2
203000     MOVE WRK-NE-X-2 TO COMPUTED-A
203100     MOVE "-9999999999999999.99" TO CORRECT-A
203200     PERFORM PRINT-DETAIL.
203300     ADD 1 TO REC-CT.
203400 SUB-TEST-F1-33-7.
203500     MOVE   "SUB-TEST-F1-33-7" TO PAR-NAME.
203600     IF      SIZE-ERR2 = "A"
203700             PERFORM PASS
203800             PERFORM PRINT-DETAIL
203900     ELSE
204000             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
204100                  TO RE-MARK
204200             MOVE   "A"        TO CORRECT-X
204300             MOVE    SIZE-ERR2 TO COMPUTED-X
204400             PERFORM FAIL
204500             PERFORM PRINT-DETAIL.
204600*
204700 SUB-INIT-F1-34.
204800*    ==-->  EXPLICIT SCOPE TERMINATOR <--==
204900*    ==-->          SIZE ERROR        <--==
205000     MOVE   "IV-41 6.4.3"       TO ANSI-REFERENCE.
205100     MOVE     -11 TO WRK-DS-02V00.
205200     MOVE    SPACE TO WRK-XN-00001.
205300     MOVE    SPACE TO SIZE-ERR2.
205400     MOVE    SPACE TO SIZE-ERR3.
205500     MOVE    SPACE TO SIZE-ERR4.
205600     MOVE    1  TO REC-CT.
205700 SUB-TEST-F1-34-0.
205800     SUBTRACT A99-DS-02V00 FROM WRK-DS-02V00
205900          ON SIZE ERROR
206000             MOVE   "1" TO WRK-XN-00001
206100             MOVE   "A" TO SIZE-ERR2
206200             MOVE   "B" TO SIZE-ERR3
206300     END-SUBTRACT
206400     MOVE   "C" TO SIZE-ERR4.
206500     GO TO   SUB-TEST-F1-34-1.
206600 SUB-DELETE-F1-34.
206700     PERFORM DE-LETE.
206800     PERFORM PRINT-DETAIL.
206900     GO TO   SUB-INIT-F1-35.
207000 SUB-TEST-F1-34-1.
207100     MOVE   "SUB-TEST-F1-34-1" TO PAR-NAME.
207200     IF      WRK-XN-00001 = "1"
207300             PERFORM PASS
207400             PERFORM PRINT-DETAIL
207500     ELSE
207600             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
207700                  TO RE-MARK
207800             MOVE   "1"           TO CORRECT-X
207900             MOVE    WRK-XN-00001 TO COMPUTED-X
208000             PERFORM FAIL
208100             PERFORM PRINT-DETAIL.
208200     ADD     1 TO REC-CT.
208300 SUB-TEST-F1-34-2.
208400     MOVE   "SUB-TEST-F1-34-2" TO PAR-NAME.
208500     IF      SIZE-ERR2 = "A"
208600             PERFORM PASS
208700             PERFORM PRINT-DETAIL
208800     ELSE
208900             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
209000                  TO RE-MARK
209100             MOVE   "A"        TO CORRECT-X
209200             MOVE    SIZE-ERR2 TO COMPUTED-X
209300             PERFORM FAIL
209400             PERFORM PRINT-DETAIL.
209500     ADD     1 TO REC-CT.
209600 SUB-TEST-F1-34-3.
209700     MOVE   "SUB-TEST-F1-34-3" TO PAR-NAME.
209800     IF      SIZE-ERR3 = "B"
209900             PERFORM PASS
210000             PERFORM PRINT-DETAIL
210100     ELSE
210200             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
210300                  TO RE-MARK
210400             MOVE   "B"        TO CORRECT-X
210500             MOVE    SIZE-ERR3 TO COMPUTED-X
210600             PERFORM FAIL
210700             PERFORM PRINT-DETAIL.
210800     ADD     1 TO REC-CT.
210900 SUB-TEST-F1-34-4.
211000     MOVE   "SUB-TEST-F1-34-4" TO PAR-NAME.
211100     IF      SIZE-ERR4 = "C"
211200             PERFORM PASS
211300             PERFORM PRINT-DETAIL
211400     ELSE
211500             MOVE   "SCOPE TERMINATOR IGNORED"
211600                  TO RE-MARK
211700             MOVE   "C"        TO CORRECT-X
211800             MOVE    SIZE-ERR4 TO COMPUTED-X
211900             PERFORM FAIL
212000             PERFORM PRINT-DETAIL.
212100     ADD     1 TO REC-CT.
212200 SUB-TEST-F1-34-5.
212300     MOVE   "SUB-TEST-F1-34-5" TO PAR-NAME.
212400     IF      WRK-DS-02V00 = -11
212500             PERFORM PASS
212600             PERFORM PRINT-DETAIL
212700     ELSE
212800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
212900                  TO RE-MARK
213000             MOVE    -11          TO CORRECT-N
213100             MOVE    WRK-DS-02V00 TO COMPUTED-N
213200             PERFORM FAIL
213300             PERFORM PRINT-DETAIL.
213400*
213500 SUB-INIT-F1-35.
213600*    ==--> EXPLICIT SCOPE TERMINATOR<--==
213700     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
213800     MOVE   "SUB-TEST-F1-35"  TO PAR-NAME.
213900     MOVE    SPACE TO WRK-XN-00001.
214000     MOVE    SPACE TO SIZE-ERR2.
214100     MOVE    SPACE TO SIZE-ERR3.
214200     MOVE    SPACE TO SIZE-ERR4.
214300     MOVE    ZERO  TO WRK-DS-06V06.
214400     MOVE    1     TO REC-CT.
214500 SUB-TEST-F1-35-0.
214600     SUBTRACT A12THREES-DS-06V06
214700              333333
214800              A06THREES-DS-03V03
214900              -0000009
215000              FROM WRK-DS-06V06 ROUNDED
215100          ON SIZE ERROR
215200             MOVE   "1" TO WRK-XN-00001
215300             MOVE   "A" TO SIZE-ERR2
215400             MOVE   "B" TO SIZE-ERR3
215500     END-SUBTRACT
215600     MOVE   "C" TO SIZE-ERR4.
215700     GO TO   SUB-TEST-F1-35-1.
215800 SUB-DELETE-F1-35.
215900     PERFORM DE-LETE.
216000     PERFORM PRINT-DETAIL.
216100     GO TO   SUB-INIT-F1-36.
216200 SUB-TEST-F1-35-1.
216300     MOVE   "SUB-TEST-F1-35-1" TO PAR-NAME.
216400     IF      WRK-XN-00001 = SPACE
216500             PERFORM PASS
216600             PERFORM PRINT-DETAIL
216700     ELSE
216800             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
216900                  TO RE-MARK
217000             MOVE    SPACE        TO CORRECT-X
217100             MOVE    WRK-XN-00001 TO COMPUTED-X
217200             PERFORM FAIL
217300             PERFORM PRINT-DETAIL.
217400     ADD     1 TO REC-CT.
217500 SUB-TEST-F1-35-2.
217600     MOVE   "SUB-TEST-F1-35-2" TO PAR-NAME.
217700     IF      SIZE-ERR2 = SPACE
217800             PERFORM PASS
217900             PERFORM PRINT-DETAIL
218000     ELSE
218100             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
218200                  TO RE-MARK
218300             MOVE    SPACE     TO CORRECT-X
218400             MOVE    SIZE-ERR2 TO COMPUTED-X
218500             PERFORM FAIL
218600             PERFORM PRINT-DETAIL.
218700     ADD     1 TO REC-CT.
218800 SUB-TEST-F1-35-3.
218900     MOVE   "SUB-TEST-F1-35-3" TO PAR-NAME.
219000     IF      SIZE-ERR3 = SPACE
219100             PERFORM PASS
219200             PERFORM PRINT-DETAIL
219300     ELSE
219400             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
219500                  TO RE-MARK
219600             MOVE    SPACE     TO CORRECT-X
219700             MOVE    SIZE-ERR3 TO COMPUTED-X
219800             PERFORM FAIL
219900             PERFORM PRINT-DETAIL.
220000     ADD     1 TO REC-CT.
220100 SUB-TEST-F1-35-4.
220200     MOVE   "SUB-TEST-F1-35-4" TO PAR-NAME.
220300     IF      SIZE-ERR4 = "C"
220400             PERFORM PASS
220500             PERFORM PRINT-DETAIL
220600     ELSE
220700             MOVE   "SCOPE TERMINATOR IGNORED"
220800                  TO RE-MARK
220900             MOVE   "C"        TO CORRECT-X
221000             MOVE    SIZE-ERR4 TO COMPUTED-X
221100             PERFORM FAIL
221200             PERFORM PRINT-DETAIL.
221300     ADD     1 TO REC-CT.
221400 SUB-TEST-F1-35-5.
221500     MOVE   "SUB-TEST-F1-35-5" TO PAR-NAME.
221600     IF      WRK-DS-06V06 = -666990.666333
221700             PERFORM PASS
221800             PERFORM PRINT-DETAIL
221900     ELSE
222000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
222100                  TO RE-MARK
222200             MOVE   -666990.666333 TO CORRECT-N
222300             MOVE    WRK-DS-06V06  TO COMPUTED-N
222400             PERFORM FAIL
222500             PERFORM PRINT-DETAIL.
222600*
222700 SUB-INIT-F1-36.
222800*    ==--> EXPLICIT SCOPE TERMINATOR<--==
222900     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
223000     MOVE   "SUB-TEST-F1-36"  TO PAR-NAME.
223100     MOVE   SPACE TO WRK-XN-00001.
223200     MOVE   SPACE TO SIZE-ERR2.
223300     MOVE   SPACE TO SIZE-ERR3.
223400     MOVE   SPACE TO SIZE-ERR4.
223500     MOVE   -11   TO WRK-DS-02V00.
223600     MOVE       1 TO REC-CT.
223700 SUB-TEST-F1-36-0.
223800     SUBTRACT A99-DS-02V00 FROM WRK-DS-02V00
223900         NOT ON SIZE ERROR
224000             MOVE   "1" TO WRK-XN-00001
224100             MOVE   "A" TO SIZE-ERR2
224200             MOVE   "B" TO SIZE-ERR3
224300     END-SUBTRACT
224400     MOVE   "C" TO SIZE-ERR4.
224500     GO TO   SUB-TEST-F1-36-1.
224600 SUB-DELETE-F1-36.
224700     PERFORM DE-LETE.
224800     PERFORM PRINT-DETAIL.
224900     GO      TO SUB-INIT-F1-37.
225000 SUB-TEST-F1-36-1.
225100     MOVE   "SUB-TEST-F1-36-1" TO PAR-NAME.
225200     IF      WRK-XN-00001 = SPACE
225300             PERFORM PASS
225400             PERFORM PRINT-DETAIL
225500     ELSE
225600             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
225700                  TO RE-MARK
225800             MOVE    SPACE        TO CORRECT-X
225900             MOVE    WRK-XN-00001 TO COMPUTED-X
226000             PERFORM FAIL
226100             PERFORM PRINT-DETAIL.
226200     ADD     1 TO REC-CT.
226300 SUB-TEST-F1-36-2.
226400     MOVE   "SUB-TEST-F1-36-2" TO PAR-NAME.
226500     IF      SIZE-ERR2 = SPACE
226600             PERFORM PASS
226700             PERFORM PRINT-DETAIL
226800     ELSE
226900             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
227000                  TO RE-MARK
227100             MOVE    SPACE     TO CORRECT-X
227200             MOVE    SIZE-ERR2 TO COMPUTED-X
227300             PERFORM FAIL
227400             PERFORM PRINT-DETAIL.
227500     ADD     1 TO REC-CT.
227600 SUB-TEST-F1-36-3.
227700     MOVE   "SUB-TEST-F1-36-3" TO PAR-NAME.
227800     IF      SIZE-ERR3 = SPACE
227900             PERFORM PASS
228000             PERFORM PRINT-DETAIL
228100     ELSE
228200             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
228300                  TO RE-MARK
228400             MOVE    SPACE     TO CORRECT-X
228500             MOVE    SIZE-ERR3 TO COMPUTED-X
228600             PERFORM FAIL
228700             PERFORM PRINT-DETAIL
228800     ADD     1 TO REC-CT.
228900 SUB-TEST-F1-36-4.
229000     MOVE   "SUB-TEST-F1-36-4" TO PAR-NAME.
229100     IF      SIZE-ERR4 = "C"
229200             PERFORM PASS
229300             PERFORM PRINT-DETAIL
229400     ELSE
229500             MOVE   "SCOPE TERMINATOR IGNORED"
229600                  TO RE-MARK
229700             MOVE   "C"        TO CORRECT-X
229800             MOVE    SIZE-ERR4 TO COMPUTED-X
229900             PERFORM FAIL
230000             PERFORM PRINT-DETAIL.
230100     ADD     1 TO REC-CT.
230200 SUB-TEST-F1-36-5.
230300     MOVE   "SUB-TEST-F1-36-5" TO PAR-NAME.
230400     IF      WRK-DS-02V00 = -11
230500             PERFORM PASS
230600             PERFORM PRINT-DETAIL
230700     ELSE
230800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
230900                  TO RE-MARK
231000             MOVE    -11          TO CORRECT-N
231100             MOVE    WRK-DS-02V00 TO COMPUTED-N
231200             PERFORM FAIL
231300             PERFORM PRINT-DETAIL.
231400*
231500 SUB-INIT-F1-37.
231600*    ==--> EXPLICIT SCOPE TERMINATOR<--==
231700     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
231800     MOVE   "SUB-TEST-F1-37"  TO PAR-NAME.
231900     MOVE    SPACE TO WRK-XN-00001.
232000     MOVE    SPACE TO SIZE-ERR2.
232100     MOVE    SPACE TO SIZE-ERR3.
232200     MOVE    SPACE TO SIZE-ERR4.
232300     MOVE    ZERO  TO WRK-DS-06V06.
232400     MOVE    1     TO REC-CT.
232500 SUB-TEST-F1-37-0.
232600     SUBTRACT A12THREES-DS-06V06
232700              333333
232800              A06THREES-DS-03V03
232900              -0000009
233000              FROM WRK-DS-06V06 ROUNDED
233100         NOT ON SIZE ERROR
233200             MOVE   "1" TO WRK-XN-00001
233300             MOVE   "A" TO SIZE-ERR2
233400             MOVE   "B" TO SIZE-ERR3
233500     END-SUBTRACT
233600     MOVE   "C" TO SIZE-ERR4.
233700     GO TO   SUB-TEST-F1-37-1.
233800 SUB-DELETE-F1-37.
233900     PERFORM DE-LETE.
234000     PERFORM PRINT-DETAIL.
234100     GO TO   SUB-INIT-F1-38.
234200 SUB-TEST-F1-37-1.
234300     MOVE   "SUB-TEST-F1-37-1" TO PAR-NAME.
234400     IF      WRK-XN-00001 = "1"
234500             PERFORM PASS
234600             PERFORM PRINT-DETAIL
234700     ELSE
234800             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
234900                  TO RE-MARK
235000             MOVE   "1"           TO CORRECT-X
235100             MOVE    WRK-XN-00001 TO COMPUTED-X
235200             PERFORM FAIL
235300             PERFORM PRINT-DETAIL.
235400     ADD     1 TO REC-CT.
235500 SUB-TEST-F1-37-2.
235600     MOVE   "SUB-TEST-F1-37-2" TO PAR-NAME.
235700     IF      SIZE-ERR2 = "A"
235800             PERFORM PASS
235900             PERFORM PRINT-DETAIL
236000     ELSE
236100             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
236200                  TO RE-MARK
236300             MOVE   "A"        TO CORRECT-X
236400             MOVE    SIZE-ERR2 TO COMPUTED-X
236500             PERFORM FAIL
236600             PERFORM PRINT-DETAIL.
236700     ADD     1 TO REC-CT.
236800 SUB-TEST-F1-37-3.
236900     MOVE   "SUB-TEST-F1-37-3" TO PAR-NAME.
237000     IF      SIZE-ERR3 = "B"
237100             PERFORM PASS
237200             PERFORM PRINT-DETAIL
237300     ELSE
237400             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
237500                  TO RE-MARK
237600             MOVE   "B"        TO CORRECT-X
237700             MOVE    SIZE-ERR3 TO COMPUTED-X
237800             PERFORM FAIL
237900             PERFORM PRINT-DETAIL.
238000     ADD     1 TO REC-CT.
238100 SUB-TEST-F1-37-4.
238200     MOVE   "SUB-TEST-F1-37-4" TO PAR-NAME.
238300     IF      SIZE-ERR4 = "C"
238400             PERFORM PASS
238500             PERFORM PRINT-DETAIL
238600     ELSE
238700             MOVE   "SCOPE TERMINATOR IGNORED"
238800                  TO RE-MARK
238900             MOVE   "C"        TO CORRECT-X
239000             MOVE    SIZE-ERR4 TO COMPUTED-X
239100             PERFORM FAIL
239200             PERFORM PRINT-DETAIL.
239300     ADD     1 TO REC-CT.
239400 SUB-TEST-F1-37-5.
239500     MOVE   "SUB-TEST-F1-37-5" TO PAR-NAME.
239600     IF      WRK-DS-06V06 = -666990.666333
239700             PERFORM PASS
239800             PERFORM PRINT-DETAIL
239900     ELSE
240000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
240100                  TO RE-MARK
240200             MOVE   -666990.666333 TO CORRECT-N
240300             MOVE    WRK-DS-06V06  TO COMPUTED-N
240400             PERFORM FAIL
240500             PERFORM PRINT-DETAIL.
240600*
240700 SUB-INIT-F1-38.
240800*    ==--> EXPLICIT SCOPE TERMINATOR<--==
240900     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
241000     MOVE   "SUB-TEST-F1-38"  TO PAR-NAME.
241100     MOVE   "0"   TO WRK-XN-00001.
241200     MOVE   "0"   TO SIZE-ERR4.
241300     MOVE    -11  TO WRK-DS-02V00.
241400     MOVE    1    TO REC-CT.
241500 SUB-TEST-F1-38-0.
241600     SUBTRACT A99-DS-02V00 FROM WRK-DS-02V00
241700          ON SIZE ERROR
241800             MOVE   SPACE TO WRK-XN-00001
241900      NOT ON SIZE ERROR
242000             MOVE   "1" TO WRK-XN-00001
242100     END-SUBTRACT
242200     MOVE   "C" TO SIZE-ERR4.
242300     GO TO   SUB-TEST-F1-38-1.
242400 SUB-DELETE-F1-38.
242500     PERFORM DE-LETE.
242600     PERFORM PRINT-DETAIL.
242700     GO TO   SUB-INIT-F1-39.
242800 SUB-TEST-F1-38-1.
242900     MOVE   "SUB-TEST-F1-38-1" TO PAR-NAME.
243000     IF      WRK-XN-00001 = SPACE
243100             PERFORM PASS
243200             PERFORM PRINT-DETAIL
243300     ELSE
243400             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
243500                  TO RE-MARK
243600             MOVE    SPACE        TO CORRECT-X
243700             MOVE    WRK-XN-00001 TO COMPUTED-X
243800             PERFORM FAIL
243900             PERFORM PRINT-DETAIL.
244000     ADD     1 TO REC-CT.
244100 SUB-TEST-F1-38-2.
244200     MOVE   "SUB-TEST-F1-38-2" TO PAR-NAME.
244300     IF      SIZE-ERR4 = "C"
244400             PERFORM PASS
244500             PERFORM PRINT-DETAIL
244600     ELSE
244700             MOVE   "SCOPE TERMINATOR IGNORED"
244800                  TO RE-MARK
244900             MOVE   "C"        TO CORRECT-X
245000             MOVE    SIZE-ERR4 TO COMPUTED-X
245100             PERFORM FAIL
245200             PERFORM PRINT-DETAIL.
245300     ADD     1 TO REC-CT.
245400 SUB-TEST-F1-38-3.
245500     MOVE   "SUB-TEST-F1-38-3" TO PAR-NAME.
245600     IF      WRK-DS-02V00 = -11
245700             PERFORM PASS
245800             PERFORM PRINT-DETAIL
245900     ELSE
246000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
246100                  TO RE-MARK
246200             MOVE    -11          TO CORRECT-N
246300             MOVE    WRK-DS-02V00 TO COMPUTED-N
246400             PERFORM FAIL
246500             PERFORM PRINT-DETAIL.
246600*
246700 SUB-INIT-F1-39.
246800*    ==--> EXPLICIT SCOPE TERMINATOR<--==
246900     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
247000     MOVE   "SUB-TEST-F1-39"  TO PAR-NAME.
247100     MOVE    SPACE TO WRK-XN-00001.
247200     MOVE    SPACE TO SIZE-ERR4.
247300     MOVE    ZERO  TO WRK-DS-06V06.
247400     MOVE    1     TO REC-CT.
247500 SUB-TEST-F1-39-0.
247600     SUBTRACT A12THREES-DS-06V06
247700              333333
247800              A06THREES-DS-03V03
247900              -0000009
248000        FROM WRK-DS-06V06 ROUNDED
248100             ON SIZE ERROR
248200             MOVE   "X" TO WRK-XN-00001
248300         NOT ON SIZE ERROR
248400             MOVE   "1" TO WRK-XN-00001
248500     END-SUBTRACT
248600     MOVE   "C" TO SIZE-ERR4.
248700     GO TO   SUB-TEST-F1-39-1.
248800 SUB-DELETE-F1-39.
248900     PERFORM DE-LETE.
249000     PERFORM PRINT-DETAIL.
249100     GO TO   CCVS-EXIT.
249200 SUB-TEST-F1-39-1.
249300     MOVE   "SUB-TEST-F1-39-1" TO PAR-NAME.
249400     IF      WRK-XN-00001 = "1"
249500             PERFORM PASS
249600             PERFORM PRINT-DETAIL
249700     ELSE
249800             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
249900                  TO RE-MARK
250000             MOVE   "1"           TO CORRECT-X
250100             MOVE    WRK-XN-00001 TO COMPUTED-X
250200             PERFORM FAIL
250300             PERFORM PRINT-DETAIL.
250400     ADD     1 TO REC-CT.
250500 SUB-TEST-F1-39-2.
250600     MOVE   "SUB-TEST-F1-39-2" TO PAR-NAME.
250700     IF      SIZE-ERR4 = "C"
250800             PERFORM PASS
250900             PERFORM PRINT-DETAIL
251000     ELSE
251100             MOVE   "SCOPE TERMINATOR IGNORED"
251200                  TO RE-MARK
251300             MOVE   "C"        TO CORRECT-X
251400             MOVE    SIZE-ERR4 TO COMPUTED-X
251500             PERFORM FAIL
251600             PERFORM PRINT-DETAIL.
251700     ADD     1 TO REC-CT.
251800 SUB-TEST-F1-39-3.
251900     MOVE   "SUB-TEST-F1-39-3" TO PAR-NAME.
252000     IF      WRK-DS-06V06 = -666990.666333
252100             PERFORM PASS
252200             PERFORM PRINT-DETAIL
252300     ELSE
252400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
252500                  TO RE-MARK
252600             MOVE   -666990.666333 TO CORRECT-N
252700             MOVE    WRK-DS-06V06  TO COMPUTED-N
252800             PERFORM FAIL
252900             PERFORM PRINT-DETAIL.
253000*
253100 CCVS-EXIT SECTION.
253200 CCVS-999999.
253300     GO TO CLOSE-FILES.
