000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC105A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC105A CONTAINS FURTHER TESTS OF FORMAT 1 OF
002300*    THE MOVE STATEMENT.
002400*
002500*    (SEE ALSO NC104A).
002600*
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE
004000     LABEL RECORDS
004100     XXXXX084
004200     DATA RECORD IS PRINT-REC DUMMY-RECORD.
004300 01  PRINT-REC PICTURE X(120).
004400 01  DUMMY-RECORD PICTURE X(120).
004500 WORKING-STORAGE SECTION.
004600 77  LENGTH-COUNTER              PICTURE 999  VALUE 000.
004700 77  SPOS-LIT1                    PICTURE S9(5)  VALUE +60666.
004800 77  SPOS-LIT2                    PICTURE S9(5)  VALUE +60667.
004900 77  SNEG-LIT1                    PICTURE S9(5)  VALUE -70717.
005000 77  SNEG-LIT2                    PICTURE S9(5)  VALUE -70718.
005100 77  ALPHA-LIT                    PICTURE X(5)   VALUE SPACE.
005200 77  TA--X PIC 9(5) COMPUTATIONAL.
005300 77  WRK-CS-18V00   VALUE ZERO   PICTURE 9(18) COMPUTATIONAL.
005400 77  WRK-CS-01V00   VALUE ZERO   PICTURE 9  COMPUTATIONAL.
005500 77  WRK-CS-10V00   VALUE ZERO   PICTURE 9(10) COMPUTATIONAL.
005600 77  WRK-DS-18V00   VALUE ZERO   PICTURE 9(18).
005700 77  WRK-DS-01V00   VALUE ZERO   PICTURE 9.
005800 77  WRK-DS-10V00   VALUE ZERO   PICTURE 9(10).
005900 77  WRK-CS-08V08 PIC S9(8)V9(8) VALUE 832.553 COMPUTATIONAL.
006000 77  WRK-CS-04V08 PIC S9(4)V9(8) VALUE 6382.47 COMPUTATIONAL.
006100 77  WRK-DS-08V08 PIC S9(8)V9(8) VALUE ZERO.
006200 77  WRK-DS-04V08 PIC S9(4)V9(8) VALUE ZERO.
006300 77  WRK-EDIT-Z3VZ3 PIC ZZZ.ZZZ.
006400 77  WRK-EDIT-05V00 PIC ****9.
006500 77  WRK-EDIT-18V00 PIC ZZZZZZZZZZZZZZZZZ9.
006600 77  WRK-EDIT-05V02 PIC -99999.99.
006700 77  WRK-CS-03V00 PIC S999 COMPUTATIONAL.
006800 77  MOVE74   PICTURE 9(9)V9 VALUE 234565432.1
006900              SYNCHRONIZED RIGHT COMPUTATIONAL.
007000 77  MOVE75   PICTURE 9(10)
007100              SYNCHRONIZED RIGHT COMPUTATIONAL.
007200 77  EDIT-PICTURE-01 PICTURE 9B(15)99.
007300 77  EDIT-PICTURE-02   PICTURE $0(10)999.
007400 77  EDIT-DATA-1 PICTURE 999 VALUE 333.
007500 77  EDIT-DATA-2 PICTURE 999 VALUE 916.
007600 01  GRP-EDIT-PIC-05.
007700     02 EDIT-PIC-05  PICTURE   $$$,999.99.
007800 01  GRP-EDIT-PIC-06.
007900     02  EDIT-PIC-06  PICTURE   $$$B999.99.
008000 01  GRP-EDIT-PIC-07.
008100     02  EDIT-PIC-07  PICTURE +++,999.99.
008200 01  GRP-EDIT-PIC-08.
008300     02  EDIT-PIC-08  PICTURE   ---,999.99.
008400 01  GRP-EDIT-PIC-09.
008500     02  EDIT-PIC-09  PICTURE   ***,999.99.
008600 01  GRP-EDIT-PIC-10.
008700     02  EDIT-PIC-10  PICTURE  ZZZ,999.99.
008800 01  GRP-MOVE-CONSTANTS.
008900     03  GRP-GROUP-MOVE-FROM.
009000     04  GRP-ALPHABETIC.
009100         05  ALPHABET-AN-00026   PICTURE A(26)
009200              VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
009300     04  GRP-NUMERIC.
009400         05  DIGITS-DU-10V00     PICTURE 9(10)
009500              VALUE 0123456789.
009600         05  DIGITS-DU-06V04-S REDEFINES DIGITS-DU-10V00
009700                                 PICTURE 9(6)V9999.
009800     04  GRP-ALPHANUMERIC.
009900         05  ALPHANUMERIC-XN-00049  PICTURE X(49)
010000     VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789".
010100 01  GRP-ALPHANUMERIC-1001.
010200     04  GRP-ALPHANUMERIC-1002.
010300     05 ALPHANUMERIC-XN-00050 PICTURE X(50) VALUE
010400     "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789 ".
010500 01  GRP-MOVE-RECEIVING-FIELDS.
010600     03  GRP-GROUP-MOVE-TO.
010700     04  GRP-WRK-AN-00026.
010800         05  WRK-AN-00026        PICTURE A(26).
010900     04  GRP-WRK-DU-10V00.
011000         05  WRK-DU-10V00        PICTURE 9(10).
011100     04  GRP-WRK-XN-00049.
011200         05  WRK-XN-00049        PICTURE X(49).
011300     04  GRP-NE-0001.
011400         05  NE-0001             PICTURE ZZZ,999.999,9.
011500     04  GRP-NE-0002.
011600         05  NE-0002             PICTURE Z(7),999.
011700     04  GRP-AE-0001.
011800         05  AE-0001             PICTURE X(26)BX(12)0X(10).
011900     04  GRP-AE-0002.
012000         05  AE-0002             PICTURE XX0XXBXXX.
012100 01  GRP-NUMERIC-99               PICTURE 99  VALUE 99.
012200 01  GRP-RECEIVING.
012300     02  RECEIVE-1.
012400         03  RECEIVE-2            PICTURE 99  VALUE 03.
012500         03  RECEIVE-3            PICTURE 9A9  VALUE ZERO.
012600     02  RECEIVE-4                PICTURE 9(5)V99 VALUE ZERO.
012700     02  RECEIVE-5                PICTURE X(4) VALUE ZERO.
012800     02  RECEIVE-6.
012900         03  RECEIVE-7            PICTURE 999  VALUE ZERO.
013000         03  RECEIVE-8            PICTURE AA  VALUE "AA".
013100 01  SEND-BREAKDOWN.
013200     02  FIRST-20S               PICTURE X(20).
013300     02  SECOND-20S              PICTURE X(20).
013400     02  THIRD-20S               PICTURE X(20).
013500     02  FOURTH-20S              PICTURE X(20).
013600     02  FIFTH-20S               PICTURE X(20).
013700     02  SIXTH-20S               PICTURE X(20).
013800 01  RECEIVE-BREAKDOWN.
013900     02  FIRST-20R               PICTURE X(20).
014000     02  SECOND-20R              PICTURE X(20).
014100     02  THIRD-20R               PICTURE X(20).
014200     02  FOURTH-20R              PICTURE X(20).
014300     02  FIFTH-20R               PICTURE X(20).
014400     02  SIXTH-20R               PICTURE X(20).
014500 01  FORTY-NINE-COMPARE.
014600     02  FIRST-26                PICTURE X(26).
014700     02  PADD-REST               PICTURE X(23).
014800 01  HIGH-VALUE-EDIT.
014900     02  HIGH-1                  PICTURE XX  VALUE HIGH-VALUE.
015000     02  FILLER                  PICTURE 9   VALUE 0.
015100     02  HIGH-2                  PICTURE XX  VALUE HIGH-VALUE.
015200     02  FILLER                  PICTURE X   VALUE SPACE.
015300     02  HIGH-3                  PICTURE XXX VALUE HIGH-VALUE.
015400 01  HIGH-VALU-10LONG            PICTURE X(10) VALUE HIGH-VALUE.
015500 01  LOW-VALU-10LONG             PICTURE X(10) VALUE LOW-VALUE.
015600 01  HIGH-VALU-49LONG            PICTURE X(49) VALUE HIGH-VALUE.
015700 01  LOW-VALU-49LONG             PICTURE X(49) VALUE LOW-VALUE.
015800 01  QUOTE-10LONG                PICTURE X(10) VALUE QUOTE.
015900 01  QUOTE-49LONG                PICTURE X(49) VALUE QUOTE.
016000 01  MOVE1                              PICTURE IS 9(5)
016100     VALUE IS 12345.
016200 01  MOVE2                              PICTURE IS 9(5).
016300 01  MOVE3                              PICTURE IS 99.
016400 01  MOVE5                              PICTURE IS 99V999.
016500 01  MOVE6                              PICTURE IS V99999.
016600 01  MOVE7                              PICTURE IS 9V99.
016700 01  MOVE16                             PICTURE IS 9(5)CR.
016800 01  MOVE20                             PICTURE IS X(4).
016900 01  MOVE21                             PICTURE IS X(7).
017000 01  MOVE23                             PICTURE IS 999V99
017100     VALUE IS 123.45.
017200 01  MOVE29                             PICTURE IS 9999V999.
017300 01  MOVE29X REDEFINES MOVE29           PICTURE IS X(7).
017400 01  MOVE29A VALUE IS "$123.45".
017500     02 MOVE30                          PICTURE IS $999.99.
017600 01  MOVE32                             PICTURE IS X(5)
017700     VALUE IS "ABCDE".
017800 01  MOVE35                             PICTURE IS A(3).
017900 01  MOVE35A VALUE IS "1 A05".
018000     02 MOVE36                          PICTURE IS XBA09.
018100 01  MOVE37                             PICTURE IS AAAAA
018200     VALUE IS "ABCDE".
018300 01  MOVE39                             PICTURE IS 0XXXXX0.
018400 01  MOVE40                             PICTURE IS 9999V9.
018500 01  MOVE41                             PICTURE IS A(7)
018600     JUSTIFIED RIGHT.
018700 01  MOVE42.
018800     02 MOVE43.
018900     03 MOVE43A                         PICTURE IS 999
019000     VALUE IS 123.
019100     03 MOVE43B                         PICTURE IS AAA
019200     VALUE IS "ABC".
019300     02 MOVE43C.
019400     03 MOVE44                          PICTURE IS 999
019500     VALUE IS 123.
019600     03 MOVE45                          PICTURE IS AAA
019700     VALUE IS "ABC".
019800     02 MOVE46 REDEFINES MOVE43C.
019900     03 MOVE47                          PICTURE IS X OCCURS
020000     6 TIMES.
020100 01  MOVE47A.
020200     02 MOVE48                          PICTURE IS 9V9(17).
020300     02 MOVE49                          PICTURE IS 9(5)
020400     VALUE IS 00045.
020500     02 MOVE51                          PICTURE IS S9(5)
020600     VALUE IS -12345.
020700     02 MOVE51A                         PICTURE IS S9(5)
020800     VALUE IS -00045.
020900     02 MOVE52                          PICTURE IS 9(5)-.
021000 01  MOVE66                             PICTURE IS 9(5)DB.
021100 01  MOVE67                             PICTURE IS 9(5)+.
021200 01  MOVE68                             PICTURE IS ++++99.
021300 01  MOVE69                             PICTURE IS ----99.
021400 01  MOVE70                             PICTURE IS 9(5).
021500 01  MOVE71                             PICTURE X(20).
021600 01  MOVE72                             PICTURE 9(10)
021700              VALUE 3344556677.
021800 01  MOVE73                             PICTURE X(5)BA(10)0X.
021900 01  GRP-LEV-NUMERIC.
022000     02 NUMERIC-LIT PICTURE 9(5).
022100     02 CU-05V00-001 PIC 9(5) USAGE COMP.
022200     02 CU-03V02-001 PIC 999V99 USAGE COMP.
022300     02 CS-05V00-001 PIC S9(5) USAGE IS COMP.
022400 01  TEST-RESULTS.
022500     02 FILLER                   PIC X      VALUE SPACE.
022600     02 FEATURE                  PIC X(20)  VALUE SPACE.
022700     02 FILLER                   PIC X      VALUE SPACE.
022800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
022900     02 FILLER                   PIC X      VALUE SPACE.
023000     02  PAR-NAME.
023100       03 FILLER                 PIC X(19)  VALUE SPACE.
023200       03  PARDOT-X              PIC X      VALUE SPACE.
023300       03 DOTVALUE               PIC 99     VALUE ZERO.
023400     02 FILLER                   PIC X(8)   VALUE SPACE.
023500     02 RE-MARK                  PIC X(61).
023600 01  TEST-COMPUTED.
023700     02 FILLER                   PIC X(30)  VALUE SPACE.
023800     02 FILLER                   PIC X(17)  VALUE
023900            "       COMPUTED=".
024000     02 COMPUTED-X.
024100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
024200     03 COMPUTED-N               REDEFINES COMPUTED-A
024300                                 PIC -9(9).9(9).
024400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
024500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
024600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
024700     03       CM-18V0 REDEFINES COMPUTED-A.
024800         04 COMPUTED-18V0                    PIC -9(18).
024900         04 FILLER                           PIC X.
025000     03 FILLER PIC X(50) VALUE SPACE.
025100 01  TEST-CORRECT.
025200     02 FILLER PIC X(30) VALUE SPACE.
025300     02 FILLER PIC X(17) VALUE "       CORRECT =".
025400     02 CORRECT-X.
025500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
025600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
025700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
025800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
025900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
026000     03      CR-18V0 REDEFINES CORRECT-A.
026100         04 CORRECT-18V0                     PIC -9(18).
026200         04 FILLER                           PIC X.
026300     03 FILLER PIC X(2) VALUE SPACE.
026400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
026500 01  CCVS-C-1.
026600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
026700-    "SS  PARAGRAPH-NAME
026800-    "       REMARKS".
026900     02 FILLER                     PIC X(20)    VALUE SPACE.
027000 01  CCVS-C-2.
027100     02 FILLER                     PIC X        VALUE SPACE.
027200     02 FILLER                     PIC X(6)     VALUE "TESTED".
027300     02 FILLER                     PIC X(15)    VALUE SPACE.
027400     02 FILLER                     PIC X(4)     VALUE "FAIL".
027500     02 FILLER                     PIC X(94)    VALUE SPACE.
027600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
027700 01  REC-CT                        PIC 99       VALUE ZERO.
027800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
027900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
028000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
028100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
028200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
028300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
028400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
028500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
028600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
028700 01  CCVS-H-1.
028800     02  FILLER                    PIC X(39)    VALUE SPACES.
028900     02  FILLER                    PIC X(42)    VALUE
029000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
029100     02  FILLER                    PIC X(39)    VALUE SPACES.
029200 01  CCVS-H-2A.
029300   02  FILLER                        PIC X(40)  VALUE SPACE.
029400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
029500   02  FILLER                        PIC XXXX   VALUE
029600     "4.2 ".
029700   02  FILLER                        PIC X(28)  VALUE
029800            " COPY - NOT FOR DISTRIBUTION".
029900   02  FILLER                        PIC X(41)  VALUE SPACE.
030000
030100 01  CCVS-H-2B.
030200   02  FILLER                        PIC X(15)  VALUE
030300            "TEST RESULT OF ".
030400   02  TEST-ID                       PIC X(9).
030500   02  FILLER                        PIC X(4)   VALUE
030600            " IN ".
030700   02  FILLER                        PIC X(12)  VALUE
030800     " HIGH       ".
030900   02  FILLER                        PIC X(22)  VALUE
031000            " LEVEL VALIDATION FOR ".
031100   02  FILLER                        PIC X(58)  VALUE
031200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
031300 01  CCVS-H-3.
031400     02  FILLER                      PIC X(34)  VALUE
031500            " FOR OFFICIAL USE ONLY    ".
031600     02  FILLER                      PIC X(58)  VALUE
031700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
031800     02  FILLER                      PIC X(28)  VALUE
031900            "  COPYRIGHT   1985 ".
032000 01  CCVS-E-1.
032100     02 FILLER                       PIC X(52)  VALUE SPACE.
032200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
032300     02 ID-AGAIN                     PIC X(9).
032400     02 FILLER                       PIC X(45)  VALUE SPACES.
032500 01  CCVS-E-2.
032600     02  FILLER                      PIC X(31)  VALUE SPACE.
032700     02  FILLER                      PIC X(21)  VALUE SPACE.
032800     02 CCVS-E-2-2.
032900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
033000         03 FILLER                   PIC X      VALUE SPACE.
033100         03 ENDER-DESC               PIC X(44)  VALUE
033200            "ERRORS ENCOUNTERED".
033300 01  CCVS-E-3.
033400     02  FILLER                      PIC X(22)  VALUE
033500            " FOR OFFICIAL USE ONLY".
033600     02  FILLER                      PIC X(12)  VALUE SPACE.
033700     02  FILLER                      PIC X(58)  VALUE
033800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
033900     02  FILLER                      PIC X(13)  VALUE SPACE.
034000     02 FILLER                       PIC X(15)  VALUE
034100             " COPYRIGHT 1985".
034200 01  CCVS-E-4.
034300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
034400     02 FILLER                       PIC X(4)   VALUE " OF ".
034500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
034600     02 FILLER                       PIC X(40)  VALUE
034700      "  TESTS WERE EXECUTED SUCCESSFULLY".
034800 01  XXINFO.
034900     02 FILLER                       PIC X(19)  VALUE
035000            "*** INFORMATION ***".
035100     02 INFO-TEXT.
035200       04 FILLER                     PIC X(8)   VALUE SPACE.
035300       04 XXCOMPUTED                 PIC X(20).
035400       04 FILLER                     PIC X(5)   VALUE SPACE.
035500       04 XXCORRECT                  PIC X(20).
035600     02 INF-ANSI-REFERENCE           PIC X(48).
035700 01  HYPHEN-LINE.
035800     02 FILLER  PIC IS X VALUE IS SPACE.
035900     02 FILLER  PIC IS X(65)    VALUE IS "************************
036000-    "*****************************************".
036100     02 FILLER  PIC IS X(54)    VALUE IS "************************
036200-    "******************************".
036300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
036400     "NC105A".
036500 PROCEDURE DIVISION.
036600 CCVS1 SECTION.
036700 OPEN-FILES.
036800     OPEN     OUTPUT PRINT-FILE.
036900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
037000     MOVE    SPACE TO TEST-RESULTS.
037100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
037200     GO TO CCVS1-EXIT.
037300 CLOSE-FILES.
037400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
037500 TERMINATE-CCVS.
037600S    EXIT PROGRAM.
037700STERMINATE-CALL.
037800     STOP     RUN.
037900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
038000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
038100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
038200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
038300     MOVE "****TEST DELETED****" TO RE-MARK.
038400 PRINT-DETAIL.
038500     IF REC-CT NOT EQUAL TO ZERO
038600             MOVE "." TO PARDOT-X
038700             MOVE REC-CT TO DOTVALUE.
038800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
038900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
039000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
039100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
039200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
039300     MOVE SPACE TO CORRECT-X.
039400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
039500     MOVE     SPACE TO RE-MARK.
039600 HEAD-ROUTINE.
039700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
040000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
040100 COLUMN-NAMES-ROUTINE.
040200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
040300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
040500 END-ROUTINE.
040600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
040700 END-RTN-EXIT.
040800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040900 END-ROUTINE-1.
041000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
041100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
041200      ADD PASS-COUNTER TO ERROR-HOLD.
041300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
041400      MOVE PASS-COUNTER TO CCVS-E-4-1.
041500      MOVE ERROR-HOLD TO CCVS-E-4-2.
041600      MOVE CCVS-E-4 TO CCVS-E-2-2.
041700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
041800  END-ROUTINE-12.
041900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
042000     IF       ERROR-COUNTER IS EQUAL TO ZERO
042100         MOVE "NO " TO ERROR-TOTAL
042200         ELSE
042300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
042400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
042500     PERFORM WRITE-LINE.
042600 END-ROUTINE-13.
042700     IF DELETE-COUNTER IS EQUAL TO ZERO
042800         MOVE "NO " TO ERROR-TOTAL  ELSE
042900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
043000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
043100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
043200      IF   INSPECT-COUNTER EQUAL TO ZERO
043300          MOVE "NO " TO ERROR-TOTAL
043400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
043500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
043600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
043700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
043800 WRITE-LINE.
043900     ADD 1 TO RECORD-COUNT.
044000Y    IF RECORD-COUNT GREATER 42
044100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
044200Y        MOVE SPACE TO DUMMY-RECORD
044300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
044400Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
044500Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
044600Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
044700Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
044800Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
044900Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
045000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
045100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
045200Y        MOVE ZERO TO RECORD-COUNT.
045300     PERFORM WRT-LN.
045400 WRT-LN.
045500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
045600     MOVE SPACE TO DUMMY-RECORD.
045700 BLANK-LINE-PRINT.
045800     PERFORM WRT-LN.
045900 FAIL-ROUTINE.
046000     IF     COMPUTED-X NOT EQUAL TO SPACE
046100            GO TO FAIL-ROUTINE-WRITE.
046200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
046300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
046500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046600     MOVE   SPACES TO INF-ANSI-REFERENCE.
046700     GO TO  FAIL-ROUTINE-EX.
046800 FAIL-ROUTINE-WRITE.
046900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
047000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
047100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
047200     MOVE   SPACES TO COR-ANSI-REFERENCE.
047300 FAIL-ROUTINE-EX. EXIT.
047400 BAIL-OUT.
047500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
047600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
047700 BAIL-OUT-WRITE.
047800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
047900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
048000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
048100     MOVE   SPACES TO INF-ANSI-REFERENCE.
048200 BAIL-OUT-EX. EXIT.
048300 CCVS1-EXIT.
048400     EXIT.
048500 SECT-NC105A-001 SECTION.
048600 MOVE-INIT-F1-1.
048700     MOVE "VI-102 6.18.2"        TO ANSI-REFERENCE.
048800     MOVE "MOVE LITERAL        " TO FEATURE.
048900 MOVE-TEST-F1-1-0.
049000     MOVE     123.45 TO MOVE40.
049100 MOVE-TEST-F1-1-1.
049200     IF       MOVE40 EQUAL TO 123.4
049300              PERFORM PASS
049400     ELSE
049500              GO TO MOVE-FAIL-F1-1.
049600*    NOTE NUMERIC LITERAL NON INTEGRAL TO NNI MOVE, TRUNCATION ON
049700*    RIGHT, ZERO PADDIND ON LEFT.
049800     GO TO    MOVE-WRITE-F1-1.
049900 MOVE-DELETE-F1-1.
050000     PERFORM  DE-LETE.
050100     GO TO    MOVE-WRITE-F1-1.
050200 MOVE-FAIL-F1-1.
050300     MOVE     MOVE40 TO COMPUTED-N.
050400     MOVE     123.4 TO CORRECT-N.
050500     PERFORM  FAIL.
050600 MOVE-WRITE-F1-1.
050700     MOVE "MOVE-TEST-F1-1" TO PAR-NAME.
050800     PERFORM  PRINT-DETAIL.
050900 MOVE-TEST-F1-2-0.
051000     MOVE     123.45 TO MOVE5.
051100 MOVE-TEST-F1-2-1.
051200     IF       MOVE5 EQUAL TO 23.45
051300              PERFORM PASS
051400              ELSE
051500              GO TO MOVE-FAIL-F1-2.
051600*    NOTE NUMERIC LITERAL NON-INTEGRAL TO NNI MOVE, TRUNCATION ON
051700*    LEFT, ZERO PADDING ON RIGHT.
051800     GO TO    MOVE-WRITE-F1-2.
051900 MOVE-DELETE-F1-2.
052000     PERFORM  DE-LETE.
052100     GO TO    MOVE-WRITE-F1-2.
052200 MOVE-FAIL-F1-2.
052300     MOVE     MOVE5 TO COMPUTED-N.
052400     MOVE     23.45 TO CORRECT-N.
052500     PERFORM  FAIL.
052600 MOVE-WRITE-F1-2.
052700     MOVE "MOVE-TEST-F1-2" TO PAR-NAME.
052800     PERFORM  PRINT-DETAIL.
052900 MOVE-TEST-F1-3-0.
053000     MOVE "ABCDE" TO MOVE21.
053100 MOVE-TEST-F1-3-1.
053200     IF       MOVE21 EQUAL TO "ABCDE  "
053300              PERFORM PASS
053400              ELSE
053500              GO TO MOVE-FAIL-F1-3.
053600*    NOTE NON-NUMERIC LITERAL TO AN MOVE, SPACE PADDING ON RIGHT.
053700     GO TO    MOVE-WRITE-F1-3.
053800 MOVE-DELETE-F1-3.
053900     PERFORM  DE-LETE.
054000     GO TO    MOVE-WRITE-F1-3.
054100 MOVE-FAIL-F1-3.
054200     MOVE     MOVE21 TO COMPUTED-A.
054300     MOVE "ABCDE  " TO CORRECT-A.
054400     PERFORM  FAIL.
054500 MOVE-WRITE-F1-3.
054600     MOVE "MOVE-TEST-F1-3" TO PAR-NAME.
054700     PERFORM  PRINT-DETAIL.
054800 MOVE-TEST-F1-4-0.
054900     MOVE "ABCDE" TO MOVE20.
055000 MOVE-TEST-F1-4-1.
055100     IF       MOVE20 EQUAL TO "ABCD"
055200              PERFORM PASS
055300              ELSE
055400              GO TO MOVE-FAIL-F1-4.
055500*    NOTE NON-NUMERIC LITERAL TO AN MOVE, TRUNCATION ON RIGHT.
055600     GO TO    MOVE-WRITE-F1-4.
055700 MOVE-DELETE-F1-4.
055800     PERFORM  DE-LETE.
055900     GO TO    MOVE-WRITE-F1-4.
056000 MOVE-FAIL-F1-4.
056100     MOVE     MOVE20 TO COMPUTED-A.
056200     MOVE "ABCD" TO CORRECT-A.
056300     PERFORM  FAIL.
056400 MOVE-WRITE-F1-4.
056500     MOVE "MOVE-TEST-F1-4" TO PAR-NAME.
056600     PERFORM  PRINT-DETAIL.
056700 MOVE-INIT-F1-5.
056800     MOVE "MISC MOVE           " TO FEATURE.
056900     MOVE 12345 TO MOVE1.
057000 MOVE-TEST-F1-5-0.
057100     MOVE     MOVE1 TO TA--X.
057200 MOVE-TEST-F1-5-1.
057300     IF       TA--X EQUAL TO 12345
057400              PERFORM PASS
057500              ELSE
057600              GO TO MOVE-FAIL-F1-5.
057700*    NOTE NUMERIC LITERAL TO COMP, ZERO FILL ON LEFT.
057800     GO TO    MOVE-WRITE-F1-5.
057900 MOVE-DELETE-F1-5.
058000     PERFORM  DE-LETE.
058100     GO TO    MOVE-WRITE-F1-5.
058200 MOVE-FAIL-F1-5.
058300     MOVE     TA--X TO COMPUTED-N.
058400     MOVE     12345 TO CORRECT-N.
058500     PERFORM  FAIL.
058600 MOVE-WRITE-F1-5.
058700     MOVE "MOVE-TEST-F1-5" TO PAR-NAME.
058800     PERFORM  PRINT-DETAIL.
058900 MOVE-TEST-F1-6-0.
059000     MOVE     SPACE TO MOVE20.
059100 MOVE-TEST-F1-6-1.
059200     IF       MOVE20 EQUAL TO "    "
059300              PERFORM PASS
059400              ELSE
059500              GO TO MOVE-FAIL-F1-6.
059600*    NOTE FIGURATIVE CONSTANT SPACE TO AN MOVE.
059700     GO TO    MOVE-WRITE-F1-6.
059800 MOVE-DELETE-F1-6.
059900     PERFORM  DE-LETE.
060000     GO TO    MOVE-WRITE-F1-6.
060100 MOVE-FAIL-F1-6.
060200     MOVE     MOVE20 TO COMPUTED-A.
060300     MOVE "    " TO CORRECT-A.
060400     PERFORM  FAIL.
060500 MOVE-WRITE-F1-6.
060600     MOVE "MOVE-TEST-F1-6" TO PAR-NAME.
060700     PERFORM  PRINT-DETAIL.
060800 MOVE-TEST-F1-7-0.
060900     MOVE     ZERO TO MOVE2.
061000 MOVE-TEST-F1-7-1.
061100     IF       MOVE2 EQUAL TO 00000
061200              PERFORM PASS
061300              ELSE
061400              GO TO MOVE-FAIL-F1-7.
061500*    NOTE FIGURATIVE CONSTANT ZERO TO N MOVE.
061600     GO TO    MOVE-WRITE-F1-7.
061700 MOVE-DELETE-F1-7.
061800     PERFORM  DE-LETE.
061900     GO TO    MOVE-WRITE-F1-7.
062000 MOVE-FAIL-F1-7.
062100     MOVE     MOVE2 TO COMPUTED-N.
062200     MOVE     00000 TO CORRECT-N.
062300     PERFORM  FAIL.
062400 MOVE-WRITE-F1-7.
062500     MOVE "MOVE-TEST-F1-7" TO PAR-NAME.
062600     PERFORM  PRINT-DETAIL.
062700 MOVE-INIT-F1-8.
062800     MOVE    "ABCDE" TO MOVE32.
062900 MOVE-TEST-F1-8-0.
063000     MOVE     MOVE32 TO MOVE41.
063100 MOVE-TEST-F1-8-1.
063200     IF       MOVE41 EQUAL TO "  ABCDE"
063300              PERFORM PASS
063400              ELSE
063500              GO TO MOVE-FAIL-F1-8.
063600*    NOTE AN TO A MOVE, JUSTIFIED RIGHT.
063700     GO TO    MOVE-WRITE-F1-8.
063800 MOVE-DELETE-F1-8.
063900     PERFORM  DE-LETE.
064000     GO TO    MOVE-WRITE-F1-8.
064100 MOVE-FAIL-F1-8.
064200     MOVE     MOVE41 TO COMPUTED-A.
064300     MOVE "  ABCDE" TO CORRECT-A.
064400     PERFORM  FAIL.
064500 MOVE-WRITE-F1-8.
064600     MOVE "MOVE-TEST-F1-8" TO PAR-NAME.
064700     PERFORM  PRINT-DETAIL.
064800 MOVE-INIT-F1-9.
064900     MOVE "GROUP MOVE          " TO FEATURE.
065000     MOVE     12345 TO MOVE1.
065100 MOVE-TEST-F1-9-0.
065200     MOVE     MOVE1 TO MOVE46.
065300 MOVE-TEST-F1-9-1.
065400     IF       MOVE46 EQUAL TO "12345 "
065500              PERFORM PASS
065600              ELSE
065700              GO TO MOVE-FAIL-F1-9.
065800*    NOTE NI TO GROUP MOVE.
065900     GO TO    MOVE-WRITE-F1-9.
066000 MOVE-DELETE-F1-9.
066100     PERFORM  DE-LETE.
066200     GO TO    MOVE-WRITE-F1-9.
066300 MOVE-FAIL-F1-9.
066400     MOVE     MOVE46 TO COMPUTED-A.
066500     MOVE "12345 " TO CORRECT-A.
066600     PERFORM  FAIL.
066700 MOVE-WRITE-F1-9.
066800     MOVE "MOVE-TEST-F1-9" TO PAR-NAME.
066900     PERFORM  PRINT-DETAIL.
067000 MOVE-INIT-F1-10.
067100     MOVE     123.45 TO MOVE23.
067200 MOVE-TEST-F1-10-0.
067300     MOVE     MOVE23 TO MOVE46.
067400 MOVE-TEST-F1-10-1.
067500     IF       MOVE46 EQUAL TO "12345 "
067600              PERFORM PASS
067700              ELSE
067800              GO TO MOVE-FAIL-F1-10.
067900*    NOTE NNI TO GROUP MOVE.
068000     GO TO    MOVE-WRITE-F1-10.
068100 MOVE-DELETE-F1-10.
068200     PERFORM  DE-LETE.
068300     GO TO    MOVE-WRITE-F1-10.
068400 MOVE-FAIL-F1-10.
068500     MOVE     MOVE46 TO COMPUTED-A.
068600     MOVE "12345 " TO CORRECT-A.
068700     PERFORM  FAIL.
068800 MOVE-WRITE-F1-10.
068900     MOVE "MOVE-TEST-F1-10" TO PAR-NAME.
069000     PERFORM  PRINT-DETAIL.
069100 MOVE-INIT-F1-11.
069200     MOVE    "$123.45" TO MOVE29A.
069300 MOVE-TEST-F1-11-0.
069400     MOVE     MOVE30 TO MOVE46.
069500 MOVE-TEST-F1-11-1.
069600     IF       MOVE46 EQUAL TO "$123.4"
069700              PERFORM PASS
069800              ELSE
069900              GO TO MOVE-FAIL-F1-11.
070000*    NOTE NE TO GROUP MOVE.
070100     GO TO    MOVE-WRITE-F1-11.
070200 MOVE-DELETE-F1-11.
070300     PERFORM  DE-LETE.
070400     GO TO    MOVE-WRITE-F1-11.
070500 MOVE-FAIL-F1-11.
070600     MOVE     MOVE46 TO COMPUTED-A.
070700     MOVE "$123.4" TO CORRECT-A.
070800     PERFORM  FAIL.
070900 MOVE-WRITE-F1-11.
071000     MOVE "MOVE-TEST-F1-11" TO PAR-NAME.
071100     PERFORM  PRINT-DETAIL.
071200 MOVE-INIT-F1-12.
071300     MOVE    "ABCDE" TO MOVE32.
071400 MOVE-TEST-F1-12-0.
071500     MOVE     MOVE32 TO MOVE46.
071600 MOVE-TEST-F1-12-1.
071700     IF       MOVE46 EQUAL TO "ABCDE "
071800              PERFORM PASS
071900              ELSE
072000              GO TO MOVE-FAIL-F1-12.
072100*    NOTE AN TO GROUP MOVE.
072200     GO TO    MOVE-WRITE-F1-12.
072300 MOVE-DELETE-F1-12.
072400     PERFORM  DE-LETE.
072500     GO TO    MOVE-WRITE-F1-12.
072600 MOVE-FAIL-F1-12.
072700     MOVE     MOVE46 TO COMPUTED-A.
072800     MOVE "ABCDE" TO CORRECT-A.
072900     PERFORM  FAIL.
073000 MOVE-WRITE-F1-12.
073100     MOVE "MOVE-TEST-F1-12" TO PAR-NAME.
073200     PERFORM  PRINT-DETAIL.
073300 MOVE-INIT-F1-13.
073400     MOVE    "1 A05" TO MOVE35A.
073500 MOVE-TEST-F1-13-0.
073600     MOVE     MOVE36 TO MOVE46.
073700 MOVE-TEST-F1-13-1.
073800     IF       MOVE46 EQUAL TO "1 A05 "
073900              PERFORM PASS
074000              ELSE
074100              GO TO MOVE-FAIL-F1-13.
074200*    NOTE AE TO GROUP MOVE.
074300     GO TO    MOVE-WRITE-F1-13.
074400 MOVE-DELETE-F1-13.
074500     PERFORM  DE-LETE.
074600     GO TO    MOVE-WRITE-F1-13.
074700 MOVE-FAIL-F1-13.
074800     MOVE     MOVE46 TO COMPUTED-A.
074900     MOVE "1 A05 " TO CORRECT-A.
075000     PERFORM  FAIL.
075100 MOVE-WRITE-F1-13.
075200     MOVE "MOVE-TEST-F1-13" TO PAR-NAME.
075300     PERFORM  PRINT-DETAIL.
075400 MOVE-INIT-F1-14.
075500     MOVE    "ABCDE" TO MOVE37.
075600 MOVE-TEST-F1-14-0.
075700     MOVE     MOVE37 TO MOVE46.
075800 MOVE-TEST-F1-14-1.
075900     IF       MOVE46 EQUAL TO "ABCDE "
076000              PERFORM PASS
076100              ELSE
076200              GO TO MOVE-FAIL-F1-14.
076300*    NOTE A TO GROUP MOVE.
076400     GO TO    MOVE-WRITE-F1-14.
076500 MOVE-DELETE-F1-14.
076600     PERFORM  DE-LETE.
076700     GO TO    MOVE-WRITE-F1-14.
076800 MOVE-FAIL-F1-14.
076900     MOVE     MOVE46 TO COMPUTED-A.
077000     MOVE "ABCDE " TO CORRECT-A.
077100     PERFORM  FAIL.
077200 MOVE-WRITE-F1-14.
077300     MOVE "MOVE-TEST-F1-14" TO PAR-NAME.
077400     PERFORM  PRINT-DETAIL.
077500 MOVE-INIT-F1-15.
077600     MOVE    "123ABC" TO MOVE43.
077700 MOVE-TEST-F1-15-0.
077800     MOVE     MOVE43 TO MOVE46.
077900 MOVE-TEST-F1-15-1.
078000     IF       MOVE46 EQUAL TO "123ABC"
078100              PERFORM PASS
078200              ELSE
078300              GO TO MOVE-FAIL-F1-15.
078400*    NOTE GROUP TO GROUP MOVE.
078500     GO TO    MOVE-WRITE-F1-15.
078600 MOVE-DELETE-F1-15.
078700     PERFORM  DE-LETE.
078800     GO TO    MOVE-WRITE-F1-15.
078900 MOVE-FAIL-F1-15.
079000     MOVE     MOVE46 TO COMPUTED-A.
079100     MOVE "123ABC" TO CORRECT-A.
079200     PERFORM  FAIL.
079300 MOVE-WRITE-F1-15.
079400     MOVE "MOVE-TEST-F1-15" TO PAR-NAME.
079500     PERFORM  PRINT-DETAIL.
079600 MOVE-INIT-F1-16.
079700     MOVE    "123ABC" TO MOVE43.
079800 MOVE-TEST-F1-16-0.
079900     MOVE     MOVE43 TO MOVE3.
080000 MOVE-TEST-F1-16-1.
080100     IF       MOVE3 EQUAL TO 12
080200              PERFORM PASS
080300              ELSE
080400              GO TO MOVE-FAIL-F1-16.
080500*    NOTE GROUP TO NI MOVE.
080600     GO TO    MOVE-WRITE-F1-16.
080700 MOVE-DELETE-F1-16.
080800     PERFORM  DE-LETE.
080900     GO TO    MOVE-WRITE-F1-16.
081000 MOVE-FAIL-F1-16.
081100     MOVE     MOVE3 TO COMPUTED-N.
081200     MOVE     12 TO CORRECT-N.
081300     PERFORM  FAIL.
081400 MOVE-WRITE-F1-16.
081500     MOVE "MOVE-TEST-F1-16" TO PAR-NAME.
081600     PERFORM  PRINT-DETAIL.
081700 MOVE-INIT-F1-17.
081800     MOVE    "123ABC" TO MOVE43.
081900 MOVE-TEST-F1-17-0.
082000     MOVE     MOVE43 TO MOVE29.
082100 MOVE-TEST-F1-17-1.
082200     IF       MOVE29X EQUAL TO "123ABC "
082300              PERFORM PASS
082400              ELSE
082500              GO TO MOVE-FAIL-F1-17.
082600*    NOTE GROUP TO NNI MOVE.
082700     GO TO    MOVE-WRITE-F1-17.
082800 MOVE-DELETE-F1-17.
082900     PERFORM  DE-LETE.
083000     GO TO    MOVE-WRITE-F1-17.
083100 MOVE-FAIL-F1-17.
083200     MOVE     MOVE29X TO COMPUTED-A.
083300     MOVE "123ABC" TO CORRECT-A.
083400     PERFORM  FAIL.
083500 MOVE-WRITE-F1-17.
083600     MOVE "MOVE-TEST-F1-17" TO PAR-NAME.
083700     PERFORM  PRINT-DETAIL.
083800 MOVE-INIT-F1-18.
083900     MOVE    "123ABC" TO MOVE43.
084000 MOVE-TEST-F1-18-0.
084100     MOVE     MOVE43 TO MOVE21.
084200 MOVE-TEST-F1-18-1.
084300     IF       MOVE21 EQUAL TO "123ABC "
084400              PERFORM PASS
084500              ELSE
084600              GO TO MOVE-FAIL-F1-18.
084700*    NOTE GROUP TO AN MOVE SPACE PADDING ON RIGHT.
084800     GO TO    MOVE-WRITE-F1-18.
084900 MOVE-DELETE-F1-18.
085000     PERFORM  DE-LETE.
085100     GO TO    MOVE-WRITE-F1-18.
085200 MOVE-FAIL-F1-18.
085300     MOVE     MOVE21 TO COMPUTED-A.
085400     MOVE "123ABC" TO CORRECT-A.
085500     PERFORM  FAIL.
085600 MOVE-WRITE-F1-18.
085700     MOVE "MOVE-TEST-F1-18" TO PAR-NAME.
085800     PERFORM  PRINT-DETAIL.
085900 MOVE-INIT-F1-19.
086000     MOVE    "123ABC" TO MOVE43.
086100 MOVE-TEST-F1-19-0.
086200     MOVE     MOVE43 TO MOVE20.
086300 MOVE-TEST-F1-19-1.
086400     IF       MOVE20 EQUAL TO "123A"
086500              PERFORM PASS
086600              ELSE
086700              GO TO MOVE-FAIL-F1-19.
086800*    NOTE GROUP TO AN MOVE.
086900     GO TO    MOVE-WRITE-F1-19.
087000 MOVE-DELETE-F1-19.
087100     PERFORM  DE-LETE.
087200     GO TO    MOVE-WRITE-F1-19.
087300 MOVE-FAIL-F1-19.
087400     MOVE     MOVE20 TO COMPUTED-A.
087500     MOVE "123A" TO CORRECT-A.
087600     PERFORM  FAIL.
087700 MOVE-WRITE-F1-19.
087800     MOVE "MOVE-TEST-F1-19" TO PAR-NAME.
087900     PERFORM  PRINT-DETAIL.
088000 MOVE-INIT-F1-20.
088100     MOVE    "123ABC" TO MOVE43.
088200 MOVE-TEST-F1-20-0.
088300     MOVE     MOVE43 TO MOVE39.
088400 MOVE-TEST-F1-20-1.
088500     IF       MOVE39 NOT EQUAL TO "123ABC "
088600              GO TO MOVE-FAIL-F1-20.
088700*    NOTE GROUP TO AE MOVE.
088800     PERFORM PASS.
088900     GO TO    MOVE-WRITE-F1-20.
089000 MOVE-DELETE-F1-20.
089100     PERFORM  DE-LETE.
089200     GO TO    MOVE-WRITE-F1-20.
089300 MOVE-FAIL-F1-20.
089400     MOVE     MOVE39 TO COMPUTED-A.
089500     MOVE "123ABC" TO CORRECT-A.
089600     PERFORM  FAIL.
089700 MOVE-WRITE-F1-20.
089800     MOVE "MOVE-TEST-F1-20" TO PAR-NAME.
089900     PERFORM  PRINT-DETAIL.
090000 MOVE-INIT-F1-21.
090100     MOVE    "123ABC" TO MOVE43.
090200 MOVE-TEST-F1-21-0.
090300     MOVE     MOVE43 TO MOVE35.
090400 MOVE-TEST-F1-21-1.
090500     IF       MOVE35 EQUAL TO "123"
090600              PERFORM PASS
090700              ELSE
090800              GO TO MOVE-FAIL-F1-21.
090900*    NOTE GROUP TO A MOVE.
091000     GO TO    MOVE-WRITE-F1-21.
091100 MOVE-DELETE-F1-21.
091200     PERFORM  DE-LETE.
091300     GO TO    MOVE-WRITE-F1-21.
091400 MOVE-FAIL-F1-21.
091500     MOVE     MOVE35 TO COMPUTED-A.
091600     MOVE "123" TO CORRECT-A.
091700     PERFORM  FAIL.
091800 MOVE-WRITE-F1-21.
091900     MOVE "MOVE-TEST-F1-21" TO PAR-NAME.
092000     PERFORM  PRINT-DETAIL.
092100 MOVE-INIT-F1-22.
092200     MOVE "EDITED MOVE         " TO FEATURE.
092300     MOVE "12345" TO MOVE1.
092400 MOVE-TEST-F1-22-0.
092500     MOVE     MOVE1 TO MOVE16.
092600 MOVE-TEST-F1-22-1.
092700     IF       MOVE16 EQUAL TO "12345  "
092800              PERFORM PASS
092900              ELSE
093000              GO TO MOVE-FAIL-F1-22.
093100*    NOTE NI TO NE MOVE, REPORT SYMBOL CR.
093200     GO TO    MOVE-WRITE-F1-22.
093300 MOVE-DELETE-F1-22.
093400     PERFORM  DE-LETE.
093500     GO TO    MOVE-WRITE-F1-22.
093600 MOVE-FAIL-F1-22.
093700     MOVE     MOVE16 TO COMPUTED-A.
093800     MOVE "12345  " TO CORRECT-A.
093900     PERFORM  FAIL.
094000 MOVE-WRITE-F1-22.
094100     MOVE "MOVE-TEST-F1-22" TO PAR-NAME.
094200     PERFORM  PRINT-DETAIL.
094300 MOVE-INIT-F1-23.
094400     MOVE "12345" TO MOVE1.
094500 MOVE-TEST-F1-23-0.
094600     MOVE     MOVE1 TO MOVE52.
094700 MOVE-TEST-F1-23-1.
094800     IF       MOVE52 EQUAL TO "12345 "
094900              PERFORM PASS
095000              ELSE
095100              GO TO MOVE-FAIL-F1-23.
095200*    NOTE NI TO NE MOVE, REPORT SIGN -.
095300     GO TO    MOVE-WRITE-F1-23.
095400 MOVE-DELETE-F1-23.
095500     PERFORM  DE-LETE.
095600     GO TO    MOVE-WRITE-F1-23.
095700 MOVE-FAIL-F1-23.
095800     MOVE     MOVE52 TO COMPUTED-A.
095900     MOVE "12345 " TO CORRECT-A.
096000     PERFORM  FAIL.
096100 MOVE-WRITE-F1-23.
096200     MOVE "MOVE-TEST-F1-23" TO PAR-NAME.
096300     PERFORM  PRINT-DETAIL.
096400 MOVE-INIT-F1-24.
096500     MOVE -12345 TO MOVE51.
096600 MOVE-TEST-F1-24-0.
096700     MOVE     MOVE51 TO MOVE66.
096800 MOVE-TEST-F1-24-1.
096900     IF       MOVE66 EQUAL TO "12345DB"
097000              PERFORM PASS
097100              ELSE
097200              GO TO MOVE-FAIL-F1-24.
097300*    NOTE NI TO NE MOVE, REPORT SYMBOL DB.
097400     GO TO    MOVE-WRITE-F1-24.
097500 MOVE-DELETE-F1-24.
097600     PERFORM  DE-LETE.
097700     GO TO    MOVE-WRITE-F1-24.
097800 MOVE-FAIL-F1-24.
097900     MOVE     MOVE66 TO COMPUTED-A.
098000     MOVE "12345DB" TO CORRECT-A.
098100     PERFORM  FAIL.
098200 MOVE-WRITE-F1-24.
098300     MOVE "MOVE-TEST-F1-24" TO PAR-NAME.
098400     PERFORM  PRINT-DETAIL.
098500 MOVE-INIT-F1-25.
098600     MOVE  12345 TO MOVE1.
098700 MOVE-TEST-F1-25-0.
098800     MOVE     MOVE1 TO MOVE66.
098900 MOVE-TEST-F1-25-1.
099000     IF       MOVE66 EQUAL TO "12345  "
099100              PERFORM PASS
099200              ELSE
099300              GO TO MOVE-FAIL-F1-25.
099400*    NOTE NI TO NE MOVE, REPORT SYMBOL DB.
099500     GO TO    MOVE-WRITE-F1-25.
099600 MOVE-DELETE-F1-25.
099700     PERFORM  DE-LETE.
099800     GO TO    MOVE-WRITE-F1-25.
099900 MOVE-FAIL-F1-25.
100000     MOVE     MOVE66 TO COMPUTED-A.
100100     MOVE "12345  " TO CORRECT-A.
100200     PERFORM  FAIL.
100300 MOVE-WRITE-F1-25.
100400     MOVE "MOVE-TEST-F1-25" TO PAR-NAME.
100500     PERFORM  PRINT-DETAIL.
100600 MOVE-INIT-F1-26.
100700     MOVE -12345 TO MOVE51.
100800 MOVE-TEST-F1-26-0.
100900     MOVE     MOVE51 TO MOVE67.
101000 MOVE-TEST-F1-26-1.
101100     IF       MOVE67 EQUAL TO "12345-"
101200              PERFORM PASS
101300              ELSE
101400              GO TO MOVE-FAIL-F1-26.
101500*    NOTE NI TO NE MOVE, REPORT SIGN +.
101600     GO TO    MOVE-WRITE-F1-26.
101700 MOVE-DELETE-F1-26.
101800     PERFORM  DE-LETE.
101900     GO TO    MOVE-WRITE-F1-26.
102000 MOVE-FAIL-F1-26.
102100     MOVE     MOVE67 TO COMPUTED-A.
102200     MOVE "12345-" TO CORRECT-A.
102300     PERFORM  FAIL.
102400 MOVE-WRITE-F1-26.
102500     MOVE "MOVE-TEST-F1-26" TO PAR-NAME.
102600     PERFORM  PRINT-DETAIL.
102700 MOVE-INIT-F1-27.
102800     MOVE  12345 TO MOVE1.
102900 MOVE-TEST-F1-27-0.
103000     MOVE     MOVE1 TO MOVE67.
103100 MOVE-TEST-F1-27-1.
103200     IF       MOVE67 EQUAL TO "12345+"
103300              PERFORM PASS
103400              ELSE
103500              GO TO MOVE-FAIL-F1-27.
103600*    NOTE NI TO NE MOVE, REPORT SIGN +.
103700     GO TO    MOVE-WRITE-F1-27.
103800 MOVE-DELETE-F1-27.
103900     PERFORM  DE-LETE.
104000     GO TO    MOVE-WRITE-F1-27.
104100 MOVE-FAIL-F1-27.
104200     MOVE     MOVE67 TO COMPUTED-A.
104300     MOVE "12345+" TO CORRECT-A.
104400     PERFORM  FAIL.
104500 MOVE-WRITE-F1-27.
104600     MOVE "MOVE-TEST-F1-27" TO PAR-NAME.
104700     PERFORM  PRINT-DETAIL.
104800 MOVE-INIT-F1-28.
104900     MOVE     45 TO MOVE49.
105000 MOVE-TEST-F1-28-0.
105100     MOVE     MOVE49 TO MOVE68.
105200 MOVE-TEST-F1-28-1.
105300     IF       MOVE68 EQUAL TO "   +45"
105400              PERFORM PASS
105500              ELSE
105600              GO TO MOVE-FAIL-F1-28.
105700*    NOTE NI TO NE MOVE, FLOATING REPORT SIGN.
105800     GO TO    MOVE-WRITE-F1-28.
105900 MOVE-DELETE-F1-28.
106000     PERFORM  DE-LETE.
106100     GO TO    MOVE-WRITE-F1-28.
106200 MOVE-FAIL-F1-28.
106300     MOVE     MOVE68 TO COMPUTED-A.
106400     MOVE "   +45" TO CORRECT-A.
106500     PERFORM  FAIL.
106600 MOVE-WRITE-F1-28.
106700     MOVE "MOVE-TEST-F1-28" TO PAR-NAME.
106800     PERFORM  PRINT-DETAIL.
106900 MOVE-INIT-F1-29.
107000     MOVE    -45 TO MOVE51A.
107100 MOVE-TEST-F1-29-0.
107200     MOVE     MOVE51A TO MOVE69.
107300 MOVE-TEST-F1-29-1.
107400     IF       MOVE69 EQUAL TO "   -45"
107500              PERFORM PASS
107600              ELSE
107700              GO TO MOVE-FAIL-F1-29.
107800*    NOTE NI TO NE MOVE, FLOATING REPORT SIGN.
107900     GO TO    MOVE-WRITE-F1-29.
108000 MOVE-DELETE-F1-29.
108100     PERFORM  DE-LETE.
108200     GO TO    MOVE-WRITE-F1-29.
108300 MOVE-FAIL-F1-29.
108400     MOVE     MOVE69 TO COMPUTED-A.
108500     MOVE "   -45" TO CORRECT-A.
108600     PERFORM  FAIL.
108700 MOVE-WRITE-F1-29.
108800     MOVE "MOVE-TEST-F1-29" TO PAR-NAME.
108900     PERFORM  PRINT-DETAIL.
109000 MOVE-INIT-F1-30.
109100     MOVE  12345 TO MOVE1.
109200 MOVE-TEST-F1-30-0.
109300     MOVE     MOVE1 TO MOVE70.
109400 MOVE-TEST-F1-30-1.
109500     IF       MOVE70 EQUAL TO 12345
109600              PERFORM PASS
109700              ELSE
109800              GO TO MOVE-FAIL-F1-30.
109900*    NOTE, TO AUDIT SYNC OPTION.
110000     GO TO    MOVE-WRITE-F1-30.
110100 MOVE-DELETE-F1-30.
110200     PERFORM  DE-LETE.
110300     GO TO    MOVE-WRITE-F1-30.
110400 MOVE-FAIL-F1-30.
110500     MOVE     MOVE70 TO COMPUTED-N.
110600     MOVE     12345 TO CORRECT-N.
110700     PERFORM  FAIL.
110800 MOVE-WRITE-F1-30.
110900     MOVE "MISC MOVE           " TO FEATURE.
111000     MOVE "MOVE-TEST-F1-30" TO PAR-NAME.
111100     PERFORM  PRINT-DETAIL.
111200 MOVE-INIT-F1-31.
111300
111400 MOVE-TEST-F1-31-0.
111500     MOVE     1.11115111115111115 TO MOVE48.
111600 MOVE-TEST-F1-31-1.
111700     IF       MOVE48 EQUAL TO 1.11115111115111115
111800              PERFORM PASS
111900              ELSE
112000              GO TO MOVE-FAIL-F1-31.
112100*    NOTE MAXIMUM LENGTH NUMERIC LITERAL.
112200     GO TO    MOVE-WRITE-F1-31.
112300 MOVE-DELETE-F1-31.
112400     PERFORM  DE-LETE.
112500     GO TO    MOVE-WRITE-F1-31.
112600 MOVE-FAIL-F1-31.
112700     MOVE     MOVE48 TO COMPUTED-N.
112800     MOVE "1.11115111115111115" TO CORRECT-A.
112900     PERFORM  FAIL.
113000 MOVE-WRITE-F1-31.
113100     MOVE "MAXIMUM LENGTH MOVE " TO FEATURE.
113200     MOVE "MOVE-TEST-F1-31" TO PAR-NAME.
113300     PERFORM  PRINT-DETAIL.
113400 MOVE-INIT-F1-32.
113500              MOVE 0 TO TA--X.
113600 MOVE-TEST-F1-32-0.
113700     MOVE     MOVE23 TO MOVE5 MOVE6 MOVE7.
113800 MOVE-TEST-F1-32-1.
113900     IF       MOVE5 NOT EQUAL TO 23.45
114000              MOVE MOVE5 TO COMPUTED-N
114100              MOVE 23.45 TO CORRECT-N
114200              PERFORM FAIL PERFORM MOVE-WRITE-F1-32
114300              MOVE 1 TO TA--X.
114400     IF       MOVE6 NOT EQUAL TO .45
114500              MOVE MOVE6 TO COMPUTED-N
114600              MOVE .45 TO CORRECT-N
114700              PERFORM FAIL PERFORM MOVE-WRITE-F1-32
114800              MOVE 1 TO TA--X.
114900     IF       MOVE7 NOT EQUAL TO 3.45
115000              MOVE MOVE7 TO COMPUTED-N
115100              MOVE 3.45 TO CORRECT-N
115200              GO TO MOVE-FAIL-F1-32.
115300     IF TA--X IS NOT EQUAL TO 0 GO TO MOVE-INIT-F1-33.
115400     PERFORM  PASS.
115500     GO TO    MOVE-WRITE-F1-32.
115600 MOVE-DELETE-F1-32.
115700     PERFORM  DE-LETE.
115800     GO TO    MOVE-WRITE-F1-32.
115900 MOVE-FAIL-F1-32.
116000     PERFORM  FAIL.
116100 MOVE-WRITE-F1-32.
116200     MOVE "MOVE-TEST-F1-32" TO PAR-NAME.
116300     PERFORM  PRINT-DETAIL.
116400 MOVE-INIT-F1-33.
116500     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO GRP-ALPHABETIC.
116600 MOVE-TEST-F1-33-0.
116700     MOVE GRP-GROUP-MOVE-FROM TO GRP-GROUP-MOVE-TO.
116800 MOVE-TEST-F1-33-1.
116900     IF ALPHABET-AN-00026 NOT EQUAL TO WRK-AN-00026
117000              GO TO MOVE-FAIL-F1-33.
117100     IF DIGITS-DU-10V00 NOT EQUAL TO WRK-DU-10V00
117200              GO TO MOVE-FAIL-F1-33.
117300     IF ALPHANUMERIC-XN-00049 NOT EQUAL TO WRK-XN-00049
117400              GO TO MOVE-FAIL-F1-33.
117500     IF NE-0001 NOT EQUAL TO SPACE GO TO MOVE-FAIL-F1-33.
117600     IF NE-0002 NOT EQUAL TO SPACE GO TO MOVE-FAIL-F1-33.
117700     IF AE-0001 NOT EQUAL TO SPACE GO TO MOVE-FAIL-F1-33.
117800     IF AE-0002 EQUAL TO SPACE
117900         PERFORM PASS
118000         GO TO MOVE-WRITE-F1-33.
118100     GO TO MOVE-FAIL-F1-33.
118200 MOVE-DELETE-F1-33.
118300     PERFORM DE-LETE.
118400     GO TO MOVE-WRITE-F1-33.
118500 MOVE-FAIL-F1-33.
118600     MOVE GRP-MOVE-CONSTANTS TO SEND-BREAKDOWN.
118700     MOVE GRP-MOVE-RECEIVING-FIELDS TO RECEIVE-BREAKDOWN.
118800     MOVE 119 TO LENGTH-COUNTER.
118900     PERFORM FAIL.
119000     PERFORM A20 THRU A120.
119100 MOVE-WRITE-F1-33.
119200     MOVE "MOVE ALPHA GROUP    " TO FEATURE.
119300     MOVE "MOVE-TEST-F1-33 " TO PAR-NAME.
119400     PERFORM PRINT-DETAIL.
119500 MOVE-INIT-F1-34.
119600     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO GRP-ALPHABETIC.
119700 MOVE-TEST-F1-34-0.
119800     MOVE GRP-ALPHABETIC TO WRK-AN-00026.
119900 MOVE-TEST-F1-34-1.
120000     IF GRP-ALPHABETIC EQUAL TO GRP-WRK-AN-00026
120100         PERFORM PASS
120200         GO TO MOVE-WRITE-F1-34.
120300     GO TO MOVE-FAIL-F1-34.
120400 MOVE-DELETE-F1-34.
120500     PERFORM DE-LETE.
120600     GO TO MOVE-WRITE-F1-34.
120700 MOVE-FAIL-F1-34.
120800     MOVE GRP-ALPHABETIC TO SEND-BREAKDOWN.
120900     MOVE GRP-WRK-AN-00026 TO RECEIVE-BREAKDOWN.
121000     MOVE 026 TO LENGTH-COUNTER.
121100     PERFORM FAIL.
121200     PERFORM A20 THRU A40.
121300 MOVE-WRITE-F1-34.
121400     MOVE "MOVE-TEST-F1-34 " TO PAR-NAME.
121500     PERFORM PRINT-DETAIL.
121600 MOVE-INIT-F1-35.
121700     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789"
121800           TO GRP-ALPHANUMERIC.
121900     MOVE "MOVE ALPHA-NUM GROUP" TO FEATURE.
122000 MOVE-TEST-F1-35-0.
122100     MOVE GRP-ALPHANUMERIC TO WRK-XN-00049.
122200 MOVE-TEST-F1-35-1.
122300     IF GRP-ALPHANUMERIC EQUAL TO GRP-WRK-XN-00049
122400         PERFORM PASS
122500         GO TO MOVE-WRITE-F1-35.
122600     GO TO MOVE-FAIL-F1-35.
122700 MOVE-DELETE-F1-35.
122800     PERFORM DE-LETE.
122900     GO TO MOVE-WRITE-F1-35.
123000 MOVE-FAIL-F1-35.
123100     MOVE GRP-ALPHANUMERIC TO SEND-BREAKDOWN.
123200     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
123300     MOVE 049 TO LENGTH-COUNTER.
123400     PERFORM FAIL.
123500     PERFORM A20 THRU A60.
123600 MOVE-WRITE-F1-35.
123700     MOVE "MOVE-TEST-F1-35 " TO PAR-NAME.
123800     PERFORM PRINT-DETAIL.
123900 MOVE-INIT-F1-36.
124000     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789"
124100           TO GRP-ALPHANUMERIC.
124200     MOVE "MOVE ALPHA-NUM GROUP" TO FEATURE.
124300 MOVE-TEST-F1-36-0.
124400     MOVE GRP-ALPHANUMERIC TO AE-0001.
124500 MOVE-TEST-F1-36-1.
124600     IF       GRP-ALPHANUMERIC-1002 EQUAL TO GRP-AE-0001
124700         PERFORM PASS
124800         GO TO MOVE-WRITE-F1-36.
124900     GO TO MOVE-FAIL-F1-36.
125000 MOVE-DELETE-F1-36.
125100     PERFORM DE-LETE.
125200     GO TO MOVE-WRITE-F1-36.
125300 MOVE-FAIL-F1-36.
125400     MOVE     GRP-ALPHANUMERIC-1002 TO SEND-BREAKDOWN.
125500     MOVE     GRP-AE-0001 TO RECEIVE-BREAKDOWN.
125600     MOVE 049 TO LENGTH-COUNTER.
125700     PERFORM FAIL.
125800     PERFORM A20 THRU A60.
125900 MOVE-WRITE-F1-36.
126000     MOVE "MOVE-TEST-F1-36 " TO PAR-NAME.
126100     PERFORM PRINT-DETAIL.
126200 MOVE-INIT-F1-37.
126300     MOVE "MOVE NUMERIC GROUP  " TO FEATURE.
126400     MOVE  0123456789 TO GRP-NUMERIC.
126500 MOVE-TEST-F1-37-0.
126600     MOVE GRP-NUMERIC TO WRK-DU-10V00.
126700 MOVE-TEST-F1-37-1.
126800     IF GRP-NUMERIC EQUAL TO GRP-WRK-DU-10V00
126900         PERFORM PASS
127000         GO TO MOVE-WRITE-F1-37.
127100     GO TO MOVE-FAIL-F1-37.
127200 MOVE-DELETE-F1-37.
127300     PERFORM DE-LETE.
127400     GO TO MOVE-WRITE-F1-37.
127500 MOVE-FAIL-F1-37.
127600     MOVE GRP-NUMERIC TO CORRECT-A.
127700     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
127800     PERFORM FAIL.
127900 MOVE-WRITE-F1-37.
128000     MOVE "MOVE-TEST-F1-37 " TO PAR-NAME.
128100     PERFORM PRINT-DETAIL.
128200 MOVE-INIT-F1-38.
128300     MOVE  0123456789 TO GRP-NUMERIC.
128400 MOVE-TEST-F1-38-0.
128500     MOVE GRP-NUMERIC TO NE-0001.
128600 MOVE-TEST-F1-38-1.
128700     IF "0123456789   " EQUAL TO GRP-NE-0001
128800         PERFORM PASS
128900         GO TO MOVE-WRITE-F1-38.
129000     GO TO MOVE-FAIL-F1-38.
129100 MOVE-DELETE-F1-38.
129200     PERFORM DE-LETE.
129300     GO TO MOVE-WRITE-F1-38.
129400 MOVE-FAIL-F1-38.
129500     MOVE GRP-NUMERIC TO CORRECT-A.
129600     MOVE GRP-NE-0001 TO COMPUTED-A.
129700     PERFORM FAIL.
129800 MOVE-WRITE-F1-38.
129900     MOVE "MOVE-TEST-F1-38 " TO PAR-NAME.
130000     PERFORM PRINT-DETAIL.
130100 MOVE-INIT-F1-39.
130200     MOVE "MOVE ALPHA ITEM     " TO FEATURE.
130300     MOVE "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO ALPHABET-AN-00026.
130400 MOVE-TEST-F1-39-0.
130500     MOVE ALPHABET-AN-00026 TO GRP-WRK-AN-00026.
130600 MOVE-TEST-F1-39-1.
130700     IF ALPHABET-AN-00026 EQUAL TO WRK-AN-00026
130800         PERFORM PASS
130900         GO TO MOVE-WRITE-F1-39.
131000     GO TO MOVE-FAIL-F1-39.
131100 MOVE-DELETE-F1-39.
131200     PERFORM DE-LETE.
131300     GO TO MOVE-WRITE-F1-39.
131400 MOVE-FAIL-F1-39.
131500     MOVE ALPHABET-AN-00026 TO SEND-BREAKDOWN.
131600     MOVE GRP-WRK-AN-00026 TO RECEIVE-BREAKDOWN.
131700     MOVE 026 TO LENGTH-COUNTER.
131800     PERFORM FAIL.
131900     PERFORM A20 THRU A40.
132000 MOVE-WRITE-F1-39.
132100     MOVE "MOVE-TEST-F1-39 " TO PAR-NAME.
132200     PERFORM PRINT-DETAIL.
132300 MOVE-INIT-F1-40.
132400     MOVE "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO ALPHABET-AN-00026.
132500 MOVE-TEST-F1-40-0.
132600     MOVE ALPHABET-AN-00026 TO WRK-AN-00026.
132700 MOVE-TEST-F1-40-1.
132800     IF ALPHABET-AN-00026 EQUAL TO GRP-WRK-AN-00026
132900         PERFORM PASS
133000         GO TO MOVE-WRITE-F1-40.
133100     GO TO MOVE-FAIL-F1-40.
133200 MOVE-DELETE-F1-40.
133300     PERFORM DE-LETE.
133400     GO TO MOVE-WRITE-F1-40.
133500 MOVE-FAIL-F1-40.
133600     MOVE ALPHABET-AN-00026 TO SEND-BREAKDOWN.
133700     MOVE WRK-AN-00026 TO RECEIVE-BREAKDOWN.
133800     MOVE 026 TO LENGTH-COUNTER.
133900     PERFORM FAIL.
134000     PERFORM A20 THRU A40.
134100 MOVE-WRITE-F1-40.
134200     MOVE "MOVE-TEST-F1-40 " TO PAR-NAME.
134300     PERFORM PRINT-DETAIL.
134400 MOVE-INIT-F1-41.
134500     MOVE "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO ALPHABET-AN-00026.
134600 MOVE-TEST-F1-41-0.
134700     MOVE ALPHABET-AN-00026 TO WRK-XN-00049  FIRST-26.
134800 MOVE-TEST-F1-41-1.
134900     MOVE SPACE TO PADD-REST.
135000     IF FORTY-NINE-COMPARE EQUAL TO GRP-WRK-XN-00049
135100         PERFORM PASS
135200         GO TO MOVE-WRITE-F1-41.
135300     GO TO MOVE-FAIL-F1-41.
135400 MOVE-DELETE-F1-41.
135500     PERFORM DE-LETE.
135600     GO TO MOVE-WRITE-F1-41.
135700 MOVE-FAIL-F1-41.
135800     MOVE FORTY-NINE-COMPARE TO SEND-BREAKDOWN.
135900     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
136000     MOVE 049 TO LENGTH-COUNTER.
136100     PERFORM FAIL.
136200     PERFORM A20 THRU A60.
136300 MOVE-WRITE-F1-41.
136400     MOVE "MOVE-TEST-F1-41 " TO PAR-NAME.
136500     PERFORM PRINT-DETAIL.
136600 MOVE-INIT-F1-42.
136700     MOVE "MOVE ALPHA-NUM ITEM " TO FEATURE.
136800     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789"
136900           TO ALPHANUMERIC-XN-00049.
137000 MOVE-TEST-F1-42-0.
137100     MOVE ALPHANUMERIC-XN-00049 TO GRP-WRK-XN-00049.
137200 MOVE-TEST-F1-42-1.
137300     IF ALPHANUMERIC-XN-00049 EQUAL TO WRK-XN-00049
137400         PERFORM PASS
137500         GO TO MOVE-WRITE-F1-42.
137600     GO TO MOVE-FAIL-F1-42.
137700 MOVE-DELETE-F1-42.
137800     PERFORM DE-LETE.
137900     GO TO MOVE-WRITE-F1-42.
138000 MOVE-FAIL-F1-42.
138100     MOVE ALPHANUMERIC-XN-00049 TO SEND-BREAKDOWN.
138200     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
138300     MOVE 049 TO LENGTH-COUNTER.
138400     PERFORM FAIL.
138500     PERFORM A20 THRU A60.
138600 MOVE-WRITE-F1-42.
138700     MOVE "MOVE-TEST-F1-42 " TO PAR-NAME.
138800     PERFORM PRINT-DETAIL.
138900 MOVE-INIT-F1-43.
139000     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789"
139100           TO ALPHANUMERIC-XN-00049.
139200 MOVE-TEST-F1-43-0.
139300     MOVE ALPHANUMERIC-XN-00049 TO WRK-AN-00026
139400                                   FORTY-NINE-COMPARE.
139500     MOVE SPACE TO PADD-REST.
139600 MOVE-TEST-F1-43-1.
139700     IF FIRST-26 EQUAL TO GRP-WRK-AN-00026
139800         PERFORM PASS
139900         GO TO MOVE-WRITE-F1-43.
140000     GO TO MOVE-FAIL-F1-43.
140100 MOVE-DELETE-F1-43.
140200     PERFORM DE-LETE.
140300     GO TO MOVE-WRITE-F1-43.
140400 MOVE-FAIL-F1-43.
140500     MOVE GRP-WRK-AN-00026 TO RECEIVE-BREAKDOWN.
140600     MOVE FIRST-26 TO SEND-BREAKDOWN.
140700     MOVE 026 TO LENGTH-COUNTER.
140800     PERFORM FAIL.
140900     PERFORM A20 THRU A40.
141000 MOVE-WRITE-F1-43.
141100     MOVE "MOVE-TEST-F1-43 " TO PAR-NAME.
141200     PERFORM PRINT-DETAIL.
141300 MOVE-INIT-F1-44.
141400     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789"
141500           TO ALPHANUMERIC-XN-00049.
141600 MOVE-TEST-F1-44-0.
141700     MOVE ALPHANUMERIC-XN-00049 TO WRK-XN-00049.
141800 MOVE-TEST-F1-44-1.
141900     IF ALPHANUMERIC-XN-00049 EQUAL TO GRP-WRK-XN-00049
142000         PERFORM PASS
142100         GO TO MOVE-WRITE-F1-44.
142200     GO TO MOVE-FAIL-F1-44.
142300 MOVE-DELETE-F1-44.
142400     PERFORM DE-LETE.
142500     GO TO MOVE-WRITE-F1-44.
142600 MOVE-FAIL-F1-44.
142700     MOVE ALPHANUMERIC-XN-00049 TO SEND-BREAKDOWN.
142800     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
142900     MOVE 049 TO LENGTH-COUNTER.
143000     PERFORM FAIL.
143100     PERFORM A20 THRU A60.
143200 MOVE-WRITE-F1-44.
143300     MOVE "MOVE-TEST-F1-44" TO PAR-NAME.
143400     PERFORM PRINT-DETAIL.
143500 MOVE-INIT-F1-45.
143600     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789"
143700           TO ALPHANUMERIC-XN-00049.
143800 MOVE-TEST-F1-45-0.
143900     MOVE ALPHANUMERIC-XN-00049 TO AE-0001.
144000 MOVE-TEST-F1-45-1.
144100     IF GRP-AE-0001 EQUAL TO "ABCDEFGHIJKLMNOPQRSTUVWXYZ +-  =$, .
144200-    "()/0 012345678"
144300         PERFORM PASS
144400         GO TO MOVE-WRITE-F1-45.
144500     GO TO MOVE-FAIL-F1-45.
144600 MOVE-DELETE-F1-45.
144700     PERFORM DE-LETE.
144800     GO TO MOVE-WRITE-F1-45.
144900 MOVE-FAIL-F1-45.
145000     MOVE "ABCDEFGHIJKLMNOPQRSTUVWXYZ +-  =$, .()/0 012345678"
145100         TO SEND-BREAKDOWN.
145200     MOVE AE-0001 TO RECEIVE-BREAKDOWN.
145300     MOVE 049 TO LENGTH-COUNTER.
145400     PERFORM FAIL.
145500     PERFORM A20 THRU A60.
145600 MOVE-WRITE-F1-45.
145700     MOVE "MOVE-TEST-F1-45" TO PAR-NAME.
145800     PERFORM PRINT-DETAIL.
145900 MOVE-INIT-F1-46.
146000
146100 MOVE-TEST-F1-46-0.
146200     MOVE     "4444444444444444440123456789" TO WRK-DU-10V00.
146300 MOVE-TEST-F1-46-1.
146400     IF GRP-WRK-DU-10V00 EQUAL TO "0123456789"
146500         PERFORM PASS
146600         GO TO MOVE-WRITE-F1-46.
146700     GO TO MOVE-FAIL-F1-46.
146800 MOVE-DELETE-F1-46.
146900     PERFORM DE-LETE.
147000     GO TO MOVE-WRITE-F1-46.
147100 MOVE-FAIL-F1-46.
147200     MOVE "0123456789" TO CORRECT-A.
147300     MOVE WRK-DU-10V00 TO COMPUTED-A.
147400     PERFORM FAIL.
147500 MOVE-WRITE-F1-46.
147600     MOVE "MOVE-TEST-F1-46" TO PAR-NAME.
147700     PERFORM PRINT-DETAIL.
147800 MOVE-INIT-F1-47.
147900     MOVE    3344556677 TO MOVE72.
148000 MOVE-TEST-F1-47-0.
148100     MOVE    MOVE72 TO MOVE73.
148200 MOVE-TEST-F1-47-1.
148300     IF      MOVE73 EQUAL TO "33445 56677     0 "
148400             PERFORM PASS
148500             GO TO MOVE-WRITE-F1-47.
148600     GO TO   MOVE-FAIL-F1-47.
148700 MOVE-DELETE-F1-47.
148800     PERFORM DE-LETE.
148900     GO TO   MOVE-WRITE-F1-47.
149000 MOVE-FAIL-F1-47.
149100     MOVE     MOVE73 TO COMPUTED-A.
149200     MOVE     "33445 56677     0 " TO CORRECT-A.
149300     PERFORM FAIL.
149400 MOVE-WRITE-F1-47.
149500     MOVE "MOVE-TEST-F1-47" TO PAR-NAME.
149600     PERFORM PRINT-DETAIL.
149700 MOVE-INIT-F1-48.
149800
149900 MOVE-TEST-F1-48-0.
150000     MOVE "*" TO AE-0002.
150100 MOVE-TEST-F1-48-1.
150200     IF GRP-AE-0002 EQUAL TO "* 0      "
150300         PERFORM PASS
150400         GO TO MOVE-WRITE-F1-48.
150500     GO TO MOVE-FAIL-F1-48.
150600 MOVE-DELETE-F1-48.
150700     PERFORM DE-LETE.
150800     GO TO MOVE-WRITE-F1-48.
150900 MOVE-FAIL-F1-48.
151000     MOVE AE-0002 TO COMPUTED-A.
151100     MOVE "* 0      " TO CORRECT-A.
151200     PERFORM FAIL.
151300     PERFORM A20 THRU A60.
151400 MOVE-WRITE-F1-48.
151500     MOVE "MOVE-TEST-F1-48" TO PAR-NAME.
151600     PERFORM PRINT-DETAIL.
151700 MOVE-INIT-F1-49.
151800     MOVE    "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-  =$, .()/ 0123456789"
151900           TO ALPHANUMERIC-XN-00049.
152000 MOVE-TEST-F1-49-0.
152100     MOVE ALPHANUMERIC-XN-00049 TO AE-0001.
152200 MOVE-TEST-F1-49-1.
152300     MOVE AE-0001 TO AE-0002.
152400     IF AE-0002 EQUAL TO "AB0CD EFG"
152500         PERFORM PASS
152600         GO TO MOVE-WRITE-F1-49.
152700     GO TO MOVE-FAIL-F1-49.
152800 MOVE-DELETE-F1-49.
152900     PERFORM DE-LETE.
153000     GO TO MOVE-WRITE-F1-49.
153100 MOVE-FAIL-F1-49.
153200     MOVE AE-0002 TO COMPUTED-A.
153300     MOVE "AB0CD EFG" TO CORRECT-A.
153400     PERFORM FAIL.
153500 MOVE-WRITE-F1-49.
153600     MOVE "MOVE-TEST-F1-49" TO PAR-NAME.
153700     PERFORM PRINT-DETAIL.
153800 MOVE-INIT-F1-50.
153900     MOVE "MOVE NUMERIC ITEM   " TO FEATURE.
154000     MOVE  0123456789 TO DIGITS-DU-10V00.
154100 MOVE-TEST-F1-50-0.
154200     MOVE DIGITS-DU-10V00 TO GRP-WRK-DU-10V00.
154300 MOVE-TEST-F1-50-1.
154400     IF WRK-DU-10V00 EQUAL TO DIGITS-DU-10V00
154500         PERFORM PASS
154600         GO TO MOVE-WRITE-F1-50.
154700     GO TO MOVE-FAIL-F1-50.
154800 MOVE-DELETE-F1-50.
154900     PERFORM DE-LETE.
155000     GO TO MOVE-WRITE-F1-50.
155100 MOVE-FAIL-F1-50.
155200     MOVE DIGITS-DU-10V00 TO CORRECT-A.
155300     MOVE WRK-DU-10V00 TO COMPUTED-A.
155400     PERFORM FAIL.
155500 MOVE-WRITE-F1-50.
155600     MOVE "MOVE-TEST-F1-50" TO PAR-NAME.
155700     PERFORM PRINT-DETAIL.
155800 MOVE-INIT-F1-51.
155900     MOVE  0123456789 TO DIGITS-DU-10V00.
156000 MOVE-TEST-F1-51-0.
156100     MOVE DIGITS-DU-10V00 TO WRK-XN-00049.
156200 MOVE-TEST-F1-51-1.
156300     IF GRP-WRK-XN-00049 EQUAL TO "0123456789
156400-    "                  "
156500         PERFORM PASS
156600         GO TO MOVE-WRITE-F1-51.
156700     GO TO MOVE-FAIL-F1-51.
156800 MOVE-DELETE-F1-51.
156900     PERFORM DE-LETE.
157000     GO TO MOVE-WRITE-F1-51.
157100 MOVE-FAIL-F1-51.
157200     MOVE "0123456789                                       "
157300          TO SEND-BREAKDOWN
157400     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
157500     MOVE 049 TO LENGTH-COUNTER.
157600     PERFORM FAIL.
157700     PERFORM A20 THRU A60.
157800 MOVE-WRITE-F1-51.
157900     MOVE "MOVE-TEST-F1-51" TO PAR-NAME.
158000     PERFORM PRINT-DETAIL.
158100 MOVE-INIT-F1-52.
158200     MOVE  0123456789 TO DIGITS-DU-10V00.
158300 MOVE-TEST-F1-52-0.
158400     MOVE DIGITS-DU-10V00 TO AE-0002.
158500 MOVE-TEST-F1-52-1.
158600     IF GRP-AE-0002 EQUAL TO "01023 456"
158700         PERFORM PASS
158800         GO TO MOVE-WRITE-F1-52.
158900     GO TO MOVE-FAIL-F1-52.
159000 MOVE-DELETE-F1-52.
159100     PERFORM DE-LETE.
159200     GO TO MOVE-WRITE-F1-52.
159300 MOVE-FAIL-F1-52.
159400     MOVE "01023 456" TO CORRECT-A.
159500     MOVE GRP-AE-0002 TO COMPUTED-A.
159600     PERFORM FAIL.
159700 MOVE-WRITE-F1-52.
159800     MOVE "MOVE-TEST-F1-52" TO PAR-NAME.
159900     PERFORM PRINT-DETAIL.
160000 MOVE-INIT-F1-53.
160100     MOVE  0123456789 TO DIGITS-DU-10V00.
160200 MOVE-TEST-F1-53-0.
160300     MOVE DIGITS-DU-10V00 TO WRK-DU-10V00.
160400 MOVE-TEST-F1-53-1.
160500     IF GRP-WRK-DU-10V00 EQUAL TO DIGITS-DU-10V00
160600         PERFORM PASS
160700         GO TO MOVE-WRITE-F1-53.
160800     GO TO MOVE-FAIL-F1-53.
160900 MOVE-DELETE-F1-53.
161000     PERFORM DE-LETE.
161100     GO TO MOVE-WRITE-F1-53.
161200 MOVE-FAIL-F1-53.
161300     MOVE DIGITS-DU-10V00 TO CORRECT-A.
161400     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
161500     PERFORM FAIL.
161600 MOVE-WRITE-F1-53.
161700     MOVE "MOVE-TEST-F1-53" TO PAR-NAME.
161800     PERFORM PRINT-DETAIL.
161900 MOVE-INIT-F1-54.
162000     MOVE  0123456789 TO DIGITS-DU-10V00.
162100 MOVE-TEST-F1-54-0.
162200     MOVE DIGITS-DU-06V04-S TO NE-0001.
162300 MOVE-TEST-F1-54-1.
162400     IF GRP-NE-0001 EQUAL TO " 12,345.678,9"
162500         PERFORM PASS
162600         GO TO MOVE-WRITE-F1-54.
162700     GO TO MOVE-FAIL-F1-54.
162800 MOVE-DELETE-F1-54.
162900     PERFORM DE-LETE.
163000     GO TO MOVE-WRITE-F1-54.
163100 MOVE-FAIL-F1-54.
163200     MOVE " 12,345.678,9" TO CORRECT-A.
163300     MOVE GRP-NE-0001 TO COMPUTED-A.
163400     PERFORM FAIL.
163500 MOVE-WRITE-F1-54.
163600     MOVE "MOVE-TEST-F1-54" TO PAR-NAME.
163700     PERFORM PRINT-DETAIL.
163800 MOVE-INIT-F1-55.
163900     MOVE "MOVE NUMERIC EDITED" TO FEATURE.
164000 MOVE-TEST-F1-55-0.
164100     MOVE " 12,345.678,9" TO GRP-NE-0001.
164200     MOVE NE-0001 TO GRP-WRK-XN-00049.
164300 MOVE-TEST-F1-55-1.
164400     IF GRP-WRK-XN-00049 EQUAL TO
164500        " 12,345.678,9                                    "
164600         PERFORM PASS
164700         GO TO MOVE-WRITE-F1-55.
164800     GO TO MOVE-FAIL-F1-55.
164900 MOVE-DELETE-F1-55.
165000     PERFORM DE-LETE.
165100     GO TO MOVE-WRITE-F1-55.
165200 MOVE-FAIL-F1-55.
165300     MOVE " 12,345.678,9                                    "
165400          TO SEND-BREAKDOWN.
165500     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
165600     MOVE 049 TO LENGTH-COUNTER.
165700     PERFORM FAIL.
165800     PERFORM A20 THRU A60.
165900 MOVE-WRITE-F1-55.
166000     MOVE "MOVE-TEST-F1-55" TO PAR-NAME.
166100     PERFORM PRINT-DETAIL.
166200 MOVE-INIT-F1-56.
166300
166400 MOVE-TEST-F1-56-0.
166500     MOVE " 12,345.678,9" TO GRP-NE-0001.
166600     MOVE NE-0001 TO WRK-XN-00049.
166700 MOVE-TEST-F1-56-1.
166800     IF GRP-WRK-XN-00049 EQUAL TO
166900        " 12,345.678,9                                    "
167000         PERFORM PASS
167100         GO TO MOVE-WRITE-F1-56.
167200     GO TO MOVE-FAIL-F1-56.
167300 MOVE-DELETE-F1-56.
167400     PERFORM DE-LETE.
167500     GO TO MOVE-WRITE-F1-56.
167600 MOVE-FAIL-F1-56.
167700     MOVE " 12,345.678,9                                    "
167800          TO SEND-BREAKDOWN.
167900     MOVE WRK-XN-00049 TO RECEIVE-BREAKDOWN.
168000     MOVE 049 TO LENGTH-COUNTER.
168100     PERFORM FAIL.
168200     PERFORM A20 THRU A60.
168300 MOVE-WRITE-F1-56.
168400     MOVE "MOVE-TEST-F1-56" TO PAR-NAME.
168500     PERFORM PRINT-DETAIL.
168600 MOVE-INIT-F1-57.
168700
168800 MOVE-TEST-F1-57-0.
168900     MOVE " 12,345.678,9" TO GRP-NE-0001.
169000     MOVE NE-0001 TO AE-0002.
169100 MOVE-TEST-F1-57-1.
169200     IF GRP-AE-0002 EQUAL TO " 102, 345"
169300         PERFORM PASS
169400         GO TO MOVE-WRITE-F1-57.
169500     GO TO MOVE-FAIL-F1-57.
169600 MOVE-DELETE-F1-57.
169700     PERFORM DE-LETE.
169800     GO TO MOVE-WRITE-F1-57.
169900 MOVE-FAIL-F1-57.
170000     MOVE " 102, 345" TO CORRECT-A.
170100     MOVE GRP-AE-0002 TO COMPUTED-A.
170200     PERFORM FAIL.
170300 MOVE-WRITE-F1-57.
170400     MOVE "MOVE-TEST-F1-57" TO PAR-NAME.
170500     PERFORM PRINT-DETAIL.
170600 MOVE-INIT-F1-58.
170700     MOVE "MOVE ZERO LITERAL   " TO FEATURE.
170800 MOVE-TEST-F1-58-0.
170900     MOVE ZERO TO GRP-WRK-DU-10V00.
171000 MOVE-TEST-F1-58-1.
171100     IF WRK-DU-10V00 EQUAL TO "0000000000"
171200         PERFORM PASS
171300         GO TO MOVE-WRITE-F1-58.
171400     GO TO MOVE-FAIL-F1-58.
171500 MOVE-DELETE-F1-58.
171600     PERFORM DE-LETE.
171700     GO TO MOVE-WRITE-F1-58.
171800 MOVE-FAIL-F1-58.
171900     MOVE "0000000000" TO CORRECT-A.
172000     MOVE WRK-DU-10V00 TO COMPUTED-A.
172100     PERFORM FAIL.
172200 MOVE-WRITE-F1-58.
172300     MOVE "MOVE-TEST-F1-58" TO PAR-NAME.
172400     PERFORM PRINT-DETAIL.
172500 MOVE-INIT-F1-59.
172600
172700 MOVE-TEST-F1-59-0.
172800     MOVE "0000000000000000000000000000000000000000000000000"
172900          TO WRK-XN-00049.
173000 MOVE-TEST-F1-59-1.
173100     IF GRP-WRK-XN-00049 EQUAL TO ZERO
173200         PERFORM PASS
173300         GO TO MOVE-WRITE-F1-59.
173400     GO TO MOVE-FAIL-F1-59.
173500 MOVE-DELETE-F1-59.
173600     PERFORM DE-LETE.
173700     GO TO MOVE-WRITE-F1-59.
173800 MOVE-FAIL-F1-59.
173900     MOVE "0000000000000000000000000000000000000000000000000"
174000         TO SEND-BREAKDOWN.
174100     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
174200     MOVE 049 TO LENGTH-COUNTER.
174300     PERFORM FAIL.
174400     PERFORM A20 THRU A60.
174500 MOVE-WRITE-F1-59.
174600     MOVE "MOVE-TEST-F1-59" TO PAR-NAME.
174700     PERFORM PRINT-DETAIL.
174800 MOVE-INIT-F1-60.
174900
175000 MOVE-TEST-F1-60-0.
175100     MOVE ZERO TO AE-0002.
175200 MOVE-TEST-F1-60-1.
175300     IF GRP-AE-0002 EQUAL TO "00000 000"
175400         PERFORM PASS
175500         GO TO MOVE-WRITE-F1-60.
175600     GO TO MOVE-FAIL-F1-60.
175700 MOVE-DELETE-F1-60.
175800     PERFORM DE-LETE.
175900     GO TO MOVE-WRITE-F1-60.
176000 MOVE-FAIL-F1-60.
176100     MOVE "00000 000" TO CORRECT-A.
176200     MOVE GRP-AE-0002 TO COMPUTED-A.
176300     PERFORM FAIL.
176400 MOVE-WRITE-F1-60.
176500     MOVE "MOVE-TEST-F1-60" TO PAR-NAME.
176600     PERFORM PRINT-DETAIL.
176700 MOVE-INIT-F1-61.
176800 MOVE-TEST-F1-61-0.
176900     MOVE ZERO TO WRK-DU-10V00.
177000 MOVE-TEST-F1-61-1.
177100     IF GRP-WRK-DU-10V00 EQUAL TO "0000000000"
177200         PERFORM PASS
177300         GO TO MOVE-WRITE-F1-61.
177400     GO TO MOVE-FAIL-F1-61.
177500 MOVE-DELETE-117.
177600     PERFORM DE-LETE.
177700     GO TO MOVE-WRITE-F1-61.
177800 MOVE-FAIL-F1-61.
177900     MOVE "0000000000" TO CORRECT-A.
178000     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
178100     PERFORM FAIL.
178200 MOVE-WRITE-F1-61.
178300     MOVE "MOVE-TEST-F1-61" TO PAR-NAME.
178400     PERFORM PRINT-DETAIL.
178500 MOVE-INIT-F1-62.
178600 MOVE-TEST-F1-62-0.
178700     MOVE ZERO TO NE-0001.
178800 MOVE-TEST-F1-62-1.
178900     IF GRP-NE-0001 EQUAL TO "    000.000,0"
179000         PERFORM PASS
179100         GO TO MOVE-WRITE-F1-62.
179200     GO TO MOVE-FAIL-F1-62.
179300 MOVE-DELETE-F1-62.
179400     PERFORM DE-LETE.
179500     GO TO MOVE-WRITE-F1-62.
179600 MOVE-FAIL-F1-62.
179700     MOVE "    000.000,0" TO CORRECT-A.
179800     MOVE GRP-NE-0001 TO COMPUTED-A.
179900     PERFORM FAIL.
180000 MOVE-WRITE-F1-62.
180100     MOVE "MOVE-TEST-F1-62" TO PAR-NAME.
180200     PERFORM PRINT-DETAIL.
180300 MOVE-INIT-F1-63.
180400     MOVE "MOVE SPACE LITERAL  " TO FEATURE.
180500 MOVE-TEST-F1-63-0.
180600     MOVE SPACE TO GRP-WRK-DU-10V00.
180700 MOVE-TEST-F1-63-1.
180800     IF GRP-WRK-DU-10V00 EQUAL TO SPACE
180900         PERFORM PASS
181000         GO TO MOVE-WRITE-F1-63.
181100     GO TO MOVE-FAIL-F1-63.
181200 MOVE-DELETE-F1-63.
181300     PERFORM DE-LETE.
181400     GO TO MOVE-WRITE-F1-63.
181500 MOVE-FAIL-F1-63.
181600     MOVE SPACE TO CORRECT-A.
181700     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
181800     PERFORM FAIL.
181900 MOVE-WRITE-F1-63.
182000     MOVE "MOVE-TEST-F1-63" TO PAR-NAME.
182100     PERFORM PRINT-DETAIL.
182200 MOVE-INIT-F1-64.
182300 MOVE-TEST-F1-64-0.
182400     MOVE SPACE TO WRK-AN-00026.
182500 MOVE-TEST-F1-64-1.
182600     IF GRP-WRK-AN-00026 EQUAL TO "                          "
182700         PERFORM PASS
182800         GO TO MOVE-WRITE-F1-64.
182900     GO TO MOVE-FAIL-F1-64.
183000 MOVE-DELETE-F1-64.
183100     PERFORM DE-LETE.
183200     GO TO MOVE-WRITE-F1-64.
183300 MOVE-FAIL-F1-64.
183400     MOVE SPACE TO SEND-BREAKDOWN.
183500     MOVE GRP-WRK-AN-00026 TO RECEIVE-BREAKDOWN.
183600     MOVE 026 TO LENGTH-COUNTER.
183700     PERFORM FAIL.
183800     PERFORM A20 THRU A40.
183900 MOVE-WRITE-F1-64.
184000     MOVE "MOVE-TEST-F1-64" TO PAR-NAME.
184100     PERFORM PRINT-DETAIL.
184200 MOVE-INIT-F1-65.
184300 MOVE-TEST-F1-65-0.
184400     MOVE SPACE TO WRK-XN-00049.
184500 MOVE-TEST-F1-65-1.
184600     IF GRP-WRK-XN-00049 EQUAL TO SPACE
184700         PERFORM PASS
184800         GO TO MOVE-WRITE-F1-65.
184900     GO TO MOVE-FAIL-F1-65.
185000 MOVE-DELETE-F1-65.
185100     PERFORM DE-LETE.
185200     GO TO MOVE-WRITE-F1-65.
185300 MOVE-FAIL-F1-65.
185400     MOVE SPACE TO SEND-BREAKDOWN.
185500     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
185600     MOVE 049 TO LENGTH-COUNTER.
185700     PERFORM FAIL.
185800     PERFORM A20 THRU A60.
185900 MOVE-WRITE-F1-65.
186000     MOVE "MOVE-TEST-F1-65" TO PAR-NAME.
186100     PERFORM PRINT-DETAIL.
186200 MOVE-INIT-F1-66.
186300 MOVE-TEST-F1-66-0.
186400     MOVE SPACE TO AE-0002.
186500 MOVE-TEST-F1-66-1.
186600     IF GRP-AE-0002 EQUAL TO "  0      "
186700         PERFORM PASS
186800         GO TO MOVE-WRITE-F1-66.
186900     GO TO MOVE-FAIL-F1-66.
187000 MOVE-DELETE-F1-66.
187100     PERFORM DE-LETE.
187200     GO TO MOVE-WRITE-F1-66.
187300 MOVE-FAIL-F1-66.
187400     MOVE GRP-AE-0002 TO COMPUTED-A.
187500     MOVE "  0      " TO CORRECT-A.
187600     PERFORM FAIL.
187700 MOVE-WRITE-F1-66.
187800     MOVE "MOVE-TEST-F1-66" TO PAR-NAME.
187900     PERFORM PRINT-DETAIL.
188000 MOVE-INIT-F1-67.
188100     MOVE "MOVE HIGH-VALUE     " TO FEATURE.
188200 MOVE-TEST-F1-67-0.
188300     MOVE HIGH-VALUE TO GRP-WRK-DU-10V00.
188400 MOVE-TEST-F1-67-1.
188500     IF GRP-WRK-DU-10V00 EQUAL TO HIGH-VALUE
188600         PERFORM PASS
188700         GO TO MOVE-WRITE-F1-67.
188800     GO TO MOVE-FAIL-F1-67.
188900 MOVE-DELETE-F1-67.
189000     PERFORM DE-LETE.
189100     GO TO MOVE-WRITE-F1-67.
189200 MOVE-FAIL-F1-67.
189300     MOVE HIGH-VALU-10LONG TO CORRECT-A.
189400     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
189500     PERFORM FAIL.
189600 MOVE-WRITE-F1-67.
189700     MOVE "MOVE-TEST-F1-67" TO PAR-NAME.
189800     PERFORM PRINT-DETAIL.
189900 MOVE-INIT-F1-68.
190000 MOVE-TEST-F1-68-0.
190100     MOVE HIGH-VALUE TO WRK-XN-00049.
190200 MOVE-TEST-F1-68-1.
190300     IF GRP-WRK-XN-00049 EQUAL TO HIGH-VALUE
190400         PERFORM PASS
190500         GO TO MOVE-WRITE-F1-68.
190600 MOVE-DELETE-F1-68.
190700     PERFORM DE-LETE.
190800     GO TO MOVE-WRITE-F1-68.
190900 MOVE-FAIL-F1-68.
191000     MOVE HIGH-VALU-49LONG TO SEND-BREAKDOWN.
191100     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
191200     MOVE 049 TO LENGTH-COUNTER.
191300     PERFORM FAIL.
191400     PERFORM A20 THRU A60.
191500 MOVE-WRITE-F1-68.
191600     MOVE "MOVE-TEST-F1-68" TO PAR-NAME.
191700     PERFORM PRINT-DETAIL.
191800 MOVE-INIT-F1-69.
191900 MOVE-TEST-F1-69-0.
192000     MOVE HIGH-VALUE TO AE-0002.
192100 MOVE-TEST-F1-69-1.
192200     IF GRP-AE-0002 EQUAL TO HIGH-VALUE-EDIT
192300         PERFORM PASS
192400         GO TO MOVE-WRITE-F1-69.
192500     GO TO MOVE-FAIL-F1-69.
192600 MOVE-DELETE-F1-69.
192700     PERFORM DE-LETE.
192800     GO TO MOVE-WRITE-F1-69.
192900 MOVE-FAIL-F1-69.
193000     MOVE GRP-AE-0002 TO COMPUTED-A.
193100     MOVE HIGH-VALUE-EDIT TO CORRECT-A.
193200     PERFORM FAIL.
193300 MOVE-WRITE-F1-69.
193400     MOVE "MOVE-TEST-F1-69" TO PAR-NAME.
193500     PERFORM PRINT-DETAIL.
193600 MOVE-INIT-F1-70.
193700     MOVE "MOVE LOW-VALUE      " TO FEATURE.
193800 MOVE-TEST-F1-70-0.
193900     MOVE LOW-VALUE TO GRP-WRK-DU-10V00.
194000 MOVE-TEST-F1-70-1.
194100     IF GRP-WRK-DU-10V00 EQUAL TO LOW-VALUE
194200         PERFORM PASS
194300         GO TO MOVE-WRITE-F1-70.
194400     GO TO MOVE-FAIL-F1-70.
194500 MOVE-DELETE-F1-70.
194600     PERFORM DE-LETE.
194700     GO TO MOVE-WRITE-F1-70.
194800 MOVE-FAIL-F1-70.
194900     MOVE LOW-VALU-10LONG TO CORRECT-A.
195000     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
195100     PERFORM FAIL.
195200 MOVE-WRITE-F1-70.
195300     MOVE "MOVE-TEST-F1-70" TO PAR-NAME.
195400     PERFORM PRINT-DETAIL.
195500 MOVE-INIT-F1-71.
195600 MOVE-TEST-F1-71-0.
195700     MOVE LOW-VALUE TO WRK-XN-00049.
195800 MOVE-TEST-F1-71-1.
195900     IF GRP-WRK-XN-00049 EQUAL TO LOW-VALUE
196000         PERFORM PASS
196100         GO TO MOVE-WRITE-F1-71.
196200     GO TO MOVE-FAIL-F1-71.
196300 MOVE-DELETE-F1-71.
196400     PERFORM DE-LETE.
196500     GO TO MOVE-WRITE-F1-71.
196600 MOVE-FAIL-F1-71.
196700     MOVE LOW-VALU-49LONG TO SEND-BREAKDOWN.
196800     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
196900     MOVE 049 TO LENGTH-COUNTER.
197000     PERFORM FAIL.
197100     PERFORM A20 THRU A60.
197200 MOVE-WRITE-F1-71.
197300     MOVE "MOVE-TEST-F1-71" TO PAR-NAME.
197400     PERFORM PRINT-DETAIL.
197500 MOVE-INIT-F1-72.
197600     MOVE LOW-VALUE TO HIGH-1 HIGH-2 HIGH-3.
197700 MOVE-TEST-F1-72-0.
197800     MOVE LOW-VALUE TO AE-0002.
197900 MOVE-TEST-F1-72-1.
198000     IF GRP-AE-0002 EQUAL TO HIGH-VALUE-EDIT
198100         PERFORM PASS
198200         GO TO MOVE-WRITE-F1-72.
198300     GO TO MOVE-FAIL-F1-72.
198400 MOVE-DELETE-F1-72.
198500     PERFORM DE-LETE.
198600     GO TO MOVE-WRITE-F1-72.
198700 MOVE-FAIL-F1-72.
198800     MOVE HIGH-VALUE-EDIT TO CORRECT-A.
198900     MOVE GRP-AE-0002 TO COMPUTED-A.
199000     PERFORM FAIL.
199100 MOVE-WRITE-F1-72.
199200     MOVE "MOVE-TEST-F1-72" TO PAR-NAME.
199300     PERFORM PRINT-DETAIL.
199400 MOVE-INIT-F1-73.
199500     MOVE "MOVE QUOTE          " TO FEATURE.
199600 MOVE-TEST-F1-73-0.
199700     MOVE QUOTE TO GRP-WRK-DU-10V00.
199800 MOVE-TEST-F1-73-1.
199900     IF GRP-WRK-DU-10V00 EQUAL TO QUOTE
200000         PERFORM PASS
200100         GO TO MOVE-WRITE-F1-73.
200200     GO TO MOVE-FAIL-F1-73.
200300 MOVE-DELETE-F1-73.
200400     PERFORM DE-LETE.
200500     GO TO MOVE-WRITE-F1-73.
200600 MOVE-FAIL-F1-73.
200700     MOVE QUOTE-10LONG TO CORRECT-A.
200800     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
200900     PERFORM FAIL.
201000 MOVE-WRITE-F1-73.
201100     MOVE "MOVE-TEST-F1-73" TO PAR-NAME.
201200     PERFORM PRINT-DETAIL.
201300 MOVE-INIT-F1-74.
201400 MOVE-TEST-F1-74-0.
201500     MOVE QUOTE TO WRK-XN-00049.
201600 MOVE-TEST-F1-74-1.
201700     IF GRP-WRK-XN-00049 EQUAL TO QUOTE
201800         PERFORM PASS
201900         GO TO MOVE-WRITE-F1-74.
202000     GO TO MOVE-FAIL-F1-74.
202100 MOVE-DELETE-F1-74.
202200     PERFORM DE-LETE.
202300     GO TO MOVE-WRITE-F1-74.
202400 MOVE-FAIL-F1-74.
202500     MOVE QUOTE-49LONG TO SEND-BREAKDOWN.
202600     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
202700     MOVE 049 TO LENGTH-COUNTER.
202800     PERFORM FAIL.
202900     PERFORM A20 THRU A60.
203000 MOVE-WRITE-F1-74.
203100     MOVE "MOVE-TEST-F1-74" TO PAR-NAME.
203200     PERFORM PRINT-DETAIL.
203300 MOVE-INIT-F1-75.
203400     MOVE QUOTE TO HIGH-1 HIGH-2 HIGH-3.
203500 MOVE-TEST-F1-75-0.
203600     MOVE QUOTE TO AE-0002.
203700 MOVE-TEST-F1-75-1.
203800     IF GRP-AE-0002 EQUAL TO HIGH-VALUE-EDIT
203900         PERFORM PASS
204000         GO TO MOVE-WRITE-F1-75.
204100     GO TO MOVE-FAIL-F1-75.
204200 MOVE-DELETE-F1-75.
204300     PERFORM DE-LETE.
204400     GO TO MOVE-WRITE-F1-75.
204500 MOVE-FAIL-F1-75.
204600     MOVE HIGH-VALUE-EDIT TO CORRECT-A.
204700     MOVE GRP-AE-0002 TO COMPUTED-A.
204800     PERFORM FAIL.
204900 MOVE-WRITE-F1-75.
205000     MOVE "MOVE-TEST-F1-75" TO PAR-NAME.
205100     PERFORM PRINT-DETAIL.
205200 MOVE-INIT-F1-76.
205300 MOVE-TEST-F1-76-0.
205400     MOVE "A1B2C3D4E5" TO GRP-WRK-DU-10V00.
205500 MOVE-TEST-F1-76-1.
205600     IF GRP-WRK-DU-10V00 EQUAL TO "A1B2C3D4E5"
205700         PERFORM PASS
205800         GO TO MOVE-WRITE-F1-76.
205900     GO TO MOVE-FAIL-F1-76.
206000 MOVE-DELETE-F1-76.
206100     PERFORM DE-LETE.
206200     GO TO MOVE-WRITE-F1-76.
206300 MOVE-FAIL-F1-76.
206400     MOVE "A1B2C3D4E5" TO CORRECT-A.
206500     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
206600     PERFORM FAIL.
206700 MOVE-WRITE-F1-76.
206800     MOVE "MOVE ALPHNUM LITERAL" TO FEATURE.
206900     MOVE "MOVE-TEST-F1-76" TO PAR-NAME.
207000     PERFORM PRINT-DETAIL.
207100 MOVE-INIT-F1-77.
207200 MOVE-TEST-F1-77-0.
207300     MOVE "ABCDEFGHIJK" TO WRK-AN-00026.
207400 MOVE-TEST-F1-77-1.
207500     IF     GRP-WRK-AN-00026 EQUAL TO "ABCDEFGHIJK               "
207600         PERFORM PASS
207700         GO TO MOVE-WRITE-F1-77.
207800     GO TO MOVE-FAIL-F1-77.
207900 MOVE-DELETE-F1-77.
208000     PERFORM DE-LETE.
208100     GO TO MOVE-WRITE-F1-77.
208200 MOVE-FAIL-F1-77.
208300     MOVE "ABCDEFGHIJK               " TO SEND-BREAKDOWN.
208400     MOVE GRP-WRK-AN-00026 TO RECEIVE-BREAKDOWN.
208500     MOVE 026 TO LENGTH-COUNTER.
208600     PERFORM FAIL.
208700     PERFORM A20 THRU A40.
208800 MOVE-WRITE-F1-77.
208900     MOVE "MOVE ALPHA LITERAL  " TO FEATURE.
209000     MOVE "MOVE-TEST-F1-77" TO PAR-NAME.
209100     PERFORM PRINT-DETAIL.
209200 MOVE-INIT-F1-78.
209300     MOVE "MOVE ALPHNUM LITERAL" TO FEATURE.
209400 MOVE-TEST-F1-78-0.
209500     MOVE "1A2B3C4D5E6F" TO WRK-XN-00049.
209600 MOVE-TEST-F1-78-1.
209700     IF GRP-WRK-XN-00049 EQUAL TO
209800        "1A2B3C4D5E6F                                     "
209900         PERFORM PASS
210000         GO TO MOVE-WRITE-F1-78.
210100     GO TO MOVE-FAIL-F1-78.
210200 MOVE-DELETE-F1-78.
210300     PERFORM DE-LETE.
210400     GO TO MOVE-WRITE-F1-78.
210500 MOVE-FAIL-F1-78.
210600     MOVE "1A2B3C4D5E6F                                     "
210700          TO SEND-BREAKDOWN.
210800     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
210900     MOVE 049 TO LENGTH-COUNTER.
211000     PERFORM FAIL.
211100     PERFORM A20 THRU A60.
211200 MOVE-WRITE-F1-78.
211300     MOVE "MOVE-TEST-F1-78" TO PAR-NAME.
211400     PERFORM PRINT-DETAIL.
211500 MOVE-INIT-F1-79.
211600 MOVE-TEST-F1-79-0.
211700     MOVE "1Z2Y3X4W5V" TO AE-0002.
211800 MOVE-TEST-F1-79-1.
211900     IF GRP-AE-0002 EQUAL TO "1Z02Y 3X4"
212000         PERFORM PASS
212100         GO TO MOVE-WRITE-F1-79.
212200     GO TO MOVE-FAIL-F1-79.
212300 MOVE-DELETE-F1-79.
212400     PERFORM DE-LETE.
212500     GO TO MOVE-WRITE-F1-79.
212600 MOVE-FAIL-F1-79.
212700     MOVE "1Z02Y 3X4" TO CORRECT-A.
212800     MOVE GRP-AE-0002 TO COMPUTED-A.
212900     PERFORM FAIL.
213000 MOVE-WRITE-F1-79.
213100     MOVE "MOVE-TEST-F1-79" TO PAR-NAME.
213200     PERFORM PRINT-DETAIL.
213300 MOVE-INIT-F1-80.
213400 MOVE-TEST-F1-80-0.
213500     MOVE "9876543210" TO WRK-DU-10V00.
213600 MOVE-TEST-F1-80-1.
213700     IF GRP-WRK-DU-10V00 EQUAL TO "9876543210"
213800         PERFORM PASS
213900         GO TO MOVE-WRITE-F1-80.
214000     GO TO MOVE-FAIL-F1-80.
214100 MOVE-DELETE-F1-80.
214200     PERFORM DE-LETE.
214300     GO TO MOVE-WRITE-F1-80.
214400 MOVE-FAIL-F1-80.
214500     MOVE "9876543210" TO CORRECT-A.
214600     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
214700     PERFORM FAIL.
214800 MOVE-WRITE-F1-80.
214900     MOVE "MOVE-TEST-F1-80" TO PAR-NAME.
215000     PERFORM PRINT-DETAIL.
215100 MOVE-INIT-F1-81.
215200 MOVE-TEST-F1-81-0.
215300     MOVE "9876543210" TO NE-0002.
215400 MOVE-TEST-F1-81-1.
215500     IF GRP-NE-0002 EQUAL TO "9876543,210"
215600         PERFORM PASS
215700         GO TO MOVE-WRITE-F1-81.
215800     GO TO MOVE-FAIL-F1-81.
215900 MOVE-DELETE-F1-81.
216000     PERFORM DE-LETE.
216100     GO TO MOVE-WRITE-F1-81.
216200 MOVE-FAIL-F1-81.
216300     MOVE "9876543,210" TO CORRECT-A.
216400     MOVE GRP-NE-0002 TO COMPUTED-A.
216500     PERFORM FAIL.
216600 MOVE-WRITE-F1-81.
216700     MOVE "MOVE-TEST-F1-81" TO PAR-NAME.
216800     PERFORM PRINT-DETAIL.
216900 MOVE-INIT-F1-82.
217000     MOVE "MOVE NUMERIC LITERAL" TO FEATURE.
217100 MOVE-TEST-F1-82-0.
217200     MOVE 0123456789 TO GRP-WRK-DU-10V00.
217300 MOVE-TEST-F1-82-1.
217400     IF GRP-WRK-DU-10V00 EQUAL TO "0123456789"
217500         PERFORM PASS
217600         GO TO MOVE-WRITE-F1-82.
217700     GO TO MOVE-FAIL-F1-82.
217800 MOVE-DELETE-F1-82.
217900     PERFORM DE-LETE.
218000     GO TO MOVE-WRITE-F1-82.
218100 MOVE-FAIL-F1-82.
218200     MOVE "0123456789" TO CORRECT-A.
218300     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
218400     PERFORM FAIL.
218500 MOVE-WRITE-F1-82.
218600     MOVE "MOVE-TEST-F1-82" TO PAR-NAME.
218700     PERFORM PRINT-DETAIL.
218800 MOVE-INIT-F1-83.
218900 MOVE-TEST-F1-83-0.
219000     MOVE 0918273645 TO WRK-XN-00049.
219100 MOVE-TEST-F1-83-1.
219200     IF GRP-WRK-XN-00049 EQUAL TO
219300        "0918273645                                       "
219400         PERFORM PASS
219500         GO TO MOVE-WRITE-F1-83.
219600     GO TO MOVE-FAIL-F1-83.
219700 MOVE-DELETE-F1-83.
219800     PERFORM DE-LETE.
219900     GO TO MOVE-WRITE-F1-83.
220000 MOVE-FAIL-F1-83.
220100     MOVE "0918273645                                       "
220200          TO SEND-BREAKDOWN.
220300     MOVE GRP-WRK-XN-00049 TO RECEIVE-BREAKDOWN.
220400     MOVE 049 TO LENGTH-COUNTER.
220500     PERFORM FAIL.
220600     PERFORM A20 THRU A60.
220700 MOVE-WRITE-F1-83.
220800     MOVE "MOVE-TEST-F1-82" TO PAR-NAME.
220900     PERFORM PRINT-DETAIL.
221000 MOVE-INIT-F1-84.
221100 MOVE-TEST-F1-84-0.
221200     MOVE 019823 TO AE-0002.
221300 MOVE-TEST-F1-84-1.
221400     IF GRP-AE-0002 EQUAL TO "01098 23 "
221500         PERFORM PASS
221600         GO TO MOVE-WRITE-F1-84.
221700     GO TO MOVE-FAIL-F1-84.
221800 MOVE-DELETE-F1-84.
221900     PERFORM DE-LETE.
222000     GO TO MOVE-WRITE-F1-84.
222100 MOVE-FAIL-F1-84.
222200     MOVE "01098 23 " TO CORRECT-A.
222300     MOVE GRP-AE-0002 TO COMPUTED-A.
222400     PERFORM FAIL.
222500 MOVE-WRITE-F1-84.
222600     MOVE "MOVE-TEST-F1-84" TO PAR-NAME.
222700     PERFORM PRINT-DETAIL.
222800 MOVE-INIT-F1-85.
222900 MOVE-TEST-F1-85-0.
223000     MOVE 9876543210 TO WRK-DU-10V00.
223100 MOVE-TEST-F1-85-1.
223200     IF GRP-WRK-DU-10V00 EQUAL TO "9876543210"
223300         PERFORM PASS
223400         GO TO MOVE-WRITE-F1-85.
223500     GO TO MOVE-FAIL-F1-85.
223600 MOVE-DELETE-F1-85.
223700     PERFORM DE-LETE.
223800     GO TO MOVE-WRITE-F1-85.
223900 MOVE-FAIL-F1-85.
224000     MOVE "9876543210" TO CORRECT-A.
224100     MOVE GRP-WRK-DU-10V00 TO COMPUTED-A.
224200     PERFORM FAIL.
224300 MOVE-WRITE-F1-85.
224400     MOVE "MOVE-TEST-F1-85" TO PAR-NAME.
224500     PERFORM PRINT-DETAIL.
224600 MOVE-INIT-F1-86.
224700 MOVE-TEST-F1-86-0.
224800     MOVE 00012345 TO NE-0002.
224900 MOVE-TEST-F1-86-1.
225000     IF GRP-NE-0002 EQUAL TO "     12,345"
225100         PERFORM PASS
225200         GO TO MOVE-WRITE-F1-86.
225300     GO TO MOVE-FAIL-F1-86.
225400 MOVE-DELETE-F1-86.
225500     PERFORM DE-LETE.
225600     GO TO MOVE-WRITE-F1-86.
225700 MOVE-FAIL-F1-86.
225800     MOVE "     12,345" TO CORRECT-A.
225900     MOVE GRP-NE-0002 TO COMPUTED-A.
226000     PERFORM FAIL.
226100 MOVE-WRITE-F1-86.
226200     MOVE "MOVE-TEST-F1-86" TO PAR-NAME.
226300     PERFORM PRINT-DETAIL.
226400 MOVE-INIT-F1-87.
226500 MOVE-TEST-F1-87-0.
226600     MOVE 000011.1223 TO NE-0001.
226700 MOVE-TEST-F1-87-1.
226800     IF GRP-NE-0001 EQUAL TO "    011.122,3"
226900         PERFORM PASS
227000         GO TO MOVE-WRITE-F1-87.
227100     GO TO MOVE-FAIL-F1-87.
227200 MOVE-DELETE-F1-87.
227300     PERFORM DE-LETE.
227400     GO TO MOVE-WRITE-F1-87.
227500 MOVE-FAIL-F1-87.
227600     MOVE "    011.122,3" TO CORRECT-A.
227700     MOVE GRP-NE-0001 TO COMPUTED-A.
227800     PERFORM FAIL.
227900 MOVE-WRITE-F1-87.
228000     MOVE "MOVE-TEST-F1-87" TO PAR-NAME.
228100     PERFORM PRINT-DETAIL.
228200 MOVE-INIT-F1-88.
228300     MOVE   +60666 TO SPOS-LIT1.
228400 MOVE-TEST-F1-88-0.
228500     MOVE SPOS-LIT1 TO NUMERIC-LIT.
228600 MOVE-TEST-F1-88-1.
228700     IF NUMERIC-LIT EQUAL TO "60666"
228800         PERFORM PASS
228900         GO TO MOVE-WRITE-F1-88.
229000     MOVE GRP-LEV-NUMERIC TO COMPUTED-A.
229100     MOVE 60666 TO CORRECT-A.
229200     PERFORM FAIL.
229300     GO TO MOVE-WRITE-F1-88.
229400 MOVE-DELETE-F1-88.
229500     PERFORM DE-LETE.
229600 MOVE-WRITE-F1-88.
229700     MOVE "MOVE-TEST-F1-88" TO PAR-NAME.
229800     PERFORM PRINT-DETAIL.
229900 MOVE-INIT-F1-89.
230000     MOVE   -70717 TO SPOS-LIT1.
230100 MOVE-TEST-F1-89-0.
230200     MOVE SNEG-LIT1 TO NUMERIC-LIT.
230300 MOVE-TEST-F1-89-1.
230400     IF NUMERIC-LIT EQUAL TO "70717"
230500         PERFORM PASS
230600         GO TO MOVE-WRITE-F1-89.
230700     MOVE GRP-LEV-NUMERIC TO COMPUTED-A.
230800     MOVE 70717 TO CORRECT-A.
230900     PERFORM FAIL.
231000     GO TO MOVE-WRITE-F1-89.
231100 MOVE-DELETE-F1-89.
231200     PERFORM DE-LETE.
231300 MOVE-WRITE-F1-89.
231400     MOVE "MOVE-TEST-F1-89" TO PAR-NAME.
231500     PERFORM PRINT-DETAIL.
231600 MOVE-INIT-F1-90.
231700     MOVE   +60667 TO SPOS-LIT2.
231800 MOVE-TEST-F1-90-0.
231900     MOVE SPOS-LIT2 TO NUMERIC-LIT.
232000 MOVE-TEST-F1-90-1.
232100     IF NUMERIC-LIT EQUAL TO 60667
232200         PERFORM PASS
232300         GO TO MOVE-WRITE-F1-90.
232400     MOVE GRP-LEV-NUMERIC TO COMPUTED-A.
232500     MOVE 60667 TO CORRECT-A.
232600     PERFORM FAIL.
232700     GO TO MOVE-WRITE-F1-90.
232800 MOVE-DELETE-F1-90.
232900     PERFORM DE-LETE.
233000 MOVE-WRITE-F1-90.
233100     MOVE "MOVE-TEST-F1-90" TO PAR-NAME.
233200     PERFORM PRINT-DETAIL.
233300 MOVE-INIT-F1-91.
233400     MOVE   -70718 TO SNEG-LIT2.
233500 MOVE-TEST-F1-91-0.
233600     MOVE    SNEG-LIT2 TO NUMERIC-LIT.
233700 MOVE-TEST-F1-91-1.
233800     IF      NUMERIC-LIT EQUAL TO 70718
233900         PERFORM PASS
234000         GO TO MOVE-WRITE-F1-91.
234100     MOVE "+S9 MOVED TO PICTURE X " TO RE-MARK.
234200     MOVE NUMERIC-LIT TO COMPUTED-A.
234300     MOVE "70718" TO CORRECT-A.
234400     PERFORM FAIL.
234500     GO TO MOVE-WRITE-F1-91.
234600 MOVE-DELETE-F1-91.
234700     PERFORM DE-LETE.
234800 MOVE-WRITE-F1-91.
234900     MOVE "MOVE-TEST-F1-91" TO PAR-NAME.
235000     PERFORM PRINT-DETAIL.
235100 MOVE-INIT-F1-92.
235200     MOVE   +60666     TO SPOS-LIT1.
235300 MOVE-TEST-F1-92-0.
235400     MOVE    SPOS-LIT1 TO ALPHA-LIT.
235500 MOVE-TEST-F1-92-1.
235600     IF      ALPHA-LIT EQUAL TO "60666"
235700              PERFORM PASS
235800              GO TO MOVE-WRITE-F1-92.
235900     MOVE ALPHA-LIT TO COMPUTED-A.
236000     MOVE "60666" TO CORRECT-A.
236100     MOVE "SIGN SHOULD NOT BE MOVED" TO RE-MARK.
236200     PERFORM FAIL.
236300     GO TO MOVE-WRITE-F1-92.
236400 MOVE-DELETE-F1-92.
236500     PERFORM DE-LETE.
236600 MOVE-WRITE-F1-92.
236700     MOVE "MOVE-TEST-F1-92" TO PAR-NAME.
236800     PERFORM PRINT-DETAIL.
236900 MOVE-INIT-F1-93.
237000     MOVE  -70717   TO SNEG-LIT1.
237100 MOVE-TEST-F1-93-0.
237200     MOVE SNEG-LIT1 TO ALPHA-LIT.
237300 MOVE-TEST-F1-93-1.
237400     IF ALPHA-LIT EQUAL TO "70717"
237500         PERFORM PASS
237600         GO TO MOVE-WRITE-F1-93.
237700     MOVE ALPHA-LIT TO COMPUTED-A.
237800     MOVE "70717" TO CORRECT-A.
237900     MOVE "SIGN SHOULD NOT BE MOVED" TO RE-MARK.
238000     PERFORM FAIL.
238100     GO TO MOVE-WRITE-F1-93.
238200 MOVE-DELETE-F1-93.
238300     PERFORM DE-LETE.
238400 MOVE-WRITE-F1-93.
238500     MOVE "MOVE-TEST-F1-93" TO PAR-NAME.
238600     PERFORM PRINT-DETAIL.
238700 MOVE-INIT-F1-94.
238800     MOVE "JUSTIFIED MOVES    " TO FEATURE.
238900     MOVE  99 TO GRP-NUMERIC-99.
239000 MOVE-TEST-F1-94-0.
239100     MOVE GRP-NUMERIC-99 TO RECEIVE-1  RECEIVE-4  RECEIVE-5
239200         RECEIVE-6.
239300 MOVE-TEST-F1-94-1.
239400     IF RECEIVE-1 EQUAL TO "99   "
239500         PERFORM PASS
239600         GO TO MOVE-WRITE-F1-94.
239700     MOVE RECEIVE-1 TO COMPUTED-A.
239800     MOVE "99   " TO CORRECT-A.
239900     PERFORM FAIL.
240000     GO TO MOVE-WRITE-F1-94.
240100 MOVE-DELETE-F1-94.
240200     PERFORM DE-LETE.
240300 MOVE-WRITE-F1-94.
240400     MOVE "MOVE-TEST-F1-94" TO PAR-NAME.
240500     PERFORM PRINT-DETAIL.
240600 MOVE-TEST-F1-95.
240700     IF RECEIVE-4 EQUAL TO 99.00
240800         PERFORM PASS
240900         GO TO MOVE-WRITE-F1-95.
241000     MOVE 99.00 TO CORRECT-N.
241100     MOVE RECEIVE-4 TO COMPUTED-N.
241200     PERFORM FAIL.
241300     GO TO MOVE-WRITE-F1-95.
241400 MOVE-DELETE-F1-95.
241500     PERFORM DE-LETE.
241600 MOVE-WRITE-F1-95.
241700     MOVE "MOVE-TEST-F1-95" TO PAR-NAME.
241800     PERFORM PRINT-DETAIL.
241900 MOVE-TEST-F1-96.
242000     IF RECEIVE-5 EQUAL TO "99  "
242100         PERFORM PASS
242200         GO TO MOVE-WRITE-F1-96.
242300     MOVE RECEIVE-5 TO COMPUTED-A.
242400     MOVE "99  " TO CORRECT-A.
242500     PERFORM FAIL.
242600     GO TO MOVE-WRITE-F1-96.
242700 MOVE-DELETE-F1-96.
242800     PERFORM DE-LETE.
242900 MOVE-WRITE-F1-96.
243000     MOVE "MOVE-TEST-F1-96" TO PAR-NAME.
243100     PERFORM PRINT-DETAIL.
243200 MOVE-TEST-F1-97.
243300     IF RECEIVE-6 EQUAL TO "99   "
243400         PERFORM PASS
243500         GO TO MOVE-WRITE-F1-97.
243600     MOVE RECEIVE-6 TO COMPUTED-A.
243700     MOVE "99   " TO CORRECT-A.
243800     PERFORM FAIL.
243900     GO TO MOVE-WRITE-F1-97.
244000 MOVE-DELETE-F1-97.
244100     PERFORM DE-LETE.
244200 MOVE-WRITE-F1-97.
244300     MOVE "MOVE-TEST-F1-97" TO PAR-NAME.
244400     PERFORM PRINT-DETAIL.
244500 MOVE-INIT-F1-98.
244600     MOVE "MOVE (COMP/DISPLAY)" TO FEATURE.
244700     MOVE 798 TO WRK-CS-18V00.
244800 MOVE-TEST-F1-98-0.
244900     MOVE WRK-CS-18V00 TO WRK-DS-18V00.
245000 MOVE-TEST-F1-98-1.
245100     IF WRK-DS-18V00 EQUAL TO WRK-CS-18V00
245200         PERFORM PASS
245300         GO TO MOVE-WRITE-F1-98.
245400     MOVE WRK-CS-18V00 TO CORRECT-18V0.
245500     MOVE WRK-DS-18V00 TO COMPUTED-18V0.
245600     PERFORM FAIL.
245700     MOVE "FIELDS COMPARED UNEQUAL" TO RE-MARK.
245800     GO TO MOVE-WRITE-F1-98.
245900 MOVE-DELETE-F1-98.
246000     PERFORM DE-LETE.
246100 MOVE-WRITE-F1-98.
246200     MOVE "MOVE-TEST-F1-98" TO PAR-NAME.
246300     PERFORM PRINT-DETAIL.
246400 MOVE-INIT-F1-99.
246500     MOVE 798 TO WRK-CS-18V00.
246600 MOVE-TEST-F1-99-0.
246700     MOVE     WRK-CS-18V00 TO WRK-DS-10V00.
246800 MOVE-TEST-F1-99-1.
246900     IF WRK-DS-10V00 EQUAL TO WRK-CS-18V00
247000         PERFORM PASS
247100         GO TO MOVE-WRITE-F1-99.
247200     MOVE WRK-DS-10V00 TO CORRECT-18V0.
247300     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
247400     PERFORM FAIL.
247500     GO TO MOVE-WRITE-F1-99.
247600 MOVE-DELETE-F1-99.
247700     PERFORM DE-LETE.
247800 MOVE-WRITE-F1-99.
247900     MOVE "MOVE-TEST-F1-99" TO PAR-NAME.
248000     PERFORM PRINT-DETAIL.
248100 MOVE-INIT-F1-100.
248200     MOVE 7 TO WRK-DS-18V00.
248300 MOVE-TEST-F1-100-0.
248400     MOVE WRK-DS-18V00 TO WRK-CS-01V00.
248500 MOVE-TEST-F1-100-1.
248600     IF WRK-CS-01V00 EQUAL TO WRK-DS-18V00
248700         PERFORM PASS
248800         GO TO MOVE-WRITE-F1-100.
248900     MOVE WRK-DS-18V00 TO COMPUTED-18V0
249000     MOVE WRK-CS-01V00 TO CORRECT-18V0.
249100     PERFORM FAIL.
249200     GO TO MOVE-WRITE-F1-100.
249300 MOVE-DELETE-F1-100.
249400     PERFORM DE-LETE.
249500 MOVE-WRITE-F1-100.
249600     MOVE "MOVE-TEST-F1-100" TO PAR-NAME.
249700     PERFORM PRINT-DETAIL.
249800 MOVE-INIT-F1-101.
249900     MOVE 0123456789 TO WRK-DS-10V00.
250000 MOVE-TEST-F1-101-0.
250100     MOVE WRK-DS-10V00 TO WRK-CS-18V00.
250200 MOVE-TEST-F1-101-1.
250300     IF WRK-DS-10V00 EQUAL TO WRK-CS-18V00
250400         PERFORM PASS
250500         GO TO MOVE-WRITE-F1-101.
250600     MOVE WRK-DS-10V00 TO COMPUTED-18V0.
250700     MOVE WRK-CS-18V00 TO CORRECT-18V0.
250800     MOVE "FIELDS COMPARED UNEQUAL" TO RE-MARK.
250900     PERFORM FAIL.
251000     GO TO MOVE-WRITE-F1-101.
251100 MOVE-DELETE-F1-101.
251200     PERFORM DE-LETE.
251300 MOVE-WRITE-F1-101.
251400     MOVE "MOVE-TEST-F1-101" TO PAR-NAME.
251500     PERFORM PRINT-DETAIL.
251600 MOVE-INIT-F1-102.
251700     MOVE 3 TO WRK-CS-18V00.
251800 MOVE-TEST-F1-102-0.
251900     MOVE WRK-CS-18V00 TO WRK-DS-01V00.
252000 MOVE-TEST-F1-102-1.
252100     IF WRK-CS-18V00 EQUAL TO WRK-DS-01V00
252200         PERFORM PASS
252300         GO TO MOVE-WRITE-F1-102.
252400     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
252500     MOVE WRK-DS-01V00 TO CORRECT-18V0.
252600     MOVE "FIELDS COMPARED UNEQUAL" TO RE-MARK.
252700     PERFORM FAIL.
252800     GO TO MOVE-WRITE-F1-102.
252900 MOVE-DELETE-F1-102.
253000     PERFORM DE-LETE.
253100 MOVE-WRITE-F1-102.
253200     MOVE "MOVE-TEST-F1-102" TO PAR-NAME.
253300     PERFORM PRINT-DETAIL.
253400 MOVE-INIT-F1-103.
253500     MOVE    832.553 TO WRK-CS-08V08.
253600 MOVE-TEST-F1-103-0.
253700     MOVE WRK-CS-08V08 TO WRK-EDIT-Z3VZ3.
253800 MOVE-TEST-F1-103-1.
253900     IF WRK-EDIT-Z3VZ3 EQUAL TO "832.553"
254000         PERFORM PASS
254100         GO TO MOVE-WRITE-F1-103.
254200     MOVE "832.553" TO CORRECT-A.
254300     MOVE WRK-EDIT-Z3VZ3 TO COMPUTED-A.
254400     PERFORM FAIL.
254500     GO TO MOVE-WRITE-F1-103.
254600 MOVE-DELETE-F1-103.
254700     PERFORM DE-LETE.
254800 MOVE-WRITE-F1-103.
254900     MOVE "MOVE-TEST-F1-103" TO PAR-NAME.
255000     PERFORM PRINT-DETAIL.
255100 MOVE-INIT-F1-104.
255200     MOVE    6382.47 TO WRK-CS-08V08.
255300 MOVE-TEST-F1-104-0.
255400     MOVE WRK-CS-04V08 TO WRK-EDIT-05V02.
255500 MOVE-TEST-F1-104-1.
255600     IF       WRK-EDIT-05V02 EQUAL TO " 06382.47"
255700         PERFORM PASS
255800         GO TO MOVE-WRITE-F1-104.
255900     MOVE     " 06382.47" TO CORRECT-A.
256000     MOVE WRK-EDIT-05V02 TO COMPUTED-A.
256100     PERFORM FAIL.
256200     GO TO MOVE-WRITE-F1-104.
256300 MOVE-DELETE-F1-104.
256400     PERFORM DE-LETE.
256500 MOVE-WRITE-F1-104.
256600     MOVE "MOVE-TEST-F1-104" TO PAR-NAME.
256700     PERFORM PRINT-DETAIL.
256800 MOVE-INIT-F1-105.
256900     MOVE    832.553 TO WRK-CS-08V08.
257000 MOVE-TEST-F1-105-0.
257100     MOVE WRK-CS-08V08 TO WRK-EDIT-05V00.
257200 MOVE-TEST-F1-105-1.
257300     IF WRK-EDIT-05V00 EQUAL TO "**832"
257400         PERFORM PASS
257500         GO TO MOVE-WRITE-F1-105.
257600     MOVE "**832" TO CORRECT-A.
257700     MOVE WRK-EDIT-05V00 TO COMPUTED-A.
257800     PERFORM FAIL.
257900     GO TO MOVE-WRITE-F1-105.
258000 MOVE-DELETE-F1-105.
258100     PERFORM DE-LETE.
258200 MOVE-WRITE-F1-105.
258300     MOVE "MOVE-TEST-F1-105" TO PAR-NAME.
258400     PERFORM PRINT-DETAIL.
258500 MOVE-INIT-F1-106.
258600     MOVE 6382.47 TO WRK-CS-04V08.
258700 MOVE-TEST-F1-106-0.
258800     MOVE WRK-CS-04V08 TO WRK-EDIT-05V02.
258900 MOVE-TEST-F1-106-1.
259000     IF WRK-EDIT-05V02 EQUAL TO " 06382.47"
259100         PERFORM PASS
259200         GO TO MOVE-WRITE-F1-106.
259300     MOVE WRK-EDIT-05V02 TO COMPUTED-A.
259400     MOVE " 06382.47" TO CORRECT-A.
259500     PERFORM FAIL.
259600     GO TO MOVE-WRITE-F1-106.
259700 MOVE-DELETE-F1-106.
259800     PERFORM DE-LETE.
259900 MOVE-WRITE-F1-106.
260000     MOVE "MOVE-TEST-F1-106" TO PAR-NAME.
260100     PERFORM PRINT-DETAIL.
260200 MOVE-INIT-F1-107.
260300     MOVE ZERO TO WRK-CS-18V00.
260400 MOVE-TEST-F1-107-0.
260500     MOVE WRK-CS-18V00 TO WRK-EDIT-18V00.
260600 MOVE-TEST-F1-107-1.
260700     IF WRK-EDIT-18V00 EQUAL TO "                 0"
260800         PERFORM PASS
260900         GO TO MOVE-WRITE-F1-107.
261000     MOVE "                 0" TO CORRECT-A.
261100     MOVE WRK-EDIT-18V00 TO COMPUTED-A.
261200     PERFORM FAIL.
261300     GO TO MOVE-WRITE-F1-107.
261400 MOVE-DELETE-F1-107.
261500     PERFORM DE-LETE.
261600 MOVE-WRITE-F1-107.
261700     MOVE "MOVE-TEST-F1-107" TO PAR-NAME.
261800     PERFORM PRINT-DETAIL.
261900 MOVE-INIT-F1-108.
262000     MOVE "MOVE (DISPLAY/COMP)" TO FEATURE.
262100     MOVE 15 TO WRK-DS-10V00.
262200 MOVE-TEST-F1-108-0.
262300     MOVE WRK-DS-10V00 TO WRK-CS-01V00.
262400 MOVE-TEST-F1-108-1.
262500     IF WRK-CS-01V00 EQUAL TO 5
262600         PERFORM PASS
262700         GO TO MOVE-WRITE-F1-108.
262800     MOVE 5 TO CORRECT-N.
262900     MOVE WRK-CS-01V00 TO COMPUTED-N.
263000     PERFORM FAIL.
263100     GO TO MOVE-WRITE-F1-108.
263200 MOVE-DELETE-F1-108.
263300     PERFORM DE-LETE.
263400 MOVE-WRITE-F1-108.
263500     MOVE "MOVE-TEST-F1-108" TO PAR-NAME.
263600     PERFORM PRINT-DETAIL.
263700 MOVE-INIT-F1-109.
263800     MOVE 1023 TO WRK-DS-10V00.
263900 MOVE-TEST-F1-109-0.
264000     MOVE WRK-DS-10V00 TO WRK-CS-03V00.
264100 MOVE-TEST-F1-109-1.
264200     IF WRK-CS-03V00 EQUAL TO 023
264300         PERFORM PASS
264400         GO TO MOVE-WRITE-F1-109.
264500     MOVE WRK-CS-03V00 TO COMPUTED-N.
264600     MOVE 023 TO CORRECT-N.
264700     PERFORM FAIL.
264800     GO TO MOVE-WRITE-F1-109.
264900 MOVE-DELETE-F1-109.
265000     PERFORM DE-LETE.
265100 MOVE-WRITE-F1-109.
265200     MOVE "MOVE-TEST-F1-109" TO PAR-NAME.
265300     PERFORM PRINT-DETAIL.
265400 MOVE-INIT-F1-110.
265500     MOVE     SPACE TO MOVE71.
265600 MOVE-TEST-F1-110-0.
265700     MOVE     00000 TO MOVE71.
265800 MOVE-TEST-F1-110-1.
265900     IF       MOVE71 EQUAL TO "00000               "
266000              PERFORM PASS GO TO MOVE-WRITE-F1-110.
266100     GO       TO MOVE-FAIL-F1-110.
266200 MOVE-DELETE-F1-110.
266300     PERFORM  DE-LETE.
266400     GO       TO MOVE-WRITE-F1-110.
266500 MOVE-FAIL-F1-110.
266600     PERFORM  FAIL.
266700     MOVE     MOVE71 TO COMPUTED-A.
266800     MOVE     "00000               " TO CORRECT-A.
266900 MOVE-WRITE-F1-110.
267000     MOVE     "MOVE NUMERIC" TO FEATURE.
267100     MOVE     "MOVE-TEST-F1-110" TO PAR-NAME.
267200     PERFORM  PRINT-DETAIL.
267300 MOVE-INIT-F1-111.
267400     MOVE     234565432.1 TO MOVE74.
267500 MOVE-TEST-F1-111-0.
267600     MOVE     MOVE74 TO MOVE75.
267700 MOVE-TEST-F1-111.
267800     IF       MOVE75 EQUAL TO 234565432
267900              PERFORM PASS GO TO MOVE-WRITE-F1-111.
268000     GO       TO MOVE-FAIL-F1-111.
268100 MOVE-DELETE-F1-111.
268200     PERFORM  DE-LETE.
268300     GO       TO MOVE-WRITE-F1-111.
268400 MOVE-FAIL-F1-111.
268500     MOVE     MOVE75 TO COMPUTED-N.
268600     MOVE     234565432 TO CORRECT-N.
268700     PERFORM  FAIL.
268800 MOVE-WRITE-F1-111.
268900     MOVE     "MOVE -- COMP, SYNC" TO FEATURE.
269000     MOVE     "MOVE-TEST-F1-111" TO PAR-NAME.
269100     PERFORM  PRINT-DETAIL.
269200 MOVE-INIT-F1-112.
269300     MOVE "MOVE TO COMP (ABS)" TO FEATURE.
269400     MOVE  +60666 TO SPOS-LIT1.
269500 MOVE-TEST-F1-112-0.
269600     MOVE SPOS-LIT1 TO CU-05V00-001.
269700 MOVE-TEST-F1-112-1.
269800     IF       CU-05V00-001 EQUAL TO 60666
269900             PERFORM PASS
270000             GO TO MOVE-WRITE-F1-112.
270100     MOVE    CU-05V00-001 TO COMPUTED-18V0.
270200     MOVE     60666 TO CORRECT-18V0.
270300     PERFORM FAIL.
270400     GO TO   MOVE-WRITE-F1-112.
270500 MOVE-DELETE-F1-112.
270600     PERFORM DE-LETE.
270700 MOVE-WRITE-F1-112.
270800     MOVE "MOVE-TEST-F1-112" TO PAR-NAME.
270900     PERFORM PRINT-DETAIL.
271000 MOVE-INIT-F1-113.
271100     MOVE  +60667 TO SPOS-LIT2.
271200 MOVE-TEST-F1-113-0.
271300     MOVE SPOS-LIT2 TO CU-05V00-001.
271400 MOVE-TEST-F1-113-1.
271500     IF       CU-05V00-001 EQUAL TO 60667
271600             PERFORM PASS
271700             GO TO MOVE-WRITE-F1-113.
271800     MOVE    CU-05V00-001 TO COMPUTED-18V0.
271900     MOVE     60667 TO CORRECT-18V0.
272000     PERFORM FAIL.
272100     GO TO   MOVE-WRITE-F1-113.
272200 MOVE-DELETE-F1-113.
272300     PERFORM DE-LETE.
272400 MOVE-WRITE-F1-113.
272500     MOVE "MOVE-TEST-F1-113" TO PAR-NAME.
272600     PERFORM PRINT-DETAIL.
272700 MOVE-TEST-F1-114.
272800     MOVE SNEG-LIT1 TO CU-05V00-001.
272900     IF       CU-05V00-001 EQUAL TO 70717
273000             PERFORM PASS
273100             GO TO MOVE-WRITE-F1-114.
273200     MOVE    CU-05V00-001 TO COMPUTED-18V0.
273300     MOVE     70717 TO CORRECT-18V0.
273400     PERFORM FAIL.
273500     GO TO   MOVE-WRITE-F1-114.
273600 MOVE-DELETE-F1-114.
273700     PERFORM DE-LETE.
273800 MOVE-WRITE-F1-114.
273900     MOVE "MOVE-TEST-F1-114" TO PAR-NAME.
274000     PERFORM PRINT-DETAIL.
274100 MOVE-INIT-F1-115.
274200     MOVE  -70718 TO SNEG-LIT2.
274300 MOVE-TEST-F1-115-0.
274400     MOVE SNEG-LIT2 TO CU-05V00-001.
274500 MOVE-TEST-F1-115.
274600     IF       CU-05V00-001 EQUAL TO 70718
274700             PERFORM PASS
274800             GO TO MOVE-WRITE-F1-115.
274900     MOVE    CU-05V00-001 TO COMPUTED-18V0.
275000     MOVE     70718 TO CORRECT-18V0.
275100     PERFORM FAIL.
275200     GO TO   MOVE-WRITE-F1-115.
275300 MOVE-DELETE-F1-115.
275400     PERFORM DE-LETE.
275500 MOVE-WRITE-F1-115.
275600     MOVE "MOVE-TEST-F1-115" TO PAR-NAME.
275700     PERFORM PRINT-DETAIL.
275800 MOVE-INIT-F1-116.
275900     MOVE  +60666 TO SPOS-LIT1.
276000 MOVE-TEST-F1-116-0.
276100     MOVE     SPOS-LIT1 TO CS-05V00-001.
276200 MOVE-TEST-F1-116-1.
276300     MOVE     CS-05V00-001 TO CU-05V00-001.
276400     IF      CU-05V00-001 EQUAL TO 60666
276500             PERFORM PASS
276600             GO TO MOVE-WRITE-F1-116.
276700     MOVE CU-05V00-001 TO COMPUTED-18V0.
276800     MOVE     60666 TO CORRECT-18V0.
276900     PERFORM FAIL.
277000     GO TO MOVE-WRITE-F1-116.
277100 MOVE-DELETE-F1-116.
277200     PERFORM  DE-LETE.
277300 MOVE-WRITE-F1-116.
277400     MOVE    "MOVE-TEST-F1-116" TO PAR-NAME.
277500     PERFORM  PRINT-DETAIL.
277600 MOVE-INIT-F1-117.
277700     MOVE  +60667 TO SPOS-LIT2.
277800 MOVE-TEST-F1-117-0.
277900     MOVE     SPOS-LIT2 TO CS-05V00-001.
278000     MOVE     CS-05V00-001 TO CU-05V00-001.
278100 MOVE-TEST-F1-117-1.
278200     IF      CU-05V00-001 EQUAL TO 60667
278300             PERFORM PASS
278400             GO TO MOVE-WRITE-F1-117.
278500     MOVE CU-05V00-001 TO COMPUTED-18V0.
278600     MOVE     60667 TO CORRECT-18V0.
278700     PERFORM FAIL.
278800     GO TO MOVE-WRITE-F1-117.
278900 MOVE-DELETE-F1-117.
279000     PERFORM  DE-LETE.
279100 MOVE-WRITE-F1-117.
279200     MOVE    "MOVE-TEST-F1-117" TO PAR-NAME.
279300     PERFORM  PRINT-DETAIL.
279400 MOVE-INIT-F1-118.
279500     MOVE  -70717 TO SNEG-LIT1.
279600 MOVE-TEST-F1-118-0.
279700     MOVE     SNEG-LIT1 TO CS-05V00-001.
279800     MOVE     CS-05V00-001 TO CU-05V00-001.
279900 MOVE-TEST-F1-118-1.
280000     IF      CU-05V00-001 EQUAL TO 70717
280100             PERFORM PASS
280200             GO TO MOVE-WRITE-F1-118.
280300     MOVE CU-05V00-001 TO COMPUTED-18V0.
280400     MOVE     70717 TO CORRECT-18V0.
280500     PERFORM FAIL.
280600     GO TO MOVE-WRITE-F1-118.
280700 MOVE-DELETE-F1-118.
280800     PERFORM  DE-LETE.
280900 MOVE-WRITE-F1-118.
281000     MOVE    "MOVE-TEST-F1-118" TO PAR-NAME.
281100     PERFORM  PRINT-DETAIL.
281200 MOVE-INIT-F1-119.
281300     MOVE  -70718 TO SNEG-LIT2.
281400 MOVE-TEST-F1-119-0.
281500     MOVE     SNEG-LIT2 TO CS-05V00-001.
281600     MOVE     CS-05V00-001 TO CU-05V00-001.
281700 MOVE-TEST-F1-119-1.
281800     IF      CU-05V00-001 EQUAL TO 70718
281900             PERFORM PASS
282000             GO TO MOVE-WRITE-F1-119.
282100     MOVE CU-05V00-001 TO COMPUTED-18V0.
282200     MOVE     70718 TO CORRECT-18V0.
282300     PERFORM FAIL.
282400     GO TO MOVE-WRITE-F1-119.
282500 MOVE-DELETE-F1-119.
282600     PERFORM  DE-LETE.
282700 MOVE-WRITE-F1-119.
282800     MOVE    "MOVE-TEST-F1-119" TO PAR-NAME.
282900     PERFORM  PRINT-DETAIL.
283000*
283100*        MOVE-TEST-176 THROUGH MOVE-TEST-178 CONTAIN MOVE
283200*    STATEMENTS OF THE FORM
283300*            MOVE ALL LITERAL TO NUMERIC DATA ITEM.
283400*
283500*    REFERENCES IN X3.23-1974
283600*            PAGE I-85, 5.3.2.2.2.3(1)
283700*            PAGE II-76, 5.15.4(4)B.3
283800*
283900*MOVE-TEST-176.
284000*    MOVE ZERO TO MOVE5.
284100*    MOVE ALL "123" TO MOVE5.
284200*    IF MOVE5 EQUAL TO 12
284300*            PERFORM PASS
284400*            GO TO MOVE-WRITE-176
284500*        ELSE GO TO MOVE-FAIL-176.
284600 MOVE-DELETE-176.
284700     PERFORM DE-LETE.
284800     GO TO MOVE-WRITE-176.
284900 MOVE-FAIL-176.
285000     PERFORM FAIL.
285100     MOVE 12 TO CORRECT-N.
285200     MOVE MOVE5 TO COMPUTED-N.
285300 MOVE-WRITE-176.
285400     MOVE "*DELETED BY FCCTS*" TO FEATURE.
285500     MOVE "MOVE-TEST-176" TO PAR-NAME.
285600     PERFORM PRINT-DETAIL.
285700*MOVE-TEST-177.
285800*    MOVE ZERO TO MOVE5.
285900*    MOVE ALL "ABC123" TO MOVE5.
286000*    IF MOVE5 EQUAL TO 23
286100*            PERFORM PASS
286200*            GO TO MOVE-WRITE-177
286300*        ELSE GO TO MOVE-FAIL-177.
286400 MOVE-DELETE-177.
286500     PERFORM DE-LETE.
286600     GO TO MOVE-WRITE-177.
286700 MOVE-FAIL-177.
286800     PERFORM FAIL.
286900     MOVE 23 TO CORRECT-N.
287000     MOVE MOVE5 TO COMPUTED-N.
287100 MOVE-WRITE-177.
287200     MOVE "*DELETED BY FCCTS*" TO FEATURE.
287300     MOVE "MOVE-TEST-177" TO PAR-NAME.
287400     PERFORM PRINT-DETAIL.
287500*MOVE-TEST-178.
287600*    MOVE ZERO TO MOVE7.
287700*    MOVE ALL "2A" TO MOVE7.
287800*    IF MOVE7 EQUAL TO 2
287900*            PERFORM PASS
288000*            GO TO MOVE-WRITE-178
288100*        ELSE GO TO MOVE-FAIL-178.
288200 MOVE-DELETE-178.
288300     PERFORM DE-LETE.
288400     GO TO MOVE-WRITE-178.
288500 MOVE-FAIL-178.
288600     PERFORM FAIL.
288700     MOVE 2 TO CORRECT-N.
288800     MOVE MOVE7 TO COMPUTED-N.
288900 MOVE-WRITE-178.
289000     MOVE "*DELETED BY FCCTS*" TO FEATURE.
289100     MOVE "MOVE-TEST-178" TO PAR-NAME.
289200     PERFORM PRINT-DETAIL.
289300     MOVE "EDIT--B(N), 0(N)"  TO FEATURE.
289400 EDIT-INIT-F1-120.
289500
289600 EDIT-TEST-F1-120-0.
289700     MOVE "926"    TO EDIT-PICTURE-01.
289800 EDIT-TEST-F1-120-1.
289900     IF EDIT-PICTURE-01 EQUAL TO  "9               26"
290000              PERFORM PASS
290100              GO TO EDIT-WRITE-F1-120.
290200     PERFORM FAIL.
290300     MOVE EDIT-PICTURE-01 TO COMPUTED-A.
290400     MOVE "9               26" TO CORRECT-A.
290500     GO TO EDIT-WRITE-F1-120.
290600 EDIT-DELETE-F1-120.
290700     PERFORM DE-LETE.
290800 EDIT-WRITE-F1-120.
290900     MOVE "EDIT-TEST-F1-120" TO PAR-NAME.
291000     PERFORM PRINT-DETAIL.
291100 EDIT-INIT-F1-121.
291200
291300 EDIT-TEST-F1-121-0.
291400     MOVE "1492"   TO EDIT-PICTURE-02.
291500 EDIT-TEST-F1-121-1.
291600     IF EDIT-PICTURE-02 EQUAL TO "$0000000000492"
291700              PERFORM PASS
291800              GO TO EDIT-WRITE-F1-121.
291900     PERFORM FAIL.
292000     MOVE EDIT-PICTURE-02 TO COMPUTED-A.
292100     MOVE "$0000000000492" TO CORRECT-A.
292200     GO TO EDIT-WRITE-F1-121.
292300 EDIT-DELETE-F1-121.
292400     PERFORM DE-LETE.
292500 EDIT-WRITE-F1-121.
292600     MOVE "EDIT-TEST-F1-121" TO PAR-NAME.
292700     PERFORM PRINT-DETAIL.
292800 EDIT-INIT-F1-122.
292900     MOVE   333 TO EDIT-DATA-1.
293000 EDIT-TEST-F1-122-0.
293100     MOVE EDIT-DATA-1 TO EDIT-PICTURE-01.
293200 EDIT-TEST-F1-122-1.
293300     IF EDIT-PICTURE-01 EQUAL TO  "3               33"
293400              PERFORM PASS
293500              GO TO EDIT-WRITE-F1-122.
293600     PERFORM FAIL.
293700     MOVE EDIT-PICTURE-01 TO COMPUTED-A.
293800     MOVE "3               33" TO CORRECT-A.
293900     GO TO EDIT-WRITE-F1-122.
294000 EDIT-DELETE-F1-122.
294100     PERFORM DE-LETE.
294200 EDIT-WRITE-F1-122.
294300     MOVE "EDIT-TEST-F1-122" TO PAR-NAME.
294400     PERFORM PRINT-DETAIL.
294500 EDIT-INIT-F1-123.
294600     MOVE   916 TO EDIT-DATA-2.
294700 EDIT-TEST-F1-123-0.
294800     MOVE EDIT-DATA-2 TO EDIT-PICTURE-02.
294900 EDIT-TEST-F1-123-1.
295000     IF EDIT-PICTURE-02 EQUAL TO "$0000000000916"
295100              PERFORM PASS
295200              GO TO EDIT-WRITE-F1-123.
295300     PERFORM FAIL.
295400     MOVE EDIT-PICTURE-02 TO COMPUTED-A.
295500     MOVE "$0000000000916 " TO CORRECT-A.
295600     GO TO EDIT-WRITE-F1-123.
295700 EDIT-DELETE-F1-123.
295800     PERFORM DE-LETE.
295900 EDIT-WRITE-F1-123.
296000     MOVE "EDIT-TEST-F1-123" TO PAR-NAME.
296100     PERFORM PRINT-DETAIL.
296200 EDIT-INIT-F1-124.
296300     MOVE "EDIT -- MASKED EDIT"      TO FEATURE.
296400 EDIT-TEST-F1-124-0.
296500     MOVE  000987.65    TO EDIT-PIC-05.
296600 EDIT-TEST-F1-124-1.
296700     IF GRP-EDIT-PIC-05 EQUAL TO "   $987.65"
296800              PERFORM PASS
296900              GO TO EDIT-WRITE-F1-124.
297000     PERFORM FAIL.
297100     MOVE EDIT-PIC-05    TO COMPUTED-A.
297200     MOVE "   $987.65"  TO CORRECT-A.
297300     GO TO EDIT-WRITE-F1-124.
297400 EDIT-DELETE-F1-124.
297500     PERFORM DE-LETE.
297600 EDIT-WRITE-F1-124.
297700     MOVE "EDIT-TEST-F1-124"   TO PAR-NAME.
297800     PERFORM PRINT-DETAIL.
297900 EDIT-INIT-F1-125.
298000*
298100 EDIT-TEST-F1-125-0.
298200     MOVE  000123.45    TO EDIT-PIC-06.
298300 EDIT-TEST-F1-125-1.
298400     IF GRP-EDIT-PIC-06 EQUAL TO  "   $123.45"
298500              PERFORM PASS
298600              GO TO EDIT-WRITE-F1-125.
298700     PERFORM FAIL.
298800     MOVE EDIT-PIC-06    TO COMPUTED-A.
298900     MOVE "   $123.45" TO CORRECT-A.
299000     GO TO EDIT-WRITE-F1-125.
299100 EDIT-DELETE-F1-125.
299200     PERFORM DE-LETE.
299300 EDIT-WRITE-F1-125.
299400     MOVE "EDIT-TEST-F1-125"   TO PAR-NAME.
299500     PERFORM PRINT-DETAIL.
299600 EDIT-INIT-F1-126.
299700*
299800 EDIT-TEST-F1-126-0.
299900     MOVE  000321.01    TO EDIT-PIC-07.
300000 EDIT-TEST-F1-126-1.
300100     IF GRP-EDIT-PIC-07 EQUAL TO  "   +321.01"
300200              PERFORM PASS
300300              GO TO EDIT-WRITE-F1-126.
300400     PERFORM FAIL.
300500     MOVE EDIT-PIC-07    TO COMPUTED-A.
300600     MOVE "   +321.01"  TO CORRECT-A.
300700     GO TO EDIT-WRITE-F1-126.
300800 EDIT-DELETE-F1-126.
300900     PERFORM DE-LETE.
301000 EDIT-WRITE-F1-126.
301100     MOVE "EDIT-TEST-F1-126"   TO PAR-NAME.
301200     PERFORM PRINT-DETAIL.
301300 EDIT-INIT-F1-127.
301400*
301500 EDIT-TEST-F1-127-0.
301600     MOVE -0012.98      TO EDIT-PIC-08.
301700 EDIT-TEST-F1-127-1.
301800     IF GRP-EDIT-PIC-08 EQUAL TO "   -012.98"
301900              PERFORM PASS
302000              GO TO EDIT-WRITE-F1-127.
302100     PERFORM FAIL.
302200     MOVE EDIT-PIC-08    TO COMPUTED-A.
302300     MOVE "   -012.98"  TO CORRECT-A.
302400     GO TO EDIT-WRITE-F1-127.
302500 EDIT-DELETE-F1-127.
302600     PERFORM DE-LETE.
302700 EDIT-WRITE-F1-127.
302800     MOVE "EDIT-TEST-F1-127"   TO PAR-NAME.
302900     PERFORM PRINT-DETAIL.
303000 EDIT-INIT-F1-128.
303100*
303200 EDIT-TEST-F1-128-0.
303300     MOVE  0000567.43   TO EDIT-PIC-09.
303400 EDIT-TEST-F1-128-1.
303500     IF GRP-EDIT-PIC-09 EQUAL TO "****567.43"
303600              PERFORM PASS
303700              GO TO EDIT-WRITE-F1-128.
303800     PERFORM FAIL.
303900     MOVE EDIT-PIC-09    TO COMPUTED-A.
304000     MOVE "****567.43"  TO CORRECT-A.
304100     GO TO EDIT-WRITE-F1-128.
304200 EDIT-DELETE-F1-128.
304300     PERFORM DE-LETE.
304400 EDIT-WRITE-F1-128.
304500     MOVE "EDIT-TEST-F1-128"   TO PAR-NAME.
304600     PERFORM PRINT-DETAIL.
304700 EDIT-INIT-F1-129.
304800*
304900 EDIT-TEST-F1-129-0.
305000     MOVE ZERO          TO EDIT-PIC-10.
305100 EDIT-TEST-F1-129-1.
305200     IF GRP-EDIT-PIC-10 EQUAL TO  "    000.00"
305300              PERFORM PASS
305400              GO TO EDIT-WRITE-F1-129.
305500     PERFORM FAIL.
305600     MOVE EDIT-PIC-10    TO COMPUTED-A.
305700     MOVE "    000.00"   TO CORRECT-A.
305800     GO TO EDIT-WRITE-F1-129.
305900 EDIT-DELETE-F1-129.
306000     PERFORM DE-LETE.
306100 EDIT-WRITE-F1-129.
306200     MOVE "EDIT-TEST-F1-129"  TO PAR-NAME.
306300     PERFORM PRINT-DETAIL.
306400     GO TO CCVS-EXIT.
306500 A20.
306600     MOVE FIRST-20S TO CORRECT-A.
306700     MOVE FIRST-20R TO COMPUTED-A.
306800     MOVE "1ST 20 POSITIONS OF RESULTS" TO RE-MARK.
306900     MOVE TEST-RESULTS TO PRINT-REC.
307000     WRITE PRINT-REC AFTER ADVANCING 1 LINES.
307100     SUBTRACT 20 FROM LENGTH-COUNTER.
307200 A40.
307300     MOVE SECOND-20S TO CORRECT-A.
307400     MOVE SECOND-20R TO COMPUTED-A.
307500     MOVE "2ND 20 POSITIONS OF RESULTS" TO RE-MARK.
307600     IF LENGTH-COUNTER GREATER THAN 20
307700         MOVE SPACE TO P-OR-F
307800         MOVE TEST-RESULTS TO PRINT-REC
307900         WRITE PRINT-REC AFTER ADVANCING 1 LINES
308000         SUBTRACT 20 FROM LENGTH-COUNTER ELSE
308100     MOVE 000 TO LENGTH-COUNTER.
308200 A60.
308300     MOVE THIRD-20S TO CORRECT-A.
308400     MOVE THIRD-20R TO COMPUTED-A.
308500     MOVE "3RD 20 POSITIONS OF RESULTS" TO RE-MARK.
308600     IF LENGTH-COUNTER GREATER THAN 20
308700         MOVE SPACE TO P-OR-F
308800         MOVE TEST-RESULTS TO PRINT-REC
308900         WRITE PRINT-REC AFTER ADVANCING 1 LINES
309000         SUBTRACT 20 FROM LENGTH-COUNTER ELSE
309100     MOVE 000 TO LENGTH-COUNTER.
309200 A80.
309300     MOVE FOURTH-20S TO CORRECT-A.
309400     MOVE FOURTH-20R TO COMPUTED-A.
309500     MOVE "4TH 20 POSITIONS OF RESULTS" TO RE-MARK.
309600     IF LENGTH-COUNTER GREATER THAN 20
309700         MOVE SPACE TO P-OR-F
309800         MOVE TEST-RESULTS TO PRINT-REC
309900         WRITE PRINT-REC AFTER ADVANCING 1 LINES
310000         SUBTRACT 20 FROM LENGTH-COUNTER ELSE
310100     MOVE 000 TO LENGTH-COUNTER.
310200 A100.
310300     MOVE FIFTH-20S TO CORRECT-A.
310400     MOVE FIFTH-20R TO COMPUTED-A.
310500     MOVE "5TH 20 POSITIONS OF RESULTS" TO RE-MARK.
310600     IF LENGTH-COUNTER GREATER THAN 20
310700         MOVE SPACE TO P-OR-F
310800         MOVE TEST-RESULTS TO PRINT-REC
310900         WRITE PRINT-REC AFTER ADVANCING 1 LINES.
311000     MOVE 000 TO LENGTH-COUNTER.
311100 A120.
311200     MOVE SIXTH-20S TO CORRECT-A.
311300     MOVE SIXTH-20R TO COMPUTED-A.
311400     MOVE "6TH 20 POSITIONS OF RESULTS" TO RE-MARK.
311500 CCVS-EXIT SECTION.
311600 CCVS-999999.
311700     GO TO CLOSE-FILES.
