000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC109M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*      PROGRAM NC109M TESTS FORMAT 1 OF THE ACCEPT STATEMENT
002300*      AND THE GENERAL FORMAT OF THE DISPLAY STATEMENT.
002400*
002500*
002600
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 01  CHARACTER-BREAKDOWN-R.
004400     02  FIRST-20R               PICTURE X(20).
004500     02  SECOND-20R              PICTURE X(20).
004600     02  THIRD-20R               PICTURE X(20).
004700     02  FOURTH-20R              PICTURE X(20).
004800 01  CHARACTER-BREAKDOWN-S.
004900     02  FIRST-20S               PICTURE X(20).
005000     02  SECOND-20S              PICTURE X(20).
005100     02  THIRD-20S               PICTURE X(20).
005200     02  FOURTH-20S              PICTURE X(20).
005300 01  X80-CHARACTER-FIELD.
005400     02  FILLER                  PICTURE X(80).
005500 01  ACCEPT-RESULTS.
005600     02  FILLER                  PICTURE X(80)  VALUE
005700     "A B C D E F G H I J K L M N O P Q R S T U V W X Y Z  0123456
005800-    "789                 ".
005900 01  DISPLAY-DATA.
006000     02 DISPLAY-A.
006100       03 DISPLAY-03               PICTURE A     VALUE "A".
006200       03 DISPLAY-03A.
006300         04 DISPLAY-04             PICTURE A     VALUE "L".
006400         04 DISPLAY-04A.
006500           05 DISPLAY-05           PICTURE A     VALUE "P".
006600           05 DISPLAY-05A.
006700             06 DISPLAY-06         PICTURE A     VALUE "H".
006800             06 DISPLAY-06A.
006900               07 DISPLAY-07       PICTURE A     VALUE "A".
007000               07 DISPLAY-07A.
007100                 08 DISPLAY-08     PICTURE A     VALUE "B".
007200                 08 DISPLAY-08A.
007300                   09 DISPLAY-09   PICTURE A     VALUE "E".
007400                   09 DISPLAY-09A.
007500                     10 DISPLAY-10 PICTURE AAA   VALUE "TIC".
007600     02 DISPLAY-N       PICTURE 9(10)       VALUE 0123456789.
007700     02 DISPLAY-X       PICTURE X(10)       VALUE "A1B2C3D4E5".
007800     02 DISPLAY-B       PICTURE X(13).
007900     02 DISPLAY-C REDEFINES DISPLAY-B.
008000       03 DISPLAY-D     PICTURE X(8).
008100       03 DISPLAY-E     PICTURE X(5).
008200     02 DISPLAY-F.
008300       03 DISPLAY-G     PICTURE X(100)      VALUE "*001*002*003*00
008400-    "4*005*006*007*008*009*010*011*012*013*014*015*016*017*018*01
008500-    "9*020*021*022*023*024*025".
008600       03 DISPLAY-H     PICTURE X(100)      VALUE "*026*027*028*02
008700-    "9*030*031*032*033*034*035*036*037*038*039*040*041*042*043*04
008800-    "4*045*046*047*048*049*050".
008900     02 SEE-ABOVE       PICTURE X(9) VALUE "SEE ABOVE".
009000     02 SEE-BELOW       PICTURE X(9) VALUE "SEE BELOW".
009100     02 CORRECT-FOLLOWS PICTURE X(20) VALUE
009200                                      "CORRECT DATA FOLLOWS".
009300     02 END-CORRECT     PICTURE X(16) VALUE
009400                                      "END CORRECT DATA".
009500     02 DISPLAY-WRITER.
009600       03 DIS-PLAYER.
009700         04 FILLER      PICTURE X(6).
009800         04 QUOTE-SLOT  PICTURE X.
009900         04 FILLER      PICTURE X(112).
010000     02 DISPLAY-SWITCH  PICTURE 9 VALUE ZERO.
010100     02 ZERO-SPACE-QUOTE.
010200       03 FILLER        PICTURE X VALUE ZERO.
010300       03 FILLER        PICTURE X VALUE SPACE.
010400       03 FILLER        PICTURE X VALUE QUOTE.
010500 01  LONG-LITERAL.
010600     02 LONG20                          PICTURE IS X(20)
010700     VALUE IS "STANDARD COMPILERS M".
010800     02 LONG40                          PICTURE IS X(20)
010900     VALUE IS "UST ALLOW NON-NUMERI".
011000     02 LONG60                          PICTURE IS X(20)
011100     VALUE IS "C LITERALS OF AT LEA".
011200     02 LONG80                          PICTURE IS X(20)
011300     VALUE IS "ST 120 CHARACTERS AN".
011400     02 LONG100                         PICTURE IS X(20)
011500     VALUE IS "D NUMERIC LITERALS O".
011600     02 LONG120                         PICTURE IS X(20)
011700     VALUE IS "F AT LEAST 18 DIGITS".
011800 01  ACCEPT-DATA.
011900     02 ACCEPT-D1.
012000       03 ACCEPT-D1-A PICTURE X(20).
012100       03 ACCEPT-D1-B PICTURE X(7).
012200     02 ACCEPT-D2       PICTURE X(27)
012300                        VALUE "ABCDEFGHIJKLMNOPQRSTUVWXY Z".
012400     02 ACCEPT-D3  PICTURE 9(10) USAGE DISPLAY.
012500     02 ACCEPT-D4  PICTURE 9(10) USAGE DISPLAY VALUE 0123456789.
012600     02 ACCEPT-D5  PICTURE X(11).
012700     02  ACCEPT-D6 PICTURE X(11) VALUE "().+-*/$, =".
012800     02 ACCEPT-D7  PICTURE X.
012900     02 ACCEPT-D8 PICTURE X VALUE "9".
013000     02 ACCEPT-D9  PICTURE X.
013100     02 ACCEPT-D10 PICTURE X VALUE "0".
013200     02 ACCEPT-D11 PICTURE A(20).
013300     02 ACCEPT-D12 PICTURE A(20)
013400              VALUE " ABC            XYZ ".
013500     02 ACCEPT-D13 PICTURE 9(9).
013600     02 ACCEPT-D14 PICTURE 9(9) VALUE 012345678.
013700     02 ACCEPT-D15 PICTURE X.
013800     02 ACCEPT-D16 PICTURE X VALUE SPACE.
013900     02 ACCEPT-D17 PICTURE X.
014000     02 ACCEPT-D18 PICTURE X VALUE QUOTE.
014100     02 ACCEPT-D21.
014200         03 TAB-ACCEPT PICTURE XXXX OCCURS 3 TIMES.
014300     02 ACCEPT-D22 PICTURE X(12) VALUE "....ABCD....".
014400 01  TAB-VALUE                    PICTURE X(21)
014500                                  VALUE "ABCDEFGHIJKLMNOPQRSTU".
014600 01  NO-TAB-RECORD REDEFINES TAB-VALUE.
014700     02 X1    PICTURE X.
014800     02 X2    PICTURE X.
014900     02 X3    PICTURE X.
015000     02 X4    PICTURE X.
015100     02 X5    PICTURE X.
015200     02 X6    PICTURE X.
015300     02 X7    PICTURE X.
015400     02 X8    PICTURE X.
015500     02 X9    PICTURE X.
015600     02 X10   PICTURE X.
015700     02 X11   PICTURE X.
015800     02 X12   PICTURE X.
015900     02 X13   PICTURE X.
016000     02 X14   PICTURE X.
016100     02 X15   PICTURE X.
016200     02 X16   PICTURE X.
016300     02 X17   PICTURE X.
016400     02 X18   PICTURE X.
016500     02 X19   PICTURE X.
016600     02 X20   PICTURE X.
016700     02 X21   PICTURE X.
016800 01  TAB-RECORD REDEFINES TAB-VALUE.
016900     02 XTAB                      PICTURE X OCCURS 21 TIMES.
017000 01  DISPLAY-MIXTURE.
017100     02 I-DATA                    PICTURE X(17)
017200                                  VALUE " IDENTIFIER DATA ".
017300     02 TA-VALUE                  PICTURE X(20)
017400              VALUE "A B C D E 0102030405".
017500     02 TA-BLE REDEFINES TA-VALUE.
017600             04 PIECE-A           PICTURE XX OCCURS 5 TIMES.
017700             04 PIECE-N           PICTURE 99 OCCURS 5 TIMES.
017800     02 TRUE-PAIR.
017900         03 A1                    PICTURE X(21)
018000                                  VALUE " (TOTAL 21 OPERANDS) ".
018100         03 A2                    PICTURE X(11)
018200                                  VALUE "END OF DATA".
018300 01  TEST-RESULTS.
018400     02 FILLER                   PIC X      VALUE SPACE.
018500     02 FEATURE                  PIC X(20)  VALUE SPACE.
018600     02 FILLER                   PIC X      VALUE SPACE.
018700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
018800     02 FILLER                   PIC X      VALUE SPACE.
018900     02  PAR-NAME.
019000       03 FILLER                 PIC X(19)  VALUE SPACE.
019100       03  PARDOT-X              PIC X      VALUE SPACE.
019200       03 DOTVALUE               PIC 99     VALUE ZERO.
019300     02 FILLER                   PIC X(8)   VALUE SPACE.
019400     02 RE-MARK                  PIC X(61).
019500 01  TEST-COMPUTED.
019600     02 FILLER                   PIC X(30)  VALUE SPACE.
019700     02 FILLER                   PIC X(17)  VALUE
019800            "       COMPUTED=".
019900     02 COMPUTED-X.
020000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
020100     03 COMPUTED-N               REDEFINES COMPUTED-A
020200                                 PIC -9(9).9(9).
020300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
020400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
020500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
020600     03       CM-18V0 REDEFINES COMPUTED-A.
020700         04 COMPUTED-18V0                    PIC -9(18).
020800         04 FILLER                           PIC X.
020900     03 FILLER PIC X(50) VALUE SPACE.
021000 01  TEST-CORRECT.
021100     02 FILLER PIC X(30) VALUE SPACE.
021200     02 FILLER PIC X(17) VALUE "       CORRECT =".
021300     02 CORRECT-X.
021400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
021500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
021600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
021700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
021800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
021900     03      CR-18V0 REDEFINES CORRECT-A.
022000         04 CORRECT-18V0                     PIC -9(18).
022100         04 FILLER                           PIC X.
022200     03 FILLER PIC X(2) VALUE SPACE.
022300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
022400 01  CCVS-C-1.
022500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
022600-    "SS  PARAGRAPH-NAME
022700-    "       REMARKS".
022800     02 FILLER                     PIC X(20)    VALUE SPACE.
022900 01  CCVS-C-2.
023000     02 FILLER                     PIC X        VALUE SPACE.
023100     02 FILLER                     PIC X(6)     VALUE "TESTED".
023200     02 FILLER                     PIC X(15)    VALUE SPACE.
023300     02 FILLER                     PIC X(4)     VALUE "FAIL".
023400     02 FILLER                     PIC X(94)    VALUE SPACE.
023500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
023600 01  REC-CT                        PIC 99       VALUE ZERO.
023700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
023800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
023900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
024000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
024100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
024200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
024300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
024400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
024500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
024600 01  CCVS-H-1.
024700     02  FILLER                    PIC X(39)    VALUE SPACES.
024800     02  FILLER                    PIC X(42)    VALUE
024900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
025000     02  FILLER                    PIC X(39)    VALUE SPACES.
025100 01  CCVS-H-2A.
025200   02  FILLER                        PIC X(40)  VALUE SPACE.
025300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
025400   02  FILLER                        PIC XXXX   VALUE
025500     "4.2 ".
025600   02  FILLER                        PIC X(28)  VALUE
025700            " COPY - NOT FOR DISTRIBUTION".
025800   02  FILLER                        PIC X(41)  VALUE SPACE.
025900
026000 01  CCVS-H-2B.
026100   02  FILLER                        PIC X(15)  VALUE
026200            "TEST RESULT OF ".
026300   02  TEST-ID                       PIC X(9).
026400   02  FILLER                        PIC X(4)   VALUE
026500            " IN ".
026600   02  FILLER                        PIC X(12)  VALUE
026700     " HIGH       ".
026800   02  FILLER                        PIC X(22)  VALUE
026900            " LEVEL VALIDATION FOR ".
027000   02  FILLER                        PIC X(58)  VALUE
027100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027200 01  CCVS-H-3.
027300     02  FILLER                      PIC X(34)  VALUE
027400            " FOR OFFICIAL USE ONLY    ".
027500     02  FILLER                      PIC X(58)  VALUE
027600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
027700     02  FILLER                      PIC X(28)  VALUE
027800            "  COPYRIGHT   1985 ".
027900 01  CCVS-E-1.
028000     02 FILLER                       PIC X(52)  VALUE SPACE.
028100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
028200     02 ID-AGAIN                     PIC X(9).
028300     02 FILLER                       PIC X(45)  VALUE SPACES.
028400 01  CCVS-E-2.
028500     02  FILLER                      PIC X(31)  VALUE SPACE.
028600     02  FILLER                      PIC X(21)  VALUE SPACE.
028700     02 CCVS-E-2-2.
028800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
028900         03 FILLER                   PIC X      VALUE SPACE.
029000         03 ENDER-DESC               PIC X(44)  VALUE
029100            "ERRORS ENCOUNTERED".
029200 01  CCVS-E-3.
029300     02  FILLER                      PIC X(22)  VALUE
029400            " FOR OFFICIAL USE ONLY".
029500     02  FILLER                      PIC X(12)  VALUE SPACE.
029600     02  FILLER                      PIC X(58)  VALUE
029700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029800     02  FILLER                      PIC X(13)  VALUE SPACE.
029900     02 FILLER                       PIC X(15)  VALUE
030000             " COPYRIGHT 1985".
030100 01  CCVS-E-4.
030200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
030300     02 FILLER                       PIC X(4)   VALUE " OF ".
030400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
030500     02 FILLER                       PIC X(40)  VALUE
030600      "  TESTS WERE EXECUTED SUCCESSFULLY".
030700 01  XXINFO.
030800     02 FILLER                       PIC X(19)  VALUE
030900            "*** INFORMATION ***".
031000     02 INFO-TEXT.
031100       04 FILLER                     PIC X(8)   VALUE SPACE.
031200       04 XXCOMPUTED                 PIC X(20).
031300       04 FILLER                     PIC X(5)   VALUE SPACE.
031400       04 XXCORRECT                  PIC X(20).
031500     02 INF-ANSI-REFERENCE           PIC X(48).
031600 01  HYPHEN-LINE.
031700     02 FILLER  PIC IS X VALUE IS SPACE.
031800     02 FILLER  PIC IS X(65)    VALUE IS "************************
031900-    "*****************************************".
032000     02 FILLER  PIC IS X(54)    VALUE IS "************************
032100-    "******************************".
032200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
032300     "NC109M".
032400 PROCEDURE DIVISION.
032500 CCVS1 SECTION.
032600 OPEN-FILES.
032700     OPEN     OUTPUT PRINT-FILE.
032800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
032900     MOVE    SPACE TO TEST-RESULTS.
033000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
033100     GO TO CCVS1-EXIT.
033200 CLOSE-FILES.
033300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
033400 TERMINATE-CCVS.
033500S    EXIT PROGRAM.
033600STERMINATE-CALL.
033700     STOP     RUN.
033800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
033900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
034000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
034100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
034200     MOVE "****TEST DELETED****" TO RE-MARK.
034300 PRINT-DETAIL.
034400     IF REC-CT NOT EQUAL TO ZERO
034500             MOVE "." TO PARDOT-X
034600             MOVE REC-CT TO DOTVALUE.
034700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
034800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
034900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
035000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
035100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
035200     MOVE SPACE TO CORRECT-X.
035300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
035400     MOVE     SPACE TO RE-MARK.
035500 HEAD-ROUTINE.
035600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
036000 COLUMN-NAMES-ROUTINE.
036100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
036400 END-ROUTINE.
036500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
036600 END-RTN-EXIT.
036700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036800 END-ROUTINE-1.
036900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
037000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
037100      ADD PASS-COUNTER TO ERROR-HOLD.
037200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
037300      MOVE PASS-COUNTER TO CCVS-E-4-1.
037400      MOVE ERROR-HOLD TO CCVS-E-4-2.
037500      MOVE CCVS-E-4 TO CCVS-E-2-2.
037600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
037700  END-ROUTINE-12.
037800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
037900     IF       ERROR-COUNTER IS EQUAL TO ZERO
038000         MOVE "NO " TO ERROR-TOTAL
038100         ELSE
038200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
038300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
038400     PERFORM WRITE-LINE.
038500 END-ROUTINE-13.
038600     IF DELETE-COUNTER IS EQUAL TO ZERO
038700         MOVE "NO " TO ERROR-TOTAL  ELSE
038800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
038900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
039000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039100      IF   INSPECT-COUNTER EQUAL TO ZERO
039200          MOVE "NO " TO ERROR-TOTAL
039300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
039400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
039500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039700 WRITE-LINE.
039800     ADD 1 TO RECORD-COUNT.
039900Y    IF RECORD-COUNT GREATER 42
040000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
040100Y        MOVE SPACE TO DUMMY-RECORD
040200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
040300Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
040400Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
040500Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
040600Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
040700Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
040800Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
040900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
041000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
041100Y        MOVE ZERO TO RECORD-COUNT.
041200     PERFORM WRT-LN.
041300 WRT-LN.
041400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
041500     MOVE SPACE TO DUMMY-RECORD.
041600 BLANK-LINE-PRINT.
041700     PERFORM WRT-LN.
041800 FAIL-ROUTINE.
041900     IF     COMPUTED-X NOT EQUAL TO SPACE
042000            GO TO FAIL-ROUTINE-WRITE.
042100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
042200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
042300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
042400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042500     MOVE   SPACES TO INF-ANSI-REFERENCE.
042600     GO TO  FAIL-ROUTINE-EX.
042700 FAIL-ROUTINE-WRITE.
042800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
042900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
043000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
043100     MOVE   SPACES TO COR-ANSI-REFERENCE.
043200 FAIL-ROUTINE-EX. EXIT.
043300 BAIL-OUT.
043400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
043500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
043600 BAIL-OUT-WRITE.
043700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
043800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
043900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044000     MOVE   SPACES TO INF-ANSI-REFERENCE.
044100 BAIL-OUT-EX. EXIT.
044200 CCVS1-EXIT.
044300     EXIT.
044400 SECT-NC109M-001 SECTION.
044500 ACC-INIT-GF-1.
044600     MOVE   "ACCEPT" TO FEATURE.
044700     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
044800     MOVE    SPACES TO ACCEPT-D1.
044900 ACC-TEST-GF-1.
045000     MOVE    "ACC-TEST-GF-1" TO PAR-NAME.
045100     ACCEPT   ACCEPT-D1.
045200     IF       ACCEPT-D1 EQUAL TO ACCEPT-D2
045300              PERFORM PASS GO TO ACC-WRITE-GF-1.
045400*        NOTE ACCEPT ALPHABETIC LITERAL TO ALPHANUMERIC FIELD.
045500     GO TO   ACC-FAIL-GF-1.
045600 ACC-DELETE-GF-1.
045700     MOVE     "ACC-TEST-GF-1" TO PAR-NAME.
045800     PERFORM  DE-LETE.
045900     GO       TO ACC-WRITE-GF-1.
046000 ACC-FAIL-GF-1.
046100     PERFORM  FAIL.
046200     MOVE     ACCEPT-D1-A TO COMPUTED-A.
046300     MOVE     "ABCDEFGHIJKLMNOPQRST" TO CORRECT-A.
046400     PERFORM  PRINT-DETAIL.
046500     MOVE     ACCEPT-D1-B TO COMPUTED-A.
046600     MOVE     "UVWXY Z" TO CORRECT-A.
046700     MOVE     "LAST 7 OF 27-CHAR FIELD" TO RE-MARK.
046800 ACC-WRITE-GF-1.
046900     PERFORM  PRINT-DETAIL.
047000 ACC-INIT-GF-2.
047100     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
047200     MOVE     ZEROES TO ACCEPT-D3.
047300 ACC-TEST-GF-2.
047400     ACCEPT   ACCEPT-D3.
047500     IF       ACCEPT-D3  EQUAL TO ACCEPT-D4
047600              PERFORM PASS GO TO ACC-WRITE-GF-2.
047700*        NOTE ACCEPT NUMERIC LITERAL TO NUMERIC FIELD SAME LENGTH.
047800     GO       TO ACC-FAIL-GF-2.
047900 ACC-DELETE-GF-2.
048000     PERFORM  DE-LETE.
048100     GO       TO ACC-WRITE-GF-2.
048200 ACC-FAIL-GF-2.
048300     MOVE     ACCEPT-D3  TO COMPUTED-18V0.
048400     MOVE     ACCEPT-D4  TO CORRECT-18V0.
048500     PERFORM  FAIL.
048600 ACC-WRITE-GF-2.
048700     MOVE     "ACC-TEST-GF-2 " TO PAR-NAME.
048800     PERFORM  PRINT-DETAIL.
048900 ACC-INIT-GF-3.
049000     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
049100     MOVE     SPACES TO ACCEPT-D5.
049200 ACC-TEST-GF-3.
049300     ACCEPT   ACCEPT-D5.
049400     IF       ACCEPT-D5  EQUAL TO ACCEPT-D6
049500              PERFORM PASS GO TO ACC-WRITE-GF-3.
049600*        NOTE ACCEPT SPECIAL CHARACTERS.
049700     GO       TO ACC-FAIL-GF-3.
049800 ACC-DELETE-GF-3.
049900     PERFORM  DE-LETE.
050000     GO       TO ACC-WRITE-GF-3.
050100 ACC-FAIL-GF-3.
050200     MOVE     ACCEPT-D5  TO COMPUTED-A.
050300     MOVE     ACCEPT-D6  TO CORRECT-A.
050400     PERFORM  FAIL.
050500 ACC-WRITE-GF-3.
050600     MOVE     "ACC-TEST-GF-3 " TO PAR-NAME.
050700     PERFORM  PRINT-DETAIL.
050800 ACC-INIT-GF-4.
050900     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
051000     MOVE     SPACES TO ACCEPT-D7.
051100 ACC-TEST-GF-4.
051200     ACCEPT   ACCEPT-D7.
051300     IF       ACCEPT-D7  EQUAL TO ACCEPT-D8
051400              PERFORM PASS GO TO ACC-WRITE-GF-4.
051500*        NOTE ACCEPT HIGH-VALUE.
051600*        NOTE CHANGED TO ACCEPT AN ALPHANUMERIC 9.
051700     GO       TO ACC-FAIL-GF-4.
051800 ACC-DELETE-GF-4.
051900     PERFORM  DE-LETE.
052000     GO       TO ACC-WRITE-GF-4.
052100 ACC-FAIL-GF-4.
052200     MOVE     ACCEPT-D7  TO COMPUTED-A.
052300     MOVE     ACCEPT-D8  TO CORRECT-A.
052400     PERFORM  FAIL.
052500 ACC-WRITE-GF-4.
052600     MOVE     "ACC-TEST-GF-4 " TO PAR-NAME.
052700     PERFORM  PRINT-DETAIL.
052800 ACC-INIT-GF-5.
052900     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
053000     MOVE     SPACES TO ACCEPT-D9.
053100 ACC-TEST-GF-5.
053200     ACCEPT   ACCEPT-D9.
053300     IF       ACCEPT-D9  EQUAL TO ACCEPT-D10
053400              PERFORM PASS GO TO ACC-WRITE-GF-5.
053500*        NOTE CHANGED TO ACCEPT AN ALPHANUMERIC 0.
053600*        NOTE ACCEPT LOW-VALUE.
053700     GO       TO ACC-FAIL-GF-5.
053800 ACC-DELETE-GF-5.
053900     PERFORM  DE-LETE.
054000     GO       TO ACC-WRITE-GF-5.
054100 ACC-FAIL-GF-5.
054200     MOVE     ACCEPT-D9  TO COMPUTED-A.
054300     MOVE     ACCEPT-D10 TO CORRECT-A.
054400     PERFORM  FAIL.
054500 ACC-WRITE-GF-5.
054600     MOVE     "ACC-TEST-GF-5 " TO PAR-NAME.
054700     PERFORM  PRINT-DETAIL.
054800 ACC-INIT-GF-6.
054900     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
055000     MOVE     SPACES TO ACCEPT-D11.
055100 ACC-TEST-GF-6.
055200     ACCEPT   ACCEPT-D11.
055300     IF       ACCEPT-D11 EQUAL TO ACCEPT-D12
055400              PERFORM PASS GO TO ACC-WRITE-GF-6.
055500*        NOTE ACCEPT ALPHABETIC LITERAL TO ALPHABETIC FIELD.
055600     GO       TO ACC-FAIL-GF-6.
055700 ACC-DELETE-GF-6.
055800     PERFORM  DE-LETE.
055900     GO       TO ACC-WRITE-GF-6.
056000 ACC-FAIL-GF-6.
056100     MOVE     ACCEPT-D11 TO COMPUTED-A.
056200     MOVE     ACCEPT-D12 TO CORRECT-A.
056300     PERFORM  FAIL.
056400 ACC-WRITE-GF-6.
056500     MOVE     "ACC-TEST-GF-6 " TO PAR-NAME.
056600     PERFORM  PRINT-DETAIL.
056700 ACC-INIT-GF-7.
056800     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
056900     MOVE     ZEROES TO ACCEPT-D13.
057000 ACC-TEST-GF-7.
057100     ACCEPT   ACCEPT-D13.
057200     IF       ACCEPT-D13 EQUAL TO ACCEPT-D14
057300              PERFORM PASS GO TO ACC-WRITE-GF-7.
057400*        NOTE ACCEPT NUMERIC LITERAL TO NUMERIC FIELD OF DIFFERENT
057500*             LENGTH.
057600     GO       TO ACC-FAIL-GF-7.
057700 ACC-DELETE-GF-7.
057800     PERFORM  DE-LETE.
057900     GO       TO ACC-WRITE-GF-7.
058000 ACC-FAIL-GF-7.
058100     MOVE     ACCEPT-D13 TO COMPUTED-A.
058200     MOVE     ACCEPT-D14 TO CORRECT-A.
058300     PERFORM  FAIL.
058400 ACC-WRITE-GF-7.
058500     MOVE     "ACC-TEST-GF-7 " TO PAR-NAME.
058600     PERFORM  PRINT-DETAIL.
058700 ACC-INIT-GF-8.
058800     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
058900     MOVE     ZEROES TO ACCEPT-D15.
059000 ACC-TEST-GF-8.
059100     ACCEPT   ACCEPT-D15.
059200     IF       ACCEPT-D15 EQUAL TO ACCEPT-D16
059300              PERFORM PASS GO TO ACC-WRITE-GF-8.
059400*        NOTE ACCEPT SINGLE SPACE.
059500     GO       TO ACC-FAIL-GF-8.
059600 ACC-DELETE-GF-8.
059700     PERFORM  DE-LETE.
059800     GO       TO ACC-WRITE-GF-8.
059900 ACC-FAIL-GF-8.
060000     PERFORM  FAIL.
060100     MOVE     ACCEPT-D15 TO COMPUTED-A.
060200     MOVE     "      (SPACES)" TO CORRECT-A.
060300 ACC-WRITE-GF-8.
060400     MOVE     "ACC-TEST-GF-8" TO PAR-NAME.
060500     PERFORM  PRINT-DETAIL.
060600 ACC-INIT-GF-9.
060700     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
060800     MOVE     ZEROES TO ACCEPT-D17.
060900 ACC-TEST-GF-9.
061000     ACCEPT   ACCEPT-D17.
061100     IF       ACCEPT-D17 EQUAL TO ACCEPT-D18
061200              PERFORM PASS GO TO ACC-WRITE-GF-9.
061300*        NOTE ACCEPT A QUOTE.
061400     GO       TO ACC-FAIL-GF-9.
061500 ACC-DELETE-GF-9.
061600     PERFORM  DE-LETE.
061700     GO       TO ACC-WRITE-GF-9.
061800 ACC-FAIL-GF-9.
061900     PERFORM  FAIL.
062000     MOVE     ACCEPT-D17 TO COMPUTED-A.
062100     MOVE     ACCEPT-D18 TO CORRECT-A.
062200 ACC-WRITE-GF-9.
062300     MOVE     "ACC-TEST-GF-9" TO PAR-NAME.
062400     PERFORM  PRINT-DETAIL.
062500 ACC-INIT-GF-10.
062600     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
062700     MOVE     "............" TO ACCEPT-D21.
062800 ACC-TEST-GF-10.
062900     ACCEPT   TAB-ACCEPT (2).
063000     IF       ACCEPT-D21 EQUAL TO ACCEPT-D22
063100              PERFORM PASS GO TO ACC-WRITE-GF-10.
063200*        NOTE ACCEPT TO SUBSCRIPTED AREA.
063300     GO       TO ACC-FAIL-GF-10.
063400 ACC-DELETE-GF-10.
063500     PERFORM  DE-LETE.
063600     GO       TO ACC-WRITE-GF-10.
063700 ACC-FAIL-GF-10.
063800     PERFORM  FAIL.
063900     MOVE     ACCEPT-D21 TO COMPUTED-A.
064000     MOVE     ACCEPT-D22 TO CORRECT-A.
064100 ACC-WRITE-GF-10.
064200     MOVE     "ACC-TEST-GF-10" TO PAR-NAME.
064300     PERFORM  PRINT-DETAIL.
064400 ACC-INIT-GF-11.
064500     MOVE   "V1-71 6.5.4 GR1-5" TO ANSI-REFERENCE.
064600     MOVE    SPACES TO X80-CHARACTER-FIELD.
064700 ACC-TEST-GF-11.
064800     ACCEPT X80-CHARACTER-FIELD.
064900     MOVE     "ACC-TEST-GF-11" TO PAR-NAME.
065000     IF       X80-CHARACTER-FIELD EQUAL TO ACCEPT-RESULTS
065100              PERFORM PASS GO TO ACC-WRITE-GF-11.
065200*        NOTE ACCEPT 80-CHARACTER LITERAL.
065300     GO       TO ACC-FAIL-GF-11.
065400 ACC-DELETE-GF-11.
065500     PERFORM  DE-LETE.
065600     MOVE     "ACC-TEST-GF-11" TO PAR-NAME.
065700     GO       TO ACC-WRITE-GF-11.
065800 ACC-FAIL-GF-11.
065900     MOVE     X80-CHARACTER-FIELD TO CHARACTER-BREAKDOWN-R.
066000     PERFORM  FAIL.
066100     MOVE     ACCEPT-RESULTS TO CHARACTER-BREAKDOWN-S.
066200     MOVE      FIRST-20R TO COMPUTED-A.
066300     MOVE      FIRST-20S TO CORRECT-A.
066400     PERFORM  PRINT-DETAIL.
066500     MOVE     SECOND-20R TO COMPUTED-A.
066600     MOVE     SECOND-20S TO CORRECT-A.
066700     PERFORM  PRINT-DETAIL.
066800     MOVE      THIRD-20R TO COMPUTED-A.
066900     MOVE      THIRD-20S TO CORRECT-A.
067000     PERFORM  PRINT-DETAIL.
067100     MOVE     FOURTH-20R TO COMPUTED-A.
067200     MOVE     FOURTH-20S TO CORRECT-A.
067300     MOVE     "LAST 20 OF 80-CHAR FIELD" TO RE-MARK.
067400 ACC-WRITE-GF-11.
067500     PERFORM PRINT-DETAIL.
067600 DISP-INIT-GF-1.
067700     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
067800     PERFORM BLANK-LINE-PRINT.
067900     MOVE   "DISPLAY TESTS" TO FEATURE.
068000     MOVE   "SEE NOTE IN DISP-INIT-GF-1" TO RE-MARK.
068100     PERFORM PRINT-DETAIL.
068200     PERFORM BLANK-LINE-PRINT 4 TIMES.
068300     MOVE     "DISPLAY" TO FEATURE.
068400*        NOTE FOR THE SAKE OF CONVENIENCE IN READING THE OUTPUT,
068500*             THE DISPLAY TESTS ARE CONSTRUCTED ON THE ASSUMPTION
068600*             THAT THE DISPLAYED OUTPUT WILL BE PRINTED ALONG
068700*             WITH THE OUTPUT FROM THE WRITE STATEMENTS ---
068800*             HOWEVER IT IS NOT CONSIDERED NONSTANDARD IF THE
068900*             DISPLAYED DATA APPEARS ELSEWHERE IN THE LISTING, OR
069000*             FOR THAT MATTER, ON SOME OTHER DEVICE.
069100 DISP-TEST-GF-1.
069200     MOVE     "DISP-TEST-GF-1 " TO PAR-NAME.
069300     PERFORM  DISPLAY-SUPPORT-1.
069400     DISPLAY  DISPLAY-A.
069500*        NOTE GROUP OF ALPHABETIC DATA ITEMS.
069600     MOVE     DISPLAY-A TO DIS-PLAYER.
069700     PERFORM  DISPLAY-SUPPORT-2.
069800     GO       TO DISP-WRITE-GF-1.
069900 DISP-DELETE-GF-1.
070000     PERFORM  DE-LETE.
070100 DISP-WRITE-GF-1.
070200     MOVE     "DISP-TEST-GF-1 " TO PAR-NAME.
070300     PERFORM  PRINT-DETAIL.
070400 DISP-INIT-GF-2.
070500     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
070600     MOVE     "DISP-TEST-GF-2 " TO PAR-NAME.
070700 DISP-TEST-GF-2.
070800     PERFORM  DISPLAY-SUPPORT-1.
070900     DISPLAY  "ALPHABETIC LITERAL".
071000*        NOTE ALPHABETIC LITERAL.
071100     MOVE     "ALPHABETIC LITERAL" TO DIS-PLAYER.
071200     PERFORM  DISPLAY-SUPPORT-2.
071300     GO       TO DISP-WRITE-GF-2.
071400 DISP-DELETE-GF-2.
071500     PERFORM  DE-LETE.
071600 DISP-WRITE-GF-2.
071700     MOVE     "DISP-TEST-GF-2 " TO PAR-NAME.
071800     PERFORM  PRINT-DETAIL.
071900 DISP-INIT-GF-3.
072000     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
072100     MOVE     "DISP-TEST-GF-3" TO PAR-NAME.
072200     MOVE     0123456789 TO DISPLAY-N.
072300 DISP-TEST-GF-3.
072400     PERFORM  DISPLAY-SUPPORT-1.
072500     DISPLAY  DISPLAY-N.
072600*        NOTE NUMERIC DATA ITEM.
072700     MOVE     DISPLAY-N TO DIS-PLAYER.
072800     PERFORM  DISPLAY-SUPPORT-2.
072900     GO       TO DISP-WRITE-GF-3.
073000 DISP-DELETE-GF-3.
073100     PERFORM  DE-LETE.
073200 DISP-WRITE-GF-3.
073300     MOVE     "DISP-TEST-GF-3 " TO PAR-NAME.
073400     PERFORM  PRINT-DETAIL.
073500 DISP-INIT-GF-4.
073600     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
073700     MOVE     "DISP-TEST-GF-4" TO PAR-NAME.
073800 DISP-TEST-GF-4.
073900     PERFORM  DISPLAY-SUPPORT-1.
074000     DISPLAY  9876543210.
074100*        NOTE NUMERIC LITERAL.
074200     MOVE     9876543210 TO DIS-PLAYER.
074300     PERFORM  DISPLAY-SUPPORT-2.
074400     GO       TO DISP-WRITE-GF-4.
074500 DISP-DELETE-GF-4.
074600     PERFORM  DE-LETE.
074700 DISP-WRITE-GF-4.
074800     MOVE     "DISP-TEST-GF-4 " TO PAR-NAME.
074900     PERFORM  PRINT-DETAIL.
075000 DISP-INIT-GF-5.
075100     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
075200     MOVE   "DISP-TEST-GF-5" TO PAR-NAME.
075300     MOVE   "A1B2C3D4E5" TO DISPLAY-X.
075400 DISP-TEST-GF-5.
075500     PERFORM  DISPLAY-SUPPORT-1.
075600     DISPLAY  DISPLAY-X.
075700*        NOTE ALPHANUMERIC DATA ITEM.
075800     MOVE     DISPLAY-X TO DIS-PLAYER.
075900     PERFORM  DISPLAY-SUPPORT-2.
076000     GO       TO DISP-WRITE-GF-5.
076100 DISP-DELETE-GF-5.
076200     PERFORM  DE-LETE.
076300 DISP-WRITE-GF-5.
076400     MOVE     "DISP-TEST-GF-5 " TO PAR-NAME.
076500     PERFORM  PRINT-DETAIL.
076600 DISP-INIT-GF-6.
076700     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
076800     MOVE   "DISP-TEST-GF-6" TO PAR-NAME.
076900 DISP-TEST-GF-6.
077000     PERFORM  DISPLAY-SUPPORT-1.
077100     DISPLAY  "12345 ///// ALPHANUMERIC LITERAL".
077200*        NOTE ALPHANUMERIC LITERAL.
077300     MOVE     "12345 ///// ALPHANUMERIC LITERAL" TO DIS-PLAYER.
077400     PERFORM  DISPLAY-SUPPORT-2.
077500     GO       TO DISP-WRITE-GF-6.
077600 DISP-DELETE-GF-6.
077700     PERFORM  DE-LETE.
077800 DISP-WRITE-GF-6.
077900     MOVE     "DISP-TEST-GF-6 " TO PAR-NAME.
078000     PERFORM  PRINT-DETAIL.
078100 DISP-INIT-GF-7.
078200     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
078300     MOVE   "DISP-TEST-GF-7" TO PAR-NAME.
078400     MOVE   "ALPHABETIC" TO DISPLAY-A.
078500     MOVE    0123456789  TO DISPLAY-N.
078600     MOVE   "A1B2C3D4E5" TO DISPLAY-X.
078700 DISP-TEST-GF-7.
078800     MOVE     "DISP-TEST-GF-7 " TO PAR-NAME.
078900     PERFORM  DISPLAY-SUPPORT-1.
079000     DISPLAY  DISPLAY-A DISPLAY-N DISPLAY-X " SERIES".
079100*        NOTE SERIES OF THREE DATA ITEMS AND A LITERAL.
079200     MOVE     "ALPHABETIC0123456789A1B2C3D4E5 SERIES"
079300              TO DIS-PLAYER.
079400     PERFORM  DISPLAY-SUPPORT-2.
079500     GO       TO DISP-WRITE-GF-7.
079600 DISP-DELETE-GF-7.
079700     PERFORM  DE-LETE.
079800 DISP-WRITE-GF-7.
079900     MOVE     "DISP-TEST-GF-7 " TO PAR-NAME.
080000     PERFORM  PRINT-DETAIL.
080100 DISP-INIT-GF-8.
080200     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
080300     MOVE     "DISP-TEST-GF-8 " TO PAR-NAME.
080400 DISP-TEST-GF-8.
080500     PERFORM  DISPLAY-SUPPORT-1.
080600     DISPLAY  ZERO SPACE QUOTE.
080700*        NOTE SERIES OF FIGURATIVE CONSTANTS --- ONLY ONE OCCUR-
080800*             RANCE OF EACH CHARACTER SHOULD APPEAR.
080900     MOVE     ZERO-SPACE-QUOTE TO DIS-PLAYER.
081000     PERFORM  DISPLAY-SUPPORT-2.
081100     GO       TO DISP-WRITE-GF-8.
081200 DISP-DELETE-GF-8.
081300     PERFORM  DE-LETE.
081400 DISP-WRITE-GF-8.
081500     MOVE     "DISP-TEST-GF-8 " TO PAR-NAME.
081600     PERFORM  PRINT-DETAIL.
081700 DISP-INIT-GF-9.
081800     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
081900     MOVE     "DISP-TEST-GF-9 " TO PAR-NAME.
082000     MOVE     "REDEFINE-INFO" TO DISPLAY-B.
082100 DISP-TEST-GF-9.
082200     PERFORM  DISPLAY-SUPPORT-1.
082300     DISPLAY  DISPLAY-C.
082400*        NOTE DISPLAY DATA ITEM WHICH CONTAINS A REDEFINES CLAUSE.
082500     MOVE     "REDEFINE-INFO" TO DIS-PLAYER.
082600     PERFORM  DISPLAY-SUPPORT-2.
082700     GO       TO DISP-WRITE-GF-9.
082800 DISP-DELETE-GF-9.
082900     PERFORM  DE-LETE.
083000 DISP-WRITE-GF-9.
083100     MOVE     "DISP-TEST-GF-9 " TO PAR-NAME.
083200     PERFORM  PRINT-DETAIL.
083300 DISP-INIT-GF-10.
083400     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
083500     MOVE     "DISP-TEST-GF-10 " TO PAR-NAME.
083600 DISP-TEST-GF-10.
083700     PERFORM  DISPLAY-SUPPORT-1.
083800     DISPLAY  DISPLAY-F.
083900*        NOTE 200-CHARACTER GROUP ITEM --- ACTUAL NUMBER OF
084000*             CHARACTERS DISPLAYED DEPENDS UPON THE SYSTEM.
084100     MOVE     DISPLAY-G TO DIS-PLAYER.
084200     MOVE     1 TO DISPLAY-SWITCH.
084300*        NOTE THE "CORRECT" RESULT IS WRITTEN AS TWO 100-CHARACTER
084400*             LINES, BUT THE DIVISION OF THE DISPLAYED "COMPUTED"
084500*             DATA DEPENDS UPON THE SYSTEM.
084600     PERFORM  DISPLAY-SUPPORT-2.
084700     GO       TO DISP-WRITE-GF-10.
084800 DISP-DELETE-GF-10.
084900     PERFORM  DE-LETE.
085000 DISP-WRITE-GF-10.
085100     MOVE     "DISP-TEST-GF-10 " TO PAR-NAME.
085200     PERFORM  PRINT-DETAIL.
085300 DISP-INIT-GF-11.
085400     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
085500     MOVE     "DISP-TEST-GF-11 " TO PAR-NAME.
085600     MOVE   "ABCDEFGHIJKLMNOPQRSTU" TO TAB-VALUE.
085700 DISP-TEST-GF-11.
085800     PERFORM  DISPLAY-SUPPORT-1.
085900     DISPLAY  X21 X20 X19 X18 X17 X16 X15 X14 X13 X12 X11 X10 X9
086000              X8  X7  X6  X5  X4  X3  X2  X1.
086100*        NOTE 21 ELEMENTARY ALPHABETIC DATA ITEMS.
086200     MOVE     "UTSRQPONMLKJIHGFEDCBA" TO DIS-PLAYER.
086300     PERFORM  DISPLAY-SUPPORT-2.
086400     GO       TO DISP-WRITE-GF-11.
086500 DISP-DELETE-GF-11.
086600     PERFORM  DE-LETE.
086700 DISP-WRITE-GF-11.
086800     MOVE     "DISP-TEST-GF-11 " TO PAR-NAME.
086900     PERFORM  PRINT-DETAIL.
087000 DISP-INIT-GF-12.
087100     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
087200     MOVE     "DISP-TEST-GF-12 " TO PAR-NAME.
087300     MOVE   "ABCDEFGHIJKLMNOPQRSTU" TO TAB-VALUE.
087400 DISP-TEST-GF-12.
087500     PERFORM  DISPLAY-SUPPORT-1.
087600     DISPLAY  XTAB (1)  XTAB (2)  XTAB (3)  XTAB (4)
087700              XTAB (5)  XTAB (6)  XTAB (7)  XTAB (8)
087800              XTAB (9)  XTAB (10)  XTAB (11)  XTAB (12)
087900              XTAB (13)  XTAB (14)  XTAB (15)  XTAB (16)
088000              XTAB (17)  XTAB (18)  XTAB (19)  XTAB (20)
088100              XTAB (21).
088200*        NOTE 21 SUBSCRIPTED DATA ITEMS.
088300     MOVE     "ABCDEFGHIJKLMNOPQRSTU" TO DIS-PLAYER.
088400     PERFORM  DISPLAY-SUPPORT-2.
088500     GO       TO DISP-WRITE-GF-12.
088600 DISP-DELETE-GF-12.
088700     PERFORM  DE-LETE.
088800 DISP-WRITE-GF-12.
088900     MOVE     "DISP-TEST-GF-12 " TO PAR-NAME.
089000     PERFORM  PRINT-DETAIL.
089100 DISP-INIT-GF-13.
089200     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
089300     MOVE     "DISP-TEST-GF-13 " TO PAR-NAME.
089400 DISP-TEST-GF-13.
089500     PERFORM  DISPLAY-SUPPORT-1.
089600     DISPLAY  "QUOTE " QUOTE " ASTERISK " "*" " NUMERIC LITERALS "
089700              21 SPACE  35  I-DATA PIECE-A (1) PIECE-A (2) PIECE-A
089800              (3) PIECE-A (4) PIECE-A (5) PIECE-N (1) PIECE-N (2)
089900              PIECE-N (3) PIECE-N (4) PIECE-N (5) A1 A2.
090000     MOVE       "QUOTE   ASTERISK * NUMERIC LITERALS 21 35 IDENTIF
090100-    "IER DATA A B C D E 0102030405 (TOTAL 21 OPERANDS) END OF DAT
090200-    "A" TO DIS-PLAYER.
090300*        NOTE 21 MIXED IDENTIFIERS AND LITERALS.
090400     MOVE    QUOTE TO QUOTE-SLOT.
090500     PERFORM DISPLAY-SUPPORT-2.
090600     GO      TO DISP-WRITE-GF-13.
090700 DISP-DELETE-GF-13.
090800     PERFORM DE-LETE.
090900 DISP-WRITE-GF-13.
091000     MOVE   "DISP-TEST-GF-13 " TO PAR-NAME.
091100     PERFORM PRINT-DETAIL.
091200 DISP-INIT-GF-14.
091300*    ===---> "ALL" LITERAL  <--===
091400     MOVE   "V1-78 6.10.4" TO ANSI-REFERENCE.
091500     MOVE     "DISP-TEST-GF-14 GR3 " TO PAR-NAME.
091600 DISP-TEST-GF-14.
091700     PERFORM  DISPLAY-SUPPORT-1.
091800     DISPLAY  ALL "ABCD"
091900*        NOTE "ALL" LITERAL.
092000     MOVE     "ABCD" TO DIS-PLAYER.
092100     PERFORM  DISPLAY-SUPPORT-2.
092200     GO       TO DISP-WRITE-GF-14.
092300 DISP-DELETE-GF-14.
092400     PERFORM  DE-LETE.
092500 DISP-WRITE-GF-14.
092600     MOVE     "DISP-TEST-GF-14 " TO PAR-NAME.
092700     PERFORM  PRINT-DETAIL.
092800     GO TO   CCVS-EXIT.
092900 DISPLAY-SUPPORT-1.
093000     PERFORM  BLANK-LINE-PRINT.
093100     MOVE     SPACE TO P-OR-F.
093200     MOVE     SEE-BELOW TO COMPUTED-A.
093300     MOVE     SEE-BELOW TO CORRECT-A.
093400     PERFORM  PRINT-DETAIL.
093500     MOVE     SPACE TO FEATURE.
093600     DISPLAY  TEST-RESULTS.
093700 DISPLAY-SUPPORT-2.
093800     MOVE     SPACE TO TEST-RESULTS.
093900     DISPLAY  TEST-RESULTS.
094000     MOVE     SPACE TO TEST-RESULTS.
094100     PERFORM  PRINT-DETAIL.
094200     MOVE     CORRECT-FOLLOWS TO RE-MARK.
094300     PERFORM  PRINT-DETAIL.
094400     PERFORM  BLANK-LINE-PRINT.
094500     MOVE     DISPLAY-WRITER TO TEST-RESULTS.
094600     PERFORM  PRINT-DETAIL.
094700     IF       DISPLAY-SWITCH EQUAL TO 1
094800              MOVE ZERO TO DISPLAY-SWITCH
094900              MOVE DISPLAY-H TO DIS-PLAYER
095000              MOVE DISPLAY-WRITER TO TEST-RESULTS
095100              PERFORM PRINT-DETAIL.
095200     MOVE     SPACE TO TEST-RESULTS.
095300     PERFORM  BLANK-LINE-PRINT.
095400     IF       DISPLAY-SWITCH EQUAL TO 1
095500              MOVE "SEE NOTE IN DISP-TEST-GF-10" TO RE-MARK.
095600              PERFORM PRINT-DETAIL.
095700     MOVE     "DISPLAY" TO FEATURE.
095800     MOVE     SEE-ABOVE TO COMPUTED-A.
095900     MOVE     SEE-ABOVE TO CORRECT-A.
096000     MOVE     END-CORRECT TO RE-MARK.
096100     MOVE    "ERRORS ENCOUNTERED" TO ENDER-DESC.
096200 CCVS-EXIT SECTION.
096300 CCVS-999999.
096400     GO TO CLOSE-FILES.
