000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC104A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC104A TESTS FORMAT 1 OF THE MOVE STATEMENT
002300*    WITH VARIOUS COMBINATIONS OF SENDING AND RECEIVING FIELDS.
002400*
002500*    (SEE ALSO NC105A).
002600*
002700
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE
004100     LABEL RECORDS
004200     XXXXX084
004300     DATA RECORD IS PRINT-REC DUMMY-RECORD.
004400 01  PRINT-REC PICTURE X(120).
004500 01  DUMMY-RECORD PICTURE X(120).
004600 WORKING-STORAGE SECTION.
004700 01  MOVE1                              PICTURE IS 9(5)
004800     VALUE IS 12345.
004900 01  MOVE2                              PICTURE IS 9(5).
005000 01  MOVE3                              PICTURE IS 99.
005100 01  MOVE4                              PICTURE IS 9(7).
005200 01  MOVE5                              PICTURE IS 99V999.
005300 01  MOVE6                              PICTURE IS V99999.
005400 01  MOVE8                              PICTURE IS 9(5)V99.
005500 01  MOVE9                              PICTURE IS 9(7)V99.
005600 01  MOVE10                             PICTURE IS $999.99.
005700 01  MOVE11                             PICTURE IS $99,999.99.
005800 01  MOVE12                             PICTURE IS $(5)9(3).
005900 01  MOVE13                             PICTURE IS *(5)9(6).
006000 01  MOVE14                             PICTURE IS +9(5).
006100 01  MOVE15                             PICTURE IS 9(5)
006200     VALUE IS 00000.
006300 01  MOVE16                             PICTURE IS 9(5)CR.
006400 01  MOVE17                             PICTURE IS $99,999.99
006500     BLANK WHEN ZERO.
006600 01  MOVE18                             PICTURE IS ZZZZZZ.
006700 01  MOVE19                             PICTURE IS X(5).
006800 01  MOVE20                             PICTURE IS X(4).
006900 01  MOVE21                             PICTURE IS X(7).
007000 01  MOVE22                             PICTURE IS XBX0XBX0X.
007100 01  MOVE23                             PICTURE IS 999V99
007200     VALUE IS 123.45.
007300 01  MOVE24                             PICTURE IS XBXXXB000XXXX.
007400 01  MOVE25                             PICTURE IS 999.
007500 01  MOVE26                             PICTURE IS 999V99.
007600 01  MOVE27                             PICTURE IS 99PP.
007700 01  MOVE29                             PICTURE IS 9999V999.
007800 01  MOVE29A VALUE IS "$123.45".
007900     02 MOVE30                          PICTURE IS $999.99.
008000 01  MOVE31                             PICTURE IS X(9).
008100 01  MOVE32                             PICTURE IS X(5)
008200     VALUE IS "ABCDE".
008300 01  MOVE33                             PICTURE IS A(5).
008400 01  MOVE34                             PICTURE IS A(7).
008500 01  MOVE35                             PICTURE IS A(3).
008600 01  MOVE35A VALUE IS "1 A05".
008700     02 MOVE36                          PICTURE IS XBA09.
008800 01  MOVE37                             PICTURE IS AAAAA
008900     VALUE IS "ABCDE".
009000 01  MOVE39                             PICTURE IS 0XXXXX0.
009100 01  MOVE47A.
009200     02 MOVE48                          PICTURE IS 9V9(17).
009300     02 MOVE49                          PICTURE IS 9(5)
009400     VALUE IS 00045.
009500     02 MOVE50                          PICTURE IS X(5)
009600     VALUE IS "12345".
009700     02 MOVE51                          PICTURE IS S9(5)
009800     VALUE IS -12345.
009900     02 MOVE52                          PICTURE IS 9(5)-.
010000 01  AN-DATANAMES.
010100     02  ANDATA1       PICTURE X     VALUE SPACE.
010200     02  ANDATA2       PICTURE XX    VALUE SPACE.
010300     02  ANDATA3       PICTURE XXX   VALUE SPACE.
010400     02  ANDATA4       PICTURE X(4)  VALUE SPACE.
010500     02  ANDATA5       PICTURE X(5)  VALUE SPACE.
010600     02  ANDATA6       PICTURE X(6)  VALUE SPACE.
010700     02  ANDATA7       PICTURE X(7)  VALUE SPACE.
010800     02  ANDATA8       PICTURE X(8)  VALUE SPACE.
010900     02  ANDATA9       PICTURE X(9)  VALUE SPACE.
011000     02  ANDATA10      PICTURE X(10) VALUE SPACE.
011100     02  ANDATA11      PICTURE X(11) VALUE SPACE.
011200     02  ANDATA12      PICTURE X(12) VALUE SPACE.
011300     02  ANDATA13      PICTURE X(13) VALUE SPACE.
011400     02  ANDATA14      PICTURE X(14) VALUE SPACE.
011500     02  ANDATA15      PICTURE X(15) VALUE SPACE.
011600     02  ANDATA16      PICTURE X(16) VALUE SPACE.
011700     02  ANDATA17      PICTURE X(17) VALUE SPACE.
011800     02  ANDATA18      PICTURE X(18) VALUE SPACE.
011900     02  ANDATA19      PICTURE X(19) VALUE SPACE.
012000     02  ANDATA20      PICTURE X(20) VALUE SPACE.
012100     02  ANDATA21      PICTURE X(120) VALUE SPACE.
012200 01  42-DATANAMES.
012300     02  DNAME1   PICTURE 9      VALUE 1        COMPUTATIONAL.
012400     02  DNAME2   PICTURE 99     VALUE 01       COMPUTATIONAL.
012500     02  DNAME3   PICTURE 999    VALUE 001      COMPUTATIONAL.
012600     02  DNAME4   PICTURE 9(4)   VALUE 0001     COMPUTATIONAL.
012700     02  DNAME5   PICTURE 9(5)   VALUE 00001    COMPUTATIONAL.
012800     02  DNAME6   PICTURE 9(6)   VALUE 000001   COMPUTATIONAL.
012900     02  DNAME7   PICTURE 9(7)   VALUE 0000001  COMPUTATIONAL.
013000     02  DNAME8   PICTURE 9(8)   VALUE 00000001 COMPUTATIONAL.
013100     02  DNAME9   PICTURE 9(9)   VALUE 000000001.
013200     02  DNAME10  PICTURE 9(10)   VALUE 0000000001.
013300     02  DNAME11  PICTURE 9(11)   VALUE 00000000001.
013400     02  DNAME12  PICTURE 9(12)   VALUE 000000000001.
013500     02  DNAME13  PICTURE 9(13)   VALUE 0000000000001.
013600     02  DNAME14  PICTURE 9(14)   VALUE 00000000000001.
013700     02  DNAME15  PICTURE 9(15)   VALUE 000000000000001.
013800     02  DNAME16  PICTURE 9(16)   VALUE 0000000000000001.
013900     02  DNAME17  PICTURE 9(17)   VALUE 00000000000000001.
014000     02  DNAME18  PICTURE 9(18)   VALUE 000000000000000001.
014100     02  DNAME19  PICTURE 9      VALUE 1.
014200     02  DNAME20  PICTURE 99     VALUE 11.
014300     02  DNAME21  PICTURE 999    VALUE 111.
014400     02  DNAME22  PICTURE 9(18)  VALUE ZERO.
014500     02  DNAME23  PICTURE 9(18)  VALUE ZERO.
014600     02  DNAME24  PICTURE 9(18)  VALUE ZERO.
014700     02  DNAME25  PICTURE 9(18)  VALUE ZERO.
014800     02  DNAME26  PICTURE 9(18)  VALUE ZERO.
014900     02  DNAME27  PICTURE 9(18)  VALUE ZERO.
015000     02  DNAME28  PICTURE 9(18)  VALUE ZERO.
015100     02  DNAME29  PICTURE 9(18)  VALUE ZERO.
015200     02  DNAME30   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
015300     02  DNAME31   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
015400     02  DNAME32   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
015500     02  DNAME33   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
015600     02  DNAME34   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
015700     02  DNAME35   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
015800     02  DNAME36   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
015900     02  DNAME37   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
016000     02  DNAME38   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
016100     02  DNAME39   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
016200     02  DNAME40   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
016300     02  DNAME41   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
016400     02  DNAME42   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
016500 01  TEST-RESULTS.
016600     02 FILLER                   PIC X      VALUE SPACE.
016700     02 FEATURE                  PIC X(20)  VALUE SPACE.
016800     02 FILLER                   PIC X      VALUE SPACE.
016900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
017000     02 FILLER                   PIC X      VALUE SPACE.
017100     02  PAR-NAME.
017200       03 FILLER                 PIC X(19)  VALUE SPACE.
017300       03  PARDOT-X              PIC X      VALUE SPACE.
017400       03 DOTVALUE               PIC 99     VALUE ZERO.
017500     02 FILLER                   PIC X(8)   VALUE SPACE.
017600     02 RE-MARK                  PIC X(61).
017700 01  TEST-COMPUTED.
017800     02 FILLER                   PIC X(30)  VALUE SPACE.
017900     02 FILLER                   PIC X(17)  VALUE
018000            "       COMPUTED=".
018100     02 COMPUTED-X.
018200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
018300     03 COMPUTED-N               REDEFINES COMPUTED-A
018400                                 PIC -9(9).9(9).
018500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
018600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
018700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
018800     03       CM-18V0 REDEFINES COMPUTED-A.
018900         04 COMPUTED-18V0                    PIC -9(18).
019000         04 FILLER                           PIC X.
019100     03 FILLER PIC X(50) VALUE SPACE.
019200 01  TEST-CORRECT.
019300     02 FILLER PIC X(30) VALUE SPACE.
019400     02 FILLER PIC X(17) VALUE "       CORRECT =".
019500     02 CORRECT-X.
019600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
019700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
019800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
019900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
020000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
020100     03      CR-18V0 REDEFINES CORRECT-A.
020200         04 CORRECT-18V0                     PIC -9(18).
020300         04 FILLER                           PIC X.
020400     03 FILLER PIC X(2) VALUE SPACE.
020500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
020600 01  CCVS-C-1.
020700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
020800-    "SS  PARAGRAPH-NAME
020900-    "       REMARKS".
021000     02 FILLER                     PIC X(20)    VALUE SPACE.
021100 01  CCVS-C-2.
021200     02 FILLER                     PIC X        VALUE SPACE.
021300     02 FILLER                     PIC X(6)     VALUE "TESTED".
021400     02 FILLER                     PIC X(15)    VALUE SPACE.
021500     02 FILLER                     PIC X(4)     VALUE "FAIL".
021600     02 FILLER                     PIC X(94)    VALUE SPACE.
021700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
021800 01  REC-CT                        PIC 99       VALUE ZERO.
021900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
022000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
022100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
022200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
022300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
022400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
022500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
022600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
022700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
022800 01  CCVS-H-1.
022900     02  FILLER                    PIC X(39)    VALUE SPACES.
023000     02  FILLER                    PIC X(42)    VALUE
023100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
023200     02  FILLER                    PIC X(39)    VALUE SPACES.
023300 01  CCVS-H-2A.
023400   02  FILLER                        PIC X(40)  VALUE SPACE.
023500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
023600   02  FILLER                        PIC XXXX   VALUE
023700     "4.2 ".
023800   02  FILLER                        PIC X(28)  VALUE
023900            " COPY - NOT FOR DISTRIBUTION".
024000   02  FILLER                        PIC X(41)  VALUE SPACE.
024100
024200 01  CCVS-H-2B.
024300   02  FILLER                        PIC X(15)  VALUE
024400            "TEST RESULT OF ".
024500   02  TEST-ID                       PIC X(9).
024600   02  FILLER                        PIC X(4)   VALUE
024700            " IN ".
024800   02  FILLER                        PIC X(12)  VALUE
024900     " HIGH       ".
025000   02  FILLER                        PIC X(22)  VALUE
025100            " LEVEL VALIDATION FOR ".
025200   02  FILLER                        PIC X(58)  VALUE
025300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025400 01  CCVS-H-3.
025500     02  FILLER                      PIC X(34)  VALUE
025600            " FOR OFFICIAL USE ONLY    ".
025700     02  FILLER                      PIC X(58)  VALUE
025800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
025900     02  FILLER                      PIC X(28)  VALUE
026000            "  COPYRIGHT   1985 ".
026100 01  CCVS-E-1.
026200     02 FILLER                       PIC X(52)  VALUE SPACE.
026300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
026400     02 ID-AGAIN                     PIC X(9).
026500     02 FILLER                       PIC X(45)  VALUE SPACES.
026600 01  CCVS-E-2.
026700     02  FILLER                      PIC X(31)  VALUE SPACE.
026800     02  FILLER                      PIC X(21)  VALUE SPACE.
026900     02 CCVS-E-2-2.
027000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
027100         03 FILLER                   PIC X      VALUE SPACE.
027200         03 ENDER-DESC               PIC X(44)  VALUE
027300            "ERRORS ENCOUNTERED".
027400 01  CCVS-E-3.
027500     02  FILLER                      PIC X(22)  VALUE
027600            " FOR OFFICIAL USE ONLY".
027700     02  FILLER                      PIC X(12)  VALUE SPACE.
027800     02  FILLER                      PIC X(58)  VALUE
027900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028000     02  FILLER                      PIC X(13)  VALUE SPACE.
028100     02 FILLER                       PIC X(15)  VALUE
028200             " COPYRIGHT 1985".
028300 01  CCVS-E-4.
028400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
028500     02 FILLER                       PIC X(4)   VALUE " OF ".
028600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
028700     02 FILLER                       PIC X(40)  VALUE
028800      "  TESTS WERE EXECUTED SUCCESSFULLY".
028900 01  XXINFO.
029000     02 FILLER                       PIC X(19)  VALUE
029100            "*** INFORMATION ***".
029200     02 INFO-TEXT.
029300       04 FILLER                     PIC X(8)   VALUE SPACE.
029400       04 XXCOMPUTED                 PIC X(20).
029500       04 FILLER                     PIC X(5)   VALUE SPACE.
029600       04 XXCORRECT                  PIC X(20).
029700     02 INF-ANSI-REFERENCE           PIC X(48).
029800 01  HYPHEN-LINE.
029900     02 FILLER  PIC IS X VALUE IS SPACE.
030000     02 FILLER  PIC IS X(65)    VALUE IS "************************
030100-    "*****************************************".
030200     02 FILLER  PIC IS X(54)    VALUE IS "************************
030300-    "******************************".
030400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
030500     "NC104A".
030600 PROCEDURE DIVISION.
030700 CCVS1 SECTION.
030800 OPEN-FILES.
030900     OPEN     OUTPUT PRINT-FILE.
031000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
031100     MOVE    SPACE TO TEST-RESULTS.
031200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
031300     GO TO CCVS1-EXIT.
031400 CLOSE-FILES.
031500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
031600 TERMINATE-CCVS.
031700S    EXIT PROGRAM.
031800STERMINATE-CALL.
031900     STOP     RUN.
032000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
032100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
032200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
032300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
032400     MOVE "****TEST DELETED****" TO RE-MARK.
032500 PRINT-DETAIL.
032600     IF REC-CT NOT EQUAL TO ZERO
032700             MOVE "." TO PARDOT-X
032800             MOVE REC-CT TO DOTVALUE.
032900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
033000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
033100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
033200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
033300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
033400     MOVE SPACE TO CORRECT-X.
033500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
033600     MOVE     SPACE TO RE-MARK.
033700 HEAD-ROUTINE.
033800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
034100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
034200 COLUMN-NAMES-ROUTINE.
034300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
034600 END-ROUTINE.
034700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
034800 END-RTN-EXIT.
034900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035000 END-ROUTINE-1.
035100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
035200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
035300      ADD PASS-COUNTER TO ERROR-HOLD.
035400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
035500      MOVE PASS-COUNTER TO CCVS-E-4-1.
035600      MOVE ERROR-HOLD TO CCVS-E-4-2.
035700      MOVE CCVS-E-4 TO CCVS-E-2-2.
035800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
035900  END-ROUTINE-12.
036000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
036100     IF       ERROR-COUNTER IS EQUAL TO ZERO
036200         MOVE "NO " TO ERROR-TOTAL
036300         ELSE
036400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
036500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
036600     PERFORM WRITE-LINE.
036700 END-ROUTINE-13.
036800     IF DELETE-COUNTER IS EQUAL TO ZERO
036900         MOVE "NO " TO ERROR-TOTAL  ELSE
037000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
037100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
037200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037300      IF   INSPECT-COUNTER EQUAL TO ZERO
037400          MOVE "NO " TO ERROR-TOTAL
037500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
037600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
037700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037900 WRITE-LINE.
038000     ADD 1 TO RECORD-COUNT.
038100Y    IF RECORD-COUNT GREATER 42
038200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
038300Y        MOVE SPACE TO DUMMY-RECORD
038400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
038500Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
038600Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
038700Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
038800Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
038900Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
039000Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
039100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
039200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
039300Y        MOVE ZERO TO RECORD-COUNT.
039400     PERFORM WRT-LN.
039500 WRT-LN.
039600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
039700     MOVE SPACE TO DUMMY-RECORD.
039800 BLANK-LINE-PRINT.
039900     PERFORM WRT-LN.
040000 FAIL-ROUTINE.
040100     IF     COMPUTED-X NOT EQUAL TO SPACE
040200            GO TO FAIL-ROUTINE-WRITE.
040300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
040400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
040500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
040600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040700     MOVE   SPACES TO INF-ANSI-REFERENCE.
040800     GO TO  FAIL-ROUTINE-EX.
040900 FAIL-ROUTINE-WRITE.
041000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
041100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
041200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
041300     MOVE   SPACES TO COR-ANSI-REFERENCE.
041400 FAIL-ROUTINE-EX. EXIT.
041500 BAIL-OUT.
041600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
041700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
041800 BAIL-OUT-WRITE.
041900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
042000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
042100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042200     MOVE   SPACES TO INF-ANSI-REFERENCE.
042300 BAIL-OUT-EX. EXIT.
042400 CCVS1-EXIT.
042500     EXIT.
042600 SECT-NC104A-001 SECTION.
042700 MOVE-INIT-F1-1.
042800     MOVE "MOVE NUMERIC INTEGER" TO FEATURE.
042900     MOVE "V1-102 6.18.2"        TO ANSI-REFERENCE.
043000     MOVE  12345 TO MOVE1.
043100 MOVE-TEST-F1-1-0.
043200     MOVE     MOVE1 TO MOVE2.
043300 MOVE-TEST-F1-1-1.
043400     IF       MOVE2 EQUAL TO 12345
043500              PERFORM PASS
043600              ELSE
043700              GO TO MOVE-FAIL-F1-1.
043800*    NOTE NI TO NI (NUMERIC INTEGRAL) MOVE, EQUAL SIZE.
043900     GO TO    MOVE-WRITE-F1-1.
044000 MOVE-DELETE-F1-1.
044100     PERFORM  DE-LETE.
044200     GO TO    MOVE-WRITE-F1-1.
044300 MOVE-FAIL-F1-1.
044400     MOVE     MOVE2 TO COMPUTED-N.
044500     MOVE     12345 TO CORRECT-N.
044600     PERFORM  FAIL.
044700 MOVE-WRITE-F1-1.
044800     MOVE "MOVE-TEST-F1-1 " TO PAR-NAME.
044900     PERFORM  PRINT-DETAIL.
045000 MOVE-INIT-F1-2.
045100     MOVE      12345 TO MOVE1.
045200 MOVE-TEST-F1-2-0.
045300     MOVE     MOVE1 TO MOVE3.
045400 MOVE-TEST-F1-2-1.
045500     IF       MOVE3 EQUAL TO 45
045600              PERFORM PASS
045700              ELSE
045800              GO TO MOVE-FAIL-F1-2.
045900*    NOTE NI TO NI MOVE, WITH TRUNCATION.
046000     GO TO    MOVE-WRITE-F1-2.
046100 MOVE-DELETE-F1-2.
046200     PERFORM  DE-LETE.
046300     GO TO    MOVE-WRITE-F1-2.
046400 MOVE-FAIL-F1-2.
046500     MOVE     MOVE3 TO COMPUTED-N.
046600     MOVE     45 TO CORRECT-N.
046700     PERFORM  FAIL.
046800 MOVE-WRITE-F1-2.
046900     MOVE "MOVE-TEST-F1-2 " TO PAR-NAME.
047000     PERFORM  PRINT-DETAIL.
047100 MOVE-INIT-F1-3.
047200     MOVE     12345 TO MOVE1.
047300 MOVE-TEST-F1-3-0.
047400     MOVE     MOVE1 TO MOVE4.
047500 MOVE-TEST-F1-3-1.
047600     IF       MOVE4 EQUAL TO 0012345
047700              PERFORM PASS
047800              ELSE
047900              GO TO MOVE-FAIL-F1-3.
048000*    NOTE NI TO NI MOVE, WITH ZERO PADDING.
048100     GO TO    MOVE-WRITE-F1-3.
048200 MOVE-DELETE-F1-3.
048300     PERFORM  DE-LETE.
048400     GO TO    MOVE-WRITE-F1-3.
048500 MOVE-FAIL-F1-3.
048600     MOVE     MOVE4 TO COMPUTED-N.
048700     MOVE     0012345 TO CORRECT-N.
048800     PERFORM  FAIL.
048900 MOVE-WRITE-F1-3.
049000     MOVE "MOVE-TEST-F1-3 " TO PAR-NAME.
049100     PERFORM  PRINT-DETAIL.
049200 MOVE-INIT-F1-4.
049300     MOVE     12345 TO MOVE1.
049400 MOVE-TEST-F1-4-0.
049500     MOVE     MOVE1 TO MOVE5.
049600 MOVE-TEST-F1-4-1.
049700     IF       MOVE5 EQUAL TO 45
049800              PERFORM PASS
049900              ELSE
050000              GO TO MOVE-FAIL-F1-4.
050100*    NOTE NI TO NNI (NUMERIC NON INTEGER), LEFT TRUNCATION
050200*    ZERO FILL ON RIGHT.
050300     GO TO    MOVE-WRITE-F1-4.
050400 MOVE-DELETE-F1-4.
050500     PERFORM  DE-LETE.
050600     GO TO    MOVE-WRITE-F1-4.
050700 MOVE-FAIL-F1-4.
050800     MOVE     MOVE5 TO COMPUTED-N.
050900     MOVE     45 TO CORRECT-N.
051000     PERFORM  FAIL.
051100 MOVE-WRITE-F1-4.
051200     MOVE "MOVE-TEST-F1-4 " TO PAR-NAME.
051300     PERFORM  PRINT-DETAIL.
051400 MOVE-INIT-F1-5.
051500     MOVE     12345 TO MOVE1.
051600 MOVE-TEST-F1-5-0.
051700     MOVE     MOVE1 TO MOVE48.
051800 MOVE-TEST-F1-5-1.
051900     IF       MOVE48 EQUAL TO 5
052000              PERFORM PASS
052100              ELSE
052200              GO TO MOVE-FAIL-F1-5.
052300*    NOTE NI TO NNI MOVE, RECEIVING FIELD MAX SIZE.
052400     GO TO    MOVE-WRITE-F1-5.
052500 MOVE-DELETE-F1-5.
052600     PERFORM  DE-LETE.
052700     GO TO    MOVE-WRITE-F1-5.
052800 MOVE-FAIL-F1-5.
052900     MOVE     MOVE48 TO COMPUTED-N.
053000     MOVE     5 TO CORRECT-N.
053100     PERFORM  FAIL.
053200 MOVE-WRITE-F1-5.
053300     MOVE "MOVE-TEST-F1-5 " TO PAR-NAME.
053400     PERFORM  PRINT-DETAIL.
053500 MOVE-INIT-F1-6.
053600     MOVE     12345 TO MOVE1.
053700 MOVE-TEST-F1-6-0.
053800     MOVE     MOVE1 TO MOVE27.
053900 MOVE-TEST-F1-6-1.
054000     IF       MOVE27 EQUAL TO 2300
054100              PERFORM PASS
054200              ELSE
054300              GO TO MOVE-FAIL-F1-6.
054400*    NOTE NI TO NNI MOVE SCALING.
054500     GO TO    MOVE-WRITE-F1-6.
054600 MOVE-DELETE-F1-6.
054700     PERFORM  DE-LETE.
054800     GO TO    MOVE-WRITE-F1-6.
054900 MOVE-FAIL-F1-6.
055000     MOVE     MOVE27 TO COMPUTED-N.
055100     MOVE     2300 TO CORRECT-N.
055200     PERFORM  FAIL.
055300 MOVE-WRITE-F1-6.
055400     MOVE "MOVE-TEST-F1-6 " TO PAR-NAME.
055500     PERFORM  PRINT-DETAIL.
055600 MOVE-INIT-F1-7.
055700     MOVE     12345 TO MOVE1.
055800 MOVE-TEST-F1-7-0.
055900     MOVE     MOVE1 TO MOVE8.
056000 MOVE-TEST-F1-7-1.
056100     IF       MOVE1  EQUAL TO 12345.00
056200              PERFORM PASS
056300              ELSE
056400              GO TO MOVE-FAIL-F1-7.
056500*    NOTE NI TO NNI MOVE, ZERO PADDING ON RIGHT.
056600     GO TO    MOVE-WRITE-F1-7.
056700 MOVE-DELETE-F1-7.
056800     PERFORM  DE-LETE.
056900     GO TO    MOVE-WRITE-F1-7.
057000 MOVE-FAIL-F1-7.
057100     MOVE     MOVE8 TO COMPUTED-N.
057200     MOVE     12345.00  TO CORRECT-N.
057300     PERFORM  FAIL.
057400 MOVE-WRITE-F1-7.
057500     MOVE "MOVE-TEST-F1-7 " TO PAR-NAME.
057600     PERFORM  PRINT-DETAIL.
057700 MOVE-INIT-F1-8.
057800     MOVE     12345 TO MOVE1.
057900 MOVE-TEST-F1-8-0.
058000     MOVE     MOVE1 TO MOVE9.
058100 MOVE-TEST-F1-8-1.
058200     IF       MOVE9  EQUAL TO  012345.00
058300              PERFORM PASS
058400              ELSE
058500              GO TO MOVE-FAIL-F1-8.
058600*    NOTE NI TO NNI MOVE, ZERO PADDING LEFT AND RIGHT.
058700     GO TO    MOVE-WRITE-F1-8.
058800 MOVE-DELETE-F1-8.
058900     PERFORM  DE-LETE.
059000     GO TO    MOVE-WRITE-F1-8.
059100 MOVE-FAIL-F1-8.
059200     MOVE     MOVE9 TO COMPUTED-N.
059300     MOVE     0012345.00 TO  CORRECT-N.
059400     PERFORM  FAIL.
059500 MOVE-WRITE-F1-8.
059600     MOVE "MOVE-TEST-F1-8 " TO PAR-NAME.
059700     PERFORM  PRINT-DETAIL.
059800 MOVE-INIT-F1-9.
059900     MOVE     12345 TO MOVE1.
060000 MOVE-TEST-F1-9-0.
060100     MOVE     MOVE1 TO MOVE10.
060200 MOVE-TEST-F1-9-1.
060300     IF       MOVE10 EQUAL TO "$345.00"
060400              PERFORM PASS
060500              ELSE
060600              GO TO MOVE-FAIL-F1-9.
060700*    NOTE NI TO NE MOVE, FIXED INSERTION, CURRENCY SIGN, PERIOD.
060800     GO TO    MOVE-WRITE-F1-9.
060900 MOVE-DELETE-F1-9.
061000     PERFORM  DE-LETE.
061100     GO TO    MOVE-WRITE-F1-9.
061200 MOVE-FAIL-F1-9.
061300     MOVE     MOVE10 TO COMPUTED-A.
061400     MOVE "$345.00" TO CORRECT-A.
061500     PERFORM  FAIL.
061600 MOVE-WRITE-F1-9.
061700     MOVE "MOVE-TEST-F1-9 " TO PAR-NAME.
061800     PERFORM  PRINT-DETAIL.
061900 MOVE-INIT-F1-10.
062000     MOVE     12345 TO MOVE1.
062100 MOVE-TEST-F1-10-0.
062200     MOVE     MOVE1 TO MOVE11.
062300 MOVE-TEST-F1-10-1.
062400     IF       MOVE11 EQUAL TO "$12,345.00"
062500              PERFORM PASS
062600              ELSE
062700              GO TO MOVE-FAIL-F1-10.
062800*    NOTE NI TO NE MOVE, FIXED INSERTION (CURRENCY SIGN,
062900*    COMMA, PERIOD) ZERO FILL ON RIGHT.
063000     GO TO    MOVE-WRITE-F1-10.
063100 MOVE-DELETE-F1-10.
063200     PERFORM  DE-LETE.
063300     GO TO    MOVE-WRITE-F1-10.
063400 MOVE-FAIL-F1-10.
063500     MOVE     MOVE11 TO COMPUTED-A.
063600     MOVE "$12,345.00" TO CORRECT-A.
063700     PERFORM  FAIL.
063800 MOVE-WRITE-F1-10.
063900     MOVE "MOVE-TEST-F1-10" TO PAR-NAME.
064000     PERFORM  PRINT-DETAIL.
064100 MOVE-INIT-F1-11.
064200     MOVE     00045 TO MOVE49.
064300 MOVE-TEST-F1-11-0.
064400     MOVE     MOVE49 TO MOVE12.
064500 MOVE-TEST-F1-11-1.
064600     IF       MOVE12 EQUAL TO "    $045"
064700              PERFORM PASS
064800              ELSE
064900              GO TO MOVE-FAIL-F1-11.
065000*    NOTE NI TO NE MOVE, FLOAT CURRENCY SIGN.
065100     GO TO    MOVE-WRITE-F1-11.
065200 MOVE-DELETE-F1-11.
065300     PERFORM  DE-LETE.
065400     GO TO    MOVE-WRITE-F1-11.
065500 MOVE-FAIL-F1-11.
065600     MOVE     MOVE12 TO COMPUTED-A.
065700     MOVE "    $045" TO CORRECT-A.
065800     PERFORM  FAIL.
065900 MOVE-WRITE-F1-11.
066000     MOVE "MOVE-TEST-F1-11" TO PAR-NAME.
066100     PERFORM  PRINT-DETAIL.
066200 MOVE-INIT-F1-12.
066300     MOVE     00045 TO MOVE49.
066400 MOVE-TEST-F1-12-0.
066500     MOVE     MOVE49 TO MOVE13.
066600 MOVE-TEST-F1-12-1.
066700     IF       MOVE13 EQUAL TO "*****000045"
066800              PERFORM PASS
066900              ELSE
067000              GO TO MOVE-FAIL-F1-12.
067100*    NOTE NI TO NE MOVE, CHECK PROTECT.
067200     GO TO    MOVE-WRITE-F1-12.
067300 MOVE-DELETE-F1-12.
067400     PERFORM  DE-LETE.
067500     GO TO    MOVE-WRITE-F1-12.
067600 MOVE-FAIL-F1-12.
067700     MOVE     MOVE13 TO COMPUTED-A.
067800     MOVE "*****000045" TO CORRECT-A.
067900     PERFORM  FAIL.
068000 MOVE-WRITE-F1-12.
068100     MOVE "MOVE-TEST-F1-12" TO PAR-NAME.
068200     PERFORM  PRINT-DETAIL.
068300 MOVE-INIT-F1-13.
068400     MOVE     12345 TO MOVE1.
068500 MOVE-TEST-F1-13-0.
068600     MOVE     MOVE1 TO MOVE14.
068700 MOVE-TEST-F1-13-1.
068800     IF       MOVE14 EQUAL TO "+12345"
068900              PERFORM PASS
069000              ELSE
069100              GO TO MOVE-FAIL-F1-13.
069200*    NOTE NI TO NE MOVE, REPORT SIGN.
069300     GO TO    MOVE-WRITE-F1-13.
069400 MOVE-DELETE-F1-13.
069500     PERFORM  DE-LETE.
069600     GO TO    MOVE-WRITE-F1-13.
069700 MOVE-FAIL-F1-13.
069800     MOVE     MOVE14 TO COMPUTED-A.
069900     MOVE "+12345" TO CORRECT-A.
070000     PERFORM  FAIL.
070100 MOVE-WRITE-F1-13.
070200     MOVE "MOVE-TEST-F1-13" TO PAR-NAME.
070300     PERFORM  PRINT-DETAIL.
070400 MOVE-INIT-F1-14.
070500     MOVE    -12345 TO MOVE51.
070600 MOVE-TEST-F1-14-0.
070700     MOVE     MOVE51 TO MOVE16.
070800 MOVE-TEST-F1-14-1.
070900     IF       MOVE16 EQUAL TO "12345CR"
071000              PERFORM PASS
071100              ELSE
071200              GO TO MOVE-FAIL-F1-14.
071300*    NOTE NI TO NE MOVE, REPORT SYMBOL CR.
071400     GO TO    MOVE-WRITE-F1-14.
071500 MOVE-DELETE-F1-14.
071600     PERFORM  DE-LETE.
071700     GO TO    MOVE-WRITE-F1-14.
071800 MOVE-FAIL-F1-14.
071900     MOVE     MOVE16 TO COMPUTED-A.
072000     MOVE "12345CR" TO CORRECT-A.
072100     PERFORM  FAIL.
072200 MOVE-WRITE-F1-14.
072300     MOVE "MOVE-TEST-F1-14" TO PAR-NAME.
072400     PERFORM  PRINT-DETAIL.
072500 MOVE-INIT-F1-15.
072600     MOVE    -12345 TO MOVE51.
072700 MOVE-TEST-F1-15-0.
072800     MOVE     MOVE51 TO MOVE52.
072900 MOVE-TEST-F1-15-1.
073000     IF       MOVE52 EQUAL TO "12345-"
073100              PERFORM PASS
073200              ELSE
073300              GO TO MOVE-FAIL-F1-15.
073400*    NOTE NI TO NE MOVE REPORT SIGN.
073500     GO TO    MOVE-WRITE-F1-15.
073600 MOVE-DELETE-F1-15.
073700     PERFORM  DE-LETE.
073800     GO TO    MOVE-WRITE-F1-15.
073900 MOVE-FAIL-F1-15.
074000     MOVE     MOVE52 TO COMPUTED-A.
074100     MOVE "12345-" TO CORRECT-A.
074200     PERFORM  FAIL.
074300 MOVE-WRITE-F1-15.
074400     MOVE "MOVE-TEST-F1-15" TO PAR-NAME.
074500     PERFORM  PRINT-DETAIL.
074600 MOVE-INIT-F1-16.
074700     MOVE     00000 TO MOVE15.
074800 MOVE-TEST-F1-16-0.
074900     MOVE     MOVE15 TO MOVE17.
075000 MOVE-TEST-F1-16-1.
075100     IF       MOVE17 EQUAL TO SPACE
075200              PERFORM PASS
075300              ELSE
075400              GO TO MOVE-FAIL-F1-16.
075500*    NOTE NI TO NE MOVE, BLANK WHEN ZERO CLAUSE.
075600     GO TO    MOVE-WRITE-F1-16.
075700 MOVE-DELETE-F1-16.
075800     PERFORM  DE-LETE.
075900     GO TO    MOVE-WRITE-F1-16.
076000 MOVE-FAIL-F1-16.
076100     MOVE     MOVE17 TO COMPUTED-A.
076200     MOVE     SPACE TO CORRECT-A.
076300     PERFORM  FAIL.
076400 MOVE-WRITE-F1-16.
076500     MOVE "MOVE-TEST-F1-16" TO PAR-NAME.
076600     PERFORM  PRINT-DETAIL.
076700 MOVE-INIT-F1-17.
076800     MOVE     00000 TO MOVE15.
076900 MOVE-TEST-F1-17-0.
077000     MOVE     MOVE15 TO MOVE18.
077100 MOVE-TEST-F1-17-1.
077200     IF       MOVE18 EQUAL TO SPACE
077300              PERFORM PASS
077400              ELSE
077500              GO TO MOVE-FAIL-F1-17.
077600*    NOTE NI TO NE MOVE, BLANK WHEN ZERO PICTURE.
077700     GO TO    MOVE-WRITE-F1-17.
077800 MOVE-DELETE-F1-17.
077900     PERFORM  DE-LETE.
078000     GO TO    MOVE-WRITE-F1-17.
078100 MOVE-FAIL-F1-17.
078200     MOVE     MOVE18 TO COMPUTED-A.
078300     MOVE     SPACE TO CORRECT-A.
078400     PERFORM  FAIL.
078500 MOVE-WRITE-F1-17.
078600     MOVE "MOVE-TEST-F1-17" TO PAR-NAME.
078700     PERFORM  PRINT-DETAIL.
078800 MOVE-INIT-F1-18.
078900     MOVE     12345 TO MOVE1.
079000 MOVE-TEST-F1-18-0.
079100     MOVE     MOVE1 TO MOVE19.
079200 MOVE-TEST-F1-18-1.
079300     IF       MOVE19 EQUAL TO 12345
079400              PERFORM PASS
079500              ELSE
079600              GO TO MOVE-FAIL-F1-18.
079700*    NOTE NI TO AN MOVE, EQUAL SIZE.
079800     GO TO    MOVE-WRITE-F1-18.
079900 MOVE-DELETE-F1-18.
080000     PERFORM  DE-LETE.
080100     GO TO    MOVE-WRITE-F1-18.
080200 MOVE-FAIL-F1-18.
080300     MOVE     MOVE19 TO COMPUTED-N.
080400     MOVE     12345 TO CORRECT-N.
080500     PERFORM  FAIL.
080600 MOVE-WRITE-F1-18.
080700     MOVE "MOVE-TEST-F1-18" TO PAR-NAME.
080800     PERFORM  PRINT-DETAIL.
080900 MOVE-INIT-F1-19.
081000     MOVE     12345 TO MOVE1.
081100 MOVE-TEST-F1-19-0.
081200     MOVE     MOVE1 TO MOVE20.
081300 MOVE-TEST-F1-19-1.
081400     IF       MOVE20 EQUAL TO 1234
081500              PERFORM PASS
081600              ELSE
081700              GO TO MOVE-FAIL-F1-19.
081800*    NOTE NI TO AN MOVE, TRUNCATION ON RIGHT.
081900     GO TO    MOVE-WRITE-F1-19.
082000 MOVE-DELETE-F1-19.
082100     PERFORM  DE-LETE.
082200     GO TO    MOVE-WRITE-F1-19.
082300 MOVE-FAIL-F1-19.
082400     MOVE     MOVE20 TO COMPUTED-N.
082500     MOVE     1234 TO CORRECT-N.
082600     PERFORM  FAIL.
082700 MOVE-WRITE-F1-19.
082800     MOVE "MOVE-TEST-F1-19" TO PAR-NAME.
082900     PERFORM  PRINT-DETAIL.
083000 MOVE-INIT-F1-20.
083100     MOVE     12345 TO MOVE1.
083200 MOVE-TEST-F1-20-0.
083300     MOVE     MOVE1 TO MOVE21.
083400 MOVE-TEST-F1-20-1.
083500     IF       MOVE21 EQUAL TO "12345  "
083600              PERFORM PASS
083700              ELSE
083800              GO TO MOVE-FAIL-F1-20.
083900*    NOTE NI TO AN MOVE, SPACE PADDING ON RIGHT.
084000     GO TO    MOVE-WRITE-F1-20.
084100 MOVE-DELETE-F1-20.
084200     PERFORM  DE-LETE.
084300     GO TO    MOVE-WRITE-F1-20.
084400 MOVE-FAIL-F1-20.
084500     MOVE     MOVE21 TO COMPUTED-A.
084600     MOVE "12345  " TO CORRECT-A.
084700     PERFORM  FAIL.
084800 MOVE-WRITE-F1-20.
084900     MOVE "MOVE-TEST-F1-20" TO PAR-NAME.
085000     PERFORM  PRINT-DETAIL.
085100 MOVE-INIT-F1-21.
085200     MOVE     12345 TO MOVE1.
085300 MOVE-TEST-F1-21-0.
085400     MOVE     MOVE1 TO MOVE22.
085500 MOVE-TEST-F1-21-1.
085600     IF       MOVE22 EQUAL TO "1 203 405"
085700              PERFORM PASS
085800              ELSE
085900              GO TO MOVE-FAIL-F1-21.
086000*    NOTE NI TO AE MOVE, ZERO AND SPACE INSERTION.
086100     GO TO    MOVE-WRITE-F1-21.
086200 MOVE-DELETE-F1-21.
086300     PERFORM  DE-LETE.
086400     GO TO    MOVE-WRITE-F1-21.
086500 MOVE-FAIL-F1-21.
086600     MOVE     MOVE22 TO COMPUTED-A.
086700     MOVE "1 203 405" TO CORRECT-A.
086800     PERFORM  FAIL.
086900 MOVE-WRITE-F1-21.
087000     MOVE "MOVE-TEST-F1-21" TO PAR-NAME.
087100     PERFORM  PRINT-DETAIL.
087200 MOVE-INIT-F1-22.
087300     MOVE     123.45 TO MOVE23.
087400     MOVE    "MOVE NUM NON-INTEGER" TO FEATURE.
087500 MOVE-TEST-F1-22-0.
087600     MOVE     MOVE23 TO MOVE4.
087700 MOVE-TEST-F1-22-1.
087800     IF       MOVE4 EQUAL TO 0000123
087900              PERFORM PASS
088000              ELSE
088100              GO TO MOVE-FAIL-F1-22.
088200*    NOTE NNI TO NI MOVE, ZERO PADDING ON LEFT, TRUNCATION.
088300     GO TO    MOVE-WRITE-F1-22.
088400 MOVE-DELETE-F1-22.
088500     PERFORM  DE-LETE.
088600     GO TO    MOVE-WRITE-F1-22.
088700 MOVE-FAIL-F1-22.
088800     MOVE     MOVE23 TO COMPUTED-N.
088900     MOVE     0000123 TO CORRECT-N.
089000     PERFORM  FAIL.
089100 MOVE-WRITE-F1-22.
089200     MOVE "MOVE-TEST-F1-22" TO PAR-NAME.
089300     PERFORM  PRINT-DETAIL.
089400 MOVE-INIT-F1-23.
089500     MOVE     123.45 TO MOVE23.
089600 MOVE-TEST-F1-23-0.
089700     MOVE     MOVE23 TO MOVE25.
089800 MOVE-TEST-F1-23-1.
089900     IF       MOVE25 EQUAL TO 123
090000              PERFORM PASS
090100              ELSE
090200              GO TO MOVE-FAIL-F1-23.
090300*    NOTE NNI TO NI MOVE, TRUNCATION ON RIGHT.
090400     GO TO    MOVE-WRITE-F1-23.
090500 MOVE-DELETE-F1-23.
090600     PERFORM  DE-LETE.
090700     GO TO    MOVE-WRITE-F1-23.
090800 MOVE-FAIL-F1-23.
090900     MOVE     MOVE25 TO COMPUTED-N.
091000     MOVE     123 TO CORRECT-N.
091100     PERFORM  FAIL.
091200 MOVE-WRITE-F1-23.
091300     MOVE "MOVE-TEST-F1-23" TO PAR-NAME.
091400     PERFORM  PRINT-DETAIL.
091500 MOVE-INIT-F1-24.
091600     MOVE     123.45 TO MOVE23.
091700 MOVE-TEST-F1-24-0.
091800     MOVE     MOVE23 TO MOVE3.
091900 MOVE-TEST-F1-24-1.
092000     IF       MOVE3 EQUAL TO 23
092100              PERFORM PASS
092200              ELSE
092300              GO TO MOVE-FAIL-F1-24.
092400*    NOTE NNI TO NI MOVE, TRUNCATION LEFT AND RIGHT.
092500     GO TO    MOVE-WRITE-F1-24.
092600 MOVE-DELETE-F1-24.
092700     PERFORM  DE-LETE.
092800     GO TO    MOVE-WRITE-F1-24.
092900 MOVE-FAIL-F1-24.
093000     MOVE     MOVE3 TO COMPUTED-N.
093100     MOVE     23 TO CORRECT-N.
093200     PERFORM  FAIL.
093300 MOVE-WRITE-F1-24.
093400     MOVE "MOVE-TEST-F1-24" TO PAR-NAME.
093500     PERFORM  PRINT-DETAIL.
093600 MOVE-INIT-F1-25.
093700     MOVE     123.45 TO MOVE23.
093800 MOVE-TEST-F1-25-0.
093900     MOVE     MOVE23 TO MOVE27.
094000 MOVE-TEST-F1-25-1.
094100     IF       MOVE27 EQUAL TO 0100
094200              PERFORM PASS
094300              ELSE
094400              GO TO MOVE-FAIL-F1-25.
094500*    NOTE NNI TO NNI MOVE, SCALING.
094600     GO TO    MOVE-WRITE-F1-25.
094700 MOVE-DELETE-F1-25.
094800     PERFORM  DE-LETE.
094900     GO TO    MOVE-WRITE-F1-25.
095000 MOVE-FAIL-F1-25.
095100     MOVE     MOVE27 TO COMPUTED-N.
095200     MOVE     0100  TO CORRECT-N.
095300     PERFORM  FAIL.
095400 MOVE-WRITE-F1-25.
095500     MOVE "MOVE-TEST-F1-25" TO PAR-NAME.
095600     PERFORM  PRINT-DETAIL.
095700 MOVE-INIT-F1-26.
095800     MOVE     123.45 TO MOVE23.
095900 MOVE-TEST-F1-26-0.
096000     MOVE     MOVE23 TO MOVE6.
096100 MOVE-TEST-F1-26-1.
096200     IF       MOVE6  EQUAL TO .45000
096300              PERFORM PASS
096400              ELSE
096500              GO TO MOVE-FAIL-F1-26.
096600*    NOTE NNI TO NNI MOVE, TRUNCATION ON LEFT AND ZERO
096700*    FILL ON RIGHT.
096800     GO TO    MOVE-WRITE-F1-26.
096900 MOVE-DELETE-F1-26.
097000     PERFORM  DE-LETE.
097100     GO TO    MOVE-WRITE-F1-26.
097200 MOVE-FAIL-F1-26.
097300     MOVE     MOVE6 TO COMPUTED-N.
097400     MOVE     .45000  TO CORRECT-N.
097500     PERFORM  FAIL.
097600 MOVE-WRITE-F1-26.
097700     MOVE "MOVE-TEST-F1-26" TO PAR-NAME.
097800     PERFORM  PRINT-DETAIL.
097900 MOVE-INIT-F1-27.
098000     MOVE     123.45 TO MOVE23.
098100 MOVE-TEST-F1-27-0.
098200     MOVE     MOVE23 TO MOVE29.
098300 MOVE-TEST-F1-27-1.
098400     IF       MOVE29 EQUAL TO 0123.450
098500              PERFORM PASS
098600              ELSE
098700              GO TO MOVE-FAIL-F1-27.
098800*    NOTE NNI TO NNI MOVE, ZERO PADDING ON LEFT AND RIGHT.
098900     GO TO    MOVE-WRITE-F1-27.
099000 MOVE-DELETE-F1-27.
099100     PERFORM  DE-LETE.
099200     GO TO    MOVE-WRITE-F1-27.
099300 MOVE-FAIL-F1-27.
099400     MOVE     MOVE29 TO COMPUTED-N.
099500     MOVE     0123.450  TO CORRECT-N.
099600     PERFORM  FAIL.
099700 MOVE-WRITE-F1-27.
099800     MOVE "MOVE-TEST-F1-27" TO PAR-NAME.
099900     PERFORM  PRINT-DETAIL.
100000 MOVE-INIT-F1-28.
100100     MOVE     123.45 TO MOVE23.
100200 MOVE-TEST-F1-28-0.
100300     MOVE     MOVE23 TO MOVE11.
100400 MOVE-TEST-F1-28-1.
100500     IF       MOVE11 EQUAL TO "$00,123.45"
100600              PERFORM PASS
100700              ELSE
100800              GO TO MOVE-FAIL-F1-28.
100900*    NOTE NNI TO NE MOVE, FIXED INSERTION, ZERO PADDING ON LEFT.
101000     GO TO    MOVE-WRITE-F1-28.
101100 MOVE-DELETE-F1-28.
101200     PERFORM  DE-LETE.
101300     GO TO    MOVE-WRITE-F1-28.
101400 MOVE-FAIL-F1-28.
101500     MOVE     MOVE11 TO COMPUTED-A.
101600     MOVE "$00,123.45" TO CORRECT-A.
101700     PERFORM  FAIL.
101800 MOVE-WRITE-F1-28.
101900     MOVE "MOVE-TEST-F1-28" TO PAR-NAME.
102000     PERFORM  PRINT-DETAIL.
102100 MOVE-INIT-F1-29.
102200     MOVE     123.45 TO MOVE23.
102300 MOVE-TEST-F1-29-0.
102400     MOVE     MOVE30 TO MOVE21.
102500 MOVE-TEST-F1-29-1.
102600     IF       MOVE21 EQUAL TO "$123.45"
102700              PERFORM PASS
102800              ELSE
102900              GO TO MOVE-FAIL-F1-29.
103000*    NOTE NE TO AN MOVE, EQUAL SIZE.
103100     GO TO    MOVE-WRITE-F1-29.
103200 MOVE-DELETE-F1-29.
103300     PERFORM  DE-LETE.
103400     GO TO    MOVE-WRITE-F1-29.
103500 MOVE-FAIL-F1-29.
103600     MOVE     MOVE21 TO COMPUTED-A.
103700     MOVE "$123.45" TO CORRECT-A.
103800     PERFORM  FAIL.
103900 MOVE-WRITE-F1-29.
104000     MOVE "MOVE-TEST-F1-29" TO PAR-NAME.
104100     PERFORM  PRINT-DETAIL.
104200 MOVE-INIT-F1-30.
104300     MOVE   "$123.45" TO MOVE29A.
104400 MOVE-TEST-F1-30-0.
104500     MOVE     MOVE30 TO MOVE31.
104600 MOVE-TEST-F1-30-1.
104700     IF       MOVE31 EQUAL TO "$123.45  "
104800              PERFORM PASS
104900              ELSE
105000              GO TO MOVE-FAIL-F1-30.
105100*    NOTE NE TO AN MOVE, SPACE PADDING ON RIGHT.
105200     GO TO    MOVE-WRITE-F1-30.
105300 MOVE-DELETE-F1-30.
105400     PERFORM  DE-LETE.
105500     GO TO    MOVE-WRITE-F1-30.
105600 MOVE-FAIL-F1-30.
105700     MOVE     MOVE31 TO COMPUTED-A.
105800     MOVE "$123.45  " TO CORRECT-A.
105900     PERFORM  FAIL.
106000 MOVE-WRITE-F1-30.
106100     MOVE "MOVE-TEST-F1-30" TO PAR-NAME.
106200     PERFORM  PRINT-DETAIL.
106300 MOVE-INIT-F1-31.
106400     MOVE   "$123.45" TO MOVE29A.
106500 MOVE-TEST-F1-31-0.
106600     MOVE     MOVE30 TO MOVE20.
106700 MOVE-TEST-F1-31-1.
106800     IF       MOVE20 EQUAL TO "$123"
106900              PERFORM PASS
107000              ELSE
107100              GO TO MOVE-FAIL-F1-31.
107200*    NOTE NE TO AN MOVE, TRUNCATION ON RIGHT.
107300     GO TO    MOVE-WRITE-F1-31.
107400 MOVE-DELETE-F1-31.
107500     PERFORM  DE-LETE.
107600     GO TO    MOVE-WRITE-F1-31.
107700 MOVE-FAIL-F1-31.
107800     MOVE     MOVE20 TO COMPUTED-A.
107900     MOVE "$123" TO CORRECT-A.
108000     PERFORM  FAIL.
108100 MOVE-WRITE-F1-31.
108200     MOVE "MOVE-TEST-F1-31" TO PAR-NAME.
108300     PERFORM  PRINT-DETAIL.
108400 MOVE-INIT-F1-32.
108500     MOVE   "$123.45" TO MOVE29A.
108600 MOVE-TEST-F1-32-0.
108700     MOVE     MOVE30 TO MOVE24.
108800 MOVE-TEST-F1-32-1.
108900     IF       MOVE24 EQUAL TO "$ 123 000.45 "
109000              PERFORM PASS
109100              ELSE
109200              GO TO MOVE-FAIL-F1-32.
109300*    NOTE NE TO AE MOVE, SPACE AND ZERO INSERTION.
109400     GO TO    MOVE-WRITE-F1-32.
109500 MOVE-DELETE-F1-32.
109600     PERFORM  DE-LETE.
109700     GO TO    MOVE-WRITE-F1-32.
109800 MOVE-FAIL-F1-32.
109900     MOVE     MOVE24 TO COMPUTED-A.
110000     MOVE "$ 123 000.45 " TO CORRECT-A.
110100     PERFORM  FAIL.
110200 MOVE-WRITE-F1-32.
110300     MOVE "MOVE-TEST-F1-32" TO PAR-NAME.
110400     PERFORM  PRINT-DETAIL.
110500 MOVE-INIT-F1-33.
110600     MOVE    "MOVE ALPHANUMERIC   " TO FEATURE.
110700     MOVE    "12345" TO MOVE50.
110800 MOVE-TEST-F1-33-0.
110900     MOVE     MOVE50 TO MOVE2.
111000 MOVE-TEST-F1-33-1.
111100     IF       MOVE2 EQUAL TO 12345
111200              PERFORM PASS
111300              ELSE
111400              GO TO MOVE-FAIL-F1-33.
111500*    NOTE AN TO NI MOVE, EQUAL SIZE.
111600     GO TO    MOVE-WRITE-F1-33.
111700 MOVE-DELETE-F1-33.
111800     PERFORM  DE-LETE.
111900     GO TO    MOVE-WRITE-F1-33.
112000 MOVE-FAIL-F1-33.
112100     MOVE     MOVE2 TO COMPUTED-N.
112200     MOVE     12345 TO CORRECT-N.
112300     PERFORM  FAIL.
112400 MOVE-WRITE-F1-33.
112500     MOVE "MOVE-TEST-F1-33" TO PAR-NAME.
112600     PERFORM  PRINT-DETAIL.
112700 MOVE-INIT-F1-34.
112800     MOVE    "12345" TO MOVE50.
112900 MOVE-TEST-F1-34-0.
113000     MOVE     MOVE50 TO MOVE4.
113100 MOVE-TEST-F1-34-1.
113200     IF       MOVE4 EQUAL TO 0012345
113300              PERFORM PASS
113400              ELSE
113500              GO TO MOVE-FAIL-F1-34.
113600*    NOTE AN TO NI MOVE, ZERO PADDING ON LEFT.
113700     GO TO    MOVE-WRITE-F1-34.
113800 MOVE-DELETE-F1-34.
113900     PERFORM  DE-LETE.
114000     GO TO    MOVE-WRITE-F1-34.
114100 MOVE-FAIL-F1-34.
114200     MOVE     MOVE4 TO COMPUTED-N.
114300     MOVE     0012345  TO CORRECT-N.
114400     PERFORM  FAIL.
114500 MOVE-WRITE-F1-34.
114600     MOVE "MOVE-TEST-F1-34" TO PAR-NAME.
114700     PERFORM  PRINT-DETAIL.
114800 MOVE-INIT-F1-35.
114900     MOVE    "12345" TO MOVE50.
115000 MOVE-TEST-F1-35-0.
115100     MOVE     MOVE50 TO MOVE3.
115200 MOVE-TEST-F1-35-1.
115300     IF       MOVE3 EQUAL TO 45
115400              PERFORM PASS
115500              ELSE
115600              GO TO MOVE-FAIL-F1-35.
115700*    NOTE AN TO NI MOVE, TRUNCATION ON LEFT.
115800     GO TO    MOVE-WRITE-F1-35.
115900 MOVE-DELETE-F1-35.
116000     PERFORM  DE-LETE.
116100     GO TO    MOVE-WRITE-F1-35.
116200 MOVE-FAIL-F1-35.
116300     MOVE     MOVE50 TO COMPUTED-N.
116400     MOVE     45 TO CORRECT-N.
116500     PERFORM  FAIL.
116600 MOVE-WRITE-F1-35.
116700     MOVE "MOVE-TEST-F1-35" TO PAR-NAME.
116800     PERFORM  PRINT-DETAIL.
116900 MOVE-INIT-F1-36.
117000     MOVE    "12345" TO MOVE50.
117100 MOVE-TEST-F1-36-0.
117200     MOVE     MOVE50 TO MOVE26.
117300 MOVE-TEST-F1-36-1.
117400     IF       MOVE26 EQUAL TO 345.00
117500              PERFORM PASS
117600              ELSE
117700              GO TO MOVE-FAIL-F1-36.
117800*    NOTE AN TO NNI MOVE, ZERO FILL RIGHT, TRUNCATION LEFT.
117900     GO TO    MOVE-WRITE-F1-36.
118000 MOVE-DELETE-F1-36.
118100     PERFORM  DE-LETE.
118200     GO TO    MOVE-WRITE-F1-36.
118300 MOVE-FAIL-F1-36.
118400     MOVE     MOVE26 TO COMPUTED-N.
118500     MOVE   345.00  TO CORRECT-N.
118600     PERFORM  FAIL.
118700 MOVE-WRITE-F1-36.
118800     MOVE "MOVE-TEST-F1-36" TO PAR-NAME.
118900     PERFORM  PRINT-DETAIL.
119000 MOVE-INIT-F1-37.
119100     MOVE    "12345" TO MOVE50.
119200 MOVE-TEST-F1-37-0.
119300     MOVE     MOVE50 TO MOVE9.
119400 MOVE-TEST-F1-37-1.
119500     IF       MOVE9 EQUAL TO  0012345.00
119600              PERFORM PASS
119700              ELSE
119800              GO TO MOVE-FAIL-F1-37.
119900*    NOTE AN TO NNI MOVE, ZERO PADDING LEFT AND RIGHT.
120000     GO TO    MOVE-WRITE-F1-37.
120100 MOVE-DELETE-F1-37.
120200     PERFORM  DE-LETE.
120300     GO TO    MOVE-WRITE-F1-37.
120400 MOVE-FAIL-F1-37.
120500     MOVE     MOVE9 TO COMPUTED-N.
120600     MOVE  0012345.00   TO CORRECT-N.
120700     PERFORM  FAIL.
120800 MOVE-WRITE-F1-37.
120900     MOVE "MOVE-TEST-F1-37" TO PAR-NAME.
121000     PERFORM  PRINT-DETAIL.
121100 MOVE-INIT-F1-38.
121200     MOVE    "12345" TO MOVE50.
121300 MOVE-TEST-F1-38-0.
121400     MOVE     MOVE50 TO MOVE16.
121500 MOVE-TEST-F1-38-1.
121600     IF       MOVE16 EQUAL TO "12345  "
121700              PERFORM PASS
121800              ELSE
121900              GO TO MOVE-FAIL-F1-38.
122000*    NOTE AN TO NE WITH CR SYMBOL.
122100     GO TO    MOVE-WRITE-F1-38.
122200 MOVE-DELETE-F1-38.
122300     PERFORM  DE-LETE.
122400     GO TO    MOVE-WRITE-F1-38.
122500 MOVE-FAIL-F1-38.
122600     MOVE     MOVE16 TO COMPUTED-A.
122700     MOVE "12345  " TO CORRECT-A.
122800     PERFORM  FAIL.
122900 MOVE-WRITE-F1-38.
123000     MOVE "MOVE-TEST-F1-38" TO PAR-NAME.
123100     PERFORM  PRINT-DETAIL.
123200 MOVE-INIT-F1-39.
123300     MOVE    "12345" TO MOVE50.
123400 MOVE-TEST-F1-39-0.
123500     MOVE     MOVE50 TO MOVE11.
123600 MOVE-TEST-F1-39-1.
123700     IF       MOVE11 EQUAL TO "$12,345.00"
123800              PERFORM PASS
123900              ELSE
124000              GO TO MOVE-FAIL-F1-39.
124100*    NOTE AN TO NNI MOVE, INSERTION CHARACTERS AND ZERO PADDING
124200*    ON RIGHT.
124300     GO TO    MOVE-WRITE-F1-39.
124400 MOVE-DELETE-F1-39.
124500     PERFORM  DE-LETE.
124600     GO TO    MOVE-WRITE-F1-39.
124700 MOVE-FAIL-F1-39.
124800     MOVE     MOVE11 TO COMPUTED-A.
124900     MOVE "$12,345.00" TO CORRECT-A.
125000     PERFORM  FAIL.
125100 MOVE-WRITE-F1-39.
125200     MOVE "MOVE-TEST-F1-39" TO PAR-NAME.
125300     PERFORM  PRINT-DETAIL.
125400 MOVE-INIT-F1-40.
125500     MOVE    "ABCDE" TO MOVE32.
125600 MOVE-TEST-F1-40-0.
125700     MOVE     MOVE32 TO MOVE21.
125800 MOVE-TEST-F1-40-1.
125900     IF       MOVE21 EQUAL TO "ABCDE  "
126000              PERFORM PASS
126100              ELSE
126200              GO TO MOVE-FAIL-F1-40.
126300*    NOTE AN TO AN MOVE, SPACE PADDING ON RIGHT.
126400     GO TO    MOVE-WRITE-F1-40.
126500 MOVE-DELETE-F1-40.
126600     PERFORM  DE-LETE.
126700     GO TO    MOVE-WRITE-F1-40.
126800 MOVE-FAIL-F1-40.
126900     MOVE     MOVE21 TO COMPUTED-A.
127000     MOVE "ABCDE  " TO CORRECT-A.
127100     PERFORM  FAIL.
127200 MOVE-WRITE-F1-40.
127300     MOVE "MOVE-TEST-F1-40" TO PAR-NAME.
127400     PERFORM  PRINT-DETAIL.
127500 MOVE-INIT-F1-41.
127600     MOVE    "ABCDE" TO MOVE32.
127700 MOVE-TEST-F1-41-0.
127800     MOVE     MOVE32 TO MOVE20.
127900 MOVE-TEST-F1-41-1.
128000     IF       MOVE20 EQUAL TO "ABCD"
128100              PERFORM PASS
128200              ELSE
128300              GO TO MOVE-FAIL-F1-41.
128400*    NOTE AN TO AN MOVE, TRUNCATION ON RIGHT.
128500     GO TO    MOVE-WRITE-F1-41.
128600 MOVE-DELETE-F1-41.
128700     PERFORM  DE-LETE.
128800     GO TO    MOVE-WRITE-F1-41.
128900 MOVE-FAIL-F1-41.
129000     MOVE     MOVE20 TO COMPUTED-A.
129100     MOVE "ABCD" TO CORRECT-A.
129200     PERFORM  FAIL.
129300 MOVE-WRITE-F1-41.
129400     MOVE "MOVE-TEST-F1-41" TO PAR-NAME.
129500     PERFORM  PRINT-DETAIL.
129600 MOVE-INIT-F1-42.
129700     MOVE    "ABCDE" TO MOVE32.
129800 MOVE-TEST-F1-42-0.
129900     MOVE     MOVE32 TO MOVE22.
130000 MOVE-TEST-F1-42-1.
130100     IF       MOVE22 EQUAL TO "A B0C D0E"
130200              PERFORM PASS
130300              ELSE
130400              GO TO MOVE-FAIL-F1-42.
130500*    NOTE AN TO AE MOVE, ZERO AND SPACE INSERTION.
130600     GO TO    MOVE-WRITE-F1-42.
130700 MOVE-DELETE-F1-42.
130800     PERFORM  DE-LETE.
130900     GO TO    MOVE-WRITE-F1-42.
131000 MOVE-FAIL-F1-42.
131100     MOVE     MOVE22 TO COMPUTED-A.
131200     MOVE "A B0C D0E" TO CORRECT-A.
131300     PERFORM  FAIL.
131400 MOVE-WRITE-F1-42.
131500     MOVE "MOVE-TEST-F1-42" TO PAR-NAME.
131600     PERFORM  PRINT-DETAIL.
131700 MOVE-INIT-F1-43.
131800     MOVE    "ABCDE" TO MOVE32.
131900 MOVE-TEST-F1-43-0.
132000     MOVE     MOVE32 TO MOVE33.
132100 MOVE-TEST-F1-43-1.
132200     IF       MOVE33 EQUAL TO "ABCDE"
132300              PERFORM PASS
132400              ELSE
132500              GO TO MOVE-FAIL-F1-43.
132600*    NOTE AN TO A MOVE, EQUAL SIZE.
132700     GO TO    MOVE-WRITE-F1-43.
132800 MOVE-DELETE-F1-43.
132900     PERFORM  DE-LETE.
133000     GO TO    MOVE-WRITE-F1-43.
133100 MOVE-FAIL-F1-43.
133200     MOVE     MOVE33 TO COMPUTED-A.
133300     MOVE "ABCDE" TO CORRECT-A.
133400     PERFORM  FAIL.
133500 MOVE-WRITE-F1-43.
133600     MOVE "MOVE-TEST-F1-43" TO PAR-NAME.
133700     PERFORM  PRINT-DETAIL.
133800 MOVE-INIT-F1-44.
133900     MOVE    "ABCDE" TO MOVE32.
134000 MOVE-TEST-F1-44-0.
134100     MOVE     MOVE32 TO MOVE34.
134200 MOVE-TEST-F1-44-1.
134300     IF       MOVE34 EQUAL TO "ABCDE  "
134400              PERFORM PASS
134500              ELSE
134600              GO TO MOVE-FAIL-F1-44.
134700*    NOTE AN TO A MOVE, SPACE PADDING ON RIGHT.
134800     GO TO    MOVE-WRITE-F1-44.
134900 MOVE-DELETE-F1-44.
135000     PERFORM  DE-LETE.
135100     GO TO    MOVE-WRITE-F1-44.
135200 MOVE-FAIL-F1-44.
135300     MOVE     MOVE34 TO COMPUTED-A.
135400     MOVE "ABCDE  " TO CORRECT-A.
135500     PERFORM  FAIL.
135600 MOVE-WRITE-F1-44.
135700     MOVE "MOVE-TEST-F1-44" TO PAR-NAME.
135800     PERFORM  PRINT-DETAIL.
135900 MOVE-INIT-F1-45.
136000     MOVE    "ABCDE" TO MOVE32.
136100 MOVE-TEST-F1-45-0.
136200     MOVE     MOVE32 TO MOVE35.
136300 MOVE-TEST-F1-45-1.
136400     IF       MOVE35 EQUAL TO "ABC"
136500              PERFORM PASS
136600              ELSE
136700              GO TO MOVE-FAIL-F1-45.
136800*    NOTE AN TO A MOVE, TRUNCATION ON RIGHT.
136900     GO TO    MOVE-WRITE-F1-45.
137000 MOVE-DELETE-F1-45.
137100     PERFORM  DE-LETE.
137200     GO TO    MOVE-WRITE-F1-45.
137300 MOVE-FAIL-F1-45.
137400     MOVE     MOVE35 TO COMPUTED-A.
137500     MOVE "ABC" TO CORRECT-A.
137600     PERFORM  FAIL.
137700 MOVE-WRITE-F1-45.
137800     MOVE "MOVE-TEST-F1-45" TO PAR-NAME.
137900     PERFORM  PRINT-DETAIL.
138000 MOVE-INIT-F1-46.
138100     MOVE    "1 A05" TO MOVE35A.
138200 MOVE-TEST-F1-46-0.
138300     MOVE     MOVE36 TO MOVE21.
138400 MOVE-TEST-F1-46-1.
138500     IF       MOVE21 EQUAL TO "1 A05  "
138600              PERFORM PASS
138700              ELSE
138800              GO TO MOVE-FAIL-F1-46.
138900*    NOTE AE TO AN MOVE, SPACE PADDING ON RIGHT.
139000     GO TO    MOVE-WRITE-F1-46.
139100 MOVE-DELETE-F1-46.
139200     PERFORM  DE-LETE.
139300     GO TO    MOVE-WRITE-F1-46.
139400 MOVE-FAIL-F1-46.
139500     MOVE     MOVE21 TO COMPUTED-A.
139600     MOVE "1 A05  " TO CORRECT-A.
139700     PERFORM  FAIL.
139800 MOVE-WRITE-F1-46.
139900     MOVE "MOVE-TEST-F1-46" TO PAR-NAME.
140000     PERFORM  PRINT-DETAIL.
140100 MOVE-INIT-F1-47.
140200     MOVE    "1 A05" TO MOVE35A.
140300 MOVE-TEST-F1-47-0.
140400     MOVE     MOVE36 TO MOVE20.
140500 MOVE-TEST-F1-47-1.
140600     IF       MOVE20 EQUAL TO "1 A0"
140700              PERFORM PASS
140800              ELSE
140900              GO TO MOVE-FAIL-F1-47.
141000*    NOTE AE TO AN MOVE, TRUNCATION ON RIGHT.
141100     GO TO    MOVE-WRITE-F1-47.
141200 MOVE-DELETE-F1-47.
141300     PERFORM  DE-LETE.
141400     GO TO    MOVE-WRITE-F1-47.
141500 MOVE-FAIL-F1-47.
141600     MOVE     MOVE20 TO COMPUTED-A.
141700     MOVE "1 A0" TO CORRECT-A.
141800     PERFORM  FAIL.
141900 MOVE-WRITE-F1-47.
142000     MOVE "MOVE-TEST-F1-47" TO PAR-NAME.
142100     PERFORM  PRINT-DETAIL.
142200 MOVE-INIT-F1-48.
142300     MOVE    "1 A05" TO MOVE35A.
142400 MOVE-TEST-F1-48-0.
142500     MOVE     MOVE36 TO MOVE39.
142600 MOVE-TEST-F1-48-1.
142700     IF       MOVE39 EQUAL TO "01 A050"
142800              PERFORM PASS
142900              ELSE
143000              GO TO MOVE-FAIL-F1-48.
143100*    NOTE AE TO AE MOVE, ZERO INSERTION.
143200     GO TO    MOVE-WRITE-F1-48.
143300 MOVE-DELETE-F1-48.
143400     PERFORM  DE-LETE.
143500     GO TO    MOVE-WRITE-F1-48.
143600 MOVE-FAIL-F1-48.
143700     MOVE     MOVE39 TO COMPUTED-A.
143800     MOVE "01 A050" TO CORRECT-A.
143900     PERFORM  FAIL.
144000 MOVE-WRITE-F1-48.
144100     MOVE "MOVE-TEST-F1-48" TO PAR-NAME.
144200     PERFORM  PRINT-DETAIL.
144300 MOVE-INIT-F1-49.
144400     MOVE    "1 A05" TO MOVE35A.
144500 MOVE-TEST-F1-49-0.
144600     MOVE     MOVE35A TO MOVE33.
144700 MOVE-TEST-F1-49-1.
144800     IF       MOVE33 EQUAL TO "1 A05"
144900              PERFORM PASS
145000              ELSE
145100              GO TO MOVE-FAIL-F1-49.
145200*    NOTE AE TO A MOVE, EQUAL SIZE.
145300     GO TO    MOVE-WRITE-F1-49.
145400 MOVE-DELETE-F1-49.
145500     PERFORM  DE-LETE.
145600     GO TO    MOVE-WRITE-F1-49.
145700 MOVE-FAIL-F1-49.
145800     MOVE     MOVE33 TO COMPUTED-A.
145900     MOVE "1 A05" TO CORRECT-A.
146000     PERFORM  FAIL.
146100 MOVE-WRITE-F1-49.
146200     MOVE "MOVE-TEST-F1-49" TO PAR-NAME.
146300     PERFORM  PRINT-DETAIL.
146400 MOVE-INIT-F1-50.
146500     MOVE    "1 A05" TO MOVE35A.
146600 MOVE-TEST-F1-50-0.
146700     MOVE     MOVE35A TO MOVE34.
146800 MOVE-TEST-F1-50-1.
146900     IF       MOVE34 EQUAL TO "1 A05  "
147000              PERFORM PASS
147100              ELSE
147200              GO TO MOVE-FAIL-F1-50.
147300*    NOTE AE TO A MOVE, SPACE PADDING ON RIGHT.
147400     GO TO    MOVE-WRITE-F1-50.
147500 MOVE-DELETE-F1-50.
147600     PERFORM  DE-LETE.
147700     GO TO    MOVE-WRITE-F1-50.
147800 MOVE-FAIL-F1-50.
147900     MOVE     MOVE34 TO COMPUTED-A.
148000     MOVE "1 A05  " TO CORRECT-A.
148100     PERFORM  FAIL.
148200 MOVE-WRITE-F1-50.
148300     MOVE "MOVE-TEST-F1-50" TO PAR-NAME.
148400     PERFORM  PRINT-DETAIL.
148500 MOVE-INIT-F1-51.
148600     MOVE    "1 A05" TO MOVE35A.
148700 MOVE-TEST-F1-51-0.
148800     MOVE     MOVE35A TO MOVE35.
148900 MOVE-TEST-F1-51-1.
149000     IF       MOVE35 EQUAL TO "1 A"
149100              PERFORM PASS
149200              ELSE
149300              GO TO MOVE-FAIL-F1-51.
149400*    NOTE AE TO A MOVE, TRUNCATION ON RIGHT.
149500     GO TO    MOVE-WRITE-F1-51.
149600 MOVE-DELETE-F1-51.
149700     PERFORM  DE-LETE.
149800     GO TO    MOVE-WRITE-F1-51.
149900 MOVE-FAIL-F1-51.
150000     MOVE     MOVE35 TO COMPUTED-A.
150100     MOVE "1 A" TO CORRECT-A.
150200     PERFORM  FAIL.
150300 MOVE-WRITE-F1-51.
150400     MOVE "MOVE-TEST-F1-51" TO PAR-NAME.
150500     PERFORM  PRINT-DETAIL.
150600 MOVE-INIT-F1-52.
150700     MOVE    "ABCDE" TO MOVE37.
150800     MOVE    "MOVE ALPHABETIC     " TO FEATURE.
150900 MOVE-TEST-F1-52-0.
151000     MOVE     MOVE37 TO MOVE21.
151100 MOVE-TEST-F1-52-1.
151200     IF       MOVE21 EQUAL TO "ABCDE  "
151300              PERFORM PASS
151400              ELSE
151500              GO TO MOVE-FAIL-F1-52.
151600*    NOTE A TO AN MOVE, SPACE PADDING ON RIGHT.
151700     GO TO    MOVE-WRITE-F1-52.
151800 MOVE-DELETE-F1-52.
151900     PERFORM  DE-LETE.
152000     GO TO    MOVE-WRITE-F1-52.
152100 MOVE-FAIL-F1-52.
152200     MOVE     MOVE21 TO COMPUTED-A.
152300     MOVE "ABCDE  " TO CORRECT-A.
152400     PERFORM  FAIL.
152500 MOVE-WRITE-F1-52.
152600     MOVE "MOVE-TEST-F1-52" TO PAR-NAME.
152700     PERFORM  PRINT-DETAIL.
152800 MOVE-INIT-F1-53.
152900     MOVE    "ABCDE" TO MOVE37.
153000 MOVE-TEST-F1-53-0.
153100     MOVE     MOVE37 TO MOVE20.
153200 MOVE-TEST-F1-53-1.
153300     IF       MOVE20 EQUAL TO "ABCD"
153400              PERFORM PASS
153500              ELSE
153600              GO TO MOVE-FAIL-F1-53.
153700*    NOTE A TO AN MOVE, TRUNCATION ON RIGHT.
153800     GO TO    MOVE-WRITE-F1-53.
153900 MOVE-DELETE-F1-53.
154000     PERFORM  DE-LETE.
154100     GO TO    MOVE-WRITE-F1-53.
154200 MOVE-FAIL-F1-53.
154300     MOVE     MOVE20 TO COMPUTED-A.
154400     MOVE "ABCD" TO CORRECT-A.
154500     PERFORM  FAIL.
154600 MOVE-WRITE-F1-53.
154700     MOVE "MOVE-TEST-F1-53" TO PAR-NAME.
154800     PERFORM  PRINT-DETAIL.
154900 MOVE-INIT-F1-54.
155000     MOVE    "ABCDE" TO MOVE37.
155100 MOVE-TEST-F1-54-0.
155200     MOVE     MOVE37 TO MOVE39.
155300 MOVE-TEST-F1-54-1.
155400     IF       MOVE39 EQUAL TO "0ABCDE0"
155500              PERFORM PASS
155600              ELSE
155700              GO TO MOVE-FAIL-F1-54.
155800*    NOTE A TO AE MOVE, ZERO INSERTION.
155900     GO TO    MOVE-WRITE-F1-54.
156000 MOVE-DELETE-F1-54.
156100     PERFORM  DE-LETE.
156200     GO TO    MOVE-WRITE-F1-54.
156300 MOVE-FAIL-F1-54.
156400     MOVE     MOVE39 TO COMPUTED-A.
156500     MOVE "0ABCDE0" TO CORRECT-A.
156600     PERFORM  FAIL.
156700 MOVE-WRITE-F1-54.
156800     MOVE "MOVE-TEST-F1-54" TO PAR-NAME.
156900     PERFORM  PRINT-DETAIL.
157000 MOVE-INIT-F1-55.
157100     MOVE    "ABCDE" TO MOVE37.
157200 MOVE-TEST-F1-55-0.
157300     MOVE     MOVE37 TO MOVE34.
157400 MOVE-TEST-F1-55-1.
157500     IF       MOVE34 EQUAL TO "ABCDE  "
157600              PERFORM PASS
157700              ELSE
157800              GO TO MOVE-FAIL-F1-55.
157900*    NOTE A TO A MOVE, SPACE PADDING ON RIGHT.
158000     GO TO    MOVE-WRITE-F1-55.
158100 MOVE-DELETE-F1-55.
158200     PERFORM  DE-LETE.
158300     GO TO    MOVE-WRITE-F1-55.
158400 MOVE-FAIL-F1-55.
158500     MOVE     MOVE4 TO COMPUTED-A.
158600     MOVE "ABCDE  " TO CORRECT-A.
158700     PERFORM  FAIL.
158800 MOVE-WRITE-F1-55.
158900     MOVE "MOVE-TEST-F1-55" TO PAR-NAME.
159000     PERFORM  PRINT-DETAIL.
159100 MOVE-INIT-F1-56.
159200     MOVE    "ABCDE" TO MOVE37.
159300 MOVE-TEST-F1-56-0.
159400     MOVE     MOVE37 TO MOVE35.
159500 MOVE-TEST-F1-56-1.
159600     IF       MOVE35 EQUAL TO "ABC"
159700              PERFORM PASS
159800              ELSE
159900              GO TO MOVE-FAIL-F1-56.
160000*    NOTE A TO A MOVE, TRUNCATION ON RIGHT.
160100     GO TO    MOVE-WRITE-F1-56.
160200 MOVE-DELETE-F1-56.
160300     PERFORM  DE-LETE.
160400     GO TO    MOVE-WRITE-F1-56.
160500 MOVE-FAIL-F1-56.
160600     MOVE     MOVE35 TO COMPUTED-A.
160700     MOVE "ABC" TO CORRECT-A.
160800     PERFORM  FAIL.
160900 MOVE-WRITE-F1-56.
161000     MOVE "MOVE-TEST-F1-56" TO PAR-NAME.
161100     PERFORM PRINT-DETAIL.
161200 NUMERIC-OPERAND-LIMITS-TESTS SECTION.
161300 MOVE-INIT-F1-57-1.
161400     MOVE "MOVE LIMITS TESTS " TO FEATURE.
161500     MOVE  1 TO DNAME1.
161600*    NOTE  THE FOLLOWING 44 TESTS WILL TEST THE LIMITS OF
161700*        THE MOVE STATEMENT WITH OVER 20 OPERANDS, A DELETION
161800*        PLACED IN THIS PARAGRAPH WILL SKIP THE LIMITS TESTS
161900*        BUT A NOTE  STATEMENT MAY NEED TO BE PLACED IN EACH TEST.
162000     GO TO MOVE-TEST-F1-57-0.
162100 MOVE-INIT-DELETE-F1-57-1.
162200     PERFORM DE-LETE.
162300     MOVE "MOVE LIMITS TESTS " TO FEATURE.
162400     MOVE "MOVE-TEST, F1-57-1 THRU F1-58-21" TO PAR-NAME.
162500     PERFORM PRINT-DETAIL.
162600     ADD 43 TO DELETE-COUNTER.
162700     GO TO MOVE-INIT-F1-58.
162800 MOVE-TEST-F1-57-0.
162900     MOVE DNAME1 TO DNAME22  DNAME23  DNAME24  DNAME25  DNAME26
163000         DNAME27  DNAME28  DNAME29  DNAME30  DNAME31  DNAME32
163100         DNAME33  DNAME34  DNAME35  DNAME36  DNAME37  DNAME38
163200         DNAME39  DNAME40  DNAME41  DNAME42  DNAME19.
163300 MOVE-TEST-F1-57-1.
163400     IF DNAME19 EQUAL TO 1
163500         PERFORM PASS
163600         GO TO MOVE-WRITE-F1-57-1.
163700     MOVE 1 TO CORRECT-18V0.
163800     MOVE DNAME19 TO COMPUTED-18V0.
163900     PERFORM FAIL.
164000     GO TO MOVE-WRITE-F1-57-1.
164100 MOVE-DELETE-F1-57-1.
164200     PERFORM DE-LETE.
164300*    NOTE  *** A DELETE IN THIS TEST WILL CAUSE THE NEXT
164400*        43 TESTS TO FAIL.
164500 MOVE-WRITE-F1-57-1.
164600     MOVE "MOVE-TEST-F1-57-1 " TO PAR-NAME.
164700     PERFORM PRINT-DETAIL.
164800 MOVE-TEST-F1-57-2.
164900     IF DNAME22 EQUAL TO 1
165000         PERFORM PASS
165100         GO TO MOVE-WRITE-F1-57-2.
165200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
165300     MOVE DNAME22 TO COMPUTED-18V0.
165400     MOVE 1 TO CORRECT-18V0.
165500     PERFORM FAIL.
165600     GO TO MOVE-WRITE-F1-57-2.
165700 MOVE-DELETE-F1-57-2.
165800     PERFORM DE-LETE.
165900 MOVE-WRITE-F1-57-2.
166000     MOVE "MOVE-TEST-F1-57-2 " TO PAR-NAME.
166100     PERFORM PRINT-DETAIL.
166200 MOVE-TEST-F1-57-3.
166300     IF DNAME23 EQUAL TO 1
166400         PERFORM PASS
166500         GO TO MOVE-WRITE-F1-57-3.
166600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
166700     MOVE DNAME23 TO COMPUTED-18V0.
166800     MOVE 1 TO CORRECT-18V0.
166900     PERFORM FAIL.
167000     GO TO MOVE-WRITE-F1-57-3.
167100 MOVE-DELETE-F1-57-3.
167200     PERFORM DE-LETE.
167300 MOVE-WRITE-F1-57-3.
167400     MOVE "MOVE-TEST-F1-57-3 " TO PAR-NAME.
167500     PERFORM PRINT-DETAIL.
167600 MOVE-TEST-F1-57-4.
167700     IF DNAME24 EQUAL TO 1
167800         PERFORM PASS
167900         GO TO MOVE-WRITE-F1-57-4.
168000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
168100     MOVE DNAME24 TO COMPUTED-18V0.
168200     MOVE 1 TO CORRECT-18V0.
168300     PERFORM FAIL.
168400     GO TO MOVE-WRITE-F1-57-4.
168500 MOVE-DELETE-F1-57-4.
168600     PERFORM DE-LETE.
168700 MOVE-WRITE-F1-57-4.
168800     MOVE "MOVE-TEST-F1-57-4 " TO PAR-NAME.
168900     PERFORM PRINT-DETAIL.
169000 MOVE-TEST-F1-57-5.
169100     IF DNAME25 EQUAL TO 1
169200         PERFORM PASS
169300         GO TO MOVE-WRITE-F1-57-5.
169400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
169500     MOVE DNAME25 TO COMPUTED-18V0.
169600     MOVE 1 TO CORRECT-18V0.
169700     PERFORM FAIL.
169800     GO TO MOVE-WRITE-F1-57-5.
169900 MOVE-DELETE-F1-57-5.
170000     PERFORM DE-LETE.
170100 MOVE-WRITE-F1-57-5.
170200     MOVE "MOVE-TEST-F1-57-5 " TO PAR-NAME.
170300     PERFORM PRINT-DETAIL.
170400 MOVE-TEST-F1-57-6.
170500     IF DNAME26 EQUAL TO 1
170600         PERFORM PASS
170700         GO TO MOVE-WRITE-F1-57-6.
170800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
170900     MOVE DNAME26 TO COMPUTED-18V0.
171000     MOVE 1 TO CORRECT-18V0.
171100     PERFORM FAIL.
171200     GO TO MOVE-WRITE-F1-57-6.
171300 MOVE-DELETE-F1-57-6.
171400     PERFORM DE-LETE.
171500 MOVE-WRITE-F1-57-6.
171600     MOVE "MOVE-TEST-F1-57-6 " TO PAR-NAME.
171700     PERFORM PRINT-DETAIL.
171800 MOVE-TEST-F1-57-7.
171900     IF DNAME27 EQUAL TO 1
172000         PERFORM PASS
172100         GO TO MOVE-WRITE-F1-57-7.
172200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
172300     MOVE DNAME27 TO COMPUTED-18V0.
172400     MOVE 1 TO CORRECT-18V0.
172500     PERFORM FAIL.
172600     GO TO MOVE-WRITE-F1-57-7.
172700 MOVE-DELETE-F1-57-7.
172800     PERFORM DE-LETE.
172900 MOVE-WRITE-F1-57-7.
173000     MOVE "MOVE-TEST-F1-57-7 " TO PAR-NAME.
173100     PERFORM PRINT-DETAIL.
173200 MOVE-TEST-F1-57-8.
173300     IF DNAME28 EQUAL TO 1
173400         PERFORM PASS
173500         GO TO MOVE-WRITE-F1-57-8.
173600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
173700     MOVE DNAME28 TO COMPUTED-18V0.
173800     MOVE 1 TO CORRECT-18V0.
173900     PERFORM FAIL.
174000     GO TO MOVE-WRITE-F1-57-8.
174100 MOVE-DELETE-F1-57-8.
174200     PERFORM DE-LETE.
174300 MOVE-WRITE-F1-57-8.
174400     MOVE "MOVE-TEST-F1-57-8 " TO PAR-NAME.
174500     PERFORM PRINT-DETAIL.
174600 MOVE-TEST-F1-57-9.
174700     IF DNAME29 EQUAL TO 1
174800         PERFORM PASS
174900         GO TO MOVE-WRITE-F1-57-9.
175000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
175100     MOVE DNAME29 TO COMPUTED-18V0.
175200     MOVE 1 TO CORRECT-18V0.
175300     PERFORM FAIL.
175400     GO TO MOVE-WRITE-F1-57-9.
175500 MOVE-DELETE-F1-57-9.
175600     PERFORM DE-LETE.
175700 MOVE-WRITE-F1-57-9.
175800     MOVE "MOVE-TEST-F1-57-9 " TO PAR-NAME.
175900     PERFORM PRINT-DETAIL.
176000 MOVE-TEST-F1-57-10.
176100     IF DNAME30 EQUAL TO 1
176200         PERFORM PASS
176300         GO TO MOVE-WRITE-F1-57-10.
176400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
176500     MOVE DNAME30 TO COMPUTED-18V0.
176600     MOVE 1 TO CORRECT-18V0.
176700     PERFORM FAIL.
176800     GO TO MOVE-WRITE-F1-57-10.
176900 MOVE-DELETE-F1-57-10.
177000     PERFORM DE-LETE.
177100 MOVE-WRITE-F1-57-10.
177200     MOVE "MOVE-TEST-F1-57-10 " TO PAR-NAME.
177300     PERFORM PRINT-DETAIL.
177400 MOVE-TEST-F1-57-11.
177500     IF DNAME31 EQUAL TO 1
177600         PERFORM PASS
177700         GO TO MOVE-WRITE-F1-57-11.
177800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
177900     MOVE DNAME31 TO COMPUTED-18V0.
178000     MOVE 1 TO CORRECT-18V0.
178100     PERFORM FAIL.
178200     GO TO MOVE-WRITE-F1-57-11.
178300 MOVE-DELETE-F1-57-11.
178400     PERFORM DE-LETE.
178500 MOVE-WRITE-F1-57-11.
178600     MOVE "MOVE-TEST-F1-57-11 " TO PAR-NAME.
178700     PERFORM PRINT-DETAIL.
178800 MOVE-TEST-F1-57-12.
178900     IF DNAME32 EQUAL TO 1
179000         PERFORM PASS
179100         GO TO MOVE-WRITE-F1-57-12.
179200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
179300     MOVE DNAME32 TO COMPUTED-18V0.
179400     MOVE 1 TO CORRECT-18V0.
179500     PERFORM FAIL.
179600     GO TO MOVE-WRITE-F1-57-12.
179700 MOVE-DELETE-F1-57-12.
179800     PERFORM DE-LETE.
179900 MOVE-WRITE-F1-57-12.
180000     MOVE "MOVE-TEST-F1-57-12 " TO PAR-NAME.
180100     PERFORM PRINT-DETAIL.
180200 MOVE-TEST-F1-57-13.
180300     IF DNAME33 EQUAL TO 1
180400         PERFORM PASS
180500         GO TO MOVE-WRITE-F1-57-13.
180600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
180700     MOVE DNAME33 TO COMPUTED-18V0.
180800     MOVE 1 TO CORRECT-18V0.
180900     PERFORM FAIL.
181000     GO TO MOVE-WRITE-F1-57-13.
181100 MOVE-DELETE-F1-57-13.
181200     PERFORM DE-LETE.
181300 MOVE-WRITE-F1-57-13.
181400     MOVE "MOVE-TEST-F1-57-13 " TO PAR-NAME.
181500     PERFORM PRINT-DETAIL.
181600 MOVE-TEST-F1-57-14.
181700     IF DNAME34 EQUAL TO 1
181800         PERFORM PASS
181900         GO TO MOVE-WRITE-F1-57-14.
182000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
182100     MOVE DNAME34 TO COMPUTED-18V0.
182200     MOVE 1 TO CORRECT-18V0.
182300     PERFORM FAIL.
182400     GO TO MOVE-WRITE-F1-57-14.
182500 MOVE-DELETE-F1-57-14.
182600     PERFORM DE-LETE.
182700 MOVE-WRITE-F1-57-14.
182800     MOVE "MOVE-TEST-F1-57-14 " TO PAR-NAME.
182900     PERFORM PRINT-DETAIL.
183000 MOVE-TEST-F1-57-15.
183100     IF DNAME35 EQUAL TO 1
183200         PERFORM PASS
183300         GO TO MOVE-WRITE-F1-57-15.
183400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
183500     MOVE DNAME35 TO COMPUTED-18V0.
183600     MOVE 1 TO CORRECT-18V0.
183700     PERFORM FAIL.
183800     GO TO MOVE-WRITE-F1-57-15.
183900 MOVE-DELETE-F1-57-15.
184000     PERFORM DE-LETE.
184100 MOVE-WRITE-F1-57-15.
184200     MOVE "MOVE-TEST-F1-57-15 " TO PAR-NAME.
184300     PERFORM PRINT-DETAIL.
184400 MOVE-TEST-F1-57-16.
184500     IF DNAME36 EQUAL TO 1
184600         PERFORM PASS
184700         GO TO MOVE-WRITE-F1-57-16.
184800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
184900     MOVE DNAME36 TO COMPUTED-18V0.
185000     MOVE 1 TO CORRECT-18V0.
185100     PERFORM FAIL.
185200     GO TO MOVE-WRITE-F1-57-16.
185300 MOVE-DELETE-F1-57-16.
185400     PERFORM DE-LETE.
185500 MOVE-WRITE-F1-57-16.
185600     MOVE "MOVE-TEST-F1-57-16 " TO PAR-NAME.
185700     PERFORM PRINT-DETAIL.
185800 MOVE-TEST-F1-57-17.
185900     IF DNAME37 EQUAL TO 1
186000         PERFORM PASS
186100         GO TO MOVE-WRITE-F1-57-17.
186200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
186300     MOVE DNAME37 TO COMPUTED-18V0.
186400     MOVE 1 TO CORRECT-18V0.
186500     PERFORM FAIL.
186600     GO TO MOVE-WRITE-F1-57-17.
186700 MOVE-DELETE-F1-57-17.
186800     PERFORM DE-LETE.
186900 MOVE-WRITE-F1-57-17.
187000     MOVE "MOVE-TEST-F1-57-17 " TO PAR-NAME.
187100     PERFORM PRINT-DETAIL.
187200 MOVE-TEST-F1-57-18.
187300     IF DNAME38 EQUAL TO 1
187400         PERFORM PASS
187500         GO TO MOVE-WRITE-F1-57-18.
187600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
187700     MOVE DNAME38 TO COMPUTED-18V0.
187800     MOVE 1 TO CORRECT-18V0.
187900     PERFORM FAIL.
188000     GO TO MOVE-WRITE-F1-57-18.
188100 MOVE-DELETE-F1-57-18.
188200     PERFORM DE-LETE.
188300 MOVE-WRITE-F1-57-18.
188400     MOVE "MOVE-TEST-F1-57-18 " TO PAR-NAME.
188500     PERFORM PRINT-DETAIL.
188600 MOVE-TEST-F1-57-19.
188700     IF DNAME39 EQUAL TO 1
188800         PERFORM PASS
188900         GO TO MOVE-WRITE-F1-57-19.
189000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
189100     MOVE DNAME39 TO COMPUTED-18V0.
189200     MOVE 1 TO CORRECT-18V0.
189300     PERFORM FAIL.
189400     GO TO MOVE-WRITE-F1-57-19.
189500 MOVE-DELETE-F1-57-19.
189600     PERFORM DE-LETE.
189700 MOVE-WRITE-F1-57-19.
189800     MOVE "MOVE-TEST-F1-57-19 " TO PAR-NAME.
189900     PERFORM PRINT-DETAIL.
190000 MOVE-TEST-F1-57-20.
190100     IF DNAME40 EQUAL TO 1
190200         PERFORM PASS
190300         GO TO MOVE-WRITE-F1-57-20.
190400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
190500     MOVE DNAME40 TO COMPUTED-18V0.
190600     MOVE 1 TO CORRECT-18V0.
190700     PERFORM FAIL.
190800     GO TO MOVE-WRITE-F1-57-20.
190900 MOVE-DELETE-F1-57-20.
191000     PERFORM DE-LETE.
191100 MOVE-WRITE-F1-57-20.
191200     MOVE "MOVE-TEST-F1-57-20 " TO PAR-NAME.
191300     PERFORM PRINT-DETAIL.
191400 MOVE-TEST-F1-57-21.
191500     IF DNAME41 EQUAL TO 1
191600         PERFORM PASS
191700         GO TO MOVE-WRITE-F1-57-21.
191800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
191900     MOVE DNAME41 TO COMPUTED-18V0.
192000     MOVE 1 TO CORRECT-18V0.
192100     PERFORM FAIL.
192200     GO TO MOVE-WRITE-F1-57-21.
192300 MOVE-DELETE-F1-57-21.
192400     PERFORM DE-LETE.
192500 MOVE-WRITE-F1-57-21.
192600     MOVE "MOVE-TEST-F1-57-21 " TO PAR-NAME.
192700     PERFORM PRINT-DETAIL.
192800 MOVE-TEST-F1-57-22.
192900     IF DNAME42 EQUAL TO 1
193000         PERFORM PASS
193100         GO TO MOVE-WRITE-F1-57-22.
193200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-57-1.
193300     MOVE DNAME42 TO COMPUTED-18V0.
193400     MOVE 1 TO CORRECT-18V0.
193500     PERFORM FAIL.
193600     GO TO MOVE-WRITE-F1-57-22.
193700 MOVE-DELETE-F1-57-22.
193800     PERFORM DE-LETE.
193900 MOVE-WRITE-F1-57-22.
194000     MOVE "MOVE-TEST-F1-57-22 " TO PAR-NAME.
194100     PERFORM PRINT-DETAIL.
194200 MOVE-INIT-F1-58.
194300     MOVE    000000000000000001 TO DNAME18.
194400 MOVE-TEST-F1-58-0.
194500     MOVE DNAME18 TO DNAME22  DNAME23  DNAME24  DNAME25  DNAME26
194600         DNAME27  DNAME28  DNAME29  DNAME30  DNAME31  DNAME32
194700         DNAME33  DNAME34  DNAME35  DNAME36  DNAME37  DNAME38
194800         DNAME39  DNAME40  DNAME41  DNAME42.
194900 MOVE-TEST-F1-58-1.
195000     IF DNAME22 EQUAL TO 1
195100         PERFORM PASS
195200         GO TO MOVE-WRITE-F1-58-1.
195300     MOVE DNAME22 TO COMPUTED-18V0.
195400     MOVE 1 TO CORRECT-18V0.
195500     PERFORM FAIL.
195600     GO TO MOVE-WRITE-F1-58-1.
195700 MOVE-DELETE-F1-58-1.
195800     PERFORM DE-LETE.
195900 MOVE-WRITE-F1-58-1.
196000     MOVE "MOVE-TEST-F1-58-1 " TO PAR-NAME.
196100     PERFORM PRINT-DETAIL.
196200 MOVE-TEST-F1-58-2.
196300     IF DNAME23 EQUAL TO 1
196400         PERFORM PASS
196500         GO TO MOVE-WRITE-F1-58-2.
196600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
196700     MOVE DNAME23 TO COMPUTED-18V0.
196800     MOVE 1 TO CORRECT-18V0.
196900     PERFORM FAIL.
197000     GO TO MOVE-WRITE-F1-58-2.
197100 MOVE-DELETE-F1-58-2.
197200     PERFORM DE-LETE.
197300 MOVE-WRITE-F1-58-2.
197400     MOVE "MOVE-TEST-F1-58-2 " TO PAR-NAME.
197500     PERFORM PRINT-DETAIL.
197600 MOVE-TEST-F1-58-3.
197700     IF DNAME24 EQUAL TO 1
197800         PERFORM PASS
197900         GO TO MOVE-WRITE-F1-58-3.
198000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
198100     MOVE DNAME24 TO COMPUTED-18V0.
198200     MOVE 1 TO CORRECT-18V0.
198300     PERFORM FAIL.
198400     GO TO MOVE-WRITE-F1-58-3.
198500 MOVE-DELETE-F1-58-3.
198600     PERFORM DE-LETE.
198700 MOVE-WRITE-F1-58-3.
198800     MOVE "MOVE-TEST-F1-58-3 " TO PAR-NAME.
198900     PERFORM PRINT-DETAIL.
199000 MOVE-TEST-F1-58-4.
199100     IF DNAME25 EQUAL TO 1
199200         PERFORM PASS
199300         GO TO MOVE-WRITE-F1-58-4.
199400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
199500     MOVE DNAME25 TO COMPUTED-18V0.
199600     MOVE 1 TO CORRECT-18V0.
199700     PERFORM FAIL.
199800     GO TO MOVE-WRITE-F1-58-4.
199900 MOVE-DELETE-F1-58-4.
200000     PERFORM DE-LETE.
200100 MOVE-WRITE-F1-58-4.
200200     MOVE "MOVE-TEST-F1-58-4 " TO PAR-NAME.
200300     PERFORM PRINT-DETAIL.
200400 MOVE-TEST-F1-58-5.
200500     IF DNAME26 EQUAL TO 1
200600         PERFORM PASS
200700         GO TO MOVE-WRITE-F1-58-5.
200800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
200900     MOVE DNAME26 TO COMPUTED-18V0.
201000     MOVE 1 TO CORRECT-18V0.
201100     PERFORM FAIL.
201200     GO TO MOVE-WRITE-F1-58-5.
201300 MOVE-DELETE-F1-58-5.
201400     PERFORM DE-LETE.
201500 MOVE-WRITE-F1-58-5.
201600     MOVE "MOVE-TEST-F1-58-5 " TO PAR-NAME.
201700     PERFORM PRINT-DETAIL.
201800 MOVE-TEST-F1-58-6.
201900     IF DNAME27 EQUAL TO 1
202000         PERFORM PASS
202100         GO TO MOVE-WRITE-F1-58-6.
202200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
202300     MOVE DNAME27 TO COMPUTED-18V0.
202400     MOVE 1 TO CORRECT-18V0.
202500     PERFORM FAIL.
202600     GO TO MOVE-WRITE-F1-58-6.
202700 MOVE-DELETE-F1-58-6.
202800     PERFORM DE-LETE.
202900 MOVE-WRITE-F1-58-6.
203000     MOVE "MOVE-TEST-F1-58-6 " TO PAR-NAME.
203100     PERFORM PRINT-DETAIL.
203200 MOVE-TEST-F1-58-7.
203300     IF DNAME28 EQUAL TO 1
203400         PERFORM PASS
203500         GO TO MOVE-WRITE-F1-58-7.
203600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
203700     MOVE DNAME28 TO COMPUTED-18V0.
203800     MOVE 1 TO CORRECT-18V0.
203900     PERFORM FAIL.
204000     GO TO MOVE-WRITE-F1-58-7.
204100 MOVE-DELETE-F1-58-7.
204200     PERFORM DE-LETE.
204300 MOVE-WRITE-F1-58-7.
204400     MOVE "MOVE-TEST-F1-58-7 " TO PAR-NAME.
204500     PERFORM PRINT-DETAIL.
204600 MOVE-TEST-F1-58-8.
204700     IF DNAME29 EQUAL TO 1
204800         PERFORM PASS
204900         GO TO MOVE-WRITE-F1-58-8.
205000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
205100     MOVE DNAME29 TO COMPUTED-18V0.
205200     MOVE 1 TO CORRECT-18V0.
205300     PERFORM FAIL.
205400     GO TO MOVE-WRITE-F1-58-8.
205500 MOVE-DELETE-F1-58-8.
205600     PERFORM DE-LETE.
205700 MOVE-WRITE-F1-58-8.
205800     MOVE "MOVE-TEST-F1-58-8 " TO PAR-NAME.
205900     PERFORM PRINT-DETAIL.
206000 MOVE-TEST-F1-58-9.
206100     IF DNAME30 EQUAL TO 1
206200         PERFORM PASS
206300         GO TO MOVE-WRITE-F1-58-9.
206400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
206500     MOVE DNAME30 TO COMPUTED-18V0.
206600     MOVE 1 TO CORRECT-18V0.
206700     PERFORM FAIL.
206800     GO TO MOVE-WRITE-F1-58-9.
206900 MOVE-DELETE-F1-58-9.
207000     PERFORM DE-LETE.
207100 MOVE-WRITE-F1-58-9.
207200     MOVE "MOVE-TEST-F1-58-9 " TO PAR-NAME.
207300     PERFORM PRINT-DETAIL.
207400 MOVE-TEST-F1-58-10.
207500     IF DNAME31 EQUAL TO 1
207600         PERFORM PASS
207700         GO TO MOVE-WRITE-F1-58-10.
207800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
207900     MOVE DNAME31 TO COMPUTED-18V0.
208000     MOVE 1 TO CORRECT-18V0.
208100     PERFORM FAIL.
208200     GO TO MOVE-WRITE-F1-58-10.
208300 MOVE-DELETE-F1-58-10.
208400     PERFORM DE-LETE.
208500 MOVE-WRITE-F1-58-10.
208600     MOVE "MOVE-TEST-F1-58-10 " TO PAR-NAME.
208700     PERFORM PRINT-DETAIL.
208800 MOVE-TEST-F1-58-11.
208900     IF DNAME32 EQUAL TO 1
209000         PERFORM PASS
209100         GO TO MOVE-WRITE-F1-58-11.
209200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
209300     MOVE DNAME32 TO COMPUTED-18V0.
209400     MOVE 1 TO CORRECT-18V0.
209500     PERFORM FAIL.
209600     GO TO MOVE-WRITE-F1-58-11.
209700 MOVE-DELETE-F1-58-11.
209800     PERFORM DE-LETE.
209900 MOVE-WRITE-F1-58-11.
210000     MOVE "MOVE-TEST-F1-58-11 " TO PAR-NAME.
210100     PERFORM PRINT-DETAIL.
210200 MOVE-TEST-F1-58-12.
210300     IF DNAME33 EQUAL TO 1
210400         PERFORM PASS
210500         GO TO MOVE-WRITE-F1-58-12.
210600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
210700     MOVE DNAME33 TO COMPUTED-18V0.
210800     MOVE 1 TO CORRECT-18V0.
210900     PERFORM FAIL.
211000     GO TO MOVE-WRITE-F1-58-12.
211100 MOVE-DELETE-F1-58-12.
211200     PERFORM DE-LETE.
211300 MOVE-WRITE-F1-58-12.
211400     MOVE "MOVE-TEST-F1-58-12 " TO PAR-NAME.
211500     PERFORM PRINT-DETAIL.
211600 MOVE-TEST-F1-58-13.
211700     IF DNAME34 EQUAL TO 1
211800         PERFORM PASS
211900         GO TO MOVE-WRITE-F1-58-13.
212000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
212100     MOVE DNAME34 TO COMPUTED-18V0.
212200     MOVE 1 TO CORRECT-18V0.
212300     PERFORM FAIL.
212400     GO TO MOVE-WRITE-F1-58-13.
212500 MOVE-DELETE-F1-58-13.
212600     PERFORM DE-LETE.
212700 MOVE-WRITE-F1-58-13.
212800     MOVE "MOVE-TEST-F1-58-13 " TO PAR-NAME.
212900     PERFORM PRINT-DETAIL.
213000 MOVE-TEST-F1-58-14.
213100     IF DNAME35 EQUAL TO 1
213200         PERFORM PASS
213300         GO TO MOVE-WRITE-F1-58-14.
213400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
213500     MOVE DNAME35 TO COMPUTED-18V0.
213600     MOVE 1 TO CORRECT-18V0.
213700     PERFORM FAIL.
213800     GO TO MOVE-WRITE-F1-58-14.
213900 MOVE-DELETE-F1-58-14.
214000     PERFORM DE-LETE.
214100 MOVE-WRITE-F1-58-14.
214200     MOVE "MOVE-TEST-F1-58-14 " TO PAR-NAME.
214300     PERFORM PRINT-DETAIL.
214400 MOVE-TEST-F1-58-15.
214500     IF DNAME36 EQUAL TO 1
214600         PERFORM PASS
214700         GO TO MOVE-WRITE-F1-58-15.
214800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
214900     MOVE DNAME36 TO COMPUTED-18V0.
215000     MOVE 1 TO CORRECT-18V0.
215100     PERFORM FAIL.
215200     GO TO MOVE-WRITE-F1-58-15.
215300 MOVE-DELETE-F1-58-15.
215400     PERFORM DE-LETE.
215500 MOVE-WRITE-F1-58-15.
215600     MOVE "MOVE-TEST-F1-58-15 " TO PAR-NAME.
215700     PERFORM PRINT-DETAIL.
215800 MOVE-TEST-F1-58-16.
215900     IF DNAME37 EQUAL TO 1
216000         PERFORM PASS
216100         GO TO MOVE-WRITE-F1-58-16.
216200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
216300     MOVE DNAME37 TO COMPUTED-18V0.
216400     MOVE 1 TO CORRECT-18V0.
216500     PERFORM FAIL.
216600     GO TO MOVE-WRITE-F1-58-16.
216700 MOVE-DELETE-F1-58-16.
216800     PERFORM DE-LETE.
216900 MOVE-WRITE-F1-58-16.
217000     MOVE "MOVE-TEST-F1-58-16 " TO PAR-NAME.
217100     PERFORM PRINT-DETAIL.
217200 MOVE-TEST-F1-58-17.
217300     IF DNAME38 EQUAL TO 1
217400         PERFORM PASS
217500         GO TO MOVE-WRITE-F1-58-17.
217600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
217700     MOVE DNAME38 TO COMPUTED-18V0.
217800     MOVE 1 TO CORRECT-18V0.
217900     PERFORM FAIL.
218000     GO TO MOVE-WRITE-F1-58-17.
218100 MOVE-DELETE-F1-58-17.
218200     PERFORM DE-LETE.
218300 MOVE-WRITE-F1-58-17.
218400     MOVE "MOVE-TEST-F1-58-17 " TO PAR-NAME.
218500     PERFORM PRINT-DETAIL.
218600 MOVE-TEST-F1-58-18.
218700     IF DNAME39 EQUAL TO 1
218800         PERFORM PASS
218900         GO TO MOVE-WRITE-F1-58-18.
219000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
219100     MOVE DNAME39 TO COMPUTED-18V0.
219200     MOVE 1 TO CORRECT-18V0.
219300     PERFORM FAIL.
219400     GO TO MOVE-WRITE-F1-58-18.
219500 MOVE-DELETE-F1-58-18.
219600     PERFORM DE-LETE.
219700 MOVE-WRITE-F1-58-18.
219800     MOVE "MOVE-TEST-F1-58-18 " TO PAR-NAME.
219900     PERFORM PRINT-DETAIL.
220000 MOVE-TEST-F1-58-19.
220100     IF DNAME40 EQUAL TO 1
220200         PERFORM PASS
220300         GO TO MOVE-WRITE-F1-58-19.
220400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
220500     MOVE DNAME40 TO COMPUTED-18V0.
220600     MOVE 1 TO CORRECT-18V0.
220700     PERFORM FAIL.
220800     GO TO MOVE-WRITE-F1-58-19.
220900 MOVE-DELETE-F1-58-19.
221000     PERFORM DE-LETE.
221100 MOVE-WRITE-F1-58-19.
221200     MOVE "MOVE-TEST-F1-58-19 " TO PAR-NAME.
221300     PERFORM PRINT-DETAIL.
221400 MOVE-TEST-F1-58-20.
221500     IF DNAME41 EQUAL TO 1
221600         PERFORM PASS
221700         GO TO MOVE-WRITE-F1-58-20.
221800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
221900     MOVE DNAME41 TO COMPUTED-18V0.
222000     MOVE 1 TO CORRECT-18V0.
222100     PERFORM FAIL.
222200     GO TO MOVE-WRITE-F1-58-20.
222300 MOVE-DELETE-F1-58-20.
222400     PERFORM DE-LETE.
222500 MOVE-WRITE-F1-58-20.
222600     MOVE "MOVE-TEST-F1-58-20 " TO PAR-NAME.
222700     PERFORM PRINT-DETAIL.
222800 MOVE-TEST-F1-58-21.
222900     IF DNAME42 EQUAL TO 1
223000         PERFORM PASS
223100         GO TO MOVE-WRITE-F1-58-21.
223200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-58-1.
223300     MOVE DNAME42 TO COMPUTED-18V0.
223400     MOVE 1 TO CORRECT-18V0.
223500     PERFORM FAIL.
223600     GO TO MOVE-WRITE-F1-58-21.
223700 MOVE-DELETE-F1-58-21.
223800     PERFORM DE-LETE.
223900 MOVE-WRITE-F1-58-21.
224000     MOVE "MOVE-TEST-F1-58-21 " TO PAR-NAME.
224100     PERFORM PRINT-DETAIL.
224200 MOVE-INIT-F1-59-1.
224300     MOVE ZERO TO DNAME22  DNAME23  DNAME24  DNAME25  DNAME26.
224400     MOVE ZERO TO DNAME27  DNAME28  DNAME29  DNAME30  DNAME31.
224500     MOVE ZERO TO DNAME32  DNAME33  DNAME34  DNAME35  DNAME36.
224600     MOVE ZERO TO DNAME37  DNAME38  DNAME39  DNAME40  DNAME41.
224700     MOVE ZERO TO DNAME42.
224800 MOVE-TEST-F1-59-0.
224900     MOVE "A" TO ANDATA1  ANDATA2  ANDATA3  ANDATA4  ANDATA5
225000         ANDATA6  ANDATA7  ANDATA8  ANDATA9  ANDATA10  ANDATA11
225100         ANDATA12  ANDATA13  ANDATA14  ANDATA15  ANDATA16
225200         ANDATA17  ANDATA18  ANDATA19  ANDATA20  ANDATA21.
225300 MOVE-TEST-F1-59-1.
225400     IF ANDATA1  EQUAL TO "A"
225500         PERFORM PASS
225600         GO TO MOVE-WRITE-F1-59-1.
225700     MOVE ANDATA1  TO COMPUTED-A.
225800     MOVE "A" TO CORRECT-A.
225900     PERFORM FAIL.
226000     GO TO MOVE-WRITE-F1-59-1.
226100 MOVE-DELETE-F1-59-1.
226200     PERFORM DE-LETE.
226300 MOVE-WRITE-F1-59-1.
226400     MOVE "MOVE-TEST-F1-59-1 " TO PAR-NAME.
226500     PERFORM PRINT-DETAIL.
226600 MOVE-TEST-F1-59-2.
226700     IF ANDATA2  EQUAL TO "A"
226800         PERFORM PASS
226900         GO TO MOVE-WRITE-F1-59-2.
227000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
227100     MOVE ANDATA2  TO COMPUTED-A.
227200     MOVE "A" TO CORRECT-A.
227300     PERFORM FAIL.
227400     GO TO MOVE-WRITE-F1-59-2.
227500 MOVE-DELETE-F1-59-2.
227600     PERFORM DE-LETE.
227700 MOVE-WRITE-F1-59-2.
227800     MOVE "MOVE-TEST-F1-59-2 " TO PAR-NAME.
227900     PERFORM PRINT-DETAIL.
228000 MOVE-TEST-F1-59-3.
228100     IF ANDATA3  EQUAL TO "A"
228200         PERFORM PASS
228300         GO TO MOVE-WRITE-F1-59-3.
228400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
228500     MOVE ANDATA3  TO COMPUTED-A.
228600     MOVE "A" TO CORRECT-A.
228700     PERFORM FAIL.
228800     GO TO MOVE-WRITE-F1-59-3.
228900 MOVE-DELETE-F1-59-3.
229000     PERFORM DE-LETE.
229100 MOVE-WRITE-F1-59-3.
229200     MOVE "MOVE-TEST-F1-59-3 " TO PAR-NAME.
229300     PERFORM PRINT-DETAIL.
229400 MOVE-TEST-F1-59-4-4.
229500     IF ANDATA4  EQUAL TO "A"
229600         PERFORM PASS
229700         GO TO MOVE-WRITE-F1-59-4.
229800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
229900     MOVE ANDATA4  TO COMPUTED-A.
230000     MOVE "A" TO CORRECT-A.
230100     PERFORM FAIL.
230200     GO TO MOVE-WRITE-F1-59-4.
230300 MOVE-DELETE-F1-59-4.
230400     PERFORM DE-LETE.
230500 MOVE-WRITE-F1-59-4.
230600     MOVE "MOVE-TEST-F1-59-4 " TO PAR-NAME.
230700     PERFORM PRINT-DETAIL.
230800 MOVE-TEST-F1-59-5.
230900     IF ANDATA5  EQUAL TO "A"
231000         PERFORM PASS
231100         GO TO MOVE-WRITE-F1-59-5.
231200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
231300     MOVE ANDATA5  TO COMPUTED-A.
231400     MOVE "A" TO CORRECT-A.
231500     PERFORM FAIL.
231600     GO TO MOVE-WRITE-F1-59-5.
231700 MOVE-DELETE-F1-59-5.
231800     PERFORM DE-LETE.
231900 MOVE-WRITE-F1-59-5.
232000     MOVE "MOVE-TEST-F1-59-5 " TO PAR-NAME.
232100     PERFORM PRINT-DETAIL.
232200 MOVE-TEST-F1-59-6.
232300     IF ANDATA6  EQUAL TO "A"
232400         PERFORM PASS
232500         GO TO MOVE-WRITE-F1-59-6.
232600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
232700     MOVE ANDATA6  TO COMPUTED-A.
232800     MOVE "A" TO CORRECT-A.
232900     PERFORM FAIL.
233000     GO TO MOVE-WRITE-F1-59-6.
233100 MOVE-DELETE-F1-59-6.
233200     PERFORM DE-LETE.
233300 MOVE-WRITE-F1-59-6.
233400     MOVE "MOVE-TEST-F1-59-6 " TO PAR-NAME.
233500     PERFORM PRINT-DETAIL.
233600 MOVE-TEST-F1-59-7.
233700     IF ANDATA7  EQUAL TO "A"
233800         PERFORM PASS
233900         GO TO MOVE-WRITE-F1-59-7.
234000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
234100     MOVE ANDATA7  TO COMPUTED-A.
234200     MOVE "A" TO CORRECT-A.
234300     PERFORM FAIL.
234400     GO TO MOVE-WRITE-F1-59-7.
234500 MOVE-DELETE-F1-59-7.
234600     PERFORM DE-LETE.
234700 MOVE-WRITE-F1-59-7.
234800     MOVE "MOVE-TEST-F1-59-7 " TO PAR-NAME.
234900     PERFORM PRINT-DETAIL.
235000 MOVE-TEST-F1-59-8.
235100     IF ANDATA8  EQUAL TO "A"
235200         PERFORM PASS
235300         GO TO MOVE-WRITE-F1-59-8.
235400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
235500     MOVE ANDATA8  TO COMPUTED-A.
235600     MOVE "A" TO CORRECT-A.
235700     PERFORM FAIL.
235800     GO TO MOVE-WRITE-F1-59-8.
235900 MOVE-DELETE-F1-59-8.
236000     PERFORM DE-LETE.
236100 MOVE-WRITE-F1-59-8.
236200     MOVE "MOVE-TEST-F1-59-8 " TO PAR-NAME.
236300     PERFORM PRINT-DETAIL.
236400 MOVE-TEST-F1-59-9.
236500     IF ANDATA9  EQUAL TO "A"
236600         PERFORM PASS
236700         GO TO MOVE-WRITE-F1-59-9.
236800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
236900     MOVE ANDATA9  TO COMPUTED-A.
237000     MOVE "A" TO CORRECT-A.
237100     PERFORM FAIL.
237200     GO TO MOVE-WRITE-F1-59-9.
237300 MOVE-DELETE-F1-59-9.
237400     PERFORM DE-LETE.
237500 MOVE-WRITE-F1-59-9.
237600     MOVE "MOVE-TEST-F1-59-9 " TO PAR-NAME.
237700     PERFORM PRINT-DETAIL.
237800 MOVE-TEST-F1-59-10.
237900     IF ANDATA10 EQUAL TO "A"
238000         PERFORM PASS
238100         GO TO MOVE-WRITE-F1-59-10.
238200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
238300     MOVE ANDATA10 TO COMPUTED-A.
238400     MOVE "A" TO CORRECT-A.
238500     PERFORM FAIL.
238600     GO TO MOVE-WRITE-F1-59-10.
238700 MOVE-DELETE-F1-59-10.
238800     PERFORM DE-LETE.
238900 MOVE-WRITE-F1-59-10.
239000     MOVE "MOVE-TEST-F1-59-10 " TO PAR-NAME.
239100     PERFORM PRINT-DETAIL.
239200 MOVE-TEST-F1-59-11.
239300     IF ANDATA11 EQUAL TO "A"
239400         PERFORM PASS
239500         GO TO MOVE-WRITE-F1-59-11.
239600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
239700     MOVE ANDATA11 TO COMPUTED-A.
239800     MOVE "A" TO CORRECT-A.
239900     PERFORM FAIL.
240000     GO TO MOVE-WRITE-F1-59-11.
240100 MOVE-DELETE-F1-59-11.
240200     PERFORM DE-LETE.
240300 MOVE-WRITE-F1-59-11.
240400     MOVE "MOVE-TEST-F1-59-11 " TO PAR-NAME.
240500     PERFORM PRINT-DETAIL.
240600 MOVE-TEST-F1-59-12.
240700     IF ANDATA12 EQUAL TO "A"
240800         PERFORM PASS
240900         GO TO MOVE-WRITE-F1-59-12.
241000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
241100     MOVE ANDATA12 TO COMPUTED-A.
241200     MOVE "A" TO CORRECT-A.
241300     PERFORM FAIL.
241400     GO TO MOVE-WRITE-F1-59-12.
241500 MOVE-DELETE-F1-59-12.
241600     PERFORM DE-LETE.
241700 MOVE-WRITE-F1-59-12.
241800     MOVE "MOVE-TEST-F1-59-12 " TO PAR-NAME.
241900     PERFORM PRINT-DETAIL.
242000 MOVE-TEST-F1-59-13.
242100     IF ANDATA13 EQUAL TO "A"
242200         PERFORM PASS
242300         GO TO MOVE-WRITE-F1-59-13.
242400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
242500     MOVE ANDATA13 TO COMPUTED-A.
242600     MOVE "A" TO CORRECT-A.
242700     PERFORM FAIL.
242800     GO TO MOVE-WRITE-F1-59-13.
242900 MOVE-DELETE-F1-59-13.
243000     PERFORM DE-LETE.
243100 MOVE-WRITE-F1-59-13.
243200     MOVE "MOVE-TEST-F1-59-13 " TO PAR-NAME.
243300     PERFORM PRINT-DETAIL.
243400 MOVE-TEST-F1-59-14.
243500     IF ANDATA14 EQUAL TO "A"
243600         PERFORM PASS
243700         GO TO MOVE-WRITE-F1-59-14.
243800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
243900     MOVE ANDATA14 TO COMPUTED-A.
244000     MOVE "A" TO CORRECT-A.
244100     PERFORM FAIL.
244200     GO TO MOVE-WRITE-F1-59-14.
244300 MOVE-DELETE-F1-59-14.
244400     PERFORM DE-LETE.
244500 MOVE-WRITE-F1-59-14.
244600     MOVE "MOVE-TEST-F1-59-14 " TO PAR-NAME.
244700     PERFORM PRINT-DETAIL.
244800 MOVE-TEST-F1-59-15.
244900     IF ANDATA15 EQUAL TO "A"
245000         PERFORM PASS
245100         GO TO MOVE-WRITE-F1-59-15.
245200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
245300     MOVE ANDATA15 TO COMPUTED-A.
245400     MOVE "A" TO CORRECT-A.
245500     PERFORM FAIL.
245600     GO TO MOVE-WRITE-F1-59-15.
245700 MOVE-DELETE-F1-59-15.
245800     PERFORM DE-LETE.
245900 MOVE-WRITE-F1-59-15.
246000     MOVE "MOVE-TEST-F1-59-15 " TO PAR-NAME.
246100     PERFORM PRINT-DETAIL.
246200 MOVE-TEST-F1-59-16.
246300     IF ANDATA16 EQUAL TO "A"
246400         PERFORM PASS
246500         GO TO MOVE-WRITE-F1-59-16.
246600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
246700     MOVE ANDATA16 TO COMPUTED-A.
246800     MOVE "A" TO CORRECT-A.
246900     PERFORM FAIL.
247000     GO TO MOVE-WRITE-F1-59-16.
247100 MOVE-DELETE-F1-59-16.
247200     PERFORM DE-LETE.
247300 MOVE-WRITE-F1-59-16.
247400     MOVE "MOVE-TEST-F1-59-16 " TO PAR-NAME.
247500     PERFORM PRINT-DETAIL.
247600 MOVE-TEST-F1-59-17.
247700     IF ANDATA17 EQUAL TO "A"
247800         PERFORM PASS
247900         GO TO MOVE-WRITE-F1-59-17.
248000*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
248100     MOVE ANDATA17 TO COMPUTED-A.
248200     MOVE "A" TO CORRECT-A.
248300     PERFORM FAIL.
248400     GO TO MOVE-WRITE-F1-59-17.
248500 MOVE-DELETE-F1-59-17.
248600     PERFORM DE-LETE.
248700 MOVE-WRITE-F1-59-17.
248800     MOVE "MOVE-TEST-F1-59-17 " TO PAR-NAME.
248900     PERFORM PRINT-DETAIL.
249000 MOVE-TEST-F1-59-18.
249100     IF ANDATA18 EQUAL TO "A"
249200         PERFORM PASS
249300         GO TO MOVE-WRITE-F1-59-18.
249400*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
249500     MOVE ANDATA18 TO COMPUTED-A.
249600     MOVE "A" TO CORRECT-A.
249700     PERFORM FAIL.
249800     GO TO MOVE-WRITE-F1-59-18.
249900 MOVE-DELETE-F1-59-18.
250000     PERFORM DE-LETE.
250100 MOVE-WRITE-F1-59-18.
250200     MOVE "MOVE-TEST-F1-59-18 " TO PAR-NAME.
250300     PERFORM PRINT-DETAIL.
250400 MOVE-TEST-F1-59-19.
250500     IF ANDATA19 EQUAL TO "A"
250600         PERFORM PASS
250700         GO TO MOVE-WRITE-F1-59-19.
250800*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
250900     MOVE ANDATA19 TO COMPUTED-A.
251000     MOVE "A" TO CORRECT-A.
251100     PERFORM FAIL.
251200     GO TO MOVE-WRITE-F1-59-19.
251300 MOVE-DELETE-F1-59-19.
251400     PERFORM DE-LETE.
251500 MOVE-WRITE-F1-59-19.
251600     MOVE "MOVE-TEST-F1-59-19 " TO PAR-NAME.
251700     PERFORM PRINT-DETAIL.
251800 MOVE-TEST-F1-59-20.
251900     IF ANDATA20 EQUAL TO "A"
252000         PERFORM PASS
252100         GO TO MOVE-WRITE-F1-59-20.
252200*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
252300     MOVE ANDATA20 TO COMPUTED-A.
252400     MOVE "A" TO CORRECT-A.
252500     PERFORM FAIL.
252600     GO TO MOVE-WRITE-F1-59-20.
252700 MOVE-DELETE-F1-59-20.
252800     PERFORM DE-LETE.
252900 MOVE-WRITE-F1-59-20.
253000     MOVE "MOVE-TEST-F1-59-20 " TO PAR-NAME.
253100     PERFORM PRINT-DETAIL.
253200 MOVE-TEST-F1-59-21.
253300     IF ANDATA21 EQUAL TO "A"
253400         PERFORM PASS
253500         GO TO MOVE-WRITE-F1-59-21.
253600*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-59-1.
253700     MOVE ANDATA21 TO COMPUTED-A.
253800     MOVE "A" TO CORRECT-A.
253900     PERFORM FAIL.
254000     GO TO MOVE-WRITE-F1-59-21.
254100 MOVE-DELETE-F1-59-21.
254200     PERFORM DE-LETE.
254300 MOVE-WRITE-F1-59-21.
254400     MOVE "MOVE-TEST-F1-59-21 " TO PAR-NAME.
254500     PERFORM PRINT-DETAIL.
254600 MOVE-INIT-F1-60.
254700*
254800 MOVE-TEST-F1-60-0.
254900     MOVE "ABCDEFGHIJKLMNOPQRSTU" TO ANDATA1  ANDATA2  ANDATA3
255000         ANDATA4  ANDATA5  ANDATA6  ANDATA7  ANDATA8  ANDATA9
255100         ANDATA10  ANDATA11  ANDATA12  ANDATA13  ANDATA14
255200         ANDATA15  ANDATA16  ANDATA17  ANDATA18  ANDATA19
255300         ANDATA20  ANDATA21.
255400 MOVE-TEST-F1-60-1.
255500     IF ANDATA1  EQUAL TO "A"
255600         PERFORM PASS
255700         GO TO MOVE-WRITE-F1-60-1.
255800     MOVE ANDATA1  TO COMPUTED-A.
255900     MOVE "A" TO CORRECT-A.
256000     PERFORM FAIL.
256100     GO TO MOVE-WRITE-F1-60-1.
256200 MOVE-DELETE-F1-60-1.
256300     PERFORM DE-LETE.
256400 MOVE-WRITE-F1-60-1.
256500     MOVE "MOVE-TEST-F1-60-1 " TO PAR-NAME.
256600     PERFORM PRINT-DETAIL.
256700 MOVE-TEST-F1-60-2.
256800     IF ANDATA2  EQUAL TO "AB"
256900         PERFORM PASS
257000         GO TO MOVE-WRITE-F1-60-2.
257100*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
257200     MOVE ANDATA2  TO COMPUTED-A.
257300     MOVE "AB"                   TO CORRECT-A.
257400     PERFORM FAIL.
257500     GO TO MOVE-WRITE-F1-60-2.
257600 MOVE-DELETE-F1-60-2.
257700     PERFORM DE-LETE.
257800 MOVE-WRITE-F1-60-2.
257900     MOVE "MOVE-TEST-F1-60-2 " TO PAR-NAME.
258000     PERFORM PRINT-DETAIL.
258100 MOVE-TEST-F1-60-3.
258200     IF ANDATA3  EQUAL TO "ABC"
258300         PERFORM PASS
258400         GO TO MOVE-WRITE-F1-60-3.
258500*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
258600     MOVE ANDATA3  TO COMPUTED-A.
258700     MOVE "ABC"                  TO CORRECT-A.
258800     PERFORM FAIL.
258900     GO TO MOVE-WRITE-F1-60-3.
259000 MOVE-DELETE-F1-60-3.
259100     PERFORM DE-LETE.
259200 MOVE-WRITE-F1-60-3.
259300     MOVE "MOVE-TEST-F1-60-3 " TO PAR-NAME.
259400     PERFORM PRINT-DETAIL.
259500 MOVE-TEST-F1-60-4.
259600     IF ANDATA4  EQUAL TO "ABCD"
259700         PERFORM PASS
259800         GO TO MOVE-WRITE-F1-60-4.
259900*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
260000     MOVE ANDATA4  TO COMPUTED-A.
260100     MOVE "ABCD"                 TO CORRECT-A.
260200     PERFORM FAIL.
260300     GO TO MOVE-WRITE-F1-60-4.
260400 MOVE-DELETE-F1-60-4.
260500     PERFORM DE-LETE.
260600 MOVE-WRITE-F1-60-4.
260700     MOVE "MOVE-TEST-F1-60-4 " TO PAR-NAME.
260800     PERFORM PRINT-DETAIL.
260900 MOVE-TEST-F1-60-5.
261000     IF ANDATA5  EQUAL TO "ABCDE"
261100         PERFORM PASS
261200         GO TO MOVE-WRITE-F1-60-5.
261300*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
261400     MOVE ANDATA5  TO COMPUTED-A.
261500     MOVE "ABCDE"                TO CORRECT-A.
261600     PERFORM FAIL.
261700     GO TO MOVE-WRITE-F1-60-5.
261800 MOVE-DELETE-F1-60-5.
261900     PERFORM DE-LETE.
262000 MOVE-WRITE-F1-60-5.
262100     MOVE "MOVE-TEST-F1-60-5 " TO PAR-NAME.
262200     PERFORM PRINT-DETAIL.
262300 MOVE-TEST-F1-60-6.
262400     IF ANDATA6  EQUAL TO "ABCDEF"
262500         PERFORM PASS
262600         GO TO MOVE-WRITE-F1-60-6.
262700*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
262800     MOVE ANDATA6  TO COMPUTED-A.
262900     MOVE "ABCDEF"               TO CORRECT-A.
263000     PERFORM FAIL.
263100     GO TO MOVE-WRITE-F1-60-6.
263200 MOVE-DELETE-F1-60-6.
263300     PERFORM DE-LETE.
263400 MOVE-WRITE-F1-60-6.
263500     MOVE "MOVE-TEST-F1-60-6 " TO PAR-NAME.
263600     PERFORM PRINT-DETAIL.
263700 MOVE-TEST-F1-60-7.
263800     IF ANDATA7  EQUAL TO "ABCDEFG"
263900         PERFORM PASS
264000         GO TO MOVE-WRITE-F1-60-7.
264100*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
264200     MOVE ANDATA7  TO COMPUTED-A.
264300     MOVE "ABCDEFG"              TO CORRECT-A.
264400     PERFORM FAIL.
264500     GO TO MOVE-WRITE-F1-60-7.
264600 MOVE-DELETE-F1-60-7.
264700     PERFORM DE-LETE.
264800 MOVE-WRITE-F1-60-7.
264900     MOVE "MOVE-TEST-F1-60-7 " TO PAR-NAME.
265000     PERFORM PRINT-DETAIL.
265100 MOVE-TEST-F1-60-8.
265200     IF ANDATA8  EQUAL TO "ABCDEFGH"
265300         PERFORM PASS
265400         GO TO MOVE-WRITE-F1-60-8.
265500*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
265600     MOVE ANDATA8  TO COMPUTED-A.
265700     MOVE "ABCDEFGH"             TO CORRECT-A.
265800     PERFORM FAIL.
265900     GO TO MOVE-WRITE-F1-60-8.
266000 MOVE-DELETE-F1-60-8.
266100     PERFORM DE-LETE.
266200 MOVE-WRITE-F1-60-8.
266300     MOVE "MOVE-TEST-F1-60-8 " TO PAR-NAME.
266400     PERFORM PRINT-DETAIL.
266500 MOVE-TEST-F1-60-9.
266600     IF ANDATA9  EQUAL TO "ABCDEFGHI"
266700         PERFORM PASS
266800         GO TO MOVE-WRITE-F1-60-9.
266900*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
267000     MOVE ANDATA9  TO COMPUTED-A.
267100     MOVE "ABCDEFGHI"            TO CORRECT-A.
267200     PERFORM FAIL.
267300     GO TO MOVE-WRITE-F1-60-9.
267400 MOVE-DELETE-F1-60-9.
267500     PERFORM DE-LETE.
267600 MOVE-WRITE-F1-60-9.
267700     MOVE "MOVE-TEST-F1-60-9 " TO PAR-NAME.
267800     PERFORM PRINT-DETAIL.
267900 MOVE-TEST-F1-60-10.
268000     IF ANDATA10 EQUAL TO "ABCDEFGHIJ"
268100         PERFORM PASS
268200         GO TO MOVE-WRITE-F1-60-10.
268300*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
268400     MOVE ANDATA10 TO COMPUTED-A.
268500     MOVE "ABCDEFGHIJ"           TO CORRECT-A.
268600     PERFORM FAIL.
268700     GO TO MOVE-WRITE-F1-60-10.
268800 MOVE-DELETE-F1-60-10.
268900     PERFORM DE-LETE.
269000 MOVE-WRITE-F1-60-10.
269100     MOVE "MOVE-TEST-F1-60-10 " TO PAR-NAME.
269200     PERFORM PRINT-DETAIL.
269300 MOVE-TEST-F1-60-11.
269400     IF ANDATA11 EQUAL TO "ABCDEFGHIJK"
269500         PERFORM PASS
269600         GO TO MOVE-WRITE-F1-60-11.
269700*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
269800     MOVE ANDATA11 TO COMPUTED-A.
269900     MOVE "ABCDEFGHIJK"          TO CORRECT-A.
270000     PERFORM FAIL.
270100     GO TO MOVE-WRITE-F1-60-11.
270200 MOVE-DELETE-F1-60-11.
270300     PERFORM DE-LETE.
270400 MOVE-WRITE-F1-60-11.
270500     MOVE "MOVE-TEST-F1-60-11 " TO PAR-NAME.
270600     PERFORM PRINT-DETAIL.
270700 MOVE-TEST-F1-60-12.
270800     IF ANDATA12 EQUAL TO "ABCDEFGHIJKL"
270900         PERFORM PASS
271000         GO TO MOVE-WRITE-F1-60-12.
271100*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
271200     MOVE ANDATA12 TO COMPUTED-A.
271300     MOVE "ABCDEFGHIJKL"         TO CORRECT-A.
271400     PERFORM FAIL.
271500     GO TO MOVE-WRITE-F1-60-12.
271600 MOVE-DELETE-F1-60-12.
271700     PERFORM DE-LETE.
271800 MOVE-WRITE-F1-60-12.
271900     MOVE "MOVE-TEST-F1-60-12 " TO PAR-NAME.
272000     PERFORM PRINT-DETAIL.
272100 MOVE-TEST-F1-60-13.
272200     IF ANDATA13 EQUAL TO "ABCDEFGHIJKLM"
272300         PERFORM PASS
272400         GO TO MOVE-WRITE-F1-60-13.
272500*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
272600     MOVE ANDATA13 TO COMPUTED-A.
272700     MOVE "ABCDEFGHIJKLM"        TO CORRECT-A.
272800     PERFORM FAIL.
272900     GO TO MOVE-WRITE-F1-60-13.
273000 MOVE-DELETE-F1-60-13.
273100     PERFORM DE-LETE.
273200 MOVE-WRITE-F1-60-13.
273300     MOVE "MOVE-TEST-F1-60-13 " TO PAR-NAME.
273400     PERFORM PRINT-DETAIL.
273500 MOVE-TEST-F1-60-14.
273600     IF ANDATA14 EQUAL TO "ABCDEFGHIJKLMN"
273700         PERFORM PASS
273800         GO TO MOVE-WRITE-F1-60-14.
273900*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
274000     MOVE ANDATA14 TO COMPUTED-A.
274100     MOVE "ABCDEFGHIJKLMN"       TO CORRECT-A.
274200     PERFORM FAIL.
274300     GO TO MOVE-WRITE-F1-60-14.
274400 MOVE-DELETE-F1-60-14.
274500     PERFORM DE-LETE.
274600 MOVE-WRITE-F1-60-14.
274700     MOVE "MOVE-TEST-F1-60-14 " TO PAR-NAME.
274800     PERFORM PRINT-DETAIL.
274900 MOVE-TEST-F1-60-15.
275000     IF ANDATA15 EQUAL TO "ABCDEFGHIJKLMNO"
275100         PERFORM PASS
275200         GO TO MOVE-WRITE-F1-60-15.
275300*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
275400     MOVE ANDATA15 TO COMPUTED-A.
275500     MOVE "ABCDEFGHIJKLMNO"      TO CORRECT-A.
275600     PERFORM FAIL.
275700     GO TO MOVE-WRITE-F1-60-15.
275800 MOVE-DELETE-F1-60-15.
275900     PERFORM DE-LETE.
276000 MOVE-WRITE-F1-60-15.
276100     MOVE "MOVE-TEST-F1-60-15 " TO PAR-NAME.
276200     PERFORM PRINT-DETAIL.
276300 MOVE-TEST-F1-60-16.
276400     IF ANDATA16 EQUAL TO "ABCDEFGHIJKLMNOP"
276500         PERFORM PASS
276600         GO TO MOVE-WRITE-F1-60-16.
276700*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
276800     MOVE ANDATA16 TO COMPUTED-A.
276900     MOVE "ABCDEFGHIJKLMNOP"     TO CORRECT-A.
277000     PERFORM FAIL.
277100     GO TO MOVE-WRITE-F1-60-16.
277200 MOVE-DELETE-F1-60-16.
277300     PERFORM DE-LETE.
277400 MOVE-WRITE-F1-60-16.
277500     MOVE "MOVE-TEST-F1-60-16 " TO PAR-NAME.
277600     PERFORM PRINT-DETAIL.
277700 MOVE-TEST-F1-60-17.
277800     IF ANDATA17 EQUAL TO "ABCDEFGHIJKLMNOPQ"
277900         PERFORM PASS
278000         GO TO MOVE-WRITE-F1-60-17.
278100*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
278200     MOVE ANDATA17 TO COMPUTED-A.
278300     MOVE "ABCDEFGHIJKLMNOPQ"    TO CORRECT-A.
278400     PERFORM FAIL.
278500     GO TO MOVE-WRITE-F1-60-17.
278600 MOVE-DELETE-F1-60-17.
278700     PERFORM DE-LETE.
278800 MOVE-WRITE-F1-60-17.
278900     MOVE "MOVE-TEST-F1-60-17 " TO PAR-NAME.
279000     PERFORM PRINT-DETAIL.
279100 MOVE-TEST-F1-60-18.
279200     IF ANDATA18 EQUAL TO "ABCDEFGHIJKLMNOPQR"
279300         PERFORM PASS
279400         GO TO MOVE-WRITE-F1-60-18.
279500*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
279600     MOVE ANDATA18 TO COMPUTED-A.
279700     MOVE "ABCDEFGHIJKLMNOPQR"   TO CORRECT-A.
279800     PERFORM FAIL.
279900     GO TO MOVE-WRITE-F1-60-18.
280000 MOVE-DELETE-F1-60-18.
280100     PERFORM DE-LETE.
280200 MOVE-WRITE-F1-60-18.
280300     MOVE "MOVE-TEST-F1-60-18 " TO PAR-NAME.
280400     PERFORM PRINT-DETAIL.
280500 MOVE-TEST-F1-60-19.
280600     IF ANDATA19 EQUAL TO "ABCDEFGHIJKLMNOPQRS"
280700         PERFORM PASS
280800         GO TO MOVE-WRITE-F1-60-19.
280900*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
281000     MOVE ANDATA19 TO COMPUTED-A.
281100     MOVE "ABCDEFGHIJKLMNOPQRS"  TO CORRECT-A.
281200     PERFORM FAIL.
281300     GO TO MOVE-WRITE-F1-60-19.
281400 MOVE-DELETE-F1-60-19.
281500     PERFORM DE-LETE.
281600 MOVE-WRITE-F1-60-19.
281700     MOVE "MOVE-TEST-F1-60-19 " TO PAR-NAME.
281800     PERFORM PRINT-DETAIL.
281900 MOVE-TEST-F1-60-20.
282000     IF ANDATA20 EQUAL TO "ABCDEFGHIJKLMNOPQRST"
282100         PERFORM PASS
282200         GO TO MOVE-WRITE-F1-60-20.
282300*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
282400     MOVE ANDATA20 TO COMPUTED-A.
282500     MOVE "ABCDEFGHIJKLMNOPQRST" TO CORRECT-A.
282600     PERFORM FAIL.
282700     GO TO MOVE-WRITE-F1-60-20.
282800 MOVE-DELETE-F1-60-20.
282900     PERFORM DE-LETE.
283000 MOVE-WRITE-F1-60-20.
283100     MOVE "MOVE-TEST-F1-60-20 " TO PAR-NAME.
283200     PERFORM PRINT-DETAIL.
283300 MOVE-TEST-F1-60-21.
283400     IF ANDATA21 EQUAL TO "ABCDEFGHIJKLMNOPQRSTU"
283500         PERFORM PASS
283600         GO TO MOVE-WRITE-F1-60-21.
283700*    NOTE   THIS TEST DEPENDS ON PARAGRAPH  MOVE-TEST-F1-60-1.
283800     MOVE "SEE RE-MARK COL" TO COMPUTED-A.
283900     MOVE ANDATA21 TO RE-MARK.
284000     MOVE "ALPHABET A THRU U" TO CORRECT-A.
284100     PERFORM FAIL.
284200     GO TO MOVE-WRITE-F1-60-21.
284300 MOVE-DELETE-F1-60-21.
284400     PERFORM DE-LETE.
284500 MOVE-WRITE-F1-60-21.
284600     MOVE "MOVE-TEST-F1-60-21 " TO PAR-NAME.
284700     PERFORM PRINT-DETAIL.
284800     PERFORM END-ROUTINE.
284900 CCVS-EXIT SECTION.
285000 CCVS-999999.
285100     GO TO CLOSE-FILES.
