000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC101A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100****************************************************************
002200*    THIS PROGRAM TESTS THE FORMAT 1 MULTIPLY STATEMENT FOUND
002300*    IN LEVEL 1.   ALL COMBINATIONS OF THE OPTIONAL PHRASES
002400*    "SIZE ERROR", "NOT SIZE ERROR" AND "END-MULTIPLY" ARE
002500*    TESTED, AS WELL AS THE ROUNDED OPTION.
002600*
002700*    VARIOUS COMBINATIONS OF SIGNED AND UNSIGNED NUMERIC
002800*    LITERALS, DISPLAY AND COMPUTATIONAL FIELDS ARE USED
002900*    AS OPERANDS.
003000*
003100
003200
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.
003600     XXXXX082.
003700 OBJECT-COMPUTER.
003800     XXXXX083.
003900 INPUT-OUTPUT SECTION.
004000 FILE-CONTROL.
004100     SELECT PRINT-FILE ASSIGN TO
004200     XXXXX055.
004300 DATA DIVISION.
004400 FILE SECTION.
004500 FD  PRINT-FILE.
004600 01  PRINT-REC PICTURE X(120).
004700 01  DUMMY-RECORD PICTURE X(120).
004800 WORKING-STORAGE SECTION.
004900 77  WRK-DS-18V00                PICTURE S9(18).
005000 77  A06THREES-DS-03V03          PICTURE S999V999 VALUE 333.333.
005100 77  WRK-DS-06V06                PICTURE S9(6)V9(6).
005200 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06 PICTURE S9(12).
005300 77  A08TWOS-DS-02V06            PICTURE S99V9(6) VALUE 22.222222.
005400 77  WRK-DS-10V00                PICTURE S9(10).
005500 77  WRK-XN-00001                PICTURE X.
005600 77  A10ONES-DS-10V00            PICTURE S9(10)
005700                                 VALUE 1111111111.
005800 77  A12THREES-DS-06V06          PICTURE S9(6)V9(6)
005900                                 VALUE 333333.333333.
006000 77  WRK-DS-02V00                PICTURE S99.
006100 77  AZERO-DS-05V05              PICTURE S9(5)V9(5) VALUE ZERO.
006200 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
006300 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09 PICTURE S9(18).
006400 77  A05ONES-DS-00V05            PICTURE SV9(5) VALUE .11111.
006500 77  A12ONES-DS-12V00            PICTURE S9(12)
006600                                 VALUE 111111111111.
006700 77  A01ONE-DS-P0801             PICTURE SP(8)9 VALUE .000000001.
006800 77  WRK-DS-09V08                PICTURE S9(9)V9(8).
006900 77  WRK-DS-17V00-S REDEFINES WRK-DS-09V08 PICTURE S9(17).
007000 77  A18ONES-DS-18V00            PICTURE S9(18)
007100                                 VALUE 111111111111111111.
007200 77  WRK-DS-0201P                PICTURE S99P.
007300 77  WRK-CS-18V00                PICTURE S9(18) COMPUTATIONAL.
007400 77  WRK-DU-18V00                PICTURE 9(18).
007500 77  A99-CS-02V00                PICTURE S99 COMPUTATIONAL
007600                                 VALUE 99.
007700 77  A01ONE-CS-00V01             PICTURE SV9 COMPUTATIONAL
007800                                 VALUE .1.
007900 77  A99-DS-02V00                PICTURE S99   VALUE 99.
008000 77  WRK-DS-12V00                PICTURE S9(12).
008100 77  WRK-DS-01V00                PICTURE S9.
008200 77  WRK-DS-03V10                PICTURE S9(3)V9(10).
008300 77  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
008400                                 VALUE 111111111.111111111.
008500 77  A02TWOS-DU-02V00            PICTURE 99  VALUE 22.
008600 77  WRK-DS-05V00                PICTURE S9(5).
008700 77  A02TWOS-DS-03V02            PICTURE S999V99 VALUE +022.00.
008800 77  WRK-CS-02V02                PICTURE S99V99  COMPUTATIONAL.
008900 77  A990-DS-0201P               PICTURE S99P   VALUE +990.
009000 77  XRAY                        PICTURE X.
009100 01  WRK-XN-18-1 PIC X(18).
009200 01  WRK-AN-X-18-1, REDEFINES WRK-XN-18-1 PIC A(18).
009300 01  WRK-DU-X-18V0-1; REDEFINES WRK-XN-18-1 PIC 9(18).
009400 01  WRK-DU-0V1-1 PIC V9 VALUE .3.
009500 01  WRK-DU-0V2-1 PIC V99 VALUE .25.
009600 01  WRK-DU-0V12-1 PIC V9(12) VALUE .00001.
009700 01  WRK-DU-1V0-1 PIC 9 VALUE ZERO.
009800 01  WRK-DU-1V1-1 PIC 9V9 VALUE 1.1.
009900 01  WRK-DU-1V1-2 PIC 9V9 VALUE 2.4.
010000 01  WRK-DU-1V3-1 PIC 9V999 VALUE 1.001.
010100 01  WRK-DU-1V3-2 PIC 9V999 VALUE 1.001.
010200 01  WRK-DU-1V5-1 PIC 9V9(5).
010300 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
010400 01  WRK-DU-2P4-1 PIC 99P(4) VALUE 990000.
010500 01  WRK-DU-2V0-1 PIC 99.
010600 01  WRK-DU-2V0-2 PIC 99.
010700 01  WRK-DU-2V0-3 PIC 99.
010800 01  WRK-DU-2V1-1 PIC 99V9.
010900 01  WRK-DU-2V1-2 PIC 99V9.
011000 01  WRK-DU-2V1-3 PIC 99V9.
011100 01  WRK-DU-2V2-1 PIC 99V99 VALUE 15.44.
011200 01  WRK-DU-2V2-2 PIC 99V99 VALUE 60.89.
011300 01  WRK-DU-2V2-3 PIC 99V99 VALUE 60.99.
011400 01  WRK-DU-2V2-4 PIC 99V99 VALUE 60.99.
011500 01  WRK-DU-2V2-5 PIC 99V99 VALUE 10.00.
011600 01  WRK-DU-2V5-1 PIC 99V9(5).
011700 01  WRK-DU-4P1-1 PIC P(4)9 VALUE .00001.
011800 01  WRK-DU-5V1-1 PIC 9(5)V9 VALUE 12345.6.
011900 01  WRK-DU-6V0-1 PIC 9(6) VALUE 99999.
012000 01  WRK-DU-6V0-2 PIC 9(6) VALUE 99999.
012100 01  WRK-DU-16V2-1 PIC 9(16)V99 VALUE 9999999999999999.99.
012200 01  WRK-NE-X-1 PIC 9(16).99.
012300 01  WRK-DS-1V0-1 PIC S9 VALUE -3.
012400 01  WRK-DS-1V0-2 PIC S9 VALUE 2.
012500 01  WRK-DS-1V2-1 PIC S9V99 VALUE ZERO.
012600 01  WRK-DS-2V0-1 PIC S99 VALUE ZERO.
012700 01  WRK-DS-2V1-1 PIC S99V9 VALUE ZERO.
012800 01  WRK-DS-2V2-1 PIC S99V99 VALUE ZERO.
012900 01  WRK-DS-2V2-2 PIC S99V99 VALUE -12.34.
013000 01  WRK-DS-16V2-1 PIC S9(16)V99 VALUE -9999999999999999.99.
013100 01  WRK-NE-X-2 PIC -9(16).99.
013200 01  WRK-NE-1 PIC .9999/99999,99999,99.
013300 01  WRK-NE-2 PIC $**.99.
013400 01  WRK-NE-3 PIC $99.99CR.
013500 01  WRK-NE-4 PIC $*9.99 VALUE ZERO.
013600 77  A01ONES-CS-18V00   PICTURE S9(18) COMPUTATIONAL
013700             VALUE +000000000000000001.
013800 77  A02THREES-CS-18V00 PICTURE S9(18) COMPUTATIONAL
013900             VALUE -000000000000000033.
014000 77  A18SIXES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014100             VALUE 666666666666666666.
014200 77  A16NINES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014300             VALUE 009999999999999999.
014400 77  A14TWOS-CU-18V00   PICTURE 9(18) COMPUTATIONAL
014500             VALUE 000022222222222222.
014600 01  MULTIPLY-DATA.
014700     02 MULT1                           PICTURE IS 999V99
014800     VALUE IS 80.12.
014900     02 MULT2                           PICTURE IS 999V999.
015000     02 MULT3                           PICTURE IS $$99.99.
015100     02 MULT4                           PICTURE IS S99
015200     VALUE IS -56.
015300     02 MULT5                           PICTURE IS 9 VALUE IS 4.
015400     02 MULT6                           PICTURE IS 99 VALUE IS
015500     20.
015600 01  DIVIDE-DATA.
015700     02 DIV1                            PICTURE IS 9(4)V99
015800     VALUE IS 1620.36.
015900     02 DIV2                            PICTURE IS 99V9
016000     VALUE IS 44.1.
016100     02 DIV3                            PICTURE IS 9(4)V9
016200     VALUE IS 1661.7.
016300     02 DIV4                            PICTURE IS S9V999
016400     VALUE IS -9.642.
016500     02 DIV-02LEVEL-1.
016600     03 DIV5                            PICTURE IS V99
016700     VALUE IS .82.
016800     03 DIV6                            PICTURE IS 9 VALUE IS 0.
016900     03 DIV7                            PICTURE IS 9V9
017000     VALUE IS 9.6.
017100 01  DIV-DATA-2.
017200     02 DIV8                            PICTURE IS 99V9.
017300     02 DIV9                            PICTURE IS ZZ,ZZZ.9.
017400     02 DIV10                           PICTURE IS V999.
017500 01  TEST-RESULTS.
017600     02 FILLER                   PIC X      VALUE SPACE.
017700     02 FEATURE                  PIC X(20)  VALUE SPACE.
017800     02 FILLER                   PIC X      VALUE SPACE.
017900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
018000     02 FILLER                   PIC X      VALUE SPACE.
018100     02  PAR-NAME.
018200       03 FILLER                 PIC X(19)  VALUE SPACE.
018300       03  PARDOT-X              PIC X      VALUE SPACE.
018400       03 DOTVALUE               PIC 99     VALUE ZERO.
018500     02 FILLER                   PIC X(8)   VALUE SPACE.
018600     02 RE-MARK                  PIC X(61).
018700 01  TEST-COMPUTED.
018800     02 FILLER                   PIC X(30)  VALUE SPACE.
018900     02 FILLER                   PIC X(17)  VALUE
019000            "       COMPUTED=".
019100     02 COMPUTED-X.
019200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
019300     03 COMPUTED-N               REDEFINES COMPUTED-A
019400                                 PIC -9(9).9(9).
019500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
019600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
019700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
019800     03       CM-18V0 REDEFINES COMPUTED-A.
019900         04 COMPUTED-18V0                    PIC -9(18).
020000         04 FILLER                           PIC X.
020100     03 FILLER PIC X(50) VALUE SPACE.
020200 01  TEST-CORRECT.
020300     02 FILLER PIC X(30) VALUE SPACE.
020400     02 FILLER PIC X(17) VALUE "       CORRECT =".
020500     02 CORRECT-X.
020600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
020800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
021000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
021100     03      CR-18V0 REDEFINES CORRECT-A.
021200         04 CORRECT-18V0                     PIC -9(18).
021300         04 FILLER                           PIC X.
021400     03 FILLER PIC X(2) VALUE SPACE.
021500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021600 01  CCVS-C-1.
021700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
021800-    "SS  PARAGRAPH-NAME
021900-    "       REMARKS".
022000     02 FILLER                     PIC X(20)    VALUE SPACE.
022100 01  CCVS-C-2.
022200     02 FILLER                     PIC X        VALUE SPACE.
022300     02 FILLER                     PIC X(6)     VALUE "TESTED".
022400     02 FILLER                     PIC X(15)    VALUE SPACE.
022500     02 FILLER                     PIC X(4)     VALUE "FAIL".
022600     02 FILLER                     PIC X(94)    VALUE SPACE.
022700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
022800 01  REC-CT                        PIC 99       VALUE ZERO.
022900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
023000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
023100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
023200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
023300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
023400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
023500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
023600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
023700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
023800 01  CCVS-H-1.
023900     02  FILLER                    PIC X(39)    VALUE SPACES.
024000     02  FILLER                    PIC X(42)    VALUE
024100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024200     02  FILLER                    PIC X(39)    VALUE SPACES.
024300 01  CCVS-H-2A.
024400   02  FILLER                        PIC X(40)  VALUE SPACE.
024500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
024600   02  FILLER                        PIC XXXX   VALUE
024700     "4.2 ".
024800   02  FILLER                        PIC X(28)  VALUE
024900            " COPY - NOT FOR DISTRIBUTION".
025000   02  FILLER                        PIC X(41)  VALUE SPACE.
025100
025200 01  CCVS-H-2B.
025300   02  FILLER                        PIC X(15)  VALUE
025400            "TEST RESULT OF ".
025500   02  TEST-ID                       PIC X(9).
025600   02  FILLER                        PIC X(4)   VALUE
025700            " IN ".
025800   02  FILLER                        PIC X(12)  VALUE
025900     " HIGH       ".
026000   02  FILLER                        PIC X(22)  VALUE
026100            " LEVEL VALIDATION FOR ".
026200   02  FILLER                        PIC X(58)  VALUE
026300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026400 01  CCVS-H-3.
026500     02  FILLER                      PIC X(34)  VALUE
026600            " FOR OFFICIAL USE ONLY    ".
026700     02  FILLER                      PIC X(58)  VALUE
026800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026900     02  FILLER                      PIC X(28)  VALUE
027000            "  COPYRIGHT   1985 ".
027100 01  CCVS-E-1.
027200     02 FILLER                       PIC X(52)  VALUE SPACE.
027300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027400     02 ID-AGAIN                     PIC X(9).
027500     02 FILLER                       PIC X(45)  VALUE SPACES.
027600 01  CCVS-E-2.
027700     02  FILLER                      PIC X(31)  VALUE SPACE.
027800     02  FILLER                      PIC X(21)  VALUE SPACE.
027900     02 CCVS-E-2-2.
028000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
028100         03 FILLER                   PIC X      VALUE SPACE.
028200         03 ENDER-DESC               PIC X(44)  VALUE
028300            "ERRORS ENCOUNTERED".
028400 01  CCVS-E-3.
028500     02  FILLER                      PIC X(22)  VALUE
028600            " FOR OFFICIAL USE ONLY".
028700     02  FILLER                      PIC X(12)  VALUE SPACE.
028800     02  FILLER                      PIC X(58)  VALUE
028900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029000     02  FILLER                      PIC X(13)  VALUE SPACE.
029100     02 FILLER                       PIC X(15)  VALUE
029200             " COPYRIGHT 1985".
029300 01  CCVS-E-4.
029400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
029500     02 FILLER                       PIC X(4)   VALUE " OF ".
029600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
029700     02 FILLER                       PIC X(40)  VALUE
029800      "  TESTS WERE EXECUTED SUCCESSFULLY".
029900 01  XXINFO.
030000     02 FILLER                       PIC X(19)  VALUE
030100            "*** INFORMATION ***".
030200     02 INFO-TEXT.
030300       04 FILLER                     PIC X(8)   VALUE SPACE.
030400       04 XXCOMPUTED                 PIC X(20).
030500       04 FILLER                     PIC X(5)   VALUE SPACE.
030600       04 XXCORRECT                  PIC X(20).
030700     02 INF-ANSI-REFERENCE           PIC X(48).
030800 01  HYPHEN-LINE.
030900     02 FILLER  PIC IS X VALUE IS SPACE.
031000     02 FILLER  PIC IS X(65)    VALUE IS "************************
031100-    "*****************************************".
031200     02 FILLER  PIC IS X(54)    VALUE IS "************************
031300-    "******************************".
031400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
031500     "NC101A".
031600 PROCEDURE DIVISION.
031700 CCVS1 SECTION.
031800 OPEN-FILES.
031900     OPEN     OUTPUT PRINT-FILE.
032000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
032100     MOVE    SPACE TO TEST-RESULTS.
032200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
032300     GO TO CCVS1-EXIT.
032400 CLOSE-FILES.
032500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
032600 TERMINATE-CCVS.
032700S    EXIT PROGRAM.
032800STERMINATE-CALL.
032900     STOP     RUN.
033000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
033100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
033200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
033300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
033400     MOVE "****TEST DELETED****" TO RE-MARK.
033500 PRINT-DETAIL.
033600     IF REC-CT NOT EQUAL TO ZERO
033700             MOVE "." TO PARDOT-X
033800             MOVE REC-CT TO DOTVALUE.
033900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
034000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
034100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
034200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
034300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
034400     MOVE SPACE TO CORRECT-X.
034500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
034600     MOVE     SPACE TO RE-MARK.
034700 HEAD-ROUTINE.
034800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035200 COLUMN-NAMES-ROUTINE.
035300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
035600 END-ROUTINE.
035700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
035800 END-RTN-EXIT.
035900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036000 END-ROUTINE-1.
036100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
036200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
036300      ADD PASS-COUNTER TO ERROR-HOLD.
036400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
036500      MOVE PASS-COUNTER TO CCVS-E-4-1.
036600      MOVE ERROR-HOLD TO CCVS-E-4-2.
036700      MOVE CCVS-E-4 TO CCVS-E-2-2.
036800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
036900  END-ROUTINE-12.
037000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
037100     IF       ERROR-COUNTER IS EQUAL TO ZERO
037200         MOVE "NO " TO ERROR-TOTAL
037300         ELSE
037400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
037500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
037600     PERFORM WRITE-LINE.
037700 END-ROUTINE-13.
037800     IF DELETE-COUNTER IS EQUAL TO ZERO
037900         MOVE "NO " TO ERROR-TOTAL  ELSE
038000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
038100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
038200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038300      IF   INSPECT-COUNTER EQUAL TO ZERO
038400          MOVE "NO " TO ERROR-TOTAL
038500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
038600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038900 WRITE-LINE.
039000     ADD 1 TO RECORD-COUNT.
039100Y    IF RECORD-COUNT GREATER 42
039200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
039300Y        MOVE SPACE TO DUMMY-RECORD
039400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039500Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039600Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039700Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039800Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039900Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
040000Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
040100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
040200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
040300Y        MOVE ZERO TO RECORD-COUNT.
040400     PERFORM WRT-LN.
040500 WRT-LN.
040600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
040700     MOVE SPACE TO DUMMY-RECORD.
040800 BLANK-LINE-PRINT.
040900     PERFORM WRT-LN.
041000 FAIL-ROUTINE.
041100     IF     COMPUTED-X NOT EQUAL TO SPACE
041200            GO TO FAIL-ROUTINE-WRITE.
041300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
041400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041700     MOVE   SPACES TO INF-ANSI-REFERENCE.
041800     GO TO  FAIL-ROUTINE-EX.
041900 FAIL-ROUTINE-WRITE.
042000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
042100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
042200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
042300     MOVE   SPACES TO COR-ANSI-REFERENCE.
042400 FAIL-ROUTINE-EX. EXIT.
042500 BAIL-OUT.
042600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
042700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
042800 BAIL-OUT-WRITE.
042900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
043000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
043100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043200     MOVE   SPACES TO INF-ANSI-REFERENCE.
043300 BAIL-OUT-EX. EXIT.
043400 CCVS1-EXIT.
043500     EXIT.
043600 SECT-NC101A-001 SECTION.
043700 MPY-INIT-F1-1.
043800     MOVE    "MULTIPLY BY" TO FEATURE.
043900     MOVE    "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
044000     MOVE     80.12 TO MULT1.
044100     MOVE     4     TO MULT5.
044200 MPY-TEST-F1-1.
044300     MULTIPLY MULT5 BY MULT1.
044400     IF       MULT1 EQUAL TO 320.48
044500              PERFORM PASS
044600     ELSE
044700              GO TO MPY-FAIL-F1-1.
044800     GO TO    MPY-WRITE-F1-1.
044900 MPY-DELETE-F1-1.
045000     PERFORM  DE-LETE.
045100     GO TO    MPY-WRITE-F1-1.
045200 MPY-FAIL-F1-1.
045300     PERFORM  FAIL.
045400     MOVE     MULT1 TO COMPUTED-N.
045500     MOVE     +320.48 TO CORRECT-N.
045600 MPY-WRITE-F1-1.
045700     MOVE "MPY-TEST-F1-1 " TO PAR-NAME.
045800     PERFORM  PRINT-DETAIL.
045900*
046000 MPY-INIT-F1-2.
046100     MOVE    "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
046200     MOVE    -56 TO MULT4.
046300 MPY-TEST-F1-2.
046400     MULTIPLY -1.3 BY MULT4 ROUNDED.
046500     IF       MULT4 EQUAL TO 73
046600              PERFORM PASS
046700     ELSE
046800              GO TO MPY-FAIL-F1-2.
046900     GO TO    MPY-WRITE-F1-2.
047000 MPY-DELETE-F1-2.
047100     PERFORM  DE-LETE.
047200     GO TO    MPY-WRITE-F1-2.
047300 MPY-FAIL-F1-2.
047400     PERFORM  FAIL.
047500     MOVE     MULT4 TO COMPUTED-N.
047600     MOVE     +73   TO CORRECT-N.
047700 MPY-WRITE-F1-2.
047800     MOVE "MPY-TEST-F1-2 " TO PAR-NAME.
047900     PERFORM  PRINT-DETAIL.
048000
048100 MPY-INIT-F1-3-1.
048200     MOVE    "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
048300     MOVE     4 TO MULT5.
048400     MOVE    "A" TO XRAY.
048500 MPY-TEST-F1-3-0.
048600     MULTIPLY MULT5 BY MULT5 ON SIZE ERROR
048700              MOVE "K" TO XRAY.
048800 MPY-TEST-F1-3-1.
048900     IF       XRAY EQUAL TO "K"
049000              PERFORM PASS
049100     ELSE
049200              GO TO MPY-FAIL-F1-3-1.
049300     GO TO    MPY-WRITE-F1-3-1.
049400 MPY-DELETE-F1-3-1.
049500     PERFORM  DE-LETE.
049600     GO TO    MPY-WRITE-F1-3-1.
049700 MPY-FAIL-F1-3-1.
049800     MOVE     XRAY  TO COMPUTED-X.
049900     MOVE    "A"    TO CORRECT-X.
050000     MOVE    "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
050100     PERFORM  FAIL.
050200 MPY-WRITE-F1-3-1.
050300     MOVE    "MPY-TEST-F1-3-1 " TO PAR-NAME.
050400     PERFORM  PRINT-DETAIL.
050500 MPY-TEST-F1-3-2.
050600     IF       MULT5 EQUAL TO 4
050700              PERFORM PASS
050800     ELSE
050900              GO TO MPY-FAIL-F1-3-2.
051000     GO TO    MPY-WRITE-F1-3-2.
051100 MPY-DELETE-F1-3-2.
051200     PERFORM  DE-LETE.
051300     GO TO    MPY-WRITE-F1-3-2.
051400 MPY-FAIL-F1-3-2.
051500     PERFORM  FAIL.
051600     MOVE     MULT5 TO COMPUTED-N.
051700     MOVE    +4 TO CORRECT-N.
051800     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
051900 MPY-WRITE-F1-3-2.
052000     MOVE    "MPY-TEST-F1-3-2" TO PAR-NAME.
052100     PERFORM  PRINT-DETAIL.
052200
052300 MPY-INIT-F1-4-1.
052400     MOVE    "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
052500     MOVE     20 TO MULT6.
052600     MOVE    "B" TO XRAY.
052700 MPY-TEST-F1-4-O.
052800     MULTIPLY 4.99 BY MULT6 ROUNDED ON SIZE ERROR
052900              MOVE "L" TO XRAY.
053000 MPY-TEST-F1-4-1.
053100     IF       XRAY EQUAL TO "L"
053200              PERFORM PASS
053300     ELSE
053400              GO TO MPY-FAIL-F1-4-1.
053500     GO TO    MPY-WRITE-F1-4-1.
053600 MPY-DELETE-F1-4-1.
053700     PERFORM  DE-LETE.
053800     GO TO    MPY-WRITE-F1-4-1.
053900 MPY-FAIL-F1-4-1.
054000     MOVE    "L"   TO CORRECT-X.
054100     MOVE     XRAY TO COMPUTED-X.
054200     MOVE  "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
054300     PERFORM  FAIL.
054400 MPY-WRITE-F1-4-1.
054500     MOVE    "MPY-TEST-F1-4-1" TO PAR-NAME.
054600     PERFORM  PRINT-DETAIL.
054700 MPY-TEST-F1-4-2.
054800     IF       MULT6 EQUAL TO 20
054900              PERFORM PASS
055000     ELSE
055100              GO TO MPY-FAIL-F1-4-2.
055200     GO TO    MPY-WRITE-F1-4-2.
055300 MPY-DELETE-F1-4-2.
055400     PERFORM  DE-LETE.
055500     GO TO    MPY-WRITE-F1-4-2.
055600 MPY-FAIL-F1-4-2.
055700     PERFORM  FAIL.
055800     MOVE     MULT6 TO COMPUTED-N.
055900     MOVE     +20 TO CORRECT-N.
056000     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
056100 MPY-WRITE-F1-4-2.
056200     MOVE    "MPY-TEST-F1-4-2" TO PAR-NAME.
056300     PERFORM  PRINT-DETAIL.
056400
056500 MPY-INIT-F1-5.
056600     MOVE    "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
056700     MOVE     222222222222 TO WRK-DS-18V00.
056800 MPY-TEST-F1-5-0.
056900     MULTIPLY A06THREES-DS-03V03 BY WRK-DS-18V00.
057000 MPY-TEST-F1-5-1.
057100     IF  WRK-DS-18V00 EQUAL TO 000074073999999925
057200         PERFORM PASS
057300         GO TO MPY-WRITE-F1-5.
057400     GO TO  MPY-FAIL-F1-5.
057500 MPY-DELETE-F1-5.
057600     PERFORM DE-LETE.
057700     GO TO  MPY-WRITE-F1-5.
057800 MPY-FAIL-F1-5.
057900     MOVE   000074073999999925 TO CORRECT-18V0.
058000     MOVE   WRK-DS-18V00       TO COMPUTED-18V0.
058100     PERFORM FAIL.
058200 MPY-WRITE-F1-5.
058300     MOVE "MPY-TEST-F1-5 " TO PAR-NAME.
058400     PERFORM PRINT-DETAIL.
058500
058600 MPY-INIT-F1-6.
058700     MOVE   "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
058800     MOVE    A08TWOS-DS-02V06 TO WRK-DS-06V06.
058900 MPY-TEST-F1-6-0.
059000     MULTIPLY 0.4 BY WRK-DS-06V06 ROUNDED.
059100 MPY-TEST-F1-6-1.
059200     IF WRK-DS-12V00-S EQUAL TO 000008888889
059300         PERFORM PASS
059400         GO TO MPY-WRITE-F1-6.
059500     GO TO MPY-FAIL-F1-6.
059600 MPY-DELETE-F1-6.
059700     PERFORM DE-LETE.
059800     GO TO MPY-WRITE-F1-6.
059900 MPY-FAIL-F1-6.
060000     MOVE  WRK-DS-12V00-S     TO COMPUTED-18V0.
060100     MOVE  000008888889       TO CORRECT-18V0.
060200     PERFORM FAIL.
060300 MPY-WRITE-F1-6.
060400     MOVE "MPY-TEST-F1-6         " TO PAR-NAME.
060500     PERFORM PRINT-DETAIL.
060600
060700 MPY-INIT-F1-7.
060800     MOVE   "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
060900     MOVE   "0" TO WRK-XN-00001.
061000     MOVE    A10ONES-DS-10V00 TO WRK-DS-10V00.
061100 MPY-TEST-F1-7-0.
061200     MULTIPLY A12THREES-DS-06V06 BY WRK-DS-10V00
061300         ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
061400 MPY-TEST-F1-7-1.
061500     IF WRK-DS-10V00 EQUAL TO 1111111111
061600         PERFORM PASS
061700         GO TO MPY-WRITE-F1-7-1.
061800     GO TO MPY-FAIL-F1-7-1.
061900 MPY-DELETE-F1-7-1.
062000     PERFORM DE-LETE.
062100     GO TO MPY-WRITE-F1-7-1.
062200 MPY-FAIL-F1-7-1.
062300     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
062400     MOVE  1111111111         TO CORRECT-18V0.
062500     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
062600     PERFORM FAIL.
062700 MPY-WRITE-F1-7-1.
062800     MOVE "MPY-TEST-F1-7-1         " TO PAR-NAME.
062900     PERFORM PRINT-DETAIL.
063000 MPY-TEST-F1-7-2.
063100     IF WRK-XN-00001 EQUAL TO "1"
063200         PERFORM PASS
063300         GO TO MPY-WRITE-F1-7-2.
063400     MOVE    "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
063500     MOVE "1" TO CORRECT-A.
063600     MOVE WRK-XN-00001 TO COMPUTED-A.
063700     PERFORM FAIL.
063800     GO TO MPY-WRITE-F1-7-2.
063900 MPY-DELETE-F1-7-2.
064000     PERFORM DE-LETE.
064100 MPY-WRITE-F1-7-2.
064200     MOVE "MPY-TEST-F1-7-2         " TO PAR-NAME.
064300     PERFORM PRINT-DETAIL.
064400
064500 MPY-INIT-F1-8.
064600     MOVE   "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
064700     MOVE   "1" TO WRK-XN-00001.
064800     MOVE   -99 TO WRK-DS-02V00.
064900 MPY-TEST-F1-8-0.
065000     MULTIPLY AZERO-DS-05V05 BY WRK-DS-02V00
065100         ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
065200 MPY-TEST-F1-8-1.
065300     IF WRK-DS-02V00 EQUAL TO 00
065400         PERFORM PASS
065500         GO TO MPY-WRITE-F1-8-1.
065600     GO TO MPY-FAIL-F1-8-1.
065700 MPY-DELETE-F1-8-1.
065800     PERFORM DE-LETE.
065900     GO TO MPY-WRITE-F1-8-1.
066000 MPY-FAIL-F1-8-1.
066100     MOVE  WRK-DS-02V00       TO COMPUTED-N.
066200     MOVE  00                 TO CORRECT-N.
066300     PERFORM FAIL.
066400 MPY-WRITE-F1-8-1.
066500     MOVE "MPY-TEST-F1-8-1         " TO PAR-NAME.
066600     PERFORM PRINT-DETAIL.
066700 MPY-TEST-F1-8-2.
066800     IF WRK-XN-00001 EQUAL TO "1"
066900         PERFORM PASS
067000         GO TO MPY-WRITE-F1-8-2.
067100     MOVE "1" TO CORRECT-A.
067200     MOVE WRK-XN-00001 TO COMPUTED-A.
067300     MOVE    "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
067400     PERFORM FAIL.
067500     GO TO MPY-WRITE-F1-8-2.
067600 MPY-DELETE-F1-8-2.
067700     PERFORM DE-LETE.
067800 MPY-WRITE-F1-8-2.
067900     MOVE "MPY-TEST-F1-8-2         " TO PAR-NAME.
068000     PERFORM PRINT-DETAIL.
068100
068200 MPY-INIT-F1-9.
068300     MOVE   "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
068400     MOVE   "0" TO WRK-XN-00001.
068500     MOVE   -01 TO WRK-DS-02V00.
068600 MPY-TEST-F1-9-0.
068700     MULTIPLY 99.5 BY WRK-DS-02V00 ROUNDED
068800         ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
068900 MPY-TEST-F1-9-1.
069000     IF WRK-DS-02V00 EQUAL TO -01
069100         PERFORM PASS
069200         GO TO MPY-WRITE-F1-9-1.
069300     GO TO MPY-FAIL-F1-9-1.
069400 MPY-DELETE-F1-9-1.
069500     PERFORM DE-LETE.
069600     GO TO MPY-WRITE-F1-9-1.
069700 MPY-FAIL-F1-9-1.
069800     MOVE  WRK-DS-02V00       TO COMPUTED-N.
069900     MOVE  -01                TO CORRECT-N.
070000     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
070100     PERFORM FAIL.
070200 MPY-WRITE-F1-9-1.
070300     MOVE "MPY-TEST-F1-9-1         " TO PAR-NAME.
070400     PERFORM PRINT-DETAIL.
070500 MPY-TEST-F1-9-2.
070600     IF WRK-XN-00001 EQUAL TO "1"
070700         PERFORM PASS
070800         GO TO MPY-WRITE-F1-9-2.
070900     MOVE "1" TO CORRECT-A.
071000     MOVE WRK-XN-00001 TO COMPUTED-A.
071100     MOVE    "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
071200     PERFORM FAIL.
071300     GO TO MPY-WRITE-F1-9-2.
071400 MPY-DELETE-F1-9-2.
071500     PERFORM DE-LETE.
071600 MPY-WRITE-F1-9-2.
071700     MOVE "MPY-TEST-F1-9-2         " TO PAR-NAME.
071800     PERFORM PRINT-DETAIL.
071900
072000 MPY-INIT-F1-10.
072100     MOVE   "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
072200     MOVE   "1" TO WRK-XN-00001.
072300     MOVE   -01 TO WRK-DS-02V00.
072400 MPY-TEST-F1-10-0.
072500     MULTIPLY 99.4 BY WRK-DS-02V00 ROUNDED
072600         ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
072700 MPY-TEST-F1-10-1.
072800     IF WRK-DS-02V00 EQUAL TO -99
072900         PERFORM PASS
073000         GO TO MPY-WRITE-F1-10-1.
073100     GO TO MPY-FAIL-F1-10-1.
073200 MPY-DELETE-F1-10-1.
073300     PERFORM DE-LETE.
073400     GO TO MPY-WRITE-F1-10-1.
073500 MPY-FAIL-F1-10-1.
073600     MOVE  WRK-DS-02V00       TO COMPUTED-N.
073700     MOVE  -99                TO CORRECT-N.
073800     PERFORM FAIL.
073900 MPY-WRITE-F1-10-1.
074000     MOVE "MPY-TEST-F1-10-1         " TO PAR-NAME.
074100     PERFORM PRINT-DETAIL.
074200 MPY-TEST-F1-10-2.
074300     IF WRK-XN-00001 EQUAL TO "1"
074400         PERFORM PASS
074500         GO TO MPY-WRITE-F1-10-2.
074600     MOVE "1" TO CORRECT-A.
074700     MOVE WRK-XN-00001 TO COMPUTED-A.
074800     MOVE    "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
074900     PERFORM FAIL.
075000     GO TO MPY-WRITE-F1-10-2.
075100 MPY-DELETE-F1-10-2.
075200     PERFORM DE-LETE.
075300 MPY-WRITE-F1-10-2.
075400     MOVE "MPY-TEST-F1-10-2         " TO PAR-NAME.
075500     PERFORM PRINT-DETAIL.
075600
075700 MPY-INIT-F1-11.
075800     MOVE   "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
075900     MOVE   -990 TO WRK-DS-0201P.
076000 MPY-TEST-F1-11-0.
076100     MULTIPLY A01ONE-CS-00V01 BY WRK-DS-0201P.
076200 MPY-TEST-F1-11.
076300     MOVE WRK-DS-0201P TO WRK-DS-05V00.
076400     IF WRK-DS-05V00 EQUAL TO -00090
076500         PERFORM PASS
076600         GO TO MPY-WRITE-F1-11.
076700     MOVE -00090 TO CORRECT-N.
076800     MOVE  WRK-DS-05V00       TO COMPUTED-N.
076900     PERFORM FAIL.
077000     GO TO MPY-WRITE-F1-11.
077100 MPY-DELETE-F1-11.
077200     PERFORM DE-LETE.
077300 MPY-WRITE-F1-11.
077400     MOVE "MPY-TEST-F1-11         " TO PAR-NAME.
077500     PERFORM PRINT-DETAIL.
077600
077700 MPY-INIT-F1-12.
077800     MOVE   "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
077900     MOVE    A18ONES-DS-18V00   TO WRK-CS-18V00.
078000 MPY-TEST-F1-12-0.
078100     MULTIPLY A01ONE-DS-P0801 BY WRK-CS-18V00.
078200 MPY-TEST-F1-12.
078300     MOVE WRK-CS-18V00 TO WRK-DU-18V00.
078400     IF WRK-DU-18V00 EQUAL TO 000000000111111111
078500         PERFORM PASS
078600         GO TO MPY-WRITE-F1-12.
078700     MOVE  000000000111111111 TO CORRECT-18V0.
078800     MOVE WRK-DU-18V00     TO COMPUTED-18V0.
078900     PERFORM FAIL.
079000     GO TO MPY-WRITE-F1-12.
079100 MPY-DELETE-F1-12.
079200     PERFORM DE-LETE.
079300 MPY-WRITE-F1-12.
079400     MOVE "MPY-TEST-F1-12         " TO PAR-NAME.
079500     PERFORM PRINT-DETAIL.
079600*
079700*
079800 MPY-INIT-F1-13.
079900*    ===--> NEW SIZE ERROR TESTS <--===
080000     MOVE   "VI-67 6.4.2 " TO ANSI-REFERENCE.
080100     MOVE   "MPY-TEST-F1-13       " TO PAR-NAME.
080200     MOVE   "0" TO WRK-XN-00001.
080300     MOVE    1111111111       TO WRK-DS-10V00.
080400     MOVE    1 TO REC-CT.
080500 MPY-TEST-F1-13-0.
080600     MULTIPLY A12THREES-DS-06V06 BY WRK-DS-10V00
080700              ON SIZE ERROR GO TO MPY-TEST-F1-13-1
080800              NOT ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
080900     GO TO MPY-TEST-F1-13-1.
081000 MPY-DELETE-F1-13.
081100     PERFORM DE-LETE.
081200     PERFORM PRINT-DETAIL.
081300     GO TO MPY-INIT-F1-14.
081400 MPY-TEST-F1-13-1.
081500     MOVE   "MPY-TEST-F1-13-1" TO PAR-NAME
081600     IF      WRK-XN-00001 = "0"
081700             PERFORM PASS
081800             PERFORM PRINT-DETAIL
081900     ELSE
082000             MOVE    WRK-XN-00001     TO COMPUTED-X
082100             MOVE   "0"               TO CORRECT-X
082200             MOVE   "SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK
082300             PERFORM FAIL
082400             PERFORM PRINT-DETAIL.
082500     ADD     1 TO REC-CT.
082600 MPY-TEST-F1-13-2.
082700     MOVE   "MPY-TEST-F1-13-2" TO PAR-NAME
082800     IF      WRK-DS-10V00 = 1111111111
082900             PERFORM PASS
083000             PERFORM PRINT-DETAIL
083100     ELSE
083200             MOVE    WRK-DS-10V00       TO COMPUTED-18V0
083300             MOVE    1111111111         TO CORRECT-18V0
083400             MOVE   "SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK
083500             PERFORM FAIL
083600             PERFORM PRINT-DETAIL.
083700*
083800*
083900 MPY-INIT-F1-14.
084000*    ===--> NEW SIZE ERROR TESTS <--===
084100     MOVE   "VI-67 6.4.2 " TO ANSI-REFERENCE.
084200     MOVE   "MPY-TEST-F1-14        " TO PAR-NAME.
084300     MOVE   "1" TO WRK-XN-00001.
084400     MOVE    1  TO REC-CT.
084500     MOVE   -99 TO WRK-DS-02V00.
084600 MPY-TEST-F1-14-0.
084700     MULTIPLY AZERO-DS-05V05 BY WRK-DS-02V00
084800          ON SIZE ERROR GO TO MPY-TEST-F1-14-1
084900          NOT ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
085000     GO TO   MPY-TEST-F1-14-1.
085100 MPY-DELETE-F1-14.
085200     PERFORM DE-LETE.
085300     PERFORM PRINT-DETAIL.
085400     GO TO   MPY-INIT-F1-15.
085500 MPY-TEST-F1-14-1.
085600     MOVE   "MPY-TEST-F1-14-1" TO PAR-NAME.
085700     IF      WRK-XN-00001 = "0"
085800             PERFORM PASS
085900             PERFORM PRINT-DETAIL
086000     ELSE
086100             MOVE    WRK-XN-00001     TO COMPUTED-X
086200             MOVE   "0"               TO CORRECT-X
086300             MOVE    "NOT ON SIZE ERROR SHOULD BE EXECUTED"
086400                  TO RE-MARK
086500             PERFORM FAIL
086600             PERFORM PRINT-DETAIL.
086700     ADD     1  TO REC-CT.
086800 MPY-TEST-F1-14-2.
086900     MOVE   "MPY-TEST-F1-14-2" TO PAR-NAME.
087000     IF      WRK-DS-02V00 = 00
087100             PERFORM PASS
087200             PERFORM PRINT-DETAIL
087300     ELSE
087400             MOVE    WRK-DS-02V00     TO COMPUTED-N
087500             MOVE    00               TO CORRECT-N
087600             PERFORM FAIL
087700             PERFORM PRINT-DETAIL.
087800*
087900*
088000 MPY-INIT-F1-15.
088100*    ===--> NEW SIZE ERROR TESTS <--===
088200     MOVE   "VI-67 6.4.2 " TO ANSI-REFERENCE.
088300     MOVE   "0" TO WRK-XN-00001.
088400     MOVE    1111111111 TO WRK-DS-10V00.
088500     MOVE    1 TO REC-CT.
088600 MPY-TEST-F1-15-0.
088700     MULTIPLY A12THREES-DS-06V06 BY WRK-DS-10V00
088800              ON SIZE ERROR MOVE "1" TO WRK-XN-00001
088900          NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001.
089000     GO TO MPY-TEST-F1-15-1.
089100 MPY-DELETE-F1-15.
089200     PERFORM DE-LETE.
089300     PERFORM PRINT-DETAIL.
089400     GO TO MPY-INIT-F1-16.
089500 MPY-TEST-F1-15-1.
089600     MOVE   "MPY-TEST-F1-15-1" TO PAR-NAME.
089700     IF      WRK-XN-00001 = "1"
089800             PERFORM PASS
089900             PERFORM PRINT-DETAIL
090000     ELSE
090100             MOVE    WRK-XN-00001     TO COMPUTED-X
090200             MOVE   "1"               TO CORRECT-X
090300             MOVE   "SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK
090400             PERFORM FAIL
090500             PERFORM PRINT-DETAIL.
090600     ADD     1 TO REC-CT.
090700 MPY-TEST-F1-15-2.
090800     MOVE   "MPY-TEST-F1-15-2" TO PAR-NAME.
090900     IF      WRK-DS-10V00 = 1111111111
091000             PERFORM PASS
091100             PERFORM PRINT-DETAIL
091200     ELSE
091300             MOVE    WRK-DS-10V00       TO COMPUTED-18V0
091400             MOVE    1111111111         TO CORRECT-18V0
091500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
091600             PERFORM FAIL
091700             PERFORM PRINT-DETAIL.
091800*
091900*
092000 MPY-INIT-F1-16.
092100*    ===--> NEW SIZE ERROR TESTS <--===
092200     MOVE   "VI-67 6.4.2 " TO ANSI-REFERENCE.
092300     MOVE   "0" TO WRK-XN-00001.
092400     MOVE   -99 TO WRK-DS-02V00.
092500     MOVE    1 TO REC-CT.
092600 MPY-TEST-F1-16-0.
092700     MULTIPLY AZERO-DS-05V05 BY WRK-DS-02V00
092800              ON SIZE ERROR MOVE "1" TO WRK-XN-00001
092900          NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001.
093000     GO TO   MPY-TEST-F1-16-1.
093100 MPY-DELETE-F1-16.
093200     PERFORM DE-LETE.
093300     PERFORM PRINT-DETAIL.
093400     GO TO   MPY-INIT-F1-17.
093500 MPY-TEST-F1-16-1.
093600     MOVE   "MPY-TEST-F1-16-1" TO PAR-NAME.
093700     IF      WRK-XN-00001 = "2"
093800             PERFORM PASS
093900             PERFORM PRINT-DETAIL
094000     ELSE
094100             MOVE    WRK-XN-00001     TO COMPUTED-X
094200             MOVE   "2"               TO CORRECT-X
094300             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
094400                  TO RE-MARK
094500             PERFORM FAIL
094600             PERFORM PRINT-DETAIL.
094700     ADD     1 TO REC-CT.
094800 MPY-TEST-F1-16-2.
094900     MOVE   "MPY-TEST-F1-16-2" TO PAR-NAME.
095000     IF      WRK-DS-02V00 = 00
095100             PERFORM PASS
095200             PERFORM PRINT-DETAIL
095300     ELSE
095400             MOVE    WRK-DS-02V00     TO COMPUTED-N
095500             MOVE    00               TO CORRECT-N
095600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
095700             PERFORM FAIL
095800             PERFORM PRINT-DETAIL.
095900*
096000*
096100 MPY-INIT-F1-17.
096200     MOVE   "VI-106 6.19.4 GR1" TO ANSI-REFERENCE.
096300*    ===--> MULTIPLE RESULT FIELDS <--===
096400     MOVE   "MPY-TEST-F1-17" TO PAR-NAME.
096500     MOVE    .00001  TO WRK-DU-4P1-1.
096600     MOVE    12345.6 TO WRK-DU-5V1-1.
096700     MOVE    1 TO REC-CT.
096800 MPY-TEST-F1-17-0.
096900     MULTIPLY WRK-DU-4P1-1 BY WRK-DU-5V1-1 ROUNDED WRK-DU-2P4-1
097000         WRK-DU-6V0-1 ROUNDED WRK-DU-6V0-2 WRK-DU-0V12-1.
097100     GO TO MPY-TEST-F1-17-1.
097200 MPY-DELETE-F1-17.
097300     PERFORM DE-LETE.
097400     MOVE "*DELETED BY FCTC*" TO FEATURE.
097500     PERFORM PRINT-DETAIL.
097600     GO TO MPY-INIT-F1-18.
097700 MPY-TEST-F1-17-1.
097800     IF WRK-DU-5V1-1 = .1 PERFORM PASS PERFORM PRINT-DETAIL
097900     ELSE
098000     PERFORM FAIL MOVE WRK-DU-5V1-1 TO COMPUTED-N MOVE .1
098100     TO CORRECT-N PERFORM PRINT-DETAIL.
098200     ADD 1 TO REC-CT.
098300 MPY-TEST-F1-17-2.
098400     IF WRK-DU-2P4-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
098500     ELSE
098600     PERFORM FAIL MOVE WRK-DU-2P4-1 TO COMPUTED-N MOVE 0 TO
098700     CORRECT-N PERFORM PRINT-DETAIL.
098800     ADD 1 TO REC-CT.
098900 MPY-TEST-F1-17-3.
099000     IF WRK-DU-6V0-1 = 1 PERFORM PASS PERFORM PRINT-DETAIL
099100     ELSE
099200     PERFORM FAIL MOVE WRK-DU-6V0-1 TO COMPUTED-N MOVE 1
099300     TO CORRECT-N PERFORM PRINT-DETAIL.
099400     ADD 1 TO REC-CT.
099500 MPY-TEST-F1-17-4.
099600     IF WRK-DU-6V0-2 = 0 PERFORM PASS PERFORM PRINT-DETAIL
099700     ELSE
099800     PERFORM FAIL MOVE WRK-DU-6V0-2 TO COMPUTED-N MOVE 0 TO
099900     CORRECT-N PERFORM PRINT-DETAIL.
100000     ADD 1 TO REC-CT.
100100 MPY-TEST-F1-17-5.
100200     IF WRK-DU-0V12-1 = .0000000001 PERFORM PASS PERFORM
100300     PRINT-DETAIL ELSE
100400     PERFORM FAIL MOVE WRK-DU-0V12-1 TO COMPUTED-0V18 MOVE
100500     .0000000001 TO CORRECT-0V18 PERFORM PRINT-DETAIL.
100600*
100700 MPY-INIT-F1-18.
100800*     =>   SIZE ERROR CONDITION. <--==
100900*    ==-->   MULTIPLE RESULT FIELDS<--==
101000*    ===--> & SIZE ERROR CONDITIONS<--===
101100     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
101200     MOVE   "MPY-TEST-F1-18" TO PAR-NAME.
101300     MOVE   "0" TO WRK-XN-00001.
101400     MOVE    0  TO WRK-DU-2P4-1.
101500     MOVE    0  TO WRK-DU-6V0-1.
101600     MOVE    0  TO WRK-DU-6V0-2.
101700     MOVE    0  TO WRK-DU-0V12-1.
101800     MOVE   99  TO WRK-DU-2V0-1.
101900     MOVE 12345.6 TO WRK-DU-5V1-1.
102000     MOVE    1 TO REC-CT.
102100 MPY-TEST-F1-18-0.
102200     MULTIPLY WRK-DU-5V1-1 BY WRK-DU-2V0-1 ROUNDED WRK-DU-2P4-1
102300             WRK-DU-6V0-1 ROUNDED WRK-DU-6V0-2 WRK-DU-0V12-1
102400             ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
102500     GO TO MPY-TEST-F1-18-1.
102600 MPY-DELETE-F1-18.
102700     PERFORM DE-LETE.
102800     MOVE   "*DELETED BY FCTC*" TO FEATURE.
102900     PERFORM PRINT-DETAIL.
103000     GO TO   MPY-INIT-F1-19.
103100 MPY-TEST-F1-18-1.
103200     IF WRK-DU-2V0-1 = 99 PERFORM PASS PERFORM PRINT-DETAIL
103300     ELSE
103400     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 99
103500     TO CORRECT-N PERFORM PRINT-DETAIL.
103600     ADD 1 TO REC-CT.
103700 MPY-TEST-F1-18-2.
103800     IF WRK-DU-2P4-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
103900     ELSE
104000     PERFORM FAIL MOVE WRK-DU-2P4-1 TO COMPUTED-N MOVE 0 TO
104100     CORRECT-N PERFORM PRINT-DETAIL.
104200     ADD 1 TO REC-CT.
104300 MPY-TEST-F1-18-3.
104400     IF WRK-DU-6V0-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
104500     ELSE
104600     PERFORM FAIL MOVE WRK-DU-6V0-1 TO COMPUTED-N MOVE 0
104700     TO CORRECT-N PERFORM PRINT-DETAIL.
104800     ADD 1 TO REC-CT.
104900 MPY-TEST-F1-18-4.
105000     IF WRK-DU-6V0-2 = 0 PERFORM PASS PERFORM PRINT-DETAIL
105100     ELSE
105200     PERFORM FAIL MOVE WRK-DU-6V0-2 TO COMPUTED-N MOVE 0 TO
105300     CORRECT-N PERFORM PRINT-DETAIL.
105400     ADD 1 TO REC-CT.
105500 MPY-TEST-F1-18-5.
105600     IF WRK-DU-0V12-1 = 0 PERFORM PASS PERFORM
105700     PRINT-DETAIL ELSE
105800     PERFORM FAIL MOVE WRK-DU-0V12-1 TO COMPUTED-0V18 MOVE 0
105900     TO CORRECT-0V18 PERFORM PRINT-DETAIL.
106000     ADD 1 TO REC-CT.
106100 MPY-TEST-F1-18-6.
106200     IF      WRK-XN-00001 = "1"
106300             PERFORM PASS
106400             PERFORM PRINT-DETAIL
106500     ELSE
106600             MOVE   "ON SIZE ERROR SHOULD HAVE EXECUTED"
106700                  TO RE-MARK
106800             MOVE    WRK-XN-00001  TO COMPUTED-X
106900             MOVE   "1"            TO CORRECT-X
107000             PERFORM PRINT-DETAIL.
107100*
107200 MPY-INIT-F1-19.
107300*    ==-->  NO   SIZE ERROR CONDITION. <--==
107400*    ==-->   MULTIPLE RESULT FIELDS <--==
107500*    ===--> & SIZE ERROR CONDITIONS <--===
107600     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
107700     MOVE   "MPY-TEST-F1-19" TO PAR-NAME.
107800     MOVE   "0" TO WRK-XN-00001.
107900     MOVE    0  TO WRK-DU-2P4-1.
108000     MOVE    0  TO WRK-DU-6V0-1.
108100     MOVE    0  TO WRK-DU-6V0-2.
108200     MOVE   .00001  TO WRK-DU-0V12-1.
108300     MOVE   99  TO WRK-DU-2V0-1.
108400     MOVE 12345.6 TO WRK-DU-5V1-1.
108500     MOVE .00001 TO WRK-DU-4P1-1.
108600     MOVE    1  TO REC-CT.
108700 MPY-TEST-F1-19-0.
108800     MULTIPLY WRK-DU-4P1-1 BY WRK-DU-5V1-1 ROUNDED WRK-DU-2P4-1
108900             WRK-DU-6V0-1 ROUNDED WRK-DU-6V0-2
109000             WRK-DU-0V12-1
109100             ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
109200     GO TO MPY-TEST-F1-19-1.
109300 MPY-DELETE-F1-19.
109400     PERFORM DE-LETE.
109500     MOVE "*DELETED BY FCTC*" TO FEATURE.
109600     PERFORM PRINT-DETAIL.
109700     GO TO MPY-INIT-F1-20.
109800 MPY-TEST-F1-19-1.
109900     IF WRK-DU-5V1-1 = .1 PERFORM PASS PERFORM PRINT-DETAIL
110000     ELSE
110100     PERFORM FAIL MOVE WRK-DU-5V1-1 TO COMPUTED-N MOVE .1
110200     TO CORRECT-N PERFORM PRINT-DETAIL.
110300     ADD 1 TO REC-CT.
110400 MPY-TEST-F1-19-2.
110500     IF WRK-DU-2P4-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
110600     ELSE
110700     PERFORM FAIL MOVE WRK-DU-2P4-1 TO COMPUTED-N MOVE 0 TO
110800     CORRECT-N PERFORM PRINT-DETAIL.
110900     ADD 1 TO REC-CT.
111000 MPY-TEST-F1-19-3.
111100     IF WRK-DU-6V0-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
111200     ELSE
111300     PERFORM FAIL MOVE WRK-DU-6V0-1 TO COMPUTED-N MOVE 0
111400     TO CORRECT-N PERFORM PRINT-DETAIL.
111500     ADD 1 TO REC-CT.
111600 MPY-TEST-F1-19-4.
111700     IF WRK-DU-6V0-2 = 0 PERFORM PASS PERFORM PRINT-DETAIL
111800     ELSE
111900     PERFORM FAIL MOVE WRK-DU-6V0-2 TO COMPUTED-N MOVE 0 TO
112000     CORRECT-N PERFORM PRINT-DETAIL.
112100     ADD 1 TO REC-CT.
112200 MPY-TEST-F1-19-5.
112300     IF WRK-DU-0V12-1 = .0000000001 PERFORM PASS PERFORM
112400     PRINT-DETAIL ELSE
112500     PERFORM FAIL MOVE WRK-DU-0V12-1 TO COMPUTED-0V18 MOVE
112600     .0000000001 TO CORRECT-0V18 PERFORM PRINT-DETAIL.
112700     ADD 1 TO REC-CT.
112800 MPY-TEST-F1-19-6.
112900     IF      WRK-XN-00001 = "0"
113000             PERFORM PASS
113100             PERFORM PRINT-DETAIL
113200     ELSE
113300             MOVE   "ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
113400                  TO RE-MARK
113500             MOVE    WRK-XN-00001  TO COMPUTED-X
113600             MOVE   "0"            TO CORRECT-X
113700             PERFORM PRINT-DETAIL.
113800*
113900 MPY-INIT-F1-20.
114000*   ==-->   SIZE ERROR CONDITION.   <--==
114100*   ==-->  MULTIPLE RESULT FIELDS   <--==
114200*   ==-->  NEW SIZE ERROR TESTS     <--==
114300     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
114400     MOVE   "MPY-TEST-F1-20" TO PAR-NAME.
114500     MOVE   "0" TO WRK-XN-00001.
114600     MOVE    0  TO WRK-DU-2P4-1.
114700     MOVE    0  TO WRK-DU-6V0-1.
114800     MOVE    0  TO WRK-DU-6V0-2.
114900     MOVE    0  TO WRK-DU-0V12-1.
115000     MOVE   99  TO WRK-DU-2V0-1.
115100     MOVE 12345.6 TO WRK-DU-5V1-1.
115200     MOVE    1 TO REC-CT.
115300 MPY-TEST-F1-20-0.
115400     MULTIPLY WRK-DU-5V1-1 BY WRK-DU-2V0-1 ROUNDED WRK-DU-2P4-1
115500             WRK-DU-6V0-1 ROUNDED WRK-DU-6V0-2 WRK-DU-0V12-1
115600             ON SIZE ERROR GO TO MPY-TEST-F1-20-1
115700         NOT ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
115800     GO TO MPY-TEST-F1-20-1.
115900 MPY-DELETE-F1-20.
116000     PERFORM DE-LETE.
116100     MOVE "*DELETED BY FCTC*" TO FEATURE.
116200     PERFORM PRINT-DETAIL.
116300     GO TO MPY-INIT-F1-21.
116400 MPY-TEST-F1-20-1.
116500     IF WRK-DU-2V0-1 = 99 PERFORM PASS PERFORM PRINT-DETAIL
116600     ELSE
116700     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 99
116800     TO CORRECT-N PERFORM PRINT-DETAIL.
116900     ADD 1 TO REC-CT.
117000 MPY-TEST-F1-20-2.
117100     IF WRK-DU-2P4-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
117200     ELSE
117300     PERFORM FAIL MOVE WRK-DU-2P4-1 TO COMPUTED-N MOVE 0 TO
117400     CORRECT-N PERFORM PRINT-DETAIL.
117500     ADD 1 TO REC-CT.
117600 MPY-TEST-F1-20-3.
117700     IF WRK-DU-6V0-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
117800     ELSE
117900     PERFORM FAIL MOVE WRK-DU-6V0-1 TO COMPUTED-N MOVE 0
118000     TO CORRECT-N PERFORM PRINT-DETAIL.
118100     ADD 1 TO REC-CT.
118200 MPY-TEST-F1-20-4.
118300     IF WRK-DU-6V0-2 = 0 PERFORM PASS PERFORM PRINT-DETAIL
118400     ELSE
118500     PERFORM FAIL MOVE WRK-DU-6V0-2 TO COMPUTED-N MOVE 0 TO
118600     CORRECT-N PERFORM PRINT-DETAIL.
118700     ADD 1 TO REC-CT.
118800 MPY-TEST-F1-20-5.
118900     IF WRK-DU-0V12-1 = 0 PERFORM PASS PERFORM
119000     PRINT-DETAIL ELSE
119100     PERFORM FAIL MOVE WRK-DU-0V12-1 TO COMPUTED-0V18 MOVE 0
119200     TO CORRECT-0V18 PERFORM PRINT-DETAIL.
119300     ADD 1 TO REC-CT.
119400 MPY-TEST-F1-20-6.
119500     IF      WRK-XN-00001 = "0"
119600             PERFORM PASS
119700             PERFORM PRINT-DETAIL
119800     ELSE
119900             MOVE   "NOT ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
120000                  TO RE-MARK
120100             MOVE    WRK-XN-00001  TO COMPUTED-X
120200             MOVE   "0"            TO CORRECT-X
120300             PERFORM PRINT-DETAIL.
120400*
120500 MPY-INIT-F1-21.
120600*   ==-->   NO SIZE ERROR CONDITION.  <--==
120700*   ==-->   MULTIPLE RESULT FIELDS    <--==
120800*   ==-->    NEW SIZE ERROR TESTS     <--==
120900     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
121000     MOVE   "MPY-TEST-F1-21" TO PAR-NAME.
121100     MOVE   "0" TO WRK-XN-00001.
121200     MOVE    0  TO WRK-DU-2P4-1.
121300     MOVE    0  TO WRK-DU-6V0-1.
121400     MOVE    0  TO WRK-DU-6V0-2.
121500     MOVE   .00001  TO WRK-DU-0V12-1.
121600     MOVE   99  TO WRK-DU-2V0-1.
121700     MOVE 12345.6 TO WRK-DU-5V1-1.
121800     MOVE .00001 TO WRK-DU-4P1-1.
121900     MOVE    1  TO REC-CT.
122000 MPY-TEST-F1-21-0.
122100     MULTIPLY WRK-DU-4P1-1 BY WRK-DU-5V1-1 ROUNDED WRK-DU-2P4-1
122200             WRK-DU-6V0-1 ROUNDED
122300             WRK-DU-6V0-2 ROUNDED WRK-DU-0V12-1
122400             ON SIZE ERROR GO TO MPY-TEST-F1-21-1
122500         NOT ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
122600     GO TO  MPY-TEST-F1-21-1.
122700 MPY-DELETE-F1-21.
122800     PERFORM DE-LETE.
122900     MOVE "*DELETED BY FCTC*" TO FEATURE.
123000     PERFORM PRINT-DETAIL.
123100     GO TO  MPY-INIT-F1-22.
123200 MPY-TEST-F1-21-1.
123300     IF  WRK-DU-5V1-1 = .1 PERFORM PASS PERFORM PRINT-DETAIL
123400     ELSE
123500     PERFORM FAIL MOVE WRK-DU-5V1-1 TO COMPUTED-N MOVE .1
123600     TO CORRECT-N PERFORM PRINT-DETAIL.
123700     ADD 1 TO REC-CT.
123800 MPY-TEST-F1-21-2.
123900     IF WRK-DU-2P4-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
124000     ELSE
124100     PERFORM FAIL MOVE WRK-DU-2P4-1 TO COMPUTED-N MOVE 0 TO
124200     CORRECT-N PERFORM PRINT-DETAIL.
124300     ADD 1 TO REC-CT.
124400 MPY-TEST-F1-21-3.
124500     IF WRK-DU-6V0-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
124600     ELSE
124700     PERFORM FAIL MOVE WRK-DU-6V0-1 TO COMPUTED-N MOVE 1
124800     TO CORRECT-N PERFORM PRINT-DETAIL.
124900     ADD 1 TO REC-CT.
125000 MPY-TEST-F1-21-4.
125100     IF WRK-DU-6V0-2 = 0 PERFORM PASS PERFORM PRINT-DETAIL
125200     ELSE
125300     PERFORM FAIL MOVE WRK-DU-6V0-2 TO COMPUTED-N MOVE 0 TO
125400     CORRECT-N PERFORM PRINT-DETAIL.
125500     ADD 1 TO REC-CT.
125600 MPY-TEST-F1-21-5.
125700     IF WRK-DU-0V12-1 = .0000000001 PERFORM PASS PERFORM
125800     PRINT-DETAIL ELSE
125900     PERFORM FAIL MOVE WRK-DU-0V12-1 TO COMPUTED-0V18 MOVE
126000     .0000000001 TO CORRECT-0V18 PERFORM PRINT-DETAIL.
126100     ADD 1 TO REC-CT.
126200 MPY-TEST-F1-21-6.
126300     IF      WRK-XN-00001 = "1"
126400             PERFORM PASS
126500             PERFORM PRINT-DETAIL
126600     ELSE
126700             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
126800                  TO RE-MARK
126900             MOVE    WRK-XN-00001  TO COMPUTED-X
127000             MOVE   "1"            TO CORRECT-X
127100             PERFORM PRINT-DETAIL.
127200*
127300 MPY-INIT-F1-22.
127400*   ==-->   SIZE ERROR CONDITION.   <--==
127500*   ==-->   MULTIPLE RESULT FIELDS  <--==
127600*   ==-->   NEW SIZE ERROR TESTS    <--==
127700     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
127800     MOVE   "MPY-TEST-F1-22" TO PAR-NAME.
127900     MOVE   "0" TO WRK-XN-00001.
128000     MOVE    0  TO WRK-DU-2P4-1.
128100     MOVE    0  TO WRK-DU-6V0-1.
128200     MOVE    0  TO WRK-DU-6V0-2.
128300     MOVE    0  TO WRK-DU-0V12-1.
128400     MOVE   99  TO WRK-DU-2V0-1.
128500     MOVE 12345.6 TO WRK-DU-5V1-1.
128600     MOVE    1  TO REC-CT.
128700 MPY-TEST-F1-22-0.
128800     MULTIPLY WRK-DU-5V1-1 BY WRK-DU-2V0-1 ROUNDED WRK-DU-2P4-1
128900             WRK-DU-6V0-1 ROUNDED WRK-DU-6V0-2 WRK-DU-0V12-1
129000             ON SIZE ERROR MOVE "1" TO WRK-XN-00001
129100         NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001.
129200     GO TO MPY-TEST-F1-22-1.
129300 MPY-DELETE-F1-22.
129400     PERFORM DE-LETE.
129500     MOVE "*DELETED BY FCTC*" TO FEATURE.
129600     PERFORM PRINT-DETAIL.
129700     GO TO MPY-INIT-F1-23.
129800 MPY-TEST-F1-22-1.
129900     IF WRK-DU-5V1-1 = 12345.6 PERFORM PASS PERFORM PRINT-DETAIL
130000     ELSE
130100     PERFORM FAIL MOVE WRK-DU-5V1-1 TO COMPUTED-N MOVE 12345.6
130200     TO CORRECT-N PERFORM PRINT-DETAIL.
130300     ADD 1 TO REC-CT.
130400 MPY-TEST-F1-22-2.
130500     IF WRK-DU-2P4-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
130600     ELSE
130700     PERFORM FAIL MOVE WRK-DU-2P4-1 TO COMPUTED-N MOVE 0 TO
130800     CORRECT-N PERFORM PRINT-DETAIL.
130900     ADD 1 TO REC-CT.
131000 MPY-TEST-F1-22-3.
131100     IF WRK-DU-6V0-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
131200     ELSE
131300     PERFORM FAIL MOVE WRK-DU-6V0-1 TO COMPUTED-N MOVE 0
131400     TO CORRECT-N PERFORM PRINT-DETAIL.
131500     ADD 1 TO REC-CT.
131600 MPY-TEST-F1-22-4.
131700     IF WRK-DU-6V0-2 = 0 PERFORM PASS PERFORM PRINT-DETAIL
131800     ELSE
131900     PERFORM FAIL MOVE WRK-DU-6V0-2 TO COMPUTED-N MOVE 0 TO
132000     CORRECT-N PERFORM PRINT-DETAIL.
132100     ADD 1 TO REC-CT.
132200 MPY-TEST-F1-22-5.
132300     IF WRK-DU-0V12-1 = 0 PERFORM PASS PERFORM
132400     PRINT-DETAIL ELSE
132500     PERFORM FAIL MOVE WRK-DU-0V12-1 TO COMPUTED-0V18 MOVE
132600     0 TO CORRECT-0V18 PERFORM PRINT-DETAIL.
132700     ADD 1 TO REC-CT.
132800 MPY-TEST-F1-22-6.
132900     IF      WRK-XN-00001 = "1"
133000             PERFORM PASS
133100             PERFORM PRINT-DETAIL
133200     ELSE
133300             MOVE   "ON SIZE ERROR SHOULD HAVE EXECUTED"
133400                  TO RE-MARK
133500             MOVE    WRK-XN-00001  TO COMPUTED-X
133600             MOVE   "1"            TO CORRECT-X
133700             PERFORM PRINT-DETAIL.
133800*
133900*
134000 MPY-INIT-F1-23.
134100*   ==-->   NO SIZE ERROR CONDITION.   <--==
134200*   ==-->   MULTIPLE RESULT FIELDS     <--==
134300*   ==-->   NEW SIZE ERROR TESTS       <--==
134400     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
134500     MOVE   "MPY-TEST-F1-23" TO PAR-NAME.
134600     MOVE   "0" TO WRK-XN-00001.
134700     MOVE    0  TO WRK-DU-2P4-1.
134800     MOVE    0  TO WRK-DU-6V0-1.
134900     MOVE    0  TO WRK-DU-6V0-2.
135000     MOVE   .00001  TO WRK-DU-0V12-1.
135100     MOVE   99  TO WRK-DU-2V0-1.
135200     MOVE 12345.6 TO WRK-DU-5V1-1.
135300     MOVE .00001 TO WRK-DU-4P1-1.
135400     MOVE    1  TO REC-CT.
135500 MPY-TEST-F1-23-0.
135600     MULTIPLY WRK-DU-4P1-1 BY WRK-DU-5V1-1 ROUNDED WRK-DU-2P4-1
135700             WRK-DU-6V0-1 ROUNDED
135800             WRK-DU-6V0-2 ROUNDED WRK-DU-0V12-1
135900             ON SIZE ERROR MOVE "1" TO WRK-XN-00001
136000         NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001.
136100     GO TO MPY-TEST-F1-23-1.
136200 MPY-DELETE-F1-23.
136300     PERFORM DE-LETE.
136400     MOVE "*DELETED BY FCTC*" TO FEATURE.
136500     PERFORM PRINT-DETAIL.
136600     GO TO MPY-INIT-F1-24.
136700 MPY-TEST-F1-23-1.
136800     IF WRK-DU-5V1-1 = .1 PERFORM PASS PERFORM PRINT-DETAIL
136900     ELSE
137000     PERFORM FAIL MOVE WRK-DU-5V1-1 TO COMPUTED-N MOVE .1
137100     TO CORRECT-N PERFORM PRINT-DETAIL.
137200     ADD 1 TO REC-CT.
137300 MPY-TEST-F1-23-2.
137400     IF WRK-DU-2P4-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
137500     ELSE
137600     PERFORM FAIL MOVE WRK-DU-2P4-1 TO COMPUTED-N MOVE 0 TO
137700     CORRECT-N PERFORM PRINT-DETAIL.
137800     ADD 1 TO REC-CT.
137900 MPY-TEST-F1-23-3.
138000     IF WRK-DU-6V0-1 = 0 PERFORM PASS PERFORM PRINT-DETAIL
138100     ELSE
138200     PERFORM FAIL MOVE WRK-DU-6V0-1 TO COMPUTED-N MOVE 0
138300     TO CORRECT-N PERFORM PRINT-DETAIL.
138400     ADD 1 TO REC-CT.
138500 MPY-TEST-F1-23-4.
138600     IF WRK-DU-6V0-2 = 0 PERFORM PASS PERFORM PRINT-DETAIL
138700     ELSE
138800     PERFORM FAIL MOVE WRK-DU-6V0-2 TO COMPUTED-N MOVE 0 TO
138900     CORRECT-N PERFORM PRINT-DETAIL.
139000     ADD 1 TO REC-CT.
139100 MPY-TEST-F1-23-5.
139200     IF WRK-DU-0V12-1 = .0000000001 PERFORM PASS PERFORM
139300     PRINT-DETAIL ELSE
139400     PERFORM FAIL MOVE WRK-DU-0V12-1 TO COMPUTED-0V18 MOVE
139500     .0000000001 TO CORRECT-0V18 PERFORM PRINT-DETAIL.
139600     ADD 1 TO REC-CT.
139700 MPY-TEST-F1-23-6.
139800     IF      WRK-XN-00001 = "2"
139900             PERFORM PASS
140000             PERFORM PRINT-DETAIL
140100     ELSE
140200             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
140300                  TO RE-MARK
140400             MOVE    WRK-XN-00001  TO COMPUTED-X
140500             MOVE   "1"            TO CORRECT-X
140600             PERFORM PRINT-DETAIL.
140700*
140800*
140900 MPY-INIT-F1-24.
141000*    ==-->EXPLICIT SCOPE TERMINATOR <--==
141100*    ==-->   SIZE ERROR CONDITION   <--==
141200     MOVE   "IV-41 6.4.3" TO ANSI-REFERENCE.
141300     MOVE   "MPY-TEST-F1-24" TO PAR-NAME
141400     MOVE   "0" TO WRK-XN-00001.
141500     MOVE    A10ONES-DS-10V00 TO WRK-DS-10V00.
141600     MOVE    0  TO WRK-DS-05V00.
141700     MOVE    0  TO WRK-DS-02V00.
141800     MOVE    0  TO WRK-CS-18V00.
141900     MOVE    1  TO REC-CT.
142000 MPY-TEST-F1-24-0.
142100     MULTIPLY A12THREES-DS-06V06 BY WRK-DS-10V00
142200         ON SIZE ERROR MOVE "1" TO WRK-XN-00001
142300                       MOVE 23  TO WRK-DS-05V00
142400                       MOVE -4  TO WRK-DS-02V00
142500     END-MULTIPLY
142600     MOVE    99 TO WRK-CS-18V00.
142700     GO TO   MPY-TEST-F1-24-1.
142800 MPY-DELETE-F1-24-1.
142900     PERFORM DE-LETE.
143000     PERFORM PRINT-DETAIL.
143100     GO TO   MPY-INIT-F1-25.
143200 MPY-TEST-F1-24-1.
143300     MOVE   "MPY-TEST-F1-24-1" TO PAR-NAME.
143400     IF      WRK-XN-00001 = "1"
143500             PERFORM PASS
143600             PERFORM PRINT-DETAIL
143700     ELSE
143800             MOVE   WRK-XN-00001 TO COMPUTED-X
143900             MOVE  "1"           TO CORRECT-X
144000             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
144100             PERFORM FAIL
144200             PERFORM PRINT-DETAIL.
144300     ADD     1 TO REC-CT.
144400 MPY-TEST-F1-24-2.
144500     MOVE   "MPY-TEST-F1-24-2" TO PAR-NAME.
144600     IF      WRK-DS-05V00 = 23
144700             PERFORM PASS
144800             PERFORM PRINT-DETAIL
144900     ELSE
145000             MOVE   WRK-DS-05V00 TO COMPUTED-N
145100             MOVE   23           TO CORRECT-N
145200             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
145300             PERFORM FAIL
145400             PERFORM PRINT-DETAIL.
145500     ADD     1 TO REC-CT.
145600 MPY-TEST-F1-24-3.
145700     MOVE   "MPY-TEST-F1-24-3" TO PAR-NAME.
145800     IF      WRK-DS-02V00 = -4
145900             PERFORM PASS
146000             PERFORM PRINT-DETAIL
146100     ELSE
146200             MOVE   WRK-DS-02V00 TO COMPUTED-N
146300             MOVE   -4           TO CORRECT-N
146400             MOVE  "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
146500             PERFORM FAIL
146600             PERFORM PRINT-DETAIL.
146700     ADD     1 TO REC-CT.
146800 MPY-TEST-F1-24-4.
146900     MOVE   "MPY-TEST-F1-24-4"  TO PAR-NAME.
147000     IF      WRK-DS-10V00 = 1111111111
147100             PERFORM PASS
147200             PERFORM PRINT-DETAIL
147300     ELSE
147400             MOVE   WRK-DS-10V00       TO COMPUTED-18V0
147500             MOVE   1111111111         TO CORRECT-18V0
147600             MOVE  "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
147700             PERFORM FAIL
147800             PERFORM PRINT-DETAIL.
147900     ADD     1 TO REC-CT.
148000 MPY-TEST-F1-24-5.
148100     MOVE   "MPY-TEST-F1-24-5" TO PAR-NAME.
148200     IF      WRK-CS-18V00 = 000000000000000099
148300             PERFORM PASS
148400             PERFORM PRINT-DETAIL
148500     ELSE
148600             MOVE   WRK-CS-18V00       TO COMPUTED-N
148700             MOVE   000000000000000099 TO CORRECT-N
148800             MOVE  "SCOPE TERMINATOR IGNORED" TO RE-MARK
148900             PERFORM FAIL
149000             PERFORM PRINT-DETAIL.
149100*
149200*
149300 MPY-INIT-F1-25.
149400*    ==-->EXPLICIT SCOPE TERMINATOR <--==
149500     MOVE   "IV-41 6.4.3" TO ANSI-REFERENCE.
149600     MOVE   "MPY-TEST-F1-25" TO PAR-NAME
149700     MOVE   "1" TO WRK-XN-00001.
149800     MOVE   -99 TO WRK-DS-02V00.
149900     MOVE    0  TO WRK-DS-10V00.
150000     MOVE    0  TO WRK-DS-01V00.
150100     MOVE    0  TO WRK-CS-18V00.
150200     MOVE    1  TO REC-CT.
150300 MPY-TEST-F1-25-0.
150400     MULTIPLY AZERO-DS-05V05 BY WRK-DS-02V00
150500          ON SIZE ERROR MOVE "0" TO WRK-XN-00001
150600                        MOVE 23  TO WRK-DS-10V00
150700                        MOVE -4  TO WRK-DS-01V00
150800     END-MULTIPLY
150900     MOVE    99 TO WRK-CS-18V00.
151000     GO TO   MPY-TEST-F1-25-1.
151100 MPY-DELETE-F1-25-1.
151200     PERFORM DE-LETE.
151300     PERFORM PRINT-DETAIL.
151400     GO TO   MPY-INIT-F1-26.
151500 MPY-TEST-F1-25-1.
151600     MOVE   "MPY-TEST-F1-25-1" TO PAR-NAME.
151700     IF      WRK-XN-00001 = "1"
151800             PERFORM PASS
151900             PERFORM PRINT-DETAIL
152000     ELSE
152100             MOVE    WRK-XN-00001 TO COMPUTED-X
152200             MOVE   "1"           TO CORRECT-X
152300             MOVE   "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
152400             PERFORM FAIL
152500             PERFORM PRINT-DETAIL.
152600     ADD     1  TO REC-CT.
152700 MPY-TEST-F1-25-2.
152800     MOVE   "MPY-TEST-F1-25-2" TO PAR-NAME.
152900     IF      WRK-DS-10V00 = 0000000000
153000             PERFORM PASS
153100             PERFORM PRINT-DETAIL
153200     ELSE
153300             MOVE    WRK-DS-10V00 TO COMPUTED-N
153400             MOVE    0000000000   TO CORRECT-N
153500             MOVE   "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
153600             PERFORM FAIL
153700             PERFORM PRINT-DETAIL.
153800     ADD     1  TO REC-CT.
153900 MPY-TEST-F1-25-3.
154000     MOVE   "MPY-TEST-F1-25-3" TO PAR-NAME.
154100     IF      WRK-DS-01V00 = 0
154200             PERFORM PASS
154300             PERFORM PRINT-DETAIL
154400     ELSE
154500             MOVE   WRK-DS-01V00 TO COMPUTED-N
154600             MOVE   0            TO CORRECT-N
154700             MOVE   "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
154800             PERFORM FAIL
154900             PERFORM PRINT-DETAIL.
155000     ADD     1  TO REC-CT.
155100 MPY-TEST-F1-25-4.
155200     MOVE   "MPY-TEST-F1-25-4" TO PAR-NAME.
155300     IF      WRK-DS-02V00 = 00
155400             PERFORM PASS
155500             PERFORM PRINT-DETAIL
155600     ELSE
155700             MOVE   WRK-DS-02V00 TO COMPUTED-N
155800             MOVE   00           TO CORRECT-N
155900             MOVE   "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
156000             PERFORM FAIL
156100             PERFORM PRINT-DETAIL.
156200     ADD     1  TO REC-CT.
156300 MPY-TEST-F1-25-5.
156400     MOVE   "MPY-TEST-F1-25-5" TO PAR-NAME.
156500     IF      WRK-CS-18V00 = 000000000000000099
156600             PERFORM PASS
156700             PERFORM PRINT-DETAIL
156800     ELSE
156900             MOVE   WRK-CS-18V00       TO COMPUTED-N
157000             MOVE   000000000000000099 TO CORRECT-N
157100             MOVE  "SCOPE TERMINATOR IGNORED" TO RE-MARK
157200             PERFORM FAIL
157300             PERFORM PRINT-DETAIL.
157400*
157500*
157600 MPY-INIT-F1-26.
157700*    ==-->EXPLICIT SCOPE TERMINATOR <--==
157800     MOVE   "IV-41 6.4.3" TO ANSI-REFERENCE.
157900     MOVE   "MPY-TEST-F1-26" TO PAR-NAME
158000     MOVE   "0" TO WRK-XN-00001.
158100     MOVE    A10ONES-DS-10V00        TO WRK-DS-10V00.
158200     MOVE    0  TO WRK-DS-05V00.
158300     MOVE    0  TO WRK-DS-02V00.
158400     MOVE    0  TO WRK-CS-18V00.
158500     MOVE    1  TO REC-CT.
158600 MPY-TEST-F1-26-0.
158700     MULTIPLY A12THREES-DS-06V06     BY WRK-DS-10V00
158800          ON SIZE ERROR GO TO MPY-TEST-F1-26-01
158900          NOT ON SIZE ERROR MOVE "1" TO WRK-XN-00001
159000                            MOVE 23  TO WRK-DS-05V00
159100                            MOVE -4  TO WRK-DS-02V00
159200     END-MULTIPLY.
159300 MPY-TEST-F1-26-01.
159400     MOVE    99 TO WRK-CS-18V00.
159500     GO TO   MPY-TEST-F1-26-1.
159600 MPY-DELETE-F1-26-1.
159700     PERFORM DE-LETE.
159800     PERFORM PRINT-DETAIL.
159900     GO TO   MPY-INIT-F1-27.
160000 MPY-TEST-F1-26-1.
160100     MOVE   "MPY-TEST-F1-26-1" TO PAR-NAME.
160200     IF      WRK-XN-00001 = "0"
160300             PERFORM PASS
160400             PERFORM PRINT-DETAIL
160500     ELSE
160600             MOVE    WRK-XN-00001 TO COMPUTED-X
160700             MOVE   "0"           TO CORRECT-X
160800             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
160900                  TO RE-MARK
161000             PERFORM FAIL
161100             PERFORM PRINT-DETAIL.
161200     ADD     1  TO REC-CT.
161300 MPY-TEST-F1-26-2.
161400     MOVE   "MPY-TEST-F1-26-2" TO PAR-NAME.
161500     IF      WRK-DS-05V00 = 00000
161600             PERFORM PASS
161700             PERFORM PRINT-DETAIL
161800     ELSE
161900             MOVE    WRK-DS-05V00 TO COMPUTED-N
162000             MOVE    0            TO CORRECT-N
162100             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
162200                  TO RE-MARK
162300             PERFORM FAIL
162400             PERFORM PRINT-DETAIL.
162500     ADD     1  TO REC-CT.
162600 MPY-TEST-F1-26-3.
162700     MOVE   "MPY-TEST-F1-26-3" TO PAR-NAME.
162800     IF      WRK-DS-02V00 = 0
162900             PERFORM PASS
163000             PERFORM PRINT-DETAIL
163100     ELSE
163200             MOVE   WRK-DS-02V00 TO COMPUTED-N
163300             MOVE   0            TO CORRECT-N
163400             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
163500                  TO RE-MARK
163600             PERFORM FAIL
163700             PERFORM PRINT-DETAIL.
163800     ADD     1  TO REC-CT.
163900 MPY-TEST-F1-26-4.
164000     MOVE   "MPY-TEST-F1-26-4" TO PAR-NAME.
164100     IF      WRK-CS-18V00 = 000000000000000099
164200             PERFORM PASS
164300             PERFORM PRINT-DETAIL
164400     ELSE
164500             MOVE   WRK-CS-18V00       TO COMPUTED-N
164600             MOVE   000000000000000099 TO CORRECT-N
164700             MOVE  "SCOPE TERMINATOR IGNORED" TO RE-MARK
164800             PERFORM FAIL
164900             PERFORM PRINT-DETAIL.
165000     ADD     1  TO REC-CT.
165100 MPY-TEST-F1-26-5.
165200     MOVE   "MPY-TEST-F1-26-5" TO PAR-NAME.
165300     IF      WRK-DS-10V00 = 1111111111
165400             PERFORM PASS
165500             PERFORM PRINT-DETAIL
165600     ELSE
165700             MOVE    WRK-DS-10V00 TO COMPUTED-18V0
165800             MOVE    1111111111   TO CORRECT-18V0
165900             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
166000                  TO RE-MARK
166100             PERFORM FAIL
166200             PERFORM PRINT-DETAIL.
166300*
166400*
166500 MPY-INIT-F1-27.
166600*    ==-->EXPLICIT SCOPE TERMINATOR <--==
166700     MOVE   "IV-41 6.4.3" TO ANSI-REFERENCE.
166800     MOVE   "1" TO WRK-XN-00001.
166900     MOVE   -99 TO WRK-DS-02V00.
167000     MOVE    0  TO WRK-DS-10V00.
167100     MOVE    0  TO WRK-DS-01V00.
167200     MOVE    0  TO WRK-DS-18V00.
167300     MOVE    1  TO REC-CT.
167400 MPY-TEST-F1-27-0.
167500     MULTIPLY AZERO-DS-05V05      BY WRK-DS-02V00
167600       ON SIZE ERROR GO TO MPY-TEST-F1-27-01
167700       NOT ON SIZE ERROR MOVE "0" TO WRK-XN-00001
167800                         MOVE 23  TO WRK-DS-10V00
167900                         MOVE -4  TO WRK-DS-01V00
168000     END-MULTIPLY.
168100 MPY-TEST-F1-27-01.
168200     MOVE    99 TO WRK-CS-18V00.
168300     GO TO   MPY-TEST-F1-27-1.
168400 MPY-DELETE-F1-27-1.
168500     PERFORM DE-LETE.
168600     PERFORM PRINT-DETAIL.
168700     GO TO   MPY-INIT-F1-28.
168800 MPY-TEST-F1-27-1.
168900     MOVE   "MPY-TEST-F1-27-1" TO PAR-NAME.
169000     IF      WRK-XN-00001 = "0"
169100             PERFORM PASS
169200             PERFORM PRINT-DETAIL
169300     ELSE
169400             MOVE    WRK-XN-00001 TO COMPUTED-X
169500             MOVE   "0"           TO CORRECT-X
169600             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
169700                  TO RE-MARK
169800             PERFORM FAIL
169900             PERFORM PRINT-DETAIL.
170000     ADD 1 TO REC-CT.
170100 MPY-TEST-F1-27-2.
170200     MOVE   "MPY-TEST-F1-27-2" TO PAR-NAME.
170300     IF      WRK-DS-10V00 = 23
170400             PERFORM PASS
170500             PERFORM PRINT-DETAIL
170600     ELSE
170700             MOVE   WRK-DS-10V00 TO COMPUTED-N
170800             MOVE   23           TO CORRECT-N
170900             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
171000                  TO RE-MARK
171100             PERFORM FAIL
171200             PERFORM PRINT-DETAIL.
171300     ADD 1 TO REC-CT.
171400 MPY-TEST-F1-27-3.
171500     MOVE   "MPY-TEST-F1-27-3" TO PAR-NAME.
171600     IF      WRK-DS-02V00 = 00
171700             PERFORM PASS
171800             PERFORM PRINT-DETAIL
171900     ELSE
172000             MOVE    WRK-DS-02V00 TO COMPUTED-N
172100             MOVE    00           TO CORRECT-N
172200             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
172300                  TO RE-MARK
172400             PERFORM FAIL
172500             PERFORM PRINT-DETAIL.
172600     ADD 1 TO REC-CT.
172700 MPY-TEST-F1-27-4.
172800     MOVE   "MPY-TEST-F1-27-4" TO PAR-NAME.
172900     IF      WRK-DS-01V00 = -4
173000             PERFORM PASS
173100             PERFORM PRINT-DETAIL
173200     ELSE
173300             MOVE   WRK-DS-01V00 TO COMPUTED-N
173400             MOVE   -4           TO CORRECT-N
173500             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
173600                  TO RE-MARK
173700             PERFORM FAIL
173800             PERFORM PRINT-DETAIL.
173900     ADD 1 TO REC-CT.
174000 MPY-TEST-F1-27-5.
174100     MOVE   "MPY-TEST-F1-27-5" TO PAR-NAME
174200     IF      WRK-CS-18V00 = 000000000000000099
174300             PERFORM PASS
174400             PERFORM PRINT-DETAIL
174500     ELSE
174600             MOVE    WRK-CS-18V00       TO COMPUTED-N
174700             MOVE    000000000000000099 TO CORRECT-N
174800             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
174900             PERFORM FAIL
175000             PERFORM PRINT-DETAIL.
175100*
175200*
175300 MPY-INIT-F1-28.
175400*    ==-->EXPLICIT SCOPE TERMINATOR <--==
175500     MOVE    A10ONES-DS-10V00        TO WRK-DS-10V00.
175600     MOVE   "0" TO WRK-XN-00001.
175700     MOVE    0  TO WRK-CS-18V00.
175800     MOVE    1  TO REC-CT.
175900 MPY-TEST-F1-28-0.
176000     MULTIPLY A12THREES-DS-06V06     BY WRK-DS-10V00
176100              ON SIZE ERROR MOVE "1" TO WRK-XN-00001
176200          NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001
176300     END-MULTIPLY
176400     MOVE    99 TO WRK-CS-18V00.
176500     GO TO   MPY-TEST-F1-28-1.
176600 MPY-DELETE-F1-28-1.
176700     PERFORM DE-LETE.
176800     PERFORM PRINT-DETAIL.
176900     GO TO   MPY-INIT-F1-29.
177000 MPY-TEST-F1-28-1.
177100     MOVE   "MPY-TEST-F1-28-1" TO PAR-NAME.
177200     IF      WRK-XN-00001 = "1"
177300             PERFORM PASS
177400             PERFORM PRINT-DETAIL
177500     ELSE
177600             MOVE    WRK-XN-00001 TO COMPUTED-X
177700             MOVE   "1"           TO CORRECT-X
177800             MOVE   "SIZE ERROR SHOULD HAVE OCCURRED"
177900                  TO RE-MARK
178000             PERFORM FAIL
178100             PERFORM PRINT-DETAIL.
178200     ADD     1  TO REC-CT.
178300 MPY-TEST-F1-28-2.
178400     MOVE   "MPY-TEST-F1-28-2" TO PAR-NAME.
178500     IF      WRK-DS-10V00 = 1111111111
178600             PERFORM PASS
178700             PERFORM PRINT-DETAIL
178800     ELSE
178900             MOVE    WRK-DS-10V00 TO COMPUTED-18V0
179000             MOVE    1111111111   TO CORRECT-18V0
179100             MOVE   "SIZE ERROR SHOULD HAVE OCCURRED"
179200                  TO RE-MARK
179300             PERFORM FAIL
179400             PERFORM PRINT-DETAIL.
179500     ADD     1  TO REC-CT.
179600 MPY-TEST-F1-28-3.
179700     MOVE   "MPY-TEST-F1-28-3" TO PAR-NAME.
179800     IF      WRK-CS-18V00 = 000000000000000099
179900             PERFORM PASS
180000             PERFORM PRINT-DETAIL
180100     ELSE
180200             MOVE    WRK-CS-18V00       TO COMPUTED-N
180300             MOVE    000000000000000099 TO CORRECT-N
180400             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
180500             PERFORM FAIL
180600             PERFORM PRINT-DETAIL.
180700*
180800*
180900 MPY-INIT-F1-29.
181000*    ==-->EXPLICIT SCOPE TERMINATOR <--==
181100     MOVE   "0" TO WRK-XN-00001.
181200     MOVE   -99 TO WRK-DS-02V00.
181300     MOVE    ZERO TO WRK-CS-18V00.
181400     MOVE    1 TO REC-CT.
181500 MPY-TEST-F1-29-0.
181600     MULTIPLY AZERO-DS-05V05         BY WRK-DS-02V00
181700              ON SIZE ERROR MOVE "1" TO WRK-XN-00001
181800          NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001
181900     END-MULTIPLY
182000     MOVE    99 TO WRK-CS-18V00.
182100     GO TO   MPY-TEST-F1-29-1.
182200 MPY-DELETE-F1-29-1.
182300     PERFORM DE-LETE.
182400     PERFORM PRINT-DETAIL.
182500     GO TO   CCVS-EXIT.
182600 MPY-TEST-F1-29-1.
182700     MOVE   "MPY-TEST-F1-29-1" TO PAR-NAME.
182800     IF      WRK-XN-00001 = "2"
182900             PERFORM PASS
183000             PERFORM PRINT-DETAIL
183100     ELSE
183200             MOVE    WRK-XN-00001 TO COMPUTED-X
183300             MOVE   "2"           TO CORRECT-X
183400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
183500                  TO RE-MARK
183600             PERFORM FAIL
183700             PERFORM PRINT-DETAIL.
183800     ADD     1 TO REC-CT.
183900 MPY-TEST-F1-29-2.
184000     MOVE   "MPY-TEST-F1-29-2" TO PAR-NAME.
184100     IF      WRK-DS-02V00 = 00
184200             PERFORM PASS
184300             PERFORM PRINT-DETAIL
184400     ELSE
184500             MOVE    WRK-DS-02V00 TO COMPUTED-N
184600             MOVE    00           TO CORRECT-N
184700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
184800                  TO RE-MARK
184900             PERFORM FAIL
185000             PERFORM PRINT-DETAIL.
185100     ADD     1 TO REC-CT.
185200 MPY-TEST-F1-29-3.
185300     MOVE   "MPY-TEST-F1-29-3" TO PAR-NAME.
185400     IF      WRK-CS-18V00 = 000000000000000099
185500             PERFORM PASS
185600             PERFORM PRINT-DETAIL
185700     ELSE
185800             MOVE    WRK-CS-18V00       TO COMPUTED-N
185900             MOVE    000000000000000099 TO CORRECT-N
186000             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
186100             PERFORM FAIL
186200             PERFORM PRINT-DETAIL.
186300*
186400*
186500 CCVS-EXIT SECTION.
186600 CCVS-999999.
186700     GO TO CLOSE-FILES.
