000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC107A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC107A TESTS THE FOLLOWING FEATURES:
002300*
002400*                  FIGURATIVE CONSTANTS
002500*                  CONTINUATION LINES
002600*                  SEPARATORS
002700*                  JUSTIFIED CLAUSE
002800*                  SYNCHRONISED CLAUSE
002900*                  BLANK WHEN ZERO CLAUSE
003000*                  MAXIMUM LENGTH DATA-NAMES, LITERALS
003100*                    AND PARAGRAPH-NAMES.
003200*                  REDEFINES CLAUSE
003300*                  USAGE CLAUSE
003400*                  VALUE CLAUSE
003500*                  CURRENCY SIGN CLAUSE
003600*                  DECIMAL-POINT IS COMMA CLAUSE
003700*                  NUMERIC PARAGRAPH NAMES
003800*                  CONTINUE STATEMENT
003900
004000 ENVIRONMENT DIVISION.
004100 CONFIGURATION SECTION.
004200 SOURCE-COMPUTER.
004300     XXXXX082.
004400 OBJECT-COMPUTER.
004500     XXXXX083.
004600 SPECIAL-NAMES.
004700     CURRENCY SIGN IS "W"
004800     DECIMAL-POINT IS COMMA.
004900 INPUT-OUTPUT SECTION.
005000 FILE-CONTROL.
005100     SELECT PRINT-FILE ASSIGN TO
005200     XXXXX055.
005300 DATA DIVISION.
005400 FILE SECTION.
005500 FD  PRINT-FILE.
005600 01  PRINT-REC PICTURE X(120).
005700 01  DUMMY-RECORD PICTURE X(120).
005800 WORKING-STORAGE SECTION.
005900 01  SUB1   PIC S9(3) COMP.
006000 01  SUB2   PIC S9(3) COMP.
006100 01  TAB-LOC.
006200   03  FILLER       PIC X(16)  VALUE "TABLE LOCATION: ".
006300   03  TAB1         PIC ZZ9.
006400   03  FILLER       PIC XX VALUE ", ".
006500   03  TAB2         PIC ZZ9.
006600 77  DATA-A                             PICTURE IS X(10).
006700 77  DATA-B                             PICTURE IS 9(5).
006800 77  DATA-C                             PICTURE IS 9(5).
006900 77  DATA-D                             PICTURE IS X(10)
007000     JUSTIFIED RIGHT.
007100 77  DATA-E                             PICTURE IS A(9)
007200     JUSTIFIED.
007300 77  DATA-F                             PICTURE IS 9(10)
007400     BLANK WHEN ZERO.
007500 77  DATA-G  SYNCHRONIZED RIGHT   PICTURE X(5)
007600     VALUE IS "VWXYZ".
007700 77  DATA-H                             PICTURE IS X(5)
007800     VALUE IS "VWXYZ".
007900 77  DATA-I                             PICTURE IS 9999
008000     VALUE IS 12.
008100 77  DATA-J                             PICTURE IS WWWWW.
008200 77  DATA-K                             PICTURE IS 9999999V99
008300     VALUE IS 1234567,89.
008400 77  DATA-L                             PICTURE IS 9.999.999,99.
008500 77  DATA-M                       PICTURE IS W9999
008600     BLANK WHEN ZERO.
008700 77  DATA-N                             PICTURE IS X(16)
008800     VALUE IS "4 SPACES ON LEFT".
008900 77  DATA-O                             PICTURE IS X(20)
009000     JUSTIFIED RIGHT.
009100 77  DATA-P PICTURE 999 VALUE "000" BLANK WHEN ZERO.
009200 77  DATA-P1 REDEFINES DATA-P PICTURE XXX.
009300 77  DATA-Q                               VALUE "QUOTE IN COL. 72"
009400     PICTURE X(16).
009500 77  DATA-R                              VALUE "LITERAL ENDS AT 72
009600-    ""
009700     PICTURE X(18).
009800 77  DATA-S             PICTURE X(20) VALUE               "OFFSET
009900-             "CONTINUATION ".
010000 77  DATA-T             PICTURE X(20) VALUE  "OFFSET CONTINUATION
010100-                                             "".
010200 77  DATA-U             PICTURE X(20) VALUE                   "OFF
010300-                                                             "SET
010400-                                                             " CO
010500-                                                             "NTI
010600-                                                             "NUA
010700-                                                               "T
010800-                                                             "ION
010900-                                                             " ".
011000 77  DATA-V             PICTURE X(20) VALUE SPACE.
011100 77  DATA-W             PICTURE X(20) VALUE
011200     "OFFSET CONTINUATION ".
011300 77  NUM-UTILITY        PICTURE 9999
011400     VALUE ZERO.
011500 01  WRK-XN-160-1 PIC X(160) VALUE
011600     """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
011700-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
011800-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
011900-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
012000-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
012100-    """""""""""""""""""""".
012200 01  CHARACTER-BREAKDOWN-R.
012300     02  FIRST-20R               PICTURE X(20).
012400     02  SECOND-20R              PICTURE X(20).
012500     02  THIRD-20R               PICTURE X(20).
012600     02  FOURTH-20R              PICTURE X(20).
012700 01  CHARACTER-BREAKDOWN-S.
012800     02  FIRST-20S               PICTURE X(20).
012900     02  SECOND-20S              PICTURE X(20).
013000     02  THIRD-20S               PICTURE X(20).
013100     02  FOURTH-20S              PICTURE X(20).
013200 01  X80-CHARACTER-FIELD.
013300     02  FILLER                  PICTURE X(80).
013400 01  A-DATA-NAME-30-CHARACTERS-LONG     PICTURE IS X.
013500 01  LONG-PICTURE                       PICTURE IS
013600      XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX.
013700 01  LONG-NUMBER        PICTURE 999999999V999999999
013800     VALUE IS 211113411,114311112.
013900 01  LONG-LITERAL.
014000     02 LONG20                          PICTURE IS X(20)
014100     VALUE IS "STANDARD COMPILERS M".
014200     02 LONG40                          PICTURE IS X(20)
014300     VALUE IS "UST ALLOW NON-NUMERI".
014400     02 LONG60                          PICTURE IS X(20)
014500     VALUE IS "C LITERALS OF AT LEA".
014600     02 LONG80                          PICTURE IS X(20)
014700     VALUE IS "ST 120 CHARACTERS AN".
014800     02 LONG100                         PICTURE IS X(20)
014900     VALUE IS "D NUMERIC LITERALS O".
015000     02 LONG120                         PICTURE IS X(20)
015100     VALUE IS "F AT LEAST 18 DIGITS".
015200     02 LONG140                         PICTURE IS X(20)
015300     VALUE IS " BUT NOW EXTENDED UP".
015400     02 LONG160                         PICTURE IS X(20)
015500     VALUE IS "TO 160 DIGITS FOR 8X".
015600 01  LONG-PICTURE-A     PICTURE X(000000000000000020).
015700 01  LONG-PICTURE-B     PICTURE X(15) JUSTIFIED RIGHT.
015800 01  LONG-PICTURE-C     PICTURE X(000000000000000010).
015900 01  REDEF1                             PICTURE IS 9 VALUE IS 9.
016000 01  REDEF2 REDEFINES REDEF1            PICTURE IS X.
016100 01  REDEF3                             PICTURE IS XXX
016200     VALUE IS "ABC".
016300 01  REDEF4 REDEFINES REDEF3            PICTURE IS A.
016400 01  REDEF5                             PICTURE IS X(6)
016500     VALUE IS "UVWXYZ".
016600 01  REDEF6 REDEFINES REDEF5            PICTURE IS 9(6).
016700 01  REDEF7 REDEFINES REDEF5            PICTURE IS A(6).
016800 01  REDEF8 REDEFINES REDEF5.
016900     02 REDEF8X.
017000     03 REDEF8A                         PICTURE IS XX.
017100     03 REDEF8B                         PICTURE IS 99.
017200     02 REDEF8C                         PICTURE IS AA.
017300 01  REDEF9 REDEFINES REDEF5            PICTURE IS X(6).
017400 01  REDEF10.
017500     02  RDFDATA1                PICTURE X(10) VALUE "ABC98765DE".
017600     02 RDFDATA2 PIC 9(4)V99 VALUE 9116,44.
017700     02  RDFDATA3.
017800         08  RDFDATA4            PICTURE X(6)  VALUE "ALLDON".
017900         08  RDFDATA5            PICTURE XX99  VALUE "XX66".
018000     02  RDFDATA6                PICTURE A(20) VALUE
018100
018200     "ZYXWVUTSRQPONMLKJIHG".
018300 01  REDEF11 REDEFINES REDEF10.
018400     02  RDFDATA7                PICTURE X(20).
018500     02  RDF8.
018600         03   RDFDATA8 OCCURS 36 TIMES PICTURE XX.
018700 01  REDEF12 REDEFINES REDEF10.
018800     02  RDFDATA9                PICTURE A(3).
018900     02  RDFDATA10               PICTURE 9(5).
019000     02  RDFDATA11.
019100         03  RDFDATA12.
019200             04  RDFDATA13       PICTURE XX.
019300             04  RDFDATA14 OCCURS 6 TIMES PICTURE 9.
019400         03  RDFDATA15           PICTURE X(8).
019500     02  RDFDATA16               PICTURE 99.
019600     02  RDFDATA17               PICTURE X(80).
019700     02  RDFDATA18               PICTURE X(14).
019800 01  REDEF13.
019900     02  FILLER                  PICTURE X(57)   VALUE
020000     "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA".
020100     02  FILLER                  PICTURE X(57)   VALUE
020200     "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA".
020300     02  FILLER                  PICTURE X(6)    VALUE "AAAAAA".
020400 01  REDEF20.
020500   03  REDEF21                   PICTURE X(10).
020600   03  REDEF22                   REDEFINES REDEF21
020700                                 PIC     X(10).
020800   03  REDEF23                   REDEFINES REDEF21
020900                                 PIC     X(9).
021000 01  U1.
021100     02 U2   PICTURE 9 USAGE IS
021200     DISPLAY VALUE IS 9.
021300     02 U3                              PICTURE IS 9 USAGE IS
021400     COMPUTATIONAL VALUE IS 9.
021500     02 U4                              PICTURE IS 9 USAGE IS
021600     DISPLAY VALUE IS 9.
021700     02 U5 USAGE IS COMPUTATIONAL.
021800     03 U6                              PICTURE IS 9 USAGE IS
021900     COMPUTATIONAL VALUE IS 5.
022000     03 U7                              PICTURE IS 9 VALUE IS 6.
022100     02 U8                              PICTURE IS X.
022200 01  U9                           USAGE COMPUTATIONAL.
022300     02 U10             PICTURE 9.
022400     02 U11             PICTURE 9  COMPUTATIONAL.
022500 01  U12.
022600     02 U13             PICTURE 9 USAGE IS BINARY
022700                                  VALUE 3.
022800     02 U14             PICTURE 9 USAGE IS BINARY
022900                                  VALUE 3.
023000 01  U22.
023100     02 U23             PICTURE 9 USAGE IS BINARY
023200                                  VALUE 4.
023300     02 U24             PICTURE 9 USAGE IS BINARY
023400                                  VALUE 4.
023500*
023600*    TWO-DIMENSIONAL TABLE USED IN VALUE CLAUSE:
023700*
023800 01  VALUE-TABLE.
023900   03  VALUE-TABLE-1              OCCURS 10.
024000     05  VALUE-TABLE-2            OCCURS 10
024100                                  PIC XX   VALUE "AZ".
024200*
024300*
024400 01  TEST-FIELD                   PIC X(10).
024500*
024600*
024700 01  SEP-01. 02 SEP-02. 03 SEP-03. 04 SEP-04 PICTURE X(9) VALUE
024800     "SEPARATOR".
024900*
025000*    GROUP ITEMS USED IN JUSTIFIED TESTS.
025100*
025200 01  GROUP-TO-JUST-1.
025300     02  FILLER          PICTURE X   VALUE "A".
025400     02  FILLER          PICTURE X   VALUE "B".
025500     02  FILLER          PICTURE X   VALUE "C".
025600 01  GROUP-TO-JUST-2.
025700     02  GROUP-TO-JUST-21.
025800         03  FILLER      PICTURE X(5)    VALUE "ABCDE".
025900         03  FILLER      PICTURE X(2)    VALUE "FG".
026000     02  FILLER          PICTURE X(8)    VALUE "HIJKLMNO".
026100 01  GROUP-FOR-JUST-TESTS.
026200     02  NJUST-XN-3      PICTURE X(3)    VALUE "ABC".
026300     02  NJUST-XN-5      PICTURE X(5)    VALUE "CDEFG".
026400     02  NJUST-XN-15     PICTURE X(15)   VALUE "ABCDEFGHIJKLMNO".
026500*
026600*    DATA ITEMS WITH JUSTIFIED CLAUSE.
026700*
026800 01  XJ-00005            PICTURE X(5)    JUSTIFIED RIGHT.
026900 01  AJ-00005            PICTURE A(5)    JUSTIFIED RIGHT.
027000 01  XJ-00007            PICTURE X(7)    JUST RIGHT.
027100 01  AJ-00007            PICTURE A(7)    JUSTIFIED.
027200 01  GROUP-WITH-JUST-ITEMS.
027300     02  XN-00005-NJUST      PICTURE X(5).
027400     02  XJ-00009            PICTURE X(9)    JUST.
027500     02  AJ-00009            PICTURE A(9)    JUST.
027600*
027700*    INITIALIZATION TAKES PLACE INDEPENDENT OF ANY
027800*    JUSTIFIED CLAUSE.
027900*
028000 01  XJ-00002   PICTURE X(2)   JUST  VALUE "AB".
028100 01  XJ-00003            PICTURE X(3)        JUST   VALUE "XY".
028200 01  TEST-RESULTS.
028300     02 FILLER                   PIC X      VALUE SPACE.
028400     02 FEATURE                  PIC X(20)  VALUE SPACE.
028500     02 FILLER                   PIC X      VALUE SPACE.
028600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
028700     02 FILLER                   PIC X      VALUE SPACE.
028800     02  PAR-NAME.
028900       03 FILLER                 PIC X(19)  VALUE SPACE.
029000       03  PARDOT-X              PIC X      VALUE SPACE.
029100       03 DOTVALUE               PIC 99     VALUE ZERO.
029200     02 FILLER                   PIC X(8)   VALUE SPACE.
029300     02 RE-MARK                  PIC X(61).
029400 01  TEST-COMPUTED.
029500     02 FILLER                   PIC X(30)  VALUE SPACE.
029600     02 FILLER                   PIC X(17)  VALUE
029700            "       COMPUTED=".
029800     02 COMPUTED-X.
029900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
030000     03 COMPUTED-N               REDEFINES COMPUTED-A
030100                                 PIC -9(9),9(9).
030200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -,9(18).
030300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4),9(14).
030400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14),9(4).
030500     03       CM-18V0 REDEFINES COMPUTED-A.
030600         04 COMPUTED-18V0                    PIC -9(18).
030700         04 FILLER                           PIC X.
030800     03 FILLER PIC X(50) VALUE SPACE.
030900 01  TEST-CORRECT.
031000     02 FILLER PIC X(30) VALUE SPACE.
031100     02 FILLER PIC X(17) VALUE "       CORRECT =".
031200     02 CORRECT-X.
031300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
031400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9),9(9).
031500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -,9(18).
031600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4),9(14).
031700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14),9(4).
031800     03      CR-18V0 REDEFINES CORRECT-A.
031900         04 CORRECT-18V0                     PIC -9(18).
032000         04 FILLER                           PIC X.
032100     03 FILLER PIC X(2) VALUE SPACE.
032200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
032300 01  CCVS-C-1.
032400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
032500-    "SS  PARAGRAPH-NAME
032600-    "       REMARKS".
032700     02 FILLER                     PIC X(20)    VALUE SPACE.
032800 01  CCVS-C-2.
032900     02 FILLER                     PIC X        VALUE SPACE.
033000     02 FILLER                     PIC X(6)     VALUE "TESTED".
033100     02 FILLER                     PIC X(15)    VALUE SPACE.
033200     02 FILLER                     PIC X(4)     VALUE "FAIL".
033300     02 FILLER                     PIC X(94)    VALUE SPACE.
033400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
033500 01  REC-CT                        PIC 99       VALUE ZERO.
033600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
033700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
033800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
033900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
034000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
034100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
034200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
034300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
034400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
034500 01  CCVS-H-1.
034600     02  FILLER                    PIC X(39)    VALUE SPACES.
034700     02  FILLER                    PIC X(42)    VALUE
034800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
034900     02  FILLER                    PIC X(39)    VALUE SPACES.
035000 01  CCVS-H-2A.
035100   02  FILLER                        PIC X(40)  VALUE SPACE.
035200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
035300   02  FILLER                        PIC XXXX   VALUE
035400     "4.2 ".
035500   02  FILLER                        PIC X(28)  VALUE
035600            " COPY - NOT FOR DISTRIBUTION".
035700   02  FILLER                        PIC X(41)  VALUE SPACE.
035800
035900 01  CCVS-H-2B.
036000   02  FILLER                        PIC X(15)  VALUE
036100            "TEST RESULT OF ".
036200   02  TEST-ID                       PIC X(9).
036300   02  FILLER                        PIC X(4)   VALUE
036400            " IN ".
036500   02  FILLER                        PIC X(12)  VALUE
036600     " HIGH       ".
036700   02  FILLER                        PIC X(22)  VALUE
036800            " LEVEL VALIDATION FOR ".
036900   02  FILLER                        PIC X(58)  VALUE
037000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
037100 01  CCVS-H-3.
037200     02  FILLER                      PIC X(34)  VALUE
037300            " FOR OFFICIAL USE ONLY    ".
037400     02  FILLER                      PIC X(58)  VALUE
037500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
037600     02  FILLER                      PIC X(28)  VALUE
037700            "  COPYRIGHT   1985 ".
037800 01  CCVS-E-1.
037900     02 FILLER                       PIC X(52)  VALUE SPACE.
038000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
038100     02 ID-AGAIN                     PIC X(9).
038200     02 FILLER                       PIC X(45)  VALUE SPACES.
038300 01  CCVS-E-2.
038400     02  FILLER                      PIC X(31)  VALUE SPACE.
038500     02  FILLER                      PIC X(21)  VALUE SPACE.
038600     02 CCVS-E-2-2.
038700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
038800         03 FILLER                   PIC X      VALUE SPACE.
038900         03 ENDER-DESC               PIC X(44)  VALUE
039000            "ERRORS ENCOUNTERED".
039100 01  CCVS-E-3.
039200     02  FILLER                      PIC X(22)  VALUE
039300            " FOR OFFICIAL USE ONLY".
039400     02  FILLER                      PIC X(12)  VALUE SPACE.
039500     02  FILLER                      PIC X(58)  VALUE
039600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
039700     02  FILLER                      PIC X(13)  VALUE SPACE.
039800     02 FILLER                       PIC X(15)  VALUE
039900             " COPYRIGHT 1985".
040000 01  CCVS-E-4.
040100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
040200     02 FILLER                       PIC X(4)   VALUE " OF ".
040300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
040400     02 FILLER                       PIC X(40)  VALUE
040500      "  TESTS WERE EXECUTED SUCCESSFULLY".
040600 01  XXINFO.
040700     02 FILLER                       PIC X(19)  VALUE
040800            "*** INFORMATION ***".
040900     02 INFO-TEXT.
041000       04 FILLER                     PIC X(8)   VALUE SPACE.
041100       04 XXCOMPUTED                 PIC X(20).
041200       04 FILLER                     PIC X(5)   VALUE SPACE.
041300       04 XXCORRECT                  PIC X(20).
041400     02 INF-ANSI-REFERENCE           PIC X(48).
041500 01  HYPHEN-LINE.
041600     02 FILLER  PIC IS X VALUE IS SPACE.
041700     02 FILLER  PIC IS X(65)    VALUE IS "************************
041800-    "*****************************************".
041900     02 FILLER  PIC IS X(54)    VALUE IS "************************
042000-    "******************************".
042100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
042200     "NC107A".
042300 PROCEDURE DIVISION.
042400 CCVS1 SECTION.
042500 OPEN-FILES.
042600     OPEN     OUTPUT PRINT-FILE.
042700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
042800     MOVE    SPACE TO TEST-RESULTS.
042900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
043000     GO TO CCVS1-EXIT.
043100 CLOSE-FILES.
043200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
043300 TERMINATE-CCVS.
043400S    EXIT PROGRAM.
043500STERMINATE-CALL.
043600     STOP     RUN.
043700 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
043800 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
043900 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
044000 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
044100     MOVE "****TEST DELETED****" TO RE-MARK.
044200 PRINT-DETAIL.
044300     IF REC-CT NOT EQUAL TO ZERO
044400             MOVE "." TO PARDOT-X
044500             MOVE REC-CT TO DOTVALUE.
044600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
044700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
044800        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
044900          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
045000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
045100     MOVE SPACE TO CORRECT-X.
045200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
045300     MOVE     SPACE TO RE-MARK.
045400 HEAD-ROUTINE.
045500     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045600     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045700     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
045800     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
045900 COLUMN-NAMES-ROUTINE.
046000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
046300 END-ROUTINE.
046400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
046500 END-RTN-EXIT.
046600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046700 END-ROUTINE-1.
046800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
046900      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
047000      ADD PASS-COUNTER TO ERROR-HOLD.
047100*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
047200      MOVE PASS-COUNTER TO CCVS-E-4-1.
047300      MOVE ERROR-HOLD TO CCVS-E-4-2.
047400      MOVE CCVS-E-4 TO CCVS-E-2-2.
047500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
047600  END-ROUTINE-12.
047700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
047800     IF       ERROR-COUNTER IS EQUAL TO ZERO
047900         MOVE "NO " TO ERROR-TOTAL
048000         ELSE
048100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
048200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
048300     PERFORM WRITE-LINE.
048400 END-ROUTINE-13.
048500     IF DELETE-COUNTER IS EQUAL TO ZERO
048600         MOVE "NO " TO ERROR-TOTAL  ELSE
048700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
048800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
048900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049000      IF   INSPECT-COUNTER EQUAL TO ZERO
049100          MOVE "NO " TO ERROR-TOTAL
049200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
049300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
049400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049600 WRITE-LINE.
049700     ADD 1 TO RECORD-COUNT.
049800Y    IF RECORD-COUNT GREATER 42
049900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
050000Y        MOVE SPACE TO DUMMY-RECORD
050100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
050200Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
050300Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
050400Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
050500Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
050600Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
050700Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
050800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
050900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
051000Y        MOVE ZERO TO RECORD-COUNT.
051100     PERFORM WRT-LN.
051200 WRT-LN.
051300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
051400     MOVE SPACE TO DUMMY-RECORD.
051500 BLANK-LINE-PRINT.
051600     PERFORM WRT-LN.
051700 FAIL-ROUTINE.
051800     IF     COMPUTED-X NOT EQUAL TO SPACE
051900            GO TO FAIL-ROUTINE-WRITE.
052000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
052100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
052200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
052300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052400     MOVE   SPACES TO INF-ANSI-REFERENCE.
052500     GO TO  FAIL-ROUTINE-EX.
052600 FAIL-ROUTINE-WRITE.
052700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
052800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
052900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
053000     MOVE   SPACES TO COR-ANSI-REFERENCE.
053100 FAIL-ROUTINE-EX. EXIT.
053200 BAIL-OUT.
053300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
053400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
053500 BAIL-OUT-WRITE.
053600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
053700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
053800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053900     MOVE   SPACES TO INF-ANSI-REFERENCE.
054000 BAIL-OUT-EX. EXIT.
054100 CCVS1-EXIT.
054200     EXIT.
054300 SECT-NC107A-001 SECTION.
054400*REMARKS-TEST.
054500*    MOVE   "IV-11 7.2.4" TO ANSI-REFERENCE.
054600*    MOVE   "COBOL REMARKS PARA" TO FEATURE.
054700*    MOVE   "REMARKS" TO PAR-NAME.
054800*    MOVE     "PHONY LINES SHOULDNT EXECUT" TO RE-MARK.
054900*    PERFORM  PRINT-DETAIL.
055000*NOTE-TEST-1.
055100*    PERFORM FAIL.
055200*       NOTE ENTER                         GO TO NOTE-WRITE-1
055300*            USE                           GO TO NOTE-WRITE-1
055400*            DECLARATIVES                  GO TO NOTE-WRITE-1
055500*            DATA DIVISION                 GO TO NOTE-WRITE-1
055600*            COPY (SEE ALSO PROGRAM LB104) GO TO NOTE-WRITE-1
055700*            THE COMPILER SHOULD "IGNORE" THE ABOVE WORDS.
055800*    PERFORM PASS
055900*    GO      TO NOTE-WRITE-1.
056000*NOTE-DELETE-1.
056100*    PERFORM DE-LETE.
056200 NOTE-WRITE-1.
056300     MOVE   "NOTE RESERVED WORDS" TO FEATURE.
056400     MOVE   "NOTE-TEST-1" TO PAR-NAME.
056500     PERFORM PRINT-DETAIL.
056600 FIG-INIT.
056700     MOVE   "IV-11 4.2.2.2.3" TO ANSI-REFERENCE.
056800     MOVE     SPACE TO TEST-RESULTS.
056900     MOVE "PLEASE CHECK THE COMPUTED" TO RE-MARK.
057000     PERFORM  PRINT-DETAIL.
057100     MOVE "COLUMN TO BE CERTAIN THAT" TO RE-MARK.
057200     PERFORM  PRINT-DETAIL.
057300     MOVE "THE CORRECT VALUES FOR THE" TO RE-MARK.
057400     PERFORM  PRINT-DETAIL.
057500     MOVE "FIGURATIVE CONSTANTS ARE" TO RE-MARK.
057600     PERFORM  PRINT-DETAIL.
057700     MOVE "SHOWN" TO RE-MARK.
057800     PERFORM  PRINT-DETAIL.
057900     MOVE     "FIGURATIVE CONSTANTS" TO FEATURE.
058000 FIG-TEST-1.
058100     MOVE     ZERO TO  COMPUTED-18V0.
058200     MOVE "ZERO      " TO CORRECT-A.
058300     PERFORM INSPT.
058400     GO TO    FIG-WRITE-1.
058500 FIG-DELETE-1.
058600     PERFORM  DE-LETE.
058700 FIG-WRITE-1.
058800     MOVE "FIG-TEST-1" TO PAR-NAME.
058900     PERFORM  PRINT-DETAIL.
059000 FIG-TEST-2.
059100     MOVE   "IV-11 4.2.2.2.3" TO ANSI-REFERENCE.
059200     MOVE     SPACE TO COMPUTED-A.
059300     MOVE "SPACE     " TO CORRECT-A.
059400     PERFORM INSPT.
059500     GO TO    FIG-WRITE-2.
059600 FIG-DELETE-2.
059700     PERFORM  DE-LETE.
059800 FIG-WRITE-2.
059900     MOVE "FIG-TEST-2" TO PAR-NAME.
060000     PERFORM  PRINT-DETAIL.
060100 FIG-TEST-3.
060200     MOVE   "IV-11 4.2.2.2.3" TO ANSI-REFERENCE.
060300     MOVE     QUOTE TO COMPUTED-A.
060400     MOVE "QUOTE     " TO CORRECT-A.
060500     PERFORM INSPT.
060600     GO TO    FIG-WRITE-3.
060700 FIG-DELETE-3.
060800     PERFORM  DE-LETE.
060900 FIG-WRITE-3.
061000     MOVE "FIG-TEST-3" TO PAR-NAME.
061100     PERFORM  PRINT-DETAIL.
061200 FIG-TEST-4.
061300     MOVE   "IV-11 4.2.2.2.3" TO ANSI-REFERENCE.
061400     MOVE     HIGH-VALUE TO COMPUTED-A.
061500     MOVE "HIGH-VALUE" TO CORRECT-A.
061600     PERFORM INSPT.
061700     GO TO    FIG-WRITE-4.
061800 FIG-DELETE-4.
061900     PERFORM  DE-LETE.
062000 FIG-WRITE-4.
062100     MOVE "FIG-TEST-4" TO PAR-NAME.
062200     PERFORM  PRINT-DETAIL.
062300 FIG-TEST-5.
062400     MOVE   "IV-11 4.2.2.2.3" TO ANSI-REFERENCE.
062500     MOVE     LOW-VALUE TO COMPUTED-A.
062600     MOVE "LOW-VALUE " TO CORRECT-A.
062700     PERFORM INSPT.
062800     GO TO    FIG-WRITE-5.
062900 FIG-DELETE-5.
063000     PERFORM  DE-LETE.
063100 FIG-WRITE-5.
063200     MOVE "FIG-TEST-5" TO PAR-NAME.
063300     PERFORM  PRINT-DETAIL.
063400 CONTIN-INIT-A.
063500     MOVE     "CONTINUE A.N. LITRLS" TO FEATURE.
063600     MOVE   "IV-44 7.2.2" TO ANSI-REFERENCE.
063700     MOVE                                                  "ABCDEF
063800-    "GHIJ" TO DATA-A.
063900 CONTIN-TEST-1.
064000     IF       DATA-A EQUAL TO "ABCDEFGHIJ"
064100              PERFORM PASS
064200              GO TO CONTIN-WRITE-1.
064300     GO TO    CONTIN-FAIL-1.
064400 CONTIN-DELETE-1.
064500     PERFORM  DE-LETE.
064600     GO TO    CONTIN-WRITE-1.
064700 CONTIN-FAIL-1.
064800     MOVE     DATA-A TO COMPUTED-A.
064900     MOVE "ABCDEFGHIJ" TO CORRECT-A.
065000     PERFORM  FAIL.
065100 CONTIN-WRITE-1.
065200     MOVE "CONTIN-TEST-1" TO PAR-NAME.
065300     PERFORM  PRINT-DETAIL.
065400 CONTIN-TEST-2.
065500     IF       DATA-Q EQUAL TO                   "QUOTE IN COL. 72"
065600     PERFORM PASS
065700              GO TO CONTIN-WRITE-2.
065800     PERFORM FAIL.
065900     MOVE     DATA-Q TO COMPUTED-A.
066000     MOVE     "QUOTE IN COL. 72" TO CORRECT-A.
066100     GO       TO CONTIN-WRITE-2.
066200 CONTIN-DELETE-2.
066300     PERFORM  DE-LETE.
066400 CONTIN-WRITE-2.
066500     MOVE     "CONTIN-TEST-2" TO PAR-NAME.
066600     PERFORM  PRINT-DETAIL.
066700 CONTIN-TEST-3.
066800     MOVE   "IV-44 7.2.2" TO ANSI-REFERENCE.
066900     IF       DATA-R EQUAL TO                  "LITERAL ENDS AT 72
067000-    ""
067100     PERFORM PASS
067200              GO TO CONTIN-WRITE-3.
067300     PERFORM FAIL.
067400     MOVE     DATA-R TO COMPUTED-A.
067500     MOVE     "LITERAL ENDS AT 72" TO CORRECT-A.
067600     GO       TO CONTIN-WRITE-3.
067700 CONTIN-DELETE-3.
067800     PERFORM  DE-LETE.
067900 CONTIN-WRITE-3.
068000     MOVE     "CONTIN-TEST-3" TO PAR-NAME.
068100     PERFORM  PRINT-DETAIL.
068200 CONTIN-TEST-4.
068300     MOVE   "IV-44 7.2.2" TO ANSI-REFERENCE.
068400     IF       DATA-W EQUAL TO DATA-S
068500              PERFORM PASS GO TO CONTIN-WRITE-4.
068600     PERFORM  FAIL.
068700     MOVE     DATA-S TO COMPUTED-A.
068800     MOVE     DATA-W TO CORRECT-A.
068900     GO       TO CONTIN-WRITE-4.
069000 CONTIN-DELETE-4.
069100     PERFORM  DE-LETE.
069200 CONTIN-WRITE-4.
069300     MOVE     "CONTIN-TEST-4" TO PAR-NAME
069400     PERFORM  PRINT-DETAIL.
069500 CONTIN-TEST-5.
069600     MOVE   "IV-44 7.2.2" TO ANSI-REFERENCE.
069700     IF       DATA-W EQUAL TO DATA-T
069800              PERFORM PASS GO TO CONTIN-WRITE-5.
069900     PERFORM  FAIL.
070000     MOVE     DATA-T TO COMPUTED-A.
070100     MOVE     DATA-W TO CORRECT-A.
070200     GO       TO CONTIN-WRITE-5.
070300 CONTIN-DELETE-5.
070400     PERFORM  DE-LETE.
070500 CONTIN-WRITE-5.
070600     MOVE     "CONTIN-TEST-5" TO PAR-NAME
070700     PERFORM  PRINT-DETAIL.
070800 CONTIN-TEST-6.
070900     MOVE   "IV-44 7.2.2" TO ANSI-REFERENCE.
071000     IF       DATA-W EQUAL TO DATA-U
071100              PERFORM PASS GO TO CONTIN-WRITE-6.
071200     PERFORM  FAIL.
071300     MOVE     DATA-U TO COMPUTED-A.
071400     MOVE     DATA-W TO CORRECT-A.
071500     GO       TO CONTIN-WRITE-6.
071600 CONTIN-DELETE-6.
071700     PERFORM  DE-LETE.
071800 CONTIN-WRITE-6.
071900     MOVE     "CONTIN-TEST-6" TO PAR-NAME
072000     PERFORM  PRINT-DETAIL.
072100 CONTIN-TEST-7.
072200     MOVE   "IV-44 7.2.2" TO ANSI-REFERENCE.
072300     MOVE     DATA-S TO DATA-V.
072400     IF       DATA-W EQUAL TO DATA-V
072500              PERFORM PASS GO TO CONTIN-WRITE-7.
072600     PERFORM  FAIL.
072700     MOVE     DATA-V TO COMPUTED-A.
072800     MOVE     DATA-W TO CORRECT-A.
072900     GO       TO CONTIN-WRITE-7.
073000 CONTIN-DELETE-7.
073100     PERFORM  DE-LETE.
073200 CONTIN-WRITE-7.
073300     MOVE     "CONTIN-TEST-7" TO PAR-NAME
073400     PERFORM  PRINT-DETAIL.
073500 CONTIN-TEST-8.
073600     MOVE   "IV-44 7.2.2" TO ANSI-REFERENCE.
073700     IF       DATA-S EQUAL TO                "OFFSET CONTINUATION
073800-                                                               ""
073900              PERFORM PASS GO TO CONTIN-WRITE-8.
074000     PERFORM  FAIL.
074100     MOVE                                    "OFFSET CONTINUATION
074200-                                                               ""
074300              TO COMPUTED-A.
074400     MOVE     DATA-S TO CORRECT-A.
074500     GO       TO CONTIN-WRITE-8.
074600 CONTIN-DELETE-8.
074700     PERFORM  DE-LETE.
074800 CONTIN-WRITE-8.
074900     MOVE     "CONTIN-TEST-8" TO PAR-NAME
075000     PERFORM  PRINT-DETAIL.
075100 CONTIN-TEST-9.
075200     MOVE   "IV-10 4.2.2.2.1.2 (2) AND IV-9 4.2.2.2.1"
075300          TO ANSI-REFERENCE.
075400     IF WRK-XN-160-1 EQUAL TO
075500     """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
075600-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
075700-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
075800-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
075900-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
076000-    """""""""""""""""""""" PERFORM PASS
076100     ELSE PERFORM FAIL.
076200     GO TO CONTIN-WRITE-9.
076300 CONTIN-DELETE-9.
076400     PERFORM DE-LETE.
076500 CONTIN-WRITE-9.
076600     MOVE "CONTIN-TEST-9" TO PAR-NAME.
076700     MOVE "160 PAIRS OF QUOTES" TO FEATURE.
076800     PERFORM PRINT-DETAIL.
076900 SEP-INIT-A.
077000     MOVE   "IV-4 4.2.1" TO ANSI-REFERENCE.
077100     MOVE     "SEPARATORS (SPACES)" TO FEATURE.
077200 SEP-TEST-1.
077300                                                     PERFORM PASS.
077400                                                                GO
077500                                                                TO
077600                                                      SEP-WRITE-1.
077700 SEP-TEST-1-1.
077800                                                     PERFORM FAIL.
077900                                                GO TO SEP-WRITE-1.
078000*                                                             NOTE
078100*                                                       SEP-TEST-1
078200*                                            ENTIRE PARAGRAPH IS "
078300*                                    RIGHT-JUSTIFIED, TO MARGIN R.
078400 SEP-DELETE-1.
078500     PERFORM  DE-LETE.
078600 SEP-WRITE-1.
078700     MOVE     "SEP-TEST-1" TO PAR-NAME.
078800     PERFORM  PRINT-DETAIL.
078900 SEP-TEST-2 SECTION.
079000 SEP-TEST-2-PARA.
079100     MOVE   "IV-4 4.2.1" TO ANSI-REFERENCE.
079200 S2. PERFORM PASS. IF P-OR-F EQUAL TO "PASS " GO TO
079300     SEP-WRITE-2. PERFORM FAIL. GO TO SEP-WRITE-2.
079400 SEP-DELETE-2.
079500     PERFORM  DE-LETE.
079600 SEP-WRITE-2.
079700     MOVE     "SEP-TEST-2" TO PAR-NAME.
079800     PERFORM  PRINT-DETAIL.
079900 SEP-TEST-3.
080000     MOVE   "IV-4 4.2.1" TO ANSI-REFERENCE.
080100     IF       SEP-03 EQUAL TO "SEPARATOR"
080200              PERFORM PASS
080300              GO TO SEP-WRITE-3.
080400     PERFORM  FAIL.
080500     MOVE     SEP-03 TO COMPUTED-A.
080600     MOVE     "SEPARATOR" TO CORRECT-A.
080700     GO       TO SEP-WRITE-3.
080800 SEP-DELETE-3.
080900     PERFORM  DE-LETE.
081000 SEP-WRITE-3.
081100     MOVE     "SEP-TEST-3" TO PAR-NAME.
081200     PERFORM  PRINT-DETAIL.
081300 SEP-TEST-4.
081400     MOVE   "IV-4 4.2.1" TO ANSI-REFERENCE.
081500     PERFORM  FAIL.
081600
081700
081800
081900
082000
082100
082200
082300
082400
082500
082600
082700
082800
082900
083000
083100
083200
083300
083400
083500
083600
083700
083800
083900
084000
084100
084200
084300
084400
084500
084600
084700
084800
084900
085000
085100
085200
085300
085400
085500
085600
085700
085800
085900
086000
086100
086200
086300
086400
086500
086600
086700
086800
086900
087000
087100
087200
087300
087400
087500
087600
087700
087800
087900
088000
088100
088200
088300
088400
088500
088600
088700
088800
088900
089000
089100
089200
089300
089400
089500
089600
089700
089800
089900
090000
090100
090200
090300
090400
090500
090600
090700
090800
090900
091000
091100
091200
091300
091400
091500
091600
091700     SUBTRACT
091800              1 FROM ERROR-COUNTER.
091900     PERFORM  PASS.
092000     GO       TO SEP-WRITE-4.
092100 SEP-DELETE-4.
092200     PERFORM  DE-LETE.
092300 SEP-WRITE-4.
092400     MOVE     "SEP-TEST-4" TO PAR-NAME.
092500     PERFORM  PRINT-DETAIL.
092600 SEP-TEST-5 SECTION.
092700 SEP-TEST-5-PARA.
092800*    ==-->  SEMICOLON AS SEPARATOR  <--==
092900     MOVE   "IV-4 4.2.1(2)" TO ANSI-REFERENCE.
093000 S5. PERFORM PASS, IF P-OR-F EQUAL TO "PASS " GO TO
093100     SEP-WRITE-5; ELSE PERFORM FAIL, GO TO SEP-WRITE-5.
093200 SEP-DELETE-5.
093300     PERFORM  DE-LETE.
093400 SEP-WRITE-5.
093500     MOVE     "SEP-TEST-5" TO PAR-NAME.
093600     PERFORM  PRINT-DETAIL.
093700 JUST-INIT-01.
093800     MOVE   "IV-24 5.6.4" TO ANSI-REFERENCE.
093900*
094000*    INITIALIZATION TAKES PLACE INDEPENDENT OF ANY JUSTIFIED
094100*    CLAUSE.
094200*    REFERENCE - X3.23-1985, PAGE VI-49, 5.15.4(1)C.
094300*
094400     MOVE "JUST WITH VALUE" TO FEATURE.
094500     MOVE "JUST-TEST-01" TO PAR-NAME.
094600 JUST-TEST-01-1.
094700     IF XJ-00002 EQUAL TO "AB"
094800             PERFORM PASS
094900             GO TO JUST-WRITE-01-1
095000         ELSE GO TO JUST-FAIL-01-1.
095100 JUST-DELETE-01-1.
095200     PERFORM DE-LETE.
095300     GO TO JUST-WRITE-01-1.
095400 JUST-FAIL-01-1.
095500     PERFORM FAIL.
095600     MOVE XJ-00002 TO COMPUTED-A.
095700     MOVE "AB" TO CORRECT-A.
095800 JUST-WRITE-01-1.
095900     MOVE 1 TO REC-CT.
096000     PERFORM PRINT-DETAIL.
096100 JUST-TEST-01-2.
096200     IF XJ-00003 EQUAL TO "XY "
096300             PERFORM PASS
096400             GO TO JUST-WRITE-01-2
096500         ELSE GO TO JUST-FAIL-01-2.
096600 JUST-DELETE-01-2.
096700     PERFORM DE-LETE.
096800     GO TO JUST-WRITE-01-2.
096900 JUST-FAIL-01-2.
097000     PERFORM FAIL.
097100     MOVE XJ-00003 TO COMPUTED-A.
097200     MOVE "XY " TO CORRECT-A.
097300 JUST-WRITE-01-2.
097400     MOVE 2 TO REC-CT.
097500     PERFORM PRINT-DETAIL.
097600 JUST-INIT-02.
097700     MOVE   "IV-24 5.6.4" TO ANSI-REFERENCE.
097800*
097900*    JUSTIFIED RECEIVING ITEM TESTS
098000*        IF THE SENDING ITEM IS LARGER THAN THE RECEIVING ITEM,
098100*    THEN THE LEFTMOST CHARACTERS ARE TRUNCATED.  IF THE SENDING
098200*    ITEM IS SMALLER THAN THE RECEIVING ITEM, THEN THE DATA IS
098300*    ALIGNED TO THE RIGHT WITH SPACES IN THE LEFTMOST CHARACTER
098400*    POSITIONS.
098500*    REFERENCE - X3.23-1985, PAGE VI-24, 6.5.4.(1)
098600*
098700*    JUST-TEST-02 CONTAINS STATEMENTS OF THE FORM
098800*        MOVE ALPHANUMERIC LITERAL TO ALPHANUMERIC JUSTIFIED ITEM.
098900*
099000     MOVE "MOVE - JUST REC ITEM" TO FEATURE.
099100     MOVE "JUST-TEST-02" TO PAR-NAME.
099200 JUST-TEST-02-1-0.
099300     MOVE "ABC" TO XJ-00005.
099400 JUST-TEST-02-1-1.
099500     IF XJ-00005 EQUAL TO "  ABC"
099600             PERFORM PASS
099700             GO TO JUST-WRITE-02-1
099800         ELSE GO TO JUST-FAIL-02-1.
099900 JUST-DELETE-02-1.
100000     PERFORM DE-LETE.
100100     GO TO JUST-WRITE-02-1.
100200 JUST-FAIL-02-1.
100300     PERFORM FAIL.
100400     MOVE "  ABC" TO CORRECT-A.
100500     MOVE XJ-00005 TO COMPUTED-A.
100600 JUST-WRITE-02-1.
100700     MOVE 1 TO REC-CT.
100800     PERFORM PRINT-DETAIL.
100900 JUST-TEST-02-2-0.
101000     MOVE "ABCDEFGHI" TO XJ-00005.
101100 JUST-TEST-02-2-1.
101200     IF XJ-00005 EQUAL TO "EFGHI"
101300             PERFORM PASS
101400             GO TO JUST-WRITE-02-2
101500         ELSE GO TO JUST-FAIL-02-2.
101600 JUST-DELETE-02-2.
101700     PERFORM DE-LETE.
101800     GO TO JUST-WRITE-02-2.
101900 JUST-FAIL-02-2.
102000     PERFORM FAIL.
102100     MOVE "EFGHI" TO CORRECT-A.
102200     MOVE XJ-00005 TO COMPUTED-A.
102300 JUST-WRITE-02-2.
102400     MOVE 2 TO REC-CT.
102500     PERFORM PRINT-DETAIL.
102600 JUST-TEST-02-3-0.
102700     MOVE "CDEFG" TO XJ-00005.
102800 JUST-TEST-02-3-1.
102900     IF XJ-00005 EQUAL TO "CDEFG"
103000             PERFORM PASS
103100             GO TO JUST-WRITE-02-3
103200         ELSE GO TO JUST-FAIL-02-3.
103300 JUST-DELETE-02-3.
103400     PERFORM DE-LETE.
103500     GO TO JUST-WRITE-02-3.
103600 JUST-FAIL-02-3.
103700     PERFORM FAIL.
103800     MOVE "CDEFG" TO CORRECT-A.
103900     MOVE XJ-00005 TO COMPUTED-A.
104000 JUST-WRITE-02-3.
104100     MOVE 3 TO REC-CT.
104200     PERFORM PRINT-DETAIL.
104300 JUST-INIT-03.
104400     MOVE   "IV-24 5.6.4" TO ANSI-REFERENCE.
104500*
104600*    JUST-TEST-03 CONTAINS STATEMENTS OF THE FORM
104700*        MOVE ALPHANUMERIC ITEM TO ALPHABETIC JUSTIFIED ITEM.
104800*
104900     MOVE "MOVE - JUST REC ITEM" TO FEATURE.
105000     MOVE "JUST-TEST-03" TO PAR-NAME.
105100 JUST-TEST-03-1-0.
105200     MOVE NJUST-XN-3 TO AJ-00005.
105300 JUST-TEST-03-1-1.
105400     IF AJ-00005 EQUAL TO "  ABC"
105500             PERFORM PASS
105600             GO TO JUST-WRITE-03-1
105700         ELSE GO TO JUST-FAIL-03-1.
105800 JUST-DELETE-03-1.
105900     PERFORM DE-LETE.
106000     GO TO JUST-WRITE-03-1.
106100 JUST-FAIL-03-1.
106200     PERFORM FAIL.
106300     MOVE "  ABC" TO CORRECT-A.
106400     MOVE AJ-00005 TO COMPUTED-A.
106500 JUST-WRITE-03-1.
106600     MOVE 1 TO REC-CT.
106700     PERFORM PRINT-DETAIL.
106800 JUST-TEST-03-2-0.
106900     MOVE NJUST-XN-5 TO AJ-00005.
107000 JUST-TEST-03-2-1.
107100     IF AJ-00005 EQUAL TO "CDEFG"
107200             PERFORM PASS
107300             GO TO JUST-WRITE-03-2
107400         ELSE GO TO JUST-FAIL-03-2.
107500 JUST-DELETE-03-2.
107600     PERFORM DE-LETE.
107700     GO TO JUST-WRITE-03-2.
107800 JUST-FAIL-03-2.
107900     PERFORM FAIL.
108000     MOVE "CDEFG" TO CORRECT-A.
108100     MOVE AJ-00005 TO COMPUTED-A.
108200 JUST-WRITE-03-2.
108300     MOVE 2 TO REC-CT.
108400     PERFORM PRINT-DETAIL.
108500 JUST-TEST-03-3-0.
108600     MOVE NJUST-XN-15 TO AJ-00005.
108700 JUST-TEST-03-3-1.
108800     IF AJ-00005 EQUAL TO "KLMNO"
108900             PERFORM PASS
109000             GO TO JUST-WRITE-03-3
109100         ELSE GO TO JUST-FAIL-03-3.
109200 JUST-DELETE-03-3.
109300     PERFORM DE-LETE.
109400     GO TO JUST-WRITE-03-3.
109500 JUST-FAIL-03-3.
109600     PERFORM FAIL.
109700     MOVE "KLMNO" TO CORRECT-A.
109800     MOVE AJ-00005 TO COMPUTED-A.
109900 JUST-WRITE-03-3.
110000     MOVE 3 TO REC-CT.
110100     PERFORM PRINT-DETAIL.
110200 JUST-INIT-04.
110300     MOVE   "IV-24 5.6.4" TO ANSI-REFERENCE.
110400*
110500*    JUST-TEST-04 CONTAINS STATEMENTS OF THE FORM
110600*        MOVE GROUP ITEM TO ALPHABETIC JUSTIFIED ITEM.
110700*
110800     MOVE "MOVE - JUST REC ITEM" TO FEATURE.
110900     MOVE "JUST-TEST-04" TO PAR-NAME.
111000 JUST-TEST-04-1-0.
111100     MOVE GROUP-TO-JUST-1 TO AJ-00007.
111200 JUST-TEST-04-1-1.
111300     IF AJ-00007 EQUAL TO "    ABC"
111400             PERFORM PASS
111500             GO TO JUST-WRITE-04-1
111600         ELSE GO TO JUST-FAIL-04-1.
111700 JUST-DELETE-04-1.
111800     PERFORM DE-LETE.
111900     GO TO JUST-WRITE-04-1.
112000 JUST-FAIL-04-1.
112100     PERFORM FAIL.
112200     MOVE "    ABC" TO CORRECT-A.
112300     MOVE AJ-00007 TO COMPUTED-A.
112400 JUST-WRITE-04-1.
112500     MOVE 1 TO REC-CT.
112600     PERFORM PRINT-DETAIL.
112700 JUST-TEST-04-2-0.
112800     MOVE GROUP-TO-JUST-21 TO AJ-00007.
112900 JUST-TEST-04-2-1.
113000     IF AJ-00007 EQUAL TO "ABCDEFG"
113100             PERFORM PASS
113200             GO TO JUST-WRITE-04-2
113300         ELSE GO TO JUST-FAIL-04-2.
113400 JUST-DELETE-04-2.
113500     PERFORM DE-LETE.
113600     GO TO JUST-WRITE-04-2.
113700 JUST-FAIL-04-2.
113800     PERFORM FAIL.
113900     MOVE "ABCDEFG" TO CORRECT-A.
114000     MOVE AJ-00007 TO COMPUTED-A.
114100 JUST-WRITE-04-2.
114200     MOVE 2 TO REC-CT.
114300     PERFORM PRINT-DETAIL.
114400 JUST-TEST-04-3-0.
114500     MOVE GROUP-TO-JUST-2 TO AJ-00007.
114600 JUST-TEST-04-3-1.
114700     IF AJ-00007 EQUAL TO "IJKLMNO"
114800             PERFORM PASS
114900             GO TO JUST-WRITE-04-3
115000         ELSE GO TO JUST-FAIL-04-3.
115100 JUST-DELETE-04-3.
115200     PERFORM DE-LETE.
115300     GO TO JUST-WRITE-04-3.
115400 JUST-FAIL-04-3.
115500     PERFORM FAIL.
115600     MOVE "IJKLMNO" TO CORRECT-A.
115700     MOVE AJ-00007 TO COMPUTED-A.
115800 JUST-WRITE-04-3.
115900     MOVE 3 TO REC-CT.
116000     PERFORM PRINT-DETAIL.
116100 JUST-INIT-05.
116200     MOVE   "IV-24 5.6.4" TO ANSI-REFERENCE.
116300*
116400*    JUST-TEST-05 CONTAINS MOVE STATEMENTS WITH A JUSTIFIED
116500*    SENDING ITEM.
116600*
116700     MOVE "MOVE-JUST SEND ITEM" TO FEATURE.
116800     MOVE "JUST-TEST-05" TO PAR-NAME.
116900     MOVE "12345ABCDEFGHUXYZ   PQR" TO GROUP-WITH-JUST-ITEMS.
117000     MOVE SPACE TO GROUP-FOR-JUST-TESTS.
117100 JUST-TEST-05-1-0.
117200     MOVE AJ-00009 TO NJUST-XN-15.
117300 JUST-TEST-05-1-1.
117400     IF NJUST-XN-15 EQUAL TO "XYZ   PQR      "
117500             PERFORM PASS
117600             GO TO JUST-WRITE-05-1
117700         ELSE GO TO JUST-FAIL-05-1.
117800 JUST-DELETE-05-1.
117900     PERFORM DE-LETE.
118000     GO TO JUST-WRITE-05-1.
118100 JUST-FAIL-05-1.
118200     PERFORM FAIL.
118300     MOVE "XYZ   PQR      " TO CORRECT-A.
118400     MOVE NJUST-XN-15 TO COMPUTED-A.
118500 JUST-WRITE-05-1.
118600     MOVE 1 TO REC-CT.
118700     PERFORM PRINT-DETAIL.
118800 JUST-TEST-05-2-0.
118900     MOVE XJ-00009 TO NJUST-XN-3.
119000 JUST-TEST-05-2-1.
119100     IF NJUST-XN-3 EQUAL TO "ABC"
119200             PERFORM PASS
119300             GO TO JUST-WRITE-05-2
119400         ELSE GO TO JUST-FAIL-05-2.
119500 JUST-DELETE-05-2.
119600     PERFORM DE-LETE.
119700     GO TO JUST-WRITE-05-2.
119800 JUST-FAIL-05-2.
119900     PERFORM FAIL.
120000     MOVE NJUST-XN-3 TO COMPUTED-A.
120100     MOVE "ABC" TO CORRECT-A.
120200 JUST-WRITE-05-2.
120300     MOVE 2 TO REC-CT.
120400     PERFORM PRINT-DETAIL.
120500 JUST-INIT-06.
120600     MOVE   "IV-24 5.6.4" TO ANSI-REFERENCE.
120700*
120800*    JUST-TEST-06 CONTAINS MOVE STATEMENTS WITH A JUSTIFIED
120900*    SENDING ITEM AND A JUSTIFIED RECEIVING ITEM.
121000*
121100     MOVE "MOVE - JUST TO JUST" TO FEATURE.
121200     MOVE "JUST-TEST-06" TO PAR-NAME.
121300     MOVE "12345ABCDEFGHIXYZ   PQR" TO GROUP-WITH-JUST-ITEMS.
121400 JUST-TEST-06-0.
121500     MOVE SPACE TO XJ-00005.
121600 JUST-TEST-06-1.
121700     MOVE XJ-00009 TO XJ-00005.
121800     IF XJ-00005 EQUAL TO "EFGHI"
121900             PERFORM PASS
122000             GO TO JUST-WRITE-06-1
122100         ELSE GO TO JUST-FAIL-06-1.
122200 JUST-DELETE-06-1.
122300     PERFORM DE-LETE.
122400     GO TO JUST-WRITE-06-1.
122500 JUST-FAIL-06-1.
122600     PERFORM FAIL.
122700     MOVE "EFGHI" TO CORRECT-A.
122800     MOVE XJ-00005 TO COMPUTED-A.
122900 JUST-WRITE-06-1.
123000     MOVE 1 TO REC-CT.
123100     PERFORM PRINT-DETAIL.
123200 JUST-INIT-06-2.
123300     MOVE SPACE TO AJ-00005.
123400 JUST-TEST-06-2.
123500     MOVE AJ-00009 TO AJ-00005.
123600     IF AJ-00005 EQUAL TO "  PQR"
123700             PERFORM PASS
123800             GO TO JUST-WRITE-06-2
123900         ELSE GO TO JUST-FAIL-06-2.
124000 JUST-DELETE-06-2.
124100     PERFORM DE-LETE.
124200     GO TO JUST-WRITE-06-2.
124300 JUST-FAIL-06-2.
124400     PERFORM FAIL.
124500     MOVE "  PQR" TO CORRECT-A.
124600     MOVE AJ-00005 TO COMPUTED-A.
124700 JUST-WRITE-06-2.
124800     MOVE 2 TO REC-CT.
124900     PERFORM PRINT-DETAIL.
125000 JUST-INIT-06-3.
125100     MOVE "ABCDEFG" TO XJ-00007.
125200     MOVE SPACE TO AJ-00007.
125300 JUST-TEST-06-3.
125400     MOVE XJ-00007 TO AJ-00007.
125500     IF AJ-00007 EQUAL TO "ABCDEFG"
125600             PERFORM PASS
125700             GO TO JUST-WRITE-06-3
125800         ELSE GO TO JUST-FAIL-06-3.
125900 JUST-DELETE-06-3.
126000     PERFORM DE-LETE.
126100     GO TO JUST-WRITE-06-3.
126200 JUST-FAIL-06-3.
126300     PERFORM FAIL.
126400     MOVE "ABCDEFG" TO CORRECT-A.
126500     MOVE AJ-00007 TO COMPUTED-A.
126600 JUST-WRITE-06-3.
126700     MOVE 3 TO REC-CT.
126800     PERFORM PRINT-DETAIL.
126900 JUST-INIT-06-4.
127000     MOVE SPACE TO XJ-00005.
127100 JUST-TEST-06-4.
127200     MOVE XJ-00007 TO XJ-00005.
127300     IF XJ-00005 EQUAL TO "CDEFG"
127400             PERFORM PASS
127500             GO TO JUST-WRITE-06-4
127600         ELSE GO TO JUST-FAIL-06-4.
127700 JUST-DELETE-06-4.
127800     PERFORM DE-LETE.
127900     GO TO JUST-WRITE-06-4.
128000 JUST-FAIL-06-4.
128100     PERFORM FAIL.
128200     MOVE "CDEFG" TO CORRECT-A.
128300     MOVE XJ-00005 TO COMPUTED-A.
128400 JUST-WRITE-06-4.
128500     MOVE 4 TO REC-CT.
128600     PERFORM PRINT-DETAIL.
128700 JUST-INIT-06-5.
128800     MOVE SPACE TO XJ-00009.
128900 JUST-TEST-06-5.
129000     MOVE XJ-00007 TO XJ-00009.
129100     IF XJ-00009 EQUAL TO "  ABCDEFG"
129200             PERFORM PASS
129300             GO TO JUST-WRITE-06-5
129400         ELSE GO TO JUST-FAIL-06-5.
129500 JUST-DELETE-06-5.
129600     PERFORM DE-LETE.
129700     GO TO JUST-WRITE-06-5.
129800 JUST-FAIL-06-5.
129900     PERFORM FAIL.
130000     MOVE "  ABCDEFG" TO CORRECT-A.
130100     MOVE XJ-00009 TO COMPUTED-A.
130200 JUST-WRITE-06-5.
130300     MOVE 5 TO REC-CT.
130400     PERFORM PRINT-DETAIL.
130500     MOVE 0 TO REC-CT.
130600 SYNC-TEST-1.
130700     MOVE   "VI-44 5.13.4" TO ANSI-REFERENCE.
130800     IF       DATA-G EQUAL TO DATA-H
130900              PERFORM PASS
131000              ELSE
131100              PERFORM FAIL.
131200     GO TO    SYNC-WRITE-1.
131300 SYNC-DELETE-1.
131400     PERFORM  DE-LETE.
131500 SYNC-WRITE-1.
131600     MOVE "SYNCHRONIZED" TO FEATURE.
131700     MOVE "SYNC-TEST-1" TO PAR-NAME.
131800     PERFORM  PRINT-DETAIL.
131900 BZERO-INIT.
132000     MOVE   "VI-22 5.4" TO ANSI-REFERENCE.
132100     MOVE "BLANK WHEN ZERO" TO FEATURE.
132200 BZERO-TEST-1-0.
132300     MOVE     0000000000 TO DATA-F.
132400 BZERO-TEST-1-1.
132500     IF       DATA-F EQUAL TO "          "
132600              PERFORM PASS
132700              ELSE
132800              GO TO BZERO-FAIL-1.
132900     GO TO    BZERO-WRITE-1.
133000 BZERO-DELETE-1.
133100     PERFORM  DE-LETE.
133200     GO TO    BZERO-WRITE-1.
133300 BZERO-FAIL-1.
133400     MOVE     DATA-F TO COMPUTED-A.
133500     MOVE "SHOULD BE BLANK" TO CORRECT-A.
133600     PERFORM  FAIL.
133700 BZERO-WRITE-1.
133800     MOVE "BZERO-TEST-1" TO PAR-NAME.
133900     PERFORM  PRINT-DETAIL.
134000 BZERO-INIT-2.
134100     MOVE   "VI-22 5.4" TO ANSI-REFERENCE.
134200     MOVE     0000 TO DATA-M.
134300 BZERO-TEST-2.
134400     IF       DATA-M EQUAL TO SPACE
134500              PERFORM PASS
134600              GO TO BZERO-WRITE-2.
134700     GO TO    BZERO-FAIL-2.
134800 BZERO-DELETE-2.
134900     PERFORM  DE-LETE.
135000     GO TO    BZERO-WRITE-2.
135100 BZERO-FAIL-2.
135200     MOVE     DATA-M TO COMPUTED-A.
135300     MOVE "SHOULD BE BLANK" TO CORRECT-A.
135400     PERFORM  FAIL.
135500 BZERO-WRITE-2.
135600     MOVE "BZERO-TEST-2" TO PAR-NAME.
135700     PERFORM  PRINT-DETAIL.
135800 BZERO-INIT-3.
135900     MOVE   "VI-22 5.4" TO ANSI-REFERENCE.
136000 BZERO-TEST-3.
136100     IF       DATA-P1 EQUAL TO "000"
136200              PERFORM PASS GO TO BZERO-WRITE-3.
136300     GO       TO BZERO-FAIL-3.
136400 BZERO-DELETE-3.
136500     PERFORM  DE-LETE.
136600     GO       TO BZERO-WRITE-3.
136700 BZERO-FAIL-3.
136800     PERFORM FAIL.
136900     MOVE     DATA-P1 TO COMPUTED-A.
137000     MOVE     "000" TO CORRECT-A.
137100 BZERO-WRITE-3.
137200     MOVE     "BZERO-TEST-3" TO PAR-NAME.
137300     PERFORM  PRINT-DETAIL.
137400 LONG-PARAGRAPH-NAME-----INIT-1.
137500     MOVE   "IV-9 4.2.2.2.1" TO ANSI-REFERENCE.
137600 LONG-PARAGRAPH-NAME-----TEST-1.
137700     PERFORM  PASS.
137800     GO TO    LONG-WRITE-1.
137900 LONG-DELETE-1.
138000     PERFORM  DE-LETE.
138100 LONG-WRITE-1.
138200     MOVE "LONG PARAGRAPH-NAME" TO FEATURE.
138300     MOVE "LONG-PARAGRAPH---ETC" TO PAR-NAME.
138400     PERFORM  PRINT-DETAIL.
138500 LONG-INIT-2.
138600     MOVE   "IV-9 4.2.2.2.1" TO ANSI-REFERENCE.
138700 LONG-TEST-2.
138800     MOVE     SPACE TO A-DATA-NAME-30-CHARACTERS-LONG.
138900     PERFORM  PASS.
139000     GO TO    LONG-WRITE-2.
139100 LONG-DELETE-2.
139200     PERFORM  DE-LETE.
139300 LONG-WRITE-2.
139400     MOVE "LONG DATA-NAME" TO FEATURE.
139500     MOVE "LONG-TEST-2" TO PAR-NAME.
139600     PERFORM  PRINT-DETAIL.
139700 LONG-INIT-3.
139800     MOVE   "IV-9 4.2.2.2.1" TO ANSI-REFERENCE.
139900 LONG-TEST-3.
140000     MOVE     SPACE TO LONG-PICTURE.
140100     PERFORM  PASS.
140200     GO TO    LONG-WRITE-3.
140300 LONG-DELETE-3.
140400     PERFORM  DE-LETE.
140500 LONG-WRITE-3.
140600     MOVE "LONG PICTURE" TO FEATURE.
140700     MOVE "LONG-TEST-3" TO PAR-NAME.
140800     PERFORM  PRINT-DETAIL.
140900 LONG-INIT-4.
141000     MOVE   "IV-9 4.2.2.2.1" TO ANSI-REFERENCE.
141100 LONG-TEST-4.
141200     MOVE     "LONG-TEST-4" TO PAR-NAME.
141300     IF       LONG-LITERAL EQUAL TO "STANDARD COMPILERS MUST ALLOW
141400-    " NON-NUMERIC LITERALS OF AT LEAST 120 CHARACTERS AND NUMERIC
141500-    " LITERALS OF AT LEAST 18 DIGITS BUT NOW EXTENDED UPTO 160 DI
141600-    "GITS FOR 8X"
141700              PERFORM PASS
141800     ELSE
141900              GO TO LONG-FAIL-4.
142000     GO TO    LONG-WRITE-4.
142100 LONG-DELETE-4.
142200     MOVE     "LONG-TEST-4" TO PAR-NAME.
142300     PERFORM  DE-LETE.
142400     GO TO    LONG-WRITE-4.
142500 LONG-FAIL-4.
142600     PERFORM  FAIL.
142700     MOVE    SPACE TO TEST-RESULTS.
142800     MOVE    LONG20 TO COMPUTED-A.
142900     PERFORM PRINT-DETAIL.
143000     MOVE    LONG40 TO COMPUTED-A.
143100     PERFORM PRINT-DETAIL.
143200     MOVE    LONG60 TO COMPUTED-A.
143300     PERFORM PRINT-DETAIL.
143400     MOVE    LONG80 TO COMPUTED-A.
143500     PERFORM PRINT-DETAIL.
143600     MOVE    LONG100 TO COMPUTED-A.
143700     PERFORM PRINT-DETAIL.
143800     MOVE    LONG120 TO COMPUTED-A.
143900     PERFORM PRINT-DETAIL.
144000     MOVE    LONG140 TO COMPUTED-A.
144100     PERFORM PRINT-DETAIL.
144200     MOVE    LONG160 TO COMPUTED-A.
144300     PERFORM PRINT-DETAIL.
144400     MOVE   "SEE PROGRAM" TO RE-MARK.
144500 LONG-WRITE-4.
144600     MOVE "LONG NON-NUM LITERAL" TO FEATURE.
144700     PERFORM PRINT-DETAIL.
144800 LONG-INIT-5.
144900     MOVE   "IV-9 4.2.2.2.1" TO ANSI-REFERENCE.
145000     MOVE    211113411,114311112 TO LONG-NUMBER.
145100 LONG-TEST-5.
145200     IF LONG-NUMBER EQUAL TO 211113411,114311112 PERFORM PASS
145300     ELSE GO TO LONG-FAIL-5.
145400     GO TO LONG-WRITE-5.
145500 LONG-DELETE-5.
145600     PERFORM DE-LETE.
145700     GO TO LONG-WRITE-5.
145800 LONG-FAIL-5.
145900     MOVE LONG-NUMBER TO COMPUTED-N.
146000     MOVE " 211113411,114311112" TO CORRECT-A.
146100     PERFORM FAIL.
146200 LONG-WRITE-5.
146300     MOVE "LONG NUMERIC LITERAL" TO FEATURE.
146400     MOVE "LONG-TEST-5" TO PAR-NAME.
146500     PERFORM PRINT-DETAIL.
146600 LONG-INIT-6.
146700     MOVE   "IV-9 4.2.2.2.1" TO ANSI-REFERENCE.
146800     MOVE     "ABCDEFGHIJKLMNOPQRST" TO LONG-PICTURE-A.
146900 LONG-TEST-6.
147000     MOVE     LONG-PICTURE-A TO LONG-PICTURE-B.
147100     MOVE     LONG-PICTURE-B TO LONG-PICTURE-C.
147200     IF       LONG-PICTURE-C EQUAL TO "FGHIJKLMNO"
147300              PERFORM PASS GO TO LONG-WRITE-6.
147400     GO       TO LONG-FAIL-6.
147500 LONG-DELETE-6.
147600     PERFORM  DE-LETE.
147700     GO       TO LONG-WRITE-6.
147800 LONG-FAIL-6.
147900     MOVE     LONG-PICTURE-C TO COMPUTED-A.
148000     MOVE     "FGHIJKLMNO" TO CORRECT-A.
148100     PERFORM  FAIL.
148200 LONG-WRITE-6.
148300     MOVE     "LONG PICTURE" TO FEATURE.
148400     MOVE     "LONG-TEST-6" TO PAR-NAME.
148500     PERFORM  PRINT-DETAIL.
148600 RDF-INIT-1.
148700     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
148800     MOVE "REDEFINES" TO FEATURE.
148900 RDF-TEST-1-0.
149000     MOVE "5" TO REDEF2.
149100 RDF-TEST-1-1.
149200     IF REDEF1 EQUAL TO 5 PERFORM PASS GO TO RDF-WRITE-1.
149300     GO TO RDF-FAIL-1.
149400 RDF-DELETE-1.
149500     PERFORM DE-LETE.
149600     GO TO RDF-WRITE-1.
149700 RDF-FAIL-1.
149800     MOVE REDEF1 TO COMPUTED-A.
149900     MOVE "5" TO CORRECT-A.
150000     PERFORM FAIL.
150100 RDF-WRITE-1.
150200     MOVE "RDF-TEST-1" TO PAR-NAME.
150300     PERFORM PRINT-DETAIL.
150400 RDF-INIT-2.
150500     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
150600 RDF-TEST-2-0.
150700     MOVE "W" TO REDEF4.
150800 RDF-TEST-2-1.
150900     IF REDEF3 EQUAL TO "WBC" PERFORM PASS GO TO RDF-WRITE-2.
151000     GO TO RDF-FAIL-2.
151100 RDF-DELETE-2.
151200     PERFORM DE-LETE.
151300     GO TO RDF-WRITE-2.
151400 RDF-FAIL-2.
151500     MOVE REDEF3 TO COMPUTED-A.
151600     MOVE "WBC" TO CORRECT-A.
151700     PERFORM FAIL.
151800 RDF-WRITE-2.
151900     MOVE "RDF-TEST-2" TO PAR-NAME.
152000     PERFORM PRINT-DETAIL.
152100 RDF-INIT-3.
152200     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
152300     MOVE 123456 TO REDEF6.
152400     MOVE "AB" TO REDEF8A.
152500     MOVE "EF" TO REDEF8C.
152600 RDF-TEST-3.
152700     IF REDEF5 EQUAL TO "AB34EF" PERFORM PASS GO TO RDF-WRITE-3.
152800     GO TO RDF-FAIL-3.
152900 RDF-DELETE-3.
153000     PERFORM DE-LETE.
153100     GO TO RDF-WRITE-3.
153200 RDF-FAIL-3.
153300     MOVE REDEF5 TO COMPUTED-A.
153400     MOVE "AB34EF" TO CORRECT-A.
153500     PERFORM FAIL.
153600 RDF-WRITE-3.
153700     MOVE "RDF-TEST-3" TO PAR-NAME.
153800     PERFORM PRINT-DETAIL.
153900 RDF-INIT-4.
154000     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
154100 RDF-TEST-4.
154200     IF RDFDATA7 EQUAL TO "ABC98765DE911644ALLD"
154300         PERFORM PASS
154400         GO TO RDF-WRITE-4.
154500     MOVE RDFDATA7 TO COMPUTED-A.
154600     MOVE "ABC98765DE911644ALLD" TO CORRECT-A.
154700     PERFORM FAIL.
154800     GO TO RDF-WRITE-4.
154900 RDF-DELETE-4.
155000     PERFORM DE-LETE.
155100 RDF-WRITE-4.
155200     MOVE "RDF-TEST-4 " TO PAR-NAME.
155300     PERFORM PRINT-DETAIL.
155400 RDF-INIT-5.
155500     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
155600 RDF-TEST-5.
155700     IF RDFDATA8 (13) EQUAL TO "HG"
155800         PERFORM PASS
155900         GO TO RDF-WRITE-5.
156000     MOVE "HG" TO CORRECT-A.
156100     MOVE RDFDATA8 (13) TO COMPUTED-A.
156200     PERFORM FAIL.
156300     GO TO RDF-WRITE-5.
156400 RDF-DELETE-5.
156500     PERFORM DE-LETE.
156600 RDF-WRITE-5.
156700     MOVE "RDF-TEST-5 " TO PAR-NAME.
156800     PERFORM PRINT-DETAIL.
156900 RDF-INIT-6.
157000     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
157100 RDF-TEST-6.
157200     IF RDFDATA2 EQUAL TO 9116,44
157300         PERFORM PASS
157400         GO TO RDF-WRITE-6.
157500     MOVE 9116,44 TO COMPUTED-N.
157600     MOVE RDFDATA2 TO CORRECT-N.
157700     PERFORM FAIL.
157800     GO TO RDF-WRITE-6.
157900 RDF-DELETE-6.
158000     PERFORM DE-LETE.
158100 RDF-WRITE-6.
158200     MOVE "RDF-TEST-6 " TO PAR-NAME.
158300     PERFORM PRINT-DETAIL.
158400 RDF-INIT-7.
158500     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
158600 RDF-TEST-7.
158700     IF RDFDATA16 EQUAL TO 66
158800         PERFORM PASS
158900         GO TO RDF-WRITE-7.
159000     MOVE RDFDATA16 TO COMPUTED-A.
159100     MOVE 66 TO CORRECT-A.
159200     PERFORM FAIL.
159300     GO TO RDF-WRITE-7.
159400 RDF-DELETE-7.
159500     PERFORM DE-LETE.
159600 RDF-WRITE-7.
159700     MOVE "RDF-TEST-7 " TO PAR-NAME.
159800     PERFORM PRINT-DETAIL.
159900 RDF-INIT-8.
160000     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
160100     MOVE SPACE TO REDEF12.
160200 RDF-TEST-8.
160300     IF REDEF11 EQUAL TO SPACE
160400         PERFORM PASS
160500         GO TO RDF-WRITE-8.
160600     MOVE "SPACE EXPECTED " TO CORRECT-A.
160700     MOVE "NON BLANK CHARACTERS" TO COMPUTED-A.
160800     MOVE "REDEF11 CONTAINS NON BLANKS" TO RE-MARK.
160900     PERFORM FAIL.
161000     GO TO RDF-WRITE-8.
161100 RDF-DELETE-8.
161200     PERFORM DE-LETE.
161300 RDF-WRITE-8.
161400     MOVE "RDF-TEST-8 " TO PAR-NAME.
161500     PERFORM PRINT-DETAIL.
161600 RDF-INIT-9.
161700     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
161800     MOVE ZERO TO REDEF12.
161900     MOVE SPACE TO REDEF11.
162000 RDF-TEST-9.
162100     IF RDFDATA18 EQUAL TO ZERO
162200         PERFORM PASS
162300         GO TO RDF-WRITE-9.
162400     MOVE "00000000000000" TO CORRECT-A.
162500     MOVE RDFDATA18 TO COMPUTED-A.
162600     PERFORM FAIL.
162700     GO TO RDF-WRITE-9.
162800 RDF-DELETE-9.
162900     PERFORM DE-LETE.
163000 RDF-WRITE-9.
163100     MOVE "RDF-TEST-9 " TO PAR-NAME.
163200     PERFORM PRINT-DETAIL.
163300 RDF-INIT-10.
163400     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
163500     MOVE ZERO TO REDEF12.
163600     MOVE "MOVING DATA TO A REDEFINED FIELD CAN BE RISKY "
163700         TO REDEF10.
163800 RDF-TEST-10.
163900     IF RDFDATA8 (14) EQUAL TO "00"
164000         PERFORM PASS
164100         GO TO RDF-WRITE-10.
164200     MOVE 00 TO CORRECT-A.
164300     MOVE RDFDATA8 (14) TO COMPUTED-A.
164400     PERFORM FAIL.
164500     GO TO RDF-WRITE-10.
164600 RDF-DELETE-10.
164700     PERFORM DE-LETE.
164800 RDF-WRITE-10.
164900     MOVE "RDF-TEST-10 " TO PAR-NAME.
165000     PERFORM PRINT-DETAIL.
165100 RDF-INIT-11.
165200     MOVE   "VI-38 5.10" TO ANSI-REFERENCE.
165300 RDF-TEST-11.
165400     MOVE REDEF13 TO REDEF12.
165500     IF REDEF10 EQUAL TO
165600         "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"
165700         PERFORM PASS
165800         GO TO RDF-WRITE-11.
165900     MOVE "ALPHABETIC A 46 LONG" TO CORRECT-A  COMPUTED-A.
166000     MOVE "FIELDS DIDNT COMPARE EQUAL " TO RE-MARK.
166100     PERFORM FAIL.
166200     GO TO RDF-WRITE-11.
166300 RDF-DELETE-11.
166400     PERFORM DE-LETE.
166500 RDF-WRITE-11.
166600     MOVE "RDF-TEST-11 " TO PAR-NAME.
166700     PERFORM PRINT-DETAIL.
166800 RDF-INIT-12.
166900     MOVE   "VI-38 5.10.3 SR6" TO ANSI-REFERENCE.
167000     MOVE "ABC98765DE" TO REDEF20.
167100 RDF-TEST-12.
167200     IF    REDEF22 = "ABC98765DE"
167300           PERFORM PASS
167400           GO TO   RDF-WRITE-12.
167500     GO TO RDF-FAIL-12.
167600 RDF-DELETE-12.
167700     PERFORM DE-LETE.
167800     GO TO RDF-WRITE-12.
167900 RDF-FAIL-12.
168000     MOVE REDEF22 TO COMPUTED-A.
168100     MOVE "ABC98765DE" TO CORRECT-A.
168200     PERFORM FAIL.
168300 RDF-WRITE-12.
168400     MOVE "RDF-TEST-12 " TO PAR-NAME.
168500     PERFORM PRINT-DETAIL.
168600 RDF-INIT-13.
168700     MOVE   "VI-38 5.10.3 SR6" TO ANSI-REFERENCE.
168800     MOVE "0987654321" TO REDEF22.
168900 RDF-TEST-13.
169000     IF    REDEF23 = "098765432"
169100           PERFORM PASS
169200           GO TO   RDF-WRITE-13.
169300     GO TO RDF-FAIL-13.
169400 RDF-DELETE-13.
169500     PERFORM DE-LETE.
169600     GO TO RDF-WRITE-13.
169700 RDF-FAIL-13.
169800     MOVE REDEF22 TO COMPUTED-A.
169900     MOVE "098765432" TO CORRECT-A.
170000     PERFORM FAIL.
170100 RDF-WRITE-13.
170200     MOVE "RDF-TEST-13" TO PAR-NAME.
170300     PERFORM PRINT-DETAIL.
170400 USAGE-INIT-1.
170500     MOVE   "VI-46 5.14" TO ANSI-REFERENCE.
170600     MOVE "USAGE" TO FEATURE.
170700 USAGE-TEST-1.
170800     IF       U2 GREATER THAN U7 PERFORM PASS ELSE PERFORM FAIL.
170900     GO TO USAGE-WRITE-1.
171000 USAGE-DELETE-1.
171100     PERFORM DE-LETE.
171200 USAGE-WRITE-1.
171300     MOVE "USAGE-TEST-1" TO PAR-NAME.
171400     PERFORM PRINT-DETAIL.
171500 USAGE-INIT-2.
171600     MOVE   "VI-46 5.14" TO ANSI-REFERENCE.
171700 USAGE-TEST-2.
171800     IF U2 EQUAL TO U4 PERFORM PASS ELSE PERFORM FAIL.
171900     GO TO USAGE-WRITE-2.
172000 USAGE-DELETE-2.
172100     PERFORM DE-LETE.
172200 USAGE-WRITE-2.
172300     MOVE "USAGE-TEST-2" TO PAR-NAME.
172400     PERFORM PRINT-DETAIL.
172500 USAGE-INIT-3.
172600     MOVE   "VI-46 5.14" TO ANSI-REFERENCE.
172700 USAGE-TEST-3.
172800     IF U3 EQUAL TO U4 PERFORM PASS ELSE PERFORM FAIL.
172900     GO TO USAGE-WRITE-3.
173000 USAGE-DELETE-3.
173100     PERFORM DE-LETE.
173200 USAGE-WRITE-3.
173300     MOVE "USAGE-TEST-3" TO PAR-NAME.
173400     PERFORM PRINT-DETAIL.
173500 USAGE-INIT-4.
173600     MOVE   "VI-46 5.14" TO ANSI-REFERENCE.
173700 USAGE-TEST-4-0.
173800     MOVE U5 TO U9.
173900 USAGE-TEST-4-1.
174000     IF       U6 EQUAL TO U10
174100         PERFORM PASS
174200         GO TO USAGE-WRITE-4.
174300     GO TO USAGE-FAIL-4.
174400 USAGE-DELETE-4.
174500     PERFORM DE-LETE.
174600     GO TO USAGE-WRITE-4.
174700 USAGE-FAIL-4.
174800     MOVE     U10 TO COMPUTED-N.
174900     MOVE     U6 TO CORRECT-N.
175000     PERFORM FAIL.
175100 USAGE-WRITE-4.
175200     MOVE "USAGE-TEST-4" TO PAR-NAME.
175300     PERFORM PRINT-DETAIL.
175400 USAGE-INIT-5.
175500     MOVE   "VI-46 5.14" TO ANSI-REFERENCE.
175600 USAGE-TEST-5-0.
175700     MOVE     U5 TO U9.
175800 USAGE-TEST-5-1.
175900     IF       U7 EQUAL TO U11
176000              PERFORM PASS
176100              GO TO USAGE-WRITE-5.
176200     MOVE     U7 TO CORRECT-N.
176300     MOVE     U11 TO COMPUTED-N.
176400     PERFORM FAIL.
176500     GO TO USAGE-WRITE-5.
176600 USAGE-DELETE-5.
176700     PERFORM  DE-LETE.
176800 USAGE-WRITE-5.
176900     MOVE     "USAGE-TEST-5" TO PAR-NAME.
177000     PERFORM  PRINT-DETAIL.
177100 USAGE-INIT-6.
177200     MOVE   "VI-47 5.14.4 GR3 GR9" TO ANSI-REFERENCE.
177300 USAGE-TEST-6.
177400     IF      U22 GREATER THAN U12 PERFORM PASS ELSE PERFORM FAIL.
177500     GO TO USAGE-WRITE-6.
177600 USAGE-DELETE-6.
177700     PERFORM DE-LETE.
177800 USAGE-WRITE-6.
177900     MOVE "USAGE-TEST-6" TO PAR-NAME.
178000     PERFORM PRINT-DETAIL.
178100 USAGE-INIT-7.
178200     MOVE   "VI-47 5.14.4 GR3 GR9" TO ANSI-REFERENCE.
178300 USAGE-TEST-7.
178400     IF      U23 GREATER THAN U13 PERFORM PASS ELSE PERFORM FAIL.
178500     GO TO USAGE-WRITE-7.
178600 USAGE-DELETE-7.
178700     PERFORM DE-LETE.
178800 USAGE-WRITE-7.
178900     MOVE "USAGE-TEST-7" TO PAR-NAME.
179000     PERFORM PRINT-DETAIL.
179100 VALUE-INIT-1.
179200     MOVE   "VI-50 5.15.6 (6)" TO ANSI-REFERENCE.
179300     MOVE   "VALUE FOR OCCURS FIELD" TO FEATURE.
179400     MOVE   "VALUE TESTS 1, 2 & 3"   TO PAR-NAME.
179500 VALUE-TEST-1.
179600     MOVE 1 TO SUB1.
179700     PERFORM VALUE-TEST-2
179800                            UNTIL SUB1 > 10.
179900     GO TO   CURR-TEST-1.
180000 VALUE-TEST-2.
180100     MOVE 1 TO SUB2.
180200     PERFORM VALUE-TEST-3
180300                            UNTIL SUB2 > 10.
180400     ADD 1 TO SUB1.
180500 VALUE-TEST-3.
180600     MOVE    SUB1 TO TAB1.
180700     MOVE    SUB2 TO TAB2.
180800     MOVE    TAB-LOC TO PAR-NAME.
180900     IF      VALUE-TABLE-2  (SUB1 SUB2) = "AZ"
181000             PERFORM PASS
181100     ELSE
181200             MOVE    VALUE-TABLE-2 (SUB1 SUB2) TO COMPUTED-A
181300             MOVE   "AZ" TO CORRECT-A
181400             PERFORM FAIL.
181500     PERFORM PRINT-DETAIL.
181600     ADD 1 TO SUB2.
181700 VALUE-DELETE-1.
181800     PERFORM DE-LETE.
181900     PERFORM PRINT-DETAIL.
182000 CURR-TEST-1.
182100     MOVE DATA-I TO DATA-J.
182200     IF  DATA-J EQUAL TO "  W12" PERFORM PASS GO TO CURR-WRITE-1.
182300     GO TO CURR-FAIL-1.
182400 CURR-DELETE-1.
182500     PERFORM DE-LETE.
182600     GO TO CURR-WRITE-1.
182700 CURR-FAIL-1.
182800     MOVE DATA-J TO COMPUTED-A.
182900     MOVE     "  W12" TO CORRECT-A.
183000     PERFORM FAIL.
183100 CURR-WRITE-1.
183200     MOVE "CURRENCY SIGN IS" TO FEATURE.
183300     MOVE "CURR-TEST-1" TO PAR-NAME.
183400     PERFORM PRINT-DETAIL.
183500 DCOM-TEST-1.
183600     MOVE DATA-K TO DATA-L.
183700     IF DATA-L EQUAL TO "1.234.567,89" PERFORM PASS
183800     GO TO DCOM-WRITE-1.
183900     GO TO DCOM-FAIL-1.
184000 DCOM-DELETE-1.
184100     PERFORM DE-LETE.
184200     GO TO DCOM-WRITE-1.
184300 DCOM-FAIL-1.
184400     MOVE DATA-L TO COMPUTED-A.
184500     MOVE "1.234.567,89" TO CORRECT-A.
184600     PERFORM FAIL.
184700 DCOM-WRITE-1.
184800     MOVE "DECIMAL IS COMMA" TO FEATURE.
184900     MOVE "DCOM-TEST-1" TO PAR-NAME.
185000     PERFORM PRINT-DETAIL.
185100 DCOM-INIT-2.
185200     MOVE   "123456789." TO TEST-FIELD.
185300 DCOM-TEST-2-1.
185400     IF     TEST-FIELD = "123456789."
185500            PERFORM PASS
185600            GO TO DCOM-WRITE-2.
185700     GO TO  DCOM-FAIL-2.
185800 DCOM-DELETE-2.
185900     PERFORM DE-LETE.
186000     GO TO   DCOM-WRITE-2.
186100 DCOM-FAIL-2.
186200     MOVE    TEST-FIELD  TO COMPUTED-A.
186300     MOVE   "123456789." TO CORRECT-A.
186400     PERFORM FAIL.
186500 DCOM-WRITE-2.
186600     MOVE   "DCOM-TEST-2" TO PAR-NAME.
186700     PERFORM PRINT-DETAIL.
186800 DCOM-INIT-3.
186900     MOVE   "123456789," TO TEST-FIELD.
187000 DCOM-TEST-3-1.
187100     IF     TEST-FIELD = "123456789,"
187200            PERFORM PASS
187300            GO TO DCOM-WRITE-3.
187400     GO TO  DCOM-FAIL-3.
187500 DCOM-DELETE-3.
187600     PERFORM DE-LETE.
187700     GO TO   DCOM-WRITE-3.
187800 DCOM-FAIL-3.
187900     MOVE    TEST-FIELD  TO COMPUTED-A.
188000     MOVE   "123456789," TO CORRECT-A.
188100     PERFORM FAIL.
188200 DCOM-WRITE-3.
188300     MOVE   "DCOM-TEST-3" TO PAR-NAME.
188400     PERFORM PRINT-DETAIL.
188500 NUM-INIT-A.
188600     MOVE     "NUMERIC PARA-NAMES" TO FEATURE.
188700     PERFORM  PRINT-DETAIL.
188800 NUM-TEST-2.
188900     MOVE     3 TO NUM-UTILITY.
189000     GO       TO 3 4 5 DEPENDING ON NUM-UTILITY.
189100     PERFORM  FAIL.
189200     MOVE     "GO TO DEPENDING IGNORED" TO RE-MARK.
189300     GO       TO NUM-WRITE-2.
189400 NUM-DELETE-2.
189500     PERFORM  DE-LETE.
189600     GO       TO NUM-WRITE-2.
189700 4.
189800     PERFORM  FAIL.
189900     MOVE     "PARAGRAPH 4 ENTERED" TO RE-MARK
190000     GO       TO NUM-WRITE-2.
190100 5.
190200     PERFORM  PASS.
190300     GO       TO NUM-WRITE-2.
190400 3.
190500     PERFORM  FAIL.
190600     MOVE     "PARAGRAPH 3 ENTERED" TO RE-MARK.
190700 NUM-WRITE-2.
190800     MOVE     "  GO TO DEPENDING" TO FEATURE.
190900     MOVE     "NUM-TEST-2" TO PAR-NAME.
191000     PERFORM  PRINT-DETAIL.
191100 NUM-TEST-3.
191200     MOVE     ZERO TO NUM-UTILITY.
191300     PERFORM  000000000000000000000000001 THRU
191400              00000000000000000000000000001 2 TIMES.
191500     IF       NUM-UTILITY EQUAL TO 220
191600              PERFORM PASS GO TO NUM-WRITE-3.
191700     GO       TO NUM-FAIL-3.
191800 NUM-DELETE-3.
191900     PERFORM  DE-LETE.
192000     GO       TO NUM-WRITE-3.
192100 NUM-FAIL-3.
192200     PERFORM  FAIL.
192300     MOVE     NUM-UTILITY TO COMPUTED-N.
192400     MOVE     220 TO CORRECT-N.
192500
192600 NUM-WRITE-3.
192700     MOVE     "  PERFORM THRU TIMES" TO FEATURE.
192800     MOVE     "NUM-TEST-3" TO PAR-NAME.
192900     PERFORM  PRINT-DETAIL.
193000
193100 NUM-TEST-4.
193200     MOVE     ZERO TO NUM-UTILITY.
193300     PERFORM  0000000000000000000000000001.
193400     IF       NUM-UTILITY EQUAL TO 1100
193500              PERFORM PASS GO TO NUM-WRITE-4.
193600     GO       TO NUM-FAIL-4.
193700 NUM-DELETE-4.
193800     PERFORM  DE-LETE.
193900     GO       TO NUM-WRITE-4.
194000 NUM-FAIL-4.
194100     PERFORM  FAIL.
194200     MOVE     NUM-UTILITY TO COMPUTED-N.
194300     MOVE     1100 TO CORRECT-N.
194400 NUM-WRITE-4.
194500     MOVE     "  PERFORM SECT-NAME" TO FEATURE.
194600     MOVE     "NUM-TEST-4" TO PAR-NAME.
194700     PERFORM  PRINT-DETAIL.
194800     GO       TO NUM-EXIT.
194900 0000000000000000000000001 SECTION.
195000 00000000000000000000000001.
195100     ADD      1 TO NUM-UTILITY ON SIZE ERROR GO TO NUM-ERROR.
195200
195300 000000000000000000000000001.
195400     ADD      10 TO NUM-UTILITY ON SIZE ERROR GO TO NUM-ERROR.
195500 0000000000000000000000000001 SECTION.
195600 00000000000000000000000000001.
195700     ADD      100 TO NUM-UTILITY ON SIZE ERROR GO TO NUM-ERROR.
195800 000000000000000000000000000001.
195900     ADD      1000 TO NUM-UTILITY ON SIZE ERROR GO TO NUM-ERROR.
196000 NUM-EXIT-SECT SECTION.
196100 NUM-ERROR.
196200     MOVE     "  PERFORM" TO FEATURE.
196300     MOVE "NUM-TEST-4 " TO PAR-NAME.
196400     PERFORM  FAIL.
196500     MOVE     NUM-UTILITY TO COMPUTED-N.
196600     MOVE     "SIZE ERROR ENCOUNTERED" TO RE-MARK.
196700     PERFORM  PRINT-DETAIL.
196800 NUM-EXIT.
196900     EXIT.
197000 NUM-TEST-5.
197100     MOVE "  GO TO " TO FEATURE.
197200     GO TO 000000000000000000000000000002.
197300 NUM-DELETE-5.
197400     PERFORM DE-LETE.
197500     GO TO NUM-WRITE-5.
197600 000000000000000000000000000002.
197700     MOVE 2222 TO NUM-UTILITY.
197800 COMPARE-TEST-5.
197900     IF NUM-UTILITY EQUAL TO 2222
198000         PERFORM PASS
198100         GO TO NUM-WRITE-5.
198200     MOVE 2222 TO CORRECT-A.
198300     MOVE "GO TO PARAGRAPH NOT ENTERED" TO RE-MARK.
198400     PERFORM FAIL.
198500 NUM-WRITE-5.
198600     MOVE "NUM-TEST-5 " TO PAR-NAME.
198700     PERFORM PRINT-DETAIL.
198800 CONT-INIT-1.
198900     MOVE   "ABCDEFGHIJ" TO TEST-FIELD.
199000     MOVE   "CONTINUE STATEMENT" TO FEATURE.
199100     MOVE   "VI-77 6.9"          TO ANSI-REFERENCE.
199200 CONT-TEST-1-1.
199300     IF      TEST-FIELD = "ABCDEFGHIJ"
199400             CONTINUE
199500     ELSE
199600             GO TO   CONT-FAIL-1.
199700     PERFORM PASS.
199800     GO TO   CONT-WRITE-1.
199900 CONT-DELETE-1.
200000     PERFORM DE-LETE.
200100     GO TO   CONT-WRITE-1.
200200 CONT-FAIL-1.
200300     MOVE   "CONTINUE STATEMENT" TO FEATURE.
200400     MOVE    TEST-FIELD  TO COMPUTED-A.
200500     MOVE   "123456789." TO CORRECT-A.
200600     PERFORM FAIL.
200700 CONT-WRITE-1.
200800     MOVE   "CONT-TEST-1" TO PAR-NAME.
200900     PERFORM PRINT-DETAIL.
201000 CONT-INIT-2.
201100     MOVE   "ABCDEFGHIJ" TO TEST-FIELD.
201200     MOVE   "CONTINUE STATEMENT" TO FEATURE.
201300     MOVE   "VI-77 6.9"          TO ANSI-REFERENCE.
201400 CONT-TEST-2-1.
201500     IF      TEST-FIELD = "ABCDEFGHIJ"
201600             PERFORM PASS
201700             GO TO   CONT-WRITE-2
201800     ELSE
201900             CONTINUE.
202000     GO TO   CONT-FAIL-2.
202100 CONT-DELETE-2.
202200     PERFORM DE-LETE.
202300     GO TO   CONT-WRITE-2.
202400 CONT-FAIL-2.
202500     MOVE    TEST-FIELD  TO COMPUTED-A.
202600     MOVE   "123456789." TO CORRECT-A.
202700     PERFORM FAIL.
202800 CONT-WRITE-2.
202900     MOVE   "CONT-TEST-2" TO PAR-NAME.
203000     PERFORM PRINT-DETAIL.
203100 CCVS-EXIT SECTION.
203200 CCVS-999999.
203300     GO TO CLOSE-FILES.
