000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC119A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*      PROGRAM NC119A TESTS THE USE OF THE "SIGN" CLAUSE WITH
002300*      FORMATS 1 AND 2 OF THE SUBTRACT STATEMENT.
002400*      ALL COMBINATIONS OF THE SIGN CLAUSE PHRASES ARE USED
002500*      WITH DATA ITEMS OF VARIOUS LENGTHS.
002600*
002700*
002800
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.
003200     XXXXX082.
003300 OBJECT-COMPUTER.
003400     XXXXX083.
003500 INPUT-OUTPUT SECTION.
003600 FILE-CONTROL.
003700     SELECT PRINT-FILE ASSIGN TO
003800     XXXXX055.
003900 DATA DIVISION.
004000 FILE SECTION.
004100 FD  PRINT-FILE.
004200 01  PRINT-REC PICTURE X(120).
004300 01  DUMMY-RECORD PICTURE X(120).
004400 WORKING-STORAGE SECTION.
004500 77  SIZE-ERR                     PICTURE X  VALUE SPACE.
004600 77  A18TWOS-DS-LS-18V00             PICTURE S9(18)
004700             SIGN IS LEADING SEPARATE
004800                                  VALUE 222222222222222222.
004900 77  A18ONES-DS-TS-18V00             PICTURE S9(18)
005000            SIGN IS TRAILING SEPARATE
005100                                  VALUE 111111111111111111.
005200 77  WRK-DS-10V00                 PICTURE S9(10) TRAILING.
005300 77  A10ONES-DS-T-10V00             PICTURE S9(10)
005400            SIGN TRAILING
005500                                  VALUE 1111111111.
005600 77  A05ONES-DS-L-05V00             PICTURE S9(5)
005700           SIGN LEADING
005800                                  VALUE 11111.
005900 77  A02ONES-DS-LS-02V00             PICTURE S99
006000           LEADING SEPARATE
006100                                  VALUE 11.
006200 77  WRK-DS-09V09                 PICTURE S9(9)V9(9)   TRAILING.
006300 77  WRK-DS-T-18V00 REDEFINES WRK-DS-09V09
006400                                  PICTURE S9(18) TRAILING.
006500 77  A06THREES-DS-03V03           PICTURE S999V999
006600                                  VALUE 333.333.
006700 77  A12THREES-DS-06V06           PICTURE S9(6)V9(6)
006800                                  VALUE 333333.333333.
006900 77  WRK-DS-TS-06V06                 PICTURE S9(6)V9(6)
007000           SIGN IS TRAILING SEPARATE CHARACTER.
007100 77  WRK-DS-TS-12V00-S REDEFINES WRK-DS-TS-06V06
007200         TRAILING SEPARATE
007300                                  PICTURE S9(12).
007400 77  A05ONES-DS-LS-00V05             PICTURE SV9(5)
007500         LEADING SEPARATE
007600                                  VALUE .11111.
007700 77  WRK-DS-T-05V00                 PICTURE S9(5) TRAILING.
007800 77  WRK-DS-02V00                 PICTURE S99.
007900 77  A12ONES-DS-L-12V00             PICTURE S9(12)
008000              USAGE IS DISPLAY SIGN IS LEADING
008100                                  VALUE 111111111111.
008200 77  WRK-DS-03V10                 PICTURE S999V9(10).
008300 77  WRK-DS-13V00-S REDEFINES WRK-DS-03V10
008400                                  PICTURE S9(13).
008500 77  A99-DS-T-02V00                 PICTURE S99
008600             USAGE IS DISPLAY SIGN IS TRAILING
008700                                  VALUE 99.
008800 77  A03ONES-DS-02V01             PICTURE S99V9
008900                                  VALUE 11.1.
009000 77  A06ONES-DS-TS-03V03             PICTURE S999V999
009100             USAGE IS DISPLAY TRAILING SEPARATE
009200                                  VALUE 111.111.
009300 77  A08TWOS-DS-02V06             PICTURE S99V9(6)
009400                                  VALUE 22.222222.
009500 77  A01ONES-DS-LS-P0801              PICTURE SP(8)9
009600             SIGN IS LEADING SEPARATE
009700                                  VALUE .000000001.
009800 77  WRK-CS-18V00                 PICTURE S9(18) COMPUTATIONAL.
009900 77  A18ONES-CS-18V00             PICTURE S9(18) COMPUTATIONAL
010000                                  VALUE 111111111111111111.
010100 77  WRK-CS-02V02                 PICTURE S99V99 COMPUTATIONAL.
010200 77  A99-CS-02V00                 PICTURE S99 COMPUTATIONAL
010300                                  VALUE 99.
010400 77  WRK-DS-TS-0201P            PICTURE S99P TRAILING SEPARATE.
010500 77  WRK-DS-06V00                 PICTURE S9(6).
010600 77  AZERO-DS-LS-05V05               PICTURE S9(5)V9(5)
010700             SIGN IS LEADING SEPARATE USAGE DISPLAY
010800                                  VALUE ZERO.
010900 77  NDATA-DS-09V09               PICTURE S9(9)V9(9)
011000                                  VALUE +012345678.876543210.
011100 77  XDATA-XN-00018               PICTURE X(18)
011200                                  VALUE "00ABCDEFGHI  4321 ".
011300 77  WRK-XN-00018                 PICTURE X(18).
011400 77  ADD-12    PICTURE PP9        VALUE .001.
011500 77  ADD-13    PICTURE 9PP        VALUE 100.
011600 77  ADD-14    PICTURE 999V999.
011700 77  WRK-CU-18V00      PICTURE 9(18) VALUE ZERO COMPUTATIONAL.
011800 77  A18EIGHTS-CS-18V00 PICTURE S9(18) VALUE -888888888888888888
011900             COMPUTATIONAL.
012000 77  A14TWOS-CS-18V00  PICTURE S9(18) VALUE -000022222222222222
012100             COMPUTATIONAL.
012200 77  A12THREES-CU-18V00 PICTURE 9(18) VALUE 000000333333333333
012300             COMPUTATIONAL.
012400 77  A16FOURS-CS-18V00 PICTURE S9(18) VALUE 004444444444444444
012500             COMPUTATIONAL.
012600 77  A18FIVES-CS-18V00 PICTURE S9(18) VALUE -555555555555555555
012700             COMPUTATIONAL.
012800 77  A18SIXES-CS-18V00 PICTURE S9(18) VALUE 666666666666666666
012900             COMPUTATIONAL.
013000 77  A12SEVENS-CU-18V00 PICTURE 9(18) VALUE 000000777777777777
013100             COMPUTATIONAL.
013200 77  WRK-DU-18V00      PICTURE 9(18) VALUE ZERO.
013300 77  A18THREES-CS-18V00 PICTURE S9(18) VALUE -333333333333333333
013400             COMPUTATIONAL.
013500 77  WRK-CS-03V00 PICTURE S999 COMPUTATIONAL SYNCHRONIZED RIGHT.
013600 01  SUBTRACT-DATA SIGN IS LEADING SEPARATE DISPLAY.
013700     02  SUBTR-1    PICTURE 9         VALUE 1.
013800     02  SUBTR-2    PICTURE S99       VALUE 99.
013900     02  SUBTR-3    PICTURE S9V99     VALUE -1.
014000     02  SUBTR-4    PICTURE SPP9      VALUE .001.
014100     02  SUBTR-5    PICTURE S9PP      VALUE 100.
014200     02  SUBTR-6    PICTURE 9  VALUE 1.
014300     02  SUBTR-7    PICTURE S99  VALUE 99.
014400     02  SUBTR-8    PICTURE S9V99  VALUE -9.99.
014500     02  SUBTR-10    PICTURE S999  VALUE 100.
014600     02  SUBTR-11   PICTURE S999V999.
014700 01  N-3                                PICTURE IS 99999.
014800 01  N-4                                PICTURE IS 9(5)
014900     VALUE IS 52800.
015000 01  N-5                                PICTURE IS S9(9)V99
015100             SIGN IS LEADING SEPARATE
015200     VALUE IS 000000001.00.
015300 01  N-7                                PICTURE IS S9(7)V9(4)
015400             SIGN IS LEADING SEPARATE CHARACTER
015500     VALUE IS 0000001.0000.
015600 01  X-8 REDEFINES N-7                  PICTURE IS X(11).
015700 01  N-10                               PICTURE IS S99999V
015800     VALUE IS -00001.
015900 01  N-11                               PICTURE IS 9 VALUE IS 9.
016000 01  N-12                               PICTURE IS 9 VALUE IS 9.
016100 01  N-13                               PICTURE IS 9(5)
016200     VALUE IS 99999.
016300 01  N-14                               PICTURE IS 9 VALUE IS 1.
016400 01  N-15                               PICTURE IS 9(16).
016500 01  N-16                               PICTURE IS S999999V99
016600     VALUE IS 5.90.
016700 01  N-17                               PICTURE IS S9(3)V99
016800     VALUE IS +3.6.
016900 01  N-18                               PICTURE IS S9(10)
017000     VALUE IS -5.
017100 01  N-19                               PICTURE IS $9.00.
017200 01  N-20                               PICTURE IS S9(9)
017300     VALUE IS -999999999.
017400 01  N-21                               PICTURE IS 9 VALUE IS 5.
017500 01  N-22                               PICTURE IS 999V99
017600     VALUE IS 005.55.
017700 01  N-23                               PICTURE IS $$$.99CR.
017800 01  N-25                               PICTURE IS 9 VALUE IS 1.
017900 01  N-26               PICTURE 9(5).
018000 01  N-27                               PICTURE IS 9999V9
018100     VALUE IS 9999.9.
018200 01  N-28                               PICTURE IS $9999.00.
018300 01  N-40                               PICTURE IS 9(7)
018400     VALUE IS 7777777.
018500 01  N-41                               PICTURE IS 9(7)
018600     VALUE IS 1111111.
018700 01  N-42                               PICTURE IS 9(3)P(4).
018800 01  TRUNC-DATA.
018900     02 N-43  PICTURE S9V9 VALUE +1.6.
019000     02 N-44  PICTURE S9V9 VALUE -1.6.
019100     02 N-45  PICTURE S9.
019200 01  MINUS-NAMES SIGN IS LEADING SEPARATE CHARACTER.
019300     02  MINUS-NAME1 PICTURE S9(18) VALUE -999999999999999999.
019400     02  MINUS-NAME2 PICTURE S9(18) VALUE -999999999999999999.
019500     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
019600     02  PLUS-NAME1  PICTURE S9(18) VALUE +999999999999999999.
019700     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
019800     02  MINUS-NAME3 PICTURE SV9(18) VALUE -.999999999999999999.
019900     02  MINUS-NAME4 PICTURE SV9(18) VALUE -.999999999999999999.
020000     02  EVEN-NAME2  PICTURE SV9(18)  VALUE +.1.
020100     02  PLUS-NAME3  PICTURE SV9(18) VALUE +.999999999999999999.
020200     02  PLUS-NAME4  PICTURE SV9(18) VALUE +.999999999999999999.
020300     02  WHOLE-FIELD   PICTURE S9(18).
020400     02  DECMAL-FIELD  PICTURE SV9(18).
020500 01  TEST-RESULTS.
020600     02 FILLER                   PIC X      VALUE SPACE.
020700     02 FEATURE                  PIC X(20)  VALUE SPACE.
020800     02 FILLER                   PIC X      VALUE SPACE.
020900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
021000     02 FILLER                   PIC X      VALUE SPACE.
021100     02  PAR-NAME.
021200       03 FILLER                 PIC X(19)  VALUE SPACE.
021300       03  PARDOT-X              PIC X      VALUE SPACE.
021400       03 DOTVALUE               PIC 99     VALUE ZERO.
021500     02 FILLER                   PIC X(8)   VALUE SPACE.
021600     02 RE-MARK                  PIC X(61).
021700 01  TEST-COMPUTED.
021800     02 FILLER                   PIC X(30)  VALUE SPACE.
021900     02 FILLER                   PIC X(17)  VALUE
022000            "       COMPUTED=".
022100     02 COMPUTED-X.
022200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
022300     03 COMPUTED-N               REDEFINES COMPUTED-A
022400                                 PIC -9(9).9(9).
022500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
022600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
022700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
022800     03       CM-18V0 REDEFINES COMPUTED-A.
022900         04 COMPUTED-18V0                    PIC -9(18).
023000         04 FILLER                           PIC X.
023100     03 FILLER PIC X(50) VALUE SPACE.
023200 01  TEST-CORRECT.
023300     02 FILLER PIC X(30) VALUE SPACE.
023400     02 FILLER PIC X(17) VALUE "       CORRECT =".
023500     02 CORRECT-X.
023600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
023700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
023800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
023900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
024000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
024100     03      CR-18V0 REDEFINES CORRECT-A.
024200         04 CORRECT-18V0                     PIC -9(18).
024300         04 FILLER                           PIC X.
024400     03 FILLER PIC X(2) VALUE SPACE.
024500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
024600 01  CCVS-C-1.
024700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
024800-    "SS  PARAGRAPH-NAME
024900-    "       REMARKS".
025000     02 FILLER                     PIC X(20)    VALUE SPACE.
025100 01  CCVS-C-2.
025200     02 FILLER                     PIC X        VALUE SPACE.
025300     02 FILLER                     PIC X(6)     VALUE "TESTED".
025400     02 FILLER                     PIC X(15)    VALUE SPACE.
025500     02 FILLER                     PIC X(4)     VALUE "FAIL".
025600     02 FILLER                     PIC X(94)    VALUE SPACE.
025700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
025800 01  REC-CT                        PIC 99       VALUE ZERO.
025900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
026000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
026100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
026200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
026300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
026400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
026500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
026600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
026700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
026800 01  CCVS-H-1.
026900     02  FILLER                    PIC X(39)    VALUE SPACES.
027000     02  FILLER                    PIC X(42)    VALUE
027100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
027200     02  FILLER                    PIC X(39)    VALUE SPACES.
027300 01  CCVS-H-2A.
027400   02  FILLER                        PIC X(40)  VALUE SPACE.
027500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
027600   02  FILLER                        PIC XXXX   VALUE
027700     "4.2 ".
027800   02  FILLER                        PIC X(28)  VALUE
027900            " COPY - NOT FOR DISTRIBUTION".
028000   02  FILLER                        PIC X(41)  VALUE SPACE.
028100
028200 01  CCVS-H-2B.
028300   02  FILLER                        PIC X(15)  VALUE
028400            "TEST RESULT OF ".
028500   02  TEST-ID                       PIC X(9).
028600   02  FILLER                        PIC X(4)   VALUE
028700            " IN ".
028800   02  FILLER                        PIC X(12)  VALUE
028900     " HIGH       ".
029000   02  FILLER                        PIC X(22)  VALUE
029100            " LEVEL VALIDATION FOR ".
029200   02  FILLER                        PIC X(58)  VALUE
029300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029400 01  CCVS-H-3.
029500     02  FILLER                      PIC X(34)  VALUE
029600            " FOR OFFICIAL USE ONLY    ".
029700     02  FILLER                      PIC X(58)  VALUE
029800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
029900     02  FILLER                      PIC X(28)  VALUE
030000            "  COPYRIGHT   1985 ".
030100 01  CCVS-E-1.
030200     02 FILLER                       PIC X(52)  VALUE SPACE.
030300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
030400     02 ID-AGAIN                     PIC X(9).
030500     02 FILLER                       PIC X(45)  VALUE SPACES.
030600 01  CCVS-E-2.
030700     02  FILLER                      PIC X(31)  VALUE SPACE.
030800     02  FILLER                      PIC X(21)  VALUE SPACE.
030900     02 CCVS-E-2-2.
031000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
031100         03 FILLER                   PIC X      VALUE SPACE.
031200         03 ENDER-DESC               PIC X(44)  VALUE
031300            "ERRORS ENCOUNTERED".
031400 01  CCVS-E-3.
031500     02  FILLER                      PIC X(22)  VALUE
031600            " FOR OFFICIAL USE ONLY".
031700     02  FILLER                      PIC X(12)  VALUE SPACE.
031800     02  FILLER                      PIC X(58)  VALUE
031900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
032000     02  FILLER                      PIC X(13)  VALUE SPACE.
032100     02 FILLER                       PIC X(15)  VALUE
032200             " COPYRIGHT 1985".
032300 01  CCVS-E-4.
032400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
032500     02 FILLER                       PIC X(4)   VALUE " OF ".
032600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
032700     02 FILLER                       PIC X(40)  VALUE
032800      "  TESTS WERE EXECUTED SUCCESSFULLY".
032900 01  XXINFO.
033000     02 FILLER                       PIC X(19)  VALUE
033100            "*** INFORMATION ***".
033200     02 INFO-TEXT.
033300       04 FILLER                     PIC X(8)   VALUE SPACE.
033400       04 XXCOMPUTED                 PIC X(20).
033500       04 FILLER                     PIC X(5)   VALUE SPACE.
033600       04 XXCORRECT                  PIC X(20).
033700     02 INF-ANSI-REFERENCE           PIC X(48).
033800 01  HYPHEN-LINE.
033900     02 FILLER  PIC IS X VALUE IS SPACE.
034000     02 FILLER  PIC IS X(65)    VALUE IS "************************
034100-    "*****************************************".
034200     02 FILLER  PIC IS X(54)    VALUE IS "************************
034300-    "******************************".
034400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
034500     "NC119A".
034600 PROCEDURE DIVISION.
034700 CCVS1 SECTION.
034800 OPEN-FILES.
034900     OPEN     OUTPUT PRINT-FILE.
035000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
035100     MOVE    SPACE TO TEST-RESULTS.
035200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
035300     GO TO CCVS1-EXIT.
035400 CLOSE-FILES.
035500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
035600 TERMINATE-CCVS.
035700S    EXIT PROGRAM.
035800STERMINATE-CALL.
035900     STOP     RUN.
036000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
036100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
036200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
036300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
036400     MOVE "****TEST DELETED****" TO RE-MARK.
036500 PRINT-DETAIL.
036600     IF REC-CT NOT EQUAL TO ZERO
036700             MOVE "." TO PARDOT-X
036800             MOVE REC-CT TO DOTVALUE.
036900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
037000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
037100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
037200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
037300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
037400     MOVE SPACE TO CORRECT-X.
037500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
037600     MOVE     SPACE TO RE-MARK.
037700 HEAD-ROUTINE.
037800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
038100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
038200 COLUMN-NAMES-ROUTINE.
038300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
038600 END-ROUTINE.
038700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
038800 END-RTN-EXIT.
038900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039000 END-ROUTINE-1.
039100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
039200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
039300      ADD PASS-COUNTER TO ERROR-HOLD.
039400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
039500      MOVE PASS-COUNTER TO CCVS-E-4-1.
039600      MOVE ERROR-HOLD TO CCVS-E-4-2.
039700      MOVE CCVS-E-4 TO CCVS-E-2-2.
039800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
039900  END-ROUTINE-12.
040000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
040100     IF       ERROR-COUNTER IS EQUAL TO ZERO
040200         MOVE "NO " TO ERROR-TOTAL
040300         ELSE
040400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
040500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
040600     PERFORM WRITE-LINE.
040700 END-ROUTINE-13.
040800     IF DELETE-COUNTER IS EQUAL TO ZERO
040900         MOVE "NO " TO ERROR-TOTAL  ELSE
041000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
041100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
041200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041300      IF   INSPECT-COUNTER EQUAL TO ZERO
041400          MOVE "NO " TO ERROR-TOTAL
041500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
041600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
041700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041900 WRITE-LINE.
042000     ADD 1 TO RECORD-COUNT.
042100Y    IF RECORD-COUNT GREATER 42
042200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
042300Y        MOVE SPACE TO DUMMY-RECORD
042400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
042500Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
042600Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
042700Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
042800Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
042900Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
043000Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
043100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
043200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
043300Y        MOVE ZERO TO RECORD-COUNT.
043400     PERFORM WRT-LN.
043500 WRT-LN.
043600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
043700     MOVE SPACE TO DUMMY-RECORD.
043800 BLANK-LINE-PRINT.
043900     PERFORM WRT-LN.
044000 FAIL-ROUTINE.
044100     IF     COMPUTED-X NOT EQUAL TO SPACE
044200            GO TO FAIL-ROUTINE-WRITE.
044300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
044400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
044500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
044600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044700     MOVE   SPACES TO INF-ANSI-REFERENCE.
044800     GO TO  FAIL-ROUTINE-EX.
044900 FAIL-ROUTINE-WRITE.
045000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
045100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
045200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
045300     MOVE   SPACES TO COR-ANSI-REFERENCE.
045400 FAIL-ROUTINE-EX. EXIT.
045500 BAIL-OUT.
045600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
045700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
045800 BAIL-OUT-WRITE.
045900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
046000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046200     MOVE   SPACES TO INF-ANSI-REFERENCE.
046300 BAIL-OUT-EX. EXIT.
046400 CCVS1-EXIT.
046500     EXIT.
046600 SECT-NC119A-001 SECTION.
046700 SUB-INIT-GF-1.
046800     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
046900     PERFORM END-ROUTINE.
047000     MOVE "SUBTRACT" TO FEATURE.
047100     MOVE    1 TO N-5.
047200 SUB-TEST-GF-1-0.
047300     SUBTRACT 1 FROM N-5.
047400 SUB-TEST-GF-1-1.
047500     IF       N-5 EQUAL TO 0
047600              PERFORM PASS
047700              GO TO SUB-WRITE-GF-1.
047800     GO TO    SUB-FAIL-GF-1.
047900 SUB-DELETE-GF-1.
048000     PERFORM  DE-LETE.
048100     GO TO    SUB-WRITE-GF-1.
048200 SUB-FAIL-GF-1.
048300     MOVE     N-5 TO COMPUTED-N.
048400     MOVE     0 TO CORRECT-N.
048500     PERFORM  FAIL.
048600 SUB-WRITE-GF-1.
048700     MOVE "SUB-TEST-GF-1 " TO PAR-NAME.
048800     PERFORM  PRINT-DETAIL.
048900 SUB-INIT-GF-2.
049000     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
049100     MOVE     A18TWOS-DS-LS-18V00 TO WRK-DS-T-18V00.
049200 SUB-TEST-GF-2-0.
049300     SUBTRACT A18ONES-DS-TS-18V00 FROM WRK-DS-T-18V00.
049400 SUB-TEST-GF-2-1.
049500     IF       WRK-DS-T-18V00 EQUAL TO 111111111111111111
049600              PERFORM PASS GO TO SUB-WRITE-GF-2.
049700     GO       TO SUB-FAIL-GF-2.
049800 SUB-DELETE-GF-2.
049900     PERFORM  DE-LETE.
050000     GO       TO SUB-WRITE-GF-2.
050100 SUB-FAIL-GF-2.
050200     MOVE     WRK-DS-T-18V00    TO COMPUTED-18V0.
050300     MOVE     111111111111111111 TO CORRECT-18V0.
050400     PERFORM  FAIL.
050500 SUB-WRITE-GF-2.
050600     MOVE     "SUB-TEST-GF-2" TO PAR-NAME.
050700     PERFORM  PRINT-DETAIL.
050800 SUB-INIT-GF-3.
050900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
051000     MOVE     A12THREES-DS-06V06 TO WRK-DS-TS-06V06.
051100 SUB-TEST-GF-3-0.
051200     SUBTRACT A05ONES-DS-L-05V00
051300              A05ONES-DS-LS-00V05
051400              A06ONES-DS-TS-03V03 FROM WRK-DS-TS-06V06.
051500 SUB-TEST-GF-3-1.
051600     IF       WRK-DS-TS-06V06 EQUAL TO 322111.111223
051700              PERFORM PASS GO TO SUB-WRITE-GF-3.
051800     GO       TO SUB-FAIL-GF-3.
051900 SUB-DELETE-GF-3.
052000     PERFORM  DE-LETE.
052100     GO       TO SUB-WRITE-GF-3.
052200 SUB-FAIL-GF-3.
052300     MOVE     WRK-DS-TS-06V06 TO COMPUTED-N.
052400     MOVE     322111.111223 TO CORRECT-N.
052500     PERFORM  FAIL.
052600 SUB-WRITE-GF-3.
052700     MOVE     "SUB-TEST-GF-3" TO PAR-NAME.
052800     PERFORM  PRINT-DETAIL.
052900 SUB-INIT-GF-13.
053000     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
053100     MOVE     "  GIVING" TO FEATURE.
053200     MOVE     ZERO TO WRK-DS-09V09.
053300 SUB-TEST-GF-13-0.
053400     SUBTRACT A06THREES-DS-03V03 FROM A12THREES-DS-06V06
053500              GIVING WRK-DS-TS-06V06.
053600 SUB-TEST-GF-13-1.
053700     IF       WRK-DS-TS-06V06 EQUAL TO 333000.000333
053800              PERFORM PASS GO TO SUB-WRITE-GF-13.
053900     GO       TO SUB-FAIL-GF-13.
054000 SUB-DELETE-GF-13.
054100     PERFORM  DE-LETE.
054200     GO       TO SUB-WRITE-GF-13.
054300 SUB-FAIL-GF-13.
054400     MOVE     WRK-DS-TS-06V06 TO COMPUTED-N.
054500     MOVE     333000.000333 TO CORRECT-N.
054600     PERFORM  FAIL.
054700 SUB-WRITE-GF-13.
054800     MOVE     "SUB-TEST-GF-13" TO PAR-NAME.
054900     PERFORM  PRINT-DETAIL.
055000 SUB-INIT-GF-14.
055100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
055200     MOVE     ZERO TO WRK-DS-TS-06V06.
055300 SUB-TEST-GF-14.
055400     SUBTRACT A05ONES-DS-L-05V00
055500              A05ONES-DS-LS-00V05
055600              A12THREES-DS-06V06
055700              A06THREES-DS-03V03 FROM ZERO GIVING WRK-DS-TS-06V06.
055800     IF       WRK-DS-TS-06V06 EQUAL TO -344777.777443
055900              PERFORM PASS GO TO SUB-WRITE-GF-14.
056000     GO       TO SUB-FAIL-GF-14.
056100 SUB-DELETE-GF-14.
056200     PERFORM  DE-LETE.
056300     GO       TO SUB-WRITE-GF-14.
056400 SUB-FAIL-GF-14.
056500     MOVE     WRK-DS-TS-06V06 TO COMPUTED-N.
056600     MOVE     -344777.777443 TO CORRECT-N.
056700     PERFORM  FAIL.
056800 SUB-WRITE-GF-14.
056900     MOVE     "SUB-TEST-GF-14" TO PAR-NAME.
057000     PERFORM  PRINT-DETAIL.
057100 SUB-INIT-GF-4.
057200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
057300     MOVE     "  ROUNDED" TO FEATURE.
057400     MOVE     ZERO TO WRK-DS-TS-0201P.
057500 SUB-TEST-GF-4-0.
057600     SUBTRACT A99-DS-T-02V00 FROM WRK-DS-TS-0201P ROUNDED.
057700 SUB-TEST-GF-4-1.
057800     IF       WRK-DS-TS-0201P EQUAL TO -100
057900              PERFORM PASS GO TO SUB-WRITE-GF-4.
058000     GO       TO SUB-FAIL-GF-4.
058100 SUB-DELETE-GF-4.
058200     PERFORM  DE-LETE.
058300     GO       TO SUB-WRITE-GF-4.
058400 SUB-FAIL-GF-4.
058500     MOVE     WRK-DS-TS-0201P TO COMPUTED-N.
058600     MOVE    -100 TO CORRECT-N.
058700     PERFORM  FAIL.
058800 SUB-WRITE-GF-4.
058900     MOVE     "SUB-TEST-GF-4" TO PAR-NAME.
059000     PERFORM  PRINT-DETAIL.
059100 SUB-INIT-GF-15.
059200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
059300     MOVE     -099999.999999 TO WRK-DS-TS-06V06.
059400     MOVE    ZERO TO WRK-DS-06V00.
059500 SUB-TEST-GF-15-0.
059600     SUBTRACT A05ONES-DS-L-05V00
059700              -11111
059800              AZERO-DS-LS-05V05 FROM WRK-DS-TS-06V06
059900              GIVING WRK-DS-06V00 ROUNDED.
060000 SUB-TEST-GF-15-1.
060100     IF       WRK-DS-06V00 EQUAL TO -100000
060200              PERFORM PASS GO TO SUB-WRITE-GF-15.
060300     GO       TO SUB-FAIL-GF-15.
060400 SUB-DELETE-GF-15.
060500     PERFORM  DE-LETE.
060600     GO       TO SUB-WRITE-GF-15.
060700 SUB-FAIL-GF-15.
060800     MOVE     WRK-DS-06V00 TO COMPUTED-N.
060900     MOVE    -100000 TO CORRECT-N.
061000     PERFORM  FAIL.
061100 SUB-WRITE-GF-15.
061200     MOVE     "SUB-TEST-GF-15" TO PAR-NAME.
061300     PERFORM  PRINT-DETAIL.
061400 SUB-INIT-GF-5-1.
061500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
061600     MOVE     "  SIZE ERROR" TO FEATURE.
061700     MOVE     -11 TO WRK-DS-02V00.
061800 SUB-TEST-GF-5-1-0.
061900     SUBTRACT A99-DS-T-02V00 FROM WRK-DS-02V00 ON SIZE ERROR
062000              PERFORM PASS GO TO SUB-WRITE-GF-5-1.
062100     GO       TO SUB-FAIL-GF-5-1.
062200 SUB-DELETE-GF-5-1.
062300     PERFORM  DE-LETE.
062400     GO       TO SUB-WRITE-GF-5-1.
062500 SUB-FAIL-GF-5-1.
062600     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
062700     PERFORM  FAIL.
062800 SUB-WRITE-GF-5-1.
062900     MOVE     "SUB-TEST-GF-5-1" TO PAR-NAME.
063000     PERFORM  PRINT-DETAIL.
063100 SUB-TEST-GF-5-2.
063200     IF       WRK-DS-02V00 EQUAL TO -11
063300              PERFORM PASS GO TO SUB-WRITE-GF-5-2.
063400*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-GF-5-1
063500     GO       TO SUB-FAIL-GF-5-2.
063600 SUB-DELETE-GF-5-2.
063700     PERFORM  DE-LETE.
063800     GO       TO SUB-WRITE-GF-5-2.
063900 SUB-FAIL-GF-5-2.
064000     MOVE     WRK-DS-02V00 TO COMPUTED-N.
064100     MOVE     -11 TO CORRECT-N.
064200     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
064300     PERFORM  FAIL.
064400 SUB-WRITE-GF-5-2.
064500     MOVE     "SUB-TEST-GF-5-2" TO PAR-NAME.
064600     PERFORM  PRINT-DETAIL.
064700 SUB-INIT-GF-16-1.
064800     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
064900     MOVE     ZERO TO WRK-DS-10V00.
065000 SUB-TEST-GF-16-1-0.
065100     SUBTRACT A12ONES-DS-L-12V00
065200              FROM ZERO GIVING WRK-DS-10V00 ON SIZE ERROR
065300              PERFORM PASS GO TO SUB-WRITE-GF-16-1.
065400     GO       TO SUB-FAIL-GF-16-1.
065500 SUB-DELETE-GF-16-1.
065600     PERFORM  DE-LETE.
065700     GO       TO SUB-WRITE-GF-16-1.
065800 SUB-FAIL-GF-16-1.
065900     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
066000     PERFORM  FAIL.
066100 SUB-WRITE-GF-16-1.
066200     MOVE     "SUB-TEST-GF-16-1" TO PAR-NAME.
066300     PERFORM  PRINT-DETAIL.
066400 SUB-TEST-GF-16-2.
066500     IF       WRK-DS-10V00 EQUAL TO ZERO
066600              PERFORM PASS GO TO SUB-WRITE-GF-16-2.
066700*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF ADD-TEST-GF-16-1
066800     GO       TO SUB-FAIL-GF-16-2.
066900 SUB-DELETE-GF-16-2.
067000     PERFORM  DE-LETE.
067100     GO       TO SUB-WRITE-GF-16-2.
067200 SUB-FAIL-GF-16-2.
067300     MOVE     WRK-DS-10V00 TO COMPUTED-14V4.
067400     MOVE     ZERO TO CORRECT-14V4.
067500     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
067600     PERFORM  FAIL.
067700 SUB-WRITE-GF-16-2.
067800     MOVE     "SUB-TEST-GF-16-2" TO PAR-NAME.
067900     PERFORM  PRINT-DETAIL.
068000 SUB-INIT-GF-17-1.
068100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
068200     MOVE     "  ROUNDED,SIZE ERROR" TO FEATURE.
068300     MOVE     ZERO TO WRK-DS-T-05V00.
068400 SUB-TEST-GF-17-1-0.
068500     SUBTRACT 33333
068600              A06THREES-DS-03V03
068700              A12THREES-DS-06V06
068800              FROM WRK-DS-T-05V00 ROUNDED ON SIZE ERROR
068900              PERFORM PASS GO TO SUB-WRITE-GF-17-1.
069000     GO       TO SUB-FAIL-GF-17-1.
069100 SUB-DELETE-GF-17-1.
069200     PERFORM  DE-LETE.
069300     GO       TO SUB-WRITE-GF-17-1.
069400 SUB-FAIL-GF-17-1.
069500     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
069600     PERFORM  FAIL.
069700 SUB-WRITE-GF-17-1.
069800     MOVE     "SUB-TEST-GF-17-1" TO PAR-NAME.
069900     PERFORM  PRINT-DETAIL.
070000 SUB-TEST-GF-17-2.
070100     IF       WRK-DS-T-05V00 EQUAL TO ZERO
070200              PERFORM PASS GO TO SUB-WRITE-GF-17-2.
070300*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-GF-17-1
070400     GO       TO SUB-FAIL-GF-17-2.
070500 SUB-DELETE-GF-17-2.
070600     PERFORM  DE-LETE.
070700     GO       TO SUB-WRITE-GF-17-2.
070800 SUB-FAIL-GF-17-2.
070900     MOVE     WRK-DS-T-05V00 TO COMPUTED-N.
071000     MOVE     ZERO TO CORRECT-N.
071100     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
071200     PERFORM  FAIL.
071300 SUB-WRITE-GF-17-2.
071400     MOVE     "SUB-TEST-GF-17-2" TO PAR-NAME.
071500     PERFORM  PRINT-DETAIL.
071600 SUB-INIT-GF-6-1.
071700     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
071800     MOVE     ZERO TO WRK-DS-TS-06V06.
071900 SUB-TEST-GF-6-1.
072000     SUBTRACT A12THREES-DS-06V06
072100              333333
072200              A06THREES-DS-03V03
072300              -0000009
072400              FROM WRK-DS-TS-06V06 ROUNDED ON SIZE ERROR
072500              GO TO SUB-FAIL-GF-6-1.
072600     PERFORM  PASS.
072700     GO       TO SUB-WRITE-GF-6-1.
072800 SUB-DELETE-GF-6-1.
072900     PERFORM  DE-LETE.
073000     GO       TO SUB-WRITE-GF-6-1.
073100 SUB-FAIL-GF-6-1.
073200     MOVE     "SIZE ERR SHOULD NOT EXECUTE" TO RE-MARK.
073300     PERFORM  FAIL.
073400 SUB-WRITE-GF-6-1.
073500     MOVE     "SUB-TEST-GF-6-1" TO PAR-NAME.
073600     PERFORM  PRINT-DETAIL.
073700 SUB-TEST-GF-6-2.
073800     IF       WRK-DS-TS-06V06 EQUAL TO -666990.666333
073900              PERFORM PASS GO TO SUB-WRITE-GF-6-2.
074000*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-GF-6-1
074100     GO       TO SUB-FAIL-GF-6-2.
074200 SUB-DELETE-GF-6-2.
074300     PERFORM  DE-LETE.
074400     GO       TO SUB-WRITE-GF-6-2.
074500 SUB-FAIL-GF-6-2.
074600     MOVE     WRK-DS-TS-06V06 TO COMPUTED-N.
074700     MOVE     -666990.666333 TO CORRECT-N.
074800     PERFORM  FAIL.
074900 SUB-WRITE-GF-6-2.
075000     MOVE     "SUB-TEST-GF-6-2" TO PAR-NAME.
075100     PERFORM  PRINT-DETAIL.
075200 SUB-INIT-GF-18-1.
075300     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
075400     MOVE ZERO TO WRK-DS-T-05V00.
075500 SUB-TEST-GF-18-1.
075600     SUBTRACT 33333
075700              A06THREES-DS-03V03
075800              A12THREES-DS-06V06
075900              FROM -1000000 GIVING WRK-DS-T-05V00
076000              ROUNDED ON SIZE ERROR
076100              PERFORM PASS GO TO SUB-WRITE-GF-18-1.
076200     GO       TO SUB-FAIL-GF-18-1.
076300 SUB-DELETE-GF-18-1.
076400     PERFORM  DE-LETE.
076500     GO       TO SUB-WRITE-GF-18-1.
076600 SUB-FAIL-GF-18-1.
076700     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
076800     PERFORM  FAIL.
076900 SUB-WRITE-GF-18-1.
077000     MOVE     "SUB-TEST-GF-18-1" TO PAR-NAME.
077100     PERFORM  PRINT-DETAIL.
077200 SUB-TEST-GF-18-2.
077300     IF       WRK-DS-T-05V00 EQUAL TO ZERO
077400              PERFORM PASS GO TO SUB-WRITE-GF-18-2.
077500*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-GF-18-1
077600     GO       TO SUB-FAIL-GF-18-2.
077700 SUB-DELETE-GF-18-2.
077800     PERFORM  DE-LETE.
077900     GO       TO SUB-WRITE-GF-18-2.
078000 SUB-FAIL-GF-18-2.
078100     MOVE     WRK-DS-T-05V00 TO COMPUTED-N.
078200     MOVE     ZERO TO CORRECT-N.
078300     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
078400     PERFORM  FAIL.
078500 SUB-WRITE-GF-18-2.
078600     MOVE     "SUB-TEST-GF-18-2" TO PAR-NAME.
078700     PERFORM  PRINT-DETAIL.
078800 SUB-INIT-GF-19-1.
078900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
079000     MOVE     ZERO TO WRK-DS-TS-06V06.
079100 SUB-TEST-GF-19-1.
079200     SUBTRACT A12THREES-DS-06V06
079300              333333
079400              A06THREES-DS-03V03
079500              -.0000009 FROM 0000000
079600              GIVING WRK-DS-TS-06V06 ROUNDED ON SIZE ERROR
079700              GO TO SUB-FAIL-GF-19-1.
079800     PERFORM  PASS.
079900     GO       TO SUB-WRITE-GF-19-1.
080000 SUB-DELETE-GF-19-1.
080100     PERFORM  DE-LETE.
080200     GO       TO SUB-WRITE-GF-19-1.
080300 SUB-FAIL-GF-19-1.
080400     MOVE     "SIZE ERR SHOULD NOT EXECUTE" TO RE-MARK.
080500     PERFORM  FAIL.
080600 SUB-WRITE-GF-19-1.
080700     MOVE     "SUB-TEST-GF-19-1" TO PAR-NAME.
080800     PERFORM  PRINT-DETAIL.
080900 SUB-TEST-GF-19-2.
081000     IF       WRK-DS-TS-06V06 EQUAL TO -666999.666332
081100              PERFORM PASS GO TO SUB-WRITE-GF-19-2.
081200*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-19-1
081300     GO       TO SUB-FAIL-GF-19-2.
081400 SUB-DELETE-GF-19-2.
081500     PERFORM  DE-LETE.
081600     GO       TO SUB-WRITE-GF-19-2.
081700 SUB-FAIL-GF-19-2.
081800     MOVE     WRK-DS-TS-06V06 TO COMPUTED-N.
081900     MOVE     -666999.666332 TO CORRECT-N.
082000     PERFORM  FAIL.
082100 SUB-WRITE-GF-19-2.
082200     MOVE     "SUB-TEST-GF-19-2" TO PAR-NAME.
082300     PERFORM  PRINT-DETAIL.
082400 SUB-INIT-GF-20.
082500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
082600     MOVE     "  SERIES" TO FEATURE.
082700     MOVE     ZERO TO WRK-DS-03V10.
082800 SUB-TEST-GF-20.
082900     SUBTRACT A99-DS-T-02V00
083000              A03ONES-DS-02V01
083100              A06ONES-DS-TS-03V03
083200              A08TWOS-DS-02V06
083300              -1.1111111
083400              +.11111111
083500              A01ONES-DS-LS-P0801 FROM 0000.000000
083600              GIVING WRK-DS-03V10.
083700     IF       WRK-DS-03V10 EQUAL TO -242.4332220110
083800              PERFORM PASS GO TO SUB-WRITE-GF-20.
083900     GO       TO SUB-FAIL-GF-20.
084000 SUB-DELETE-GF-20.
084100     PERFORM  DE-LETE.
084200     GO       TO SUB-WRITE-GF-20.
084300 SUB-FAIL-GF-20.
084400     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
084500     MOVE     -242.4332220110 TO CORRECT-4V14.
084600     PERFORM  FAIL.
084700 SUB-WRITE-GF-20.
084800     MOVE     "SUB-TEST-GF-20" TO PAR-NAME.
084900     PERFORM  PRINT-DETAIL.
085000 SUB-INIT-GF-21.
085100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
085200     MOVE     ZERO TO WRK-DS-03V10.
085300 SUB-TEST-GF-21-0.
085400     SUBTRACT A01ONES-DS-LS-P0801
085500              +.11111111
085600              -1.1111111
085700              A08TWOS-DS-02V06
085800              A06ONES-DS-TS-03V03
085900              A03ONES-DS-02V01
086000              A99-DS-T-02V00 FROM 0000.000000 GIVING WRK-DS-03V10.
086100 SUB-TEST-GF-21-1.
086200     IF       WRK-DS-03V10 EQUAL TO -242.4332220110
086300              PERFORM PASS GO TO SUB-WRITE-GF-21.
086400     GO       TO SUB-FAIL-GF-21.
086500 SUB-DELETE-GF-21.
086600     PERFORM  DE-LETE.
086700     GO       TO SUB-WRITE-GF-21.
086800 SUB-FAIL-GF-21.
086900     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
087000     MOVE     -242.4332220110 TO CORRECT-4V14.
087100     PERFORM  FAIL.
087200 SUB-WRITE-GF-21.
087300     MOVE     "SUB-TEST-GF-21" TO PAR-NAME.
087400     PERFORM  PRINT-DETAIL.
087500 SUB-INIT-GF-22.
087600     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
087700     MOVE     ZERO TO WRK-DS-03V10.
087800 SUB-TEST-GF-22-0.
087900     SUBTRACT A08TWOS-DS-02V06
088000              A99-DS-T-02V00
088100              -1.1111111
088200              A03ONES-DS-02V01
088300              A01ONES-DS-LS-P0801
088400              +.11111111
088500              A06ONES-DS-TS-03V03 FROM 0000.000000
088600              GIVING WRK-DS-03V10.
088700 SUB-TEST-GF-22-1.
088800     IF       WRK-DS-03V10 EQUAL TO -242.4332220110
088900              PERFORM PASS GO TO SUB-WRITE-GF-22.
089000     GO       TO SUB-FAIL-GF-22.
089100 SUB-DELETE-GF-22.
089200     PERFORM  DE-LETE.
089300     GO       TO SUB-WRITE-GF-22.
089400 SUB-FAIL-GF-22.
089500     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
089600     MOVE     -242.4332220110 TO CORRECT-4V14.
089700     PERFORM  FAIL.
089800 SUB-WRITE-GF-22.
089900     MOVE     "SUB-TEST-GF-22" TO PAR-NAME.
090000     PERFORM  PRINT-DETAIL.
090100 SUB-INIT-GF-7.
090200     MOVE     "  COMP VS. DISPLAY" TO FEATURE.
090300     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
090400     MOVE     ZERO TO WRK-CS-18V00.
090500 SUB-TEST-GF-7-0.
090600     SUBTRACT A18ONES-DS-TS-18V00 FROM WRK-CS-18V00.
090700 SUB-TEST-GF-7-1.
090800     IF       WRK-CS-18V00 EQUAL TO -111111111111111111
090900              PERFORM PASS GO TO SUB-WRITE-GF-7.
091000     GO       TO SUB-FAIL-GF-7.
091100 SUB-DELETE-GF-7.
091200     PERFORM  DE-LETE.
091300     GO       TO SUB-WRITE-GF-7.
091400 SUB-FAIL-GF-7.
091500     MOVE     WRK-CS-18V00 TO COMPUTED-18V0.
091600     MOVE     -111111111111111111 TO CORRECT-18V0.
091700     PERFORM  FAIL.
091800 SUB-WRITE-GF-7.
091900     MOVE     "SUB-TEST-GF-7" TO PAR-NAME.
092000     PERFORM  PRINT-DETAIL.
092100 SUB-INIT-GF-8.
092200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
092300     MOVE     ZERO TO WRK-DS-T-18V00.
092400 SUB-TEST-GF-8-0.
092500     SUBTRACT A18ONES-CS-18V00 FROM WRK-DS-T-18V00.
092600 SUB-TEST-GF-8-1.
092700     IF       WRK-DS-T-18V00 EQUAL TO -111111111111111111
092800              PERFORM PASS GO TO SUB-WRITE-GF-8.
092900     GO       TO SUB-FAIL-GF-8.
093000 SUB-DELETE-GF-8.
093100     PERFORM  DE-LETE.
093200     GO       TO SUB-WRITE-GF-8.
093300 SUB-FAIL-GF-8.
093400     MOVE     WRK-DS-T-18V00 TO COMPUTED-18V0.
093500     MOVE     -111111111111111111 TO CORRECT-18V0.
093600     PERFORM  FAIL.
093700 SUB-WRITE-GF-8.
093800     MOVE     "SUB-TEST-GF-8" TO PAR-NAME.
093900     PERFORM  PRINT-DETAIL.
094000 SUB-INIT-GF-9.
094100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
094200     MOVE    1 TO SUBTR-1.
094300     MOVE   -1 TO SUBTR-3.
094400     MOVE   99 TO SUBTR-7.
094500 SUB-TEST-GF-9-0.
094600     SUBTRACT SUBTR-1 SUBTR-3 FROM SUBTR-7.
094700 SUB-TEST-GF-9-1.
094800     IF       SUBTR-7 EQUAL TO 99
094900              PERFORM PASS GO TO SUB-WRITE-GF-9.
095000     GO       TO SUB-FAIL-GF-9.
095100 SUB-DELETE-GF-9.
095200     PERFORM DE-LETE.
095300     GO       TO SUB-WRITE-GF-9.
095400 SUB-FAIL-GF-9.
095500     MOVE     SUBTR-7 TO COMPUTED-N.
095600     MOVE     99        TO CORRECT-N.
095700     PERFORM FAIL.
095800 SUB-WRITE-GF-9.
095900     MOVE     "SUB-TEST-GF-9" TO PAR-NAME.
096000     PERFORM PRINT-DETAIL.
096100 SUB-INIT-GF-10.
096200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
096300     MOVE  100 TO SUBTR-5.
096400     MOVE   -1 TO SUBTR-3.
096500     MOVE  100 TO SUBTR-10.
096600 SUB-TEST-GF-10-0.
096700     SUBTRACT SUBTR-5 -98 SUBTR-3 -1 FROM SUBTR-10.
096800 SUB-TEST-GF-10-1.
096900     IF       SUBTR-10 EQUAL TO 100
097000              PERFORM PASS GO TO SUB-WRITE-GF-10.
097100     GO       TO SUB-FAIL-GF-10.
097200 SUB-DELETE-GF-10.
097300     PERFORM DE-LETE.
097400     GO       TO SUB-WRITE-GF-10.
097500 SUB-FAIL-GF-10.
097600     MOVE     SUBTR-10  TO COMPUTED-N.
097700     MOVE     100       TO CORRECT-N.
097800     PERFORM FAIL.
097900 SUB-WRITE-GF-10.
098000     MOVE     "SUB-TEST-GF-10" TO PAR-NAME.
098100     PERFORM PRINT-DETAIL.
098200 SUB-INIT-GF-23.
098300     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
098400     MOVE  100 TO SUBTR-5.
098500     MOVE .001 TO SUBTR-4.
098600     MOVE   99 TO SUBTR-2.
098700     MOVE    0 TO SUBTR-11.
098800 SUB-TEST-GF-23-0.
098900     SUBTRACT SUBTR-4 SUBTR-5 .499 FROM SUBTR-2 GIVING SUBTR-11.
099000 SUB-TEST-GF-23-1.
099100     IF       SUBTR-11 EQUAL TO -1.5
099200              PERFORM PASS GO TO SUB-WRITE-GF-23.
099300     GO       TO SUB-FAIL-GF-23.
099400 SUB-DELETE-GF-23.
099500     PERFORM DE-LETE.
099600     GO       TO SUB-WRITE-GF-23.
099700 SUB-FAIL-GF-23.
099800     MOVE     SUBTR-11  TO COMPUTED-N.
099900     MOVE     -1.5      TO CORRECT-N.
100000     PERFORM FAIL.
100100 SUB-WRITE-GF-23.
100200     MOVE     "SUB-TEST-GF-23" TO PAR-NAME.
100300     PERFORM PRINT-DETAIL.
100400 SUB-INIT-GF-11.
100500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
100600     MOVE    1 TO SUBTR-6.
100700     MOVE .001 TO SUBTR-4.
100800 SUB-TEST-GF-11-0.
100900     SUBTRACT SUBTR-4 FROM SUBTR-6 ROUNDED.
101000 SUB-TEST-GF-11-1.
101100     IF       SUBTR-6 EQUAL TO 1
101200              PERFORM PASS GO TO SUB-WRITE-GF-11.
101300     GO       TO SUB-FAIL-GF-11.
101400 SUB-DELETE-GF-11.
101500     PERFORM DE-LETE.
101600     GO       TO SUB-WRITE-GF-11.
101700 SUB-FAIL-GF-11.
101800     MOVE     SUBTR-6   TO COMPUTED-N.
101900     MOVE     1         TO CORRECT-N.
102000     PERFORM FAIL.
102100 SUB-WRITE-GF-11.
102200     MOVE     "SUB-TEST-GF-11" TO PAR-NAME.
102300     PERFORM PRINT-DETAIL.
102400 SUB-INIT-GF-12.
102500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
102600     MOVE -9.99 TO SUBTR-8.
102700 SUB-TEST-GF-12-0.
102800     SUBTRACT .01 FROM SUBTR-8 ON SIZE ERROR
102900              PERFORM PASS GO TO SUB-WRITE-GF-12-1.
103000     GO       TO SUB-FAIL-GF-12-1.
103100 SUB-DELETE-GF-12-1.
103200     PERFORM DE-LETE.
103300     GO       TO SUB-WRITE-GF-12-1.
103400 SUB-FAIL-GF-12-1.
103500     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
103600     PERFORM FAIL.
103700 SUB-WRITE-GF-12-1.
103800     MOVE     "SUB-TEST-GF-12-1" TO PAR-NAME.
103900     PERFORM PRINT-DETAIL.
104000 SUB-TEST-GF-12-2.
104100     IF       SUBTR-8 EQUAL TO -9.99
104200              PERFORM PASS GO TO SUB-WRITE-GF-12-2.
104300*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-GF-12-1
104400     GO       TO SUB-FAIL-GF-12-2.
104500 SUB-DELETE-GF-12-2.
104600     PERFORM DE-LETE.
104700     GO       TO SUB-WRITE-GF-12-2.
104800 SUB-FAIL-GF-12-2.
104900     MOVE     SUBTR-8   TO COMPUTED-N.
105000     MOVE     -9.99     TO CORRECT-N.
105100     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
105200     PERFORM FAIL.
105300 SUB-WRITE-GF-12-2.
105400     MOVE     "SUB-TEST-GF-12-2" TO PAR-NAME.
105500     PERFORM PRINT-DETAIL.
105600 SUB-INIT-GF-24.
105700     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
105800     MOVE    1  TO SUBTR-1.
105900     MOVE   -1  TO SUBTR-3.
106000     MOVE  100  TO SUBTR-5.
106100     MOVE   99  TO SUBTR-7.
106200 SUB-TEST-GF-24-1.
106300     SUBTRACT SUBTR-1 SUBTR-3 FROM SUBTR-5 GIVING SUBTR-7 ON
106400              SIZE ERROR
106500              PERFORM PASS GO TO SUB-WRITE-GF-24-1.
106600     GO       TO SUB-FAIL-GF-24-1.
106700 SUB-DELETE-GF-24-1.
106800     PERFORM DE-LETE.
106900     GO       TO SUB-WRITE-GF-24-1.
107000 SUB-FAIL-GF-24-1.
107100     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
107200     PERFORM FAIL.
107300 SUB-WRITE-GF-24-1.
107400     MOVE     "SUB-TEST-GF-24-1" TO PAR-NAME.
107500     PERFORM PRINT-DETAIL.
107600 SUB-TEST-GF-24-2.
107700     IF       SUBTR-7 EQUAL  TO 99
107800              PERFORM PASS GO TO SUB-WRITE-GF-24-2.
107900*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-GF-24-1
108000     GO       TO SUB-FAIL-GF-24-2.
108100 SUB-DELETE-GF-24-2.
108200     PERFORM DE-LETE.
108300     GO       TO SUB-WRITE-GF-24-2.
108400 SUB-FAIL-GF-24-2.
108500     MOVE     SUBTR-7   TO COMPUTED-N.
108600     MOVE      99       TO CORRECT-N.
108700     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
108800     PERFORM FAIL.
108900 SUB-WRITE-GF-24-2.
109000     MOVE     "SUB-TEST-GF-24-2" TO PAR-NAME.
109100     PERFORM PRINT-DETAIL.
109200 SUB-INIT-GF-25.
109300     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
109400     MOVE    -999999999999999999 TO MINUS-NAME1.
109500     MOVE    -999999999999999999 TO MINUS-NAME2.
109600     MOVE    +999999999999999999 TO PLUS-NAME1.
109700     MOVE    +999999999999999999 TO PLUS-NAME1.
109800     MOVE     +1 TO EVEN-NAME1.
109900     MOVE    0 TO WHOLE-FIELD.
110000     MOVE SPACE TO SIZE-ERR.
110100 SUB-TEST-GF-25-0.
110200     SUBTRACT MINUS-NAME1  MINUS-NAME2  -34  -1  PLUS-NAME1
110300         PLUS-NAME2  EVEN-NAME1  35 FROM EVEN-NAME1 GIVING
110400         WHOLE-FIELD
110500         ON SIZE ERROR  MOVE "1" TO SIZE-ERR.
110600 SUB-TEST-GF-25-1.
110700     IF WHOLE-FIELD EQUAL TO 0
110800         PERFORM PASS
110900         GO TO SUB-WRITE-GF-25-1.
111000     MOVE WHOLE-FIELD TO COMPUTED-18V0.
111100     MOVE 0 TO CORRECT-18V0.
111200     PERFORM FAIL.
111300     GO TO SUB-WRITE-GF-25-1.
111400 SUB-DELETE-GF-25-1.
111500     PERFORM DE-LETE.
111600 SUB-WRITE-GF-25-1.
111700     MOVE "SUB-TEST-GF-25-1" TO PAR-NAME.
111800     PERFORM PRINT-DETAIL.
111900 SUB-TEST-GF-25-2.
112000     IF SIZE-ERR EQUAL TO "1"
112100         PERFORM FAIL
112200         MOVE SPACE TO CORRECT-A
112300         MOVE 1 TO COMPUTED-A
112400         MOVE "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
112500         GO TO SUB-WRITE-GF-25-2.
112600     PERFORM PASS.
112700     GO TO SUB-WRITE-GF-25-2.
112800 SUB-DELETE-GF-25-2.
112900     PERFORM DE-LETE.
113000 SUB-WRITE-GF-25-2.
113100     MOVE "SUB-TEST-GF-25-2" TO PAR-NAME.
113200     PERFORM PRINT-DETAIL.
113300 SUB-INIT-GF-26.
113400     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
113500     MOVE SPACE TO SIZE-ERR.
113600     MOVE   -.999999999999999999 TO MINUS-NAME3.
113700     MOVE   -.999999999999999999 TO MINUS-NAME4.
113800     MOVE   +.999999999999999999 TO PLUS-NAME3.
113900     MOVE   +.999999999999999999 TO PLUS-NAME4.
114000     MOVE   +1 TO EVEN-NAME2.
114100     MOVE    0 TO DECMAL-FIELD.
114200 SUB-TEST-GF-26-0.
114300     SUBTRACT MINUS-NAME3  MINUS-NAME4  -.34  -.01  PLUS-NAME3
114400         PLUS-NAME4  EVEN-NAME2  .35 FROM EVEN-NAME2
114500         GIVING DECMAL-FIELD
114600         ON SIZE ERROR  MOVE "1" TO SIZE-ERR.
114700 SUB-TEST-GF-26-1.
114800     IF DECMAL-FIELD EQUAL TO .0
114900         PERFORM PASS
115000         GO TO SUB-WRITE-GF-26-1.
115100     MOVE DECMAL-FIELD TO COMPUTED-0V18.
115200     MOVE .0 TO CORRECT-0V18.
115300     PERFORM FAIL.
115400     GO TO SUB-WRITE-GF-26-1.
115500 SUB-DELETE-GF-26-1.
115600     PERFORM DE-LETE.
115700 SUB-WRITE-GF-26-1.
115800     MOVE "SUB-TEST-GF-26-1" TO PAR-NAME.
115900     PERFORM PRINT-DETAIL.
116000 SUB-TEST-GF-26-2.
116100     IF SIZE-ERR EQUAL TO "1"
116200         PERFORM FAIL
116300         MOVE SPACE TO CORRECT-A
116400         MOVE 1 TO COMPUTED-A
116500         MOVE "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
116600         GO TO SUB-WRITE-GF-26-2.
116700     PERFORM PASS.
116800     GO TO SUB-WRITE-GF-26-2.
116900 SUB-DELETE-GF-26-2.
117000     PERFORM DE-LETE.
117100 SUB-WRITE-GF-26-2.
117200     MOVE "SUB-TEST-GF-26-2" TO PAR-NAME.
117300     PERFORM PRINT-DETAIL.
117400 CCVS-EXIT SECTION.
117500 CCVS-999999.
117600     GO TO CLOSE-FILES.
