000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC117A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*      PROGRAM NC117A TESTS THE USE OF THE "SIGN" CLAUSE USING
002300*      THE "DIVIDE" STATEMENT.  ALL COMBINATIONS OF THE "SIGN"
002400*      CLAUSE PHRASES ARE TESTED USING DATA ITEMS OF
002500*      LENGTHS.
002600*
002700*
002800
002900
003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.
003300     XXXXX082.
003400 OBJECT-COMPUTER.
003500     XXXXX083.
003600 INPUT-OUTPUT SECTION.
003700 FILE-CONTROL.
003800     SELECT PRINT-FILE ASSIGN TO
003900     XXXXX055.
004000 DATA DIVISION.
004100 FILE SECTION.
004200 FD  PRINT-FILE.
004300 01  PRINT-REC PICTURE X(120).
004400 01  DUMMY-RECORD PICTURE X(120).
004500 WORKING-STORAGE SECTION.
004600 77  WRK-DS-LS-18V00                PICTURE S9(18)
004700           SIGN IS LEADING SEPARATE CHARACTER.
004800 77  A06THREES-DS-LS-03V03          PICTURE S999V999 VALUE 333.333
004900           SIGN IS LEADING.
005000 77  WRK-DS-TS-06V06                PICTURE S9(6)V9(6)
005100           SIGN IS TRAILING SEPARATE CHARACTER.
005200 77  WRK-DS-TS-12V00-S-S REDEFINES WRK-DS-TS-06V06 PICTURE S9(12)
005300           SIGN TRAILING SEPARATE.
005400 77  A08TWOS-DS-02V06            PICTURE S99V9(6) VALUE 22.222222.
005500 77  WRK-DS-10V00                PICTURE S9(10).
005600 77  WRK-XN-00001                PICTURE X.
005700 77  A10ONES-DS-T-10V00            PICTURE S9(10)
005800         SIGN IS TRAILING
005900                                 VALUE 1111111111.
006000 77  A12THREES-DS-LS-06V06          PICTURE S9(6)V9(6)
006100             SIGN IS LEADING SEPARATE
006200                                 VALUE 333333.333333.
006300 77  WRK-DS-02V00                PICTURE S99.
006400 77  AZERO-DS-LS-05V05              PICTURE S9(5)V9(5) VALUE ZERO
006500           SIGN IS LEADING SEPARATE CHARACTER.
006600 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
006700 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09 PICTURE S9(18).
006800 77  A05ONES-DS-LS-00V05            PICTURE SV9(5) VALUE .11111
006900           SIGN IS LEADING SEPARATE CHARACTER.
007000 77  A12ONES-DS-12V00            PICTURE S9(12)
007100                                 VALUE 111111111111.
007200 77  A01ONE-DS-TS-P0801            PICTURE SP(8)9 VALUE .000000001
007300            SIGN IS TRAILING SEPARATE.
007400 77  WRK-DS-T-09V08                PICTURE S9(9)V9(8)
007500           SIGN IS TRAILING.
007600 77  WKR-DS-T-17V00-S REDEFINES WRK-DS-T-09V08 PICTURE S9(17)
007700         SIGN TRAILING.
007800 77  A18ONES-DS-18V00            PICTURE S9(18)
007900                                 VALUE 111111111111111111.
008000 77  WRK-DS-LS-0201P                PICTURE S99P
008100            SIGN IS LEADING SEPARATE.
008200 77  WRK-CS-18V00                PICTURE S9(18) COMPUTATIONAL.
008300 77  WRK-DU-18V00                PICTURE 9(18).
008400 77  A99-CS-02V00                PICTURE S99 COMPUTATIONAL
008500                                 VALUE 99.
008600 77  A01ONE-CS-00V01             PICTURE SV9 COMPUTATIONAL
008700                                 VALUE .1.
008800 77  A99-DS-02V00                PICTURE S99   VALUE 99.
008900 77  WRK-DS-TS-12V00-S           PICTURE S9(12)
009000             SIGN IS TRAILING SEPARATE CHARACTER.
009100 77  WRK-DS-LS-01V00             PICTURE S9 LEADING SEPARATE.
009200 77  WRK-DS-03V10                PICTURE S9(3)V9(10).
009300 77  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
009400             LEADING SEPARATE
009500                                 VALUE 111111111.111111111.
009600 77  A02TWOS-DU-02V00            PICTURE 99  VALUE 22.
009700 77  WRK-DS-05V00                PICTURE S9(5).
009800 77  A02TWOS-DS-03V02            PICTURE S999V99 VALUE +022.00.
009900 77  WRK-CS-02V02                PICTURE S99V99  COMPUTATIONAL.
010000 77  A990-DS-0201P               PICTURE S99P   VALUE +990.
010100 77  XRAY                        PICTURE X.
010200 77  A01ONES-CS-18V00   PICTURE S9(18) COMPUTATIONAL
010300             VALUE +000000000000000001.
010400 77  A02THREES-CS-18V00 PICTURE S9(18) COMPUTATIONAL
010500             VALUE -000000000000000033.
010600 77  A18SIXES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
010700             VALUE 666666666666666666.
010800 77  A16NINES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
010900             VALUE 009999999999999999.
011000 77  A14TWOS-CU-18V00   PICTURE 9(18) COMPUTATIONAL
011100             VALUE 000022222222222222.
011200 01  MULTIPLY-DATA LEADING SEPARATE.
011300     02 MULT1                           PICTURE IS 999V99
011400     VALUE IS 80.12.
011500     02 MULT2                           PICTURE IS 999V999.
011600     02 MULT3                           PICTURE IS $$99.99.
011700     02 MULT4                           PICTURE IS S99
011800     VALUE IS -56.
011900     02 MULT5                           PICTURE IS 9 VALUE IS 4.
012000     02 MULT6                           PICTURE IS 99 VALUE IS
012100     20.
012200 01  DIVIDE-DATA TRAILING SEPARATE.
012300     02 DIV1                            PICTURE IS 9(4)V99
012400     VALUE IS 1620.36.
012500     02 DIV2                            PICTURE IS 99V9
012600     VALUE IS 44.1.
012700     02 DIV3                            PICTURE IS 9(4)V9
012800     VALUE IS 1661.7.
012900     02 DIV4                            PICTURE IS S9V999
013000     VALUE IS -9.642.
013100     02 SIG-02LEVEL-1.
013200     03 DIV5                            PICTURE IS V99
013300     VALUE IS .82.
013400     03 DIV6                            PICTURE IS 9 VALUE IS 0.
013500     03 DIV7                            PICTURE IS 9V9
013600     VALUE IS 9.6.
013700 01  SIG-DATA-2.
013800     02 DIV8                            PICTURE IS 99V9.
013900     02 DIV9                            PICTURE IS ZZ,ZZZ.9.
014000     02 DIV10                           PICTURE IS V999.
014100 01  TEST-RESULTS.
014200     02 FILLER                   PIC X      VALUE SPACE.
014300     02 FEATURE                  PIC X(20)  VALUE SPACE.
014400     02 FILLER                   PIC X      VALUE SPACE.
014500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
014600     02 FILLER                   PIC X      VALUE SPACE.
014700     02  PAR-NAME.
014800       03 FILLER                 PIC X(19)  VALUE SPACE.
014900       03  PARDOT-X              PIC X      VALUE SPACE.
015000       03 DOTVALUE               PIC 99     VALUE ZERO.
015100     02 FILLER                   PIC X(8)   VALUE SPACE.
015200     02 RE-MARK                  PIC X(61).
015300 01  TEST-COMPUTED.
015400     02 FILLER                   PIC X(30)  VALUE SPACE.
015500     02 FILLER                   PIC X(17)  VALUE
015600            "       COMPUTED=".
015700     02 COMPUTED-X.
015800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
015900     03 COMPUTED-N               REDEFINES COMPUTED-A
016000                                 PIC -9(9).9(9).
016100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
016200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
016300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
016400     03       CM-18V0 REDEFINES COMPUTED-A.
016500         04 COMPUTED-18V0                    PIC -9(18).
016600         04 FILLER                           PIC X.
016700     03 FILLER PIC X(50) VALUE SPACE.
016800 01  TEST-CORRECT.
016900     02 FILLER PIC X(30) VALUE SPACE.
017000     02 FILLER PIC X(17) VALUE "       CORRECT =".
017100     02 CORRECT-X.
017200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
017300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
017400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
017500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
017600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
017700     03      CR-18V0 REDEFINES CORRECT-A.
017800         04 CORRECT-18V0                     PIC -9(18).
017900         04 FILLER                           PIC X.
018000     03 FILLER PIC X(2) VALUE SPACE.
018100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
018200 01  CCVS-C-1.
018300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
018400-    "SS  PARAGRAPH-NAME
018500-    "       REMARKS".
018600     02 FILLER                     PIC X(20)    VALUE SPACE.
018700 01  CCVS-C-2.
018800     02 FILLER                     PIC X        VALUE SPACE.
018900     02 FILLER                     PIC X(6)     VALUE "TESTED".
019000     02 FILLER                     PIC X(15)    VALUE SPACE.
019100     02 FILLER                     PIC X(4)     VALUE "FAIL".
019200     02 FILLER                     PIC X(94)    VALUE SPACE.
019300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
019400 01  REC-CT                        PIC 99       VALUE ZERO.
019500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
019600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
019700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
019800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
019900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
020000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
020100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
020200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
020300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
020400 01  CCVS-H-1.
020500     02  FILLER                    PIC X(39)    VALUE SPACES.
020600     02  FILLER                    PIC X(42)    VALUE
020700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
020800     02  FILLER                    PIC X(39)    VALUE SPACES.
020900 01  CCVS-H-2A.
021000   02  FILLER                        PIC X(40)  VALUE SPACE.
021100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
021200   02  FILLER                        PIC XXXX   VALUE
021300     "4.2 ".
021400   02  FILLER                        PIC X(28)  VALUE
021500            " COPY - NOT FOR DISTRIBUTION".
021600   02  FILLER                        PIC X(41)  VALUE SPACE.
021700
021800 01  CCVS-H-2B.
021900   02  FILLER                        PIC X(15)  VALUE
022000            "TEST RESULT OF ".
022100   02  TEST-ID                       PIC X(9).
022200   02  FILLER                        PIC X(4)   VALUE
022300            " IN ".
022400   02  FILLER                        PIC X(12)  VALUE
022500     " HIGH       ".
022600   02  FILLER                        PIC X(22)  VALUE
022700            " LEVEL VALIDATION FOR ".
022800   02  FILLER                        PIC X(58)  VALUE
022900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
023000 01  CCVS-H-3.
023100     02  FILLER                      PIC X(34)  VALUE
023200            " FOR OFFICIAL USE ONLY    ".
023300     02  FILLER                      PIC X(58)  VALUE
023400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
023500     02  FILLER                      PIC X(28)  VALUE
023600            "  COPYRIGHT   1985 ".
023700 01  CCVS-E-1.
023800     02 FILLER                       PIC X(52)  VALUE SPACE.
023900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
024000     02 ID-AGAIN                     PIC X(9).
024100     02 FILLER                       PIC X(45)  VALUE SPACES.
024200 01  CCVS-E-2.
024300     02  FILLER                      PIC X(31)  VALUE SPACE.
024400     02  FILLER                      PIC X(21)  VALUE SPACE.
024500     02 CCVS-E-2-2.
024600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
024700         03 FILLER                   PIC X      VALUE SPACE.
024800         03 ENDER-DESC               PIC X(44)  VALUE
024900            "ERRORS ENCOUNTERED".
025000 01  CCVS-E-3.
025100     02  FILLER                      PIC X(22)  VALUE
025200            " FOR OFFICIAL USE ONLY".
025300     02  FILLER                      PIC X(12)  VALUE SPACE.
025400     02  FILLER                      PIC X(58)  VALUE
025500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025600     02  FILLER                      PIC X(13)  VALUE SPACE.
025700     02 FILLER                       PIC X(15)  VALUE
025800             " COPYRIGHT 1985".
025900 01  CCVS-E-4.
026000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
026100     02 FILLER                       PIC X(4)   VALUE " OF ".
026200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
026300     02 FILLER                       PIC X(40)  VALUE
026400      "  TESTS WERE EXECUTED SUCCESSFULLY".
026500 01  XXINFO.
026600     02 FILLER                       PIC X(19)  VALUE
026700            "*** INFORMATION ***".
026800     02 INFO-TEXT.
026900       04 FILLER                     PIC X(8)   VALUE SPACE.
027000       04 XXCOMPUTED                 PIC X(20).
027100       04 FILLER                     PIC X(5)   VALUE SPACE.
027200       04 XXCORRECT                  PIC X(20).
027300     02 INF-ANSI-REFERENCE           PIC X(48).
027400 01  HYPHEN-LINE.
027500     02 FILLER  PIC IS X VALUE IS SPACE.
027600     02 FILLER  PIC IS X(65)    VALUE IS "************************
027700-    "*****************************************".
027800     02 FILLER  PIC IS X(54)    VALUE IS "************************
027900-    "******************************".
028000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
028100     "NC117A".
028200 PROCEDURE DIVISION.
028300 CCVS1 SECTION.
028400 OPEN-FILES.
028500     OPEN     OUTPUT PRINT-FILE.
028600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
028700     MOVE    SPACE TO TEST-RESULTS.
028800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028900     GO TO CCVS1-EXIT.
029000 CLOSE-FILES.
029100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029200 TERMINATE-CCVS.
029300S    EXIT PROGRAM.
029400STERMINATE-CALL.
029500     STOP     RUN.
029600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
030000     MOVE "****TEST DELETED****" TO RE-MARK.
030100 PRINT-DETAIL.
030200     IF REC-CT NOT EQUAL TO ZERO
030300             MOVE "." TO PARDOT-X
030400             MOVE REC-CT TO DOTVALUE.
030500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
031000     MOVE SPACE TO CORRECT-X.
031100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
031200     MOVE     SPACE TO RE-MARK.
031300 HEAD-ROUTINE.
031400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031800 COLUMN-NAMES-ROUTINE.
031900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
032200 END-ROUTINE.
032300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
032400 END-RTN-EXIT.
032500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032600 END-ROUTINE-1.
032700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032900      ADD PASS-COUNTER TO ERROR-HOLD.
033000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
033100      MOVE PASS-COUNTER TO CCVS-E-4-1.
033200      MOVE ERROR-HOLD TO CCVS-E-4-2.
033300      MOVE CCVS-E-4 TO CCVS-E-2-2.
033400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033500  END-ROUTINE-12.
033600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033700     IF       ERROR-COUNTER IS EQUAL TO ZERO
033800         MOVE "NO " TO ERROR-TOTAL
033900         ELSE
034000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
034100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
034200     PERFORM WRITE-LINE.
034300 END-ROUTINE-13.
034400     IF DELETE-COUNTER IS EQUAL TO ZERO
034500         MOVE "NO " TO ERROR-TOTAL  ELSE
034600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034900      IF   INSPECT-COUNTER EQUAL TO ZERO
035000          MOVE "NO " TO ERROR-TOTAL
035100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
035200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
035300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035500 WRITE-LINE.
035600     ADD 1 TO RECORD-COUNT.
035700Y    IF RECORD-COUNT GREATER 42
035800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035900Y        MOVE SPACE TO DUMMY-RECORD
036000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
036100Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
036200Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
036300Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
036400Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
036500Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
036600Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
036700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
036800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036900Y        MOVE ZERO TO RECORD-COUNT.
037000     PERFORM WRT-LN.
037100 WRT-LN.
037200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
037300     MOVE SPACE TO DUMMY-RECORD.
037400 BLANK-LINE-PRINT.
037500     PERFORM WRT-LN.
037600 FAIL-ROUTINE.
037700     IF     COMPUTED-X NOT EQUAL TO SPACE
037800            GO TO FAIL-ROUTINE-WRITE.
037900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
038200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038300     MOVE   SPACES TO INF-ANSI-REFERENCE.
038400     GO TO  FAIL-ROUTINE-EX.
038500 FAIL-ROUTINE-WRITE.
038600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
038700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
038800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038900     MOVE   SPACES TO COR-ANSI-REFERENCE.
039000 FAIL-ROUTINE-EX. EXIT.
039100 BAIL-OUT.
039200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
039300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
039400 BAIL-OUT-WRITE.
039500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
039600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
039700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039800     MOVE   SPACES TO INF-ANSI-REFERENCE.
039900 BAIL-OUT-EX. EXIT.
040000 CCVS1-EXIT.
040100     EXIT.
040200 SECT-NC117A-001 SECTION.
040300 SIG-INIT-GF-1.
040400     MOVE   "DIVIDE INTO"  TO FEATURE.
040500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
040600     MOVE    1620.36 TO DIV1.
040700 SIG-TEST-GF-1-0.
040800     DIVIDE   64.3 INTO DIV1.
040900 SIG-TEST-GF-1-1.
041000     IF       DIV1 EQUAL TO 25.2
041100              PERFORM PASS
041200              ELSE
041300              GO TO SIG-FAIL-GF-1.
041400     GO TO    SIG-WRITE-GF-1.
041500 SIG-DELETE-GF-1.
041600     PERFORM  DE-LETE.
041700     GO TO    SIG-WRITE-GF-1.
041800 SIG-FAIL-GF-1.
041900     PERFORM  FAIL.
042000     MOVE     DIV1 TO COMPUTED-N.
042100     MOVE     +25.2 TO CORRECT-N.
042200 SIG-WRITE-GF-1.
042300     MOVE "SIG-TEST-GF-1" TO PAR-NAME.
042400     PERFORM  PRINT-DETAIL.
042500 SIG-INIT-GF-2.
042600     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
042700     MOVE    44.1 TO DIV2.
042800     MOVE  1661.7 TO DIV3.
042900 SIG-TEST-GF-2.
043000     DIVIDE   DIV2 INTO DIV3 ROUNDED.
043100     IF       DIV3 EQUAL TO 37.7
043200              PERFORM PASS
043300              ELSE
043400              GO TO SIG-FAIL-GF-2.
043500     GO TO    SIG-WRITE-GF-2.
043600 SIG-DELETE-GF-2.
043700     PERFORM  DE-LETE.
043800     GO TO    SIG-WRITE-GF-2.
043900 SIG-FAIL-GF-2.
044000     PERFORM  FAIL.
044100     MOVE     DIV3 TO COMPUTED-N.
044200     MOVE     +37.7 TO CORRECT-N.
044300 SIG-WRITE-GF-2.
044400     MOVE "SIG-TEST-GF-2 " TO PAR-NAME.
044500     PERFORM  PRINT-DETAIL.
044600 SIG-INIT-GF-3.
044700     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
044800     MOVE -9.642  TO DIV4.
044900     MOVE    .82  TO DIV5.
045000     MOVE     "A" TO XRAY.
045100 SIG-TEST-GF-3-0.
045200     DIVIDE   DIV5 INTO DIV4 ON SIZE ERROR
045300              MOVE "M" TO XRAY.
045400 SIG-TEST-GF-3-1.
045500     IF       XRAY EQUAL TO "M"
045600              PERFORM PASS
045700              ELSE
045800              GO TO SIG-FAIL-GF-3.
045900     GO TO    SIG-WRITE-GF-3.
046000 SIG-DELETE-GF-3-1.
046100     PERFORM  DE-LETE.
046200     GO TO    SIG-WRITE-GF-3.
046300 SIG-FAIL-GF-3.
046400     MOVE     DIV4 TO COMPUTED-N.
046500     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
046600     PERFORM  FAIL.
046700 SIG-WRITE-GF-3.
046800     MOVE "SIG-TEST-GF-3-1" TO PAR-NAME.
046900     PERFORM  PRINT-DETAIL.
047000 SIG-TEST-GF-3-2.
047100     IF       DIV4 EQUAL TO -9.642
047200              PERFORM PASS
047300              ELSE
047400              GO TO SIG-FAIL-GF-3-2.
047500     GO TO    SIG-WRITE-GF-3-2.
047600 SIG-DELETE-GF-3-2.
047700     PERFORM  DE-LETE.
047800     GO TO    SIG-WRITE-GF-3-2.
047900 SIG-FAIL-GF-3-2.
048000     PERFORM  FAIL.
048100     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
048200     MOVE     DIV4 TO COMPUTED-N.
048300     MOVE     -9.642 TO CORRECT-N.
048400 SIG-WRITE-GF-3-2.
048500     MOVE "SIG-TEST-GF-3-2 " TO PAR-NAME.
048600     PERFORM  PRINT-DETAIL.
048700 SIG-INIT-GF-4.
048800     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
048900     MOVE   44.1  TO DIV2.
049000     MOVE      0  TO DIV6.
049100     MOVE     "A" TO XRAY.
049200 SIG-TEST-GF-4-1-0.
049300     DIVIDE   DIV6 INTO DIV2 ON SIZE ERROR
049400              MOVE "N" TO XRAY.
049500 SIG-TEST-GF-4-1-1.
049600     IF       XRAY EQUAL TO "N"
049700              PERFORM PASS
049800              ELSE
049900              GO TO SIG-FAIL-GF-4-1.
050000     GO TO    SIG-WRITE-GF-4-1.
050100 SIG-DELETE-GF-4-1.
050200     PERFORM  DE-LETE.
050300     GO TO    SIG-WRITE-GF-4-1.
050400 SIG-FAIL-GF-4-1.
050500     MOVE     DIV2 TO COMPUTED-N.
050600     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
050700     PERFORM  FAIL.
050800 SIG-WRITE-GF-4-1.
050900     MOVE "SIG-TEST-GF-4-1 " TO PAR-NAME.
051000     PERFORM  PRINT-DETAIL.
051100 SIG-TEST-GF-4-2.
051200     IF       DIV2 EQUAL TO 44.1
051300              PERFORM PASS
051400              ELSE
051500              GO TO SIG-FAIL-GF-4-2.
051600     GO TO    SIG-WRITE-GF-4-2.
051700 SIG-DELETE-GF-4-2.
051800     PERFORM  DE-LETE.
051900     GO TO    SIG-WRITE-GF-4-2.
052000 SIG-FAIL-GF-4-2.
052100     PERFORM  FAIL.
052200     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
052300     MOVE     DIV2 TO COMPUTED-N.
052400     MOVE     +44.1000 TO CORRECT-N.
052500 SIG-WRITE-GF-4-2.
052600     MOVE "SIG-TEST-GF-4-2 " TO PAR-NAME.
052700     PERFORM  PRINT-DETAIL.
052800 SIG-INIT-GF-5.
052900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
053000     MOVE    9.6  TO DIV7.
053100     MOVE     "A" TO XRAY.
053200 SIG-TEST-GF-5-0.
053300     DIVIDE   0.097 INTO DIV7 ROUNDED ON SIZE ERROR
053400              MOVE "N" TO XRAY.
053500 SIG-TEST-GF-5-1.
053600     IF       XRAY EQUAL TO "N"
053700              PERFORM PASS
053800              ELSE
053900              GO TO SIG-FAIL-GF-5-1.
054000     GO TO    SIG-WRITE-GF-5-1.
054100 SIG-DELETE-GF-5-1.
054200     PERFORM  DE-LETE.
054300     GO TO    SIG-WRITE-GF-5-1.
054400 SIG-FAIL-GF-5-1.
054500     MOVE     DIV7 TO COMPUTED-N.
054600     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
054700     PERFORM  FAIL.
054800 SIG-WRITE-GF-5-1.
054900     MOVE "SIG-TEST-GF-5-1 " TO PAR-NAME.
055000     PERFORM  PRINT-DETAIL.
055100 SIG-TEST-GF-5-2.
055200     IF       DIV7 NOT EQUAL TO 9.6
055300              GO TO SIG-FAIL-GF-5-2.
055400     PERFORM  PASS.
055500     GO TO    SIG-WRITE-GF-5-2.
055600 SIG-DELETE-GF-5-2.
055700     PERFORM  DE-LETE.
055800     GO TO    SIG-WRITE-GF-5-2.
055900 SIG-FAIL-GF-5-2.
056000     PERFORM  FAIL.
056100     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
056200     MOVE     DIV7 TO COMPUTED-N.
056300     MOVE     +9.6 TO CORRECT-N.
056400 SIG-WRITE-GF-5-2.
056500     MOVE "SIG-TEST-GF-5-2 " TO PAR-NAME.
056600     PERFORM  PRINT-DETAIL.
056700 SIG-INIT-GF-11.
056800     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
056900     MOVE "DIVIDE INTO GIVING" TO FEATURE.
057000     MOVE     44.1 TO DIV2.
057100     MOVE     ZERO TO DIV8.
057200 SIG-TEST-GF-11-0.
057300     DIVIDE   DIV2 INTO 864.36 GIVING DIV8.
057400 SIG-TEST-GF-11-1.
057500     IF       DIV8 EQUAL TO 19.6
057600              PERFORM PASS
057700              ELSE
057800              GO TO SIG-FAIL-GF-11.
057900     GO TO    SIG-WRITE-GF-11.
058000 SIG-DELETE-GF-11.
058100     PERFORM  DE-LETE.
058200     GO TO    SIG-WRITE-GF-11.
058300 SIG-FAIL-GF-11.
058400     PERFORM  FAIL.
058500     MOVE     DIV8 TO COMPUTED-N.
058600     MOVE     +19.6 TO CORRECT-N.
058700 SIG-WRITE-GF-11.
058800     MOVE "SIG-TEST-GF-11 " TO PAR-NAME.
058900     PERFORM  PRINT-DETAIL.
059000 SIG-INIT-GF-12.
059100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
059200     MOVE    1620.36 TO DIV1.
059300     MOVE    ZERO TO DIV9.
059400 SIG-TEST-GF-12-0.
059500     DIVIDE   0.533 INTO DIV1 GIVING DIV9 ROUNDED.
059600 SIG-TEST-GF-12-1.
059700     IF       DIV9 EQUAL TO " 3,040.1"
059800              PERFORM PASS
059900              ELSE
060000              GO TO SIG-FAIL-GF-12.
060100     GO TO    SIG-WRITE-GF-12.
060200 SIG-DELETE-GF-12.
060300     PERFORM  DE-LETE.
060400     GO TO    SIG-WRITE-GF-12.
060500 SIG-FAIL-GF-12.
060600     PERFORM  FAIL.
060700     MOVE     DIV9 TO COMPUTED-A.
060800     MOVE " 3,040.1" TO CORRECT-A.
060900 SIG-WRITE-GF-12.
061000     MOVE "SIG-TEST-GF-12" TO PAR-NAME.
061100     PERFORM  PRINT-DETAIL.
061200 SIG-INIT-GF-13.
061300     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
061400     MOVE     -9.642 TO DIV4.
061500     MOVE     ZERO TO DIV10.
061600     MOVE     44.1 TO DIV2.
061700     MOVE     "A"  TO XRAY.
061800 SIG-TEST-GF-13-0.
061900     DIVIDE   DIV4 INTO DIV2 GIVING DIV10 ON SIZE ERROR
062000              MOVE "P" TO XRAY.
062100 SIG-TEST-GF-13-1.
062200     IF       XRAY EQUAL TO "P"
062300              PERFORM PASS
062400              ELSE
062500              GO TO SIG-FAIL-GF-13-1.
062600     GO TO    SIG-WRITE-GF-13-1.
062700 SIG-DELETE-GF-13-1.
062800     PERFORM  DE-LETE.
062900     GO TO    SIG-WRITE-GF-13-1.
063000 SIG-FAIL-GF-13-1.
063100     MOVE     DIV10 TO COMPUTED-N.
063200     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
063300     PERFORM  FAIL.
063400 SIG-WRITE-GF-13-1.
063500     MOVE "SIG-TEST-GF-13-1" TO PAR-NAME.
063600     PERFORM  PRINT-DETAIL.
063700 SIG-TEST-GF-13-2.
063800     IF       DIV10 NOT EQUAL TO ZERO
063900              GO TO SIG-FAIL-GF-13-2.
064000     PERFORM  PASS.
064100     GO TO    SIG-WRITE-GF-13-2.
064200 SIG-DELETE-GF-13-2.
064300     PERFORM  DE-LETE.
064400     GO TO    SIG-WRITE-GF-13-2.
064500 SIG-FAIL-GF-13-2.
064600     PERFORM FAIL.
064700     MOVE    DIV10 TO COMPUTED-N.
064800     MOVE    ZERO TO CORRECT-N.
064900     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
065000 SIG-WRITE-GF-13-2.
065100     MOVE "SIG-TEST-GF-13-2" TO PAR-NAME.
065200     PERFORM  PRINT-DETAIL.
065300 SIG-INIT-GF-19.
065400     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
065500     MOVE     ZERO TO DIV8.
065600     MOVE     44.1 TO DIV2.
065700     MOVE "DIVIDE BY" TO FEATURE.
065800 SIG-TEST-GF-19.
065900     DIVIDE   864.36 BY DIV2 GIVING DIV8.
066000     IF       DIV8 EQUAL TO 19.6
066100              PERFORM PASS
066200              ELSE
066300              GO TO SIG-FAIL-GF-19.
066400     GO TO    SIG-WRITE-GF-19.
066500 SIG-DELETE-GF-19.
066600     PERFORM  DE-LETE.
066700     GO TO    SIG-WRITE-GF-19.
066800 SIG-FAIL-GF-19.
066900     PERFORM  FAIL.
067000     MOVE     DIV8 TO COMPUTED-N.
067100     MOVE     19.6 TO CORRECT-N.
067200 SIG-WRITE-GF-19.
067300     MOVE "SIG-TEST-GF-19" TO PAR-NAME.
067400     PERFORM  PRINT-DETAIL.
067500 SIG-INIT-GF-20.
067600     MOVE "DIVIDE BY GIVING" TO FEATURE.
067700     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
067800     MOVE  1620.36 TO DIV1.
067900     MOVE     ZERO TO DIV9.
068000 SIG-TEST-GF-20-0.
068100     DIVIDE   DIV1 BY 0.533 GIVING DIV9 ROUNDED.
068200 SIG-TEST-GF-20-1.
068300     IF       DIV9 EQUAL TO " 3,040.1"
068400              PERFORM PASS
068500              ELSE
068600              GO TO SIG-FAIL-GF-20.
068700     GO TO    SIG-WRITE-GF-20.
068800 SIG-DELETE-GF-20.
068900     PERFORM  DE-LETE.
069000     GO TO    SIG-WRITE-GF-20.
069100 SIG-FAIL-GF-20.
069200     PERFORM  FAIL.
069300     MOVE     DIV9 TO COMPUTED-A.
069400     MOVE " 3,040.1" TO CORRECT-A.
069500 SIG-WRITE-GF-20.
069600     MOVE "SIG-TEST-GF-20" TO PAR-NAME.
069700     PERFORM  PRINT-DETAIL.
069800 SIG-INIT-GF-21.
069900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
070000     MOVE     -9.642 TO DIV4.
070100     MOVE     ZERO TO DIV10.
070200     MOVE     44.1 TO DIV2.
070300     MOVE     "A"  TO XRAY.
070400 SIG-TEST-GF-21-0.
070500     DIVIDE   DIV2 BY DIV4 GIVING DIV10 ON SIZE ERROR
070600              MOVE "P" TO XRAY.
070700 SIG-TEST-GF-21-1.
070800     IF       XRAY EQUAL TO "P"
070900              PERFORM PASS
071000              ELSE
071100              GO TO SIG-FAIL-GF-21-1.
071200     GO TO    SIG-WRITE-GF-21-1.
071300 SIG-DELETE-GF-21-1.
071400     PERFORM  DE-LETE.
071500     GO TO    SIG-WRITE-GF-21-1.
071600 SIG-FAIL-GF-21-1.
071700     MOVE     DIV10 TO COMPUTED-N.
071800     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
071900     PERFORM  FAIL.
072000 SIG-WRITE-GF-21-1.
072100     MOVE "SIG-TEST-GF-21-1" TO PAR-NAME.
072200     PERFORM  PRINT-DETAIL.
072300 SIG-TEST-GF-21-2.
072400     IF       DIV10 = 0
072500              PERFORM PASS
072600              ELSE
072700              GO TO SIG-FAIL-GF-21-2.
072800     GO TO    SIG-WRITE-GF-21-2.
072900 SIG-DELETE-GF-21-2.
073000     PERFORM  DE-LETE.
073100     GO TO    SIG-WRITE-GF-21-2.
073200 SIG-FAIL-GF-21-2.
073300     MOVE     DIV10 TO COMPUTED-N.
073400     MOVE     0     TO CORRECT-N.
073500     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
073600     PERFORM FAIL.
073700 SIG-WRITE-GF-21-2.
073800     MOVE "SIG-TEST-GF-21-2" TO PAR-NAME.
073900     PERFORM  PRINT-DETAIL.
074000 SIG-INIT-GF-6.
074100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
074200     MOVE "DIVIDE INTO         " TO FEATURE.
074300     MOVE 99 TO WRK-DS-LS-18V00.
074400 SIG-TEST-GF-6-0.
074500     DIVIDE A99-DS-02V00 INTO WRK-DS-LS-18V00.
074600 SIG-TEST-GF-6-1.
074700     IF WRK-DS-LS-18V00 EQUAL TO 000000000000000001
074800         PERFORM PASS
074900         GO TO SIG-WRITE-GF-6.
075000     GO TO SIG-FAIL-GF-6.
075100 SIG-DELETE-GF-6.
075200     PERFORM DE-LETE.
075300     GO TO SIG-WRITE-GF-6.
075400 SIG-FAIL-GF-6.
075500     MOVE  000000000000000001 TO CORRECT-18V0.
075600     MOVE  WRK-DS-LS-18V00       TO COMPUTED-18V0.
075700     PERFORM FAIL.
075800 SIG-WRITE-GF-6.
075900     MOVE "SIG-TEST-GF-6         " TO PAR-NAME.
076000     PERFORM PRINT-DETAIL.
076100 SIG-INIT-GF-7.
076200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
076300     MOVE 2 TO WRK-DS-TS-12V00-S.
076400 SIG-TEST-GF-7-0.
076500     DIVIDE 4 INTO WRK-DS-TS-12V00-S ROUNDED.
076600 SIG-TEST-GF-7-1.
076700     IF WRK-DS-TS-12V00-S EQUAL TO 000000000001
076800         PERFORM PASS
076900         GO TO SIG-WRITE-GF-7.
077000     GO TO SIG-FAIL-GF-7.
077100 SIG-DELETE-GF-7.
077200     PERFORM DE-LETE.
077300     GO TO SIG-WRITE-GF-7.
077400 SIG-FAIL-GF-7.
077500     MOVE  WRK-DS-TS-12V00-S       TO COMPUTED-18V0.
077600     MOVE  000000000001       TO CORRECT-18V0.
077700     PERFORM FAIL.
077800 SIG-WRITE-GF-7.
077900     MOVE "SIG-TEST-GF-7         " TO PAR-NAME.
078000     PERFORM PRINT-DETAIL.
078100 SIG-INIT-GF-8.
078200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
078300     MOVE 1 TO WRK-DS-LS-01V00.
078400     MOVE "0" TO WRK-XN-00001.
078500 SIG-TEST-GF-8-0.
078600     DIVIDE 0.1 INTO WRK-DS-LS-01V00 ON SIZE ERROR
078700         MOVE "1" TO WRK-XN-00001.
078800 SIG-TEST-GF-8-1.
078900     IF WRK-DS-LS-01V00 EQUAL TO 1
079000         PERFORM PASS
079100         GO TO SIG-WRITE-GF-8-1.
079200     GO TO SIG-FAIL-GF-8-1.
079300 SIG-DELETE-GF-8-1.
079400     PERFORM DE-LETE.
079500     GO TO SIG-WRITE-GF-8-1.
079600 SIG-FAIL-GF-8-1.
079700     MOVE  1                  TO CORRECT-N.
079800     MOVE  WRK-DS-LS-01V00       TO COMPUTED-N.
079900     MOVE  "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
080000     PERFORM FAIL.
080100 SIG-WRITE-GF-8-1.
080200     MOVE "SIG-TEST-GF-8-1         " TO PAR-NAME.
080300     PERFORM PRINT-DETAIL.
080400 SIG-TEST-GF-8-2.
080500     IF WRK-XN-00001 EQUAL TO "1"
080600         PERFORM PASS
080700         GO TO SIG-WRITE-GF-8-2.
080800     MOVE "1" TO CORRECT-A.
080900     MOVE WRK-XN-00001 TO COMPUTED-A.
081000     MOVE "ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
081100     PERFORM FAIL.
081200     GO TO SIG-WRITE-GF-8-2.
081300 SIG-DELETE-GF-8-2.
081400     PERFORM DE-LETE.
081500 SIG-WRITE-GF-8-2.
081600     MOVE "SIG-TEST-GF-8-2         " TO PAR-NAME.
081700     PERFORM PRINT-DETAIL.
081800 SIG-INIT-GF-9.
081900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
082000     MOVE -.000000001 TO WRK-DS-09V09.
082100     MOVE "1" TO WRK-XN-00001.
082200 SIG-TEST-GF-9-0.
082300     DIVIDE A01ONE-DS-TS-P0801 INTO WRK-DS-09V09 ON SIZE ERROR
082400         MOVE "0" TO WRK-XN-00001.
082500 SIG-TEST-GF-9-1.
082600     IF WRK-DS-18V00-S EQUAL TO -000000001000000000
082700         PERFORM PASS
082800         GO TO SIG-WRITE-GF-9-1.
082900     GO TO SIG-FAIL-GF-9-1.
083000 SIG-DELETE-GF-9-1.
083100     PERFORM DE-LETE.
083200     GO TO SIG-WRITE-GF-9-1.
083300 SIG-FAIL-GF-9-1.
083400     MOVE -000000001000000000 TO CORRECT-18V0.
083500     MOVE WRK-DS-18V00-S TO COMPUTED-18V0.
083600     PERFORM FAIL.
083700 SIG-WRITE-GF-9-1.
083800     MOVE "SIG-TEST-GF-9-1         " TO PAR-NAME.
083900     PERFORM PRINT-DETAIL.
084000 SIG-TEST-GF-9-2.
084100     IF WRK-XN-00001 EQUAL TO "0"
084200         MOVE "1" TO CORRECT-A
084300         MOVE "0" TO COMPUTED-A
084400         MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
084500         PERFORM FAIL
084600         GO TO SIG-WRITE-GF-9-2.
084700     PERFORM PASS.
084800     GO TO SIG-WRITE-GF-9-2.
084900 SIG-DELETE-GF-9-2.
085000     PERFORM DE-LETE.
085100 SIG-WRITE-GF-9-2.
085200     MOVE "SIG-TEST-GF-9-2         " TO PAR-NAME.
085300     PERFORM PRINT-DETAIL.
085400 SIG-INIT-GF-10.
085500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
085600     MOVE ZERO TO WRK-DS-LS-01V00  AZERO-DS-LS-05V05.
085700     MOVE "0" TO WRK-XN-00001.
085800 SIG-TEST-GF-10-0.
085900     DIVIDE AZERO-DS-LS-05V05 INTO WRK-DS-LS-01V00 ROUNDED
086000         ON SIZE ERROR  MOVE "1" TO WRK-XN-00001.
086100 SIG-TEST-GF-10-1.
086200     IF WRK-DS-LS-01V00 EQUAL TO 0
086300         PERFORM PASS
086400         GO TO SIG-WRITE-GF-10-1.
086500     GO TO SIG-FAIL-GF-10-1.
086600 SIG-DELETE-GF-10-1.
086700     PERFORM DE-LETE.
086800     GO TO SIG-WRITE-GF-10-1.
086900 SIG-FAIL-GF-10-1.
087000     MOVE  0                  TO CORRECT-N.
087100     MOVE  WRK-DS-LS-01V00       TO COMPUTED-N.
087200     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
087300     PERFORM FAIL.
087400 SIG-WRITE-GF-10-1.
087500     MOVE "SIG-TEST-GF-10-1         " TO PAR-NAME.
087600     PERFORM PRINT-DETAIL.
087700 SIG-TEST-GF-10-2.
087800     IF WRK-XN-00001 EQUAL TO "1"
087900         PERFORM PASS
088000         GO TO SIG-WRITE-GF-10-2.
088100     MOVE "ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
088200     MOVE "1" TO CORRECT-A.
088300     MOVE WRK-XN-00001 TO COMPUTED-A.
088400     PERFORM FAIL.
088500     GO TO SIG-WRITE-GF-10-2.
088600 SIG-DELETE-GF-10-2.
088700     PERFORM DE-LETE.
088800 SIG-WRITE-GF-10-2.
088900     MOVE "SIG-TEST-GF-10-2         " TO PAR-NAME.
089000     PERFORM PRINT-DETAIL.
089100 SIG-INIT-GF-14.
089200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
089300     MOVE "DIVIDE INTO GIVING  " TO FEATURE.
089400     MOVE ZERO TO WRK-DS-LS-01V00.
089500     MOVE 22 TO A02TWOS-DU-02V00.
089600 SIG-TEST-GF-14-0.
089700     DIVIDE -10.9 INTO A02TWOS-DU-02V00 GIVING WRK-DS-LS-01V00.
089800 SIG-TEST-GF-14-1.
089900     IF WRK-DS-LS-01V00 EQUAL TO -2
090000         PERFORM PASS
090100         GO TO SIG-WRITE-GF-14.
090200     GO TO SIG-FAIL-GF-14.
090300 SIG-DELETE-GF-14.
090400     PERFORM DE-LETE.
090500     GO TO SIG-WRITE-GF-14.
090600 SIG-FAIL-GF-14.
090700     MOVE  -2                 TO CORRECT-N.
090800     MOVE  WRK-DS-LS-01V00       TO COMPUTED-N.
090900     PERFORM FAIL.
091000 SIG-WRITE-GF-14.
091100     MOVE "SIG-TEST-GF-14         " TO PAR-NAME.
091200     PERFORM PRINT-DETAIL.
091300 SIG-INIT-GF-15.
091400     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
091500     MOVE 0.0000000001 TO WRK-DS-03V10.
091600     MOVE ZERO TO WRK-DS-LS-18V00.
091700     MOVE .000000001 TO A01ONE-DS-TS-P0801.
091800 SIG-TEST-GF-15-0.
091900     DIVIDE WRK-DS-03V10 INTO A01ONE-DS-TS-P0801
092000         GIVING WRK-DS-LS-18V00 ROUNDED.
092100 SIG-TEST-GF-15-1.
092200     IF WRK-DS-LS-18V00 EQUAL TO 000000000000000010
092300         PERFORM PASS
092400         GO TO SIG-WRITE-GF-15.
092500     GO TO SIG-FAIL-GF-15.
092600 SIG-DELETE-GF-15.
092700     PERFORM DE-LETE.
092800     GO TO SIG-WRITE-GF-15.
092900 SIG-FAIL-GF-15.
093000     MOVE  000000000000000010 TO CORRECT-18V0.
093100     MOVE  WRK-DS-LS-18V00       TO COMPUTED-18V0.
093200     PERFORM FAIL.
093300 SIG-WRITE-GF-15.
093400     MOVE "SIG-TEST-GF-15         " TO PAR-NAME.
093500     PERFORM PRINT-DETAIL.
093600 SIG-INIT-GF-16.
093700     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
093800     MOVE ZERO TO WRK-DS-LS-18V00  AZERO-DS-LS-05V05.
093900     MOVE "0" TO WRK-XN-00001.
094000 SIG-TEST-GF-16-0.
094100     DIVIDE AZERO-DS-LS-05V05 INTO A99-DS-02V00
094200         GIVING WRK-DS-LS-18V00 ON SIZE ERROR
094300         MOVE "1" TO WRK-XN-00001.
094400 SIG-TEST-GF-16-1.
094500     IF WRK-DS-LS-18V00 EQUAL TO 000000000000000000
094600         PERFORM PASS
094700         GO TO SIG-WRITE-GF-16-1.
094800     GO TO SIG-FAIL-GF-16-1.
094900 SIG-DELETE-GF-16-1.
095000     PERFORM DE-LETE.
095100     GO TO SIG-WRITE-GF-16-1.
095200 SIG-FAIL-GF-16-1.
095300     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
095400     MOVE  000000000000000000 TO CORRECT-18V0.
095500     MOVE  WRK-DS-LS-18V00       TO COMPUTED-18V0.
095600     PERFORM FAIL.
095700 SIG-WRITE-GF-16-1.
095800     MOVE "SIG-TEST-GF-16-1         " TO PAR-NAME.
095900     PERFORM PRINT-DETAIL.
096000 SIG-TEST-GF-16-2.
096100     IF WRK-XN-00001 EQUAL TO "1"
096200         PERFORM PASS
096300         GO TO SIG-WRITE-GF-16-2.
096400     MOVE "ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
096500     MOVE "1" TO CORRECT-A.
096600     MOVE WRK-XN-00001 TO COMPUTED-A.
096700     PERFORM FAIL.
096800     GO TO SIG-WRITE-GF-16-2.
096900 SIG-DELETE-GF-16-2.
097000     PERFORM DE-LETE.
097100 SIG-WRITE-GF-16-2.
097200     MOVE "SIG-TEST-32         " TO PAR-NAME.
097300     PERFORM PRINT-DETAIL.
097400 SIG-INIT-GF-17.
097500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
097600     MOVE ZERO TO WRK-DS-LS-0201P.
097700     MOVE -0.005 TO WRK-DS-09V09.
097800     MOVE "0" TO WRK-XN-00001.
097900 SIG-TEST-GF-17-0.
098000     DIVIDE WRK-DS-09V09 INTO A05ONES-DS-LS-00V05 GIVING
098100         WRK-DS-LS-0201P ROUNDED ON SIZE ERROR
098200         MOVE "1" TO WRK-XN-00001.
098300 SIG-TEST-GF-17-1.
098400     MOVE WRK-DS-LS-0201P TO WRK-DS-05V00.
098500     IF WRK-DS-05V00 EQUAL TO  -00020
098600         PERFORM PASS
098700         GO TO SIG-WRITE-GF-17-1.
098800     GO TO SIG-FAIL-GF-17-1.
098900 SIG-DELETE-GF-17-1.
099000     PERFORM DE-LETE.
099100     GO TO SIG-WRITE-GF-17-1.
099200 SIG-FAIL-GF-17-1.
099300     MOVE -00020 TO CORRECT-N.
099400     MOVE WRK-DS-05V00 TO COMPUTED-N.
099500     PERFORM FAIL.
099600 SIG-WRITE-GF-17-1.
099700     MOVE "SIG-TEST-GF-17-1         " TO PAR-NAME.
099800     PERFORM PRINT-DETAIL.
099900 SIG-TEST-GF-17-2.
100000     IF WRK-XN-00001 EQUAL TO "0"
100100         PERFORM PASS
100200         GO TO SIG-WRITE-GF-17-2.
100300     MOVE "0" TO CORRECT-A.
100400     MOVE WRK-XN-00001 TO COMPUTED-A.
100500     MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
100600     PERFORM FAIL.
100700     GO TO SIG-WRITE-GF-17-2.
100800 SIG-DELETE-GF-17-2.
100900     PERFORM DE-LETE.
101000 SIG-WRITE-GF-17-2.
101100     MOVE "SIG-TEST-GF-17-2         " TO PAR-NAME.
101200     PERFORM PRINT-DETAIL.
101300 SIG-INIT-GF-18.
101400     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
101500     MOVE "1" TO WRK-XN-00001.
101600     MOVE ZERO TO WRK-DS-LS-01V00.
101700     MOVE 22 TO A02TWOS-DU-02V00  A02TWOS-DS-03V02.
101800 SIG-TEST-GF-18-0.
101900     DIVIDE A02TWOS-DU-02V00 INTO A02TWOS-DS-03V02  GIVING
102000         WRK-DS-LS-01V00 ROUNDED ON SIZE ERROR
102100         MOVE "0" TO WRK-XN-00001.
102200 SIG-TEST-GF-18-1.
102300     IF WRK-DS-LS-01V00 EQUAL TO +1
102400         PERFORM PASS
102500         GO TO SIG-WRITE-GF-18-1.
102600     GO TO SIG-FAIL-GF-18-1.
102700 SIG-DELETE-GF-18-1.
102800     PERFORM DE-LETE.
102900     GO TO SIG-WRITE-GF-18-1.
103000 SIG-FAIL-GF-18-1.
103100     MOVE  +1                 TO CORRECT-N.
103200     MOVE  WRK-DS-LS-01V00       TO COMPUTED-N.
103300     PERFORM FAIL.
103400 SIG-WRITE-GF-18-1.
103500     MOVE "SIG-TEST-GF-18-1         " TO PAR-NAME.
103600     PERFORM PRINT-DETAIL.
103700 SIG-TEST-GF-18-2.
103800     IF WRK-XN-00001 EQUAL TO "1"
103900         PERFORM PASS
104000         GO TO SIG-WRITE-GF-18-2.
104100     MOVE "1" TO CORRECT-A.
104200     MOVE WRK-XN-00001 TO COMPUTED-A.
104300     MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
104400     PERFORM FAIL.
104500     GO TO SIG-WRITE-GF-18-2.
104600 SIG-DELETE-GF-18-2.
104700     PERFORM DE-LETE.
104800 SIG-WRITE-GF-18-2.
104900     MOVE "SIG-TEST-GF-18-2         " TO PAR-NAME.
105000     PERFORM PRINT-DETAIL.
105100 SIG-INIT-GF-22.
105200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
105300     MOVE "DIVIDE BY GIVING    " TO FEATURE.
105400     MOVE ZERO TO WRK-DS-LS-01V00.
105500 SIG-TEST-GF-22-0.
105600     DIVIDE A02TWOS-DU-02V00 BY -10.9 GIVING WRK-DS-LS-01V00.
105700 SIG-TEST-GF-22-1.
105800     IF WRK-DS-LS-01V00 EQUAL TO -2
105900         PERFORM PASS
106000         GO TO SIG-WRITE-GF-22.
106100     GO TO SIG-FAIL-GF-22.
106200 SIG-DELETE-GF-22.
106300     PERFORM DE-LETE.
106400     GO TO SIG-WRITE-GF-22.
106500 SIG-FAIL-GF-22.
106600     MOVE  -2                 TO CORRECT-N.
106700     MOVE  WRK-DS-LS-01V00       TO COMPUTED-N.
106800     PERFORM FAIL.
106900 SIG-WRITE-GF-22.
107000     MOVE "SIG-TEST-GF-22         " TO PAR-NAME.
107100     PERFORM PRINT-DETAIL.
107200 SIG-INIT-GF-23.
107300     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
107400     MOVE 0.0000000001 TO WRK-DS-03V10.
107500     MOVE ZERO TO WRK-DS-LS-18V00.
107600     MOVE .000000001 TO A01ONE-DS-TS-P0801.
107700 SIG-TEST-GF-23-0.
107800     DIVIDE A01ONE-DS-TS-P0801 BY WRK-DS-03V10 GIVING
107900         WRK-DS-LS-18V00 ROUNDED.
108000 SIG-TEST-GF-23-1.
108100     IF WRK-DS-LS-18V00 EQUAL TO 000000000000000010
108200         PERFORM PASS
108300         GO TO SIG-WRITE-GF-23.
108400     GO TO SIG-FAIL-GF-23.
108500 SIG-DELETE-GF-23.
108600     PERFORM DE-LETE.
108700     GO TO SIG-WRITE-GF-23.
108800 SIG-FAIL-GF-23.
108900     MOVE  000000000000000010 TO CORRECT-18V0.
109000     MOVE  WRK-DS-LS-18V00       TO COMPUTED-18V0.
109100     PERFORM FAIL.
109200 SIG-WRITE-GF-23.
109300     MOVE "SIG-TEST-GF-23         " TO PAR-NAME.
109400     PERFORM PRINT-DETAIL.
109500 SIG-INIT-GF-24.
109600     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
109700     MOVE ZERO TO WRK-DS-LS-18V00 AZERO-DS-LS-05V05.
109800     MOVE "0" TO WRK-XN-00001.
109900     MOVE 99 TO A99-DS-02V00.
110000 SIG-TEST-GF-24-0.
110100     DIVIDE A99-DS-02V00 BY AZERO-DS-LS-05V05 GIVING
110200         WRK-DS-LS-18V00 ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
110300 SIG-TEST-GF-24-1.
110400     IF WRK-DS-LS-18V00 EQUAL TO 000000000000000000
110500         PERFORM PASS
110600         GO TO SIG-WRITE-GF-24-1.
110700     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
110800     MOVE  000000000000000000 TO CORRECT-18V0.
110900     MOVE  WRK-DS-LS-18V00       TO COMPUTED-18V0.
111000     PERFORM FAIL.
111100     GO TO SIG-WRITE-GF-24-1.
111200 SIG-DELETE-GF-24-1.
111300     PERFORM DE-LETE.
111400 SIG-WRITE-GF-24-1.
111500     MOVE "SIG-TEST-GF-24-1         " TO PAR-NAME.
111600     PERFORM PRINT-DETAIL.
111700 SIG-TEST-GF-24-2.
111800     IF WRK-XN-00001 EQUAL TO "1"
111900         PERFORM PASS
112000         GO TO SIG-WRITE-GF-24-2.
112100     MOVE "1" TO CORRECT-A.
112200     MOVE WRK-XN-00001 TO COMPUTED-A.
112300     MOVE "ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
112400     PERFORM FAIL.
112500     GO TO SIG-WRITE-GF-24-2.
112600 SIG-DELETE-GF-24-2.
112700     PERFORM DE-LETE.
112800 SIG-WRITE-GF-24-2.
112900     MOVE "SIG-TEST-GF-24-2         " TO PAR-NAME.
113000     PERFORM PRINT-DETAIL.
113100 SIG-INIT-GF-25.
113200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
113300     MOVE .11111 TO A05ONES-DS-LS-00V05.
113400     MOVE ZERO TO WRK-DS-LS-0201P.
113500     MOVE -0.005 TO WRK-DS-09V09.
113600     MOVE "0" TO WRK-XN-00001.
113700 SIG-TEST-GF-25-0.
113800     DIVIDE A05ONES-DS-LS-00V05 BY WRK-DS-09V09 GIVING
113900         WRK-DS-LS-0201P ROUNDED ON SIZE ERROR
114000         MOVE "1" TO WRK-XN-00001.
114100 SIG-TEST-GF-25-1.
114200     MOVE WRK-DS-LS-0201P TO WRK-DS-05V00.
114300     IF  WRK-DS-05V00 EQUAL TO -00020
114400         PERFORM PASS
114500         GO TO SIG-WRITE-GF-25-1.
114600     MOVE  -00020             TO CORRECT-N.
114700     MOVE  WRK-DS-05V00       TO COMPUTED-N.
114800     PERFORM FAIL.
114900     GO TO SIG-WRITE-GF-25-1.
115000 SIG-DELETE-GF-25-1.
115100     PERFORM DE-LETE.
115200 SIG-WRITE-GF-25-1.
115300     MOVE "SIG-TEST-GF-25-1         " TO PAR-NAME.
115400     PERFORM PRINT-DETAIL.
115500 SIG-TEST-GF-25-2.
115600     IF WRK-XN-00001 EQUAL TO "0"
115700         PERFORM PASS
115800         GO TO SIG-WRITE-GF-25-2.
115900     MOVE "0" TO CORRECT-A.
116000     MOVE WRK-XN-00001 TO COMPUTED-A.
116100     MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
116200     PERFORM FAIL.
116300     GO TO SIG-WRITE-GF-25-2.
116400 SIG-DELETE-GF-25-2.
116500     PERFORM DE-LETE.
116600 SIG-WRITE-GF-25-2.
116700     MOVE "SIG-TEST-GF-25-2         " TO PAR-NAME.
116800     PERFORM PRINT-DETAIL.
116900 SIG-INIT-GF-26.
117000     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
117100     MOVE 22 TO A02TWOS-DU-02V00  A02TWOS-DS-03V02.
117200     MOVE "1" TO WRK-XN-00001.
117300     MOVE ZERO TO WRK-DS-LS-01V00.
117400 SIG-TEST-GF-26-0.
117500     DIVIDE A02TWOS-DS-03V02 BY A02TWOS-DU-02V00 GIVING
117600         WRK-DS-LS-01V00 ROUNDED ON SIZE ERROR
117700         MOVE "0" TO WRK-XN-00001.
117800 SIG-TEST-GF-26-1.
117900     IF WRK-DS-LS-01V00 EQUAL TO +1
118000         PERFORM PASS
118100         GO TO SIG-WRITE-GF-26-1.
118200     MOVE  +1                 TO CORRECT-N.
118300     MOVE  WRK-DS-LS-01V00       TO COMPUTED-N.
118400     PERFORM FAIL.
118500     GO TO SIG-WRITE-GF-26-1.
118600 SIG-DELETE-GF-26-1.
118700     PERFORM DE-LETE.
118800 SIG-WRITE-GF-26-1.
118900     MOVE "SIG-TEST-GF-26-1         " TO PAR-NAME.
119000     PERFORM PRINT-DETAIL.
119100 SIG-TEST-GF-26-2.
119200     IF WRK-XN-00001 EQUAL TO "0"
119300         MOVE "0" TO COMPUTED-A
119400         MOVE "1" TO CORRECT-A
119500         MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
119600         PERFORM FAIL
119700        GO TO SIG-WRITE-GF-26-2.
119800     PERFORM PASS.
119900     GO TO SIG-WRITE-GF-26-2.
120000 SIG-DELETE-GF-26-2.
120100     PERFORM DE-LETE.
120200 SIG-WRITE-GF-26-2.
120300     MOVE "SIG-TEST-GF-26-2         " TO PAR-NAME.
120400     PERFORM PRINT-DETAIL.
120500*
120600 CCVS-EXIT SECTION.
120700 CCVS-999999.
120800     GO TO CLOSE-FILES.
