000100    IDENTIFICATION DIVISION.
000200    PROGRAM-ID.
000300     NC113M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*   PROGRAM NC113M VERIFIES CORRECT USE OF AREA A WITHIN
002300*                      A PROGRAM.
002400*
002500*
002600    ENVIRONMENT DIVISION.
002700    CONFIGURATION SECTION.
002800    SOURCE-COMPUTER.
002900     XXXXX082.
003000    OBJECT-COMPUTER.
003100     XXXXX083.
003200    INPUT-OUTPUT SECTION.
003300    FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600    DATA
003700     DIVISION.
003800    FILE SECTION.
003900    FD PRINT-FILE.
004000    01 PRINT-REC PICTURE X(120).
004100    01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300    77  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
004400    77  DELETE-CNT                PICTURE 999  VALUE ZERO.
004500    01  TEST-RESULTS.
004600    02 FILLER                     PICTURE X VALUE SPACE.
004700  02  FEATURE                PICTURE X(20).
004800  02 FILLER                       PICTURE X VALUE SPACE.
004900  02  P-OR-F                      PICTURE XXXXX.
005000   02 FILLER                      PICTURE X  VALUE SPACE.
005100    02 PAR-NAME                   PICTURE X(19).
005200   02 FILLER                      PICTURE X VALUE SPACE.
005300  02 COMPUTED-A                   PICTURE X(20).
005400   02 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
005500     02 FILLER                    PICTURE XX VALUE SPACE.
005600     02 CORRECT-A                 PICTURE X(20).
005700  02 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
005800       02 FILLER                  PICTURE XX VALUE SPACE.
005900  02 RE-MARK                      PICTURE X(27).
006000   01  HEADER-LINE-1.
006100       02  PAGE-CONTROL-4 PICTURE IS X   VALUE IS "1".
006200       02  FILLER         PICTURE X(42)  VALUE
006300     SPACE.
006400 02 FILLER PICTURE X(42) VALUE
006500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM ".
006600 02 FILLER                        PICTURE X(35)  VALUE
006700     SPACE.
006800    01 HEADER-LINE-2.
006900  02 FILLER PICTURE IS X(52) VALUE IS SPACE.
007000   02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
007100    02 TEST-ID PICTURE IS X(9).
007200   02 FILLER PICTURE IS X(40) VALUE IS SPACE.
007300   01 HEADER-LINE-3.
007400  02 FILLER PICTURE X(34) VALUE
007500     " FOR OFFICIAL USE ONLY    ".
007600     02  FILLER PICTURE X(58) VALUE
007700     "                                                         ".
007800       02 FILLER PICTURE X(28) VALUE
007900     "          COPYRIGHT 1985    ".
008000    01  COLUMNS-LINE-1.
008100  02 PAGE-CONTROL-C PICTURE IS X VALUE IS SPACE.
008200  02  FILLER   PICTURE IS X(99) VALUE IS "FEATURE              PAS
008300-    "S  PARAGRAPH NAME
008400-    "        REMARKS".
008500  02 FILLER PICTURE IS X(20) VALUE IS SPACE.
008600   01  COLUMNS-LINE-2.
008700   02 FILLER PICTURE IS X VALUE IS SPACE.
008800   02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
008900   02 FILLER PICTURE IS X(15) VALUE IS SPACE.
009000   02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
009100   02 FILLER PICTURE IS X(94) VALUE IS SPACE.
009200    01        ENDER-LINE-1.
009300    02      FILLER PICTURE IS X(52) VALUE IS SPACE.
009400    02        FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
009500    02         ID-AGAIN   PICTURE IS X(9).
009600    02         FILLER PICTURE IS X(45) VALUE IS SPACE.
009700  01 ENDER-LINE-2.
009800  02 FILLER                       PICTURE X(31)  VALUE
009900     SPACE.
010000  02 FILLER     PICTURE     X(21)    VALUE   IS   SPACE.
010100   02 ERROR-TOTAL PICTURE IS         XXX     VALUE IS SPACE.
010200  02 FILLER PICTURE IS X VALUE IS SPACE.
010300    02      ENDER-DESC           PICTURE X(31) VALUE IS "ERRORS EN
010400-    "COUNTERED".
010500     02 FILLER PICTURE IS X(33) VALUE IS SPACE.
010600    01 ENDER-LINE-3.
010700   02 FILLER PICTURE X(22) VALUE
010800     " FOR OFFICIAL USE ONLY".
010900  02 FILLER PICTURE X(12) VALUE SPACE.
011000   02 FILLER PICTURE X(58) VALUE SPACE.
011100    02 FILLER PICTURE X(13) VALUE SPACE.
011200     02  FILLER PICTURE X(15) VALUE " COPYRIGHT 1985".
011300  01  HYPHEN-LINE.
011400     02 FILLER PICTURE IS X VALUE IS SPACE.
011500     02 FILLER PICTURE IS X(65) VALUE IS "------------------------
011600-    "-----------------------------------------".
011700     02 FILLER PICTURE IS X(54) VALUE IS "------------------------
011800-    "------------------------------".
011900    PROCEDURE
012000      DIVISION
012100               .
012200    OPEN-FILES.
012300     OPEN     OUTPUT PRINT-FILE.
012400     MOVE "  NC113M" TO TEST-ID.
012500     MOVE     TEST-ID TO ID-AGAIN.
012600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
012700     MOVE     SPACE TO TEST-RESULTS.
012800     MOVE "MARGIN TESTING" TO FEATURE.
012900     PERFORM MAR-TEST-1.
013000    MAR-TEST-2.
013100     MOVE "VISUALLY CHECKED" TO RE-MARK.
013200     MOVE "MAR-TEST-2"     TO PAR-NAME.
013300     PERFORM PRINT-DETAIL.
013400     GO TO  MAR-TEST-3.
013500    MAR-TEST-15.
013600     MOVE "MAR-TEST-15"    TO PAR-NAME.
013700     PERFORM PRINT-DETAIL.
013800    MAR-TEST-7.
013900     MOVE "MAR-TEST-7"     TO PAR-NAME.
014000     PERFORM PRINT-DETAIL.
014100*    GO TO MAR-TEST-8.
014200    MAR-TEST-12.
014300     MOVE "MAR-TEST-12"    TO PAR-NAME.
014400     PERFORM PRINT-DETAIL.
014500     GO TO MAR-TEST-13.
014600    MAR-TEST-4.
014700     MOVE "MAR-TEST-4"     TO PAR-NAME.
014800     PERFORM PRINT-DETAIL.
014900  MAR-TEST-9.
015000     MOVE "MAR-TEST-9"     TO PAR-NAME.
015100     PERFORM PRINT-DETAIL.
015200 MAR-TEST-8.
015300     MOVE "MAR-TEST-8"     TO PAR-NAME.
015400     PERFORM PRINT-DETAIL.
015500     PERFORM MAR-TEST-9.
015600     GO TO MAR-TEST-10.
015700    MAR-TEST-1.
015800     MOVE "ANSWERS MUST BE"  TO RE-MARK.
015900     MOVE "MAR-TEST-1"     TO PAR-NAME.
016000     PERFORM PRINT-DETAIL.
016100    MAR-TEST-5.
016200     MOVE "TESTS MUST BE SEQUENTIAL" TO RE-MARK.
016300     MOVE "MAR-TEST-5"     TO PAR-NAME.
016400     PERFORM PRINT-DETAIL.
016500     GO TO   MAR-TEST-6.
016600    MAR-TEST-13.
016700     MOVE "MAR-TEST-13"    TO PAR-NAME.
016800     PERFORM PRINT-DETAIL.
016900     GO TO MAR-TEST-14.
017000    MAR-TEST-3.
017100     MOVE "FOR CORRECTNESS"  TO RE-MARK.
017200     MOVE "MAR-TEST-3"     TO PAR-NAME.
017300     PERFORM PRINT-DETAIL.
017400     PERFORM MAR-TEST-4.
017500     GO TO MAR-TEST-5.
017600    MAR-TEST-14.
017700     MOVE "MAR-TEST-14"    TO PAR-NAME.
017800     PERFORM PRINT-DETAIL.
017900     PERFORM MAR-TEST-15.
018000     GO TO CLOSE-FILES.
018100    MAR-TEST-11.
018200     MOVE "MAR-TEST-11"    TO PAR-NAME.
018300     PERFORM PRINT-DETAIL.
018400     GO TO MAR-TEST-12.
018500   MAR-TEST-10.
018600     MOVE "MAR-TEST-10"    TO PAR-NAME.
018700     PERFORM PRINT-DETAIL.
018800     GO TO MAR-TEST-11.
018900    MAR-TEST-6.
019000     MOVE "MAR-TEST-6"     TO PAR-NAME.
019100     PERFORM PRINT-DETAIL.
019200     PERFORM MAR-TEST-7.
019300     GO TO MAR-TEST-8.
019400    CLOSE-FILES.
019500     PERFORM END-ROUTINE THRU END-ROUTINE-3.
019600     CLOSE    PRINT-FILE.
019700     STOP     RUN.
019800    PASS.
019900     MOVE "PASS" TO P-OR-F.
020000    FAIL.
020100     ADD      1 TO ERROR-COUNTER.
020200     MOVE "FAIL*" TO P-OR-F.
020300    DE-LETE.
020400     MOVE     SPACE TO P-OR-F.
020500     MOVE     "    ************    " TO COMPUTED-A.
020600     MOVE     "    ************    " TO CORRECT-A.
020700     MOVE "****TEST DELETED****" TO RE-MARK.
020800     ADD 1 TO DELETE-CNT.
020900    PRINT-DETAIL.
021000     MOVE     TEST-RESULTS TO PRINT-REC.
021100     WRITE    PRINT-REC                             AFTER 1.
021200     MOVE     SPACE TO P-OR-F.
021300     MOVE     SPACE TO PAR-NAME.
021400     MOVE     SPACE TO COMPUTED-A.
021500     MOVE SPACE TO CORRECT-A.
021600     MOVE     SPACE TO RE-MARK.
021700    HEAD-ROUTINE.
021800     PERFORM  BLANK-LINE-PRINT 15 TIMES.
021900     MOVE     HEADER-LINE-1 TO DUMMY-RECORD.
022000     WRITE    DUMMY-RECORD                          AFTER 1.
022100     PERFORM  BLANK-LINE-PRINT.
022200     MOVE     HEADER-LINE-2 TO DUMMY-RECORD.
022300     WRITE    DUMMY-RECORD                          AFTER 1.
022400     PERFORM  BLANK-LINE-PRINT 4 TIMES.
022500     MOVE HEADER-LINE-3 TO DUMMY-RECORD.
022600     WRITE DUMMY-RECORD                             AFTER 1.
022700     PERFORM BLANK-LINE-PRINT 2 TIMES.
022800    COLUMN-NAMES-ROUTINE.
022900     MOVE     COLUMNS-LINE-1 TO DUMMY-RECORD.
023000     WRITE    DUMMY-RECORD                          AFTER 1.
023100     MOVE     SPACE TO PAGE-CONTROL-C.
023200     MOVE     COLUMNS-LINE-2 TO DUMMY-RECORD.
023300     WRITE    DUMMY-RECORD                          AFTER 1.
023400     PERFORM  BLANK-LINE-PRINT.
023500     MOVE     HYPHEN-LINE TO DUMMY-RECORD.
023600     WRITE    DUMMY-RECORD                          AFTER 1.
023700    END-ROUTINE.
023800     MOVE     HYPHEN-LINE TO DUMMY-RECORD.
023900     WRITE    DUMMY-RECORD                          AFTER 1.
024000    PARA-Z.
024100     PERFORM  BLANK-LINE-PRINT 4 TIMES.
024200     MOVE     ENDER-LINE-1 TO DUMMY-RECORD.
024300     WRITE    DUMMY-RECORD                          AFTER 1.
024400    END-ROUTINE-1.
024500     PERFORM  BLANK-LINE-PRINT.
024600     MOVE   "TESTS REQUIRE VISUAL INSPECTION" TO ENDER-DESC.
024700    END-ROUTINE-2.
024800     MOVE " 15" TO ERROR-TOTAL.
024900    END-ROUTINE-3.
025000     MOVE     ENDER-LINE-2 TO DUMMY-RECORD.
025100     WRITE    DUMMY-RECORD                          AFTER 1.
025200     IF DELETE-CNT IS EQUAL TO ZERO
025300         MOVE " NO" TO ERROR-TOTAL  ELSE
025400     MOVE DELETE-CNT TO ERROR-TOTAL.
025500     MOVE "TESTS DELETED     " TO ENDER-DESC.
025600     MOVE ENDER-LINE-2 TO DUMMY-RECORD.
025700     WRITE DUMMY-RECORD                             AFTER 1.
025800     MOVE ENDER-LINE-3 TO DUMMY-RECORD.
025900     WRITE DUMMY-RECORD                             AFTER 1.
026000    BLANK-LINE-PRINT.
026100     MOVE     SPACE TO DUMMY-RECORD.
026200     WRITE    DUMMY-RECORD                          AFTER 1.
