000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC111A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*   PROGRAM NC111A TESTS THE TRUNCATION OF RESULTANT IDENTIFIERS
002300*         USING ADD SUBTRACT AND MULTIPLY STATEMENTS.
002400*
002500*
002600
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 01  N-11                               PICTURE IS 9 VALUE IS 9.
004400 01  N-12                               PICTURE IS 9 VALUE IS 9.
004500 01  N-40                               PICTURE IS 9(7)
004600     VALUE IS 7777777.
004700 01  N-41                               PICTURE IS 9(7)
004800     VALUE IS 1111111.
004900 01  N-42                               PICTURE IS 9(3)P(4).
005000 01  TRUNC-DATA.
005100     02 N-43  PICTURE S9V9 VALUE +1.6.
005200     02 N-44  PICTURE S9V9 VALUE -1.6.
005300     02 N-45  PICTURE S9.
005400 01  TEST-RESULTS.
005500     02 FILLER                   PIC X      VALUE SPACE.
005600     02 FEATURE                  PIC X(20)  VALUE SPACE.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005900     02 FILLER                   PIC X      VALUE SPACE.
006000     02  PAR-NAME.
006100       03 FILLER                 PIC X(19)  VALUE SPACE.
006200       03  PARDOT-X              PIC X      VALUE SPACE.
006300       03 DOTVALUE               PIC 99     VALUE ZERO.
006400     02 FILLER                   PIC X(8)   VALUE SPACE.
006500     02 RE-MARK                  PIC X(61).
006600 01  TEST-COMPUTED.
006700     02 FILLER                   PIC X(30)  VALUE SPACE.
006800     02 FILLER                   PIC X(17)  VALUE
006900            "       COMPUTED=".
007000     02 COMPUTED-X.
007100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007200     03 COMPUTED-N               REDEFINES COMPUTED-A
007300                                 PIC -9(9).9(9).
007400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007700     03       CM-18V0 REDEFINES COMPUTED-A.
007800         04 COMPUTED-18V0                    PIC -9(18).
007900         04 FILLER                           PIC X.
008000     03 FILLER PIC X(50) VALUE SPACE.
008100 01  TEST-CORRECT.
008200     02 FILLER PIC X(30) VALUE SPACE.
008300     02 FILLER PIC X(17) VALUE "       CORRECT =".
008400     02 CORRECT-X.
008500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009000     03      CR-18V0 REDEFINES CORRECT-A.
009100         04 CORRECT-18V0                     PIC -9(18).
009200         04 FILLER                           PIC X.
009300     03 FILLER PIC X(2) VALUE SPACE.
009400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009500 01  CCVS-C-1.
009600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
009700-    "SS  PARAGRAPH-NAME
009800-    "       REMARKS".
009900     02 FILLER                     PIC X(20)    VALUE SPACE.
010000 01  CCVS-C-2.
010100     02 FILLER                     PIC X        VALUE SPACE.
010200     02 FILLER                     PIC X(6)     VALUE "TESTED".
010300     02 FILLER                     PIC X(15)    VALUE SPACE.
010400     02 FILLER                     PIC X(4)     VALUE "FAIL".
010500     02 FILLER                     PIC X(94)    VALUE SPACE.
010600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
010700 01  REC-CT                        PIC 99       VALUE ZERO.
010800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
010900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
011000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
011100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
011200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
011300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
011400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
011500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
011600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
011700 01  CCVS-H-1.
011800     02  FILLER                    PIC X(39)    VALUE SPACES.
011900     02  FILLER                    PIC X(42)    VALUE
012000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
012100     02  FILLER                    PIC X(39)    VALUE SPACES.
012200 01  CCVS-H-2A.
012300   02  FILLER                        PIC X(40)  VALUE SPACE.
012400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
012500   02  FILLER                        PIC XXXX   VALUE
012600     "4.2 ".
012700   02  FILLER                        PIC X(28)  VALUE
012800            " COPY - NOT FOR DISTRIBUTION".
012900   02  FILLER                        PIC X(41)  VALUE SPACE.
013000
013100 01  CCVS-H-2B.
013200   02  FILLER                        PIC X(15)  VALUE
013300            "TEST RESULT OF ".
013400   02  TEST-ID                       PIC X(9).
013500   02  FILLER                        PIC X(4)   VALUE
013600            " IN ".
013700   02  FILLER                        PIC X(12)  VALUE
013800     " HIGH       ".
013900   02  FILLER                        PIC X(22)  VALUE
014000            " LEVEL VALIDATION FOR ".
014100   02  FILLER                        PIC X(58)  VALUE
014200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014300 01  CCVS-H-3.
014400     02  FILLER                      PIC X(34)  VALUE
014500            " FOR OFFICIAL USE ONLY    ".
014600     02  FILLER                      PIC X(58)  VALUE
014700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
014800     02  FILLER                      PIC X(28)  VALUE
014900            "  COPYRIGHT   1985 ".
015000 01  CCVS-E-1.
015100     02 FILLER                       PIC X(52)  VALUE SPACE.
015200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
015300     02 ID-AGAIN                     PIC X(9).
015400     02 FILLER                       PIC X(45)  VALUE SPACES.
015500 01  CCVS-E-2.
015600     02  FILLER                      PIC X(31)  VALUE SPACE.
015700     02  FILLER                      PIC X(21)  VALUE SPACE.
015800     02 CCVS-E-2-2.
015900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
016000         03 FILLER                   PIC X      VALUE SPACE.
016100         03 ENDER-DESC               PIC X(44)  VALUE
016200            "ERRORS ENCOUNTERED".
016300 01  CCVS-E-3.
016400     02  FILLER                      PIC X(22)  VALUE
016500            " FOR OFFICIAL USE ONLY".
016600     02  FILLER                      PIC X(12)  VALUE SPACE.
016700     02  FILLER                      PIC X(58)  VALUE
016800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016900     02  FILLER                      PIC X(13)  VALUE SPACE.
017000     02 FILLER                       PIC X(15)  VALUE
017100             " COPYRIGHT 1985".
017200 01  CCVS-E-4.
017300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
017400     02 FILLER                       PIC X(4)   VALUE " OF ".
017500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
017600     02 FILLER                       PIC X(40)  VALUE
017700      "  TESTS WERE EXECUTED SUCCESSFULLY".
017800 01  XXINFO.
017900     02 FILLER                       PIC X(19)  VALUE
018000            "*** INFORMATION ***".
018100     02 INFO-TEXT.
018200       04 FILLER                     PIC X(8)   VALUE SPACE.
018300       04 XXCOMPUTED                 PIC X(20).
018400       04 FILLER                     PIC X(5)   VALUE SPACE.
018500       04 XXCORRECT                  PIC X(20).
018600     02 INF-ANSI-REFERENCE           PIC X(48).
018700 01  HYPHEN-LINE.
018800     02 FILLER  PIC IS X VALUE IS SPACE.
018900     02 FILLER  PIC IS X(65)    VALUE IS "************************
019000-    "*****************************************".
019100     02 FILLER  PIC IS X(54)    VALUE IS "************************
019200-    "******************************".
019300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
019400     "NC111A".
019500 PROCEDURE DIVISION.
019600 CCVS1 SECTION.
019700 OPEN-FILES.
019800     OPEN     OUTPUT PRINT-FILE.
019900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
020000     MOVE    SPACE TO TEST-RESULTS.
020100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
020200     GO TO CCVS1-EXIT.
020300 CLOSE-FILES.
020400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
020500 TERMINATE-CCVS.
020600S    EXIT PROGRAM.
020700STERMINATE-CALL.
020800     STOP     RUN.
020900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
021000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
021100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
021200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
021300     MOVE "****TEST DELETED****" TO RE-MARK.
021400 PRINT-DETAIL.
021500     IF REC-CT NOT EQUAL TO ZERO
021600             MOVE "." TO PARDOT-X
021700             MOVE REC-CT TO DOTVALUE.
021800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
021900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
022000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
022100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
022200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
022300     MOVE SPACE TO CORRECT-X.
022400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
022500     MOVE     SPACE TO RE-MARK.
022600 HEAD-ROUTINE.
022700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023100 COLUMN-NAMES-ROUTINE.
023200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
023500 END-ROUTINE.
023600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
023700 END-RTN-EXIT.
023800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023900 END-ROUTINE-1.
024000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
024100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
024200      ADD PASS-COUNTER TO ERROR-HOLD.
024300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
024400      MOVE PASS-COUNTER TO CCVS-E-4-1.
024500      MOVE ERROR-HOLD TO CCVS-E-4-2.
024600      MOVE CCVS-E-4 TO CCVS-E-2-2.
024700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
024800  END-ROUTINE-12.
024900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
025000     IF       ERROR-COUNTER IS EQUAL TO ZERO
025100         MOVE "NO " TO ERROR-TOTAL
025200         ELSE
025300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
025400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
025500     PERFORM WRITE-LINE.
025600 END-ROUTINE-13.
025700     IF DELETE-COUNTER IS EQUAL TO ZERO
025800         MOVE "NO " TO ERROR-TOTAL  ELSE
025900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
026000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
026100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026200      IF   INSPECT-COUNTER EQUAL TO ZERO
026300          MOVE "NO " TO ERROR-TOTAL
026400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
026500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
026600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026800 WRITE-LINE.
026900     ADD 1 TO RECORD-COUNT.
027000Y    IF RECORD-COUNT GREATER 42
027100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
027200Y        MOVE SPACE TO DUMMY-RECORD
027300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
027400Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
027500Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
027600Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
027700Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
027800Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
027900Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
028000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
028100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
028200Y        MOVE ZERO TO RECORD-COUNT.
028300     PERFORM WRT-LN.
028400 WRT-LN.
028500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
028600     MOVE SPACE TO DUMMY-RECORD.
028700 BLANK-LINE-PRINT.
028800     PERFORM WRT-LN.
028900 FAIL-ROUTINE.
029000     IF     COMPUTED-X NOT EQUAL TO SPACE
029100            GO TO FAIL-ROUTINE-WRITE.
029200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
029500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029600     MOVE   SPACES TO INF-ANSI-REFERENCE.
029700     GO TO  FAIL-ROUTINE-EX.
029800 FAIL-ROUTINE-WRITE.
029900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
030000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
030100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
030200     MOVE   SPACES TO COR-ANSI-REFERENCE.
030300 FAIL-ROUTINE-EX. EXIT.
030400 BAIL-OUT.
030500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
030600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
030700 BAIL-OUT-WRITE.
030800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
030900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031100     MOVE   SPACES TO INF-ANSI-REFERENCE.
031200 BAIL-OUT-EX. EXIT.
031300 CCVS1-EXIT.
031400     EXIT.
031500 SECT-NC111A-001 SECTION.
031600 BLURB-REMARK.
031700     MOVE     SPACE TO TEST-RESULTS.
031800     MOVE "THE FOLLOWING 3 TESTS TEST " TO RE-MARK.
031900     PERFORM  PRINT-DETAIL.
032000     MOVE "SOME SPECIFIC FEATURES OF  " TO RE-MARK.
032100     PERFORM  PRINT-DETAIL.
032200     MOVE "THE TRUNCATION, ROUNDED AND" TO RE-MARK.
032300     PERFORM  PRINT-DETAIL.
032400     MOVE "SIZE ERROR OPTIONS. GENERAL" TO RE-MARK.
032500     PERFORM  PRINT-DETAIL.
032600     MOVE "FEATURES OF THESE OPTIONS  " TO RE-MARK.
032700     PERFORM  PRINT-DETAIL.
032800     MOVE "ARE TESTED IN THE ADD, SUB-" TO RE-MARK.
032900     PERFORM  PRINT-DETAIL.
033000     MOVE "TRACT, MULTIPLY, AND DIVIDE" TO RE-MARK.
033100     PERFORM  PRINT-DETAIL.
033200     MOVE "TESTS.                     " TO RE-MARK.
033300     PERFORM  PRINT-DETAIL.
033400 TRU-INIT-GF-1.
033500     MOVE   "V1-67 6.4.1" TO ANSI-REFERENCE.
033600     MOVE    7777777 TO N-40.
033700     MOVE    1111111 TO N-41.
033800 TRU-TEST-GF-1-0.
033900     ADD      N-40 N-41 GIVING N-42.
034000 TRU-TEST-GF-1-1.
034100     IF       N-42 EQUAL TO 8880000
034200              PERFORM PASS
034300              GO TO TRU-WRITE-GF-1.
034400     GO TO    TRU-FAIL-GF-1.
034500 TRU-DELETE-GF-1.
034600     PERFORM  DE-LETE.
034700     GO TO    TRU-WRITE-GF-1.
034800 TRU-FAIL-GF-1.
034900     MOVE     N-42 TO COMPUTED-N.
035000     MOVE     8880000 TO CORRECT-N.
035100     PERFORM  FAIL.
035200 TRU-WRITE-GF-1.
035300     MOVE "TRUNCATION" TO FEATURE.
035400     MOVE "TRU-TEST-GF-1" TO PAR-NAME.
035500     PERFORM  PRINT-DETAIL.
035600 TRU-INIT-GF-2.
035700     MOVE   "V1-67 6.4.1" TO ANSI-REFERENCE.
035800     MOVE    ZERO TO N-45.
035900     MOVE   +1.6  TO N-43.
036000 TRU-TEST-GF-2-0.
036100     ADD      N-43 1.4       GIVING N-45.
036200 TRU-TEST-GF-2-1.
036300     IF       N-45 EQUAL TO +3
036400              PERFORM PASS GO TO TRU-WRITE-GF-2.
036500     GO       TO TRU-FAIL-GF-2.
036600 TRU-DELETE-GF-2.
036700     PERFORM  DE-LETE.
036800     GO       TO TRU-WRITE-GF-2.
036900 TRU-FAIL-GF-2.
037000     PERFORM  FAIL.
037100     MOVE     N-45 TO COMPUTED-N.
037200     MOVE     3 TO CORRECT-N.
037300 TRU-WRITE-GF-2.
037400     MOVE     "TRU-TEST-GF-2 " TO PAR-NAME.
037500     PERFORM  PRINT-DETAIL.
037600 TRU-INIT-GF-3.
037700     MOVE   "V1-67 6.4.1" TO ANSI-REFERENCE.
037800     MOVE    ZERO TO N-45.
037900     MOVE   -1.6  TO N-44.
038000 TRU-TEST-GF-3-0.
038100     ADD      N-44 -1.4      GIVING N-45.
038200 TRU-TEST-GF-3-1.
038300     IF       N-45 EQUAL TO -3
038400              PERFORM PASS GO TO TRU-WRITE-GF-3.
038500     GO       TO TRU-FAIL-GF-3.
038600 TRU-DELETE-GF-3.
038700     PERFORM  DE-LETE.
038800     GO       TO TRU-WRITE-GF-3.
038900 TRU-FAIL-GF-3.
039000     PERFORM  FAIL.
039100     MOVE     N-45 TO COMPUTED-N.
039200     MOVE     -3 TO CORRECT-N.
039300 TRU-WRITE-GF-3.
039400     MOVE     "TRU-TEST-GF-3 " TO PAR-NAME.
039500     PERFORM  PRINT-DETAIL.
039600 TRU-INIT-GF-4.
039700     MOVE   "V1-67 6.4.1" TO ANSI-REFERENCE.
039800     MOVE    ZERO TO N-45.
039900     MOVE   +1.6  TO N-43.
040000 TRU-TEST-GF-4-0.
040100     MULTIPLY 5 BY N-43      GIVING N-45.
040200 TRU-TEST-GF-4-1.
040300     IF       N-45 EQUAL TO +8
040400              PERFORM PASS GO TO TRU-WRITE-GF-4.
040500     GO       TO TRU-FAIL-GF-4.
040600 TRU-DELETE-GF-4.
040700     PERFORM  DE-LETE.
040800     GO       TO TRU-WRITE-GF-4.
040900 TRU-FAIL-GF-4.
041000     PERFORM  FAIL.
041100     MOVE     N-45 TO COMPUTED-N.
041200     MOVE     8 TO CORRECT-N.
041300 TRU-WRITE-GF-4.
041400     MOVE     "TRU-TEST-GF-4 " TO PAR-NAME.
041500     PERFORM  PRINT-DETAIL.
041600 TRU-INIT-GF-5.
041700     MOVE   "V1-67 6.4.1" TO ANSI-REFERENCE.
041800     MOVE    ZERO TO N-45.
041900     MOVE   -1.6  TO N-44.
042000 TRU-TEST-GF-5-0.
042100     MULTIPLY 5 BY N-44      GIVING N-45.
042200 TRU-TEST-GF-5-1.
042300     IF       N-45 EQUAL TO -8
042400              PERFORM PASS GO TO TRU-WRITE-GF-5.
042500     GO       TO TRU-FAIL-GF-5.
042600 TRU-DELETE-GF-5.
042700     PERFORM  DE-LETE.
042800     GO       TO TRU-WRITE-GF-5.
042900 TRU-FAIL-GF-5.
043000     PERFORM  FAIL.
043100     MOVE     N-45 TO COMPUTED-N.
043200     MOVE     -8 TO CORRECT-N.
043300 TRU-WRITE-GF-5.
043400     MOVE     "TRU-TEST-GF-5 " TO PAR-NAME.
043500     PERFORM  PRINT-DETAIL.
043600 TRU-INIT-GF-6.
043700     MOVE   "V1-67 6.4.1" TO ANSI-REFERENCE.
043800     MOVE    ZERO TO N-45.
043900     MOVE   +1.6  TO N-43.
044000 TRU-TEST-GF-6-0.
044100     SUBTRACT -1.4 FROM N-43 GIVING N-45.
044200 TRU-TEST-GF-6-1.
044300     IF       N-45 EQUAL TO +3
044400              PERFORM PASS GO TO TRU-WRITE-GF-6.
044500     GO       TO TRU-FAIL-GF-6.
044600 TRU-DELETE-GF-6.
044700     PERFORM  DE-LETE.
044800     GO       TO TRU-WRITE-GF-6.
044900 TRU-FAIL-GF-6.
045000     PERFORM  FAIL.
045100     MOVE     N-45 TO COMPUTED-N.
045200     MOVE     3 TO CORRECT-N.
045300 TRU-WRITE-GF-6.
045400     MOVE     "TRU-TEST-GF-6 " TO PAR-NAME.
045500     PERFORM  PRINT-DETAIL.
045600 TRU-INIT-GF-7.
045700     MOVE   "V1-67 6.4.1" TO ANSI-REFERENCE.
045800     MOVE    ZERO TO N-45.
045900     MOVE   -1.6  TO N-44.
046000 TRU-TEST-GF-7-0.
046100     SUBTRACT +1.4 FROM N-44 GIVING N-45.
046200 TRU-TEST-GF-7-1.
046300     IF       N-45 EQUAL TO -3
046400              PERFORM PASS GO TO TRU-WRITE-GF-7.
046500     GO       TO TRU-FAIL-GF-7.
046600 TRU-DELETE-GF-7.
046700     PERFORM  DE-LETE.
046800     GO       TO TRU-WRITE-GF-7.
046900 TRU-FAIL-GF-7.
047000     PERFORM  FAIL.
047100     MOVE     N-45 TO COMPUTED-N.
047200     MOVE     -3 TO CORRECT-N.
047300 TRU-WRITE-GF-7.
047400     MOVE     "TRU-TEST-GF-7 " TO PAR-NAME.
047500     PERFORM  PRINT-DETAIL.
047600 CCVS-EXIT SECTION.
047700 CCVS-999999.
047800     GO TO CLOSE-FILES.
