000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC116A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC116A TESTS THE USE OF THE SIGN CLAUSE
002300*    USING THE "IF" AND "MOVE" STATEMENTS.  ALL COMBINATIONS
002400*    OF THE SIGN CLAUSE PHRASES ARE TESTED USING DATA ITEMS OF
002500*    VARIOUS LENGTHS.
002600*
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300*=======================
004400 01  TEST-17-DATA  SIGN TRAILING.
004500   03  TEST-17-A          PIC S9(4).
004600   03  TEST-17-B          PIC S9(4).
004700   03  TEST-17-GROUP SIGN LEADING SEPARATE.
004800     05  TEST-17-C        PIC S9(4).
004900     05  FILLER           REDEFINES TEST-17-C.
005000       07  TEST-17-C-SIGN PIC X.
005100       07  FILLER         PIC X(4).
005200
005300 01  TEST-18-DATA  SIGN TRAILING.
005400   03  TEST-18-A          PIC S9(4).
005500   03  TEST-18-B          PIC S9(4)  SIGN LEADING SEPARATE.
005600   03  TEST-18-BX         REDEFINES TEST-18-B.
005700     05  TEST-18-B-SIGN   PIC X.
005800     05  FILLER           PIC X(4).
005900   03  TEST-18-C          PIC S9(4).
006000 01  DS-LS-5  PICTURE S99999
006100         SIGN IS LEADING SEPARATE CHARACTER
006200         VALUE +91275.
006300 01  GRP-001 REDEFINES DS-LS-5.
006400     02  TEST1-AN-1 PICTURE X.
006500     02  TEST1-AN-5 PICTURE X(5).
006600 01  DS-LS-4 PICTURE S9999
006700         SIGN IS LEADING SEPARATE CHARACTER
006800         VALUE -9127.
006900 01  GRP-002 REDEFINES DS-LS-4.
007000     02  TEST1N-AN-1 PICTURE X.
007100     02  TEST1N-AN-4 PICTURE X(4).
007200 01  DS-TS-5  PICTURE S99999
007300         SIGN IS TRAILING SEPARATE CHARACTER
007400         VALUE +80361.
007500 01  GRP-003 REDEFINES DS-TS-5.
007600     02  TEST2-AN-5 PICTURE X(5).
007700     02  TEST2-AN-1 PICTURE X.
007800 01  DS-TS-4 PICTURE S9999
007900         SIGN IS TRAILING SEPARATE CHARACTER
008000         VALUE -8036.
008100 01  GRP-004 REDEFINES DS-TS-4.
008200     02  TEST2N-AN-4 PICTURE X(4).
008300     02  TEST2N-AN-1 PICTURE X.
008400 01  DS-L-5  PICTURE S99999  VALUE +91275
008500         SIGN IS LEADING.
008600 01  GRP-005 REDEFINES DS-L-5.
008700     02  TEST3-AN-1  PICTURE X.
008800     02  TEST3-AN-4  PICTURE X(4).
008900 01  DS-L-4  PICTURE S9999   VALUE -9127
009000         SIGN IS LEADING.
009100 01  GRP-006 REDEFINES DS-L-4.
009200     02  TEST3N-AN-1 PICTURE X.
009300     02  TEST3N-AN-3 PICTURE XXX.
009400 01  DS-T-5  PICTURE S99999  VALUE +83621
009500         SIGN IS TRAILING.
009600 01  GRP-007 REDEFINES DS-T-5.
009700     02  TEST4-AN-4  PICTURE X(4).
009800     02  TEST4-AN-1  PICTURE X.
009900 01  DS-T-4  PICTURE S9999   VALUE -3621
010000         SIGN IS TRAILING.
010100 01  GRP-008 REDEFINES DS-T-4.
010200     02  TEST4N-AN-3 PICTURE XXX.
010300     02  TEST4N-AN-1 PICTURE X.
010400 01  DU-005  PICTURE 9(5) VALUE ZERO.
010500 01  DS-005  PICTURE S9(5) VALUE 0.
010600 01  CU-005  PICTURE 9(5)  USAGE COMPUTATIONAL  VALUE 0.
010700 01  CS-005  PICTURE S9(5)  USAGE COMPUTATIONAL  VALUE 0.
010800 01  WRK-DS-LS-5 PICTURE S99999   VALUE ZERO
010900         SIGN LEADING SEPARATE.
011000 01  GRP-09 REDEFINES WRK-DS-LS-5 PICTURE X(6).
011100 01  WRK-DS-TS-5 PICTURE S99999  VALUE ZERO
011200         SIGN TRAILING SEPARATE.
011300 01  GRP-10 REDEFINES WRK-DS-TS-5 PICTURE X(6).
011400 01  WRK-DS-L-5 PICTURE S99999   VALUE ZERO
011500         SIGN LEADING.
011600 01  WRK-DS-T-5 PICTURE S99999   VALUE ZERO
011700         SIGN TRAILING.
011800 01  AN-006  PICTURE X(6) VALUE SPACE.
011900 01  DS-L-00008         PIC S9(8) SIGN LEADING VALUE +01234567.
012000 01  AN-00008-X-1 REDEFINES DS-L-00008      PIC X(8).
012100 01  DS-T-00008         PIC S9(8) SIGN TRAILING VALUE -01234567.
012200 01  AN-00008-X-2 REDEFINES DS-T-00008      PIC X(8).
012300 01  DS-T-00008-1       PIC S9(8) SIGN TRAILING VALUE +01234567.
012400 01  AN-00008-X-5 REDEFINES DS-T-00008-1     PIC X(8).
012500 01  DS-LS-00008        PIC S9(8)
012600                        SIGN IS LEADING SEPARATE CHARACTER
012700                        VALUE -07654321.
012800 01  AN-00009-X-3 REDEFINES DS-LS-00008     PIC X(9).
012900 01  DS-LS-00008-1      PIC S9(8)
013000                        SIGN IS LEADING SEPARATE CHARACTER
013100                        VALUE +07654321.
013200 01  AN-00009-X-6 REDEFINES DS-LS-00008-1   PIC X(9).
013300 01  DS-TS-00008        PIC S9(8)
013400                        SIGN TRAILING SEPARATE
013500                        VALUE +07654321.
013600 01  AN-00009-X-4 REDEFINES DS-TS-00008     PIC X(9).
013700 01  CS-00007-1         PIC S9(7) COMPUTATIONAL VALUE +1234567.
013800 01  CU-00007-1         PIC  9(7) COMPUTATIONAL VALUE  1234567.
013900 01  DS-00007-1         PIC S9(7) DISPLAY       VALUE +1234567.
014000 01  DU-00007-1         PIC  9(7) DISPLAY       VALUE  1234567.
014100 01  CS-00007-2         PIC S9(7) COMPUTATIONAL VALUE -1234567.
014200 01  CU-00007-2        PIC  9(7) COMPUTATIONAL VALUE  1234567.
014300 01  DS-00007-2         PIC S9(7) DISPLAY       VALUE -1234567.
014400 01  DU-00007-2         PIC  9(7) DISPLAY       VALUE  1234567.
014500 01  CS-00007-3         PIC S9(7) COMPUTATIONAL VALUE -7654321.
014600 01  CU-00007-3         PIC  9(7) COMPUTATIONAL VALUE  7654321.
014700 01  DS-00007-3         PIC S9(7) DISPLAY       VALUE -7654321.
014800 01  DU-00007-3         PIC  9(7) DISPLAY       VALUE  7654321.
014900 01  CS-00007-4         PIC S9(7) COMPUTATIONAL VALUE +7654321.
015000 01  CU-00007-4         PIC  9(7) COMPUTATIONAL VALUE  7654321.
015100 01  DS-00007-4         PIC S9(7) DISPLAY       VALUE +7654321.
015200 01  DU-00007-4         PIC  9(7) DISPLAY       VALUE  7654321.
015300 01  TEST-RESULTS.
015400     02 FILLER                   PIC X      VALUE SPACE.
015500     02 FEATURE                  PIC X(20)  VALUE SPACE.
015600     02 FILLER                   PIC X      VALUE SPACE.
015700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
015800     02 FILLER                   PIC X      VALUE SPACE.
015900     02  PAR-NAME.
016000       03 FILLER                 PIC X(19)  VALUE SPACE.
016100       03  PARDOT-X              PIC X      VALUE SPACE.
016200       03 DOTVALUE               PIC 99     VALUE ZERO.
016300     02 FILLER                   PIC X(8)   VALUE SPACE.
016400     02 RE-MARK                  PIC X(61).
016500 01  TEST-COMPUTED.
016600     02 FILLER                   PIC X(30)  VALUE SPACE.
016700     02 FILLER                   PIC X(17)  VALUE
016800            "       COMPUTED=".
016900     02 COMPUTED-X.
017000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
017100     03 COMPUTED-N               REDEFINES COMPUTED-A
017200                                 PIC -9(9).9(9).
017300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
017400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
017500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
017600     03       CM-18V0 REDEFINES COMPUTED-A.
017700         04 COMPUTED-18V0                    PIC -9(18).
017800         04 FILLER                           PIC X.
017900     03 FILLER PIC X(50) VALUE SPACE.
018000 01  TEST-CORRECT.
018100     02 FILLER PIC X(30) VALUE SPACE.
018200     02 FILLER PIC X(17) VALUE "       CORRECT =".
018300     02 CORRECT-X.
018400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
018500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
018600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
018700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
018800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
018900     03      CR-18V0 REDEFINES CORRECT-A.
019000         04 CORRECT-18V0                     PIC -9(18).
019100         04 FILLER                           PIC X.
019200     03 FILLER PIC X(2) VALUE SPACE.
019300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
019400 01  CCVS-C-1.
019500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
019600-    "SS  PARAGRAPH-NAME
019700-    "       REMARKS".
019800     02 FILLER                     PIC X(20)    VALUE SPACE.
019900 01  CCVS-C-2.
020000     02 FILLER                     PIC X        VALUE SPACE.
020100     02 FILLER                     PIC X(6)     VALUE "TESTED".
020200     02 FILLER                     PIC X(15)    VALUE SPACE.
020300     02 FILLER                     PIC X(4)     VALUE "FAIL".
020400     02 FILLER                     PIC X(94)    VALUE SPACE.
020500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
020600 01  REC-CT                        PIC 99       VALUE ZERO.
020700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
020800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
020900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
021000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
021100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
021200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
021300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
021400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
021500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
021600 01  CCVS-H-1.
021700     02  FILLER                    PIC X(39)    VALUE SPACES.
021800     02  FILLER                    PIC X(42)    VALUE
021900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
022000     02  FILLER                    PIC X(39)    VALUE SPACES.
022100 01  CCVS-H-2A.
022200   02  FILLER                        PIC X(40)  VALUE SPACE.
022300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
022400   02  FILLER                        PIC XXXX   VALUE
022500     "4.2 ".
022600   02  FILLER                        PIC X(28)  VALUE
022700            " COPY - NOT FOR DISTRIBUTION".
022800   02  FILLER                        PIC X(41)  VALUE SPACE.
022900
023000 01  CCVS-H-2B.
023100   02  FILLER                        PIC X(15)  VALUE
023200            "TEST RESULT OF ".
023300   02  TEST-ID                       PIC X(9).
023400   02  FILLER                        PIC X(4)   VALUE
023500            " IN ".
023600   02  FILLER                        PIC X(12)  VALUE
023700     " HIGH       ".
023800   02  FILLER                        PIC X(22)  VALUE
023900            " LEVEL VALIDATION FOR ".
024000   02  FILLER                        PIC X(58)  VALUE
024100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024200 01  CCVS-H-3.
024300     02  FILLER                      PIC X(34)  VALUE
024400            " FOR OFFICIAL USE ONLY    ".
024500     02  FILLER                      PIC X(58)  VALUE
024600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
024700     02  FILLER                      PIC X(28)  VALUE
024800            "  COPYRIGHT   1985 ".
024900 01  CCVS-E-1.
025000     02 FILLER                       PIC X(52)  VALUE SPACE.
025100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
025200     02 ID-AGAIN                     PIC X(9).
025300     02 FILLER                       PIC X(45)  VALUE SPACES.
025400 01  CCVS-E-2.
025500     02  FILLER                      PIC X(31)  VALUE SPACE.
025600     02  FILLER                      PIC X(21)  VALUE SPACE.
025700     02 CCVS-E-2-2.
025800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
025900         03 FILLER                   PIC X      VALUE SPACE.
026000         03 ENDER-DESC               PIC X(44)  VALUE
026100            "ERRORS ENCOUNTERED".
026200 01  CCVS-E-3.
026300     02  FILLER                      PIC X(22)  VALUE
026400            " FOR OFFICIAL USE ONLY".
026500     02  FILLER                      PIC X(12)  VALUE SPACE.
026600     02  FILLER                      PIC X(58)  VALUE
026700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026800     02  FILLER                      PIC X(13)  VALUE SPACE.
026900     02 FILLER                       PIC X(15)  VALUE
027000             " COPYRIGHT 1985".
027100 01  CCVS-E-4.
027200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
027300     02 FILLER                       PIC X(4)   VALUE " OF ".
027400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
027500     02 FILLER                       PIC X(40)  VALUE
027600      "  TESTS WERE EXECUTED SUCCESSFULLY".
027700 01  XXINFO.
027800     02 FILLER                       PIC X(19)  VALUE
027900            "*** INFORMATION ***".
028000     02 INFO-TEXT.
028100       04 FILLER                     PIC X(8)   VALUE SPACE.
028200       04 XXCOMPUTED                 PIC X(20).
028300       04 FILLER                     PIC X(5)   VALUE SPACE.
028400       04 XXCORRECT                  PIC X(20).
028500     02 INF-ANSI-REFERENCE           PIC X(48).
028600 01  HYPHEN-LINE.
028700     02 FILLER  PIC IS X VALUE IS SPACE.
028800     02 FILLER  PIC IS X(65)    VALUE IS "************************
028900-    "*****************************************".
029000     02 FILLER  PIC IS X(54)    VALUE IS "************************
029100-    "******************************".
029200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
029300     "NC116A".
029400 PROCEDURE DIVISION.
029500 CCVS1 SECTION.
029600 OPEN-FILES.
029700     OPEN     OUTPUT PRINT-FILE.
029800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
029900     MOVE    SPACE TO TEST-RESULTS.
030000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
030100     GO TO CCVS1-EXIT.
030200 CLOSE-FILES.
030300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
030400 TERMINATE-CCVS.
030500S    EXIT PROGRAM.
030600STERMINATE-CALL.
030700     STOP     RUN.
030800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
030900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
031000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
031100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
031200     MOVE "****TEST DELETED****" TO RE-MARK.
031300 PRINT-DETAIL.
031400     IF REC-CT NOT EQUAL TO ZERO
031500             MOVE "." TO PARDOT-X
031600             MOVE REC-CT TO DOTVALUE.
031700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
031800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
031900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
032000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
032100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
032200     MOVE SPACE TO CORRECT-X.
032300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
032400     MOVE     SPACE TO RE-MARK.
032500 HEAD-ROUTINE.
032600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
032900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
033000 COLUMN-NAMES-ROUTINE.
033100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
033400 END-ROUTINE.
033500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
033600 END-RTN-EXIT.
033700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033800 END-ROUTINE-1.
033900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
034000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
034100      ADD PASS-COUNTER TO ERROR-HOLD.
034200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
034300      MOVE PASS-COUNTER TO CCVS-E-4-1.
034400      MOVE ERROR-HOLD TO CCVS-E-4-2.
034500      MOVE CCVS-E-4 TO CCVS-E-2-2.
034600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
034700  END-ROUTINE-12.
034800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
034900     IF       ERROR-COUNTER IS EQUAL TO ZERO
035000         MOVE "NO " TO ERROR-TOTAL
035100         ELSE
035200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
035300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
035400     PERFORM WRITE-LINE.
035500 END-ROUTINE-13.
035600     IF DELETE-COUNTER IS EQUAL TO ZERO
035700         MOVE "NO " TO ERROR-TOTAL  ELSE
035800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
035900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
036000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036100      IF   INSPECT-COUNTER EQUAL TO ZERO
036200          MOVE "NO " TO ERROR-TOTAL
036300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
036400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
036500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036700 WRITE-LINE.
036800     ADD 1 TO RECORD-COUNT.
036900Y    IF RECORD-COUNT GREATER 42
037000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
037100Y        MOVE SPACE TO DUMMY-RECORD
037200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
037300Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
037400Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
037500Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
037600Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
037700Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
037800Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
037900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
038000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
038100Y        MOVE ZERO TO RECORD-COUNT.
038200     PERFORM WRT-LN.
038300 WRT-LN.
038400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
038500     MOVE SPACE TO DUMMY-RECORD.
038600 BLANK-LINE-PRINT.
038700     PERFORM WRT-LN.
038800 FAIL-ROUTINE.
038900     IF     COMPUTED-X NOT EQUAL TO SPACE
039000            GO TO FAIL-ROUTINE-WRITE.
039100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
039200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
039300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
039400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039500     MOVE   SPACES TO INF-ANSI-REFERENCE.
039600     GO TO  FAIL-ROUTINE-EX.
039700 FAIL-ROUTINE-WRITE.
039800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
039900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
040000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
040100     MOVE   SPACES TO COR-ANSI-REFERENCE.
040200 FAIL-ROUTINE-EX. EXIT.
040300 BAIL-OUT.
040400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
040500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
040600 BAIL-OUT-WRITE.
040700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
040800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
040900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041000     MOVE   SPACES TO INF-ANSI-REFERENCE.
041100 BAIL-OUT-EX. EXIT.
041200 CCVS1-EXIT.
041300     EXIT.
041400 SECT-NC116A-001 SECTION.
041500 SIG-INIT-GF-1.
041600     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
041700     MOVE "SIG-TEST-GF-1" TO PAR-NAME.
041800     MOVE 1 TO REC-CT.
041900     MOVE "SIGN LEADING SEPARATE" TO FEATURE.
042000     MOVE "LEADING SIGN EQUAL PLUS" TO RE-MARK.
042100 SIG-TEST-GF-1-1.
042200*        THIS TEST CHECKS THE SIGN AND THE NUMERIC CHARACTERS
042300*    OF AN ITEM DEFINED AS SIGN IS LEADING SEPARATE CHARACTER.
042400     IF TEST1-AN-1 EQUAL TO "+"
042500         PERFORM PASS
042600         GO TO SIG-WRTE-GF-1-1.
042700     GO TO SIG-FAIL-GF-1-1.
042800 SIG-DELETE-GF-1-1.
042900     PERFORM DE-LETE.
043000     PERFORM PRINT-DETAIL.
043100     GO TO   SIG-INIT-GF-2.
043200 SIG-FAIL-GF-1-1.
043300     PERFORM FAIL.
043400     MOVE "+" TO CORRECT-A.
043500     MOVE TEST1-AN-1 TO COMPUTED-A.
043600 SIG-WRTE-GF-1-1.
043700     PERFORM PRINT-DETAIL.
043800 SIG-TEST-GF-1-2.
043900     IF TEST1-AN-5 EQUAL TO "91275"
044000         PERFORM PASS
044100         GO TO SIG-WRTE-GF-1-2.
044200 SIG-FAIL-GF-1-2.
044300     PERFORM FAIL.
044400     MOVE "NUMERIC CHARACTERS" TO RE-MARK.
044500     MOVE "91275" TO CORRECT-A.
044600     MOVE TEST1-AN-5 TO COMPUTED-A.
044700 SIG-WRTE-GF-1-2.
044800     MOVE 2 TO REC-CT.
044900     PERFORM PRINT-DETAIL.
045000 SIG-TEST-GF-1-3.
045100     IF TEST1N-AN-1 NOT EQUAL TO  "-"
045200         GO TO SIG-FAIL-GF-1-3.
045300     PERFORM PASS.
045400     GO TO SIG-WRTE-GF-1-3.
045500 SIG-FAIL-GF-1-3.
045600     PERFORM FAIL.
045700     MOVE "-" TO CORRECT-A.
045800     MOVE TEST1N-AN-1 TO COMPUTED-A.
045900 SIG-WRTE-GF-1-3.
046000     MOVE 3 TO REC-CT.
046100     MOVE "LEADING SIGN EQUAL MINUS" TO RE-MARK.
046200     PERFORM PRINT-DETAIL.
046300 SIG-TEST-GF-1-4.
046400     IF TEST1N-AN-4 NOT EQUAL TO "9127"
046500         GO TO SIG-FAIL-GF-1-4.
046600     PERFORM PASS.
046700     GO TO SIG-WRTE-GF-1-4.
046800 SIG-FAIL-GF-1-4.
046900     PERFORM FAIL.
047000     MOVE "NUMERIC CHARACTERS" TO RE-MARK.
047100     MOVE "9127" TO CORRECT-A.
047200     MOVE TEST1N-AN-4 TO COMPUTED-A.
047300 SIG-WRTE-GF-1-4.
047400     MOVE 4 TO REC-CT.
047500     PERFORM PRINT-DETAIL.
047600 SIG-INIT-GF-2.
047700     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
047800     MOVE "SIG-TEST-GF-2" TO PAR-NAME.
047900     MOVE 1 TO REC-CT.
048000     MOVE "SIGN TRLNG SEPARATE" TO FEATURE.
048100     MOVE "TRAILING SIGN EQUAL PLUS" TO RE-MARK.
048200*        THIS TEST CHECKS THE SIGN AND THE NUMERIC CHARACTERS
048300*    OF AN ITEM DEFINED AS SIGN IS TRAILING SEPARATE CHARACTER.
048400 SIG-TEST-GF-2-1.
048500     IF TEST2-AN-1 EQUAL TO "+"
048600         PERFORM PASS
048700         GO TO SIG-WRTE-GF-2-1.
048800     GO TO SIG-FAIL-GF-2-1.
048900 SIG-DELETE-GF-2-1.
049000     PERFORM DE-LETE.
049100     PERFORM PRINT-DETAIL.
049200     GO TO   SIG-INIT-GF-3.
049300 SIG-FAIL-GF-2-1.
049400     PERFORM FAIL.
049500     MOVE "+" TO CORRECT-A.
049600     MOVE TEST2-AN-1 TO COMPUTED-A.
049700 SIG-WRTE-GF-2-1.
049800     PERFORM PRINT-DETAIL.
049900 SIGNTEST-GF-2-2.
050000     IF TEST2-AN-5 EQUAL TO "80361"
050100         PERFORM PASS
050200         GO TO SIG-WRTE-GF-2-2.
050300     GO TO SIG-FAIL-GF-2-2.
050400 SIG-FAIL-GF-2-2.
050500     PERFORM FAIL.
050600     MOVE "80361" TO CORRECT-A.
050700     MOVE TEST2-AN-5 TO COMPUTED-A.
050800     MOVE "NUMERIC CHARACTERS" TO RE-MARK.
050900 SIG-WRTE-GF-2-2.
051000     MOVE 2 TO REC-CT.
051100     PERFORM PRINT-DETAIL.
051200 SIG-TEST-GF-2-3.
051300     IF TEST2N-AN-1 NOT EQUAL TO "-"
051400         GO TO SIG-FAIL-GF-2-3.
051500     PERFORM PASS.
051600     GO TO SIG-WRTE-GF-2-3.
051700 SIG-FAIL-GF-2-3.
051800     PERFORM FAIL.
051900     MOVE "-" TO CORRECT-A.
052000     MOVE TEST2N-AN-1 TO COMPUTED-A.
052100 SIG-WRTE-GF-2-3.
052200     MOVE 3 TO REC-CT.
052300     MOVE "TRAILING SIGN EQUAL MINUS" TO RE-MARK.
052400     PERFORM PRINT-DETAIL.
052500 SIG-TEST-GF-2-4.
052600     IF TEST2N-AN-4 NOT EQUAL TO "8036"
052700         GO TO SIG-FAIL-GF-2-4.
052800     PERFORM PASS.
052900     GO TO SIG-WRTE-GF-2-4.
053000 SIG-FAIL-GF-2-4.
053100     PERFORM FAIL.
053200     MOVE "8036" TO CORRECT-A.
053300     MOVE TEST2N-AN-4 TO COMPUTED-A.
053400     MOVE "NUMERIC CHARACTERS" TO RE-MARK.
053500 SIG-WRTE-GF-2-4.
053600     MOVE 4 TO REC-CT.
053700     PERFORM PRINT-DETAIL.
053800 SIG-INIT-GF-3.
053900     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
054000     MOVE "SIG-TEST-GF-3" TO PAR-NAME.
054100     MOVE "SIGN LEADING" TO FEATURE.
054200     MOVE 1 TO REC-CT.
054300     MOVE "POSITIVE NUMERIC ITEM" TO RE-MARK.
054400*        THIS TEST CHECKS ALL BUT THE LEADING CHARACTER OF AN
054500*    ITEM DEFINED AS SIGN IS LEADING. (NOT SEPARATE CHAR.)
054600 SIG-TEST-GF-3-1.
054700     IF TEST3-AN-4 EQUAL TO "1275"
054800         PERFORM PASS
054900         GO TO SIG-WRTE-GF-3-1.
055000     GO TO SIG-FAIL-GF-3-1.
055100 SIG-DELETE-GF-3-1.
055200     PERFORM DE-LETE.
055300     PERFORM PRINT-DETAIL.
055400     GO TO   SIG-INIT-GF-4.
055500 SIG-FAIL-GF-3-1.
055600     PERFORM FAIL.
055700     MOVE "1275" TO CORRECT-A.
055800     MOVE TEST3-AN-4 TO COMPUTED-A.
055900 SIG-WRTE-GF-3-1.
056000     PERFORM PRINT-DETAIL.
056100 SIG-TEST-GF-3-2.
056200     IF TEST3N-AN-3 NOT EQUAL TO "127"
056300         GO TO SIG-FAIL-GF-3-2.
056400     PERFORM PASS.
056500     GO TO SIG-WRTE-GF-3-2.
056600 SIG-DELETE-GF-3-2.
056700     PERFORM DE-LETE.
056800 SIG-FAIL-GF-3-2.
056900     PERFORM FAIL.
057000     MOVE "127" TO CORRECT-A.
057100     MOVE TEST3N-AN-3 TO COMPUTED-A.
057200 SIG-WRTE-GF-3-2.
057300     MOVE 2 TO REC-CT.
057400     MOVE "NEGATIVE NUMERIC ITEM" TO RE-MARK.
057500     PERFORM PRINT-DETAIL.
057600 SIG-INIT-GF-4.
057700     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
057800     MOVE "SIG-TEST-GF-4" TO PAR-NAME.
057900     MOVE "SIGN TRAILING" TO FEATURE.
058000     MOVE 1 TO REC-CT.
058100     MOVE "POSITIVE NUMERIC ITEM" TO RE-MARK.
058200*        THIS TEST CHECKS ALL BUT THE TRAILING CHARACTER OF AN
058300*    ITEM DEFINED AS SIGN IS TRAILING. (NOT SEPARATE CHAR.)
058400 SIG-TEST-GF-4-1.
058500     IF TEST4-AN-4 EQUAL TO "8362"
058600         PERFORM PASS
058700         GO TO SIG-WRTE-GF-4-1.
058800     GO TO SIG-FAIL-GF-4-1.
058900 SIG-DELETE-GF-4-1.
059000     PERFORM DE-LETE.
059100     PERFORM PRINT-DETAIL.
059200     GO TO   SIG-INIT-GF-5.
059300 SIG-FAIL-GF-4-1.
059400     PERFORM FAIL.
059500     MOVE "8362" TO CORRECT-A.
059600     MOVE TEST4-AN-4 TO COMPUTED-A.
059700 SIG-WRTE-GF-4-1.
059800     PERFORM PRINT-DETAIL.
059900 SIG-TEST-GF-4-2.
060000     IF TEST4N-AN-3 NOT EQUAL TO "362"
060100         GO TO SIG-FAIL-GF-4-2.
060200     PERFORM PASS.
060300     GO TO SIG-WRTE-GF-4-2.
060400 SIG-DELETE-GF-4-2.
060500     PERFORM DE-LETE.
060600 SIG-FAIL-GF-4-2.
060700     PERFORM FAIL.
060800     MOVE "362" TO CORRECT-A.
060900     MOVE TEST4N-AN-3 TO COMPUTED-A.
061000 SIG-WRTE-GF-4-2.
061100     MOVE 2 TO REC-CT.
061200     MOVE "NEGATIVE NUMERIC ITEM" TO RE-MARK.
061300     PERFORM PRINT-DETAIL.
061400 SIG-INIT-GF-5.
061500     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
061600     MOVE "SIG-TEST-GF-5" TO PAR-NAME.
061700     MOVE "COMPARE SIGNED ITEMS" TO FEATURE.
061800     MOVE "LEADING SIGN" TO RE-MARK.
061900     MOVE 1 TO REC-CT.
062000*        THIS SERIES OF TESTS COMPARE A SIGNED DISPLAY ITEM WITH
062100*    LEADING SIGN TO FOUR SIGNED AND UNSIGNED COMPUTATIONAL AND
062200*    DISPLAY ITEMS.
062300 SIG-TEST-GF-5-1.
062400     IF DS-L-00008 EQUAL TO CS-00007-1
062500              PERFORM PASS
062600              GO TO SIG-WRITE-GF-5-1.
062700     GO TO SIG-FAIL-GF-5-1.
062800 SIG-DELETE-GF-5-1.
062900     PERFORM DE-LETE.
063000     PERFORM PRINT-DETAIL.
063100     GO TO   SIG-INIT-GF-6.
063200 SIG-FAIL-GF-5-1.
063300     PERFORM FAIL.
063400     MOVE AN-00008-X-1 TO COMPUTED-A.
063500     MOVE CS-00007-1 TO CORRECT-18V0.
063600 SIG-WRITE-GF-5-1.
063700     PERFORM PRINT-DETAIL.
063800 SIG-TEST-GF-5-2.
063900     MOVE 2 TO REC-CT.
064000     IF DS-L-00008 EQUAL TO CU-00007-1
064100              PERFORM PASS
064200              GO TO SIG-WRITE-GF-5-2.
064300 SIG-FAIL-GF-5-2.
064400     PERFORM FAIL.
064500     MOVE AN-00008-X-1 TO COMPUTED-A.
064600     MOVE CU-00007-1 TO CORRECT-18V0.
064700 SIG-WRITE-GF-5-2.
064800     PERFORM PRINT-DETAIL.
064900 SIG-TEST-GF-5-3.
065000     MOVE 3 TO REC-CT.
065100     IF DS-L-00008 EQUAL TO DS-00007-1
065200              PERFORM PASS
065300              GO TO SIG-WRITE-GF-5-3.
065400 SIG-FAIL-GF-5-3.
065500     PERFORM FAIL.
065600     MOVE AN-00008-X-1 TO COMPUTED-A.
065700     MOVE DS-00007-1 TO CORRECT-18V0.
065800 SIG-WRITE-GF-5-3.
065900     PERFORM PRINT-DETAIL.
066000 SIG-TEST-GF-5-4.
066100     MOVE 4 TO REC-CT.
066200     IF DS-L-00008 EQUAL TO DU-00007-1
066300              PERFORM PASS
066400              GO TO SIG-WRITE-GF-5-4.
066500 SIG-FAIL-GF-5-4.
066600     PERFORM FAIL.
066700     MOVE AN-00008-X-1 TO COMPUTED-A.
066800     MOVE DU-00007-1 TO CORRECT-18V0.
066900 SIG-WRITE-GF-5-4.
067000     PERFORM PRINT-DETAIL.
067100 SIG-INIT-GF-6.
067200     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
067300     MOVE "SIG-TEST-GF-6" TO PAR-NAME.
067400     MOVE "COMPARE SIGNED ITEMS" TO FEATURE.
067500     MOVE "TRAILING SIGN" TO RE-MARK.
067600*        THIS SERIES OF TESTS COMPARE A SIGNED DISPLAY ITEM WITH
067700*    TRAILING SIGN TO FOUR SIGNED AND UNSIGNED COMPUTATIONAL AND
067800*    DISPLAY ITEMS.
067900 SIG-TEST-GF-6-1.
068000     MOVE 1 TO REC-CT.
068100     IF DS-T-00008 EQUAL TO CS-00007-2
068200              PERFORM PASS
068300              GO TO SIG-WRITE-GF-6-1.
068400     GO TO SIG-FAIL-GF-6-1.
068500 SIG-DELETE-GF-6-1.
068600     PERFORM DE-LETE.
068700     PERFORM PRINT-DETAIL.
068800     GO TO   SIG-INIT-GF-7.
068900 SIG-FAIL-GF-6-1.
069000     PERFORM FAIL.
069100     MOVE AN-00008-X-2 TO COMPUTED-A.
069200     MOVE CS-00007-2 TO CORRECT-18V0.
069300 SIG-WRITE-GF-6-1.
069400     PERFORM PRINT-DETAIL.
069500 SIG-TEST-GF-6-2.
069600     MOVE 2 TO REC-CT.
069700     IF DS-T-00008-1 EQUAL TO CU-00007-2
069800              PERFORM PASS
069900              GO TO SIG-WRITE-GF-6-2.
070000 SIG-FAIL-GF-6-2.
070100     PERFORM FAIL.
070200     MOVE AN-00008-X-5 TO COMPUTED-A.
070300     MOVE CU-00007-2 TO CORRECT-18V0.
070400 SIG-WRITE-GF-6-2.
070500     PERFORM PRINT-DETAIL.
070600 SIG-TEST-GF-6-3.
070700     MOVE 3 TO REC-CT.
070800     IF DS-T-00008 EQUAL TO DS-00007-2
070900              PERFORM PASS
071000              GO TO SIG-WRITE-GF-6-3.
071100 SIG-FAIL-GF-6-3.
071200     PERFORM FAIL.
071300     MOVE AN-00008-X-2 TO COMPUTED-A.
071400     MOVE DS-00007-2 TO CORRECT-18V0.
071500 SIG-WRITE-GF-6-3.
071600     PERFORM PRINT-DETAIL.
071700 SIG-TEST-GF-6-4.
071800     MOVE 4 TO REC-CT.
071900     IF DS-T-00008-1 EQUAL TO DU-00007-2
072000              PERFORM PASS
072100              GO TO SIG-WRITE-GF-6-4.
072200 SIG-FAIL-GF-6-4.
072300     PERFORM FAIL.
072400     MOVE AN-00008-X-5 TO COMPUTED-A.
072500     MOVE DU-00007-2  TO CORRECT-18V0.
072600 SIG-WRITE-GF-6-4.
072700     PERFORM PRINT-DETAIL.
072800 SIG-INIT-GF-7.
072900     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
073000     MOVE "SIG-TEST-GF-7" TO PAR-NAME.
073100     MOVE "COMPARE SIGNED ITEMS" TO FEATURE.
073200     MOVE "LEADING SIGN SEPARATE CHARACTER" TO RE-MARK.
073300*        THIS SERIES OF TESTS COMPARE A SIGNED DISPLAY ITEM WITH
073400*    LEADING SIGN AND SEPARATE CHARACTER TO FOUR SIGNED AND
073500*    UNSIGNED COMPUTATIONAL AND DISPLAY ITEMS.
073600 SIG-TEST-GF-7-1.
073700     MOVE 1 TO REC-CT.
073800     IF DS-LS-00008 EQUAL TO CS-00007-3
073900              PERFORM PASS
074000         GO TO SIG-WRITE-GF-7-1.
074100     GO TO SIG-FAIL-GF-7-1.
074200 SIG-DELETE-GF-7-1.
074300     PERFORM DE-LETE.
074400     PERFORM PRINT-DETAIL.
074500     GO TO   SIG-INIT-GF-8.
074600 SIG-FAIL-GF-7-1.
074700     PERFORM FAIL.
074800     MOVE AN-00009-X-3 TO COMPUTED-A.
074900     MOVE CS-00007-3 TO CORRECT-18V0.
075000 SIG-WRITE-GF-7-1.
075100     PERFORM PRINT-DETAIL.
075200 SIG-TEST-GF-7-2.
075300     MOVE 2 TO REC-CT.
075400     IF DS-LS-00008-1 EQUAL TO CU-00007-3
075500              PERFORM PASS
075600              GO TO SIG-WRITE-GF-7-2.
075700 SIG-FAIL-GF-7-2.
075800     PERFORM FAIL.
075900     MOVE AN-00009-X-6 TO COMPUTED-A.
076000     MOVE CU-00007-3 TO CORRECT-18V0.
076100 SIG-WRITE-GF-7-2.
076200     PERFORM PRINT-DETAIL.
076300 SIG-TEST-GF-7-3.
076400     MOVE 3 TO REC-CT.
076500     IF DS-LS-00008 EQUAL TO DS-00007-3
076600              PERFORM PASS.
076700              GO TO SIG-WRITE-GF-7-3.
076800 SIG-FAIL-GF-7-3.
076900     PERFORM FAIL.
077000     MOVE AN-00009-X-3 TO COMPUTED-A.
077100     MOVE DS-00007-3 TO CORRECT-18V0.
077200 SIG-WRITE-GF-7-3.
077300     PERFORM PRINT-DETAIL.
077400 SIG-TEST-GF-7-4.
077500     MOVE 4 TO REC-CT.
077600     IF DS-LS-00008-1 EQUAL TO DU-00007-3
077700              PERFORM PASS
077800              GO TO SIG-WRITE-GF-7-4.
077900 SIG-FAIL-GF-7-4.
078000     PERFORM FAIL.
078100     MOVE AN-00009-X-6 TO COMPUTED-A.
078200     MOVE DU-00007-3 TO CORRECT-18V0.
078300 SIG-WRITE-GF-7-4.
078400     PERFORM PRINT-DETAIL.
078500 SIG-INIT-GF-8.
078600     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
078700     MOVE "SIG-TEST-GF-8" TO PAR-NAME.
078800     MOVE "COMPARE SIGN ITEMS" TO FEATURE.
078900     MOVE "TRAILING SIGN SEPARATE CHARACTR" TO RE-MARK.
079000*        THIS SERIES OF TESTS COMPARE A SIGNED DISPLAY ITEM WITH
079100*    TRAILING SIGN AND SEPARATE CHARACTER TO FOUR SIGNED AND
079200*    UNSIGNED COMPUTATIONAL AND DISPLAY ITEMS.
079300 SIG-TEST-GF-8-1.
079400     MOVE 1 TO REC-CT.
079500     IF DS-TS-00008 EQUAL TO CS-00007-4
079600              PERFORM PASS
079700              GO TO SIG-WRITE-GF-8-1.
079800     GO TO SIG-FAIL-GF-8-1.
079900 SIG-DELETE-GF-8-1.
080000     PERFORM DE-LETE.
080100     PERFORM PRINT-DETAIL.
080200     GO TO   SIG-INIT-GF-9.
080300 SIG-FAIL-GF-8-1.
080400     PERFORM FAIL.
080500     MOVE AN-00009-X-4 TO COMPUTED-A.
080600     MOVE CS-00007-4 TO CORRECT-18V0.
080700 SIG-WRITE-GF-8-1.
080800     PERFORM PRINT-DETAIL.
080900 SIG-TEST-GF-8-2.
081000     MOVE 2 TO REC-CT.
081100     IF DS-TS-00008 EQUAL TO CU-00007-4
081200              PERFORM PASS
081300              GO TO SIG-WRITE-GF-8-2.
081400 SIG-FAIL-GF-8-2.
081500     PERFORM FAIL.
081600     MOVE AN-00009-X-4 TO COMPUTED-A.
081700     MOVE CU-00007-4 TO CORRECT-18V0.
081800 SIG-WRITE-GF-8-2.
081900     PERFORM PRINT-DETAIL.
082000 SIG-TEST-GF-8-3.
082100     MOVE 3 TO REC-CT.
082200     IF DS-TS-00008 EQUAL TO DS-00007-4
082300              PERFORM PASS
082400              GO TO SIG-WRITE-GF-8-3.
082500 SIG-FAIL-GF-8-3.
082600     PERFORM FAIL.
082700     MOVE AN-00009-X-4 TO COMPUTED-A.
082800     MOVE DS-00007-4 TO CORRECT-18V0.
082900 SIG-WRITE-GF-8-3.
083000     PERFORM PRINT-DETAIL.
083100 SIG-TEST-GF-8-4.
083200     MOVE 4 TO REC-CT.
083300     IF DS-TS-00008 EQUAL TO DU-00007-4
083400              PERFORM PASS
083500              GO TO SIG-WRITE-GF-8-4.
083600 SIG-FAIL-GF-8-4.
083700     PERFORM FAIL.
083800     MOVE AN-00009-X-4 TO COMPUTED-A.
083900     MOVE DU-00007-4 TO CORRECT-18V0.
084000 SIG-WRITE-GF-8-4.
084100     PERFORM PRINT-DETAIL.
084200 SIG-INIT-GF-9.
084300     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
084400     MOVE "SIG-TEST-GF-9" TO PAR-NAME.
084500     MOVE "SENDING ITEM DS-LS" TO FEATURE.
084600     MOVE 1 TO REC-CT.
084700*        THIS TEST MOVES A NUMERIC ITEM WITH SIGN IS LEADING
084800*    SEPARATE CHARACTER TO UNSIGNED DISPLAY, SIGNED DISPLAY,
084900*    UNSIGNED COMPUTATIONAL AND SIGNED COMPUTATIONAL ITEMS.
085000 SIG-TEST-GF-9-1.
085100     MOVE DS-LS-5 TO DU-005.
085200     IF DU-005 EQUAL TO 91275
085300         PERFORM PASS
085400         GO TO SIG-WRTE-GF-9-1.
085500     GO TO SIG-FAIL-GF-9-1.
085600 SIG-DELETE-GF-9-1.
085700     PERFORM DE-LETE.
085800     PERFORM PRINT-DETAIL.
085900     GO TO   SIG-INIT-GF-10.
086000 SIG-FAIL-GF-9-1.
086100     PERFORM FAIL.
086200     MOVE DU-005 TO COMPUTED-18V0.
086300     MOVE 91275 TO CORRECT-18V0.
086400     MOVE "MOVE DS-LS-5 TO DU-005" TO RE-MARK.
086500 SIG-WRTE-GF-9-1.
086600     PERFORM PRINT-DETAIL.
086700 SIG-TEST-GF-9-2.
086800     MOVE DS-LS-5 TO DS-005.
086900     IF DS-005 EQUAL TO +91275
087000         PERFORM PASS
087100         GO TO SIG-WRTE-GF-9-2.
087200 SIG-FAIL-GF-9-2.
087300     PERFORM FAIL.
087400     MOVE DS-005 TO COMPUTED-18V0.
087500     MOVE +91275 TO CORRECT-18V0.
087600     MOVE "MOVE DS-LS-5 TO DS-005" TO RE-MARK.
087700 SIG-WRTE-GF-9-2.
087800     MOVE 2 TO REC-CT.
087900     PERFORM PRINT-DETAIL.
088000 SIG-TEST-GF-9-3.
088100     MOVE DS-LS-5 TO CU-005.
088200     IF CU-005 EQUAL TO 91275
088300         PERFORM PASS
088400         GO TO SIG-WRTE-GF-9-3.
088500 SIG-FAIL-GF-9-3.
088600     PERFORM FAIL.
088700     MOVE CU-005 TO COMPUTED-18V0.
088800     MOVE 91275 TO CORRECT-18V0.
088900     MOVE "MOVE DS-LS-5 TO CU-005" TO RE-MARK.
089000 SIG-WRTE-GF-9-3.
089100     MOVE 3 TO REC-CT.
089200     PERFORM PRINT-DETAIL.
089300 SIG-TEST-GF-9-4.
089400     MOVE DS-LS-5 TO CS-005.
089500     IF CS-005 EQUAL TO +91275
089600         PERFORM PASS
089700         GO TO SIG-WRTE-GF-9-4.
089800 SIG-FAIL-GF-9-4.
089900     PERFORM FAIL.
090000     MOVE CS-005 TO COMPUTED-18V0.
090100     MOVE +91275 TO CORRECT-18V0.
090200     MOVE "MOVE DS-LS-5 TO CS-005" TO RE-MARK.
090300 SIG-WRTE-GF-9-4.
090400     MOVE 4 TO REC-CT.
090500     PERFORM PRINT-DETAIL.
090600 SIG-INIT-GF-10.
090700     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
090800     MOVE "SIG-TEST-GF-10" TO PAR-NAME.
090900     MOVE "SENDING ITEM DS-TS-4" TO FEATURE.
091000*        THIS TEST MOVES A NUMERIC ITEM WITH SIGN IS TRAILING
091100*    SEPARATE CHARACTER TO UNSIGNED DISPLAY, SIGNED DISPLAY,
091200*    UNSIGNED COMPUTATIONAL AND SIGNED COMPUTATIONAL ITEMS.
091300 SIG-TEST-GF-10-1.
091400     MOVE DS-TS-4 TO DU-005.
091500     IF DU-005 NOT EQUAL TO 08036
091600         GO TO SIG-FAIL-GF-10-1.
091700     PERFORM PASS.
091800     GO TO SIG-WRTE-GF-10-1.
091900 SIG-DELETE-GF-10-1.
092000     PERFORM DE-LETE.
092100     PERFORM PRINT-DETAIL.
092200     GO TO   SIG-INIT-GF-11.
092300 SIG-FAIL-GF-10-1.
092400     PERFORM FAIL.
092500     MOVE DU-005 TO COMPUTED-18V0.
092600     MOVE 08036 TO CORRECT-18V0.
092700     MOVE "MOVE DS-TS-4 TO DU-005" TO RE-MARK.
092800 SIG-WRTE-GF-10-1.
092900     MOVE 1 TO REC-CT.
093000     PERFORM PRINT-DETAIL.
093100 SIG-TEST-GF-10-2.
093200     MOVE DS-TS-4 TO DS-005.
093300     IF DS-005 NOT EQUAL TO -08036
093400         GO TO SIG-FAIL-GF-10-2.
093500     PERFORM PASS.
093600     GO TO SIG-WRTE-GF-10-2.
093700 SIG-FAIL-GF-10-2.
093800     PERFORM FAIL.
093900     MOVE DS-005 TO COMPUTED-18V0.
094000     MOVE -08036 TO CORRECT-18V0.
094100     MOVE "MOVE DS-TS-4 TO DS-005" TO RE-MARK.
094200 SIG-WRTE-GF-10-2.
094300     MOVE 2 TO REC-CT.
094400     PERFORM PRINT-DETAIL.
094500 SIG-TEST-GF-10-3.
094600     MOVE DS-TS-4 TO CU-005.
094700     IF CU-005 NOT EQUAL TO 08036
094800         GO TO SIG-FAIL-GF-10-3.
094900     PERFORM PASS.
095000     GO TO SIG-WRTE-GF-10-3.
095100 SIG-FAIL-GF-10-3.
095200     PERFORM FAIL.
095300     MOVE CU-005 TO COMPUTED-18V0.
095400     MOVE 08036 TO CORRECT-18V0.
095500     MOVE "MOVE DS-TS-4 TO CU-005" TO RE-MARK.
095600 SIG-WRTE-GF-10-3.
095700     MOVE 3 TO REC-CT.
095800     PERFORM PRINT-DETAIL.
095900 SIG-TEST-GF-10-4.
096000     MOVE DS-TS-4 TO CS-005.
096100     IF CS-005 NOT EQUAL TO -08036
096200         GO TO SIG-FAIL-GF-10-4.
096300     PERFORM PASS.
096400     GO TO SIG-WRTE-GF-10-4.
096500 SIG-FAIL-GF-10-4.
096600     PERFORM FAIL.
096700     MOVE CS-005 TO COMPUTED-18V0.
096800     MOVE -08036 TO CORRECT-18V0.
096900     MOVE "MOVE DS-TS-4 TO CS-005" TO RE-MARK.
097000 SIG-WRTE-GF-10-4.
097100     MOVE 4 TO REC-CT.
097200     PERFORM PRINT-DETAIL.
097300 SIG-INIT-GF-11.
097400     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
097500     MOVE "SIG-TEST-GF-11" TO PAR-NAME.
097600     MOVE "SIGN SEPARATE ITEMS" TO FEATURE.
097700*        THIS TEST CONTAINS MOVE STATEMENTS WHERE BOTH THE
097800*    SENDING AND RECEIVING ITEM HAVE SEPARATE SIGN CHARACTERS.
097900 SIG-TEST-GF-11-1.
098000     MOVE DS-LS-4 TO WRK-DS-LS-5.
098100     IF GRP-09 EQUAL TO "-09127"
098200         PERFORM PASS
098300         GO TO SIG-WRTE-GF-11-1.
098400     GO TO SIG-FAIL-GF-11-1.
098500 SIG-DELETE-GF-11-1.
098600     PERFORM DE-LETE.
098700     PERFORM PRINT-DETAIL.
098800     GO TO   SIG-INIT-GF-12.
098900 SIG-FAIL-GF-11-1.
099000     PERFORM FAIL.
099100     MOVE GRP-09 TO COMPUTED-A.
099200     MOVE "-09127" TO CORRECT-A.
099300     MOVE "MOVE DS-LS-4 TO WRK-DS-LS-5" TO RE-MARK.
099400 SIG-WRTE-GF-11-1.
099500     MOVE 1 TO REC-CT.
099600     PERFORM PRINT-DETAIL.
099700 SIG-TEST-GF-11-2.
099800     MOVE DS-LS-4 TO WRK-DS-TS-5.
099900     IF GRP-10 NOT EQUAL TO "09127-"
100000         GO TO SIG-FAIL-GF-11-2.
100100     PERFORM PASS.
100200     GO TO SIG-WRTE-GF-11-2.
100300 SIG-FAIL-GF-11-2.
100400     PERFORM FAIL.
100500     MOVE GRP-10 TO COMPUTED-A.
100600     MOVE "09127-" TO CORRECT-A.
100700     MOVE "MOVE DS-LS-4 TO WRK-DS-TS-S" TO RE-MARK.
100800 SIG-WRTE-GF-11-2.
100900     MOVE 2 TO REC-CT.
101000     PERFORM PRINT-DETAIL.
101100 SIG-TEST-GF-11-3.
101200     MOVE DS-TS-5 TO WRK-DS-LS-5.
101300     IF GRP-09 EQUAL TO "+80361"
101400         PERFORM PASS
101500         GO TO SIG-WRTE-GF-11-3.
101600 SIG-FAIL-GF-11-3.
101700     PERFORM FAIL.
101800     MOVE GRP-09 TO COMPUTED-A.
101900     MOVE "+80361" TO CORRECT-A.
102000     MOVE "MOVE DS-TS-5 TO WRK-DS-LS-5" TO RE-MARK.
102100 SIG-WRTE-GF-11-3.
102200     MOVE 3 TO REC-CT.
102300     PERFORM PRINT-DETAIL.
102400 SIG-TEST-GF-11-4.
102500     MOVE DS-TS-5 TO WRK-DS-TS-5.
102600     IF GRP-10 NOT EQUAL TO "80361+"
102700         GO TO SIG-FAIL-GF-11-4.
102800     PERFORM PASS.
102900     GO TO SIG-WRTE-GF-11-4.
103000 SIG-FAIL-GF-11-4.
103100     PERFORM FAIL.
103200     MOVE GRP-10 TO COMPUTED-A.
103300     MOVE "80361+" TO CORRECT-A.
103400     MOVE "MOVE DS-TS-5 TO WRK-DS-TS-5" TO RE-MARK.
103500 SIG-WRTE-GF-11-4.
103600     MOVE 4 TO REC-CT.
103700     PERFORM PRINT-DETAIL.
103800 SIG-INIT-GF-12.
103900     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
104000     MOVE "SIG-TEST-GF-12" TO PAR-NAME.
104100     MOVE "SIGN CLAUSE ITEMS" TO FEATURE.
104200*        THIS TEST CONTAINS MOVE STATEMENTS WITH A SIGN IS
104300*    SEPARATE SENDING ITEM AND SIGN CLAUSE RECEIVING ITEMS,
104400*    BUT RECEIVING ITEMS SIGNS ARE NOT SEPARATE.
104500 SIG-TEST-GF-12-1.
104600     MOVE DS-LS-5 TO WRK-DS-L-5.
104700     IF WRK-DS-L-5 NOT EQUAL TO +91275
104800         GO TO SIG-FAIL-GF-12-1.
104900     PERFORM PASS.
105000     GO TO SIG-WRTE-GF-12-1.
105100 SIG-DELETE-GF-12-1.
105200     PERFORM DE-LETE.
105300     PERFORM PRINT-DETAIL.
105400     GO TO   SIG-INIT-GF-13.
105500 SIG-FAIL-GF-12-1.
105600     PERFORM FAIL.
105700     MOVE WRK-DS-L-5 TO COMPUTED-18V0.
105800     MOVE "+91275" TO CORRECT-A.
105900     MOVE "MOVE DS-LS-5 TO WRK-DS-L-5" TO RE-MARK.
106000 SIG-WRTE-GF-12-1.
106100     MOVE 1 TO REC-CT.
106200     PERFORM PRINT-DETAIL.
106300 SIG-TEST-GF-12-2.
106400     MOVE DS-LS-5 TO WRK-DS-T-5.
106500     IF WRK-DS-T-5 NOT EQUAL TO +91275
106600         GO TO SIG-FAIL-GF-12-2.
106700     PERFORM PASS.
106800     GO TO SIG-WRTE-GF-12-2.
106900 SIG-FAIL-GF-12-2.
107000     PERFORM FAIL.
107100     MOVE "+91275" TO CORRECT-A.
107200     MOVE WRK-DS-T-5 TO COMPUTED-18V0.
107300     MOVE "MOVE DS-LS-5 TO WRK-DS-T-5" TO RE-MARK.
107400 SIG-WRTE-GF-12-2.
107500     MOVE 2 TO REC-CT.
107600     PERFORM PRINT-DETAIL.
107700 SIG-TEST-GF-12-3.
107800     MOVE DS-TS-5 TO WRK-DS-L-5.
107900     IF WRK-DS-L-5 NOT EQUAL TO +80361
108000         GO TO SIG-FAIL-GF-12-3.
108100     PERFORM PASS.
108200     GO TO SIG-WRITE-GF-12-3.
108300 SIG-FAIL-GF-12-3.
108400     PERFORM FAIL.
108500     MOVE "+80361" TO CORRECT-A.
108600     MOVE WRK-DS-L-5 TO COMPUTED-18V0.
108700     MOVE "MOVE DS-TS-5 TO WRK-DS-L-5" TO RE-MARK.
108800 SIG-WRITE-GF-12-3.
108900     MOVE 3 TO REC-CT.
109000     PERFORM PRINT-DETAIL.
109100 SIG-TEST-GF-12-4.
109200     MOVE DS-TS-5 TO WRK-DS-T-5.
109300     IF WRK-DS-T-5 NOT EQUAL TO +80361
109400         GO TO SIG-FAIL-GF-12-4.
109500     PERFORM PASS.
109600     GO TO SIG-WRITE-GF-12-4.
109700 SIG-FAIL-GF-12-4.
109800     PERFORM FAIL.
109900     MOVE "+80361" TO CORRECT-A.
110000     MOVE WRK-DS-T-5 TO COMPUTED-18V0.
110100     MOVE "MOVE DS-TS-5 TO WRK-DS-T-5" TO RE-MARK.
110200 SIG-WRITE-GF-12-4.
110300     MOVE 4 TO REC-CT.
110400     PERFORM PRINT-DETAIL.
110500 SIG-INIT-GF-13.
110600     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
110700     MOVE "SIG-TEST-GF-13" TO PAR-NAME.
110800*        THIS TEST CONTAINS MOVE STATEMENTS WITH A SIGN IS
110900*    SEPARATE RECEIVING ITEM AND SENDING ITEMS WITH A SIGN
111000*    CLAUSE BUT THE SIGN IS NOT SEPARATE.
111100     MOVE ZERO TO WRK-DS-LS-5.
111200     MOVE ZERO TO WRK-DS-TS-5.
111300 SIG-TEST-GF-13-1.
111400     MOVE DS-L-5 TO WRK-DS-LS-5.
111500     IF GRP-09 EQUAL TO "+91275"
111600         PERFORM PASS
111700         GO TO SIG-WRITE-GF-13-1.
111800     GO TO SIG-FAIL-GF-13-1.
111900 SIG-DELETE-GF-13-1.
112000     PERFORM DE-LETE.
112100     PERFORM PRINT-DETAIL.
112200     GO TO   SIG-INIT-GF-14.
112300 SIG-FAIL-GF-13-1.
112400     PERFORM FAIL.
112500     MOVE GRP-09 TO COMPUTED-A.
112600     MOVE "+91275" TO CORRECT-A.
112700     MOVE "MOVE DS-L-5 TO WRK-DS-LS-5" TO RE-MARK.
112800 SIG-WRITE-GF-13-1.
112900     MOVE 1 TO REC-CT.
113000     PERFORM PRINT-DETAIL.
113100 SIG-TEST-GF-13-2.
113200     MOVE DS-T-4 TO WRK-DS-LS-5.
113300     IF GRP-09 EQUAL TO "-03621"
113400         PERFORM PASS
113500         GO TO SIG-WRITE-GF-13-2.
113600 SIG-FAIL-GF-13-2.
113700     PERFORM FAIL.
113800     MOVE GRP-09 TO COMPUTED-A.
113900     MOVE "-03621" TO CORRECT-A.
114000     MOVE "MOVE DS-T-4 TO WRK-DS-LS-5" TO RE-MARK.
114100 SIG-WRITE-GF-13-2.
114200     MOVE 2 TO REC-CT.
114300     PERFORM PRINT-DETAIL.
114400 SIG-TEST-GF-13-3.
114500     MOVE DS-L-5 TO WRK-DS-TS-5.
114600     IF GRP-10 EQUAL TO "91275+"
114700         PERFORM PASS
114800         GO TO SIG-WRITE-GF-13-3.
114900 SIG-FAIL-GF-13-3.
115000     PERFORM FAIL.
115100     MOVE GRP-10 TO COMPUTED-A.
115200     MOVE "91275+" TO CORRECT-A.
115300     MOVE "MOVE DS-L-5 TO WRK-DS-TS-5" TO RE-MARK.
115400 SIG-WRITE-GF-13-3.
115500     MOVE 3 TO REC-CT.
115600     PERFORM PRINT-DETAIL.
115700 SIG-TEST-GF-13-4.
115800     MOVE DS-T-4 TO WRK-DS-TS-5.
115900     IF GRP-10 EQUAL TO "03621-"
116000         PERFORM PASS
116100         GO TO SIG-WRITE-GF-13-4.
116200 SIG-FAIL-GF-13-4.
116300     PERFORM FAIL.
116400     MOVE GRP-10 TO COMPUTED-A.
116500     MOVE "03621-" TO CORRECT-A.
116600     MOVE "MOVE DS-T-4 TO WRK-DS-TS-5" TO RE-MARK.
116700 SIG-WRITE-GF-13-4.
116800     MOVE 4 TO REC-CT.
116900     PERFORM PRINT-DETAIL.
117000 SIG-INIT-GF-14.
117100     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
117200     MOVE "SIG-TEST-GF-14" TO PAR-NAME.
117300     MOVE "SIGNED NUM. TO ALPHA" TO FEATURE.
117400*        THIS TEST CONTAINS MOVE STATEMENTS WITH A SIGNED
117500*    NUMERIC SENDING ITEM AND ALPHANUMERIC RECEIVING ITEM.
117600*    THE OPERATIONAL SIGN SHOULD NOT BE MOVED AND SPACE
117700*    FILLING ON THE RIGHT SHOULD OCCUR.
117800 SIG-TEST-GF-14-1.
117900     MOVE DS-LS-5 TO AN-006.
118000     IF AN-006 EQUAL TO "91275 "
118100         PERFORM PASS
118200         GO TO SIG-WRITE-GF-14-1.
118300     GO TO SIG-FAIL-GF-14-1.
118400 SIG-DELETE-GF-14-1.
118500     PERFORM DE-LETE.
118600     PERFORM PRINT-DETAIL.
118700     GO TO   SIG-INIT-GF-15.
118800 SIG-FAIL-GF-14-1.
118900     PERFORM FAIL.
119000     MOVE AN-006 TO COMPUTED-A.
119100     MOVE "91275 " TO CORRECT-A.
119200     MOVE "MOVE DS-LS-5 TO AN-006" TO RE-MARK.
119300 SIG-WRITE-GF-14-1.
119400     MOVE 1 TO REC-CT.
119500     PERFORM PRINT-DETAIL.
119600 SIG-TEST-GF-14-2.
119700     MOVE SPACE TO AN-006.
119800     MOVE DS-TS-4 TO AN-006.
119900     IF AN-006 NOT EQUAL TO "8036  "
120000         GO TO SIG-FAIL-GF-14-2.
120100     PERFORM PASS.
120200     GO TO SIG-WRITE-GF-14-2.
120300 SIG-FAIL-GF-14-2.
120400     PERFORM FAIL.
120500     MOVE AN-006 TO COMPUTED-A.
120600     MOVE "8036  " TO CORRECT-A.
120700     MOVE "MOVE DS-TS-4 TO AN-006" TO RE-MARK.
120800 SIG-WRITE-GF-14-2.
120900     MOVE 2 TO REC-CT.
121000     PERFORM PRINT-DETAIL.
121100 SIG-TEST-GF-14-3.
121200     MOVE SPACE TO AN-006.
121300     MOVE DS-L-4 TO AN-006.
121400     IF AN-006 EQUAL TO "9127  "
121500         PERFORM PASS
121600         GO TO SIG-WRITE-GF-14-3.
121700 SIG-FAIL-GF-14-3.
121800     PERFORM FAIL.
121900     MOVE AN-006 TO COMPUTED-A.
122000     MOVE "9127  " TO CORRECT-A.
122100     MOVE "MOVE DS-L-4 TO AN-006" TO RE-MARK.
122200 SIG-WRITE-GF-14-3.
122300     MOVE 3 TO REC-CT.
122400     PERFORM PRINT-DETAIL.
122500 SIG-TEST-GF-14-4.
122600     MOVE SPACE TO AN-006.
122700     MOVE DS-T-5 TO AN-006.
122800     IF AN-006 NOT EQUAL TO "83621 "
122900         GO TO SIG-FAIL-GF-14-4.
123000     PERFORM PASS.
123100     GO TO SIG-WRITE-GF-14-4.
123200 SIG-FAIL-GF-14-4.
123300     PERFORM FAIL.
123400     MOVE AN-006 TO COMPUTED-A.
123500     MOVE "83621 " TO CORRECT-A.
123600     MOVE "MOVE DS-T-5 TO AN-006" TO RE-MARK.
123700 SIG-WRITE-GF-14-4.
123800     MOVE 4 TO REC-CT.
123900     PERFORM PRINT-DETAIL.
124000 SIG-INIT-GF-15.
124100     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
124200     MOVE "SIG-TEST-GF-15" TO PAR-NAME.
124300     MOVE 15759 TO DU-005 CU-005.
124400     MOVE -15759 TO DS-005 CS-005.
124500*        THIS TEST MOVES SIGNED AND UNSIGNED DISPLAY ITEMS,
124600*    SIGNED AND UNSIGNED COMPUTATIONAL ITEMS, AND SIGNED AND
124700*    UNSIGNED NUMERIC LITERALS TO A NUMERIC ITEM WITH SIGN
124800*    LEADING SEPARATE.
124900     MOVE "RECEIVING ITEM DS-LS" TO FEATURE.
125000 SIG-TEST-GF-15-1.
125100     MOVE SPACE TO GRP-09.
125200     MOVE DU-005 TO WRK-DS-LS-5.
125300     IF GRP-09 EQUAL TO "+15759"
125400         PERFORM PASS
125500         GO TO SIG-WRITE-GF-15-1.
125600     GO TO SIG-FAIL-GF-15-1.
125700 SIG-DELETE-GF-15-1.
125800     PERFORM DE-LETE.
125900     PERFORM PRINT-DETAIL.
126000     GO TO   SIG-INIT-GF-16.
126100 SIG-FAIL-GF-15-1.
126200     PERFORM FAIL.
126300     MOVE GRP-09 TO COMPUTED-A.
126400     MOVE "+15759" TO CORRECT-A.
126500     MOVE "MOVE DU-005 TO WRK-DS-LS-5" TO RE-MARK.
126600 SIG-WRITE-GF-15-1.
126700     MOVE 1 TO REC-CT.
126800     PERFORM PRINT-DETAIL.
126900 SIG-TEST-GF-15-2.
127000     MOVE SPACE TO GRP-09.
127100     MOVE CU-005 TO WRK-DS-LS-5.
127200     IF GRP-09 NOT EQUAL TO "+15759"
127300         GO TO SIG-FAIL-GF-15-2.
127400     PERFORM PASS
127500     GO TO SIG-WRITE-GF-15-2.
127600 SIG-FAIL-GF-15-2.
127700     PERFORM FAIL.
127800     MOVE GRP-09 TO COMPUTED-A.
127900     MOVE "+15759" TO CORRECT-A.
128000     MOVE "MOVE CU-005 TO WRK-DS-LS-5" TO RE-MARK.
128100 SIG-WRITE-GF-15-2.
128200     MOVE 2 TO REC-CT.
128300     PERFORM PRINT-DETAIL.
128400 SIG-TEST-GF-15-3.
128500     MOVE SPACE TO GRP-09.
128600     MOVE DS-005 TO WRK-DS-LS-5.
128700     IF GRP-09 EQUAL TO "-15759"
128800         PERFORM PASS
128900         GO TO SIG-WRITE-GF-15-3.
129000 SIG-FAIL-GF-15-3.
129100     PERFORM FAIL.
129200     MOVE GRP-09 TO COMPUTED-A.
129300     MOVE "-15759" TO CORRECT-A.
129400     MOVE "MOVE DS-005 TO WRK-DS-LS-5" TO RE-MARK.
129500 SIG-WRITE-GF-15-3.
129600     MOVE 3 TO REC-CT.
129700     PERFORM PRINT-DETAIL.
129800 SIG-TEST-GF-15-4.
129900     MOVE SPACE TO GRP-09.
130000     MOVE CS-005 TO WRK-DS-LS-5.
130100     IF GRP-09 NOT EQUAL TO "-15759"
130200         GO TO SIG-FAIL-GF-15-4.
130300     PERFORM PASS.
130400     GO TO SIG-WRITE-GF-15-4.
130500 SIG-FAIL-GF-15-4.
130600     PERFORM FAIL.
130700     MOVE GRP-09 TO COMPUTED-A.
130800     MOVE "-15759" TO CORRECT-A.
130900     MOVE "MOVE CS-005 TO WRK-DS-LS-5" TO RE-MARK.
131000 SIG-WRITE-GF-15-4.
131100     MOVE 4 TO REC-CT.
131200     PERFORM PRINT-DETAIL.
131300 SIG-TEST-GF-15-5.
131400     MOVE SPACE TO GRP-09.
131500     MOVE 15759 TO WRK-DS-LS-5.
131600     IF GRP-09 EQUAL TO "+15759"
131700         PERFORM PASS
131800         GO TO SIG-WRITE-GF-15-5.
131900 SIG-FAIL-GF-15-5.
132000     PERFORM FAIL.
132100     MOVE "+15759" TO CORRECT-A.
132200     MOVE GRP-09 TO COMPUTED-A.
132300     MOVE "MOVE 15759 TO WRK-DS-LS-5" TO RE-MARK.
132400 SIG-WRITE-GF-15-5.
132500     MOVE 5 TO REC-CT.
132600     PERFORM PRINT-DETAIL.
132700 SIG-TEST-GF-15-6.
132800     MOVE SPACE TO GRP-09.
132900     MOVE -15759 TO WRK-DS-LS-5.
133000     IF GRP-09 NOT EQUAL TO "-15759"
133100         GO TO SIG-FAIL-GF-15-6.
133200     PERFORM PASS.
133300     GO TO SIG-WRITE-GF-15-6.
133400 SIG-FAIL-GF-15-6.
133500     PERFORM FAIL.
133600     MOVE GRP-09 TO COMPUTED-A.
133700     MOVE "-15759" TO CORRECT-A.
133800     MOVE "MOVE -15759 TO WRK-DS-LS-5" TO RE-MARK.
133900 SIG-WRITE-GF-15-6.
134000     MOVE 6 TO REC-CT.
134100     PERFORM PRINT-DETAIL.
134200 SIG-INIT-GF-16.
134300     MOVE "VI-42 5.12.4"  TO ANSI-REFERENCE.
134400     MOVE "SIG-TEST-GF-16" TO PAR-NAME.
134500     MOVE "RECEIVING ITEM DS-TS" TO FEATURE.
134600*        THIS TEST MOVES SIGNED AND UNSIGNED DISPLAY ITEMS,
134700*    SIGNED AND UNSIGNED COMPUTATIONAL ITEMS, AND SIGNED AND
134800*    UNSIGNED NUMERIC LITERALS TO A NUMERIC ITEM WITH SIGN
134900*    TRAILING SEPARATE CLAUSE.
135000     MOVE SPACE TO GRP-10.
135100     MOVE DU-005 TO WRK-DS-TS-5.
135200 SIG-TEST-GF-16-1.
135300     IF GRP-10 EQUAL TO "15759+"
135400         PERFORM PASS
135500         GO TO SIG-WRITE-GF-16-1.
135600     GO TO SIG-FAIL-GF-16-1.
135700 SIG-DELETE-GF-16-1.
135800     PERFORM DE-LETE.
135900     PERFORM PRINT-DETAIL.
136000     GO TO   SIG-INIT-GF-17.
136100 SIG-FAIL-GF-16-1.
136200     PERFORM FAIL.
136300     MOVE GRP-10 TO COMPUTED-A.
136400     MOVE "15759+" TO CORRECT-A.
136500     MOVE "MOVE DU-005 TO WRK-DS-TS-5" TO RE-MARK.
136600 SIG-WRITE-GF-16-1.
136700     MOVE 1 TO REC-CT.
136800     PERFORM PRINT-DETAIL.
136900 SIG-TEST-GF-16-2.
137000     MOVE SPACE TO GRP-10.
137100     MOVE CU-005 TO WRK-DS-TS-5.
137200     IF GRP-10 NOT EQUAL TO "15759+"
137300         GO TO SIG-FAIL-GF-16-2.
137400     PERFORM PASS.
137500     GO TO SIG-WRITE-GF-16-2.
137600 SIG-FAIL-GF-16-2.
137700     PERFORM FAIL.
137800     MOVE GRP-10 TO COMPUTED-A.
137900     MOVE "15759+" TO CORRECT-A.
138000     MOVE "MOVE CU-005 TO WRK-DS-TS-5" TO RE-MARK.
138100 SIG-WRITE-GF-16-2.
138200     MOVE 2 TO REC-CT.
138300     PERFORM PRINT-DETAIL.
138400 SIG-TEST-GF-16-3.
138500     MOVE SPACE TO GRP-10.
138600     MOVE DS-005 TO WRK-DS-TS-5.
138700     IF GRP-10 EQUAL TO "15759-"
138800         PERFORM PASS
138900         GO TO SIG-WRITE-GF-16-3.
139000 SIG-FAIL-GF-16-3.
139100     PERFORM FAIL.
139200     MOVE GRP-10 TO COMPUTED-A.
139300     MOVE "15759-" TO CORRECT-A.
139400     MOVE "MOVE DS-005 TO WRK-DS-TS-5" TO RE-MARK.
139500 SIG-WRITE-GF-16-3.
139600     MOVE 3 TO REC-CT.
139700     PERFORM PRINT-DETAIL.
139800 SIG-TEST-GF-16-4.
139900     MOVE SPACE TO GRP-10.
140000     MOVE CS-005 TO WRK-DS-TS-5.
140100     IF GRP-10 NOT EQUAL TO "15759-"
140200         GO TO SIG-FAIL-GF-16-4.
140300     PERFORM PASS.
140400     GO TO SIG-WRITE-GF-16-4.
140500 SIG-FAIL-GF-16-4.
140600     PERFORM FAIL.
140700     MOVE GRP-10 TO COMPUTED-A.
140800     MOVE "15759-" TO CORRECT-A.
140900     MOVE "MOVE CS-005 TO WRK-DS-TS-5" TO RE-MARK.
141000 SIG-WRITE-GF-16-4.
141100     MOVE 4 TO REC-CT.
141200     PERFORM PRINT-DETAIL.
141300 SIG-TEST-GF-16-5.
141400     MOVE SPACE TO GRP-10.
141500     MOVE 15759 TO WRK-DS-TS-5.
141600     IF GRP-10 EQUAL TO "15759+"
141700         PERFORM PASS
141800         GO TO SIG-WRITE-GF-16-5.
141900 SIG-FAIL-GF-16-5.
142000     PERFORM FAIL.
142100     MOVE GRP-10 TO COMPUTED-A.
142200     MOVE "15759+" TO CORRECT-A.
142300     MOVE "MOVE 15759 TO WRK-DS-TS-5" TO RE-MARK.
142400 SIG-WRITE-GF-16-5.
142500     MOVE 5 TO REC-CT.
142600     PERFORM PRINT-DETAIL.
142700 SIG-TEST-GF-16-6.
142800     MOVE SPACE TO GRP-10.
142900     MOVE -15759 TO WRK-DS-TS-5.
143000     IF GRP-10 NOT EQUAL TO "15759-"
143100        GO TO SIG-FAIL-GF-16-6.
143200     PERFORM PASS.
143300     GO TO SIG-WRITE-GF-16-6.
143400 SIG-FAIL-GF-16-6.
143500     PERFORM FAIL.
143600     MOVE GRP-10 TO COMPUTED-A.
143700     MOVE "15759-" TO CORRECT-A.
143800     MOVE "MOVE -15759 TO WRK-DS-TS-5" TO RE-MARK.
143900 SIG-WRITE-GF-16-6.
144000     MOVE 6 TO REC-CT.
144100     PERFORM PRINT-DETAIL.
144200*
144300 SIG-INIT-GF-17.
144400     MOVE   "VI-42 5.12.4 GR2"  TO ANSI-REFERENCE.
144500     MOVE   "SIG-TEST-GF-17" TO PAR-NAME.
144600     MOVE   "PRECEDENCE OF SUBORDINATE SIGN CLAUSE" TO FEATURE.
144700     MOVE    1234 TO TEST-17-C.
144800     MOVE    0 TO REC-CT.
144900 SIG-TEST-GF-17.
145000     IF      TEST-17-C-SIGN = "+"
145100             PERFORM PASS
145200             GO TO   SIG-WRITE-GF-17
145300     ELSE
145400             GO TO   SIG-FAIL-GF-17.
145500 SIG-DELETE-GF-17.
145600     PERFORM DE-LETE.
145700     GO TO   SIG-WRITE-GF-17.
145800 SIG-FAIL-GF-17.
145900     PERFORM FAIL.
146000     MOVE   "POSITIVE SIGN EXPECTED" TO RE-MARK.
146100     MOVE   "+"             TO CORRECT-X.
146200     MOVE    TEST-17-C-SIGN TO COMPUTED-X.
146300 SIG-WRITE-GF-17.
146400     PERFORM PRINT-DETAIL.
146500*
146600 SIG-INIT-GF-18.
146700     MOVE   "VI-42 5.12.4 GR3"  TO ANSI-REFERENCE.
146800     MOVE   "SIG-TEST-GF-18" TO PAR-NAME.
146900     MOVE   "PRECEDENCE OF SUBORDINATE SIGN CLAUSE" TO FEATURE.
147000     MOVE    1234 TO TEST-18-B.
147100     MOVE    0 TO REC-CT.
147200 SIG-TEST-GF-18.
147300     IF      TEST-18-B-SIGN = "+"
147400             PERFORM PASS
147500             GO TO   SIG-WRITE-GF-18
147600     ELSE
147700             GO TO   SIG-FAIL-GF-18.
147800 SIG-DELETE-GF-18.
147900     PERFORM DE-LETE.
148000     GO TO   SIG-WRITE-GF-18.
148100 SIG-FAIL-GF-18.
148200     PERFORM FAIL.
148300     MOVE   "POSITIVE SIGN EXPECTED" TO RE-MARK.
148400     MOVE   "+"             TO CORRECT-X.
148500     MOVE    TEST-18-B-SIGN TO COMPUTED-X.
148600 SIG-WRITE-GF-18.
148700     PERFORM PRINT-DETAIL.
148800*
148900 TERMINATE-ROUTINE.
149000     EXIT.
149100 CCVS-EXIT SECTION.
149200 CCVS-999999.
149300     GO TO CLOSE-FILES.
