000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC114M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC114M TESTS:
002300*
002400*        ALPHA-NUMERIC EDITING
002500*        COMMENT LINES
002600*        UNIQUENESS OF REFERENCE (DATA, PARAGRAPH & SECTION NAME)
002700*        SEQUENCE NUMBERING
002800*
002900******************************************************************
003000*
003100 ENVIRONMENT DIVISION.
003200 CONFIGURATION SECTION.
003300 SOURCE-COMPUTER.
003400     XXXXX082.
003500 OBJECT-COMPUTER.
003600     XXXXX083
003700      PROGRAM COLLATING SEQUENCE IS AMERICAN-INDIAN.
003800 SPECIAL-NAMES.
003900     ALPHABET AMERICAN-INDIAN IS NATIVE.
004000 INPUT-OUTPUT SECTION.
004100 FILE-CONTROL.
004200     SELECT PRINT-FILE ASSIGN TO
004300     XXXXX055.
004400 DATA DIVISION.
004500 FILE SECTION.
004600 FD  PRINT-FILE.
004700 01  PRINT-REC PICTURE X(120).
004800 01  DUMMY-RECORD PICTURE X(120).
004900 WORKING-STORAGE SECTION.
005000 01  NINE-DU-9  PIC 9 VALUE 9.
005100 01  WRK-DU-99-1  PIC 99.
005200 01  WRK-DU-99-2  PIC 99.
005300 01  WRK-AE-1 PIC ABA VALUE "ABC".
005400 01  WRK-AE-2 PIC A/AA.
005500 01  WRK-AE-3  PIC XBXXX/XXX/XXX/XXX/XXXBXX.
005600 01  WRK-NE-1 PIC 9/99   .
005700/ STROKE-COMMENT-TEST-7   SHOULD PAGE EJECT AND PRINT ON TOP LINE
005800/ STROKE-COMMENT-TEST-7   SHOULD PAGE EJECT AND PRINT ON TOP LINE
005900* ASTERISK COMMENT SHOULD NOT BE SYNTAX CHECKED "(,$*.)-/+> <,....
006000*SIGN-LEADING-TEST-9     ) ,  >   ;   <
006100 01  WRK-DS-L-18V0-1 PIC S9(18)    SIGN IS LEADING      .
006200* SIGN-TRAILING-TEST-10
006300 01  WRK-DS-T-18V0-1 PIC S9(18)  SIGN TRAILING .
006400* SIGN-SEPARATE-TEST-11
006500 01  WRK-DS-S-18V0-1 PIC S9(18) SIGN TRAILING SEPARATE CHARACTER.
006600* REDEFINITION-TEST-12
006700 01  WRK-XN-18-1 PIC X(18).
006800 01  WRK-AN-18-X-1 REDEFINES WRK-XN-18-1 PIC A(18).
006900 01  GRP-X-1 REDEFINES WRK-XN-18-1.
007000 02  WRK-DU-9V0-1 PIC 9(9).
007100  02 WRK-DU-9V0-2 PIC 9(9).
007200 01  WRK-DS-18V0-1 PIC S9(18)
007300     VALUE  -123456789012345678.
007400 01  WRK-XN-18-2 PIC X(18) VALUE "123456789012345678".
007500 01  WRK-DS-LS-1P17-1 PIC S9P(17) SIGN LEADING SEPARATE
007600     CHARACTER VALUE  -100000000000000000.
007700/ STROKE-COMMENT-TEST-7   SHOULD PAGE EJECT AND PRINT ON TOP LINE
007800 01  PIC-SYNTAX-TEST-19  PIC AB9.
007900/ STROKE-COMMENT-TEST-7   SHOULD PAGE EJECT AND PRINT ON TOP LINE
008000 01  TEST-RESULTS.
008100     02 FILLER                   PIC X      VALUE SPACE.
008200     02 FEATURE                  PIC X(20)  VALUE SPACE.
008300     02 FILLER                   PIC X      VALUE SPACE.
008400     02 P-OR-F                   PIC X(5)   VALUE SPACE.
008500     02 FILLER                   PIC X      VALUE SPACE.
008600     02  PAR-NAME.
008700       03 FILLER                 PIC X(19)  VALUE SPACE.
008800       03  PARDOT-X              PIC X      VALUE SPACE.
008900       03 DOTVALUE               PIC 99     VALUE ZERO.
009000     02 FILLER                   PIC X(8)   VALUE SPACE.
009100     02 RE-MARK                  PIC X(61).
009200 01  TEST-COMPUTED.
009300     02 FILLER                   PIC X(30)  VALUE SPACE.
009400     02 FILLER                   PIC X(17)  VALUE
009500            "       COMPUTED=".
009600     02 COMPUTED-X.
009700     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009800     03 COMPUTED-N               REDEFINES COMPUTED-A
009900                                 PIC -9(9).9(9).
010000     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
010100     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
010200     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
010300     03       CM-18V0 REDEFINES COMPUTED-A.
010400         04 COMPUTED-18V0                    PIC -9(18).
010500         04 FILLER                           PIC X.
010600     03 FILLER PIC X(50) VALUE SPACE.
010700 01  TEST-CORRECT.
010800     02 FILLER PIC X(30) VALUE SPACE.
010900     02 FILLER PIC X(17) VALUE "       CORRECT =".
011000     02 CORRECT-X.
011100     03 CORRECT-A                  PIC X(20) VALUE SPACE.
011200     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
011300     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
011400     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
011500     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
011600     03      CR-18V0 REDEFINES CORRECT-A.
011700         04 CORRECT-18V0                     PIC -9(18).
011800         04 FILLER                           PIC X.
011900     03 FILLER PIC X(2) VALUE SPACE.
012000     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012100 01  CCVS-C-1.
012200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012300-    "SS  PARAGRAPH-NAME
012400-    "       REMARKS".
012500     02 FILLER                     PIC X(20)    VALUE SPACE.
012600 01  CCVS-C-2.
012700     02 FILLER                     PIC X        VALUE SPACE.
012800     02 FILLER                     PIC X(6)     VALUE "TESTED".
012900     02 FILLER                     PIC X(15)    VALUE SPACE.
013000     02 FILLER                     PIC X(4)     VALUE "FAIL".
013100     02 FILLER                     PIC X(94)    VALUE SPACE.
013200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013300 01  REC-CT                        PIC 99       VALUE ZERO.
013400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014300 01  CCVS-H-1.
014400     02  FILLER                    PIC X(39)    VALUE SPACES.
014500     02  FILLER                    PIC X(42)    VALUE
014600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014700     02  FILLER                    PIC X(39)    VALUE SPACES.
014800 01  CCVS-H-2A.
014900   02  FILLER                        PIC X(40)  VALUE SPACE.
015000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015100   02  FILLER                        PIC XXXX   VALUE
015200     "4.2 ".
015300   02  FILLER                        PIC X(28)  VALUE
015400            " COPY - NOT FOR DISTRIBUTION".
015500   02  FILLER                        PIC X(41)  VALUE SPACE.
015600
015700 01  CCVS-H-2B.
015800   02  FILLER                        PIC X(15)  VALUE
015900            "TEST RESULT OF ".
016000   02  TEST-ID                       PIC X(9).
016100   02  FILLER                        PIC X(4)   VALUE
016200            " IN ".
016300   02  FILLER                        PIC X(12)  VALUE
016400     " HIGH       ".
016500   02  FILLER                        PIC X(22)  VALUE
016600            " LEVEL VALIDATION FOR ".
016700   02  FILLER                        PIC X(58)  VALUE
016800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016900 01  CCVS-H-3.
017000     02  FILLER                      PIC X(34)  VALUE
017100            " FOR OFFICIAL USE ONLY    ".
017200     02  FILLER                      PIC X(58)  VALUE
017300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017400     02  FILLER                      PIC X(28)  VALUE
017500            "  COPYRIGHT   1985 ".
017600 01  CCVS-E-1.
017700     02 FILLER                       PIC X(52)  VALUE SPACE.
017800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017900     02 ID-AGAIN                     PIC X(9).
018000     02 FILLER                       PIC X(45)  VALUE SPACES.
018100 01  CCVS-E-2.
018200     02  FILLER                      PIC X(31)  VALUE SPACE.
018300     02  FILLER                      PIC X(21)  VALUE SPACE.
018400     02 CCVS-E-2-2.
018500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018600         03 FILLER                   PIC X      VALUE SPACE.
018700         03 ENDER-DESC               PIC X(44)  VALUE
018800            "ERRORS ENCOUNTERED".
018900 01  CCVS-E-3.
019000     02  FILLER                      PIC X(22)  VALUE
019100            " FOR OFFICIAL USE ONLY".
019200     02  FILLER                      PIC X(12)  VALUE SPACE.
019300     02  FILLER                      PIC X(58)  VALUE
019400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019500     02  FILLER                      PIC X(13)  VALUE SPACE.
019600     02 FILLER                       PIC X(15)  VALUE
019700             " COPYRIGHT 1985".
019800 01  CCVS-E-4.
019900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020000     02 FILLER                       PIC X(4)   VALUE " OF ".
020100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020200     02 FILLER                       PIC X(40)  VALUE
020300      "  TESTS WERE EXECUTED SUCCESSFULLY".
020400 01  XXINFO.
020500     02 FILLER                       PIC X(19)  VALUE
020600            "*** INFORMATION ***".
020700     02 INFO-TEXT.
020800       04 FILLER                     PIC X(8)   VALUE SPACE.
020900       04 XXCOMPUTED                 PIC X(20).
021000       04 FILLER                     PIC X(5)   VALUE SPACE.
021100       04 XXCORRECT                  PIC X(20).
021200     02 INF-ANSI-REFERENCE           PIC X(48).
021300 01  HYPHEN-LINE.
021400     02 FILLER  PIC IS X VALUE IS SPACE.
021500     02 FILLER  PIC IS X(65)    VALUE IS "************************
021600-    "*****************************************".
021700     02 FILLER  PIC IS X(54)    VALUE IS "************************
021800-    "******************************".
021900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022000     "NC114M".
022100 PROCEDURE DIVISION.
022200 CCVS1 SECTION.
022300 OPEN-FILES.
022400     OPEN     OUTPUT PRINT-FILE.
022500     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022600     MOVE    SPACE TO TEST-RESULTS.
022700     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022800     GO TO CCVS1-EXIT.
022900 CLOSE-FILES.
023000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023100 TERMINATE-CCVS.
023200S    EXIT PROGRAM.
023300STERMINATE-CALL.
023400     STOP     RUN.
023500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023900     MOVE "****TEST DELETED****" TO RE-MARK.
024000 PRINT-DETAIL.
024100     IF REC-CT NOT EQUAL TO ZERO
024200             MOVE "." TO PARDOT-X
024300             MOVE REC-CT TO DOTVALUE.
024400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024900     MOVE SPACE TO CORRECT-X.
025000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025100     MOVE     SPACE TO RE-MARK.
025200 HEAD-ROUTINE.
025300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025700 COLUMN-NAMES-ROUTINE.
025800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026100 END-ROUTINE.
026200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026300 END-RTN-EXIT.
026400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026500 END-ROUTINE-1.
026600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026800      ADD PASS-COUNTER TO ERROR-HOLD.
026900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
027000      MOVE PASS-COUNTER TO CCVS-E-4-1.
027100      MOVE ERROR-HOLD TO CCVS-E-4-2.
027200      MOVE CCVS-E-4 TO CCVS-E-2-2.
027300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027400  END-ROUTINE-12.
027500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027600     IF       ERROR-COUNTER IS EQUAL TO ZERO
027700         MOVE "NO " TO ERROR-TOTAL
027800         ELSE
027900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
028000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028100     PERFORM WRITE-LINE.
028200 END-ROUTINE-13.
028300     IF DELETE-COUNTER IS EQUAL TO ZERO
028400         MOVE "NO " TO ERROR-TOTAL  ELSE
028500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028800      IF   INSPECT-COUNTER EQUAL TO ZERO
028900          MOVE "NO " TO ERROR-TOTAL
029000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029400 WRITE-LINE.
029500     ADD 1 TO RECORD-COUNT.
029600Y    IF RECORD-COUNT GREATER 42
029700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029800Y        MOVE SPACE TO DUMMY-RECORD
029900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
030000Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030100Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
030200Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030300Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030400Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
030500Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
030600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030800Y        MOVE ZERO TO RECORD-COUNT.
030900     PERFORM WRT-LN.
031000 WRT-LN.
031100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031200     MOVE SPACE TO DUMMY-RECORD.
031300 BLANK-LINE-PRINT.
031400     PERFORM WRT-LN.
031500 FAIL-ROUTINE.
031600     IF     COMPUTED-X NOT EQUAL TO SPACE
031700            GO TO FAIL-ROUTINE-WRITE.
031800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032200     MOVE   SPACES TO INF-ANSI-REFERENCE.
032300     GO TO  FAIL-ROUTINE-EX.
032400 FAIL-ROUTINE-WRITE.
032500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
032600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
032700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
032800     MOVE   SPACES TO COR-ANSI-REFERENCE.
032900 FAIL-ROUTINE-EX. EXIT.
033000 BAIL-OUT.
033100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033300 BAIL-OUT-WRITE.
033400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
033500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033700     MOVE   SPACES TO INF-ANSI-REFERENCE.
033800 BAIL-OUT-EX. EXIT.
033900 CCVS1-EXIT.
034000     EXIT.
034100/ STROKE-COMMENT-TEST-7   SHOULD PAGE EJECT AND PRINT ON TOP LINE
034200* NULL1-NU-L-TEST-13
034300 0 SECTION.
034400 NULL1 SECTION.
034500 NU-L               SECTION                                      .
034600 A.
034700 B .
034800 C  .
034900 D   .
035000 THE-END.
035100     EXIT.
035200/ STROKE-COMMENT-TEST-7   SHOULD PAGE EJECT AND PRINT ON TOP LINE
035300* ASTERISK COMMENT SHOULD NOT BE SYNTAX CHECKED "(,l*.)-/+> <,....
035400 SECT-NC114-1 SECTION.
035500 ALPHA-EDIT-TEST-4.
035600     IF WRK-AE-1 EQUAL TO "ABC" NEXT SENTENCE ELSE MOVE "ABC" TO
035700         CORRECT-A GO TO ALPHA-EDIT-FAIL-4.
035800     MOVE "DEF" TO WRK-AE-1.
035900     IF WRK-AE-1 EQUAL TO "D E" PERFORM PASS
036000         GO TO ALPHA-EDIT-WRITE-4 ELSE MOVE "D E" TO CORRECT-A
036100         GO TO ALPHA-EDIT-FAIL-4.
036200 ALPHA-EDIT-DELETE-4.
036300     PERFORM DE-LETE.
036400     GO TO ALPHA-EDIT-WRITE-4.
036500 ALPHA-EDIT-FAIL-4.
036600     PERFORM FAIL.
036700     MOVE WRK-AE-1 TO COMPUTED-A.
036800 ALPHA-EDIT-WRITE-4.
036900     MOVE "ALPHA-ED-TEST-4" TO PAR-NAME.
037000     MOVE "B AS EDIT CHARACTER" TO FEATURE.
037100     PERFORM PRINT-DETAIL.
037200* ASTERISK COMMENT SHOULD NOT BE SYNTAX CHECKED "(,l*.)-/+> <,....
037300 ALPHA-EDIT-TEST-5.
037400     MOVE "ABC" TO WRK-AE-2.
037500     IF WRK-AE-2 EQUAL TO "A/BC" PERFORM PASS
037600         GO TO ALPHA-EDIT-WRITE-5 ELSE GO TO ALPHA-EDIT-FAIL-5.
037700 ALPHA-EDIT-DELETE-5.
037800     PERFORM DE-LETE.
037900     GO TO ALPHA-EDIT-WRITE-5.
038000 ALPHA-EDIT-FAIL-5.
038100     PERFORM FAIL.
038200     MOVE WRK-AE-2 TO COMPUTED-A.
038300     MOVE "A/BC" TO CORRECT-A.
038400 ALPHA-EDIT-WRITE-5.
038500     MOVE "ALPHA-ED-TEST-5" TO PAR-NAME.
038600     MOVE "/ AS EDIT CHARACTER" TO FEATURE.
038700     PERFORM PRINT-DETAIL.
038800 NUM-EDIT-TEST-6.
038900     MOVE 123 TO WRK-NE-1.
039000     IF WRK-NE-1 EQUAL TO "1/23" PERFORM PASS
039100         GO TO NUM-EDIT-WRITE-6 ELSE GO TO NUM-EDIT-FAIL-6.
039200 NUM-EDIT-DELETE-6.
039300     PERFORM DE-LETE.
039400     GO TO NUM-EDIT-WRITE-6.
039500 NUM-EDIT-FAIL-6.
039600     PERFORM FAIL.
039700     MOVE WRK-NE-1 TO COMPUTED-A.
039800     MOVE "1/23" TO CORRECT-A.
039900 NUM-EDIT-WRITE-6.
040000     MOVE "NUM-EDIT-TEST-6" TO PAR-NAME.
040100     MOVE "/ AS EDIT CHARACTER" TO FEATURE.
040200     PERFORM PRINT-DETAIL.
040300* ASTERISK COMMENT SHOULD NOT BE SYNTAX CHECKED "(,l*.)-/+> <,....
040400 ELEM-MOVE-TEST-16.
040500     MOVE WRK-DS-LS-1P17-1 TO WRK-XN-18-2.
040600     IF WRK-XN-18-2 EQUAL TO "100000000000000000" PERFORM PASS
040700         GO TO ELEM-MOVE-WRITE-16.
040800     GO TO ELEM-MOVE-FAIL-16.
040900 ELEM-MOVE-DELETE-16.
041000     PERFORM DE-LETE.
041100     GO TO ELEM-MOVE-WRITE-16.
041200 ELEM-MOVE-FAIL-16.
041300     PERFORM FAIL.
041400     MOVE WRK-XN-18-2 TO COMPUTED-A.
041500     MOVE "100000000000000000" TO CORRECT-A.
041600 ELEM-MOVE-WRITE-16.
041700     MOVE "MOVE-TEST-16" TO PAR-NAME.
041800     MOVE "STRIP MINUS SIGN" TO FEATURE.
041900     PERFORM PRINT-DETAIL.
042000 ELEM-MOVE-TEST-17.
042100     MOVE WRK-DS-LS-1P17-1 TO WRK-AE-3.
042200     IF WRK-AE-3 EQUAL TO "1 000/000/000/000/000 00"
042300         PERFORM PASS GO TO ELEM-MOVE-WRITE-17.
042400     GO TO ELEM-MOVE-FAIL-17.
042500 ELEM-MOVE-DELETE-17.
042600     PERFORM DE-LETE.
042700     GO TO ELEM-MOVE-WRITE-17.
042800 ELEM-MOVE-FAIL-17.
042900     PERFORM FAIL.
043000     MOVE WRK-AE-3 TO COMPUTED-A.
043100     MOVE "1 000/000/000/000/000 00" TO CORRECT-A.
043200 ELEM-MOVE-WRITE-17.
043300     MOVE "MOVE-TEST-17" TO PAR-NAME.
043400     MOVE "/ AND B EDITS" TO FEATURE.
043500     PERFORM PRINT-DETAIL.
043600 TEST-19-SYNTAX.
043700     PERFORM END-ROUTINE.
043800     MOVE    ZERO TO REC-CT.
043900     MOVE    SPACE TO TEST-RESULTS.
044000     MOVE    " PICTURE AB9  **  CHECK DATA DIV." TO TEST-RESULTS.
044100     PERFORM PRINT-DETAIL.
044200*
044300*    THE FOLLOWING LINES HAVE SPECIAL CHARACTERS IN THE
044400*    SEQUENCE AREA (COLS 1-6) AND MANUAL VERIFICATION OF
044500*    THEIR POSITION ON THE COMPILATION LISTING IS REQUESTED
044600*    IN THE REPORT.
044700*
044800 SEQ-NUM-TEST-1.
044900     MOVE   "IV-44  7.2.1"         TO ANSI-REFERENCE.
045000     MOVE    SPACES                TO TEST-RESULTS.
045100     MOVE   "SEQUENCE NUMBER AREA" TO FEATURE.
045200     MOVE   "SEQ-NUM-TEST-1"       TO PAR-NAME.
045300     PERFORM PRINT-DETAIL.
045400     MOVE   "   PLEASE VERIFY THAT THE FOLLOWING ENTRIES"
045500          TO RE-MARK.
045600     PERFORM PRINT-DETAIL.
045700     MOVE   "   ARE PRINTED IN THE SEQUENCE NUMBER AREA"
045800          TO RE-MARK.
045900     PERFORM PRINT-DETAIL.
046000     MOVE   "   (COLUMNS 1-6) NEAR THE END OF THE      "
046100          TO RE-MARK.
046200     PERFORM PRINT-DETAIL.
046300     MOVE   "   COMPILATION LISTING FOR NC114M:        "
046400          TO RE-MARK.
046500     PERFORM PRINT-DETAIL.
046600     MOVE    SPACES TO TEST-RESULTS.
046700     MOVE   "   COLUMNS:  123456" TO RE-MARK.
046800     PERFORM PRINT-DETAIL.
046900     MOVE   "   =======:  ======" TO RE-MARK.
047000     PERFORM PRINT-DETAIL.
047100     MOVE   "   ENTRY-1:  ABCDEF" TO RE-MARK.
047200     PERFORM PRINT-DETAIL.
047300     MOVE   "   ENTRY-2:  */+(>'" TO RE-MARK.
047400     PERFORM PRINT-DETAIL.
047500     MOVE   "   ENTRY-3:  999-99" TO RE-MARK.
047600     PERFORM PRINT-DETAIL.
047700     MOVE   "   ENTRY-4:  Z=.,;<" TO RE-MARK.
047800     PERFORM PRINT-DETAIL.
047900     MOVE   "   ENTRY-5:  )14$ X" TO RE-MARK.
048000     PERFORM PRINT-DETAIL.
048100     MOVE   "   ENTRY-6:    23 4" TO RE-MARK.
048200     PERFORM PRINT-DETAIL.
048300     PERFORM INSPT.
048400*
048500
ABCDEF
999-99
Z=.,;<
)14$ X
  23 4
049200
049300
049400
049500
049600*
049700 CCVS-EXIT SECTION.
049800 CCVS-999999.
049900     GO TO CLOSE-FILES.
050000* ASTERISK COMMENT AS THE LAST LINE IN THE SOURCE PROGRAM LISTING
