000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC118A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC118A TESTS THE USE OF THE "SIGN" CLAUSE USING
002300*    FORMATS 1 AND 2 OF THE ADD STATEMENT.  ALL COMBINATIONS
002400*    OF THE SIGN CLAUSE PHRASES ARE TESTED USING DATA ITEMS
002500*    OF VARIOUS LENGTHS.
002600*
002700
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 77  SIZE-ERR                     PICTURE X  VALUE SPACE.
004500 77  A18TWOS-DS-LS-18V00             PICTURE S9(18)
004600             SIGN IS LEADING SEPARATE
004700                                  VALUE 222222222222222222.
004800 77  A18ONES-DS-TS-18V00             PICTURE S9(18)
004900            SIGN IS TRAILING SEPARATE
005000                                  VALUE 111111111111111111.
005100 77  WRK-DS-10V00                 PICTURE S9(10) TRAILING.
005200 77  A10ONES-DS-T-10V00             PICTURE S9(10)
005300            SIGN TRAILING
005400                                  VALUE 1111111111.
005500 77  A05ONES-DS-L-05V00             PICTURE S9(5)
005600           SIGN LEADING
005700                                  VALUE 11111.
005800 77  A02ONES-DS-LS-02V00             PICTURE S99
005900           LEADING SEPARATE
006000                                  VALUE 11.
006100 77  WRK-DS-09V09                 PICTURE S9(9)V9(9) TRAILING.
006200 77  WRK-DS-T-18V00 REDEFINES WRK-DS-09V09
006300                                  PICTURE S9(18) TRAILING.
006400 77  A06THREES-DS-03V03           PICTURE S999V999
006500                                  VALUE 333.333.
006600 77  A12THREES-DS-06V06           PICTURE S9(6)V9(6)
006700                                  VALUE 333333.333333.
006800 77  WRK-DS-TS-06V06                 PICTURE S9(6)V9(6)
006900           SIGN IS TRAILING SEPARATE CHARACTER.
007000 77  WRK-DS-TS-12V00-S REDEFINES WRK-DS-TS-06V06
007100         TRAILING SEPARATE
007200                                  PICTURE S9(12).
007300 77  A05ONES-DS-LS-00V05             PICTURE SV9(5)
007400         LEADING SEPARATE
007500                                  VALUE .11111.
007600 77  WRK-DS-T-05V00              PICTURE S9(5) TRAILING.
007700 77  WRK-DS-T-06V00                 PICTURE S9(6) TRAILING.
007800 77  WRK-DS-02V00                 PICTURE S99.
007900 77  A12ONES-DS-L-12V00             PICTURE S9(12)
008000              USAGE IS DISPLAY SIGN IS LEADING
008100                                  VALUE 111111111111.
008200 77  WRK-DS-03V10                 PICTURE S999V9(10).
008300 77  WRK-DS-13V00-S REDEFINES WRK-DS-03V10
008400                                  PICTURE S9(13).
008500 77  A99-DS-T-02V00                 PICTURE S99
008600             USAGE IS DISPLAY SIGN IS TRAILING
008700                                  VALUE 99.
008800 77  A03ONES-DS-02V01             PICTURE S99V9
008900                                  VALUE 11.1.
009000 77  A06ONES-DS-TS-03V03             PICTURE S999V999
009100             USAGE IS DISPLAY TRAILING SEPARATE
009200                                  VALUE 111.111.
009300 77  A08TWOS-DS-02V06             PICTURE S99V9(6)
009400                                  VALUE 22.222222.
009500 77  A01ONES-DS-LS-P0801              PICTURE SP(8)9
009600             SIGN IS LEADING SEPARATE
009700                                  VALUE .000000001.
009800 77  WRK-CS-18V00                 PICTURE S9(18) COMPUTATIONAL.
009900 77  A18ONES-CS-18V00             PICTURE S9(18) COMPUTATIONAL
010000                                  VALUE 111111111111111111.
010100 77  WRK-CS-02V02                 PICTURE S99V99 COMPUTATIONAL.
010200 77  A99-CS-02V00                 PICTURE S99 COMPUTATIONAL
010300                                  VALUE 99.
010400 77  WRK-DS-TS-0201P            PICTURE S99P TRAILING SEPARATE.
010500 77  WRK-DS-06V00                 PICTURE S9(6).
010600 77  AZERO-DS-LS-05V05               PICTURE S9(5)V9(5)
010700             SIGN IS LEADING SEPARATE USAGE DISPLAY
010800                                  VALUE ZERO.
010900 77  NDATA-DS-09V09               PICTURE S9(9)V9(9)
011000                                  VALUE +012345678.876543210.
011100 77  XDATA-XN-00018               PICTURE X(18)
011200                                  VALUE "00ABCDEFGHI  4321 ".
011300 77  WRK-XN-00018                 PICTURE X(18).
011400 77  ADD-12    PICTURE PP9        VALUE .001.
011500 77  ADD-13    PICTURE 9PP        VALUE 100.
011600 77  ADD-14    PICTURE 999V999.
011700 77  WRK-CU-18V00      PICTURE 9(18) VALUE ZERO COMPUTATIONAL.
011800 77  A18EIGHTS-CS-18V00 PICTURE S9(18) VALUE -888888888888888888
011900             COMPUTATIONAL.
012000 77  A14TWOS-CS-18V00  PICTURE S9(18) VALUE -000022222222222222
012100             COMPUTATIONAL.
012200 77  A12THREES-CU-18V00 PICTURE 9(18) VALUE 000000333333333333
012300             COMPUTATIONAL.
012400 77  A16FOURS-CS-18V00 PICTURE S9(18) VALUE 004444444444444444
012500             COMPUTATIONAL.
012600 77  A18FIVES-CS-18V00 PICTURE S9(18) VALUE -555555555555555555
012700             COMPUTATIONAL.
012800 77  A18SIXES-CS-18V00 PICTURE S9(18) VALUE 666666666666666666
012900             COMPUTATIONAL.
013000 77  A12SEVENS-CU-18V00 PICTURE 9(18) VALUE 000000777777777777
013100             COMPUTATIONAL.
013200 77  WRK-DU-18V00      PICTURE 9(18) VALUE ZERO.
013300 77  A18THREES-CS-18V00 PICTURE S9(18) VALUE -333333333333333333
013400             COMPUTATIONAL.
013500 77  WRK-CS-03V00 PICTURE S999 COMPUTATIONAL SYNCHRONIZED RIGHT.
013600 01  SUBTRACT-DATA SIGN IS LEADING SEPARATE DISPLAY.
013700     02  SUBTR-1    PICTURE 9         VALUE 1.
013800     02  SUBTR-2    PICTURE S99       VALUE 99.
013900     02  SUBTR-3    PICTURE S9V99     VALUE -1.
014000     02  SUBTR-4    PICTURE SPP9      VALUE .001.
014100     02  SUBTR-5    PICTURE S9PP      VALUE 100.
014200     02  SUBTR-6    PICTURE 9  VALUE 1.
014300     02  SUBTR-7    PICTURE S99  VALUE 99.
014400     02  SUBTR-8    PICTURE S9V99  VALUE -9.99.
014500     02  SUBTR-10    PICTURE S999  VALUE 100.
014600     02  SUBTR-11   PICTURE S999V999.
014700 01  N-3                                PICTURE IS 99999.
014800 01  N-4                                PICTURE IS 9(5)
014900     VALUE IS 52800.
015000 01  N-5                                PICTURE IS S9(9)V99
015100             SIGN IS LEADING SEPARATE
015200     VALUE IS 000000001.00.
015300 01  N-7                                PICTURE IS S9(7)V9(4)
015400             SIGN IS LEADING SEPARATE CHARACTER
015500     VALUE IS 0000001.0000.
015600 01  X-8 REDEFINES N-7                  PICTURE IS X(11).
015700 01  N-10                               PICTURE IS S99999V
015800     VALUE IS -00001.
015900 01  N-11                               PICTURE IS 9 VALUE IS 9.
016000 01  N-12                               PICTURE IS 9 VALUE IS 9.
016100 01  N-13                               PICTURE IS 9(5)
016200     VALUE IS 99999.
016300 01  N-14                               PICTURE IS 9 VALUE IS 1.
016400 01  N-15                               PICTURE IS 9(16).
016500 01  N-16                               PICTURE IS S999999V99
016600     VALUE IS 5.90.
016700 01  N-17                               PICTURE IS S9(3)V99
016800     VALUE IS +3.6.
016900 01  N-18                               PICTURE IS S9(10)
017000     VALUE IS -5.
017100 01  N-19                               PICTURE IS $9.00.
017200 01  N-20                               PICTURE IS S9(9)
017300     VALUE IS -999999999.
017400 01  N-21                               PICTURE IS 9 VALUE IS 5.
017500 01  N-22                               PICTURE IS 999V99
017600     VALUE IS 005.55.
017700 01  N-23                               PICTURE IS $$$.99CR.
017800 01  N-25                               PICTURE IS 9 VALUE IS 1.
017900 01  N-26               PICTURE 9(5).
018000 01  N-27                               PICTURE IS 9999V9
018100     VALUE IS 9999.9.
018200 01  N-28                               PICTURE IS $9999.00.
018300 01  N-40                               PICTURE IS 9(7)
018400     VALUE IS 7777777.
018500 01  N-41                               PICTURE IS 9(7)
018600     VALUE IS 1111111.
018700 01  N-42                               PICTURE IS 9(3)P(4).
018800 01  TRUNC-DATA.
018900     02 N-43  PICTURE S9V9 VALUE +1.6.
019000     02 N-44  PICTURE S9V9 VALUE -1.6.
019100     02 N-45  PICTURE S9.
019200 01  MINUS-NAMES SIGN IS TRAILING SEPARATE CHARACTER.
019300     02  MINUS-NAME1 PICTURE S9(18) VALUE -999999999999999999.
019400     02  MINUS-NAME2 PICTURE S9(18) VALUE -999999999999999999.
019500     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
019600     02  PLUS-NAME1  PICTURE S9(18) VALUE +999999999999999999.
019700     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
019800     02  MINUS-NAME3 PICTURE SV9(18) VALUE -.999999999999999999.
019900     02  MINUS-NAME4 PICTURE SV9(18) VALUE -.999999999999999999.
020000     02  EVEN-NAME2  PICTURE SV9(18)  VALUE +.1.
020100     02  PLUS-NAME3  PICTURE SV9(18) VALUE +.999999999999999999.
020200     02  PLUS-NAME4  PICTURE SV9(18) VALUE +.999999999999999999.
020300     02  WHOLE-FIELD   PICTURE S9(18).
020400     02  DECMAL-FIELD  PICTURE SV9(18).
020500 01  TEST-RESULTS.
020600     02 FILLER                   PIC X      VALUE SPACE.
020700     02 FEATURE                  PIC X(20)  VALUE SPACE.
020800     02 FILLER                   PIC X      VALUE SPACE.
020900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
021000     02 FILLER                   PIC X      VALUE SPACE.
021100     02  PAR-NAME.
021200       03 FILLER                 PIC X(19)  VALUE SPACE.
021300       03  PARDOT-X              PIC X      VALUE SPACE.
021400       03 DOTVALUE               PIC 99     VALUE ZERO.
021500     02 FILLER                   PIC X(8)   VALUE SPACE.
021600     02 RE-MARK                  PIC X(61).
021700 01  TEST-COMPUTED.
021800     02 FILLER                   PIC X(30)  VALUE SPACE.
021900     02 FILLER                   PIC X(17)  VALUE
022000            "       COMPUTED=".
022100     02 COMPUTED-X.
022200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
022300     03 COMPUTED-N               REDEFINES COMPUTED-A
022400                                 PIC -9(9).9(9).
022500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
022600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
022700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
022800     03       CM-18V0 REDEFINES COMPUTED-A.
022900         04 COMPUTED-18V0                    PIC -9(18).
023000         04 FILLER                           PIC X.
023100     03 FILLER PIC X(50) VALUE SPACE.
023200 01  TEST-CORRECT.
023300     02 FILLER PIC X(30) VALUE SPACE.
023400     02 FILLER PIC X(17) VALUE "       CORRECT =".
023500     02 CORRECT-X.
023600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
023700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
023800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
023900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
024000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
024100     03      CR-18V0 REDEFINES CORRECT-A.
024200         04 CORRECT-18V0                     PIC -9(18).
024300         04 FILLER                           PIC X.
024400     03 FILLER PIC X(2) VALUE SPACE.
024500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
024600 01  CCVS-C-1.
024700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
024800-    "SS  PARAGRAPH-NAME
024900-    "       REMARKS".
025000     02 FILLER                     PIC X(20)    VALUE SPACE.
025100 01  CCVS-C-2.
025200     02 FILLER                     PIC X        VALUE SPACE.
025300     02 FILLER                     PIC X(6)     VALUE "TESTED".
025400     02 FILLER                     PIC X(15)    VALUE SPACE.
025500     02 FILLER                     PIC X(4)     VALUE "FAIL".
025600     02 FILLER                     PIC X(94)    VALUE SPACE.
025700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
025800 01  REC-CT                        PIC 99       VALUE ZERO.
025900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
026000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
026100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
026200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
026300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
026400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
026500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
026600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
026700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
026800 01  CCVS-H-1.
026900     02  FILLER                    PIC X(39)    VALUE SPACES.
027000     02  FILLER                    PIC X(42)    VALUE
027100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
027200     02  FILLER                    PIC X(39)    VALUE SPACES.
027300 01  CCVS-H-2A.
027400   02  FILLER                        PIC X(40)  VALUE SPACE.
027500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
027600   02  FILLER                        PIC XXXX   VALUE
027700     "4.2 ".
027800   02  FILLER                        PIC X(28)  VALUE
027900            " COPY - NOT FOR DISTRIBUTION".
028000   02  FILLER                        PIC X(41)  VALUE SPACE.
028100
028200 01  CCVS-H-2B.
028300   02  FILLER                        PIC X(15)  VALUE
028400            "TEST RESULT OF ".
028500   02  TEST-ID                       PIC X(9).
028600   02  FILLER                        PIC X(4)   VALUE
028700            " IN ".
028800   02  FILLER                        PIC X(12)  VALUE
028900     " HIGH       ".
029000   02  FILLER                        PIC X(22)  VALUE
029100            " LEVEL VALIDATION FOR ".
029200   02  FILLER                        PIC X(58)  VALUE
029300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029400 01  CCVS-H-3.
029500     02  FILLER                      PIC X(34)  VALUE
029600            " FOR OFFICIAL USE ONLY    ".
029700     02  FILLER                      PIC X(58)  VALUE
029800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
029900     02  FILLER                      PIC X(28)  VALUE
030000            "  COPYRIGHT   1985 ".
030100 01  CCVS-E-1.
030200     02 FILLER                       PIC X(52)  VALUE SPACE.
030300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
030400     02 ID-AGAIN                     PIC X(9).
030500     02 FILLER                       PIC X(45)  VALUE SPACES.
030600 01  CCVS-E-2.
030700     02  FILLER                      PIC X(31)  VALUE SPACE.
030800     02  FILLER                      PIC X(21)  VALUE SPACE.
030900     02 CCVS-E-2-2.
031000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
031100         03 FILLER                   PIC X      VALUE SPACE.
031200         03 ENDER-DESC               PIC X(44)  VALUE
031300            "ERRORS ENCOUNTERED".
031400 01  CCVS-E-3.
031500     02  FILLER                      PIC X(22)  VALUE
031600            " FOR OFFICIAL USE ONLY".
031700     02  FILLER                      PIC X(12)  VALUE SPACE.
031800     02  FILLER                      PIC X(58)  VALUE
031900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
032000     02  FILLER                      PIC X(13)  VALUE SPACE.
032100     02 FILLER                       PIC X(15)  VALUE
032200             " COPYRIGHT 1985".
032300 01  CCVS-E-4.
032400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
032500     02 FILLER                       PIC X(4)   VALUE " OF ".
032600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
032700     02 FILLER                       PIC X(40)  VALUE
032800      "  TESTS WERE EXECUTED SUCCESSFULLY".
032900 01  XXINFO.
033000     02 FILLER                       PIC X(19)  VALUE
033100            "*** INFORMATION ***".
033200     02 INFO-TEXT.
033300       04 FILLER                     PIC X(8)   VALUE SPACE.
033400       04 XXCOMPUTED                 PIC X(20).
033500       04 FILLER                     PIC X(5)   VALUE SPACE.
033600       04 XXCORRECT                  PIC X(20).
033700     02 INF-ANSI-REFERENCE           PIC X(48).
033800 01  HYPHEN-LINE.
033900     02 FILLER  PIC IS X VALUE IS SPACE.
034000     02 FILLER  PIC IS X(65)    VALUE IS "************************
034100-    "*****************************************".
034200     02 FILLER  PIC IS X(54)    VALUE IS "************************
034300-    "******************************".
034400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
034500     "NC118A".
034600 PROCEDURE DIVISION.
034700 CCVS1 SECTION.
034800 OPEN-FILES.
034900     OPEN     OUTPUT PRINT-FILE.
035000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
035100     MOVE    SPACE TO TEST-RESULTS.
035200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
035300     GO TO CCVS1-EXIT.
035400 CLOSE-FILES.
035500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
035600 TERMINATE-CCVS.
035700S    EXIT PROGRAM.
035800STERMINATE-CALL.
035900     STOP     RUN.
036000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
036100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
036200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
036300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
036400     MOVE "****TEST DELETED****" TO RE-MARK.
036500 PRINT-DETAIL.
036600     IF REC-CT NOT EQUAL TO ZERO
036700             MOVE "." TO PARDOT-X
036800             MOVE REC-CT TO DOTVALUE.
036900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
037000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
037100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
037200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
037300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
037400     MOVE SPACE TO CORRECT-X.
037500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
037600     MOVE     SPACE TO RE-MARK.
037700 HEAD-ROUTINE.
037800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
038100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
038200 COLUMN-NAMES-ROUTINE.
038300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
038600 END-ROUTINE.
038700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
038800 END-RTN-EXIT.
038900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039000 END-ROUTINE-1.
039100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
039200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
039300      ADD PASS-COUNTER TO ERROR-HOLD.
039400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
039500      MOVE PASS-COUNTER TO CCVS-E-4-1.
039600      MOVE ERROR-HOLD TO CCVS-E-4-2.
039700      MOVE CCVS-E-4 TO CCVS-E-2-2.
039800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
039900  END-ROUTINE-12.
040000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
040100     IF       ERROR-COUNTER IS EQUAL TO ZERO
040200         MOVE "NO " TO ERROR-TOTAL
040300         ELSE
040400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
040500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
040600     PERFORM WRITE-LINE.
040700 END-ROUTINE-13.
040800     IF DELETE-COUNTER IS EQUAL TO ZERO
040900         MOVE "NO " TO ERROR-TOTAL  ELSE
041000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
041100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
041200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041300      IF   INSPECT-COUNTER EQUAL TO ZERO
041400          MOVE "NO " TO ERROR-TOTAL
041500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
041600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
041700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041900 WRITE-LINE.
042000     ADD 1 TO RECORD-COUNT.
042100Y    IF RECORD-COUNT GREATER 42
042200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
042300Y        MOVE SPACE TO DUMMY-RECORD
042400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
042500Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
042600Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
042700Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
042800Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
042900Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
043000Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
043100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
043200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
043300Y        MOVE ZERO TO RECORD-COUNT.
043400     PERFORM WRT-LN.
043500 WRT-LN.
043600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
043700     MOVE SPACE TO DUMMY-RECORD.
043800 BLANK-LINE-PRINT.
043900     PERFORM WRT-LN.
044000 FAIL-ROUTINE.
044100     IF     COMPUTED-X NOT EQUAL TO SPACE
044200            GO TO FAIL-ROUTINE-WRITE.
044300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
044400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
044500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
044600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044700     MOVE   SPACES TO INF-ANSI-REFERENCE.
044800     GO TO  FAIL-ROUTINE-EX.
044900 FAIL-ROUTINE-WRITE.
045000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
045100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
045200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
045300     MOVE   SPACES TO COR-ANSI-REFERENCE.
045400 FAIL-ROUTINE-EX. EXIT.
045500 BAIL-OUT.
045600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
045700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
045800 BAIL-OUT-WRITE.
045900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
046000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046200     MOVE   SPACES TO INF-ANSI-REFERENCE.
046300 BAIL-OUT-EX. EXIT.
046400 CCVS1-EXIT.
046500     EXIT.
046600 SECT-NC118A-001 SECTION.
046700 SIG-INIT-GF-1.
046800     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
046900     MOVE   "ADD " TO FEATURE.
047000     MOVE    000000001.00   TO N-5.
047100     MOVE    0000001.0000   TO N-7.
047200 SIG-TEST-GF-1-0.
047300     ADD     N-5 TO N-7.
047400 SIG-TEST-GF-1-1.
047500     IF      N-7 = 2
047600             PERFORM PASS GO TO SIG-WRITE-GF-1.
047700     GO      TO SIG-FAIL-GF-1.
047800 SIG-DELETE-GF-1.
047900     PERFORM DE-LETE.
048000     GO      TO SIG-WRITE-GF-1.
048100 SIG-FAIL-GF-1.
048200     MOVE    N-7 TO COMPUTED-N
048300     MOVE    2   TO CORRECT-N.
048400     PERFORM  FAIL.
048500 SIG-WRITE-GF-1.
048600     MOVE     "SIG-TEST-GF-1" TO PAR-NAME.
048700     PERFORM  PRINT-DETAIL.
048800 SIG-INIT-GF-2.
048900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
049000     MOVE "ADD ---" TO FEATURE.
049100     PERFORM  PRINT-DETAIL.
049200     MOVE "  TO" TO FEATURE.
049300     MOVE     A18TWOS-DS-LS-18V00 TO WRK-DS-T-18V00.
049400 SIG-TEST-GF-2-0.
049500     ADD      A18ONES-DS-TS-18V00 TO WRK-DS-T-18V00.
049600 SIG-TEST-GF-2-1.
049700     IF       WRK-DS-T-18V00 EQUAL TO 333333333333333333
049800              PERFORM PASS GO TO SIG-WRITE-GF-2.
049900     GO       TO SIG-FAIL-GF-2.
050000 SIG-DELETE-GF-2.
050100     PERFORM  DE-LETE.
050200     GO       TO SIG-WRITE-GF-2.
050300 SIG-FAIL-GF-2.
050400     MOVE     WRK-DS-T-18V00 TO COMPUTED-18V0.
050500     MOVE     333333333333333333   TO CORRECT-18V0.
050600     PERFORM  FAIL.
050700 SIG-WRITE-GF-2.
050800     MOVE     "SIG-TEST-GF-2" TO PAR-NAME.
050900     PERFORM  PRINT-DETAIL.
051000 SIG-INIT-GF-3.
051100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
051200     MOVE     ZERO TO WRK-DS-10V00.
051300 SIG-TEST-GF-3-0.
051400     ADD      A10ONES-DS-T-10V00  A05ONES-DS-L-05V00
051500                     TO  WRK-DS-10V00.
051600 SIG-TEST-GF-3-1.
051700     IF       WRK-DS-10V00 EQUAL TO 1111122222
051800              PERFORM PASS GO TO SIG-WRITE-GF-3.
051900     GO       TO SIG-FAIL-GF-3.
052000 SIG-DELETE-GF-3.
052100     PERFORM  DE-LETE.
052200     GO       TO SIG-WRITE-GF-3.
052300 SIG-FAIL-GF-3.
052400     MOVE     WRK-DS-10V00 TO COMPUTED-18V0.
052500     MOVE     1111122222   TO CORRECT-18V0.
052600     PERFORM  FAIL.
052700 SIG-WRITE-GF-3.
052800     MOVE     "SIG-TEST-GF-3" TO PAR-NAME.
052900     PERFORM  PRINT-DETAIL.
053000 SIG-INIT-GF-4.
053100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
053200     MOVE     ZERO TO WRK-DS-10V00.
053300 SIG-TEST-GF-4-0.
053400     ADD      A02ONES-DS-LS-02V00
053500              A10ONES-DS-T-10V00
053600              A05ONES-DS-L-05V00 TO WRK-DS-10V00.
053700 SIG-TEST-GF-4-1.
053800     IF       WRK-DS-10V00 EQUAL TO 1111122233
053900              PERFORM PASS GO TO SIG-WRITE-GF-4.
054000     GO       TO SIG-FAIL-GF-4.
054100 SIG-DELETE-GF-4.
054200     PERFORM  DE-LETE.
054300     GO       TO SIG-WRITE-GF-4.
054400 SIG-FAIL-GF-4.
054500     MOVE     WRK-DS-10V00 TO COMPUTED-18V0.
054600     MOVE     1111122233   TO CORRECT-18V0.
054700     PERFORM  FAIL.
054800 SIG-WRITE-GF-4.
054900     MOVE     "SIG-TEST-GF-4" TO PAR-NAME.
055000     PERFORM  PRINT-DETAIL.
055100 SIG-INIT-GF-10.
055200     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
055300     MOVE "  GIVING" TO FEATURE.
055400     MOVE     ZERO TO WRK-DS-09V09.
055500 SIG-TEST-GF-10-0.
055600     ADD      A06THREES-DS-03V03
055700              A12THREES-DS-06V06 GIVING WRK-DS-09V09.
055800 SIG-TEST-GF-10-1.
055900     IF       WRK-DS-09V09 EQUAL TO 000333666.666333000
056000              PERFORM PASS GO TO SIG-WRITE-GF-10.
056100     GO       TO SIG-FAIL-GF-10.
056200 SIG-DELETE-GF-10.
056300     PERFORM  DE-LETE.
056400     GO       TO SIG-WRITE-GF-10.
056500 SIG-FAIL-GF-10.
056600     MOVE     WRK-DS-09V09 TO COMPUTED-N.
056700     MOVE     000333666.666333000 TO CORRECT-N.
056800     PERFORM  FAIL.
056900 SIG-WRITE-GF-10.
057000     MOVE     "SIG-TEST-GF-10" TO PAR-NAME.
057100     PERFORM  PRINT-DETAIL.
057200 SIG-INIT-GF-11.
057300     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
057400     MOVE     ZERO TO WRK-DS-TS-06V06.
057500 SIG-TEST-GF-11-0.
057600     ADD      A05ONES-DS-L-05V00
057700              A05ONES-DS-LS-00V05
057800              A12THREES-DS-06V06
057900              A06THREES-DS-03V03 GIVING WRK-DS-TS-06V06.
058000 SIG-TEST-GF-11-1.
058100     IF       WRK-DS-TS-06V06 EQUAL TO 344777.777443
058200              PERFORM PASS GO TO SIG-WRITE-GF-11.
058300     GO       TO SIG-FAIL-GF-11.
058400 SIG-DELETE-GF-11.
058500     PERFORM  DE-LETE.
058600     GO       TO SIG-WRITE-GF-11.
058700 SIG-FAIL-GF-11.
058800     MOVE     WRK-DS-TS-06V06 TO COMPUTED-N.
058900     MOVE     344777.777443 TO CORRECT-N.
059000     PERFORM  FAIL.
059100 SIG-WRITE-GF-11.
059200     MOVE     "SIG-TEST-GF-11" TO PAR-NAME.
059300     PERFORM PRINT-DETAIL.
059400 SIG-INIT-GF-5.
059500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
059600     MOVE "  ROUNDED" TO FEATURE.
059700     MOVE     ZERO TO WRK-DS-T-05V00.
059800 SIG-TEST-GF-5-0.
059900     ADD      55554.5 TO WRK-DS-T-05V00 ROUNDED.
060000 SIG-TEST-GF-5-1.
060100     IF       WRK-DS-T-05V00 EQUAL TO 55555
060200              PERFORM PASS GO TO SIG-WRITE-GF-5.
060300     GO       TO SIG-FAIL-GF-5.
060400 SIG-DELETE-GF-5.
060500     PERFORM  DE-LETE.
060600     GO       TO SIG-WRITE-GF-5.
060700 SIG-FAIL-GF-5.
060800     MOVE     WRK-DS-T-05V00 TO COMPUTED-N.
060900     MOVE     55555 TO CORRECT-N.
061000     PERFORM  FAIL.
061100 SIG-WRITE-GF-5.
061200     MOVE     "SIG-TEST-GF-5" TO PAR-NAME.
061300     PERFORM  PRINT-DETAIL.
061400 SIG-INIT-GF-12.
061500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
061600     MOVE     ZERO TO WRK-DS-T-06V00.
061700 SIG-TEST-GF-12-0.
061800     ADD      A05ONES-DS-LS-00V05
061900              A12THREES-DS-06V06
062000              A05ONES-DS-LS-00V05 GIVING WRK-DS-T-06V00 ROUNDED.
062100 SIG-TEST-GF-12-1.
062200     IF      WRK-DS-T-06V00 EQUAL TO 333334
062300     PERFORM PASS GO TO SIG-WRITE-GF-12.
062400     GO      TO SIG-FAIL-GF-12.
062500 SIG-DELETE-GF-12.
062600     PERFORM  DE-LETE.
062700     GO       TO SIG-WRITE-GF-12.
062800 SIG-FAIL-GF-12.
062900     MOVE    WRK-DS-T-06V00 TO COMPUTED-N.
063000     MOVE    333334 TO CORRECT-N.
063100     PERFORM FAIL.
063200 SIG-WRITE-GF-12.
063300     MOVE     "SIG-TEST-GF-12" TO PAR-NAME.
063400     PERFORM  PRINT-DETAIL.
063500 SIG-INIT-GF-13.
063600     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
063700     MOVE     ZERO TO WRK-DS-10V00.
063800 SIG-TEST-GF-13-1-0.
063900     ADD      A12ONES-DS-L-12V00
064000              ZERO GIVING WRK-DS-10V00 ON SIZE ERROR
064100              PERFORM PASS GO TO SIG-WRITE-GF-13-1.
064200     GO       TO SIG-FAIL-GF-13-1.
064300 SIG-DELETE-GF-13-1.
064400     PERFORM  DE-LETE.
064500     GO       TO SIG-WRITE-GF-13-1.
064600 SIG-FAIL-GF-13-1.
064700     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
064800     PERFORM  FAIL.
064900 SIG-WRITE-GF-13-1.
065000     MOVE     "SIG-TEST-GF-13-1" TO PAR-NAME.
065100     PERFORM  PRINT-DETAIL.
065200 SIG-TEST-GF-13-2.
065300     IF       WRK-DS-10V00 EQUAL TO ZERO
065400              PERFORM PASS GO TO SIG-WRITE-GF-13-2.
065500*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SIG-TEST-GF-13-1
065600     GO       TO SIG-FAIL-GF-13-2.
065700 SIG-DELETE-GF-13-2.
065800     PERFORM  DE-LETE.
065900     GO       TO SIG-WRITE-GF-13-2.
066000 SIG-FAIL-GF-13-2.
066100     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
066200     MOVE     WRK-DS-10V00 TO COMPUTED-14V4.
066300     MOVE     ZERO TO CORRECT-14V4.
066400     PERFORM  FAIL.
066500 SIG-WRITE-GF-13-2.
066600     MOVE     "SIG-TEST-GF-13-2" TO PAR-NAME.
066700     PERFORM  PRINT-DETAIL.
066800 SIG-INIT-GF-6.
066900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
067000     MOVE "  ROUNDED,SIZE ERROR" TO FEATURE.
067100     MOVE     ZERO TO WRK-DS-T-05V00.
067200 SIG-TEST-GF-6-1.
067300     ADD      33333
067400              A06THREES-DS-03V03
067500              A12THREES-DS-06V06
067600              TO WRK-DS-T-05V00 ROUNDED ON SIZE ERROR
067700              PERFORM PASS GO TO SIG-WRITE-GF-6-1.
067800     GO       TO SIG-FAIL-GF-6-1.
067900 SIG-DELETE-GF-6-1.
068000     PERFORM  DE-LETE.
068100     GO       TO SIG-WRITE-GF-6-1.
068200 SIG-FAIL-GF-6-1.
068300     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
068400     PERFORM  FAIL.
068500 SIG-WRITE-GF-6-1.
068600     MOVE     "SIG-TEST-GF-6-1" TO PAR-NAME.
068700     PERFORM  PRINT-DETAIL.
068800 SIG-TEST-GF-6-2.
068900     IF       WRK-DS-T-05V00 EQUAL TO ZERO
069000              PERFORM PASS GO TO SIG-WRITE-GF-6-2.
069100*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SIG-TEST-GF-6-1
069200     GO       TO SIG-FAIL-GF-6-2.
069300 SIG-DELETE-GF-6-2.
069400     PERFORM  DE-LETE.
069500     GO       TO SIG-WRITE-GF-6-2.
069600 SIG-FAIL-GF-6-2.
069700     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
069800     MOVE     WRK-DS-T-05V00 TO COMPUTED-N.
069900     MOVE     ZERO TO CORRECT-N.
070000     PERFORM  FAIL.
070100 SIG-WRITE-GF-6-2.
070200     MOVE     "SIG-TEST-GF-6-2" TO PAR-NAME.
070300     PERFORM  PRINT-DETAIL.
070400 SIG-INIT-GF-7.
070500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
070600     MOVE     ZERO TO WRK-DS-TS-06V06.
070700 SIG-TEST-GF-7-1.
070800     ADD      A12THREES-DS-06V06
070900              333333
071000              A06THREES-DS-03V03
071100              TO WRK-DS-TS-06V06 ROUNDED ON SIZE ERROR
071200              GO TO SIG-FAIL-GF-7-1.
071300     PERFORM  PASS.
071400     GO TO SIG-WRITE-GF-7-1.
071500 SIG-DELETE-GF-7-1.
071600     PERFORM  DE-LETE.
071700     GO       TO SIG-WRITE-GF-7-1.
071800 SIG-FAIL-GF-7-1.
071900     MOVE     "SIZE ERR SHOULD NOT EXECUTE" TO RE-MARK.
072000     PERFORM  FAIL.
072100 SIG-WRITE-GF-7-1.
072200     MOVE     "SIG-TEST-GF-7-1" TO PAR-NAME.
072300     PERFORM  PRINT-DETAIL.
072400 SIG-TEST-GF-7-2.
072500     IF       WRK-DS-TS-06V06 EQUAL TO 666999.666333
072600              PERFORM PASS GO TO SIG-WRITE-GF-7-2.
072700*    NOTE     THIS TEST DEPENDS UPON THE RESULT OF SIG-TEST-GF-7-1
072800     GO       TO SIG-FAIL-GF-7-2.
072900 SIG-DELETE-GF-7-2.
073000     PERFORM  DE-LETE.
073100     GO       TO SIG-WRITE-GF-7-2.
073200 SIG-FAIL-GF-7-2.
073300     MOVE     WRK-DS-TS-06V06 TO COMPUTED-N.
073400     MOVE     666999.666333 TO CORRECT-N.
073500     PERFORM  FAIL.
073600 SIG-WRITE-GF-7-2.
073700     MOVE     "SIG-TEST-GF-7-2" TO PAR-NAME.
073800     PERFORM  PRINT-DETAIL.
073900 SIG-INIT-GF-14.
074000     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
074100     MOVE     ZERO TO WRK-DS-T-05V00.
074200 SIG-TEST-GF-14-1.
074300     ADD      33333
074400              A06THREES-DS-03V03
074500              A12THREES-DS-06V06
074600              GIVING WRK-DS-T-05V00 ROUNDED ON SIZE ERROR
074700              PERFORM PASS GO TO SIG-WRITE-GF-14-1.
074800     GO       TO SIG-FAIL-GF-14-1.
074900 SIG-DELETE-GF-14-1.
075000     PERFORM  DE-LETE.
075100     GO       TO SIG-WRITE-GF-14-1.
075200 SIG-FAIL-GF-14-1.
075300     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
075400     PERFORM  FAIL.
075500 SIG-WRITE-GF-14-1.
075600     MOVE     "SIG-TEST-GF-14-1" TO PAR-NAME.
075700     PERFORM  PRINT-DETAIL.
075800 SIG-TEST-GF-14-2.
075900     IF       WRK-DS-T-05V00 EQUAL TO ZERO
076000              PERFORM PASS GO TO SIG-WRITE-GF-14-2.
076100     GO       TO SIG-FAIL-GF-14-2.
076200*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SIG-TEST-GF-14-1
076300 SIG-DELETE-GF-14-2.
076400     PERFORM  DE-LETE.
076500     GO       TO SIG-WRITE-GF-14-2.
076600 SIG-FAIL-GF-14-2.
076700     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
076800     MOVE     WRK-DS-T-05V00 TO COMPUTED-N.
076900     MOVE     ZERO TO CORRECT-N.
077000     PERFORM  FAIL.
077100 SIG-WRITE-GF-14-2.
077200     MOVE     "SIG-TEST-GF-14-2" TO PAR-NAME.
077300     PERFORM  PRINT-DETAIL.
077400 SIG-INIT-GF-15.
077500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
077600     MOVE     ZERO TO WRK-DS-TS-06V06.
077700 SIG-TEST-GF-15-1-0.
077800     ADD      A12THREES-DS-06V06
077900              333333
078000              A06THREES-DS-03V03
078100              GIVING WRK-DS-TS-06V06 ROUNDED ON SIZE ERROR
078200              GO TO SIG-FAIL-GF-15-1.
078300     PERFORM  PASS.
078400     GO       TO SIG-WRITE-GF-15-1.
078500 SIG-DELETE-GF-15-1.
078600     PERFORM  DE-LETE.
078700     GO       TO SIG-WRITE-GF-15-1.
078800 SIG-FAIL-GF-15-1.
078900     MOVE     "SIZE ERR SHOULD NOT EXECUTE" TO RE-MARK.
079000     PERFORM  FAIL.
079100 SIG-WRITE-GF-15-1.
079200     MOVE     "SIG-TEST-GF-15-1" TO PAR-NAME.
079300     PERFORM  PRINT-DETAIL.
079400 SIG-TEST-GF-15-2.
079500     IF       WRK-DS-TS-06V06 EQUAL TO 666999.666333
079600              PERFORM PASS GO TO SIG-WRITE-GF-15-2.
079700*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SIG-TEST-GF-15-1
079800     GO       TO SIG-FAIL-GF-15-2.
079900 SIG-DELETE-GF-15-2.
080000     PERFORM  DE-LETE.
080100     GO       TO SIG-WRITE-GF-15-2.
080200 SIG-FAIL-GF-15-2.
080300     MOVE     WRK-DS-TS-06V06 TO COMPUTED-N.
080400     MOVE     666999.666333 TO CORRECT-N.
080500     PERFORM  FAIL.
080600 SIG-WRITE-GF-15-2.
080700     MOVE     "SIG-TEST-GF-15-2" TO PAR-NAME.
080800     PERFORM  PRINT-DETAIL.
080900 SIG-INIT-GF-16.
081000     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
081100     MOVE "  SERIES" TO FEATURE.
081200     MOVE     ZERO TO WRK-DS-03V10.
081300 SIG-TEST-GF-16-0.
081400     ADD      A99-DS-T-02V00
081500              A03ONES-DS-02V01
081600              A06ONES-DS-TS-03V03
081700              A08TWOS-DS-02V06
081800              -1.1111111
081900              +.11111111
082000              A01ONES-DS-LS-P0801 GIVING WRK-DS-03V10.
082100 SIG-TEST-GF-16-1.
082200     IF       WRK-DS-03V10 EQUAL TO 242.4332220110
082300              PERFORM PASS GO TO SIG-WRITE-GF-16.
082400     GO       TO SIG-FAIL-GF-16.
082500 SIG-DELETE-GF-16.
082600     PERFORM  DE-LETE.
082700     GO       TO SIG-WRITE-GF-16.
082800 SIG-FAIL-GF-16.
082900     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
083000     MOVE     242.4332220110 TO CORRECT-4V14.
083100     PERFORM  FAIL.
083200 SIG-WRITE-GF-16.
083300     MOVE     "SIG-TEST-GF-16" TO PAR-NAME.
083400     PERFORM  PRINT-DETAIL.
083500 SIG-INIT-GF-17.
083600     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
083700     MOVE     ZERO TO WRK-DS-03V10.
083800 SIG-TEST-GF-17-0.
083900     ADD      A01ONES-DS-LS-P0801
084000              +.11111111
084100              -1.1111111
084200              A08TWOS-DS-02V06
084300              A06ONES-DS-TS-03V03
084400              A03ONES-DS-02V01
084500              A99-DS-T-02V00 GIVING WRK-DS-03V10.
084600 SIG-TEST-GF-17-1.
084700     IF       WRK-DS-03V10 EQUAL TO 242.4332220110
084800              PERFORM PASS GO TO SIG-WRITE-GF-17.
084900     GO       TO SIG-FAIL-GF-17.
085000 SIG-DELETE-GF-17.
085100     PERFORM  DE-LETE.
085200     GO       TO SIG-WRITE-GF-17.
085300 SIG-FAIL-GF-17.
085400     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
085500     MOVE     242.4332220110 TO CORRECT-4V14.
085600     PERFORM  FAIL.
085700 SIG-WRITE-GF-17.
085800     MOVE     "SIG-TEST-GF-17" TO PAR-NAME.
085900     PERFORM  PRINT-DETAIL.
086000 SIG-INIT-GF-18.
086100     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
086200     MOVE     ZERO TO WRK-DS-03V10.
086300 SIG-TEST-GF-18-0.
086400     ADD      A08TWOS-DS-02V06
086500              A99-DS-T-02V00
086600              -1.1111111
086700              A03ONES-DS-02V01
086800              A01ONES-DS-LS-P0801
086900              +.11111111
087000              A06ONES-DS-TS-03V03 GIVING WRK-DS-03V10.
087100 SIG-TEST-GF-18-1.
087200     IF       WRK-DS-03V10 EQUAL TO 242.4332220110
087300              PERFORM PASS GO TO SIG-WRITE-GF-18.
087400     GO       TO SIG-FAIL-GF-18.
087500 SIG-DELETE-GF-18.
087600     PERFORM  DE-LETE.
087700     GO       TO SIG-WRITE-GF-18.
087800 SIG-FAIL-GF-18.
087900     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
088000     MOVE     242.4332220110 TO CORRECT-4V14.
088100     PERFORM  FAIL.
088200 SIG-WRITE-GF-18.
088300     MOVE     "SIG-TEST-GF-18" TO PAR-NAME.
088400     PERFORM  PRINT-DETAIL.
088500 SIG-INIT-GF-8.
088600     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
088700     MOVE "  COMP VS. DISPLAY"  TO FEATURE.
088800     MOVE     A18ONES-DS-TS-18V00 TO WRK-CS-18V00.
088900 SIG-TEST-GF-8-0.
089000     ADD      A18ONES-DS-TS-18V00 TO WRK-CS-18V00.
089100 SIG-TEST-GF-8-1.
089200     IF       WRK-CS-18V00 EQUAL TO 222222222222222222
089300              PERFORM PASS GO TO SIG-WRITE-GF-8.
089400     GO       TO SIG-FAIL-GF-8.
089500 SIG-DELETE-GF-8.
089600     PERFORM  DE-LETE.
089700     GO       TO SIG-WRITE-GF-8.
089800 SIG-FAIL-GF-8.
089900     MOVE     WRK-CS-18V00 TO COMPUTED-18V0.
090000     MOVE     222222222222222222 TO CORRECT-18V0.
090100     PERFORM  FAIL.
090200 SIG-WRITE-GF-8.
090300     MOVE     "SIG-TEST-GF-8" TO PAR-NAME.
090400     PERFORM  PRINT-DETAIL.
090500 SIG-INIT-GF-9.
090600     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
090700     MOVE     A18ONES-DS-TS-18V00 TO WRK-DS-T-18V00.
090800 SIG-TEST-GF-9-0.
090900     ADD      A18ONES-CS-18V00 TO WRK-DS-T-18V00.
091000 SIG-TEST-GF-9-1.
091100     IF       WRK-DS-T-18V00 EQUAL TO 222222222222222222
091200              PERFORM PASS GO TO SIG-WRITE-GF-9.
091300     GO       TO SIG-FAIL-GF-9.
091400 SIG-DELETE-GF-9.
091500     PERFORM  DE-LETE.
091600     GO       TO SIG-WRITE-GF-9.
091700 SIG-FAIL-GF-9.
091800     MOVE     WRK-DS-T-18V00 TO COMPUTED-18V0.
091900     MOVE     222222222222222222 TO CORRECT-18V0.
092000     PERFORM  FAIL.
092100 SIG-WRITE-GF-9.
092200     MOVE     "SIG-TEST-GF-9" TO PAR-NAME.
092300     PERFORM  PRINT-DETAIL.
092400 SIG-INIT-GF-19.
092500     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
092600     MOVE SPACE TO SIZE-ERR.
092700 SIG-TEST-GF-19-0.
092800     ADD MINUS-NAME1  MINUS-NAME2  -34  -1  PLUS-NAME1
092900         PLUS-NAME2  EVEN-NAME1  35  GIVING WHOLE-FIELD
093000         ON SIZE ERROR  MOVE "1" TO SIZE-ERR.
093100 SIG-TEST-GF-19-1.
093200     IF WHOLE-FIELD EQUAL TO +1
093300         PERFORM PASS
093400         GO TO SIG-WRITE-GF-19-1.
093500     MOVE WHOLE-FIELD TO COMPUTED-18V0.
093600     MOVE +1 TO CORRECT-18V0.
093700     PERFORM FAIL.
093800     GO TO SIG-WRITE-GF-19-1.
093900 SIG-DELETE-GF-19-1.
094000     PERFORM DE-LETE.
094100 SIG-WRITE-GF-19-1.
094200     MOVE "SIG-TEST-GF-19-1" TO PAR-NAME.
094300     PERFORM PRINT-DETAIL.
094400 SIG-TEST-GF-19-2.
094500     IF SIZE-ERR EQUAL TO "1"
094600         PERFORM FAIL
094700         MOVE SPACE TO CORRECT-A
094800         MOVE 1 TO COMPUTED-A
094900         MOVE "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
095000         GO TO SIG-WRITE-GF-19-2.
095100     PERFORM PASS.
095200     GO TO SIG-WRITE-GF-19-2.
095300 SIG-DELETE-GF-19-2.
095400     PERFORM DE-LETE.
095500 SIG-WRITE-GF-19-2.
095600     MOVE "SIG-TEST-GF-19-2" TO PAR-NAME.
095700     PERFORM PRINT-DETAIL.
095800 SIG-INIT-GF-20.
095900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
096000     MOVE SPACE TO SIZE-ERR.
096100     MOVE ZERO  TO DECMAL-FIELD.
096200     MOVE -.999999999999999999 TO MINUS-NAME3.
096300     MOVE -.999999999999999999 TO MINUS-NAME4.
096400     MOVE +.1                  TO EVEN-NAME2.
096500     MOVE +.999999999999999999 TO PLUS-NAME3.
096600     MOVE +.999999999999999999 TO PLUS-NAME4.
096700 SIG-TEST-GF-20-0.
096800     ADD MINUS-NAME3  MINUS-NAME4  -.34  -.01  PLUS-NAME3
096900         PLUS-NAME4  EVEN-NAME2  .35  GIVING DECMAL-FIELD
097000         ON SIZE ERROR  MOVE "1" TO SIZE-ERR.
097100 SIG-TEST-GF-20-1.
097200     IF DECMAL-FIELD EQUAL TO +.1
097300         PERFORM PASS
097400         GO TO SIG-WRITE-GF-20-1.
097500     MOVE DECMAL-FIELD TO COMPUTED-0V18.
097600     MOVE +.1 TO CORRECT-0V18.
097700     PERFORM FAIL.
097800     GO TO SIG-WRITE-GF-20-1.
097900 SIG-DELETE-GF-20-1.
098000     PERFORM DE-LETE.
098100 SIG-WRITE-GF-20-1.
098200     MOVE "SIG-TEST-GF-20-1" TO PAR-NAME.
098300     PERFORM PRINT-DETAIL.
098400 SIG-TEST-GF-20-2.
098500     IF SIZE-ERR EQUAL TO "1"
098600         PERFORM FAIL
098700         MOVE SPACE TO CORRECT-A
098800         MOVE 1 TO COMPUTED-A
098900         MOVE "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
099000         GO TO SIG-WRITE-GF-20-2.
099100     PERFORM PASS.
099200     GO TO SIG-WRITE-GF-20-2.
099300 SIG-DELETE-GF-20-2.
099400     PERFORM DE-LETE.
099500 SIG-WRITE-GF-20-2.
099600     MOVE "SIG-TEST-GF-20-2" TO PAR-NAME.
099700     PERFORM PRINT-DETAIL.
099800 SIG-INIT-GF-21.
099900     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
100000     MOVE ZERO TO WRK-CS-18V00.
100100 SIG-TEST-GF-21-0.
100200     ADD A18ONES-CS-18V00 A18ONES-DS-TS-18V00 GIVING WRK-CS-18V00.
100300 SIG-TEST-GF-21-1.
100400     IF WRK-CS-18V00 EQUAL TO 222222222222222222
100500         PERFORM PASS
100600         GO TO SIG-WRITE-GF-21.
100700     MOVE 222222222222222222 TO CORRECT-18V0.
100800     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
100900     PERFORM FAIL.
101000     GO TO SIG-WRITE-GF-21.
101100 SIG-DELETE-GF-21.
101200     PERFORM DE-LETE.
101300 SIG-WRITE-GF-21.
101400     MOVE "SIG-TEST-GF-21 " TO PAR-NAME.
101500     PERFORM PRINT-DETAIL.
101600 SIG-INIT-GF-22.
101700     MOVE   "VI-42 5.12.4" TO ANSI-REFERENCE.
101800     MOVE ZERO TO WRK-DS-T-18V00.
101900 SIG-TEST-GF-22-0.
102000     ADD A18SIXES-CS-18V00  A12SEVENS-CU-18V00 GIVING
102100             WRK-DS-T-18V00.
102200 SIG-TEST-GF-22-1.
102300     IF WRK-DS-T-18V00 EQUAL TO 666667444444444443
102400         PERFORM PASS
102500         GO TO SIG-WRITE-GF-22.
102600     MOVE 666667444444444443 TO CORRECT-18V0.
102700     MOVE WRK-DS-T-18V00 TO COMPUTED-18V0.
102800     PERFORM FAIL.
102900     GO TO SIG-WRITE-GF-22.
103000 SIG-DELETE-GF-22.
103100     PERFORM DE-LETE.
103200 SIG-WRITE-GF-22.
103300     MOVE "SIG-TEST-GF-22 " TO PAR-NAME.
103400     PERFORM PRINT-DETAIL.
103500 CCVS-EXIT SECTION.
103600 CCVS-999999.
103700     GO TO CLOSE-FILES.
