000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC121M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC121M TESTS THE USE OF INDEXED IDENTIFIERS WITH
002300*    FORMATS 1 AND 2 OF THE "MULTIPLY" STATEMENT,  FORMATS
002400*    1, 2 AND 3 OF THE "DIVIDE" STATEMENT,  FORMATS 1 AND 2 OF
002500*    THE "PERFORM" STATEMENT AND THE "DISPLAY" STATEMENT
002600*    GENERAL FORMAT.
002700*    ONE AND TWO LEVELS OF INDEXING ARE USED AS WELL AS
002800*    RELATIVE INDEXING.
002900*
003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.
003300     XXXXX082.
003400 OBJECT-COMPUTER.
003500     XXXXX083.
003600 INPUT-OUTPUT SECTION.
003700 FILE-CONTROL.
003800     SELECT PRINT-FILE ASSIGN TO
003900     XXXXX055.
004000 DATA DIVISION.
004100 FILE SECTION.
004200 FD  PRINT-FILE.
004300 01  PRINT-REC PICTURE X(120).
004400 01  DUMMY-RECORD PICTURE X(120).
004500 WORKING-STORAGE SECTION.
004600 01  TABLE1.
004700     02  TABLE1-NUM              PICTURE S9V99
004800                                 OCCURS 10 TIMES
004900                                 INDEXED BY INDEX1.
005000 01  TABLE2.
005100     02  TABLE2-NUM              PICTURE 9V9
005200                                 OCCURS 6 TIMES
005300                                 INDEXED BY INDEX2.
005400 01  TABLE3.
005500     02  TABLE3-NUM              PICTURE 99V9
005600                                 OCCURS 6 TIMES
005700                                 INDEXED BY INDEX3.
005800 01  TABLE4.
005900     02  TABLE4-NUM1             OCCURS 3 TIMES
006000                                 INDEXED BY INDEX4-1.
006100         03 TABLE4-NUM2          PICTURE 99
006200                                 OCCURS 3 TIMES
006300                                 INDEXED BY INDEX4-2.
006400 01  TABLE5.
006500     02  TABLE5-NUM              PIC 9
006600                                 OCCURS 2 TIMES
006700                                 INDEXED BY INDEX5.
006800 01  TABLE6.
006900     02  TABLE6-REC              PICTURE X(10)
007000                                 OCCURS 2 TIMES
007100                                 INDEXED BY INDEX6.
007200 01  NUM-9V9                     PICTURE 9V9.
007300 01  TEST-RESULTS.
007400     02 FILLER                   PIC X      VALUE SPACE.
007500     02 FEATURE                  PIC X(20)  VALUE SPACE.
007600     02 FILLER                   PIC X      VALUE SPACE.
007700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
007800     02 FILLER                   PIC X      VALUE SPACE.
007900     02  PAR-NAME.
008000       03 FILLER                 PIC X(19)  VALUE SPACE.
008100       03  PARDOT-X              PIC X      VALUE SPACE.
008200       03 DOTVALUE               PIC 99     VALUE ZERO.
008300     02 FILLER                   PIC X(8)   VALUE SPACE.
008400     02 RE-MARK                  PIC X(61).
008500 01  TEST-COMPUTED.
008600     02 FILLER                   PIC X(30)  VALUE SPACE.
008700     02 FILLER                   PIC X(17)  VALUE
008800            "       COMPUTED=".
008900     02 COMPUTED-X.
009000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009100     03 COMPUTED-N               REDEFINES COMPUTED-A
009200                                 PIC -9(9).9(9).
009300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
009400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
009500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
009600     03       CM-18V0 REDEFINES COMPUTED-A.
009700         04 COMPUTED-18V0                    PIC -9(18).
009800         04 FILLER                           PIC X.
009900     03 FILLER PIC X(50) VALUE SPACE.
010000 01  TEST-CORRECT.
010100     02 FILLER PIC X(30) VALUE SPACE.
010200     02 FILLER PIC X(17) VALUE "       CORRECT =".
010300     02 CORRECT-X.
010400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
010500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
010600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
010700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
010800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
010900     03      CR-18V0 REDEFINES CORRECT-A.
011000         04 CORRECT-18V0                     PIC -9(18).
011100         04 FILLER                           PIC X.
011200     03 FILLER PIC X(2) VALUE SPACE.
011300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011400 01  CCVS-C-1.
011500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011600-    "SS  PARAGRAPH-NAME
011700-    "       REMARKS".
011800     02 FILLER                     PIC X(20)    VALUE SPACE.
011900 01  CCVS-C-2.
012000     02 FILLER                     PIC X        VALUE SPACE.
012100     02 FILLER                     PIC X(6)     VALUE "TESTED".
012200     02 FILLER                     PIC X(15)    VALUE SPACE.
012300     02 FILLER                     PIC X(4)     VALUE "FAIL".
012400     02 FILLER                     PIC X(94)    VALUE SPACE.
012500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012600 01  REC-CT                        PIC 99       VALUE ZERO.
012700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013600 01  CCVS-H-1.
013700     02  FILLER                    PIC X(39)    VALUE SPACES.
013800     02  FILLER                    PIC X(42)    VALUE
013900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014000     02  FILLER                    PIC X(39)    VALUE SPACES.
014100 01  CCVS-H-2A.
014200   02  FILLER                        PIC X(40)  VALUE SPACE.
014300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014400   02  FILLER                        PIC XXXX   VALUE
014500     "4.2 ".
014600   02  FILLER                        PIC X(28)  VALUE
014700            " COPY - NOT FOR DISTRIBUTION".
014800   02  FILLER                        PIC X(41)  VALUE SPACE.
014900
015000 01  CCVS-H-2B.
015100   02  FILLER                        PIC X(15)  VALUE
015200            "TEST RESULT OF ".
015300   02  TEST-ID                       PIC X(9).
015400   02  FILLER                        PIC X(4)   VALUE
015500            " IN ".
015600   02  FILLER                        PIC X(12)  VALUE
015700     " HIGH       ".
015800   02  FILLER                        PIC X(22)  VALUE
015900            " LEVEL VALIDATION FOR ".
016000   02  FILLER                        PIC X(58)  VALUE
016100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016200 01  CCVS-H-3.
016300     02  FILLER                      PIC X(34)  VALUE
016400            " FOR OFFICIAL USE ONLY    ".
016500     02  FILLER                      PIC X(58)  VALUE
016600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016700     02  FILLER                      PIC X(28)  VALUE
016800            "  COPYRIGHT   1985 ".
016900 01  CCVS-E-1.
017000     02 FILLER                       PIC X(52)  VALUE SPACE.
017100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017200     02 ID-AGAIN                     PIC X(9).
017300     02 FILLER                       PIC X(45)  VALUE SPACES.
017400 01  CCVS-E-2.
017500     02  FILLER                      PIC X(31)  VALUE SPACE.
017600     02  FILLER                      PIC X(21)  VALUE SPACE.
017700     02 CCVS-E-2-2.
017800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017900         03 FILLER                   PIC X      VALUE SPACE.
018000         03 ENDER-DESC               PIC X(44)  VALUE
018100            "ERRORS ENCOUNTERED".
018200 01  CCVS-E-3.
018300     02  FILLER                      PIC X(22)  VALUE
018400            " FOR OFFICIAL USE ONLY".
018500     02  FILLER                      PIC X(12)  VALUE SPACE.
018600     02  FILLER                      PIC X(58)  VALUE
018700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018800     02  FILLER                      PIC X(13)  VALUE SPACE.
018900     02 FILLER                       PIC X(15)  VALUE
019000             " COPYRIGHT 1985".
019100 01  CCVS-E-4.
019200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019300     02 FILLER                       PIC X(4)   VALUE " OF ".
019400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019500     02 FILLER                       PIC X(40)  VALUE
019600      "  TESTS WERE EXECUTED SUCCESSFULLY".
019700 01  XXINFO.
019800     02 FILLER                       PIC X(19)  VALUE
019900            "*** INFORMATION ***".
020000     02 INFO-TEXT.
020100       04 FILLER                     PIC X(8)   VALUE SPACE.
020200       04 XXCOMPUTED                 PIC X(20).
020300       04 FILLER                     PIC X(5)   VALUE SPACE.
020400       04 XXCORRECT                  PIC X(20).
020500     02 INF-ANSI-REFERENCE           PIC X(48).
020600 01  HYPHEN-LINE.
020700     02 FILLER  PIC IS X VALUE IS SPACE.
020800     02 FILLER  PIC IS X(65)    VALUE IS "************************
020900-    "*****************************************".
021000     02 FILLER  PIC IS X(54)    VALUE IS "************************
021100-    "******************************".
021200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021300     "NC121M".
021400 PROCEDURE DIVISION.
021500 CCVS1 SECTION.
021600 OPEN-FILES.
021700     OPEN     OUTPUT PRINT-FILE.
021800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021900     MOVE    SPACE TO TEST-RESULTS.
022000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022100     GO TO CCVS1-EXIT.
022200 CLOSE-FILES.
022300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022400 TERMINATE-CCVS.
022500S    EXIT PROGRAM.
022600STERMINATE-CALL.
022700     STOP     RUN.
022800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023200     MOVE "****TEST DELETED****" TO RE-MARK.
023300 PRINT-DETAIL.
023400     IF REC-CT NOT EQUAL TO ZERO
023500             MOVE "." TO PARDOT-X
023600             MOVE REC-CT TO DOTVALUE.
023700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024200     MOVE SPACE TO CORRECT-X.
024300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024400     MOVE     SPACE TO RE-MARK.
024500 HEAD-ROUTINE.
024600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025000 COLUMN-NAMES-ROUTINE.
025100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025400 END-ROUTINE.
025500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025600 END-RTN-EXIT.
025700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025800 END-ROUTINE-1.
025900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026100      ADD PASS-COUNTER TO ERROR-HOLD.
026200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
026300      MOVE PASS-COUNTER TO CCVS-E-4-1.
026400      MOVE ERROR-HOLD TO CCVS-E-4-2.
026500      MOVE CCVS-E-4 TO CCVS-E-2-2.
026600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026700  END-ROUTINE-12.
026800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026900     IF       ERROR-COUNTER IS EQUAL TO ZERO
027000         MOVE "NO " TO ERROR-TOTAL
027100         ELSE
027200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027400     PERFORM WRITE-LINE.
027500 END-ROUTINE-13.
027600     IF DELETE-COUNTER IS EQUAL TO ZERO
027700         MOVE "NO " TO ERROR-TOTAL  ELSE
027800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028100      IF   INSPECT-COUNTER EQUAL TO ZERO
028200          MOVE "NO " TO ERROR-TOTAL
028300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028700 WRITE-LINE.
028800     ADD 1 TO RECORD-COUNT.
028900Y    IF RECORD-COUNT GREATER 42
029000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029100Y        MOVE SPACE TO DUMMY-RECORD
029200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029300Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029400Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029500Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029600Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029700Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
029800Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030100Y        MOVE ZERO TO RECORD-COUNT.
030200     PERFORM WRT-LN.
030300 WRT-LN.
030400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030500     MOVE SPACE TO DUMMY-RECORD.
030600 BLANK-LINE-PRINT.
030700     PERFORM WRT-LN.
030800 FAIL-ROUTINE.
030900     IF     COMPUTED-X NOT EQUAL TO SPACE
031000            GO TO FAIL-ROUTINE-WRITE.
031100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031500     MOVE   SPACES TO INF-ANSI-REFERENCE.
031600     GO TO  FAIL-ROUTINE-EX.
031700 FAIL-ROUTINE-WRITE.
031800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
031900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
032000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
032100     MOVE   SPACES TO COR-ANSI-REFERENCE.
032200 FAIL-ROUTINE-EX. EXIT.
032300 BAIL-OUT.
032400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032600 BAIL-OUT-WRITE.
032700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
032800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033000     MOVE   SPACES TO INF-ANSI-REFERENCE.
033100 BAIL-OUT-EX. EXIT.
033200 CCVS1-EXIT.
033300     EXIT.
033400 SECT-NC121M-001 SECTION.
033500 BUILD-TABLE1.
033600     MOVE 4.00 TO TABLE1-NUM (1).
033700     MOVE 1.34 TO TABLE1-NUM (2).
033800     MOVE 7.00 TO TABLE1-NUM (3).
033900     MOVE 3.00 TO TABLE1-NUM (4).
034000     MOVE 2.00 TO TABLE1-NUM (5).
034100     MOVE 1.50 TO TABLE1-NUM (6).
034200     MOVE 3.50 TO TABLE1-NUM (7).
034300     MOVE 0.00 TO TABLE1-NUM (8).
034400     MOVE 5.00 TO TABLE1-NUM (9).
034500     MOVE -9.00 TO TABLE1-NUM (10).
034600 BUILD-TABLE2.
034700     MOVE 1.0 TO TABLE2-NUM (1).
034800     MOVE 6.0 TO TABLE2-NUM (2).
034900     MOVE 3.0 TO TABLE2-NUM (3).
035000     MOVE 2.0 TO TABLE2-NUM (4).
035100     MOVE 9.7 TO TABLE2-NUM (5).
035200     MOVE 1.2 TO TABLE2-NUM (6).
035300 BUILD-TABLE4.
035400     MOVE 01 TO TABLE4-NUM2 (1  1).
035500     MOVE 02 TO TABLE4-NUM2 (1  2).
035600     MOVE 03 TO TABLE4-NUM2 (1  3).
035700     MOVE 12 TO TABLE4-NUM2 (2  1).
035800     MOVE 24 TO TABLE4-NUM2 (2  2).
035900     MOVE 25 TO TABLE4-NUM2 (2  3).
036000     MOVE 14 TO TABLE4-NUM2 (3  1).
036100     MOVE 15 TO TABLE4-NUM2 (3  2).
036200     MOVE 16 TO TABLE4-NUM2 (3  3).
036300 BUILD-TABLE5.
036400     MOVE 3 TO TABLE5-NUM (1).
036500     MOVE 2 TO TABLE5-NUM (2).
036600 BUILD-TABLE6.
036700     MOVE "LITERAL-01" TO TABLE6-REC (1).
036800     MOVE "0123456789" TO TABLE6-REC (2).
036900 IND-INIT-GF-1.
037000     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
037100     MOVE "MULTIPLY BY" TO FEATURE.
037200     MOVE 2.0 TO NUM-9V9.
037300     SET INDEX1 TO 1.
037400 IND-TEST-GF-1-0.
037500     MULTIPLY TABLE1-NUM (INDEX1) BY NUM-9V9.
037600 IND-TEST-GF-1-1.
037700     IF NUM-9V9 EQUAL TO 8.0
037800        PERFORM PASS
037900        ELSE GO TO IND-FAIL-GF-1.
038000     GO TO IND-WRITE-GF-1.
038100 IND-DELETE-GF-1.
038200     PERFORM DE-LETE.
038300     GO TO IND-WRITE-GF-1.
038400 IND-FAIL-GF-1.
038500     PERFORM FAIL.
038600     MOVE NUM-9V9 TO COMPUTED-14V4.
038700     MOVE 8.0 TO CORRECT-14V4.
038800 IND-WRITE-GF-1.
038900     MOVE "IND-TEST-GF-1" TO PAR-NAME.
039000     PERFORM PRINT-DETAIL.
039100 IND-INIT-GF-2.
039200     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
039300     MOVE "MULTIPLY ROUNDED" TO FEATURE.
039400     MOVE 4.0 TO NUM-9V9.
039500     SET INDEX1 TO 2.
039600 IND-TEST-GF-2-0.
039700     MULTIPLY TABLE1-NUM (INDEX1) BY NUM-9V9 ROUNDED.
039800 IND-TEST-GF-2-1.
039900     IF NUM-9V9 EQUAL TO 5.4
040000        PERFORM PASS
040100        ELSE GO TO IND-FAIL-GF-2.
040200     GO TO IND-WRITE-GF-2.
040300 IND-DELETE-GF-2.
040400     PERFORM DE-LETE.
040500     GO TO IND-WRITE-GF-2.
040600 IND-FAIL-GF-2.
040700     PERFORM FAIL.
040800     MOVE NUM-9V9 TO COMPUTED-14V4.
040900     MOVE 5.4 TO CORRECT-14V4.
041000 IND-WRITE-GF-2.
041100     MOVE "IND-TEST-GF-2" TO PAR-NAME.
041200     PERFORM PRINT-DETAIL.
041300 IND-INIT-GF-3.
041400     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
041500     MOVE "MULTIPLY ON SIZE ERR" TO FEATURE.
041600     MOVE 6.0 TO NUM-9V9.
041700     SET INDEX1 TO 3.
041800 IND-TEST-GF-3-1.
041900     MULTIPLY TABLE1-NUM (INDEX1) BY NUM-9V9 ON SIZE ERROR
042000        PERFORM PASS
042100        GO TO IND-WRITE-GF-3-1.
042200     GO TO IND-FAIL-GF-3-1.
042300 IND-DELETE-GF-3-1.
042400     PERFORM DE-LETE.
042500     GO TO IND-WRITE-GF-3-1.
042600 IND-FAIL-GF-3-1.
042700     PERFORM FAIL.
042800     MOVE NUM-9V9 TO COMPUTED-14V4.
042900     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
043000 IND-WRITE-GF-3-1.
043100     MOVE "IND-TEST-GF-3-1" TO PAR-NAME.
043200     PERFORM PRINT-DETAIL.
043300 IND-TEST-GF-3-2.
043400     IF      NUM-9V9 = 6.0
043500             PERFORM PASS
043600             GO TO   IND-WRITE-GF-3-2.
043700     GO TO   IND-FAIL-GF-3-2.
043800 IND-DELETE-GF-3-2.
043900     PERFORM DE-LETE.
044000     GO TO IND-WRITE-GF-3-2.
044100 IND-FAIL-GF-3-2.
044200     PERFORM FAIL.
044300     MOVE NUM-9V9 TO COMPUTED-14V4.
044400     MOVE 6.0 TO CORRECT-14V4.
044500     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
044600 IND-WRITE-GF-3-2.
044700     MOVE "IND-TEST-GF-3-2" TO PAR-NAME.
044800     PERFORM PRINT-DETAIL.
044900 IND-INIT-GF-4.
045000     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
045100     MOVE "MULTIPLY BY" TO FEATURE.
045200     SET INDEX1 TO 1.
045300     SET INDEX2 TO 1.
045400 IND-TEST-GF-4-0.
045500     MULTIPLY TABLE1-NUM (INDEX1) BY TABLE2-NUM (INDEX2).
045600 IND-TEST-GF-4-1.
045700     IF TABLE2-NUM (INDEX2) EQUAL TO 4.0
045800        PERFORM PASS
045900        ELSE GO TO IND-FAIL-GF-4.
046000     GO TO IND-WRITE-GF-4.
046100 IND-DELETE-GF-4.
046200     PERFORM DE-LETE.
046300     GO TO IND-WRITE-GF-4.
046400 IND-FAIL-GF-4.
046500     PERFORM FAIL.
046600     MOVE TABLE2-NUM (INDEX2) TO COMPUTED-14V4.
046700     MOVE 4.0 TO CORRECT-14V4.
046800 IND-WRITE-GF-4.
046900     MOVE "IND-TEST-GF-4" TO PAR-NAME.
047000     PERFORM PRINT-DETAIL.
047100 IND-INIT-GF-5.
047200     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
047300     MOVE "MULTIPLY ROUNDED" TO FEATURE.
047400     PERFORM BUILD-TABLE2.
047500     SET INDEX1 TO 2.
047600     SET INDEX2 TO 2.
047700 IND-TEST-GF-5-0.
047800     MULTIPLY TABLE1-NUM (INDEX1) BY TABLE2-NUM (INDEX2) ROUNDED.
047900 IND-TEST-GF-5-1.
048000     IF TABLE2-NUM (INDEX2) EQUAL TO 8.0
048100        PERFORM PASS
048200        ELSE GO TO IND-FAIL-GF-5.
048300     GO TO IND-WRITE-GF-5.
048400 IND-DELETE-GF-5.
048500     PERFORM DE-LETE.
048600     GO TO IND-WRITE-GF-5.
048700 IND-FAIL-GF-5.
048800     PERFORM FAIL.
048900     MOVE TABLE2-NUM (INDEX2) TO COMPUTED-14V4.
049000     MOVE 8.0 TO CORRECT-14V4.
049100 IND-WRITE-GF-5.
049200     MOVE "IND-TEST-GF-5" TO PAR-NAME.
049300     PERFORM PRINT-DETAIL.
049400 IND-INIT-GF-6.
049500     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
049600     MOVE "MULTIPLY ON SIZE ERR" TO FEATURE.
049700     PERFORM BUILD-TABLE2.
049800     SET INDEX1 TO 3.
049900     SET INDEX2 TO 3.
050000 IND-TEST-GF-6-1.
050100     MULTIPLY TABLE1-NUM (INDEX1) BY TABLE2-NUM (INDEX2)
050200        ON SIZE ERROR
050300        PERFORM PASS
050400        GO TO IND-WRITE-GF-6-1.
050500     GO TO IND-FAIL-GF-6-1.
050600 IND-DELETE-GF-6-1.
050700     PERFORM DE-LETE.
050800     GO TO IND-WRITE-GF-6-1.
050900 IND-FAIL-GF-6-1.
051000     PERFORM FAIL.
051100     MOVE TABLE2-NUM (INDEX2) TO COMPUTED-14V4.
051200     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
051300 IND-WRITE-GF-6-1.
051400     MOVE "IND-TEST-GF-6-1" TO PAR-NAME.
051500     PERFORM PRINT-DETAIL.
051600 IND-TEST-GF-6-2.
051700     IF      TABLE2-NUM (INDEX2) = 3.0
051800             PERFORM PASS
051900             GO TO   IND-WRITE-GF-6-2.
052000     GO TO   IND-FAIL-GF-6-2.
052100 IND-DELETE-GF-6-2.
052200     PERFORM DE-LETE.
052300     GO TO IND-WRITE-GF-6-2.
052400 IND-FAIL-GF-6-2.
052500     PERFORM FAIL.
052600     MOVE TABLE2-NUM (INDEX2) TO COMPUTED-14V4.
052700     MOVE 3.0 TO CORRECT-14V4.
052800     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
052900 IND-WRITE-GF-6-2.
053000     MOVE "IND-TEST-GF-6-2" TO PAR-NAME.
053100     PERFORM PRINT-DETAIL.
053200 IND-INIT-GF-7.
053300     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
053400     MOVE "MULTIPLY BY GIVING" TO FEATURE.
053500     PERFORM BUILD-TABLE2.
053600     MOVE ZERO TO NUM-9V9.
053700     SET INDEX1 TO 1.
053800 IND-TEST-GF-7-0.
053900     MULTIPLY 2 BY TABLE1-NUM (INDEX1) GIVING NUM-9V9.
054000 IND-TEST-GF-7-1.
054100     IF NUM-9V9 EQUAL TO 8.0
054200        PERFORM PASS
054300        ELSE GO TO IND-FAIL-GF-7.
054400     GO TO IND-WRITE-GF-7.
054500 IND-DELETE-GF-7.
054600     PERFORM DE-LETE.
054700     GO TO IND-WRITE-GF-7.
054800 IND-FAIL-GF-7.
054900     PERFORM FAIL.
055000     MOVE NUM-9V9 TO COMPUTED-14V4.
055100     MOVE 8.0 TO CORRECT-14V4.
055200 IND-WRITE-GF-7.
055300     MOVE "IND-TEST-GF-7" TO PAR-NAME.
055400     PERFORM PRINT-DETAIL.
055500 IND-INIT-GF-8.
055600     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
055700     MOVE "MULTIPLY BY GIVING" TO FEATURE.
055800     PERFORM BUILD-TABLE2.
055900     MOVE ZERO TO NUM-9V9.
056000     SET INDEX1 TO 4.
056100     SET INDEX2 TO 4.
056200 IND-TEST-GF-8-0.
056300     MULTIPLY TABLE1-NUM (INDEX1) BY TABLE2-NUM (INDEX2)
056400        GIVING NUM-9V9.
056500 IND-TEST-GF-8-1.
056600     IF NUM-9V9 EQUAL TO 6.0
056700        PERFORM PASS
056800        ELSE GO TO IND-FAIL-GF-8.
056900     GO TO IND-WRITE-GF-8.
057000 IND-DELETE-GF-8.
057100     PERFORM DE-LETE.
057200     GO TO IND-WRITE-GF-8.
057300 IND-FAIL-GF-8.
057400     PERFORM FAIL.
057500     MOVE NUM-9V9 TO COMPUTED-14V4.
057600     MOVE 6.0 TO CORRECT-14V4.
057700 IND-WRITE-GF-8.
057800     MOVE "IND-TEST-GF-8" TO PAR-NAME.
057900     PERFORM PRINT-DETAIL.
058000 IND-INIT-GF-9.
058100     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
058200     MOVE "MULTIPLY BY GIVING" TO FEATURE.
058300     PERFORM BUILD-TABLE2.
058400     MOVE ZERO TO TABLE3.
058500     SET INDEX1 TO 3.
058600     SET INDEX2 TO 2.
058700     SET INDEX3 TO 1.
058800 IND-TEST-GF-9-0.
058900     MULTIPLY TABLE1-NUM (INDEX1) BY TABLE2-NUM (INDEX2)
059000        GIVING TABLE3-NUM (INDEX3).
059100 IND-TEST-GF-9-1.
059200     IF TABLE3-NUM (INDEX3) EQUAL TO 42.0
059300        PERFORM PASS
059400        ELSE GO TO IND-FAIL-GF-9.
059500     GO TO IND-WRITE-GF-9.
059600 IND-DELETE-GF-9.
059700     PERFORM DE-LETE.
059800     GO TO IND-WRITE-GF-9.
059900 IND-FAIL-GF-9.
060000     PERFORM FAIL.
060100     MOVE TABLE3-NUM (INDEX3) TO COMPUTED-14V4.
060200     MOVE 42.0 TO CORRECT-14V4.
060300 IND-WRITE-GF-9.
060400     MOVE "IND-TEST-GF-9" TO PAR-NAME.
060500     PERFORM PRINT-DETAIL.
060600 IND-INIT-GF-10.
060700     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
060800     MOVE "MULTIPLY BY" TO FEATURE.
060900     MOVE 2.0 TO NUM-9V9.
061000     SET INDEX1 TO 3.
061100 IND-TEST-GF-10-0.
061200     MULTIPLY TABLE1-NUM (INDEX1 - 2) BY NUM-9V9.
061300 IND-TEST-GF-10-1.
061400     IF NUM-9V9 EQUAL TO 8.0
061500        PERFORM PASS
061600        ELSE GO TO IND-FAIL-GF-10.
061700     GO TO IND-WRITE-GF-10.
061800 IND-DELETE-GF-10.
061900     PERFORM DE-LETE.
062000     GO TO IND-WRITE-GF-10.
062100 IND-FAIL-GF-10.
062200     PERFORM FAIL.
062300     MOVE NUM-9V9 TO COMPUTED-14V4.
062400     MOVE 8.0 TO CORRECT-14V4.
062500 IND-WRITE-GF-10.
062600     MOVE "IND-TEST-GF-10" TO PAR-NAME.
062700     PERFORM PRINT-DETAIL.
062800 IND-INIT-GF-11.
062900     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
063000     MOVE "MULTIPLY BY" TO FEATURE.
063100     PERFORM BUILD-TABLE2.
063200     SET INDEX1 TO 2.
063300     SET INDEX2 TO 5.
063400 IND-TEST-GF-11-0.
063500     MULTIPLY TABLE1-NUM (INDEX1 - 1) BY TABLE2-NUM (INDEX2 + 1).
063600 IND-TEST-GF-11-1.
063700     IF TABLE2-NUM (INDEX2 + 1) EQUAL TO 4.8
063800        PERFORM PASS
063900        ELSE GO TO IND-FAIL-GF-11.
064000     GO TO IND-WRITE-GF-11.
064100 IND-DELETE-GF-11.
064200     PERFORM DE-LETE.
064300     GO TO IND-WRITE-GF-11.
064400 IND-FAIL-GF-11.
064500     PERFORM FAIL.
064600     MOVE TABLE2-NUM (INDEX2 + 1) TO COMPUTED-14V4.
064700     MOVE 4.8 TO CORRECT-14V4.
064800 IND-WRITE-GF-11.
064900     MOVE "IND-TEST-GF-11" TO PAR-NAME.
065000     PERFORM PRINT-DETAIL.
065100 IND-INIT-GF-12.
065200     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
065300     MOVE "MULTIPLY BY GIVING" TO FEATURE.
065400     PERFORM BUILD-TABLE2.
065500     MOVE ZERO TO NUM-9V9.
065600     SET INDEX1 TO 6.
065700     SET INDEX2 TO 3.
065800 IND-TEST-GF-12-0.
065900     MULTIPLY TABLE1-NUM (INDEX1 - 2) BY TABLE2-NUM (INDEX2 - 2)
066000        GIVING NUM-9V9.
066100 IND-TEST-GF-12-1.
066200     IF NUM-9V9 EQUAL TO 3.0
066300        PERFORM PASS
066400        ELSE GO TO IND-FAIL-GF-12.
066500     GO TO IND-WRITE-GF-12.
066600 IND-DELETE-GF-12.
066700     PERFORM DE-LETE.
066800     GO TO IND-WRITE-GF-12.
066900 IND-FAIL-GF-12.
067000     PERFORM FAIL.
067100     MOVE NUM-9V9 TO COMPUTED-14V4.
067200     MOVE 3.0 TO CORRECT-14V4.
067300 IND-WRITE-GF-12.
067400     MOVE "IND-TEST-GF-12" TO PAR-NAME.
067500     PERFORM PRINT-DETAIL.
067600 IND-INIT-GF-13.
067700     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
067800     MOVE "MULTIPLY BY GIVING" TO FEATURE.
067900     PERFORM BUILD-TABLE2.
068000     MOVE ZERO TO TABLE3.
068100     SET INDEX1 TO 1.
068200     SET INDEX2 TO 3.
068300     SET INDEX3 TO 1.
068400 IND-TEST-GF-13-0.
068500     MULTIPLY TABLE1-NUM (INDEX1 + 2) BY TABLE2-NUM (INDEX2 - 1)
068600        GIVING TABLE3-NUM (INDEX3 + 1).
068700 IND-TEST-GF-13-1.
068800     IF TABLE3-NUM (INDEX3 + 1) EQUAL TO 42.0
068900        PERFORM PASS
069000        ELSE GO TO IND-FAIL-GF-13.
069100     GO TO IND-WRITE-GF-13.
069200 IND-DELETE-GF-13.
069300     PERFORM DE-LETE.
069400     GO TO IND-WRITE-GF-13.
069500 IND-FAIL-GF-13.
069600     PERFORM FAIL.
069700     MOVE TABLE3-NUM (INDEX3 + 1) TO COMPUTED-14V4.
069800     MOVE 42.0 TO CORRECT-14V4.
069900 IND-WRITE-GF-13.
070000     MOVE "IND-TEST-GF-13" TO PAR-NAME.
070100     PERFORM PRINT-DETAIL.
070200 IND-INIT-GF-14.
070300     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
070400     MOVE "DIVIDE INTO" TO FEATURE.
070500     MOVE 9.0 TO NUM-9V9.
070600     SET INDEX1 TO 4.
070700 IND-TEST-GF-14-0.
070800     DIVIDE TABLE1-NUM (INDEX1) INTO NUM-9V9.
070900 IND-TEST-GF-14-1.
071000     IF NUM-9V9 EQUAL TO 3.0
071100        PERFORM PASS
071200        GO TO IND-WRITE-GF-14.
071300     GO TO IND-FAIL-GF-14.
071400 IND-DELETE-GF-14.
071500     PERFORM DE-LETE.
071600     GO TO IND-WRITE-GF-14.
071700 IND-FAIL-GF-14.
071800     PERFORM FAIL.
071900     MOVE NUM-9V9 TO COMPUTED-14V4.
072000     MOVE 3.0 TO CORRECT-14V4.
072100 IND-WRITE-GF-14.
072200     MOVE "IND-TEST-GF-14" TO PAR-NAME.
072300     PERFORM PRINT-DETAIL.
072400 IND-INIT-GF-15.
072500     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
072600     MOVE "DIVIDE ROUNDED" TO FEATURE.
072700     MOVE 8.1 TO NUM-9V9.
072800     SET INDEX1 TO 9.
072900 IND-TEST-GF-15-0.
073000     DIVIDE TABLE1-NUM (INDEX1) INTO NUM-9V9 ROUNDED.
073100 IND-TEST-GF-15-1.
073200     IF NUM-9V9 EQUAL TO 1.6
073300        PERFORM PASS
073400        GO TO IND-WRITE-GF-15.
073500     GO TO IND-FAIL-GF-15.
073600 IND-DELETE-GF-15.
073700     PERFORM DE-LETE.
073800     GO TO IND-WRITE-GF-15.
073900 IND-FAIL-GF-15.
074000     PERFORM FAIL.
074100     MOVE NUM-9V9 TO COMPUTED-14V4.
074200     MOVE 1.6 TO CORRECT-14V4.
074300 IND-WRITE-GF-15.
074400     MOVE "IND-TEST-GF-15" TO PAR-NAME.
074500     PERFORM PRINT-DETAIL.
074600 IND-INIT-GF-16.
074700     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
074800     MOVE "DIVIDE ON SIZE ERROR" TO FEATURE.
074900     MOVE 9.9 TO NUM-9V9.
075000     SET INDEX1 TO 8.
075100 IND-TEST-GF-16-1.
075200     DIVIDE TABLE1-NUM (INDEX1) INTO NUM-9V9 ON SIZE ERROR
075300        PERFORM PASS
075400        GO TO IND-WRITE-GF-16-1.
075500     GO TO IND-FAIL-GF-16-1.
075600 IND-DELETE-GF-16-1.
075700     PERFORM DE-LETE.
075800     GO TO IND-WRITE-GF-16-1.
075900 IND-FAIL-GF-16-1.
076000     PERFORM FAIL.
076100     MOVE NUM-9V9 TO COMPUTED-14V4.
076200     MOVE "ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
076300 IND-WRITE-GF-16-1.
076400     MOVE "IND-TEST-GF-16-1" TO PAR-NAME.
076500     PERFORM PRINT-DETAIL.
076600 IND-TEST-GF-16-2.
076700     MOVE 9.9 TO NUM-9V9.
076800     IF      NUM-9V9 = 9.9
076900             PERFORM PASS
077000             GO TO   IND-WRITE-GF-16-2.
077100     GO TO   IND-FAIL-GF-16-2.
077200 IND-DELETE-GF-16-2.
077300     PERFORM DE-LETE.
077400     GO TO IND-WRITE-GF-16-2.
077500 IND-FAIL-GF-16-2.
077600     PERFORM FAIL.
077700     MOVE NUM-9V9 TO COMPUTED-14V4.
077800     MOVE 9.9 TO CORRECT-14V4.
077900     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
078000 IND-WRITE-GF-16-2.
078100     MOVE "IND-TEST-GF-16-2" TO PAR-NAME.
078200     PERFORM PRINT-DETAIL.
078300 IND-INIT-GF-17.
078400     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
078500     MOVE "DIVIDE INTO" TO FEATURE.
078600     PERFORM BUILD-TABLE2.
078700     SET INDEX1 TO 4.
078800     SET INDEX2 TO 2.
078900 IND-TEST-GF-17-0.
079000     DIVIDE TABLE1-NUM (INDEX1) INTO TABLE2-NUM (INDEX2).
079100 IND-TEST-GF-17-1.
079200     IF TABLE2-NUM (INDEX2) EQUAL TO 2.0
079300        PERFORM PASS
079400        GO TO IND-WRITE-GF-17.
079500     GO TO IND-FAIL-GF-17.
079600 IND-DELETE-GF-17.
079700     PERFORM DE-LETE.
079800     GO TO IND-WRITE-GF-17.
079900 IND-FAIL-GF-17.
080000     PERFORM FAIL.
080100     MOVE TABLE2-NUM (INDEX2) TO COMPUTED-14V4.
080200     MOVE 2.0 TO CORRECT-14V4.
080300 IND-WRITE-GF-17.
080400     MOVE "IND-TEST-GF-17" TO PAR-NAME.
080500     PERFORM PRINT-DETAIL.
080600 IND-INIT-GF-18.
080700     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
080800     MOVE "DIVIDE ROUNDED" TO FEATURE.
080900     PERFORM BUILD-TABLE2.
081000     SET INDEX1 TO 9.
081100     SET INDEX2 TO 5.
081200 IND-TEST-GF-18-0.
081300     DIVIDE TABLE1-NUM (INDEX1) INTO TABLE2-NUM (INDEX2) ROUNDED.
081400 IND-TEST-GF-18-1.
081500     IF TABLE2-NUM (INDEX2) EQUAL TO 1.9
081600        PERFORM PASS
081700        GO TO IND-WRITE-GF-18.
081800     GO TO IND-FAIL-GF-18.
081900 IND-DELETE-GF-18.
082000     PERFORM DE-LETE.
082100     GO TO IND-WRITE-GF-18.
082200 IND-FAIL-GF-18.
082300     PERFORM FAIL.
082400     MOVE TABLE2-NUM (INDEX2) TO COMPUTED-14V4.
082500     MOVE 1.9 TO CORRECT-14V4.
082600 IND-WRITE-GF-18.
082700     MOVE "IND-TEST-GF-18" TO PAR-NAME.
082800     PERFORM PRINT-DETAIL.
082900 IND-INIT-GF-19.
083000     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
083100     MOVE "DIVIDE ON SIZE ERROR" TO FEATURE.
083200     PERFORM BUILD-TABLE2.
083300     SET INDEX1 TO 8.
083400     SET INDEX2 TO 5.
083500 IND-TEST-GF-19-1.
083600     DIVIDE TABLE1-NUM (INDEX1) INTO TABLE2-NUM (INDEX2)
083700        ON SIZE ERROR
083800        PERFORM PASS
083900        GO TO IND-WRITE-GF-19-1.
084000     GO TO IND-FAIL-GF-19-1.
084100 IND-DELETE-GF-19-1.
084200     PERFORM DE-LETE.
084300     GO TO IND-WRITE-GF-19-1.
084400 IND-FAIL-GF-19-1.
084500     PERFORM FAIL.
084600     MOVE TABLE2-NUM (INDEX2) TO COMPUTED-14V4.
084700     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
084800 IND-WRITE-GF-19-1.
084900     MOVE "IND-TEST-GF-19-1" TO PAR-NAME.
085000     PERFORM PRINT-DETAIL.
085100 IND-TEST-GF-19-2.
085200     IF      TABLE2-NUM (INDEX2) = 9.7
085300             PERFORM PASS
085400             GO TO   IND-WRITE-GF-19-2.
085500     GO TO   IND-FAIL-GF-19-2.
085600 IND-DELETE-GF-19-2.
085700     PERFORM DE-LETE.
085800     GO TO   IND-WRITE-GF-19-2.
085900 IND-FAIL-GF-19-2.
086000     PERFORM FAIL.
086100     MOVE TABLE2-NUM (INDEX2) TO COMPUTED-14V4.
086200     MOVE  9.7 TO CORRECT-14V4.
086300     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
086400 IND-WRITE-GF-19-2.
086500     MOVE "IND-TEST-GF-19-2" TO PAR-NAME.
086600     PERFORM PRINT-DETAIL.
086700 IND-INIT-GF-22.
086800     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
086900     MOVE "DIVIDE INTO GIVING" TO FEATURE.
087000     MOVE ZERO TO NUM-9V9.
087100     SET INDEX1 TO 4.
087200 IND-TEST-GF-22-0.
087300     DIVIDE 3 INTO TABLE1-NUM (INDEX1) GIVING NUM-9V9.
087400 IND-TEST-GF-22-1.
087500     IF NUM-9V9 EQUAL TO 1.0
087600        PERFORM PASS
087700        GO TO IND-WRITE-GF-22.
087800     GO TO IND-FAIL-GF-22.
087900 IND-DELETE-GF-22.
088000     PERFORM DE-LETE.
088100     GO TO IND-WRITE-GF-22.
088200 IND-FAIL-GF-22.
088300     PERFORM FAIL.
088400     MOVE NUM-9V9 TO COMPUTED-14V4.
088500     MOVE 1.0 TO CORRECT-14V4.
088600 IND-WRITE-GF-22.
088700     MOVE "IND-TEST-GF-22" TO PAR-NAME.
088800     PERFORM PRINT-DETAIL.
088900 IND-INIT-GF-23.
089000     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
089100     MOVE "DIVIDE INTO GIVING" TO FEATURE.
089200     PERFORM BUILD-TABLE2.
089300     MOVE ZERO TO NUM-9V9.
089400     SET INDEX1 TO 4.
089500     SET INDEX2 TO 2.
089600 IND-TEST-GF-23-0.
089700     DIVIDE TABLE1-NUM (INDEX1) INTO TABLE2-NUM (INDEX2)
089800        GIVING NUM-9V9.
089900 IND-TEST-GF-23-1.
090000     IF NUM-9V9 EQUAL TO 2.0
090100        PERFORM PASS
090200        GO TO IND-WRITE-GF-23.
090300     GO TO IND-FAIL-GF-23.
090400 IND-DELETE-GF-23.
090500     PERFORM DE-LETE.
090600     GO TO IND-WRITE-GF-23.
090700 IND-FAIL-GF-23.
090800     PERFORM FAIL.
090900     MOVE NUM-9V9 TO COMPUTED-14V4.
091000     MOVE 2.0 TO CORRECT-14V4.
091100 IND-WRITE-GF-23.
091200     MOVE "IND-TEST-GF-23" TO PAR-NAME.
091300     PERFORM PRINT-DETAIL.
091400 IND-INIT-GF-24.
091500     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
091600     MOVE "DIVIDE INTO GIVING" TO FEATURE.
091700     PERFORM BUILD-TABLE2.
091800     MOVE ZERO TO TABLE3.
091900     SET INDEX1 TO 4.
092000     SET INDEX2 TO 2.
092100     SET INDEX3 TO 3.
092200 IND-TEST-GF-24-0.
092300     DIVIDE TABLE1-NUM (INDEX1) INTO TABLE2-NUM (INDEX2)
092400        GIVING TABLE3-NUM (INDEX3).
092500 IND-TEST-GF-24-1.
092600     IF TABLE3-NUM (INDEX3) EQUAL TO 2.0
092700        PERFORM PASS
092800        GO TO IND-WRITE-GF-24.
092900     GO TO IND-FAIL-GF-24.
093000 IND-DELETE-GF-24.
093100     PERFORM DE-LETE.
093200     GO TO IND-WRITE-GF-24.
093300 IND-FAIL-GF-24.
093400     PERFORM FAIL.
093500     MOVE TABLE3-NUM (INDEX3) TO COMPUTED-14V4.
093600     MOVE 2.0 TO CORRECT-14V4.
093700 IND-WRITE-GF-24.
093800     MOVE "IND-TEST-GF-24" TO PAR-NAME.
093900     PERFORM PRINT-DETAIL.
094000 IND-INIT-GF-25.
094100     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
094200     MOVE "DIVIDE INTO" TO FEATURE.
094300     PERFORM BUILD-TABLE4.
094400     SET INDEX4-1 TO 3.
094500     SET INDEX4-2 TO 1.
094600 IND-TEST-GF-25-0.
094700     DIVIDE TABLE4-NUM2 (1  2) INTO
094800        TABLE4-NUM2 (INDEX4-1  INDEX4-2).
094900 IND-TEST-GF-25-1.
095000     IF TABLE4-NUM2 (INDEX4-1  INDEX4-2) EQUAL TO 7
095100        PERFORM PASS
095200        GO TO IND-WRITE-GF-25.
095300     GO TO IND-FAIL-GF-25.
095400 IND-DELETE-GF-25.
095500     PERFORM DE-LETE.
095600     GO TO IND-WRITE-GF-25.
095700 IND-FAIL-GF-25.
095800     PERFORM FAIL.
095900     MOVE TABLE4-NUM2 (INDEX4-1  INDEX4-2) TO COMPUTED-14V4.
096000     MOVE 7 TO CORRECT-14V4.
096100 IND-WRITE-GF-25.
096200     MOVE "IND-TEST-GF-25" TO PAR-NAME.
096300     PERFORM PRINT-DETAIL.
096400 IND-INIT-GF-20.
096500     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
096600     MOVE "DIVIDE INTO" TO FEATURE.
096700     MOVE 9.5 TO NUM-9V9.
096800     SET INDEX1 TO 8.
096900 IND-TEST-GF-20-0.
097000     DIVIDE TABLE1-NUM (INDEX1 + 1) INTO NUM-9V9.
097100 IND-TEST-GF-20-1.
097200     IF NUM-9V9 EQUAL TO 1.9
097300        PERFORM PASS
097400        GO TO IND-WRITE-GF-20.
097500     GO TO IND-FAIL-GF-20.
097600 IND-DELETE-GF-20.
097700     PERFORM DE-LETE.
097800     GO TO IND-WRITE-GF-20.
097900 IND-FAIL-GF-20.
098000     PERFORM FAIL.
098100     MOVE NUM-9V9 TO COMPUTED-14V4.
098200     MOVE 1.9 TO CORRECT-14V4.
098300 IND-WRITE-GF-20.
098400     MOVE "IND-TEST-GF-20" TO PAR-NAME.
098500     PERFORM PRINT-DETAIL.
098600 IND-INIT-GF-21.
098700     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
098800     MOVE "DIVIDE INTO" TO FEATURE.
098900     PERFORM BUILD-TABLE2.
099000     SET INDEX1 TO 6.
099100     SET INDEX2 TO 4.
099200 IND-TEST-GF-21-0.
099300     DIVIDE TABLE1-NUM (INDEX1 - 2) INTO
099400        TABLE2-NUM (INDEX2 + 2).
099500 IND-TEST-GF-21-1.
099600     IF TABLE2-NUM (INDEX2 + 2) EQUAL TO .4
099700        PERFORM PASS
099800        GO TO IND-WRITE-GF-21.
099900     GO TO IND-FAIL-GF-21.
100000 IND-DELETE-GF-21.
100100     PERFORM DE-LETE.
100200     GO TO IND-WRITE-GF-21.
100300 IND-FAIL-GF-21.
100400     PERFORM FAIL.
100500     MOVE TABLE2-NUM (INDEX2 + 2) TO COMPUTED-14V4.
100600     MOVE .4 TO CORRECT-14V4.
100700 IND-WRITE-GF-21.
100800     MOVE "IND-TEST-GF-21" TO PAR-NAME.
100900     PERFORM PRINT-DETAIL.
101000 IND-INIT-GF-26.
101100     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
101200     MOVE "DIVIDE INTO GIVING" TO FEATURE.
101300     PERFORM BUILD-TABLE2.
101400     MOVE ZERO TO NUM-9V9.
101500     SET INDEX1 TO 6.
101600     SET INDEX2 TO 1.
101700 IND-TEST-GF-26-0.
101800     DIVIDE TABLE1-NUM (INDEX1 - 2) INTO
101900        TABLE2-NUM (INDEX2 + 1) GIVING NUM-9V9.
102000 IND-TEST-GF-26-1.
102100     IF NUM-9V9 EQUAL TO 2.0
102200        PERFORM PASS
102300        GO TO IND-WRITE-GF-26.
102400     GO TO IND-FAIL-GF-26.
102500 IND-DELETE-GF-26.
102600     PERFORM DE-LETE.
102700     GO TO IND-WRITE-GF-26.
102800 IND-FAIL-GF-26.
102900     PERFORM FAIL.
103000     MOVE NUM-9V9 TO COMPUTED-14V4.
103100     MOVE 2.0 TO CORRECT-14V4.
103200 IND-WRITE-GF-26.
103300     MOVE "IND-TEST-GF-26" TO PAR-NAME.
103400     PERFORM PRINT-DETAIL.
103500 IND-INIT-GF-27.
103600     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
103700     MOVE "DIVIDE INTO GIVING" TO FEATURE.
103800     PERFORM BUILD-TABLE2.
103900     MOVE ZERO TO TABLE3.
104000     SET INDEX1 TO 8.
104100     SET INDEX2 TO 1.
104200     SET INDEX3 TO 4.
104300 IND-TEST-GF-27-0.
104400     DIVIDE TABLE1-NUM (INDEX1 - 2) INTO
104500        TABLE2-NUM (INDEX2 + 1) GIVING TABLE3-NUM (INDEX3 - 1).
104600 IND-TEST-GF-27-1.
104700     IF TABLE3-NUM (INDEX3 - 1) EQUAL TO 4
104800        PERFORM PASS
104900        GO TO IND-WRITE-GF-27.
105000     GO TO IND-FAIL-GF-27.
105100 IND-DELETE-GF-27.
105200     PERFORM DE-LETE.
105300     GO TO IND-WRITE-GF-27.
105400 IND-FAIL-GF-27.
105500     PERFORM FAIL.
105600     MOVE TABLE3-NUM (INDEX3 - 1) TO COMPUTED-14V4.
105700     MOVE 4.0 TO CORRECT-14V4.
105800 IND-WRITE-GF-27.
105900     MOVE "IND-TEST-GF-27" TO PAR-NAME.
106000     PERFORM PRINT-DETAIL.
106100 IND-INIT-GF-28.
106200     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
106300     MOVE "DIVIDE BY GIVING" TO FEATURE.
106400     PERFORM BUILD-TABLE4.
106500     SET INDEX4-1 TO 2.
106600     SET INDEX4-2 TO 1.
106700 IND-TEST-GF-28-0.
106800     DIVIDE TABLE4-NUM2 (INDEX4-1  INDEX4-2) BY
106900        TABLE4-NUM2 (1  3) GIVING TABLE4-NUM2 (3  3).
107000 IND-TEST-GF-28-1.
107100     IF TABLE4-NUM2 (3  3) EQUAL TO 4
107200        PERFORM PASS
107300        GO TO IND-WRITE-GF-28.
107400     GO TO IND-FAIL-GF-28.
107500 IND-DELETE-GF-28.
107600     PERFORM DE-LETE.
107700     GO TO IND-WRITE-GF-28.
107800 IND-FAIL-GF-28.
107900     PERFORM FAIL.
108000     MOVE TABLE4-NUM2 (3  3) TO COMPUTED-14V4.
108100     MOVE 4.0 TO CORRECT-14V4.
108200 IND-WRITE-GF-28.
108300     MOVE "IND-TEST-GF-28" TO PAR-NAME.
108400     PERFORM PRINT-DETAIL.
108500 IND-INIT-GF-29.
108600     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
108700     MOVE "DIVIDE BY GIVING" TO FEATURE.
108800     PERFORM BUILD-TABLE2.
108900     MOVE ZERO TO NUM-9V9.
109000     SET INDEX2 TO 2.
109100 IND-TEST-GF-29-0.
109200     DIVIDE TABLE2-NUM (INDEX2) BY TABLE2-NUM (INDEX2 + 1)
109300        GIVING NUM-9V9.
109400 IND-TEST-GF-29-1.
109500     IF NUM-9V9 EQUAL TO 2.0
109600        PERFORM PASS
109700        GO TO IND-WRITE-GF-29.
109800     GO TO IND-FAIL-GF-29.
109900 IND-DELETE-GF-29.
110000     PERFORM DE-LETE.
110100     GO TO IND-WRITE-GF-29.
110200 IND-FAIL-GF-29.
110300     PERFORM FAIL.
110400     MOVE NUM-9V9 TO COMPUTED-14V4.
110500     MOVE 2.0 TO CORRECT-14V4.
110600 IND-WRITE-GF-29.
110700     MOVE "IND-TEST-GF-29" TO PAR-NAME.
110800     PERFORM PRINT-DETAIL.
110900 IND-INIT-GF-30.
111000     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
111100     MOVE "DIVIDE BY GIVING" TO FEATURE.
111200     PERFORM BUILD-TABLE2.
111300     SET INDEX2 TO 6.
111400 IND-TEST-GF-30-0.
111500     DIVIDE TABLE2-NUM (INDEX2) BY TABLE2-NUM (INDEX2 - 3)
111600        GIVING TABLE2-NUM (INDEX2 - 1).
111700 IND-TEST-GF-30-1.
111800     IF TABLE2-NUM (INDEX2 - 1) EQUAL TO 0.4
111900        PERFORM PASS
112000        GO TO IND-WRITE-GF-30.
112100     GO TO IND-FAIL-GF-30.
112200 IND-DELETE-GF-30.
112300     PERFORM DE-LETE.
112400     GO TO IND-WRITE-GF-30.
112500 IND-FAIL-GF-30.
112600     PERFORM FAIL.
112700     MOVE TABLE2-NUM (INDEX2 - 1) TO COMPUTED-14V4.
112800     MOVE 0.4 TO CORRECT-14V4.
112900 IND-WRITE-GF-30.
113000     MOVE "IND-TEST-GF-30" TO PAR-NAME.
113100     PERFORM PRINT-DETAIL.
113200 IND-INIT-GF-31.
113300     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
113400     MOVE "DIVIDE BY GIVING" TO FEATURE.
113500     MOVE ZERO TO NUM-9V9.
113600     SET INDEX1 TO 1.
113700 IND-TEST-GF-31-0.
113800     DIVIDE 8 BY TABLE1-NUM (INDEX1) GIVING NUM-9V9.
113900 IND-TEST-GF-31-1.
114000     IF NUM-9V9 EQUAL TO 2.0
114100        PERFORM PASS
114200        GO TO IND-WRITE-GF-31.
114300     GO TO IND-FAIL-GF-31.
114400 IND-DELETE-GF-31.
114500     PERFORM DE-LETE.
114600     GO TO IND-WRITE-GF-31.
114700 IND-FAIL-GF-31.
114800     PERFORM FAIL.
114900     MOVE NUM-9V9 TO COMPUTED-14V4.
115000     MOVE 2.0 TO CORRECT-14V4.
115100 IND-WRITE-GF-31.
115200     MOVE "IND-TEST-GF-31" TO PAR-NAME.
115300     PERFORM PRINT-DETAIL.
115400 IND-INIT-GF-32.
115500     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
115600     MOVE "DIVIDE BY GIVING" TO FEATURE.
115700     MOVE ZERO TO NUM-9V9.
115800     PERFORM BUILD-TABLE2.
115900     SET INDEX1 TO 3.
116000     SET INDEX2 TO 4.
116100 IND-TEST-GF-32-0.
116200     DIVIDE TABLE1-NUM (INDEX1) BY TABLE2-NUM (INDEX2)
116300        GIVING NUM-9V9.
116400 IND-TEST-GF-32-1.
116500     IF NUM-9V9 EQUAL TO 3.5
116600        PERFORM PASS
116700        GO TO IND-WRITE-GF-32.
116800     GO TO IND-FAIL-GF-32.
116900 IND-DELETE-GF-32.
117000     PERFORM DE-LETE.
117100     GO TO IND-WRITE-GF-32.
117200 IND-FAIL-GF-32.
117300     PERFORM FAIL.
117400     MOVE NUM-9V9 TO COMPUTED-14V4.
117500     MOVE 3.5 TO CORRECT-14V4.
117600 IND-WRITE-GF-32.
117700     MOVE "IND-TEST-GF-32" TO PAR-NAME.
117800     PERFORM PRINT-DETAIL.
117900 IND-INIT-GF-33.
118000     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
118100     MOVE "DIVIDE BY GIVING" TO FEATURE.
118200     MOVE ZERO TO TABLE3.
118300     PERFORM BUILD-TABLE2.
118400     SET INDEX1 TO 4.
118500     SET INDEX2 TO 3.
118600     SET INDEX3 TO 2.
118700 IND-TEST-GF-33-0.
118800     DIVIDE TABLE1-NUM (INDEX1) BY TABLE2-NUM (INDEX2)
118900        GIVING TABLE3-NUM (INDEX3).
119000 IND-TEST-GF-33-1.
119100     IF TABLE3-NUM (INDEX3) EQUAL TO 1.0
119200        PERFORM PASS
119300        GO TO IND-WRITE-GF-33.
119400     GO TO IND-FAIL-GF-33.
119500 IND-DELETE-GF-33.
119600     PERFORM DE-LETE.
119700     GO TO IND-WRITE-GF-33.
119800 IND-FAIL-GF-33.
119900     PERFORM FAIL.
120000     MOVE TABLE3-NUM (INDEX3) TO COMPUTED-14V4.
120100     MOVE 1.0 TO CORRECT-14V4.
120200 IND-WRITE-GF-33.
120300     MOVE "IND-TEST-GF-33" TO PAR-NAME.
120400     PERFORM PRINT-DETAIL.
120500 IND-INIT-GF-34.
120600     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
120700     MOVE "PERFORM" TO FEATURE.
120800     MOVE ZERO TO NUM-9V9.
120900     SET INDEX5 TO 1.
121000 IND-TEST-GF-34-0.
121100     PERFORM PARAGRAPH-A TABLE5-NUM (INDEX5) TIMES.
121200 IND-TEST-GF-34-1.
121300     IF NUM-9V9 EQUAL TO 3
121400        PERFORM PASS
121500        ELSE GO TO IND-FAIL-GF-34.
121600     GO TO IND-WRITE-GF-34.
121700 IND-DELETE-GF-34.
121800     PERFORM DE-LETE.
121900     GO TO IND-WRITE-GF-34.
122000 IND-FAIL-GF-34.
122100     PERFORM FAIL.
122200     MOVE NUM-9V9 TO COMPUTED-18V0.
122300     MOVE 3 TO CORRECT-18V0.
122400 IND-WRITE-GF-34.
122500     MOVE "IND-TEST-GF-34" TO PAR-NAME.
122600     PERFORM PRINT-DETAIL.
122700 IND-INIT-GF-35.
122800     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
122900     MOVE "PERFORM THRU" TO FEATURE.
123000     MOVE ZERO TO NUM-9V9.
123100     SET INDEX5 TO 2.
123200 IND-TEST-GF-35-0.
123300     PERFORM PARAGRAPH-A THRU PARAGRAPH-B
123400        TABLE5-NUM (INDEX5) TIMES.
123500 IND-TEST-GF-35-1.
123600     IF NUM-9V9 EQUAL TO 4
123700        PERFORM PASS
123800        ELSE GO TO IND-FAIL-GF-35.
123900     GO TO IND-WRITE-GF-35.
124000 IND-DELETE-GF-35.
124100     PERFORM DE-LETE.
124200     GO TO IND-WRITE-GF-35.
124300 IND-FAIL-GF-35.
124400     PERFORM FAIL.
124500     MOVE NUM-9V9 TO COMPUTED-18V0.
124600     MOVE 4 TO CORRECT-18V0.
124700 IND-WRITE-GF-35.
124800     MOVE "IND-TEST-GF-35" TO PAR-NAME.
124900     PERFORM PRINT-DETAIL.
125000 IND-INIT-GF-36.
125100     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
125200     MOVE "DISPLAY" TO FEATURE.
125300     MOVE "RESULTS MUST BE" TO RE-MARK.
125400     MOVE "LITERAL-01" TO CORRECT-A.
125500     SET INDEX6 TO 1.
125600 IND-TEST-GF-36.
125700     DISPLAY "  ".
125800     DISPLAY TABLE6-REC (INDEX6).
125900     PERFORM INSPT.
126000     GO TO IND-WRITE-GF-36.
126100 IND-DELETE-GF-36.
126200     PERFORM DE-LETE.
126300 IND-WRITE-GF-36.
126400     MOVE "IND-TEST-GF-36" TO PAR-NAME.
126500     PERFORM PRINT-DETAIL.
126600 IND-INIT-GF-37.
126700     MOVE  "IV-21 4.3.8.2.3/4" TO ANSI-REFERENCE.
126800     MOVE "DISPLAY" TO FEATURE.
126900     MOVE "VISUALLY CHECKED" TO RE-MARK.
127000     MOVE "0123456789" TO CORRECT-A.
127100     SET INDEX6 TO 1.
127200 IND-TEST-GF-37.
127300     DISPLAY TABLE6-REC (INDEX6 + 1).
127400     PERFORM INSPT.
127500     GO TO IND-WRITE-GF-37.
127600 IND-DELETE-GF-37.
127700     PERFORM DE-LETE.
127800 IND-WRITE-GF-37.
127900     MOVE "IND-TEST-GF-37" TO PAR-NAME.
128000     PERFORM PRINT-DETAIL.
128100     GO TO CCVS-999999.
128200 PARAGRAPH-A.
128300     ADD 1 TO NUM-9V9.
128400 PARAGRAPH-B.
128500     ADD 1 TO NUM-9V9.
128600 CCVS-EXIT SECTION.
128700 CCVS-999999.
128800     GO TO CLOSE-FILES.
