000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300
000400     NC124A.
000500****************************************************************
000600*                                                              *
000700*    VALIDATION FOR:-                                          *
000800*                                                              *
000900*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
001000*                                                              *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-82  - SOURCE COMPUTER NAME.                         *
001900*        X-83  - OBJECT COMPUTER NAME.                         *
002000*                                                              *
002100****************************************************************
002200*
002300*               PROGRAM NC124A TESTS THE USE OF
002400*            PICTURE CHARACTERS P, S, +, -, Z AND *.
002500*
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 01  WORK-AREA-1                 PICTURE 9       VALUE 0.
004300 01  WORK-AREA-2                 PICTURE 99      VALUE 12.
004400 01  WORK-AREA-3                 PICTURE S99     VALUE -12.
004500 01  WORK-AREA-4                 PICTURE S999    VALUE 123.
004600 01  WORK-AREA-5                 PICTURE S999    VALUE -123.
004700 01  WORK-AREA-6                 PICTURE 9999    VALUE 1234.
004800 01  WORK-AREA-7                 PICTURE S9999   VALUE -1234.
004900 01  WORK-AREA-8                 PICTURE S99V99  VALUE 12.34.
005000 01  WORK-AREA-9                 PICTURE S99V99  VALUE -12.34.
005100 01  WORK-AREA-10                PICTURE 9       VALUE 0.
005200 01  WORK-AREA-11                PICTURE V99     VALUE .02.
005300 01  WORK-AREA-12                PICTURE 99      VALUE 12.
005400 01  WORK-AREA-13                PICTURE 99V99   VALUE 12.34.
005500 01  WORK-AREA-14                PICTURE 9999    VALUE 1234.
005600 01  WORK-AREA-15                PICTURE 9999V99 VALUE 1234.56.
005700 01  WORK-AREA-16                PICTURE 9       VALUE 0.
005800 01  WORK-AREA-17                PICTURE 99      VALUE 13.
005900 01  WORK-AREA-18                PICTURE 999     VALUE 123.
006000 01  WORK-AREA-19                PICTURE 9999    VALUE 2010.
006100 01  WORK-AREA-20                PICTURE 9999V9  VALUE 1010.2.
006200 01  WORK-AREA-21                PICTURE V99     VALUE .01.
006300 01  WORK-AREA-22                PICTURE 9       VALUE 0.
006400 01  WORK-AREA-23                PICTURE 9V99    VALUE 1.01.
006500 01  WORK-AREA-24                PICTURE 999V    VALUE 217.
006600 01  WORK-AREA-25                PICTURE 9999V99 VALUE 1010.20.
006700 01  WORK-AREA-26                PICTURE V99     VALUE .01.
006800 01  WORK-AREA-27                PICTURE S9PP    VALUE 200.
006900 01  WORK-AREA-27A               PICTURE X(3)    VALUE SPACE.
007000 01  WORK-AREA-28                PICTURE 999     VALUE 567.
007100 01  WORK-AREA-28A               PICTURE S9PP    VALUE ZERO.
007200 01  WORK-AREA-29                PICTURE 999     VALUE 123.
007300 01  WORK-AREA-29A               PICTURE 9PP     VALUE ZERO.
007400 01  WORK-AREA-29B               PICTURE X(3)    VALUE SPACE.
007500 01  WORK-AREA-30                PICTURE 999PP   VALUE 00900.
007600 01  WORK-AREA-30A               PICTURE ZZZPP   VALUE ZERO.
007700 01  WORK-AREA-31                PICTURE 999PP   VALUE 01200.
007800 01  WORK-AREA-31A               PICTURE ZZZPP   VALUE ZERO.
007900 01  WORK-AREA-31B               PICTURE X(5)    VALUE SPACE.
008000 01  WORK-AREA-32                PICTURE PP9     VALUE .001.
008100 01  WORK-AREA-32A               PICTURE V999    VALUE ZERO.
008200 01  WORK-AREA-33                PICTURE V999    VALUE .567.
008300 01  WORK-AREA-33A               PICTURE PP9     VALUE ZERO.
008400 01  WORK-AREA-34                PICTURE V999    VALUE .123.
008500 01  WORK-AREA-34A               PICTURE PP9     VALUE ZERO.
008600 01  WORK-AREA-34B               PICTURE V999    VALUE ZERO.
008700 01  EDIT-AREA-1                 PICTURE +9999.
008800 01  EDIT-AREA-2                 PICTURE -9999.
008900 01  EDIT-AREA-3                 PICTURE ++++9.
009000 01  EDIT-AREA-4                 PICTURE ----9.
009100 01  EDIT-AREA-5                 PICTURE +++++.
009200 01  EDIT-AREA-6                 PICTURE -----.
009300 01  EDIT-AREA-7                 PICTURE +++++.++.
009400 01  EDIT-AREA-8                 PICTURE --,---.--.
009500 01  EDIT-AREA-9                 PICTURE $$99.
009600 01  EDIT-AREA-10                PICTURE $$$$9.
009700 01  EDIT-AREA-11                PICTURE $$$$$.99.
009800 01  EDIT-AREA-12                PICTURE $$,$$$.$$.
009900 01  EDIT-AREA-13                PICTURE *999.
010000 01  EDIT-AREA-14                PICTURE **99.
010100 01  EDIT-AREA-15                PICTURE ***9.
010200 01  EDIT-AREA-16                PICTURE **.**.
010300 01  EDIT-AREA-17                PICTURE *,***.**.
010400 01  EDIT-AREA-18                PICTURE 9999.
010500 01  EDIT-AREA-19                PICTURE Z999.
010600 01  EDIT-AREA-20                PICTURE ZZ99.
010700 01  EDIT-AREA-21                PICTURE ZZZ9.
010800 01  EDIT-AREA-22                PICTURE ZZZZ.
010900 01  EDIT-AREA-23                PICTURE ZZ.ZZ.
011000 01  EDIT-AREA-24                PICTURE Z,ZZZ.
011100 01  TEST-RESULTS.
011200     02 FILLER                   PIC X      VALUE SPACE.
011300     02 FEATURE                  PIC X(20)  VALUE SPACE.
011400     02 FILLER                   PIC X      VALUE SPACE.
011500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
011600     02 FILLER                   PIC X      VALUE SPACE.
011700     02  PAR-NAME.
011800       03 FILLER                 PIC X(19)  VALUE SPACE.
011900       03  PARDOT-X              PIC X      VALUE SPACE.
012000       03 DOTVALUE               PIC 99     VALUE ZERO.
012100     02 FILLER                   PIC X(8)   VALUE SPACE.
012200     02 RE-MARK                  PIC X(61).
012300 01  TEST-COMPUTED.
012400     02 FILLER                   PIC X(30)  VALUE SPACE.
012500     02 FILLER                   PIC X(17)  VALUE
012600            "       COMPUTED=".
012700     02 COMPUTED-X.
012800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
012900     03 COMPUTED-N               REDEFINES COMPUTED-A
013000                                 PIC -9(9).9(9).
013100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
013200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
013300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
013400     03       CM-18V0 REDEFINES COMPUTED-A.
013500         04 COMPUTED-18V0                    PIC -9(18).
013600         04 FILLER                           PIC X.
013700     03 FILLER PIC X(50) VALUE SPACE.
013800 01  TEST-CORRECT.
013900     02 FILLER PIC X(30) VALUE SPACE.
014000     02 FILLER PIC X(17) VALUE "       CORRECT =".
014100     02 CORRECT-X.
014200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
014300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
014400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
014500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
014600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
014700     03      CR-18V0 REDEFINES CORRECT-A.
014800         04 CORRECT-18V0                     PIC -9(18).
014900         04 FILLER                           PIC X.
015000     03 FILLER PIC X(2) VALUE SPACE.
015100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
015200 01  CCVS-C-1.
015300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
015400-    "SS  PARAGRAPH-NAME
015500-    "       REMARKS".
015600     02 FILLER                     PIC X(20)    VALUE SPACE.
015700 01  CCVS-C-2.
015800     02 FILLER                     PIC X        VALUE SPACE.
015900     02 FILLER                     PIC X(6)     VALUE "TESTED".
016000     02 FILLER                     PIC X(15)    VALUE SPACE.
016100     02 FILLER                     PIC X(4)     VALUE "FAIL".
016200     02 FILLER                     PIC X(94)    VALUE SPACE.
016300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
016400 01  REC-CT                        PIC 99       VALUE ZERO.
016500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
016600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
016700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
016800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
016900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
017000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
017100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
017200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
017300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
017400 01  CCVS-H-1.
017500     02  FILLER                    PIC X(39)    VALUE SPACES.
017600     02  FILLER                    PIC X(42)    VALUE
017700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
017800     02  FILLER                    PIC X(39)    VALUE SPACES.
017900 01  CCVS-H-2A.
018000   02  FILLER                        PIC X(40)  VALUE SPACE.
018100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
018200   02  FILLER                        PIC XXXX   VALUE
018300     "4.2 ".
018400   02  FILLER                        PIC X(28)  VALUE
018500            " COPY - NOT FOR DISTRIBUTION".
018600   02  FILLER                        PIC X(41)  VALUE SPACE.
018700
018800 01  CCVS-H-2B.
018900   02  FILLER                        PIC X(15)  VALUE
019000            "TEST RESULT OF ".
019100   02  TEST-ID                       PIC X(9).
019200   02  FILLER                        PIC X(4)   VALUE
019300            " IN ".
019400   02  FILLER                        PIC X(12)  VALUE
019500     " HIGH       ".
019600   02  FILLER                        PIC X(22)  VALUE
019700            " LEVEL VALIDATION FOR ".
019800   02  FILLER                        PIC X(58)  VALUE
019900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020000 01  CCVS-H-3.
020100     02  FILLER                      PIC X(34)  VALUE
020200            " FOR OFFICIAL USE ONLY    ".
020300     02  FILLER                      PIC X(58)  VALUE
020400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
020500     02  FILLER                      PIC X(28)  VALUE
020600            "  COPYRIGHT   1985 ".
020700 01  CCVS-E-1.
020800     02 FILLER                       PIC X(52)  VALUE SPACE.
020900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
021000     02 ID-AGAIN                     PIC X(9).
021100     02 FILLER                       PIC X(45)  VALUE SPACES.
021200 01  CCVS-E-2.
021300     02  FILLER                      PIC X(31)  VALUE SPACE.
021400     02  FILLER                      PIC X(21)  VALUE SPACE.
021500     02 CCVS-E-2-2.
021600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
021700         03 FILLER                   PIC X      VALUE SPACE.
021800         03 ENDER-DESC               PIC X(44)  VALUE
021900            "ERRORS ENCOUNTERED".
022000 01  CCVS-E-3.
022100     02  FILLER                      PIC X(22)  VALUE
022200            " FOR OFFICIAL USE ONLY".
022300     02  FILLER                      PIC X(12)  VALUE SPACE.
022400     02  FILLER                      PIC X(58)  VALUE
022500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
022600     02  FILLER                      PIC X(13)  VALUE SPACE.
022700     02 FILLER                       PIC X(15)  VALUE
022800             " COPYRIGHT 1985".
022900 01  CCVS-E-4.
023000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
023100     02 FILLER                       PIC X(4)   VALUE " OF ".
023200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
023300     02 FILLER                       PIC X(40)  VALUE
023400      "  TESTS WERE EXECUTED SUCCESSFULLY".
023500 01  XXINFO.
023600     02 FILLER                       PIC X(19)  VALUE
023700            "*** INFORMATION ***".
023800     02 INFO-TEXT.
023900       04 FILLER                     PIC X(8)   VALUE SPACE.
024000       04 XXCOMPUTED                 PIC X(20).
024100       04 FILLER                     PIC X(5)   VALUE SPACE.
024200       04 XXCORRECT                  PIC X(20).
024300     02 INF-ANSI-REFERENCE           PIC X(48).
024400 01  HYPHEN-LINE.
024500     02 FILLER  PIC IS X VALUE IS SPACE.
024600     02 FILLER  PIC IS X(65)    VALUE IS "************************
024700-    "*****************************************".
024800     02 FILLER  PIC IS X(54)    VALUE IS "************************
024900-    "******************************".
025000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
025100     "NC124A".
025200 PROCEDURE DIVISION.
025300 CCVS1 SECTION.
025400 OPEN-FILES.
025500     OPEN     OUTPUT PRINT-FILE.
025600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
025700     MOVE    SPACE TO TEST-RESULTS.
025800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
025900     GO TO CCVS1-EXIT.
026000 CLOSE-FILES.
026100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
026200 TERMINATE-CCVS.
026300S    EXIT PROGRAM.
026400STERMINATE-CALL.
026500     STOP     RUN.
026600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
026700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
026800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
026900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
027000     MOVE "****TEST DELETED****" TO RE-MARK.
027100 PRINT-DETAIL.
027200     IF REC-CT NOT EQUAL TO ZERO
027300             MOVE "." TO PARDOT-X
027400             MOVE REC-CT TO DOTVALUE.
027500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
027600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
027700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
027800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
027900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
028000     MOVE SPACE TO CORRECT-X.
028100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
028200     MOVE     SPACE TO RE-MARK.
028300 HEAD-ROUTINE.
028400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
028700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
028800 COLUMN-NAMES-ROUTINE.
028900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
029200 END-ROUTINE.
029300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
029400 END-RTN-EXIT.
029500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029600 END-ROUTINE-1.
029700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
029800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
029900      ADD PASS-COUNTER TO ERROR-HOLD.
030000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
030100      MOVE PASS-COUNTER TO CCVS-E-4-1.
030200      MOVE ERROR-HOLD TO CCVS-E-4-2.
030300      MOVE CCVS-E-4 TO CCVS-E-2-2.
030400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
030500  END-ROUTINE-12.
030600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
030700     IF       ERROR-COUNTER IS EQUAL TO ZERO
030800         MOVE "NO " TO ERROR-TOTAL
030900         ELSE
031000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
031100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
031200     PERFORM WRITE-LINE.
031300 END-ROUTINE-13.
031400     IF DELETE-COUNTER IS EQUAL TO ZERO
031500         MOVE "NO " TO ERROR-TOTAL  ELSE
031600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
031700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
031800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031900      IF   INSPECT-COUNTER EQUAL TO ZERO
032000          MOVE "NO " TO ERROR-TOTAL
032100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
032200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
032300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032500 WRITE-LINE.
032600     ADD 1 TO RECORD-COUNT.
032700Y    IF RECORD-COUNT GREATER 42
032800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
032900Y        MOVE SPACE TO DUMMY-RECORD
033000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
033100Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
033200Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
033300Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
033400Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
033500Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
033600Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
033700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
033800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
033900Y        MOVE ZERO TO RECORD-COUNT.
034000     PERFORM WRT-LN.
034100 WRT-LN.
034200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
034300     MOVE SPACE TO DUMMY-RECORD.
034400 BLANK-LINE-PRINT.
034500     PERFORM WRT-LN.
034600 FAIL-ROUTINE.
034700     IF     COMPUTED-X NOT EQUAL TO SPACE
034800            GO TO FAIL-ROUTINE-WRITE.
034900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
035000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
035100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
035200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035300     MOVE   SPACES TO INF-ANSI-REFERENCE.
035400     GO TO  FAIL-ROUTINE-EX.
035500 FAIL-ROUTINE-WRITE.
035600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
035700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
035800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
035900     MOVE   SPACES TO COR-ANSI-REFERENCE.
036000 FAIL-ROUTINE-EX. EXIT.
036100 BAIL-OUT.
036200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
036300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
036400 BAIL-OUT-WRITE.
036500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
036600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
036700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036800     MOVE   SPACES TO INF-ANSI-REFERENCE.
036900 BAIL-OUT-EX. EXIT.
037000 CCVS1-EXIT.
037100     EXIT.
037200 PICTURE-INIT-1.
037300     MOVE "VI-31"           TO ANSI-REFERENCE.
037400     MOVE "PICTRE-TST-1"    TO PAR-NAME.
037500     MOVE "PICTURE + AND -" TO FEATURE.
037600     MOVE  0                TO WORK-AREA-1.
037700     MOVE 1 TO REC-CT.
037800 PICTURE-TEST-1.
037900     MOVE WORK-AREA-1 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
038000                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
038100                         EDIT-AREA-7  EDIT-AREA-8.
038200     GO TO PICTURE-TEST-1-A.
038300 PICTURE-DELETE-1.
038400     PERFORM DE-LETE.
038500     PERFORM PRINT-DETAIL.
038600     GO TO PICTURE-INIT-2.
038700 PICTURE-TEST-1-A.
038800     IF EDIT-AREA-1 EQUAL TO "+0000"
038900        PERFORM PASS
039000        PERFORM PRINT-DETAIL
039100        ELSE PERFORM FAIL
039200        MOVE EDIT-AREA-1 TO COMPUTED-A
039300        MOVE "+0000" TO CORRECT-A
039400        PERFORM PRINT-DETAIL.
039500     ADD 1 TO REC-CT.
039600 PICTURE-TEST-1-B.
039700     IF EDIT-AREA-2 EQUAL TO " 0000"
039800        PERFORM PASS
039900        PERFORM PRINT-DETAIL
040000        ELSE PERFORM FAIL
040100        MOVE EDIT-AREA-2 TO COMPUTED-A
040200        MOVE " 0000" TO CORRECT-A
040300        PERFORM PRINT-DETAIL.
040400     ADD 1 TO REC-CT.
040500 PICTURE-TEST-1-C.
040600     IF EDIT-AREA-3 EQUAL TO "   +0"
040700        PERFORM PASS
040800        PERFORM PRINT-DETAIL
040900        ELSE PERFORM FAIL
041000        MOVE EDIT-AREA-3 TO COMPUTED-A
041100        MOVE "   +0" TO CORRECT-A
041200        PERFORM PRINT-DETAIL.
041300     ADD 1 TO REC-CT.
041400 PICTURE-TEST-1-D.
041500     IF EDIT-AREA-4 EQUAL TO "    0"
041600        PERFORM PASS
041700        PERFORM PRINT-DETAIL
041800        ELSE PERFORM FAIL
041900        MOVE EDIT-AREA-4 TO COMPUTED-A
042000        MOVE "    0" TO CORRECT-A
042100        PERFORM PRINT-DETAIL.
042200     ADD 1 TO REC-CT.
042300 PICTURE-TEST-1-E.
042400     IF EDIT-AREA-5 EQUAL TO "     "
042500        PERFORM PASS
042600        PERFORM PRINT-DETAIL
042700        ELSE PERFORM FAIL
042800        MOVE EDIT-AREA-5 TO COMPUTED-A
042900        MOVE "SPACES" TO CORRECT-A
043000        PERFORM PRINT-DETAIL.
043100     ADD 1 TO REC-CT.
043200 PICTURE-TEST-1-F.
043300     IF EDIT-AREA-6 EQUAL TO "      "
043400        PERFORM PASS
043500        PERFORM PRINT-DETAIL
043600        ELSE PERFORM FAIL
043700        MOVE EDIT-AREA-6 TO COMPUTED-A
043800        MOVE "SPACES" TO CORRECT-A
043900        PERFORM PRINT-DETAIL.
044000     ADD 1 TO REC-CT.
044100 PICTURE-TEST-1-G.
044200     IF EDIT-AREA-7 EQUAL TO "        "
044300        PERFORM PASS
044400        PERFORM PRINT-DETAIL
044500        ELSE PERFORM FAIL
044600        MOVE EDIT-AREA-7 TO COMPUTED-A
044700        MOVE "SPACES" TO CORRECT-A
044800        PERFORM PRINT-DETAIL.
044900     ADD 1 TO REC-CT.
045000 PICTURE-TEST-1-H.
045100     IF EDIT-AREA-8 EQUAL TO "         "
045200        PERFORM PASS
045300        PERFORM PRINT-DETAIL
045400        ELSE PERFORM FAIL
045500        MOVE EDIT-AREA-8 TO COMPUTED-A
045600        MOVE "SPACES" TO CORRECT-A
045700        PERFORM PRINT-DETAIL.
045800 PICTURE-INIT-2.
045900     MOVE "VI-31"           TO ANSI-REFERENCE.
046000     MOVE "PICTRE-TST-2" TO PAR-NAME.
046100     MOVE "PICTURE + AND -" TO FEATURE.
046200     MOVE  12               TO WORK-AREA-2.
046300     MOVE 1 TO REC-CT.
046400 PICTURE-TEST-2.
046500     MOVE WORK-AREA-2 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
046600                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
046700                         EDIT-AREA-7  EDIT-AREA-8.
046800     GO TO PICTURE-TEST-2-A.
046900 PICTURE-DELETE-2.
047000     PERFORM DE-LETE.
047100     PERFORM PRINT-DETAIL.
047200     GO TO PICTURE-INIT-3.
047300 PICTURE-TEST-2-A.
047400     IF EDIT-AREA-1 EQUAL TO "+0012"
047500        PERFORM PASS
047600        PERFORM PRINT-DETAIL
047700        ELSE PERFORM FAIL
047800        MOVE EDIT-AREA-1 TO COMPUTED-A
047900        MOVE "+0012" TO CORRECT-A
048000        PERFORM PRINT-DETAIL.
048100     ADD 1 TO REC-CT.
048200 PICTURE-TEST-2-B.
048300     IF EDIT-AREA-2 EQUAL TO " 0012"
048400        PERFORM PASS
048500        PERFORM PRINT-DETAIL
048600        ELSE PERFORM FAIL
048700        MOVE EDIT-AREA-2 TO COMPUTED-A
048800        MOVE " 0012" TO CORRECT-A
048900        PERFORM PRINT-DETAIL.
049000     ADD 1 TO REC-CT.
049100 PICTURE-TEST-2-C.
049200     IF EDIT-AREA-3 EQUAL TO "  +12"
049300        PERFORM PASS
049400        PERFORM PRINT-DETAIL
049500        ELSE PERFORM FAIL
049600        MOVE EDIT-AREA-3 TO COMPUTED-A
049700        MOVE "  +12" TO CORRECT-A
049800        PERFORM PRINT-DETAIL.
049900     ADD 1 TO REC-CT.
050000 PICTURE-TEST-2-D.
050100     IF EDIT-AREA-4 EQUAL TO "   12"
050200        PERFORM PASS
050300        PERFORM PRINT-DETAIL
050400        ELSE PERFORM FAIL
050500        MOVE EDIT-AREA-4 TO COMPUTED-A
050600        MOVE "   12" TO CORRECT-A
050700        PERFORM PRINT-DETAIL.
050800     ADD 1 TO REC-CT.
050900 PICTURE-TEST-2-E.
051000     IF EDIT-AREA-5 EQUAL TO "  +12"
051100        PERFORM PASS
051200        PERFORM PRINT-DETAIL
051300        ELSE PERFORM FAIL
051400        MOVE EDIT-AREA-5 TO COMPUTED-A
051500        MOVE "  +12" TO CORRECT-A
051600        PERFORM PRINT-DETAIL.
051700     ADD 1 TO REC-CT.
051800 PICTURE-TEST-2-F.
051900     IF EDIT-AREA-6 EQUAL TO "   12"
052000        PERFORM PASS
052100        PERFORM PRINT-DETAIL
052200        ELSE PERFORM FAIL
052300        MOVE EDIT-AREA-6 TO COMPUTED-A
052400        MOVE "   12" TO CORRECT-A
052500        PERFORM PRINT-DETAIL.
052600     ADD 1 TO REC-CT.
052700 PICTURE-TEST-2-G.
052800     IF EDIT-AREA-7 EQUAL TO "  +12.00"
052900        PERFORM PASS
053000        PERFORM PRINT-DETAIL
053100        ELSE PERFORM FAIL
053200        MOVE EDIT-AREA-7 TO COMPUTED-A
053300        MOVE "  +12.00" TO CORRECT-A
053400        PERFORM PRINT-DETAIL.
053500     ADD 1 TO REC-CT.
053600 PICTURE-TEST-2-H.
053700     IF EDIT-AREA-8 EQUAL TO "    12.00"
053800        PERFORM PASS
053900        PERFORM PRINT-DETAIL
054000        ELSE PERFORM FAIL
054100        MOVE EDIT-AREA-8 TO COMPUTED-A
054200        MOVE "    12.00" TO CORRECT-A
054300        PERFORM PRINT-DETAIL.
054400 PICTURE-INIT-3.
054500     MOVE "VI-31"           TO ANSI-REFERENCE.
054600     MOVE "PICTRE-TST-3" TO PAR-NAME.
054700     MOVE "PICTURE + AND -" TO FEATURE.
054800     MOVE  -12              TO WORK-AREA-3.
054900     MOVE 1 TO REC-CT.
055000 PICTURE-TEST-3.
055100     MOVE WORK-AREA-3 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
055200                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
055300                         EDIT-AREA-7  EDIT-AREA-8.
055400     GO TO PICTURE-TEST-3-A.
055500 PICTURE-DELETE-3.
055600     PERFORM DE-LETE.
055700     PERFORM PRINT-DETAIL.
055800     GO TO PICTURE-INIT-4.
055900 PICTURE-TEST-3-A.
056000     IF EDIT-AREA-1 EQUAL TO "-0012"
056100        PERFORM PASS
056200        PERFORM PRINT-DETAIL
056300        ELSE PERFORM FAIL
056400        MOVE EDIT-AREA-1 TO COMPUTED-A
056500        MOVE "-0012" TO CORRECT-A
056600        PERFORM PRINT-DETAIL.
056700     ADD 1 TO REC-CT.
056800 PICTURE-TEST-3-B.
056900     IF EDIT-AREA-2 EQUAL TO "-0012"
057000        PERFORM PASS
057100        PERFORM PRINT-DETAIL
057200        ELSE PERFORM FAIL
057300        MOVE EDIT-AREA-2 TO COMPUTED-A
057400        MOVE "-0012" TO CORRECT-A
057500        PERFORM PRINT-DETAIL.
057600     ADD 1 TO REC-CT.
057700 PICTURE-TEST-3-C.
057800     IF EDIT-AREA-3 EQUAL TO "  -12"
057900        PERFORM PASS
058000        PERFORM PRINT-DETAIL
058100        ELSE PERFORM FAIL
058200        MOVE EDIT-AREA-3 TO COMPUTED-A
058300        MOVE "  -12" TO CORRECT-A
058400        PERFORM PRINT-DETAIL.
058500     ADD 1 TO REC-CT.
058600 PICTURE-TEST-3-D.
058700     IF EDIT-AREA-4 EQUAL TO "  -12"
058800        PERFORM PASS
058900        PERFORM PRINT-DETAIL
059000        ELSE PERFORM FAIL
059100        MOVE EDIT-AREA-4 TO COMPUTED-A
059200        MOVE "  -12" TO CORRECT-A
059300        PERFORM PRINT-DETAIL.
059400     ADD 1 TO REC-CT.
059500 PICTURE-TEST-3-E.
059600     IF EDIT-AREA-5 EQUAL TO "  -12"
059700        PERFORM PASS
059800        PERFORM PRINT-DETAIL
059900        ELSE PERFORM FAIL
060000        MOVE EDIT-AREA-5 TO COMPUTED-A
060100        MOVE "  -12" TO CORRECT-A
060200        PERFORM PRINT-DETAIL.
060300     ADD 1 TO REC-CT.
060400 PICTURE-TEST-3-F.
060500     IF EDIT-AREA-6 EQUAL TO "  -12"
060600        PERFORM PASS
060700        PERFORM PRINT-DETAIL
060800        ELSE PERFORM FAIL
060900        MOVE EDIT-AREA-6 TO COMPUTED-A
061000        MOVE "  -12" TO CORRECT-A
061100        PERFORM PRINT-DETAIL.
061200     ADD 1 TO REC-CT.
061300 PICTURE-TEST-3-G.
061400     IF EDIT-AREA-7 EQUAL TO "  -12.00"
061500        PERFORM PASS
061600        PERFORM PRINT-DETAIL
061700        ELSE PERFORM FAIL
061800        MOVE EDIT-AREA-7 TO COMPUTED-A
061900        MOVE "  -12.00" TO CORRECT-A
062000        PERFORM PRINT-DETAIL.
062100     ADD 1 TO REC-CT.
062200 PICTURE-TEST-3-H.
062300     IF EDIT-AREA-8 EQUAL TO "   -12.00"
062400        PERFORM PASS
062500        PERFORM PRINT-DETAIL
062600        ELSE PERFORM FAIL
062700        MOVE EDIT-AREA-8 TO COMPUTED-A
062800        MOVE "   -12.00" TO CORRECT-A
062900        PERFORM PRINT-DETAIL.
063000 PICTURE-INIT-4.
063100     MOVE "VI-31"           TO ANSI-REFERENCE.
063200     MOVE "PICTRE-TST-4" TO PAR-NAME.
063300     MOVE "PICTURE + AND -" TO FEATURE.
063400     MOVE  123              TO WORK-AREA-4.
063500     MOVE 1 TO REC-CT.
063600 PICTURE-TEST-4.
063700     MOVE WORK-AREA-4 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
063800                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
063900                         EDIT-AREA-7  EDIT-AREA-8.
064000     GO TO PICTURE-TEST-4-A.
064100 PICTURE-DELETE-4.
064200     PERFORM DE-LETE.
064300     PERFORM PRINT-DETAIL.
064400     GO TO PICTURE-INIT-5.
064500 PICTURE-TEST-4-A.
064600     IF EDIT-AREA-1 EQUAL TO "+0123"
064700        PERFORM PASS
064800        PERFORM PRINT-DETAIL
064900        ELSE PERFORM FAIL
065000        MOVE EDIT-AREA-1 TO COMPUTED-A
065100        MOVE "+0123" TO CORRECT-A
065200        PERFORM PRINT-DETAIL.
065300     ADD 1 TO REC-CT.
065400 PICTURE-TEST-4-B.
065500     IF EDIT-AREA-2 EQUAL TO " 0123"
065600        PERFORM PASS
065700        PERFORM PRINT-DETAIL
065800        ELSE PERFORM FAIL
065900        MOVE EDIT-AREA-2 TO COMPUTED-A
066000        MOVE " 0123" TO CORRECT-A
066100        PERFORM PRINT-DETAIL.
066200     ADD 1 TO REC-CT.
066300 PICTURE-TEST-4-C.
066400     IF EDIT-AREA-3 EQUAL TO " +123"
066500        PERFORM PASS
066600        PERFORM PRINT-DETAIL
066700        ELSE PERFORM FAIL
066800        MOVE EDIT-AREA-3 TO COMPUTED-A
066900        MOVE " +123" TO CORRECT-A
067000        PERFORM PRINT-DETAIL.
067100     ADD 1 TO REC-CT.
067200 PICTURE-TEST-4-D.
067300     IF EDIT-AREA-4 EQUAL TO "  123"
067400        PERFORM PASS
067500        PERFORM PRINT-DETAIL
067600        ELSE PERFORM FAIL
067700        MOVE EDIT-AREA-4 TO COMPUTED-A
067800        MOVE "  123" TO CORRECT-A
067900        PERFORM PRINT-DETAIL.
068000     ADD 1 TO REC-CT.
068100 PICTURE-TEST-4-E.
068200     IF EDIT-AREA-5 EQUAL TO " +123"
068300        PERFORM PASS
068400        PERFORM PRINT-DETAIL
068500        ELSE PERFORM FAIL
068600        MOVE EDIT-AREA-5 TO COMPUTED-A
068700        MOVE " +123" TO CORRECT-A
068800        PERFORM PRINT-DETAIL.
068900     ADD 1 TO REC-CT.
069000 PICTURE-TEST-4-F.
069100     IF EDIT-AREA-6 EQUAL TO "  123"
069200        PERFORM PASS
069300        PERFORM PRINT-DETAIL
069400        ELSE PERFORM FAIL
069500        MOVE EDIT-AREA-6 TO COMPUTED-A
069600        MOVE "  123" TO CORRECT-A
069700        PERFORM PRINT-DETAIL.
069800     ADD 1 TO REC-CT.
069900 PICTURE-TEST-4-G.
070000     IF EDIT-AREA-7 EQUAL TO " +123.00"
070100        PERFORM PASS
070200        PERFORM PRINT-DETAIL
070300        ELSE PERFORM FAIL
070400        MOVE EDIT-AREA-7 TO COMPUTED-A
070500        MOVE " +123.00" TO CORRECT-A
070600        PERFORM PRINT-DETAIL.
070700     ADD 1 TO REC-CT.
070800 PICTURE-TEST-4-H.
070900     IF EDIT-AREA-8 EQUAL TO "   123.00"
071000        PERFORM PASS
071100        PERFORM PRINT-DETAIL
071200        ELSE PERFORM FAIL
071300        MOVE EDIT-AREA-8 TO COMPUTED-A
071400        MOVE "   123.00" TO CORRECT-A
071500        PERFORM PRINT-DETAIL.
071600 PICTURE-INIT-5.
071700     MOVE "VI-31"           TO ANSI-REFERENCE.
071800     MOVE "PICTRE-TST-5" TO PAR-NAME.
071900     MOVE "PICTURE + AND -" TO FEATURE.
072000     MOVE  -123             TO WORK-AREA-5.
072100     MOVE 1 TO REC-CT.
072200 PICTURE-TEST-5.
072300     MOVE WORK-AREA-5 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
072400                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
072500                         EDIT-AREA-7  EDIT-AREA-8.
072600     GO TO PICTURE-TEST-5-A.
072700 PICTURE-DELETE-5.
072800     PERFORM DE-LETE.
072900     PERFORM PRINT-DETAIL.
073000     GO TO PICTURE-INIT-6.
073100 PICTURE-TEST-5-A.
073200     IF EDIT-AREA-1 EQUAL TO "-0123"
073300        PERFORM PASS
073400        PERFORM PRINT-DETAIL
073500        ELSE PERFORM FAIL
073600        MOVE EDIT-AREA-1 TO COMPUTED-A
073700        MOVE "-0123" TO CORRECT-A
073800        PERFORM PRINT-DETAIL.
073900     ADD 1 TO REC-CT.
074000 PICTURE-TEST-5-B.
074100     IF EDIT-AREA-2 EQUAL TO "-0123"
074200        PERFORM PASS
074300        PERFORM PRINT-DETAIL
074400        ELSE PERFORM FAIL
074500        MOVE EDIT-AREA-2 TO COMPUTED-A
074600        MOVE "-0123" TO CORRECT-A
074700        PERFORM PRINT-DETAIL.
074800     ADD 1 TO REC-CT.
074900 PICTURE-TEST-5-C.
075000     IF EDIT-AREA-3 EQUAL TO " -123"
075100        PERFORM PASS
075200        PERFORM PRINT-DETAIL
075300        ELSE PERFORM FAIL
075400        MOVE EDIT-AREA-3 TO COMPUTED-A
075500        MOVE " -123" TO CORRECT-A
075600        PERFORM PRINT-DETAIL.
075700     ADD 1 TO REC-CT.
075800 PICTURE-TEST-5-D.
075900     IF EDIT-AREA-4 EQUAL TO " -123"
076000        PERFORM PASS
076100        PERFORM PRINT-DETAIL
076200        ELSE PERFORM FAIL
076300        MOVE EDIT-AREA-4 TO COMPUTED-A
076400        MOVE " -123" TO CORRECT-A
076500        PERFORM PRINT-DETAIL.
076600     ADD 1 TO REC-CT.
076700 PICTURE-TEST-5-E.
076800     IF EDIT-AREA-5 EQUAL TO " -123"
076900        PERFORM PASS
077000        PERFORM PRINT-DETAIL
077100        ELSE PERFORM FAIL
077200        MOVE EDIT-AREA-5 TO COMPUTED-A
077300        MOVE " -123" TO CORRECT-A
077400        PERFORM PRINT-DETAIL.
077500     ADD 1 TO REC-CT.
077600 PICTURE-TEST-5-F.
077700     IF EDIT-AREA-6 EQUAL TO " -123"
077800        PERFORM PASS
077900        PERFORM PRINT-DETAIL
078000        ELSE PERFORM FAIL
078100        MOVE EDIT-AREA-6 TO COMPUTED-A
078200        MOVE " -123" TO CORRECT-A
078300        PERFORM PRINT-DETAIL.
078400     ADD 1 TO REC-CT.
078500 PICTURE-TEST-5-G.
078600     IF EDIT-AREA-7 EQUAL TO " -123.00"
078700        PERFORM PASS
078800        PERFORM PRINT-DETAIL
078900        ELSE PERFORM FAIL
079000        MOVE EDIT-AREA-7 TO COMPUTED-A
079100        MOVE " -123.00" TO CORRECT-A
079200        PERFORM PRINT-DETAIL.
079300     ADD 1 TO REC-CT.
079400 PICTURE-TEST-5-H.
079500     IF EDIT-AREA-8 EQUAL TO "  -123.00"
079600        PERFORM PASS
079700        PERFORM PRINT-DETAIL
079800        ELSE PERFORM FAIL
079900        MOVE EDIT-AREA-8 TO COMPUTED-A
080000        MOVE "  -123.00" TO CORRECT-A
080100        PERFORM PRINT-DETAIL.
080200 PICTURE-INIT-6.
080300     MOVE "VI-31"           TO ANSI-REFERENCE.
080400     MOVE "PICTRE-TST-6" TO PAR-NAME.
080500     MOVE "PICTURE + AND -" TO FEATURE.
080600     MOVE  1234             TO WORK-AREA-6.
080700     MOVE 1 TO REC-CT.
080800 PICTURE-TEST-6.
080900     MOVE WORK-AREA-6 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
081000                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
081100                         EDIT-AREA-7  EDIT-AREA-8.
081200     GO TO PICTURE-TEST-6-A.
081300 PICTURE-DELETE-6.
081400     PERFORM DE-LETE.
081500     PERFORM PRINT-DETAIL.
081600     GO TO PICTURE-INIT-7.
081700 PICTURE-TEST-6-A.
081800     IF EDIT-AREA-1 EQUAL TO "+1234"
081900        PERFORM PASS
082000        PERFORM PRINT-DETAIL
082100        ELSE PERFORM FAIL
082200        MOVE EDIT-AREA-1 TO COMPUTED-A
082300        MOVE "+1234" TO CORRECT-A
082400        PERFORM PRINT-DETAIL.
082500     ADD 1 TO REC-CT.
082600 PICTURE-TEST-6-B.
082700     IF EDIT-AREA-2 EQUAL TO " 1234"
082800        PERFORM PASS
082900        PERFORM PRINT-DETAIL
083000        ELSE PERFORM FAIL
083100        MOVE EDIT-AREA-2 TO COMPUTED-A
083200        MOVE " 1234" TO CORRECT-A
083300        PERFORM PRINT-DETAIL.
083400     ADD 1 TO REC-CT.
083500 PICTURE-TEST-6-C.
083600     IF EDIT-AREA-3 EQUAL TO "+1234"
083700        PERFORM PASS
083800        PERFORM PRINT-DETAIL
083900        ELSE PERFORM FAIL
084000        MOVE EDIT-AREA-3 TO COMPUTED-A
084100        MOVE "+1234" TO CORRECT-A
084200        PERFORM PRINT-DETAIL.
084300     ADD 1 TO REC-CT.
084400 PICTURE-TEST-6-D.
084500     IF EDIT-AREA-4 EQUAL TO " 1234"
084600        PERFORM PASS
084700        PERFORM PRINT-DETAIL
084800        ELSE PERFORM FAIL
084900        MOVE EDIT-AREA-4 TO COMPUTED-A
085000        MOVE " 1234" TO CORRECT-A
085100        PERFORM PRINT-DETAIL.
085200     ADD 1 TO REC-CT.
085300 PICTURE-TEST-6-E.
085400     IF EDIT-AREA-5 EQUAL TO "+1234"
085500        PERFORM PASS
085600        PERFORM PRINT-DETAIL
085700        ELSE PERFORM FAIL
085800        MOVE EDIT-AREA-5 TO COMPUTED-A
085900        MOVE "+1234" TO CORRECT-A
086000        PERFORM PRINT-DETAIL.
086100     ADD 1 TO REC-CT.
086200 PICTURE-TEST-6-F.
086300     IF EDIT-AREA-6 EQUAL TO " 1234"
086400        PERFORM PASS
086500        PERFORM PRINT-DETAIL
086600        ELSE PERFORM FAIL
086700        MOVE EDIT-AREA-6 TO COMPUTED-A
086800        MOVE " 1234" TO CORRECT-A
086900        PERFORM PRINT-DETAIL.
087000     ADD 1 TO REC-CT.
087100 PICTURE-TEST-6-G.
087200     IF EDIT-AREA-7 EQUAL TO "+1234.00"
087300        PERFORM PASS
087400        PERFORM PRINT-DETAIL
087500        ELSE PERFORM FAIL
087600        MOVE EDIT-AREA-7 TO COMPUTED-A
087700        MOVE "+1234.00" TO CORRECT-A
087800        PERFORM PRINT-DETAIL.
087900     ADD 1 TO REC-CT.
088000 PICTURE-TEST-6-H.
088100     IF EDIT-AREA-8 EQUAL TO " 1,234.00"
088200        PERFORM PASS
088300        PERFORM PRINT-DETAIL
088400        ELSE PERFORM FAIL
088500        MOVE EDIT-AREA-8 TO COMPUTED-A
088600        MOVE " 1,234.00" TO CORRECT-A
088700        PERFORM PRINT-DETAIL.
088800 PICTURE-INIT-7.
088900     MOVE "VI-31"           TO ANSI-REFERENCE.
089000     MOVE "PICTRE-TST-7" TO PAR-NAME.
089100     MOVE "PICTURE + AND -" TO FEATURE.
089200     MOVE  -1234           TO WORK-AREA-7.
089300     MOVE 1 TO REC-CT.
089400 PICTURE-TEST-7.
089500     MOVE WORK-AREA-7 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
089600                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
089700                         EDIT-AREA-7  EDIT-AREA-8.
089800     GO TO PICTURE-TEST-7-A.
089900 PICTURE-DELETE-7.
090000     PERFORM DE-LETE.
090100     PERFORM PRINT-DETAIL.
090200     GO TO PICTURE-INIT-8.
090300 PICTURE-TEST-7-A.
090400     IF EDIT-AREA-1 EQUAL TO "-1234"
090500        PERFORM PASS
090600        PERFORM PRINT-DETAIL
090700        ELSE PERFORM FAIL
090800        MOVE EDIT-AREA-1 TO COMPUTED-A
090900        MOVE "-1234" TO CORRECT-A
091000        PERFORM PRINT-DETAIL.
091100     ADD 1 TO REC-CT.
091200 PICTURE-TEST-7-B.
091300     IF EDIT-AREA-2 EQUAL TO "-1234"
091400        PERFORM PASS
091500        PERFORM PRINT-DETAIL
091600        ELSE PERFORM FAIL
091700        MOVE EDIT-AREA-2 TO COMPUTED-A
091800        MOVE "-1234" TO CORRECT-A
091900        PERFORM PRINT-DETAIL.
092000     ADD 1 TO REC-CT.
092100 PICTURE-TEST-7-C.
092200     IF EDIT-AREA-3 EQUAL TO "-1234"
092300        PERFORM PASS
092400        PERFORM PRINT-DETAIL
092500        ELSE PERFORM FAIL
092600        MOVE EDIT-AREA-3 TO COMPUTED-A
092700        MOVE "-1234" TO CORRECT-A
092800        PERFORM PRINT-DETAIL.
092900     ADD 1 TO REC-CT.
093000 PICTURE-TEST-7-D.
093100     IF EDIT-AREA-4 EQUAL TO "-1234"
093200        PERFORM PASS
093300        PERFORM PRINT-DETAIL
093400        ELSE PERFORM FAIL
093500        MOVE EDIT-AREA-4 TO COMPUTED-A
093600        MOVE "-1234" TO CORRECT-A
093700        PERFORM PRINT-DETAIL.
093800     ADD 1 TO REC-CT.
093900 PICTURE-TEST-7-E.
094000     IF EDIT-AREA-5 EQUAL TO "-1234"
094100        PERFORM PASS
094200        PERFORM PRINT-DETAIL
094300        ELSE PERFORM FAIL
094400        MOVE EDIT-AREA-5 TO COMPUTED-A
094500        MOVE "-1234" TO CORRECT-A
094600        PERFORM PRINT-DETAIL.
094700     ADD 1 TO REC-CT.
094800 PICTURE-TEST-7-F.
094900     IF EDIT-AREA-6 EQUAL TO "-1234"
095000        PERFORM PASS
095100        PERFORM PRINT-DETAIL
095200        ELSE PERFORM FAIL
095300        MOVE EDIT-AREA-6 TO COMPUTED-A
095400        MOVE "-1234" TO CORRECT-A
095500        PERFORM PRINT-DETAIL.
095600     ADD 1 TO REC-CT.
095700 PICTURE-TEST-7-G.
095800     IF EDIT-AREA-7 EQUAL TO "-1234.00"
095900        PERFORM PASS
096000        PERFORM PRINT-DETAIL
096100        ELSE PERFORM FAIL
096200        MOVE EDIT-AREA-7 TO COMPUTED-A
096300        MOVE "-1234.00" TO CORRECT-A
096400        PERFORM PRINT-DETAIL.
096500     ADD 1 TO REC-CT.
096600 PICTURE-TEST-7-H.
096700     IF EDIT-AREA-8 EQUAL TO "-1,234.00"
096800        PERFORM PASS
096900        PERFORM PRINT-DETAIL
097000        ELSE PERFORM FAIL
097100        MOVE EDIT-AREA-8 TO COMPUTED-A
097200        MOVE "-1,234.00" TO CORRECT-A
097300        PERFORM PRINT-DETAIL.
097400 PICTURE-INIT-8.
097500     MOVE "VI-31"           TO ANSI-REFERENCE.
097600     MOVE "PICTRE-TST-8" TO PAR-NAME.
097700     MOVE "PICTURE + AND -" TO FEATURE.
097800     MOVE  12.34           TO WORK-AREA-8.
097900     MOVE 1 TO REC-CT.
098000 PICTURE-TEST-8.
098100     MOVE WORK-AREA-8 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
098200                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
098300                         EDIT-AREA-7  EDIT-AREA-8.
098400     GO TO PICTURE-TEST-8-A.
098500 PICTURE-DELETE-8.
098600     PERFORM DE-LETE.
098700     PERFORM PRINT-DETAIL.
098800     GO TO PICTURE-INIT-9.
098900 PICTURE-TEST-8-A.
099000     IF EDIT-AREA-1 EQUAL TO "+0012"
099100        PERFORM PASS
099200        PERFORM PRINT-DETAIL
099300        ELSE PERFORM FAIL
099400        MOVE EDIT-AREA-1 TO COMPUTED-A
099500        MOVE "+0012" TO CORRECT-A
099600        PERFORM PRINT-DETAIL.
099700     ADD 1 TO REC-CT.
099800 PICTURE-TEST-8-B.
099900     IF EDIT-AREA-2 EQUAL TO " 0012"
100000        PERFORM PASS
100100        PERFORM PRINT-DETAIL
100200        ELSE PERFORM FAIL
100300        MOVE EDIT-AREA-2 TO COMPUTED-A
100400        MOVE " 0012" TO CORRECT-A
100500        PERFORM PRINT-DETAIL.
100600     ADD 1 TO REC-CT.
100700 PICTURE-TEST-8-C.
100800     IF EDIT-AREA-3 EQUAL TO "  +12"
100900        PERFORM PASS
101000        PERFORM PRINT-DETAIL
101100        ELSE PERFORM FAIL
101200        MOVE EDIT-AREA-3 TO COMPUTED-A
101300        MOVE "  +12" TO CORRECT-A
101400        PERFORM PRINT-DETAIL.
101500     ADD 1 TO REC-CT.
101600 PICTURE-TEST-8-D.
101700     IF EDIT-AREA-4 EQUAL TO "   12"
101800        PERFORM PASS
101900        PERFORM PRINT-DETAIL
102000        ELSE PERFORM FAIL
102100        MOVE EDIT-AREA-4 TO COMPUTED-A
102200        MOVE "   12" TO CORRECT-A
102300        PERFORM PRINT-DETAIL.
102400     ADD 1 TO REC-CT.
102500 PICTURE-TEST-8-E.
102600     IF EDIT-AREA-5 EQUAL TO "  +12"
102700        PERFORM PASS
102800        PERFORM PRINT-DETAIL
102900        ELSE PERFORM FAIL
103000        MOVE EDIT-AREA-5 TO COMPUTED-A
103100        MOVE "  +12" TO CORRECT-A
103200        PERFORM PRINT-DETAIL.
103300     ADD 1 TO REC-CT.
103400 PICTURE-TEST-8-F.
103500     IF EDIT-AREA-6 EQUAL TO "   12"
103600        PERFORM PASS
103700        PERFORM PRINT-DETAIL
103800        ELSE PERFORM FAIL
103900        MOVE EDIT-AREA-6 TO COMPUTED-A
104000        MOVE "   12" TO CORRECT-A
104100        PERFORM PRINT-DETAIL.
104200     ADD 1 TO REC-CT.
104300 PICTURE-TEST-8-G.
104400     IF EDIT-AREA-7 EQUAL TO "  +12.34"
104500        PERFORM PASS
104600        PERFORM PRINT-DETAIL
104700        ELSE PERFORM FAIL
104800        MOVE EDIT-AREA-7 TO COMPUTED-A
104900        MOVE "  +12.34" TO CORRECT-A
105000        PERFORM PRINT-DETAIL.
105100     ADD 1 TO REC-CT.
105200 PICTURE-TEST-8-H.
105300     IF EDIT-AREA-8 EQUAL TO "    12.34"
105400        PERFORM PASS
105500        PERFORM PRINT-DETAIL
105600        ELSE PERFORM FAIL
105700        MOVE EDIT-AREA-8 TO COMPUTED-A
105800        MOVE "    12.34" TO CORRECT-A
105900        PERFORM PRINT-DETAIL.
106000 PICTURE-INIT-9.
106100     MOVE "VI-31"           TO ANSI-REFERENCE.
106200     MOVE "PICTRE-TST-9" TO PAR-NAME.
106300     MOVE "PICTURE + AND -" TO FEATURE.
106400     MOVE -12.34           TO WORK-AREA-9.
106500     MOVE 1 TO REC-CT.
106600 PICTURE-TEST-9.
106700     MOVE WORK-AREA-9 TO EDIT-AREA-1  EDIT-AREA-2  EDIT-AREA-3
106800                         EDIT-AREA-4  EDIT-AREA-5  EDIT-AREA-6
106900                         EDIT-AREA-7  EDIT-AREA-8.
107000     GO TO PICTURE-TEST-9-A.
107100 PICTURE-DELETE-9.
107200     PERFORM DE-LETE.
107300     PERFORM PRINT-DETAIL.
107400     GO TO PICTURE-INIT-10.
107500 PICTURE-TEST-9-A.
107600     IF EDIT-AREA-1 EQUAL TO "-0012"
107700        PERFORM PASS
107800        PERFORM PRINT-DETAIL
107900        ELSE PERFORM FAIL
108000        MOVE EDIT-AREA-1 TO COMPUTED-A
108100        MOVE "-0012" TO CORRECT-A
108200        PERFORM PRINT-DETAIL.
108300     ADD 1 TO REC-CT.
108400 PICTURE-TEST-9-B.
108500     IF EDIT-AREA-2 EQUAL TO "-0012"
108600        PERFORM PASS
108700        PERFORM PRINT-DETAIL
108800        ELSE PERFORM FAIL
108900        MOVE EDIT-AREA-2 TO COMPUTED-A
109000        MOVE "-0012" TO CORRECT-A
109100        PERFORM PRINT-DETAIL.
109200     ADD 1 TO REC-CT.
109300 PICTURE-TEST-9-C.
109400     IF EDIT-AREA-3 EQUAL TO "  -12"
109500        PERFORM PASS
109600        PERFORM PRINT-DETAIL
109700        ELSE PERFORM FAIL
109800        MOVE EDIT-AREA-3 TO COMPUTED-A
109900        MOVE "  -12" TO CORRECT-A
110000        PERFORM PRINT-DETAIL.
110100     ADD 1 TO REC-CT.
110200 PICTURE-TEST-9-D.
110300     IF EDIT-AREA-4 EQUAL TO "  -12"
110400        PERFORM PASS
110500        PERFORM PRINT-DETAIL
110600        ELSE PERFORM FAIL
110700        MOVE EDIT-AREA-4 TO COMPUTED-A
110800        MOVE "  -12" TO CORRECT-A
110900        PERFORM PRINT-DETAIL.
111000     ADD 1 TO REC-CT.
111100 PICTURE-TEST-9-E.
111200     IF EDIT-AREA-5 EQUAL TO "  -12"
111300        PERFORM PASS
111400        PERFORM PRINT-DETAIL
111500        ELSE PERFORM FAIL
111600        MOVE EDIT-AREA-5 TO COMPUTED-A
111700        MOVE "  -12" TO CORRECT-A
111800        PERFORM PRINT-DETAIL.
111900     ADD 1 TO REC-CT.
112000 PICTURE-TEST-9-F.
112100     IF EDIT-AREA-6 EQUAL TO "  -12"
112200        PERFORM PASS
112300        PERFORM PRINT-DETAIL
112400        ELSE PERFORM FAIL
112500        MOVE EDIT-AREA-6 TO COMPUTED-A
112600        MOVE "  -12" TO CORRECT-A
112700        PERFORM PRINT-DETAIL.
112800     ADD 1 TO REC-CT.
112900 PICTURE-TEST-9-G.
113000     IF EDIT-AREA-7 EQUAL TO "  -12.34"
113100        PERFORM PASS
113200        PERFORM PRINT-DETAIL
113300        ELSE PERFORM FAIL
113400        MOVE EDIT-AREA-7 TO COMPUTED-A
113500        MOVE "  -12.34" TO CORRECT-A
113600        PERFORM PRINT-DETAIL.
113700     ADD 1 TO REC-CT.
113800 PICTURE-TEST-9-H.
113900     IF EDIT-AREA-8 EQUAL TO "   -12.34"
114000        PERFORM PASS
114100        PERFORM PRINT-DETAIL
114200        ELSE PERFORM FAIL
114300        MOVE EDIT-AREA-8 TO COMPUTED-A
114400        MOVE "   -12.34" TO CORRECT-A
114500        PERFORM PRINT-DETAIL.
114600 PICTURE-INIT-10.
114700     MOVE "VI-31"           TO ANSI-REFERENCE.
114800     MOVE "PCTRE-TST-10" TO PAR-NAME.
114900     MOVE "PICTURE CHARACTER l" TO FEATURE.
115000     MOVE  0               TO WORK-AREA-10.
115100     MOVE 1 TO REC-CT.
115200 PICTURE-TEST-10.
115300     MOVE WORK-AREA-10 TO EDIT-AREA-9  EDIT-AREA-10
115400                          EDIT-AREA-11  EDIT-AREA-12.
115500     GO TO PICTURE-TEST-10-A.
115600 PICTURE-DELETE-10.
115700     PERFORM DE-LETE.
115800     PERFORM PRINT-DETAIL.
115900     GO TO PICTURE-INIT-11.
116000 PICTURE-TEST-10-A.
116100     IF EDIT-AREA-9 EQUAL TO " $00"
116200        PERFORM PASS
116300        PERFORM PRINT-DETAIL
116400        ELSE PERFORM FAIL
116500        MOVE EDIT-AREA-9 TO COMPUTED-A
116600        MOVE " $00" TO CORRECT-A
116700        PERFORM PRINT-DETAIL.
116800     ADD 1 TO REC-CT.
116900 PICTURE-TEST-10-B.
117000     IF EDIT-AREA-10 EQUAL TO "   $0"
117100        PERFORM PASS
117200        PERFORM PRINT-DETAIL
117300        ELSE PERFORM FAIL
117400        MOVE EDIT-AREA-10 TO COMPUTED-A
117500        MOVE "   $0" TO CORRECT-A
117600        PERFORM PRINT-DETAIL.
117700     ADD 1 TO REC-CT.
117800 PICTURE-TEST-10-C.
117900     IF EDIT-AREA-11 EQUAL TO "    $.00"
118000        PERFORM PASS
118100        PERFORM PRINT-DETAIL
118200        ELSE PERFORM FAIL
118300        MOVE EDIT-AREA-11 TO COMPUTED-A
118400        MOVE "    $.00" TO CORRECT-A
118500        PERFORM PRINT-DETAIL.
118600     ADD 1 TO REC-CT.
118700 PICTURE-TEST-10-D.
118800     IF EDIT-AREA-12 EQUAL TO "         "
118900        PERFORM PASS
119000        PERFORM PRINT-DETAIL
119100        ELSE PERFORM FAIL
119200        MOVE EDIT-AREA-12 TO COMPUTED-A
119300        MOVE "SPACES" TO CORRECT-A
119400        PERFORM PRINT-DETAIL.
119500 PICTURE-INIT-11.
119600     MOVE "VI-31"           TO ANSI-REFERENCE.
119700     MOVE "PCTRE-TST-11" TO PAR-NAME.
119800     MOVE "PICTURE CHARACTER l" TO FEATURE.
119900     MOVE  .02                  TO WORK-AREA-11.
120000     MOVE 1 TO REC-CT.
120100 PICTURE-TEST-11.
120200     MOVE WORK-AREA-11 TO EDIT-AREA-9  EDIT-AREA-10
120300                          EDIT-AREA-11  EDIT-AREA-12.
120400     GO TO PICTURE-TEST-11-A.
120500 PICTURE-DELETE-11.
120600     PERFORM DE-LETE.
120700     PERFORM PRINT-DETAIL.
120800     GO TO PICTURE-INIT-12.
120900 PICTURE-TEST-11-A.
121000     IF EDIT-AREA-9 EQUAL TO " $00"
121100        PERFORM PASS
121200        PERFORM PRINT-DETAIL
121300        ELSE PERFORM FAIL
121400        MOVE EDIT-AREA-9 TO COMPUTED-A
121500        MOVE " $00" TO CORRECT-A
121600        PERFORM PRINT-DETAIL.
121700     ADD 1 TO REC-CT.
121800 PICTURE-TEST-11-B.
121900     IF EDIT-AREA-10 EQUAL TO "   $0"
122000        PERFORM PASS
122100        PERFORM PRINT-DETAIL
122200        ELSE PERFORM FAIL
122300        MOVE EDIT-AREA-10 TO COMPUTED-A
122400        MOVE "   $0" TO CORRECT-A
122500        PERFORM PRINT-DETAIL.
122600     ADD 1 TO REC-CT.
122700 PICTURE-TEST-11-C.
122800     IF EDIT-AREA-11 EQUAL TO "    $.02"
122900        PERFORM PASS
123000        PERFORM PRINT-DETAIL
123100        ELSE PERFORM FAIL
123200        MOVE EDIT-AREA-11 TO COMPUTED-A
123300        MOVE "    $.02" TO CORRECT-A
123400        PERFORM PRINT-DETAIL.
123500     ADD 1 TO REC-CT.
123600 PICTURE-TEST-11-D.
123700     IF EDIT-AREA-12 EQUAL TO "     $.02"
123800        PERFORM PASS
123900        PERFORM PRINT-DETAIL
124000        ELSE PERFORM FAIL
124100        MOVE EDIT-AREA-12 TO COMPUTED-A
124200        MOVE "     $.02" TO CORRECT-A
124300        PERFORM PRINT-DETAIL.
124400 PICTURE-INIT-12.
124500     MOVE "VI-31"           TO ANSI-REFERENCE.
124600     MOVE "PCTRE-TST-12" TO PAR-NAME.
124700     MOVE "PICTURE CHARACTER l" TO FEATURE.
124800     MOVE  12                   TO WORK-AREA-12.
124900     MOVE 1 TO REC-CT.
125000 PICTURE-TEST-12.
125100     MOVE WORK-AREA-12 TO EDIT-AREA-9  EDIT-AREA-10
125200                          EDIT-AREA-11  EDIT-AREA-12.
125300     GO TO PICTURE-TEST-12-A.
125400 PICTURE-DELETE-12.
125500     PERFORM DE-LETE.
125600     PERFORM PRINT-DETAIL.
125700     GO TO PICTURE-INIT-13.
125800 PICTURE-TEST-12-A.
125900     IF EDIT-AREA-9 EQUAL TO " $12"
126000        PERFORM PASS
126100        PERFORM PRINT-DETAIL
126200        ELSE PERFORM FAIL
126300        MOVE EDIT-AREA-9 TO COMPUTED-A
126400        MOVE " $12" TO CORRECT-A
126500        PERFORM PRINT-DETAIL.
126600     ADD 1 TO REC-CT.
126700 PICTURE-TEST-12-B.
126800     IF EDIT-AREA-10 EQUAL TO "  $12"
126900        PERFORM PASS
127000        PERFORM PRINT-DETAIL
127100        ELSE PERFORM FAIL
127200        MOVE EDIT-AREA-10 TO COMPUTED-A
127300        MOVE "  $12" TO CORRECT-A
127400        PERFORM PRINT-DETAIL.
127500     ADD 1 TO REC-CT.
127600 PICTURE-TEST-12-C.
127700     IF EDIT-AREA-11 EQUAL TO "  $12.00"
127800        PERFORM PASS
127900        PERFORM PRINT-DETAIL
128000        ELSE PERFORM FAIL
128100        MOVE EDIT-AREA-11 TO COMPUTED-A
128200        MOVE "  $12.00" TO CORRECT-A
128300        PERFORM PRINT-DETAIL.
128400     ADD 1 TO REC-CT.
128500 PICTURE-TEST-12-D.
128600     IF EDIT-AREA-12 EQUAL TO "   $12.00"
128700        PERFORM PASS
128800        PERFORM PRINT-DETAIL
128900        ELSE PERFORM FAIL
129000        MOVE EDIT-AREA-12 TO COMPUTED-A
129100        MOVE "   $12.00" TO CORRECT-A
129200        PERFORM PRINT-DETAIL.
129300 PICTURE-INIT-13.
129400     MOVE "VI-31"           TO ANSI-REFERENCE.
129500     MOVE "PCTRE-TST-13" TO PAR-NAME.
129600     MOVE "PICTURE CHARACTER l" TO FEATURE.
129700     MOVE  12.34                TO WORK-AREA-13.
129800     MOVE 1 TO REC-CT.
129900 PICTURE-TEST-13.
130000     MOVE WORK-AREA-13 TO EDIT-AREA-9  EDIT-AREA-10
130100                          EDIT-AREA-11  EDIT-AREA-12.
130200     GO TO PICTURE-TEST-13-A.
130300 PICTURE-DELETE-13.
130400     PERFORM DE-LETE.
130500     PERFORM PRINT-DETAIL.
130600     GO TO PICTURE-INIT-14.
130700 PICTURE-TEST-13-A.
130800     IF EDIT-AREA-9 EQUAL TO " $12"
130900        PERFORM PASS
131000        PERFORM PRINT-DETAIL
131100        ELSE PERFORM FAIL
131200        MOVE EDIT-AREA-9 TO COMPUTED-A
131300        MOVE " $12" TO CORRECT-A
131400        PERFORM PRINT-DETAIL.
131500     ADD 1 TO REC-CT.
131600 PICTURE-TEST-13-B.
131700     IF EDIT-AREA-10 EQUAL TO "  $12"
131800        PERFORM PASS
131900        PERFORM PRINT-DETAIL
132000        ELSE PERFORM FAIL
132100        MOVE EDIT-AREA-10 TO COMPUTED-A
132200        MOVE "  $12" TO CORRECT-A
132300        PERFORM PRINT-DETAIL.
132400     ADD 1 TO REC-CT.
132500 PICTURE-TEST-13-C.
132600     IF EDIT-AREA-11 EQUAL TO "  $12.34"
132700        PERFORM PASS
132800        PERFORM PRINT-DETAIL
132900        ELSE PERFORM FAIL
133000        MOVE EDIT-AREA-11 TO COMPUTED-A
133100        MOVE "  $12.34" TO CORRECT-A
133200        PERFORM PRINT-DETAIL.
133300     ADD 1 TO REC-CT.
133400 PICTURE-TEST-13-D.
133500     IF EDIT-AREA-12 EQUAL TO "   $12.34"
133600        PERFORM PASS
133700        PERFORM PRINT-DETAIL
133800        ELSE PERFORM FAIL
133900        MOVE EDIT-AREA-12 TO COMPUTED-A
134000        MOVE "   $12.34" TO CORRECT-A
134100        PERFORM PRINT-DETAIL.
134200 PICTURE-INIT-14.
134300     MOVE "VI-31"           TO ANSI-REFERENCE.
134400     MOVE "PCTRE-TST-14" TO PAR-NAME.
134500     MOVE "PICTURE CHARACTER l" TO FEATURE.
134600     MOVE  1234                 TO WORK-AREA-14.
134700     MOVE 1 TO REC-CT.
134800 PICTURE-TEST-14.
134900     MOVE WORK-AREA-14 TO EDIT-AREA-9  EDIT-AREA-10
135000                          EDIT-AREA-11  EDIT-AREA-12.
135100     GO TO PICTURE-TEST-14-A.
135200 PICTURE-DELETE-14.
135300     PERFORM DE-LETE.
135400     PERFORM PRINT-DETAIL.
135500     GO TO PICTURE-INIT-15.
135600 PICTURE-TEST-14-A.
135700     IF EDIT-AREA-9 EQUAL TO "$234"
135800        PERFORM PASS
135900        PERFORM PRINT-DETAIL
136000        ELSE PERFORM FAIL
136100        MOVE EDIT-AREA-9 TO COMPUTED-A
136200        MOVE "$234" TO CORRECT-A
136300        PERFORM PRINT-DETAIL.
136400     ADD 1 TO REC-CT.
136500 PICTURE-TEST-14-B.
136600     IF EDIT-AREA-10 EQUAL TO "$1234"
136700        PERFORM PASS
136800        PERFORM PRINT-DETAIL
136900        ELSE PERFORM FAIL
137000        MOVE EDIT-AREA-10 TO COMPUTED-A
137100        MOVE "$1234" TO CORRECT-A
137200        PERFORM PRINT-DETAIL.
137300     ADD 1 TO REC-CT.
137400 PICTURE-TEST-14-C.
137500     IF EDIT-AREA-11 EQUAL TO "$1234.00"
137600        PERFORM PASS
137700        PERFORM PRINT-DETAIL
137800        ELSE PERFORM FAIL
137900        MOVE EDIT-AREA-11 TO COMPUTED-A
138000        MOVE "$1234.00" TO CORRECT-A
138100        PERFORM PRINT-DETAIL.
138200     ADD 1 TO REC-CT.
138300 PICTURE-TEST-14-D.
138400     IF EDIT-AREA-12 EQUAL TO "$1,234.00"
138500        PERFORM PASS
138600        PERFORM PRINT-DETAIL
138700        ELSE PERFORM FAIL
138800        MOVE EDIT-AREA-12 TO COMPUTED-A
138900        MOVE "$1,234.00" TO CORRECT-A
139000        PERFORM PRINT-DETAIL.
139100 PICTURE-INIT-15.
139200     MOVE "VI-31"           TO ANSI-REFERENCE.
139300     MOVE "PCTRE-TST-15" TO PAR-NAME.
139400     MOVE "PICTURE CHARACTER l" TO FEATURE.
139500     MOVE  1234.56              TO WORK-AREA-15.
139600     MOVE 1 TO REC-CT.
139700 PICTURE-TEST-15.
139800     MOVE WORK-AREA-15 TO EDIT-AREA-9  EDIT-AREA-10
139900                          EDIT-AREA-11  EDIT-AREA-12.
140000     GO TO PICTURE-TEST-15-A.
140100 PICTURE-DELETE-15.
140200     PERFORM DE-LETE.
140300     PERFORM PRINT-DETAIL.
140400     GO TO PICTURE-INIT-16.
140500 PICTURE-TEST-15-A.
140600     IF EDIT-AREA-9 EQUAL TO "$234"
140700        PERFORM PASS
140800        PERFORM PRINT-DETAIL
140900        ELSE PERFORM FAIL
141000        MOVE EDIT-AREA-9 TO COMPUTED-A
141100        MOVE "$234" TO CORRECT-A
141200        PERFORM PRINT-DETAIL.
141300     ADD 1 TO REC-CT.
141400 PICTURE-TEST-15-B.
141500     IF EDIT-AREA-10 EQUAL TO "$1234"
141600        PERFORM PASS
141700        PERFORM PRINT-DETAIL
141800        ELSE PERFORM FAIL
141900        MOVE EDIT-AREA-10 TO COMPUTED-A
142000        MOVE "$1234" TO CORRECT-A
142100        PERFORM PRINT-DETAIL.
142200     ADD 1 TO REC-CT.
142300 PICTURE-TEST-15-C.
142400     IF EDIT-AREA-11 EQUAL TO "$1234.56"
142500        PERFORM PASS
142600        PERFORM PRINT-DETAIL
142700        ELSE PERFORM FAIL
142800        MOVE EDIT-AREA-11 TO COMPUTED-A
142900        MOVE "$1234.56" TO CORRECT-A
143000        PERFORM PRINT-DETAIL.
143100     ADD 1 TO REC-CT.
143200 PICTURE-TEST-15-D.
143300     IF EDIT-AREA-12 EQUAL TO "$1,234.56"
143400        PERFORM PASS
143500        PERFORM PRINT-DETAIL
143600        ELSE PERFORM FAIL
143700        MOVE EDIT-AREA-12 TO COMPUTED-A
143800        MOVE "$1,234.56" TO CORRECT-A
143900        PERFORM PRINT-DETAIL.
144000 PICTURE-INIT-16.
144100     MOVE "VI-31"           TO ANSI-REFERENCE.
144200     MOVE "PCTRE-TST-16" TO PAR-NAME.
144300     MOVE "PICTURE CHARACTER *" TO FEATURE.
144400     MOVE  0                    TO WORK-AREA-16.
144500     MOVE 1 TO REC-CT.
144600 PICTURE-TEST-16.
144700     MOVE WORK-AREA-16 TO EDIT-AREA-13  EDIT-AREA-14  EDIT-AREA-15
144800                          EDIT-AREA-16  EDIT-AREA-17.
144900     GO TO PICTURE-TEST-16-A.
145000 PICTURE-DELETE-16.
145100     PERFORM DE-LETE.
145200     PERFORM PRINT-DETAIL.
145300     GO TO PICTURE-INIT-17.
145400 PICTURE-TEST-16-A.
145500     IF EDIT-AREA-13 EQUAL TO "*000"
145600        PERFORM PASS
145700        PERFORM PRINT-DETAIL
145800        ELSE PERFORM FAIL
145900        MOVE EDIT-AREA-13 TO COMPUTED-A
146000        MOVE "*000" TO CORRECT-A
146100        PERFORM PRINT-DETAIL.
146200     ADD 1 TO REC-CT.
146300 PICTURE-TEST-16-B.
146400     IF EDIT-AREA-14 EQUAL TO "**00"
146500        PERFORM PASS
146600        PERFORM PRINT-DETAIL
146700        ELSE PERFORM FAIL
146800        MOVE EDIT-AREA-14 TO COMPUTED-A
146900        MOVE "**00" TO CORRECT-A
147000        PERFORM PRINT-DETAIL.
147100     ADD 1 TO REC-CT.
147200 PICTURE-TEST-16-C.
147300     IF EDIT-AREA-15 EQUAL TO "***0"
147400        PERFORM PASS
147500        PERFORM PRINT-DETAIL
147600        ELSE PERFORM FAIL
147700        MOVE EDIT-AREA-15 TO COMPUTED-A
147800        MOVE "***0" TO CORRECT-A
147900        PERFORM PRINT-DETAIL.
148000     ADD 1 TO REC-CT.
148100 PICTURE-TEST-16-D.
148200     IF EDIT-AREA-16 EQUAL TO "**.**"
148300        PERFORM PASS
148400        PERFORM PRINT-DETAIL
148500        ELSE PERFORM FAIL
148600        MOVE EDIT-AREA-16 TO COMPUTED-A
148700        MOVE "**.**" TO CORRECT-A
148800        PERFORM PRINT-DETAIL.
148900     ADD 1 TO REC-CT.
149000 PICTURE-TEST-16-E.
149100     IF EDIT-AREA-17 EQUAL TO "*****.**"
149200        PERFORM PASS
149300        PERFORM PRINT-DETAIL
149400        ELSE PERFORM FAIL
149500        MOVE EDIT-AREA-17 TO COMPUTED-A
149600        MOVE "*****.**" TO CORRECT-A
149700        PERFORM PRINT-DETAIL.
149800 PICTURE-INIT-17.
149900     MOVE "VI-31"           TO ANSI-REFERENCE.
150000     MOVE "PCTRE-TST-17" TO PAR-NAME.
150100     MOVE "PICTURE CHARACTER *" TO FEATURE.
150200     MOVE  13                   TO WORK-AREA-17.
150300     MOVE 1 TO REC-CT.
150400 PICTURE-TEST-17.
150500     MOVE WORK-AREA-17 TO EDIT-AREA-13  EDIT-AREA-14  EDIT-AREA-15
150600                          EDIT-AREA-16  EDIT-AREA-17.
150700     GO TO PICTURE-TEST-17-A.
150800 PICTURE-DELETE-17.
150900     PERFORM DE-LETE.
151000     PERFORM PRINT-DETAIL.
151100     GO TO PICTURE-INIT-18.
151200 PICTURE-TEST-17-A.
151300     IF EDIT-AREA-13 EQUAL TO "*013"
151400        PERFORM PASS
151500        PERFORM PRINT-DETAIL
151600        ELSE PERFORM FAIL
151700        MOVE EDIT-AREA-13 TO COMPUTED-A
151800        MOVE "*013" TO CORRECT-A
151900        PERFORM PRINT-DETAIL.
152000     ADD 1 TO REC-CT.
152100 PICTURE-TEST-17-B.
152200     IF EDIT-AREA-14 EQUAL TO "**13"
152300        PERFORM PASS
152400        PERFORM PRINT-DETAIL
152500        ELSE PERFORM FAIL
152600        MOVE EDIT-AREA-14 TO COMPUTED-A
152700        MOVE "**13" TO CORRECT-A
152800        PERFORM PRINT-DETAIL.
152900     ADD 1 TO REC-CT.
153000 PICTURE-TEST-17-C.
153100     IF EDIT-AREA-15 EQUAL TO "**13"
153200        PERFORM PASS
153300        PERFORM PRINT-DETAIL
153400        ELSE PERFORM FAIL
153500        MOVE EDIT-AREA-15 TO COMPUTED-A
153600        MOVE "**13" TO CORRECT-A
153700        PERFORM PRINT-DETAIL.
153800     ADD 1 TO REC-CT.
153900 PICTURE-TEST-17-D.
154000     IF EDIT-AREA-16 EQUAL TO "13.00"
154100        PERFORM PASS
154200        PERFORM PRINT-DETAIL
154300        ELSE PERFORM FAIL
154400        MOVE EDIT-AREA-16 TO COMPUTED-A
154500        MOVE "13.00" TO CORRECT-A
154600        PERFORM PRINT-DETAIL.
154700     ADD 1 TO REC-CT.
154800 PICTURE-TEST-17-E.
154900     IF EDIT-AREA-17 EQUAL TO "***13.00"
155000        PERFORM PASS
155100        PERFORM PRINT-DETAIL
155200        ELSE PERFORM FAIL
155300        MOVE EDIT-AREA-17 TO COMPUTED-A
155400        MOVE "***13.00" TO CORRECT-A
155500        PERFORM PRINT-DETAIL.
155600 PICTURE-INIT-18.
155700     MOVE "VI-31"           TO ANSI-REFERENCE.
155800     MOVE "PCTRE-TST-18" TO PAR-NAME.
155900     MOVE "PICTURE CHARACTER *" TO FEATURE.
156000     MOVE  123   TO WORK-AREA-18.
156100     MOVE 1 TO REC-CT.
156200 PICTURE-TEST-18.
156300     MOVE WORK-AREA-18 TO EDIT-AREA-13  EDIT-AREA-14  EDIT-AREA-15
156400                          EDIT-AREA-16  EDIT-AREA-17.
156500     GO TO PICTURE-TEST-18-A.
156600 PICTURE-DELETE-18.
156700     PERFORM DE-LETE.
156800     PERFORM PRINT-DETAIL.
156900     GO TO PICTURE-INIT-19.
157000 PICTURE-TEST-18-A.
157100     IF EDIT-AREA-13 EQUAL TO "*123"
157200        PERFORM PASS
157300        PERFORM PRINT-DETAIL
157400        ELSE PERFORM FAIL
157500        MOVE EDIT-AREA-13 TO COMPUTED-A
157600        MOVE "*123" TO CORRECT-A
157700        PERFORM PRINT-DETAIL.
157800     ADD 1 TO REC-CT.
157900 PICTURE-TEST-18-B.
158000     IF EDIT-AREA-14 EQUAL TO "*123"
158100        PERFORM PASS
158200        PERFORM PRINT-DETAIL
158300        ELSE PERFORM FAIL
158400        MOVE EDIT-AREA-14 TO COMPUTED-A
158500        MOVE "*123" TO CORRECT-A
158600        PERFORM PRINT-DETAIL.
158700     ADD 1 TO REC-CT.
158800 PICTURE-TEST-18-C.
158900     IF EDIT-AREA-15 EQUAL TO "*123"
159000        PERFORM PASS
159100        PERFORM PRINT-DETAIL
159200        ELSE PERFORM FAIL
159300        MOVE EDIT-AREA-15 TO COMPUTED-A
159400        MOVE "*123" TO CORRECT-A
159500        PERFORM PRINT-DETAIL.
159600     ADD 1 TO REC-CT.
159700 PICTURE-TEST-18-D.
159800     IF EDIT-AREA-16 EQUAL TO "23.00"
159900        PERFORM PASS
160000        PERFORM PRINT-DETAIL
160100        ELSE PERFORM FAIL
160200        MOVE EDIT-AREA-16 TO COMPUTED-A
160300        MOVE "23.00" TO CORRECT-A
160400        PERFORM PRINT-DETAIL.
160500     ADD 1 TO REC-CT.
160600 PICTURE-TEST-18-E.
160700     IF EDIT-AREA-17 EQUAL TO "**123.00"
160800        PERFORM PASS
160900        PERFORM PRINT-DETAIL
161000        ELSE PERFORM FAIL
161100        MOVE EDIT-AREA-17 TO COMPUTED-A
161200        MOVE "**123.00" TO CORRECT-A
161300        PERFORM PRINT-DETAIL.
161400 PICTURE-INIT-19.
161500     MOVE "VI-31"           TO ANSI-REFERENCE.
161600     MOVE "PCTRE-TST-19" TO PAR-NAME.
161700     MOVE "PICTURE CHARACTER *" TO FEATURE.
161800     MOVE  2010  TO WORK-AREA-19.
161900     MOVE 1 TO REC-CT.
162000 PICTURE-TEST-19.
162100     MOVE WORK-AREA-19 TO EDIT-AREA-13  EDIT-AREA-14  EDIT-AREA-15
162200                          EDIT-AREA-16  EDIT-AREA-17.
162300     GO TO PICTURE-TEST-19-A.
162400 PICTURE-DELETE-19.
162500     PERFORM DE-LETE.
162600     PERFORM PRINT-DETAIL.
162700     GO TO PICTURE-INIT-20.
162800 PICTURE-TEST-19-A.
162900     IF EDIT-AREA-13 EQUAL TO "2010"
163000        PERFORM PASS
163100        PERFORM PRINT-DETAIL
163200        ELSE PERFORM FAIL
163300        MOVE EDIT-AREA-13 TO COMPUTED-A
163400        MOVE "2010" TO CORRECT-A
163500        PERFORM PRINT-DETAIL.
163600     ADD 1 TO REC-CT.
163700 PICTURE-TEST-19-B.
163800     IF EDIT-AREA-14 EQUAL TO "2010"
163900        PERFORM PASS
164000        PERFORM PRINT-DETAIL
164100        ELSE PERFORM FAIL
164200        MOVE EDIT-AREA-14 TO COMPUTED-A
164300        MOVE "2010" TO CORRECT-A
164400        PERFORM PRINT-DETAIL.
164500     ADD 1 TO REC-CT.
164600 PICTURE-TEST-19-C.
164700     IF EDIT-AREA-15 EQUAL TO "2010"
164800        PERFORM PASS
164900        PERFORM PRINT-DETAIL
165000        ELSE PERFORM FAIL
165100        MOVE EDIT-AREA-15 TO COMPUTED-A
165200        MOVE "2010" TO CORRECT-A
165300        PERFORM PRINT-DETAIL.
165400     ADD 1 TO REC-CT.
165500 PICTURE-TEST-19-D.
165600     IF EDIT-AREA-16 EQUAL TO "10.00"
165700        PERFORM PASS
165800        PERFORM PRINT-DETAIL
165900        ELSE PERFORM FAIL
166000        MOVE EDIT-AREA-16 TO COMPUTED-A
166100        MOVE "10.00" TO CORRECT-A
166200        PERFORM PRINT-DETAIL.
166300     ADD 1 TO REC-CT.
166400 PICTURE-TEST-19-E.
166500     IF EDIT-AREA-17 EQUAL TO "2,010.00"
166600        PERFORM PASS
166700        PERFORM PRINT-DETAIL
166800        ELSE PERFORM FAIL
166900        MOVE EDIT-AREA-17 TO COMPUTED-A
167000        MOVE "2,010.00" TO CORRECT-A
167100        PERFORM PRINT-DETAIL.
167200 PICTURE-INIT-20.
167300     MOVE "VI-31"           TO ANSI-REFERENCE.
167400     MOVE "PCTRE-TST-20" TO PAR-NAME.
167500     MOVE "PICTURE CHARACTER *" TO FEATURE.
167600     MOVE 1 TO REC-CT.
167700     MOVE  1010.2 TO WORK-AREA-20.
167800 PICTURE-TEST-20.
167900     MOVE WORK-AREA-20 TO EDIT-AREA-13  EDIT-AREA-14  EDIT-AREA-15
168000                          EDIT-AREA-16  EDIT-AREA-17.
168100     GO TO PICTURE-TEST-20-A.
168200 PICTURE-DELETE-20.
168300     PERFORM DE-LETE.
168400     PERFORM PRINT-DETAIL.
168500     GO TO PICTURE-INIT-21.
168600 PICTURE-TEST-20-A.
168700     IF EDIT-AREA-13 EQUAL TO "1010"
168800        PERFORM PASS
168900        PERFORM PRINT-DETAIL
169000        ELSE PERFORM FAIL
169100        MOVE EDIT-AREA-13 TO COMPUTED-A
169200        MOVE "1010" TO CORRECT-A
169300        PERFORM PRINT-DETAIL.
169400     ADD 1 TO REC-CT.
169500 PICTURE-TEST-20-B.
169600     IF EDIT-AREA-14 EQUAL TO "1010"
169700        PERFORM PASS
169800        PERFORM PRINT-DETAIL
169900        ELSE PERFORM FAIL
170000        MOVE EDIT-AREA-14 TO COMPUTED-A
170100        MOVE "1010" TO CORRECT-A
170200        PERFORM PRINT-DETAIL.
170300     ADD 1 TO REC-CT.
170400 PICTURE-TEST-20-C.
170500     IF EDIT-AREA-15 EQUAL TO "1010"
170600        PERFORM PASS
170700        PERFORM PRINT-DETAIL
170800        ELSE PERFORM FAIL
170900        MOVE EDIT-AREA-15 TO COMPUTED-A
171000        MOVE "1010" TO CORRECT-A
171100        PERFORM PRINT-DETAIL.
171200     ADD 1 TO REC-CT.
171300 PICTURE-TEST-20-D.
171400     IF EDIT-AREA-16 EQUAL TO "10.20"
171500        PERFORM PASS
171600        PERFORM PRINT-DETAIL
171700        ELSE PERFORM FAIL
171800        MOVE EDIT-AREA-16 TO COMPUTED-A
171900        MOVE "10.20" TO CORRECT-A
172000        PERFORM PRINT-DETAIL.
172100     ADD 1 TO REC-CT.
172200 PICTURE-TEST-20-E.
172300     IF EDIT-AREA-17 EQUAL TO "1,010.20"
172400        PERFORM PASS
172500        PERFORM PRINT-DETAIL
172600        ELSE PERFORM FAIL
172700        MOVE EDIT-AREA-17 TO COMPUTED-A
172800        MOVE "1,010.20" TO CORRECT-A
172900        PERFORM PRINT-DETAIL.
173000 PICTURE-INIT-21.
173100     MOVE "VI-31"           TO ANSI-REFERENCE.
173200     MOVE "PCTRE-TST-21" TO PAR-NAME.
173300     MOVE "PICTURE CHARACTER *" TO FEATURE.
173400     MOVE  .01    TO WORK-AREA-21.
173500     MOVE 1 TO REC-CT.
173600 PICTURE-TEST-21.
173700     MOVE WORK-AREA-21 TO EDIT-AREA-13  EDIT-AREA-14  EDIT-AREA-15
173800                          EDIT-AREA-16  EDIT-AREA-17.
173900     GO TO PICTURE-TEST-21-A.
174000 PICTURE-DELETE-21.
174100     PERFORM DE-LETE.
174200     PERFORM PRINT-DETAIL.
174300     GO TO PICTURE-INIT-22.
174400 PICTURE-TEST-21-A.
174500     IF EDIT-AREA-13 EQUAL TO "*000"
174600        PERFORM PASS
174700        PERFORM PRINT-DETAIL
174800        ELSE PERFORM FAIL
174900        MOVE EDIT-AREA-13 TO COMPUTED-A
175000        MOVE "*000" TO CORRECT-A
175100        PERFORM PRINT-DETAIL.
175200     ADD 1 TO REC-CT.
175300 PICTURE-TEST-21-B.
175400     IF EDIT-AREA-14 EQUAL TO "**00"
175500        PERFORM PASS
175600        PERFORM PRINT-DETAIL
175700        ELSE PERFORM FAIL
175800        MOVE EDIT-AREA-14 TO COMPUTED-A
175900        MOVE "**00" TO CORRECT-A
176000        PERFORM PRINT-DETAIL.
176100     ADD 1 TO REC-CT.
176200 PICTURE-TEST-21-C.
176300     IF EDIT-AREA-15 EQUAL TO "***0"
176400        PERFORM PASS
176500        PERFORM PRINT-DETAIL
176600        ELSE PERFORM FAIL
176700        MOVE EDIT-AREA-15 TO COMPUTED-A
176800        MOVE "***0" TO CORRECT-A
176900        PERFORM PRINT-DETAIL.
177000     ADD 1 TO REC-CT.
177100 PICTURE-TEST-21-D.
177200     IF EDIT-AREA-16 EQUAL TO "**.01"
177300        PERFORM PASS
177400        PERFORM PRINT-DETAIL
177500        ELSE PERFORM FAIL
177600        MOVE EDIT-AREA-16 TO COMPUTED-A
177700        MOVE "**.01" TO CORRECT-A
177800        PERFORM PRINT-DETAIL.
177900     ADD 1 TO REC-CT.
178000 PICTURE-TEST-21-E.
178100     IF EDIT-AREA-17 EQUAL TO "*****.01"
178200        PERFORM PASS
178300        PERFORM PRINT-DETAIL
178400        ELSE PERFORM FAIL
178500        MOVE EDIT-AREA-17 TO COMPUTED-A
178600        MOVE "*****.01" TO CORRECT-A
178700        PERFORM PRINT-DETAIL.
178800 PICTURE-INIT-22.
178900     MOVE "VI-31"           TO ANSI-REFERENCE.
179000     MOVE "PCTRE-TST-22" TO PAR-NAME.
179100     MOVE "PICTURE CHARACTER Z" TO FEATURE.
179200     MOVE  0      TO WORK-AREA-22.
179300     MOVE 1 TO REC-CT.
179400 PICTURE-TEST-22.
179500     MOVE WORK-AREA-22 TO EDIT-AREA-18  EDIT-AREA-19  EDIT-AREA-20
179600                          EDIT-AREA-21  EDIT-AREA-22  EDIT-AREA-23
179700                          EDIT-AREA-24.
179800     GO TO PICTURE-TEST-22-A.
179900 PICTURE-DELETE-22.
180000     PERFORM DE-LETE.
180100     PERFORM PRINT-DETAIL.
180200     GO TO PICTURE-INIT-23.
180300 PICTURE-TEST-22-A.
180400     IF EDIT-AREA-18 EQUAL TO "0000"
180500        PERFORM PASS
180600        PERFORM PRINT-DETAIL
180700        ELSE PERFORM FAIL
180800        MOVE EDIT-AREA-18 TO COMPUTED-A
180900        MOVE "0000" TO CORRECT-A
181000        PERFORM PRINT-DETAIL.
181100     ADD 1 TO REC-CT.
181200 PICTURE-TEST-22-B.
181300     IF EDIT-AREA-19 EQUAL TO " 000"
181400        PERFORM PASS
181500        PERFORM PRINT-DETAIL
181600        ELSE PERFORM FAIL
181700        MOVE EDIT-AREA-19 TO COMPUTED-A
181800        MOVE " 000" TO CORRECT-A
181900        PERFORM PRINT-DETAIL.
182000     ADD 1 TO REC-CT.
182100 PICTURE-TEST-22-C.
182200     IF EDIT-AREA-20 EQUAL TO "  00"
182300        PERFORM PASS
182400        PERFORM PRINT-DETAIL
182500        ELSE PERFORM FAIL
182600        MOVE EDIT-AREA-20 TO COMPUTED-A
182700        MOVE "  00" TO CORRECT-A
182800        PERFORM PRINT-DETAIL.
182900     ADD 1 TO REC-CT.
183000 PICTURE-TEST-22-D.
183100     IF EDIT-AREA-21 EQUAL TO "   0"
183200        PERFORM PASS
183300        PERFORM PRINT-DETAIL
183400        ELSE PERFORM FAIL
183500        MOVE EDIT-AREA-21 TO COMPUTED-A
183600        MOVE "   0" TO CORRECT-A
183700        PERFORM PRINT-DETAIL.
183800     ADD 1 TO REC-CT.
183900 PICTURE-TEST-22-E.
184000     IF EDIT-AREA-22 EQUAL TO "    "
184100        PERFORM PASS
184200        PERFORM PRINT-DETAIL
184300        ELSE PERFORM FAIL
184400        MOVE EDIT-AREA-22 TO COMPUTED-A
184500        MOVE "SPACES" TO CORRECT-A
184600        PERFORM PRINT-DETAIL.
184700     ADD 1 TO REC-CT.
184800 PICTURE-TEST-22-F.
184900     IF EDIT-AREA-23 EQUAL TO "     "
185000        PERFORM PASS
185100        PERFORM PRINT-DETAIL
185200        ELSE PERFORM FAIL
185300        MOVE EDIT-AREA-23 TO COMPUTED-A
185400        MOVE "SPACES" TO CORRECT-A
185500        PERFORM PRINT-DETAIL.
185600     ADD 1 TO REC-CT.
185700 PICTURE-TEST-22-G.
185800     IF EDIT-AREA-24 EQUAL TO "     "
185900        PERFORM PASS
186000        PERFORM PRINT-DETAIL
186100        ELSE PERFORM FAIL
186200        MOVE EDIT-AREA-24 TO COMPUTED-A
186300        MOVE "SPACES" TO CORRECT-A
186400        PERFORM PRINT-DETAIL.
186500 PICTURE-INIT-23.
186600     MOVE "VI-31"           TO ANSI-REFERENCE.
186700     MOVE "PCTRE-TST-23" TO PAR-NAME.
186800     MOVE "PICTURE CHARACTER Z" TO FEATURE.
186900     MOVE  1.01   TO WORK-AREA-23.
187000     MOVE 1 TO REC-CT.
187100 PICTURE-TEST-23.
187200     MOVE WORK-AREA-23 TO EDIT-AREA-18  EDIT-AREA-19  EDIT-AREA-20
187300                          EDIT-AREA-21  EDIT-AREA-22  EDIT-AREA-23
187400                          EDIT-AREA-24.
187500     GO TO PICTURE-TEST-23-A.
187600 PICTURE-DELETE-23.
187700     PERFORM DE-LETE.
187800     PERFORM PRINT-DETAIL.
187900     GO TO PICTURE-INIT-24.
188000 PICTURE-TEST-23-A.
188100     IF EDIT-AREA-18 EQUAL TO "0001"
188200        PERFORM PASS
188300        PERFORM PRINT-DETAIL
188400        ELSE PERFORM FAIL
188500        MOVE EDIT-AREA-18 TO COMPUTED-A
188600        MOVE "0001" TO CORRECT-A
188700        PERFORM PRINT-DETAIL.
188800     ADD 1 TO REC-CT.
188900 PICTURE-TEST-23-B.
189000     IF EDIT-AREA-19 EQUAL TO " 001"
189100        PERFORM PASS
189200        PERFORM PRINT-DETAIL
189300        ELSE PERFORM FAIL
189400        MOVE EDIT-AREA-19 TO COMPUTED-A
189500        MOVE " 001" TO CORRECT-A
189600        PERFORM PRINT-DETAIL.
189700     ADD 1 TO REC-CT.
189800 PICTURE-TEST-23-C.
189900     IF EDIT-AREA-20 EQUAL TO "  01"
190000        PERFORM PASS
190100        PERFORM PRINT-DETAIL
190200        ELSE PERFORM FAIL
190300        MOVE EDIT-AREA-20 TO COMPUTED-A
190400        MOVE "  01" TO CORRECT-A
190500        PERFORM PRINT-DETAIL.
190600     ADD 1 TO REC-CT.
190700 PICTURE-TEST-23-D.
190800     IF EDIT-AREA-21 EQUAL TO "   1"
190900        PERFORM PASS
191000        PERFORM PRINT-DETAIL
191100        ELSE PERFORM FAIL
191200        MOVE EDIT-AREA-21 TO COMPUTED-A
191300        MOVE "   1" TO CORRECT-A
191400        PERFORM PRINT-DETAIL.
191500     ADD 1 TO REC-CT.
191600 PICTURE-TEST-23-E.
191700     IF EDIT-AREA-22 EQUAL TO "   1"
191800        PERFORM PASS
191900        PERFORM PRINT-DETAIL
192000        ELSE PERFORM FAIL
192100        MOVE EDIT-AREA-22 TO COMPUTED-A
192200        MOVE "   1" TO CORRECT-A
192300        PERFORM PRINT-DETAIL.
192400     ADD 1 TO REC-CT.
192500 PICTURE-TEST-23-F.
192600     IF EDIT-AREA-23 EQUAL TO " 1.01"
192700        PERFORM PASS
192800        PERFORM PRINT-DETAIL
192900        ELSE PERFORM FAIL
193000        MOVE EDIT-AREA-23 TO COMPUTED-A
193100        MOVE " 1.01" TO CORRECT-A
193200        PERFORM PRINT-DETAIL.
193300     ADD 1 TO REC-CT.
193400 PICTURE-TEST-23-G.
193500     IF EDIT-AREA-24 EQUAL TO "    1"
193600        PERFORM PASS
193700        PERFORM PRINT-DETAIL
193800        ELSE PERFORM FAIL
193900        MOVE EDIT-AREA-24 TO COMPUTED-A
194000        MOVE "    1" TO CORRECT-A
194100        PERFORM PRINT-DETAIL.
194200 PICTURE-INIT-24.
194300     MOVE "VI-31"           TO ANSI-REFERENCE.
194400     MOVE "PCTRE-TST-24" TO PAR-NAME.
194500     MOVE "PICTURE CHARACTER Z" TO FEATURE.
194600     MOVE  217    TO WORK-AREA-24.
194700     MOVE 1 TO REC-CT.
194800 PICTURE-TEST-24.
194900     MOVE WORK-AREA-24 TO EDIT-AREA-18  EDIT-AREA-19  EDIT-AREA-20
195000                          EDIT-AREA-21  EDIT-AREA-22  EDIT-AREA-23
195100                          EDIT-AREA-24.
195200     GO TO PICTURE-TEST-24-A.
195300 PICTURE-DELETE-24.
195400     PERFORM DE-LETE.
195500     PERFORM PRINT-DETAIL.
195600     GO TO PICTURE-INIT-25.
195700 PICTURE-TEST-24-A.
195800     IF EDIT-AREA-18 EQUAL TO "0217"
195900        PERFORM PASS
196000        PERFORM PRINT-DETAIL
196100        ELSE PERFORM FAIL
196200        MOVE EDIT-AREA-18 TO COMPUTED-A
196300        MOVE "0217" TO CORRECT-A
196400        PERFORM PRINT-DETAIL.
196500     ADD 1 TO REC-CT.
196600 PICTURE-TEST-24-B.
196700     IF EDIT-AREA-19 EQUAL TO " 217"
196800        PERFORM PASS
196900        PERFORM PRINT-DETAIL
197000        ELSE PERFORM FAIL
197100        MOVE EDIT-AREA-19 TO COMPUTED-A
197200        MOVE " 217" TO CORRECT-A
197300        PERFORM PRINT-DETAIL.
197400     ADD 1 TO REC-CT.
197500 PICTURE-TEST-24-C.
197600     IF EDIT-AREA-20 EQUAL TO " 217"
197700        PERFORM PASS
197800        PERFORM PRINT-DETAIL
197900        ELSE PERFORM FAIL
198000        MOVE EDIT-AREA-20 TO COMPUTED-A
198100        MOVE " 217" TO CORRECT-A
198200        PERFORM PRINT-DETAIL.
198300     ADD 1 TO REC-CT.
198400 PICTURE-TEST-24-D.
198500     IF EDIT-AREA-21 EQUAL TO " 217"
198600        PERFORM PASS
198700        PERFORM PRINT-DETAIL
198800        ELSE PERFORM FAIL
198900        MOVE EDIT-AREA-21 TO COMPUTED-A
199000        MOVE " 217" TO CORRECT-A
199100        PERFORM PRINT-DETAIL.
199200     ADD 1 TO REC-CT.
199300 PICTURE-TEST-24-E.
199400     IF EDIT-AREA-22 EQUAL TO " 217"
199500        PERFORM PASS
199600        PERFORM PRINT-DETAIL
199700        ELSE PERFORM FAIL
199800        MOVE EDIT-AREA-22 TO COMPUTED-A
199900        MOVE " 217" TO CORRECT-A
200000        PERFORM PRINT-DETAIL.
200100     ADD 1 TO REC-CT.
200200 PICTURE-TEST-24-F.
200300     IF EDIT-AREA-23 EQUAL TO "17.00"
200400        PERFORM PASS
200500        PERFORM PRINT-DETAIL
200600        ELSE PERFORM FAIL
200700        MOVE EDIT-AREA-23 TO COMPUTED-A
200800        MOVE "17.00" TO CORRECT-A
200900        PERFORM PRINT-DETAIL.
201000     ADD 1 TO REC-CT.
201100 PICTURE-TEST-24-G.
201200     IF EDIT-AREA-24 EQUAL TO "  217"
201300        PERFORM PASS
201400        PERFORM PRINT-DETAIL
201500        ELSE PERFORM FAIL
201600        MOVE EDIT-AREA-24 TO COMPUTED-A
201700        MOVE "  217" TO CORRECT-A
201800        PERFORM PRINT-DETAIL.
201900 PICTURE-INIT-25.
202000     MOVE "VI-31"           TO ANSI-REFERENCE.
202100     MOVE "PCTRE-TST-25" TO PAR-NAME.
202200     MOVE "PICTURE CHARACTER Z" TO FEATURE.
202300     MOVE  1010.20 TO WORK-AREA-25.
202400     MOVE 1 TO REC-CT.
202500 PICTURE-TEST-25.
202600     MOVE WORK-AREA-25 TO EDIT-AREA-18  EDIT-AREA-19  EDIT-AREA-20
202700                          EDIT-AREA-21  EDIT-AREA-22  EDIT-AREA-23
202800                          EDIT-AREA-24.
202900     GO TO PICTURE-TEST-25-A.
203000 PICTURE-DELETE-25.
203100     PERFORM DE-LETE.
203200     PERFORM PRINT-DETAIL.
203300     GO TO PICTURE-INIT-26.
203400 PICTURE-TEST-25-A.
203500     IF EDIT-AREA-18 EQUAL TO "1010"
203600        PERFORM PASS
203700        PERFORM PRINT-DETAIL
203800        ELSE PERFORM FAIL
203900        MOVE EDIT-AREA-18 TO COMPUTED-A
204000        MOVE "1010" TO CORRECT-A
204100        PERFORM PRINT-DETAIL.
204200     ADD 1 TO REC-CT.
204300 PICTURE-TEST-25-B.
204400     IF EDIT-AREA-19 EQUAL TO "1010"
204500        PERFORM PASS
204600        PERFORM PRINT-DETAIL
204700        ELSE PERFORM FAIL
204800        MOVE EDIT-AREA-19 TO COMPUTED-A
204900        MOVE "1010" TO CORRECT-A
205000        PERFORM PRINT-DETAIL.
205100     ADD 1 TO REC-CT.
205200 PICTURE-TEST-25-C.
205300     IF EDIT-AREA-20 EQUAL TO "1010"
205400        PERFORM PASS
205500        PERFORM PRINT-DETAIL
205600        ELSE PERFORM FAIL
205700        MOVE EDIT-AREA-20 TO COMPUTED-A
205800        MOVE "1010" TO CORRECT-A
205900        PERFORM PRINT-DETAIL.
206000     ADD 1 TO REC-CT.
206100 PICTURE-TEST-25-D.
206200     IF EDIT-AREA-21 EQUAL TO "1010"
206300        PERFORM PASS
206400        PERFORM PRINT-DETAIL
206500        ELSE PERFORM FAIL
206600        MOVE EDIT-AREA-21 TO COMPUTED-A
206700        MOVE "1010" TO CORRECT-A
206800        PERFORM PRINT-DETAIL.
206900     ADD 1 TO REC-CT.
207000 PICTURE-TEST-25-E.
207100     IF EDIT-AREA-22 EQUAL TO "1010"
207200        PERFORM PASS
207300        PERFORM PRINT-DETAIL
207400        ELSE PERFORM FAIL
207500        MOVE EDIT-AREA-22 TO COMPUTED-A
207600        MOVE "1010" TO CORRECT-A
207700        PERFORM PRINT-DETAIL.
207800     ADD 1 TO REC-CT.
207900 PICTURE-TEST-25-F.
208000     IF EDIT-AREA-23 EQUAL TO "10.20"
208100        PERFORM PASS
208200        PERFORM PRINT-DETAIL
208300        ELSE PERFORM FAIL
208400        MOVE EDIT-AREA-23 TO COMPUTED-A
208500        MOVE "10.20" TO CORRECT-A
208600        PERFORM PRINT-DETAIL.
208700     ADD 1 TO REC-CT.
208800 PICTURE-TEST-25-G.
208900     IF EDIT-AREA-24 EQUAL TO "1,010"
209000        PERFORM PASS
209100        PERFORM PRINT-DETAIL
209200        ELSE PERFORM FAIL
209300        MOVE EDIT-AREA-24 TO COMPUTED-A
209400        MOVE "1,010" TO CORRECT-A
209500        PERFORM PRINT-DETAIL.
209600 PICTURE-INIT-26.
209700     MOVE "VI-31"           TO ANSI-REFERENCE.
209800     MOVE "PCTRE-TST-26" TO PAR-NAME.
209900     MOVE "PICTURE CHARACTER Z" TO FEATURE.
210000     MOVE  .01     TO WORK-AREA-26.
210100     MOVE 1 TO REC-CT.
210200 PICTURE-TEST-26.
210300     MOVE WORK-AREA-26 TO EDIT-AREA-18  EDIT-AREA-19  EDIT-AREA-20
210400                          EDIT-AREA-21  EDIT-AREA-22  EDIT-AREA-23
210500                          EDIT-AREA-24.
210600     GO TO PICTURE-TEST-26-A.
210700 PICTURE-DELETE-26.
210800     PERFORM DE-LETE.
210900     PERFORM PRINT-DETAIL.
211000     GO TO PICTURE-INIT-27.
211100 PICTURE-TEST-26-A.
211200     IF EDIT-AREA-18 EQUAL TO "0000"
211300        PERFORM PASS
211400        PERFORM PRINT-DETAIL
211500        ELSE PERFORM FAIL
211600        MOVE EDIT-AREA-18 TO COMPUTED-A
211700        MOVE "0000" TO CORRECT-A
211800        PERFORM PRINT-DETAIL.
211900     ADD 1 TO REC-CT.
212000 PICTURE-TEST-26-B.
212100     IF EDIT-AREA-19 EQUAL TO " 000"
212200        PERFORM PASS
212300        PERFORM PRINT-DETAIL
212400        ELSE PERFORM FAIL
212500        MOVE EDIT-AREA-19 TO COMPUTED-A
212600        MOVE " 000" TO CORRECT-A
212700        PERFORM PRINT-DETAIL.
212800     ADD 1 TO REC-CT.
212900 PICTURE-TEST-26-C.
213000     IF EDIT-AREA-20 EQUAL TO "  00"
213100        PERFORM PASS
213200        PERFORM PRINT-DETAIL
213300        ELSE PERFORM FAIL
213400        MOVE EDIT-AREA-20 TO COMPUTED-A
213500        MOVE "  00" TO CORRECT-A
213600        PERFORM PRINT-DETAIL.
213700     ADD 1 TO REC-CT.
213800     IF EDIT-AREA-21 EQUAL TO "   0"
213900        PERFORM PASS
214000        PERFORM PRINT-DETAIL
214100        ELSE PERFORM FAIL
214200        MOVE EDIT-AREA-21 TO COMPUTED-A
214300        MOVE "   0" TO CORRECT-A
214400        PERFORM PRINT-DETAIL.
214500     ADD 1 TO REC-CT.
214600 PICTURE-TEST-26-E.
214700     IF EDIT-AREA-22 EQUAL TO "    "
214800        PERFORM PASS
214900        PERFORM PRINT-DETAIL
215000        ELSE PERFORM FAIL
215100        MOVE EDIT-AREA-22 TO COMPUTED-A
215200        MOVE "SPACES" TO CORRECT-A
215300        PERFORM PRINT-DETAIL.
215400     ADD 1 TO REC-CT.
215500 PICTURE-TEST-26-F.
215600     IF EDIT-AREA-23 EQUAL TO "  .01"
215700        PERFORM PASS
215800        PERFORM PRINT-DETAIL
215900        ELSE PERFORM FAIL
216000        MOVE EDIT-AREA-23 TO COMPUTED-A
216100        MOVE "  .01" TO CORRECT-A
216200        PERFORM PRINT-DETAIL.
216300     ADD 1 TO REC-CT.
216400 PICTURE-TEST-26-G.
216500     IF EDIT-AREA-24 EQUAL TO "     "
216600        PERFORM PASS
216700        PERFORM PRINT-DETAIL
216800        ELSE PERFORM FAIL
216900        MOVE EDIT-AREA-24 TO COMPUTED-A
217000        MOVE "SPACES" TO CORRECT-A
217100        PERFORM PRINT-DETAIL.
217200 PICTURE-INIT-27.
217300     MOVE "VI-31"           TO ANSI-REFERENCE.
217400     MOVE ZERO TO REC-CT.
217500     MOVE  200     TO WORK-AREA-27.
217600     MOVE  SPACE   TO WORK-AREA-27A.
217700     MOVE "PICTURE CHARACTER P" TO FEATURE.
217800 PICTURE-TEST-27-0.
217900     MOVE WORK-AREA-27 TO WORK-AREA-27A.
218000 PICTURE-TEST-27-1.
218100     IF WORK-AREA-27A EQUAL TO "200"
218200        PERFORM PASS
218300        ELSE GO TO PICTURE-FAIL-27.
218400     GO TO PICTURE-WRITE-27.
218500 PICTURE-DELETE-27.
218600     PERFORM DE-LETE.
218700     GO TO PICTURE-WRITE-27.
218800 PICTURE-FAIL-27.
218900     PERFORM FAIL.
219000     MOVE WORK-AREA-27A TO COMPUTED-A.
219100     MOVE "200" TO CORRECT-A.
219200 PICTURE-WRITE-27.
219300     MOVE "PICTURE-TEST-27" TO PAR-NAME.
219400     PERFORM PRINT-DETAIL.
219500 PICTURE-INIT-28.
219600     MOVE "VI-31"           TO ANSI-REFERENCE.
219700     MOVE "PICTURE CHARACTER P" TO FEATURE.
219800     MOVE  567     TO WORK-AREA-28.
219900     MOVE  ZERO    TO WORK-AREA-28A.
220000 PICTURE-TEST-28-0.
220100     MOVE WORK-AREA-28 TO WORK-AREA-28A.
220200 PICTURE-TEST-28-1.
220300     IF WORK-AREA-28A EQUAL TO 500
220400        PERFORM PASS
220500        ELSE GO TO PICTURE-FAIL-28.
220600     GO TO PICTURE-WRITE-28.
220700 PICTURE-DELETE-28.
220800     PERFORM DE-LETE.
220900     GO TO PICTURE-WRITE-28.
221000 PICTURE-FAIL-28.
221100     PERFORM FAIL.
221200     MOVE WORK-AREA-28A TO COMPUTED-A.
221300     MOVE 500 TO CORRECT-18V0.
221400 PICTURE-WRITE-28.
221500     MOVE "PICTURE-TEST-28" TO PAR-NAME.
221600     PERFORM PRINT-DETAIL.
221700 PICTURE-INIT-29.
221800     MOVE "VI-31"           TO ANSI-REFERENCE.
221900     MOVE "PICTURE CHARACTER P" TO FEATURE.
222000     MOVE  123     TO WORK-AREA-29.
222100     MOVE  ZERO    TO WORK-AREA-29A.
222200     MOVE  SPACE   TO WORK-AREA-29B.
222300 PICTURE-TEST-29.
222400     MOVE WORK-AREA-29 TO WORK-AREA-29A.
222500     MOVE WORK-AREA-29A TO WORK-AREA-29B.
222600     IF WORK-AREA-29B EQUAL TO "100"
222700        PERFORM PASS
222800        ELSE GO TO PICTURE-FAIL-29.
222900     GO TO PICTURE-WRITE-29.
223000 PICTURE-DELETE-29.
223100     PERFORM DE-LETE.
223200     GO TO PICTURE-WRITE-29.
223300 PICTURE-FAIL-29.
223400     PERFORM FAIL.
223500     MOVE WORK-AREA-29B TO COMPUTED-A.
223600     MOVE "100" TO CORRECT-A.
223700 PICTURE-WRITE-29.
223800     MOVE "PICTURE-TEST-29" TO PAR-NAME.
223900     PERFORM PRINT-DETAIL.
224000 PICTURE-INIT-30.
224100     MOVE "VI-31"           TO ANSI-REFERENCE.
224200     MOVE "PICTURE CHARACTER P" TO FEATURE.
224300     MOVE  00900   TO WORK-AREA-30.
224400     MOVE  ZERO    TO WORK-AREA-30A.
224500 PICTURE-TEST-30-0.
224600     MOVE WORK-AREA-30 TO WORK-AREA-30A.
224700 PICTURE-TEST-30-1.
224800     IF WORK-AREA-30A EQUAL TO "  9"
224900        PERFORM PASS
225000        ELSE GO TO PICTURE-FAIL-30.
225100     GO TO PICTURE-WRITE-30.
225200 PICTURE-DELETE-30.
225300     PERFORM DE-LETE.
225400     GO TO PICTURE-WRITE-30.
225500 PICTURE-FAIL-30.
225600     PERFORM FAIL.
225700     MOVE WORK-AREA-30A TO COMPUTED-A.
225800     MOVE "  9" TO CORRECT-A.
225900 PICTURE-WRITE-30.
226000     MOVE "PICTURE-TEST-30" TO PAR-NAME.
226100     PERFORM PRINT-DETAIL.
226200 PICTURE-INIT-31.
226300     MOVE "VI-31"           TO ANSI-REFERENCE.
226400     MOVE "PICTURE CHARACTER P" TO FEATURE.
226500     MOVE  01200   TO WORK-AREA-31.
226600     MOVE  ZERO    TO WORK-AREA-31A.
226700     MOVE  SPACE   TO WORK-AREA-31B.
226800 PICTURE-TEST-31.
226900     MOVE WORK-AREA-31 TO WORK-AREA-31A.
227000     MOVE WORK-AREA-31A TO WORK-AREA-31B.
227100     IF WORK-AREA-31B EQUAL TO " 12  "
227200        PERFORM PASS
227300        ELSE GO TO PICTURE-FAIL-31.
227400     GO TO PICTURE-WRITE-31.
227500 PICTURE-DELETE-31.
227600     PERFORM DE-LETE.
227700     GO TO PICTURE-WRITE-31.
227800 PICTURE-FAIL-31.
227900     PERFORM FAIL.
228000     MOVE WORK-AREA-31B TO COMPUTED-A.
228100     MOVE " 12  " TO CORRECT-A.
228200 PICTURE-WRITE-31.
228300     MOVE "PICTURE-TEST-31" TO PAR-NAME.
228400     PERFORM PRINT-DETAIL.
228500 PICTURE-INIT-32.
228600     MOVE "VI-31"           TO ANSI-REFERENCE.
228700     MOVE "PICTURE CHARACTER P" TO FEATURE.
228800     MOVE  .001    TO WORK-AREA-32.
228900     MOVE  ZERO    TO WORK-AREA-32A.
229000 PICTURE-TEST-32-0.
229100     MOVE WORK-AREA-32 TO WORK-AREA-32A.
229200 PICTURE-TEST-32-1.
229300     IF WORK-AREA-32A EQUAL TO .001
229400        PERFORM PASS
229500        ELSE GO TO PICTURE-FAIL-32.
229600     GO TO PICTURE-WRITE-32.
229700 PICTURE-DELETE-32.
229800     PERFORM DE-LETE.
229900     GO TO PICTURE-WRITE-32.
230000 PICTURE-FAIL-32.
230100     PERFORM FAIL.
230200     MOVE WORK-AREA-32A TO COMPUTED-0V18.
230300     MOVE .001 TO CORRECT-0V18.
230400 PICTURE-WRITE-32.
230500     MOVE "PICTURE-TEST-32" TO PAR-NAME.
230600     PERFORM PRINT-DETAIL.
230700 PICTURE-INIT-33.
230800     MOVE "VI-31"           TO ANSI-REFERENCE.
230900     MOVE "PICTURE CHARACTER P" TO FEATURE.
231000     MOVE  .567    TO WORK-AREA-33.
231100     MOVE  ZERO    TO WORK-AREA-33A.
231200 PICTURE-TEST-33-0.
231300     MOVE WORK-AREA-33 TO WORK-AREA-33A.
231400 PICTURE-TEST-33-1.
231500     IF WORK-AREA-33A EQUAL TO .007
231600        PERFORM PASS
231700        ELSE GO TO PICTURE-FAIL-33.
231800     GO TO PICTURE-WRITE-33.
231900 PICTURE-DELETE-33.
232000     PERFORM DE-LETE.
232100     GO TO PICTURE-WRITE-33.
232200 PICTURE-FAIL-33.
232300     PERFORM FAIL.
232400     MOVE WORK-AREA-33A TO COMPUTED-0V18.
232500     MOVE .007 TO CORRECT-0V18.
232600 PICTURE-WRITE-33.
232700     MOVE "PICTURE-TEST-33" TO PAR-NAME.
232800     PERFORM PRINT-DETAIL.
232900 PICTURE-INIT-34.
233000     MOVE "VI-31"           TO ANSI-REFERENCE.
233100     MOVE "PICTURE CHARACTER P" TO FEATURE.
233200     MOVE  .123    TO WORK-AREA-34.
233300     MOVE  ZERO    TO WORK-AREA-34A.
233400     MOVE  ZERO    TO WORK-AREA-34B.
233500 PICTURE-TEST-34.
233600     MOVE WORK-AREA-34 TO WORK-AREA-34A.
233700     MOVE WORK-AREA-34A TO WORK-AREA-34B.
233800     IF WORK-AREA-34B EQUAL TO .003
233900        PERFORM PASS
234000        ELSE GO TO PICTURE-FAIL-34.
234100     GO TO PICTURE-WRITE-34.
234200 PICTURE-DELETE-34.
234300     PERFORM DE-LETE.
234400     GO TO PICTURE-WRITE-34.
234500 PICTURE-FAIL-34.
234600     PERFORM FAIL.
234700     MOVE WORK-AREA-34B TO COMPUTED-0V18.
234800     MOVE .003 TO CORRECT-0V18.
234900 PICTURE-WRITE-34.
235000     MOVE "PICTURE-TEST-34" TO PAR-NAME.
235100     PERFORM PRINT-DETAIL.
235200 CCVS-EXIT SECTION.
235300 CCVS-999999.
235400     GO TO CLOSE-FILES.
