000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC120A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC120A TESTS THE USE OF THE "SIGN" CLAUSE WITH
002300*    FORMATS 1 AND 2 OF THE MULTIPLY STATEMENT.
002400*    ALL COMBINATIONS OF THE SIGN CLAUSE ARE USED WITH
002500*    DATA ITEMS OF VARIOUS LENGTHS.
002600*
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 77  WRK-DS-LS-18V00                PICTURE S9(18)
004400           SIGN IS LEADING SEPARATE CHARACTER.
004500 77  A06THREES-DS-LS-03V03          PICTURE S999V999 VALUE 333.333
004600           SIGN IS LEADING.
004700 77  WRK-DS-TS-06V06                PICTURE S9(6)V9(6)
004800           SIGN IS TRAILING SEPARATE CHARACTER.
004900 77  WRK-DS-TS-12V00-S-S REDEFINES WRK-DS-TS-06V06 PICTURE S9(12)
005000           SIGN TRAILING SEPARATE.
005100 77  A08TWOS-DS-02V06            PICTURE S99V9(6) VALUE 22.222222.
005200 77  WRK-DS-10V00                PICTURE S9(10).
005300 77  WRK-XN-00001                PICTURE X.
005400 77  A10ONES-DS-T-10V00            PICTURE S9(10)
005500         SIGN IS TRAILING
005600                                 VALUE 1111111111.
005700 77  A12THREES-DS-LS-06V06          PICTURE S9(6)V9(6)
005800             SIGN IS LEADING SEPARATE
005900                                 VALUE 333333.333333.
006000 77  WRK-DS-02V00                PICTURE S99.
006100 77  AZERO-DS-LS-05V05              PICTURE S9(5)V9(5) VALUE ZERO
006200           SIGN IS LEADING SEPARATE CHARACTER.
006300 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
006400 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09 PICTURE S9(18).
006500 77  A05ONES-DS-LS-00V05            PICTURE SV9(5) VALUE .11111
006600           SIGN IS LEADING SEPARATE CHARACTER.
006700 77  A12ONES-DS-12V00            PICTURE S9(12)
006800                                 VALUE 111111111111.
006900 77  A01ONE-DS-TS-P0801            PICTURE SP(8)9 VALUE .000000001
007000            SIGN IS TRAILING SEPARATE.
007100 77  WRK-DS-T-09V08                PICTURE S9(9)V9(8)
007200           SIGN IS TRAILING.
007300 77  WKR-DS-T-17V00-S REDEFINES WRK-DS-T-09V08 PICTURE S9(17)
007400         SIGN TRAILING.
007500 77  A18ONES-DS-18V00            PICTURE S9(18)
007600                                 VALUE 111111111111111111.
007700 77  WRK-DS-LS-0201P                PICTURE S99P
007800            SIGN IS LEADING SEPARATE.
007900 77  WRK-CS-18V00                PICTURE S9(18) COMPUTATIONAL.
008000 77  WRK-DU-18V00                PICTURE 9(18).
008100 77  A99-CS-02V00                PICTURE S99 COMPUTATIONAL
008200                                 VALUE 99.
008300 77  A01ONE-CS-00V01             PICTURE SV9 COMPUTATIONAL
008400                                 VALUE .1.
008500 77  A99-DS-02V00                PICTURE S99   VALUE 99.
008600 77  WRK-DS-TS-12V00-S                PICTURE S9(12).
008700 77  WRK-DS-LS-01V00             PICTURE S9 LEADING SEPARATE.
008800 77  WRK-DS-03V10                PICTURE S9(3)V9(10).
008900 77  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
009000                                 VALUE 111111111.111111111.
009100 77  A02TWOS-DU-02V00            PICTURE 99  VALUE 22.
009200 77  WRK-DS-05V00                PICTURE S9(5).
009300 77  A02TWOS-DS-03V02            PICTURE S999V99 VALUE +022.00.
009400 77  WRK-CS-02V02                PICTURE S99V99  COMPUTATIONAL.
009500 77  A990-DS-0201P               PICTURE S99P   VALUE +990.
009600 77  XRAY                        PICTURE X.
009700 77  A01ONES-CS-18V00   PICTURE S9(18) COMPUTATIONAL
009800             VALUE +000000000000000001.
009900 77  A02THREES-CS-18V00 PICTURE S9(18) COMPUTATIONAL
010000             VALUE -000000000000000033.
010100 77  A18SIXES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
010200             VALUE 666666666666666666.
010300 77  A16NINES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
010400             VALUE 009999999999999999.
010500 77  A14TWOS-CU-18V00   PICTURE 9(18) COMPUTATIONAL
010600             VALUE 000022222222222222.
010700 01  MULTIPLY-DATA LEADING SEPARATE.
010800     02 MULT1                           PICTURE IS 999V99
010900     VALUE IS 80.12.
011000     02 MULT2                           PICTURE IS 999V999.
011100     02 MULT3                           PICTURE IS $$99.99.
011200     02 MULT4                           PICTURE IS S99
011300     VALUE IS -56.
011400     02 MULT5                           PICTURE IS 9 VALUE IS 4.
011500     02 MULT6                           PICTURE IS 99 VALUE IS
011600     20.
011700 01  DIVIDE-DATA TRAILING SEPARATE.
011800     02 DIV1                            PICTURE IS 9(4)V99
011900     VALUE IS 1620.36.
012000     02 DIV2                            PICTURE IS 99V9
012100     VALUE IS 44.1.
012200     02 DIV3                            PICTURE IS 9(4)V9
012300     VALUE IS 1661.7.
012400     02 DIV4                            PICTURE IS S9V999
012500     VALUE IS -9.642.
012600     02 DIV-02LEVEL-1.
012700     03 DIV5                            PICTURE IS V99
012800     VALUE IS .82.
012900     03 DIV6                            PICTURE IS 9 VALUE IS 0.
013000     03 DIV7                            PICTURE IS 9V9
013100     VALUE IS 9.6.
013200 01  DIV-DATA-2.
013300     02 DIV8                            PICTURE IS 99V9.
013400     02 DIV9                            PICTURE IS ZZ,ZZZ.9.
013500     02 DIV10                           PICTURE IS V999.
013600 01  TEST-RESULTS.
013700     02 FILLER                   PIC X      VALUE SPACE.
013800     02 FEATURE                  PIC X(20)  VALUE SPACE.
013900     02 FILLER                   PIC X      VALUE SPACE.
014000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
014100     02 FILLER                   PIC X      VALUE SPACE.
014200     02  PAR-NAME.
014300       03 FILLER                 PIC X(19)  VALUE SPACE.
014400       03  PARDOT-X              PIC X      VALUE SPACE.
014500       03 DOTVALUE               PIC 99     VALUE ZERO.
014600     02 FILLER                   PIC X(8)   VALUE SPACE.
014700     02 RE-MARK                  PIC X(61).
014800 01  TEST-COMPUTED.
014900     02 FILLER                   PIC X(30)  VALUE SPACE.
015000     02 FILLER                   PIC X(17)  VALUE
015100            "       COMPUTED=".
015200     02 COMPUTED-X.
015300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
015400     03 COMPUTED-N               REDEFINES COMPUTED-A
015500                                 PIC -9(9).9(9).
015600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
015700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
015800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015900     03       CM-18V0 REDEFINES COMPUTED-A.
016000         04 COMPUTED-18V0                    PIC -9(18).
016100         04 FILLER                           PIC X.
016200     03 FILLER PIC X(50) VALUE SPACE.
016300 01  TEST-CORRECT.
016400     02 FILLER PIC X(30) VALUE SPACE.
016500     02 FILLER PIC X(17) VALUE "       CORRECT =".
016600     02 CORRECT-X.
016700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
016800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
017000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
017100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
017200     03      CR-18V0 REDEFINES CORRECT-A.
017300         04 CORRECT-18V0                     PIC -9(18).
017400         04 FILLER                           PIC X.
017500     03 FILLER PIC X(2) VALUE SPACE.
017600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
017700 01  CCVS-C-1.
017800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017900-    "SS  PARAGRAPH-NAME
018000-    "       REMARKS".
018100     02 FILLER                     PIC X(20)    VALUE SPACE.
018200 01  CCVS-C-2.
018300     02 FILLER                     PIC X        VALUE SPACE.
018400     02 FILLER                     PIC X(6)     VALUE "TESTED".
018500     02 FILLER                     PIC X(15)    VALUE SPACE.
018600     02 FILLER                     PIC X(4)     VALUE "FAIL".
018700     02 FILLER                     PIC X(94)    VALUE SPACE.
018800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018900 01  REC-CT                        PIC 99       VALUE ZERO.
019000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
019100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
019200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
019300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
019400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
019500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
019600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
019700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
019800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019900 01  CCVS-H-1.
020000     02  FILLER                    PIC X(39)    VALUE SPACES.
020100     02  FILLER                    PIC X(42)    VALUE
020200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
020300     02  FILLER                    PIC X(39)    VALUE SPACES.
020400 01  CCVS-H-2A.
020500   02  FILLER                        PIC X(40)  VALUE SPACE.
020600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
020700   02  FILLER                        PIC XXXX   VALUE
020800     "4.2 ".
020900   02  FILLER                        PIC X(28)  VALUE
021000            " COPY - NOT FOR DISTRIBUTION".
021100   02  FILLER                        PIC X(41)  VALUE SPACE.
021200
021300 01  CCVS-H-2B.
021400   02  FILLER                        PIC X(15)  VALUE
021500            "TEST RESULT OF ".
021600   02  TEST-ID                       PIC X(9).
021700   02  FILLER                        PIC X(4)   VALUE
021800            " IN ".
021900   02  FILLER                        PIC X(12)  VALUE
022000     " HIGH       ".
022100   02  FILLER                        PIC X(22)  VALUE
022200            " LEVEL VALIDATION FOR ".
022300   02  FILLER                        PIC X(58)  VALUE
022400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
022500 01  CCVS-H-3.
022600     02  FILLER                      PIC X(34)  VALUE
022700            " FOR OFFICIAL USE ONLY    ".
022800     02  FILLER                      PIC X(58)  VALUE
022900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
023000     02  FILLER                      PIC X(28)  VALUE
023100            "  COPYRIGHT   1985 ".
023200 01  CCVS-E-1.
023300     02 FILLER                       PIC X(52)  VALUE SPACE.
023400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
023500     02 ID-AGAIN                     PIC X(9).
023600     02 FILLER                       PIC X(45)  VALUE SPACES.
023700 01  CCVS-E-2.
023800     02  FILLER                      PIC X(31)  VALUE SPACE.
023900     02  FILLER                      PIC X(21)  VALUE SPACE.
024000     02 CCVS-E-2-2.
024100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
024200         03 FILLER                   PIC X      VALUE SPACE.
024300         03 ENDER-DESC               PIC X(44)  VALUE
024400            "ERRORS ENCOUNTERED".
024500 01  CCVS-E-3.
024600     02  FILLER                      PIC X(22)  VALUE
024700            " FOR OFFICIAL USE ONLY".
024800     02  FILLER                      PIC X(12)  VALUE SPACE.
024900     02  FILLER                      PIC X(58)  VALUE
025000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025100     02  FILLER                      PIC X(13)  VALUE SPACE.
025200     02 FILLER                       PIC X(15)  VALUE
025300             " COPYRIGHT 1985".
025400 01  CCVS-E-4.
025500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
025600     02 FILLER                       PIC X(4)   VALUE " OF ".
025700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
025800     02 FILLER                       PIC X(40)  VALUE
025900      "  TESTS WERE EXECUTED SUCCESSFULLY".
026000 01  XXINFO.
026100     02 FILLER                       PIC X(19)  VALUE
026200            "*** INFORMATION ***".
026300     02 INFO-TEXT.
026400       04 FILLER                     PIC X(8)   VALUE SPACE.
026500       04 XXCOMPUTED                 PIC X(20).
026600       04 FILLER                     PIC X(5)   VALUE SPACE.
026700       04 XXCORRECT                  PIC X(20).
026800     02 INF-ANSI-REFERENCE           PIC X(48).
026900 01  HYPHEN-LINE.
027000     02 FILLER  PIC IS X VALUE IS SPACE.
027100     02 FILLER  PIC IS X(65)    VALUE IS "************************
027200-    "*****************************************".
027300     02 FILLER  PIC IS X(54)    VALUE IS "************************
027400-    "******************************".
027500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
027600     "NC120A".
027700 PROCEDURE DIVISION.
027800 CCVS1 SECTION.
027900 OPEN-FILES.
028000     OPEN     OUTPUT PRINT-FILE.
028100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
028200     MOVE    SPACE TO TEST-RESULTS.
028300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028400     GO TO CCVS1-EXIT.
028500 CLOSE-FILES.
028600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028700 TERMINATE-CCVS.
028800S    EXIT PROGRAM.
028900STERMINATE-CALL.
029000     STOP     RUN.
029100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029500     MOVE "****TEST DELETED****" TO RE-MARK.
029600 PRINT-DETAIL.
029700     IF REC-CT NOT EQUAL TO ZERO
029800             MOVE "." TO PARDOT-X
029900             MOVE REC-CT TO DOTVALUE.
030000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030500     MOVE SPACE TO CORRECT-X.
030600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030700     MOVE     SPACE TO RE-MARK.
030800 HEAD-ROUTINE.
030900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031300 COLUMN-NAMES-ROUTINE.
031400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031700 END-ROUTINE.
031800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031900 END-RTN-EXIT.
032000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032100 END-ROUTINE-1.
032200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032400      ADD PASS-COUNTER TO ERROR-HOLD.
032500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032600      MOVE PASS-COUNTER TO CCVS-E-4-1.
032700      MOVE ERROR-HOLD TO CCVS-E-4-2.
032800      MOVE CCVS-E-4 TO CCVS-E-2-2.
032900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033000  END-ROUTINE-12.
033100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033200     IF       ERROR-COUNTER IS EQUAL TO ZERO
033300         MOVE "NO " TO ERROR-TOTAL
033400         ELSE
033500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033700     PERFORM WRITE-LINE.
033800 END-ROUTINE-13.
033900     IF DELETE-COUNTER IS EQUAL TO ZERO
034000         MOVE "NO " TO ERROR-TOTAL  ELSE
034100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034400      IF   INSPECT-COUNTER EQUAL TO ZERO
034500          MOVE "NO " TO ERROR-TOTAL
034600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035000 WRITE-LINE.
035100     ADD 1 TO RECORD-COUNT.
035200Y    IF RECORD-COUNT GREATER 42
035300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035400Y        MOVE SPACE TO DUMMY-RECORD
035500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035600Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
035700Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
035800Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
035900Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
036000Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
036100Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
036200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
036300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036400Y        MOVE ZERO TO RECORD-COUNT.
036500     PERFORM WRT-LN.
036600 WRT-LN.
036700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036800     MOVE SPACE TO DUMMY-RECORD.
036900 BLANK-LINE-PRINT.
037000     PERFORM WRT-LN.
037100 FAIL-ROUTINE.
037200     IF     COMPUTED-X NOT EQUAL TO SPACE
037300            GO TO FAIL-ROUTINE-WRITE.
037400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037800     MOVE   SPACES TO INF-ANSI-REFERENCE.
037900     GO TO  FAIL-ROUTINE-EX.
038000 FAIL-ROUTINE-WRITE.
038100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
038200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
038300     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038400     MOVE   SPACES TO COR-ANSI-REFERENCE.
038500 FAIL-ROUTINE-EX. EXIT.
038600 BAIL-OUT.
038700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038900 BAIL-OUT-WRITE.
039000     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
039100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
039200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039300     MOVE   SPACES TO INF-ANSI-REFERENCE.
039400 BAIL-OUT-EX. EXIT.
039500 CCVS1-EXIT.
039600     EXIT.
039700 SECTION-NC120A-001 SECTION.
039800 SIG-INIT-GF-14.
039900     MOVE  "MULTIPLY BY GIVING" TO FEATURE.
040000     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
040100     MOVE   80.12  TO MULT1.
040200     MOVE    0     TO MULT2.
040300 SIG-TEST-GF-14-0.
040400     MULTIPLY MULT1 BY 4.3 GIVING MULT2.
040500 SIG-TEST-GF-14-1.
040600     IF       MULT2 NOT EQUAL TO 344.516
040700              GO TO SIG-FAIL-GF-14.
040800     PERFORM  PASS
040900              GO TO SIG-WRITE-GF-14.
041000 SIG-DELETE-GF-14.
041100     PERFORM  DE-LETE.
041200     GO TO    SIG-WRITE-GF-14.
041300 SIG-FAIL-GF-14.
041400     PERFORM  FAIL.
041500     MOVE     MULT2 TO COMPUTED-N.
041600     MOVE     +344.516 TO CORRECT-N.
041700 SIG-WRITE-GF-14.
041800     MOVE "SIG-TEST-GF-14" TO PAR-NAME.
041900     PERFORM  PRINT-DETAIL.
042000 SIG-INIT-GF-15.
042100     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
042200     MOVE   80.12  TO MULT1.
042300     MOVE     0    TO MULT3.
042400 SIG-TEST-GF-15-0.
042500     MULTIPLY .9 BY MULT1 GIVING MULT3 ROUNDED.
042600 SIG-TEST-GF-15-1.
042700     IF       MULT3 NOT EQUAL TO " $72.11"
042800              GO TO SIG-FAIL-GF-15.
042900     PERFORM  PASS.
043000     GO TO    SIG-WRITE-GF-15.
043100 SIG-DELETE-GF-15.
043200     PERFORM  DE-LETE.
043300     GO TO    SIG-WRITE-GF-15.
043400 SIG-FAIL-GF-15.
043500     PERFORM  FAIL.
043600     MOVE     MULT3 TO COMPUTED-A.
043700     MOVE " l72.11" TO CORRECT-A.
043800 SIG-WRITE-GF-15.
043900     MOVE "SIG-TEST-GF-15 " TO PAR-NAME.
044000     PERFORM  PRINT-DETAIL.
044100 SIG-INIT-GF-16.
044200     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
044300     MOVE   -56    TO MULT4.
044400     MOVE    80.12 TO MULT1.
044500     MOVE     4    TO MULT5.
044600 SIG-TEST-GF-16-0.
044700     MULTIPLY MULT4 BY MULT1 GIVING MULT5 ON SIZE ERROR
044800              MOVE "H" TO XRAY.
044900 SIG-TEST-GF-16-1.
045000     IF       XRAY EQUAL TO "H"
045100              PERFORM PASS
045200              ELSE
045300              GO TO SIG-FAIL-GF-16-1.
045400     GO TO    SIG-WRITE-GF-16-1.
045500 SIG-DELETE-GF-16-1.
045600     PERFORM  DE-LETE.
045700     GO TO    SIG-WRITE-GF-16-1.
045800 SIG-FAIL-GF-16-1.
045900     MOVE     MULT5 TO COMPUTED-N.
046000     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
046100     PERFORM  FAIL.
046200 SIG-WRITE-GF-16-1.
046300     MOVE "SIG-TEST-GF-16-1 " TO PAR-NAME.
046400     PERFORM  PRINT-DETAIL.
046500 SIG-TEST-GF-16-2.
046600     IF       MULT5 NOT EQUAL TO 4
046700              GO TO SIG-FAIL-GF-16-2.
046800     PERFORM  PASS.
046900     GO TO    SIG-WRITE-GF-16-2.
047000 SIG-DELETE-GF-16-2.
047100     PERFORM  DE-LETE.
047200     GO TO    SIG-WRITE-GF-16-2.
047300 SIG-FAIL-GF-16-2.
047400     PERFORM  FAIL.
047500     MOVE     MULT5 TO COMPUTED-N.
047600     MOVE     +4 TO CORRECT-N.
047700     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
047800 SIG-WRITE-GF-16-2.
047900     MOVE "SIG-TEST-GF-16-2 " TO PAR-NAME.
048000     PERFORM  PRINT-DETAIL.
048100 SIG-INIT-GF-1.
048200     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
048300     MOVE     4 TO MULT5.
048400     MOVE   "A" TO XRAY.
048500 SIG-TEST-GF-1-0.
048600     MULTIPLY 3.3 BY -3 GIVING MULT5 ROUNDED ON SIZE ERROR
048700              MOVE "J" TO XRAY.
048800 SIG-TEST-GF-1-1.
048900     IF       XRAY NOT EQUAL TO "J"
049000              GO TO SIG-FAIL-GF-1-1
049100              ELSE
049200              PERFORM PASS.
049300     GO TO    SIG-WRITE-GF-1-1.
049400 SIG-DELETE-GF-1-1.
049500     PERFORM  DE-LETE.
049600     GO TO    SIG-WRITE-GF-1-1.
049700 SIG-FAIL-GF-1-1.
049800     MOVE     MULT5 TO COMPUTED-N.
049900     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
050000     PERFORM  FAIL.
050100 SIG-WRITE-GF-1-1.
050200     MOVE "SIG-TEST-GF-1-1 " TO PAR-NAME.
050300     PERFORM  PRINT-DETAIL.
050400 SIG-TEST-GF-1-2.
050500     IF       MULT5 EQUAL TO 4
050600              PERFORM PASS
050700              ELSE
050800              GO TO SIG-FAIL-GF-1-2.
050900     GO TO    SIG-WRITE-GF-1-2.
051000 SIG-DELETE-GF-1-2.
051100     PERFORM  DE-LETE.
051200     GO TO    SIG-WRITE-GF-1-2.
051300 SIG-FAIL-GF-1-2.
051400     PERFORM  FAIL.
051500     MOVE     MULT5 TO COMPUTED-N.
051600     MOVE     +4 TO CORRECT-N.
051700     MOVE     4 TO MULT5.
051800     MOVE     "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
051900 SIG-WRITE-GF-1-2.
052000     MOVE "SIG-TEST-GF-1-2 " TO PAR-NAME.
052100     PERFORM  PRINT-DETAIL.
052200 SIG-INIT-GF-2.
052300     MOVE "MULTIPLY BY" TO FEATURE.
052400     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
052500     MOVE     4 TO MULT5.
052600 SIG-TEST-GF-2-0.
052700     MULTIPLY MULT5 BY MULT1.
052800 SIG-TEST-GF-2-1.
052900     IF       MULT1 EQUAL TO 320.48
053000              PERFORM PASS
053100              ELSE
053200              GO TO SIG-FAIL-GF-2.
053300     GO TO    SIG-WRITE-GF-2.
053400 SIG-DELETE-GF-2.
053500     PERFORM  DE-LETE.
053600     GO TO    SIG-WRITE-GF-2.
053700 SIG-FAIL-GF-2.
053800     PERFORM  FAIL.
053900     MOVE     MULT1 TO COMPUTED-N.
054000     MOVE     +320.48 TO CORRECT-N.
054100 SIG-WRITE-GF-2.
054200     MOVE "SIG-TEST-GF-2 " TO PAR-NAME.
054300     PERFORM  PRINT-DETAIL.
054400 SIG-INIT-GF-3.
054500     MOVE "MULTIPLY BY" TO FEATURE.
054600     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
054700     MOVE   -56 TO MULT4.
054800 SIG-TEST-GF-3-0.
054900     MULTIPLY -1.3 BY MULT4 ROUNDED.
055000 SIG-TEST-GF-3-1.
055100     IF       MULT4 EQUAL TO 73
055200              PERFORM PASS
055300              ELSE
055400              GO TO SIG-FAIL-GF-3.
055500     GO TO    SIG-WRITE-GF-3.
055600 SIG-DELETE-GF-3.
055700     PERFORM  DE-LETE.
055800     GO TO    SIG-WRITE-GF-3.
055900 SIG-FAIL-GF-3.
056000     PERFORM  FAIL.
056100     MOVE     MULT4 TO COMPUTED-N.
056200     MOVE     +73 TO CORRECT-N.
056300 SIG-WRITE-GF-3.
056400     MOVE "SIG-TEST-GF-3 " TO PAR-NAME.
056500     PERFORM  PRINT-DETAIL.
056600 SIG-INIT-GF-4.
056700     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
056800     MOVE     4 TO MULT5.
056900     MOVE   "B" TO XRAY.
057000 SIG-TEST-GF-4-0.
057100     MULTIPLY MULT5 BY MULT5 ON SIZE ERROR
057200              MOVE "K" TO XRAY.
057300 SIG-TEST-GF-4-1.
057400     IF       XRAY EQUAL TO "K"
057500              PERFORM PASS
057600              ELSE
057700              GO TO SIG-FAIL-GF-4-1.
057800     GO TO    SIG-WRITE-GF-4-1.
057900 SIG-DELETE-GF-4-1.
058000     PERFORM  DE-LETE.
058100     GO TO    SIG-WRITE-GF-4-1.
058200 SIG-FAIL-GF-4-1.
058300     MOVE     MULT5 TO COMPUTED-N.
058400     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
058500     PERFORM  FAIL.
058600 SIG-WRITE-GF-4-1.
058700     MOVE "SIG-TEST-GF-4-1 " TO PAR-NAME.
058800     PERFORM  PRINT-DETAIL.
058900 SIG-TEST-GF-4-2.
059000     IF       MULT5 EQUAL TO 4
059100              PERFORM PASS
059200              ELSE
059300              GO TO SIG-FAIL-GF-4-2.
059400     GO TO    SIG-WRITE-GF-4-2.
059500 SIG-DELETE-GF-4-2.
059600     PERFORM  DE-LETE.
059700     GO TO    SIG-WRITE-GF-4-2.
059800 SIG-FAIL-GF-4-2.
059900     PERFORM  FAIL.
060000     MOVE     MULT5 TO COMPUTED-N.
060100     MOVE     +4 TO CORRECT-N.
060200     MOVE "NOT AFFECTED BY SIZE ERROR" TO RE-MARK.
060300 SIG-WRITE-GF-4-2.
060400     MOVE "SIG-TEST-GF-4-2" TO PAR-NAME.
060500     PERFORM  PRINT-DETAIL.
060600 SIG-INIT-GF-5.
060700     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
060800     MOVE    20 TO MULT6.
060900     MOVE   "C" TO XRAY.
061000 SIG-TEST-GF-5-0.
061100     MULTIPLY 4.99 BY MULT6 ROUNDED ON SIZE ERROR
061200              MOVE "L" TO XRAY.
061300 SIG-TEST-GF-5-1.
061400     IF       XRAY EQUAL TO "L"
061500              PERFORM PASS
061600              ELSE
061700              GO TO SIG-FAIL-GF-5-1.
061800     GO TO    SIG-WRITE-GF-5-1.
061900 SIG-DELETE-GF-5-1.
062000     PERFORM  DE-LETE.
062100     GO TO    SIG-WRITE-GF-5-1.
062200 SIG-FAIL-GF-5-1.
062300     MOVE     MULT6 TO COMPUTED-N.
062400     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
062500     PERFORM  FAIL.
062600 SIG-WRITE-GF-5-1.
062700     MOVE "SIG-TEST-GF-5-1" TO PAR-NAME.
062800     PERFORM  PRINT-DETAIL.
062900 SIG-TEST-GF-5-2.
063000     IF       MULT6 EQUAL TO 20
063100              PERFORM PASS
063200              ELSE
063300              GO TO SIG-FAIL-GF-5-2.
063400     GO TO    SIG-WRITE-GF-5-2.
063500 SIG-DELETE-GF-5-2.
063600     PERFORM  DE-LETE.
063700     GO TO    SIG-WRITE-GF-5-2.
063800 SIG-FAIL-GF-5-2.
063900     PERFORM  FAIL.
064000     MOVE     MULT6 TO COMPUTED-N.
064100     MOVE     +20 TO CORRECT-N.
064200     MOVE "NOT AFFECTED BY SIZE ERROR" TO RE-MARK.
064300 SIG-WRITE-GF-5-2.
064400     MOVE "SIG-TEST-GF-5-2" TO PAR-NAME.
064500     PERFORM  PRINT-DETAIL.
064600 SIG-INIT-GF-6.
064700     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
064800     MOVE 222222222222 TO WRK-DS-LS-18V00.
064900 SIG-TEST-GF-6-0.
065000     MULTIPLY A06THREES-DS-LS-03V03 BY WRK-DS-LS-18V00.
065100 SIG-TEST-GF-6-1.
065200     IF WRK-DS-LS-18V00 EQUAL TO 000074073999999925
065300         PERFORM PASS
065400         GO TO SIG-WRITE-GF-6.
065500     GO TO SIG-FAIL-GF-6.
065600 SIG-DELETE-GF-6.
065700     PERFORM DE-LETE.
065800     GO TO SIG-WRITE-GF-6.
065900 SIG-FAIL-GF-6.
066000     MOVE  000074073999999925 TO CORRECT-18V0.
066100     MOVE  WRK-DS-LS-18V00       TO COMPUTED-18V0.
066200     PERFORM FAIL.
066300 SIG-WRITE-GF-6.
066400     MOVE "SIG-TEST-GF-6         " TO PAR-NAME.
066500     PERFORM PRINT-DETAIL.
066600 SIG-INIT-GF-7.
066700     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
066800     MOVE A08TWOS-DS-02V06 TO WRK-DS-TS-06V06.
066900 SIG-TEST-GF-7-0.
067000     MULTIPLY 0.4 BY WRK-DS-TS-06V06 ROUNDED.
067100 SIG-TEST-GF-7-1.
067200     IF WRK-DS-TS-12V00-S-S EQUAL TO 000008888889
067300         PERFORM PASS
067400         GO TO SIG-WRITE-GF-7.
067500     GO TO SIG-FAIL-GF-7.
067600 SIG-DELETE-GF-7.
067700     PERFORM DE-LETE.
067800     GO TO SIG-WRITE-GF-7.
067900 SIG-FAIL-GF-7.
068000     MOVE  WRK-DS-TS-12V00-S-S     TO COMPUTED-18V0.
068100     MOVE  000008888889       TO CORRECT-18V0.
068200     PERFORM FAIL.
068300 SIG-WRITE-GF-7.
068400     MOVE "SIG-TEST-GF-7         " TO PAR-NAME.
068500     PERFORM PRINT-DETAIL.
068600 SIG-INIT-GF-8.
068700     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
068800     MOVE "0" TO WRK-XN-00001.
068900     MOVE A10ONES-DS-T-10V00 TO WRK-DS-10V00.
069000 SIG-TEST-GF-8-0.
069100     MULTIPLY A12THREES-DS-LS-06V06 BY WRK-DS-10V00
069200         ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
069300 SIG-TEST-GF-8-1.
069400     IF WRK-DS-10V00 EQUAL TO 1111111111
069500         PERFORM PASS
069600         GO TO SIG-WRITE-GF-8-1.
069700     GO TO SIG-FAIL-GF-8-1.
069800 SIG-DELETE-GF-8-1.
069900     PERFORM DE-LETE.
070000     GO TO SIG-WRITE-GF-8-1.
070100 SIG-FAIL-GF-8-1.
070200     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
070300     MOVE  1111111111         TO CORRECT-18V0.
070400     PERFORM FAIL.
070500 SIG-WRITE-GF-8-1.
070600     MOVE "SIG-TEST-GF-8-1         " TO PAR-NAME.
070700     PERFORM PRINT-DETAIL.
070800 SIG-TEST-GF-8-2.
070900     IF WRK-XN-00001 EQUAL TO "1"
071000         PERFORM PASS
071100         GO TO SIG-WRITE-GF-8-2.
071200     MOVE "1" TO CORRECT-A.
071300     MOVE WRK-XN-00001 TO COMPUTED-A.
071400     PERFORM FAIL.
071500     GO TO SIG-WRITE-GF-8-2.
071600 SIG-DELETE-GF-8-2.
071700     PERFORM DE-LETE.
071800 SIG-WRITE-GF-8-2.
071900     MOVE "SIG-TEST-GF-8-2         " TO PAR-NAME.
072000     PERFORM PRINT-DETAIL.
072100 SIG-INIT-GF-9.
072200     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
072300     MOVE "1" TO WRK-XN-00001.
072400     MOVE -99 TO WRK-DS-02V00.
072500 SIG-TEST-GF-9-0.
072600     MULTIPLY AZERO-DS-LS-05V05 BY WRK-DS-02V00
072700         ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
072800 SIG-TEST-GF-9-1.
072900     IF WRK-DS-02V00 EQUAL TO 00
073000         PERFORM PASS
073100         GO TO SIG-WRITE-GF-9-1.
073200     GO TO SIG-FAIL-GF-9-1.
073300 SIG-DELETE-GF-9-1.
073400     PERFORM DE-LETE.
073500     GO TO SIG-WRITE-GF-9-1.
073600 SIG-FAIL-GF-9-1.
073700     MOVE  WRK-DS-02V00       TO COMPUTED-N.
073800     MOVE  00                 TO CORRECT-N.
073900     PERFORM FAIL.
074000 SIG-WRITE-GF-9-1.
074100     MOVE "SIG-TEST-GF-9-1         " TO PAR-NAME.
074200     PERFORM PRINT-DETAIL.
074300 SIG-TEST-GF-9-2.
074400     IF WRK-XN-00001 EQUAL TO "1"
074500         PERFORM PASS
074600         GO TO SIG-WRITE-GF-9-2.
074700     MOVE "1" TO CORRECT-A.
074800     MOVE WRK-XN-00001 TO COMPUTED-A.
074900     PERFORM FAIL.
075000     GO TO SIG-WRITE-GF-9-2.
075100 SIG-DELETE-GF-9-2.
075200     PERFORM DE-LETE.
075300 SIG-WRITE-GF-9-2.
075400     MOVE "SIG-TEST-GF-9-2         " TO PAR-NAME.
075500     PERFORM PRINT-DETAIL.
075600 SIG-INIT-GF-10.
075700     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
075800     MOVE "0" TO WRK-XN-00001.
075900     MOVE -01 TO WRK-DS-02V00.
076000 SIG-TEST-GF-10-0.
076100     MULTIPLY 99.5 BY WRK-DS-02V00 ROUNDED
076200         ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
076300 SIG-TEST-GF-10-1.
076400     IF WRK-DS-02V00 EQUAL TO -01
076500         PERFORM PASS
076600         GO TO SIG-WRITE-GF-10-1.
076700     GO TO SIG-FAIL-GF-10-1.
076800 SIG-DELETE-GF-10-1.
076900     PERFORM DE-LETE.
077000     GO TO SIG-WRITE-GF-10-1.
077100 SIG-FAIL-GF-10-1.
077200     MOVE  WRK-DS-02V00       TO COMPUTED-N.
077300     MOVE  -01                TO CORRECT-N.
077400     PERFORM FAIL.
077500 SIG-WRITE-GF-10-1.
077600     MOVE "SIG-TEST-GF-10-1         " TO PAR-NAME.
077700     PERFORM PRINT-DETAIL.
077800 SIG-TEST-GF-10-2.
077900     IF WRK-XN-00001 EQUAL TO "1"
078000         PERFORM PASS
078100         GO TO SIG-WRITE-GF-10-2.
078200     MOVE "1" TO CORRECT-A.
078300     MOVE WRK-XN-00001 TO COMPUTED-A.
078400     PERFORM FAIL.
078500     GO TO SIG-WRITE-GF-10-2.
078600 SIG-DELETE-GF-10-2.
078700     PERFORM DE-LETE.
078800 SIG-WRITE-GF-10-2.
078900     MOVE "SIG-TEST-GF-10-2         " TO PAR-NAME.
079000     PERFORM PRINT-DETAIL.
079100 SIG-INIT-GF-11.
079200     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
079300     MOVE "1" TO WRK-XN-00001.
079400     MOVE -01 TO WRK-DS-02V00.
079500 SIG-TEST-GF-11-0.
079600     MULTIPLY 99.4 BY WRK-DS-02V00 ROUNDED
079700         ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
079800 SIG-TEST-GF-11-1.
079900     IF WRK-DS-02V00 EQUAL TO -99
080000         PERFORM PASS
080100         GO TO SIG-WRITE-GF-11-1.
080200     GO TO SIG-FAIL-GF-11-1.
080300 SIG-DELETE-GF-11-1.
080400     PERFORM DE-LETE.
080500     GO TO SIG-WRITE-GF-11-1.
080600 SIG-FAIL-GF-11-1.
080700     MOVE  WRK-DS-02V00       TO COMPUTED-N.
080800     MOVE  -99                TO CORRECT-N.
080900     PERFORM FAIL.
081000 SIG-WRITE-GF-11-1.
081100     MOVE "SIG-TEST-GF-11-1         " TO PAR-NAME.
081200     PERFORM PRINT-DETAIL.
081300 SIG-TEST-GF-11-2.
081400     IF WRK-XN-00001 EQUAL TO "1"
081500         PERFORM PASS
081600         GO TO SIG-WRITE-GF-11-2.
081700     MOVE "1" TO CORRECT-A.
081800     MOVE WRK-XN-00001 TO COMPUTED-A.
081900     PERFORM FAIL.
082000     GO TO SIG-WRITE-GF-11-2.
082100 SIG-DELETE-GF-11-2.
082200     PERFORM DE-LETE.
082300 SIG-WRITE-GF-11-2.
082400     MOVE "SIG-TEST-GF-11-2         " TO PAR-NAME.
082500     PERFORM PRINT-DETAIL.
082600 SIG-INIT-GF-17.
082700     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
082800     MOVE "MULTIPLY BY GIVING  " TO FEATURE.
082900     MOVE ZERO TO WRK-DS-09V09.
083000 SIG-TEST-GF-17-0.
083100     MULTIPLY A06THREES-DS-LS-03V03 BY A12THREES-DS-LS-06V06
083200         GIVING WRK-DS-09V09.
083300 SIG-TEST-GF-17-1.
083400     IF WRK-DS-18V00-S EQUAL TO 111110999999888889
083500         PERFORM PASS
083600         GO TO SIG-WRITE-GF-17.
083700     GO TO SIG-FAIL-GF-17.
083800 SIG-DELETE-GF-17.
083900     PERFORM DE-LETE.
084000     GO TO SIG-WRITE-GF-17.
084100 SIG-FAIL-GF-17.
084200     MOVE  111110999999888889 TO CORRECT-18V0.
084300     MOVE  WRK-DS-18V00-S     TO COMPUTED-18V0.
084400     PERFORM FAIL.
084500 SIG-WRITE-GF-17.
084600     MOVE "SIG-TEST-GF-17         " TO PAR-NAME.
084700     PERFORM PRINT-DETAIL.
084800 SIG-INIT-GF-18.
084900     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
085000     MOVE ZERO TO WRK-DS-10V00.
085100 SIG-TEST-GF-18-0.
085200     MULTIPLY A06THREES-DS-LS-03V03 BY A06THREES-DS-LS-03V03
085300         GIVING WRK-DS-10V00 ROUNDED.
085400 SIG-TEST-GF-18-1.
085500     IF WRK-DS-10V00 EQUAL TO 0000111111
085600         PERFORM PASS
085700         GO TO SIG-WRITE-GF-18.
085800     GO TO SIG-FAIL-GF-18.
085900 SIG-DELETE-GF-18.
086000     PERFORM DE-LETE.
086100     GO TO SIG-WRITE-GF-18.
086200 SIG-FAIL-GF-18.
086300     MOVE  0000111111         TO CORRECT-18V0.
086400     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
086500     PERFORM FAIL.
086600 SIG-WRITE-GF-18.
086700     MOVE "SIG-TEST-GF-18         " TO PAR-NAME.
086800     PERFORM PRINT-DETAIL.
086900 SIG-INIT-GF-19.
087000     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
087100     MOVE "0" TO WRK-XN-00001.
087200     MOVE ZERO TO WRK-DS-10V00.
087300 SIG-TEST-GF-19-0.
087400     MULTIPLY A05ONES-DS-LS-00V05 BY A12ONES-DS-12V00
087500         GIVING WRK-DS-10V00 ON SIZE ERROR
087600         MOVE "1" TO WRK-XN-00001.
087700 SIG-TEST-GF-19-1.
087800     IF WRK-DS-10V00 EQUAL TO 0000000000
087900         PERFORM PASS
088000         GO TO SIG-WRITE-GF-19-1.
088100     GO TO SIG-FAIL-GF-19-1.
088200 SIG-DELETE-GF-19-1.
088300     PERFORM DE-LETE.
088400     GO TO SIG-WRITE-GF-19-1.
088500 SIG-FAIL-GF-19-1.
088600     MOVE  0000000000         TO CORRECT-18V0.
088700     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
088800     PERFORM FAIL.
088900 SIG-WRITE-GF-19-1.
089000     MOVE "SIG-TEST-GF-19-1         " TO PAR-NAME.
089100     PERFORM PRINT-DETAIL.
089200 SIG-TEST-GF-19-2.
089300     IF WRK-XN-00001 EQUAL TO "1"
089400         PERFORM PASS
089500         GO TO SIG-WRITE-GF-19-2.
089600     MOVE "1" TO CORRECT-A.
089700     MOVE WRK-XN-00001 TO COMPUTED-A.
089800     PERFORM FAIL.
089900     GO TO SIG-WRITE-GF-19-2.
090000 SIG-DELETE-GF-19-2.
090100     PERFORM DE-LETE.
090200 SIG-WRITE-GF-19-2.
090300     MOVE "SIG-TEST-GF-19-2         " TO PAR-NAME.
090400     PERFORM PRINT-DETAIL.
090500 SIG-INIT-GF-20.
090600     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
090700     MOVE "1" TO WRK-XN-00001.
090800     MOVE ZERO TO WRK-DS-10V00.
090900 SIG-TEST-GF-20-0.
091000     MULTIPLY A01ONE-DS-TS-P0801 BY A12ONES-DS-12V00
091100         GIVING WRK-DS-10V00 ON SIZE ERROR
091200         MOVE "0" TO WRK-XN-00001.
091300 SIG-TEST-GF-20-1.
091400     IF WRK-DS-10V00 EQUAL TO 0000000111
091500         PERFORM PASS
091600         GO TO SIG-WRITE-GF-20-1.
091700     GO TO SIG-FAIL-GF-20-1.
091800 SIG-DELETE-GF-20-1.
091900     PERFORM DE-LETE.
092000     GO TO SIG-WRITE-GF-20-1.
092100 SIG-FAIL-GF-20-1.
092200     MOVE  0000000111         TO CORRECT-18V0.
092300     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
092400     PERFORM FAIL.
092500 SIG-WRITE-GF-20-1.
092600     MOVE "SIG-TEST-GF-20-1         " TO PAR-NAME.
092700     PERFORM PRINT-DETAIL.
092800 SIG-TEST-GF-20-2.
092900     IF WRK-XN-00001 EQUAL TO "1"
093000         PERFORM PASS
093100         GO TO SIG-WRITE-GF-20-2.
093200     MOVE "1" TO CORRECT-A.
093300     MOVE WRK-XN-00001 TO COMPUTED-A.
093400     PERFORM FAIL.
093500     GO TO SIG-WRITE-GF-20-2.
093600 SIG-DELETE-GF-20-2.
093700     PERFORM DE-LETE.
093800 SIG-WRITE-GF-20-2.
093900     MOVE "SIG-TEST-GF-20-2         " TO PAR-NAME.
094000     PERFORM PRINT-DETAIL.
094100 SIG-INIT-GF-21.
094200     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
094300     MOVE "0" TO WRK-XN-00001.
094400     MOVE ZERO TO WRK-DS-10V00.
094500 SIG-TEST-GF-21-0.
094600     MULTIPLY 9.5 BY A10ONES-DS-T-10V00
094700         GIVING WRK-DS-10V00 ROUNDED ON SIZE ERROR
094800         MOVE "1" TO WRK-XN-00001.
094900 SIG-TEST-GF-21-1.
095000     IF WRK-DS-10V00 EQUAL TO 0000000000
095100         PERFORM PASS
095200         GO TO SIG-WRITE-GF-21-1.
095300     MOVE  0000000000         TO CORRECT-18V0.
095400     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
095500     PERFORM FAIL.
095600     GO TO SIG-WRITE-GF-21-1.
095700 SIG-DELETE-GF-21-1.
095800     PERFORM DE-LETE.
095900 SIG-WRITE-GF-21-1.
096000     MOVE "SIG-TEST-GF-21-1         " TO PAR-NAME.
096100     PERFORM PRINT-DETAIL.
096200 SIG-TEST-GF-21-2.
096300     IF WRK-XN-00001 EQUAL TO "1"
096400         PERFORM PASS
096500         GO TO SIG-WRITE-GF-21-2.
096600     MOVE "1" TO CORRECT-A.
096700     MOVE WRK-XN-00001 TO COMPUTED-A.
096800     PERFORM FAIL.
096900     GO TO SIG-WRITE-GF-21-2.
097000 SIG-DELETE-GF-21-2.
097100     PERFORM DE-LETE.
097200 SIG-WRITE-GF-21-2.
097300     MOVE "SIG-TEST-GF-21-2         " TO PAR-NAME.
097400     PERFORM PRINT-DETAIL.
097500 SIG-INIT-GF-22.
097600     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
097700     MOVE "1" TO WRK-XN-00001.
097800     MOVE ZERO TO WRK-DS-T-09V08.
097900 SIG-TEST-GF-22-0.
098000     MULTIPLY A01ONE-DS-TS-P0801 BY A18ONES-DS-18V00
098100         GIVING WRK-DS-T-09V08 ROUNDED ON SIZE ERROR
098200         MOVE "0" TO WRK-XN-00001.
098300 SIG-TEST-GF-22-1.
098400     IF WKR-DS-T-17V00-S EQUAL TO 11111111111111111
098500         PERFORM PASS
098600         GO TO SIG-WRITE-GF-22-1.
098700     MOVE  11111111111111111  TO CORRECT-18V0.
098800     MOVE  WKR-DS-T-17V00-S     TO COMPUTED-18V0.
098900     PERFORM FAIL.
099000     GO TO SIG-WRITE-GF-22-1.
099100 SIG-DELETE-GF-22-1.
099200     PERFORM DE-LETE.
099300 SIG-WRITE-GF-22-1.
099400     MOVE "SIG-TEST-GF-22-1         " TO PAR-NAME.
099500     PERFORM PRINT-DETAIL.
099600 SIG-TEST-GF-22-2.
099700     IF WRK-XN-00001 EQUAL TO "1"
099800         PERFORM PASS
099900         GO TO SIG-WRITE-GF-22-2.
100000     MOVE "1" TO CORRECT-A.
100100     MOVE WRK-XN-00001 TO COMPUTED-A.
100200     PERFORM FAIL.
100300     GO TO SIG-WRITE-GF-22-2.
100400 SIG-DELETE-GF-22-2.
100500     PERFORM DE-LETE.
100600 SIG-WRITE-GF-22-2.
100700     MOVE "SIG-TEST-GF-22-2         " TO PAR-NAME.
100800     PERFORM PRINT-DETAIL.
100900 SIG-INIT-GF-12.
101000     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
101100     MOVE "MULTIPLY BY         " TO FEATURE.
101200     MOVE -990 TO WRK-DS-LS-0201P.
101300 SIG-TEST-GF-12-0.
101400     MULTIPLY A01ONE-CS-00V01 BY WRK-DS-LS-0201P.
101500 SIG-TEST-GF-12-1.
101600     MOVE WRK-DS-LS-0201P TO WRK-DS-05V00.
101700     IF WRK-DS-05V00 EQUAL TO -00090
101800         PERFORM PASS
101900         GO TO SIG-WRITE-GF-12.
102000     MOVE -00090 TO CORRECT-N.
102100     MOVE  WRK-DS-05V00       TO COMPUTED-N.
102200     PERFORM FAIL.
102300     GO TO SIG-WRITE-GF-12.
102400 SIG-DELETE-GF-12.
102500     PERFORM DE-LETE.
102600 SIG-WRITE-GF-12.
102700     MOVE "SIG-TEST-GF-12         " TO PAR-NAME.
102800     PERFORM PRINT-DETAIL.
102900 SIG-INIT-GF-13.
103000     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
103100     MOVE A18ONES-DS-18V00 TO WRK-CS-18V00.
103200 SIG-TEST-GF-13-0.
103300     MULTIPLY A01ONE-DS-TS-P0801 BY WRK-CS-18V00.
103400 SIG-TEST-GF-13-1.
103500     MOVE WRK-CS-18V00 TO WRK-DU-18V00.
103600     IF WRK-DU-18V00 EQUAL TO 000000000111111111
103700         PERFORM PASS
103800         GO TO SIG-WRITE-GF-13.
103900     MOVE  000000000111111111 TO CORRECT-18V0.
104000     MOVE WRK-DU-18V00     TO COMPUTED-18V0.
104100     PERFORM FAIL.
104200     GO TO SIG-WRITE-GF-13.
104300 SIG-DELETE-GF-13.
104400     PERFORM DE-LETE.
104500 SIG-WRITE-GF-13.
104600     MOVE "SIG-TEST-GF-13         " TO PAR-NAME.
104700     PERFORM PRINT-DETAIL.
104800 SIG-INIT-GF-23.
104900     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
105000     MOVE ZERO TO WRK-CS-02V02.
105100 SIG-TEST-GF-23-0.
105200     MULTIPLY A99-CS-02V00 BY A01ONE-CS-00V01 GIVING WRK-CS-02V02.
105300 SIG-TEST-GF-23-1.
105400     MOVE WRK-CS-02V02 TO WRK-DS-TS-06V06.
105500     IF WRK-DS-TS-12V00-S-S EQUAL TO 000009900000
105600         PERFORM PASS
105700         GO TO SIG-WRITE-GF-23.
105800     MOVE  000009900000       TO CORRECT-18V0.
105900     MOVE  WRK-DS-TS-12V00-S-S     TO COMPUTED-18V0.
106000     PERFORM FAIL.
106100     GO TO SIG-WRITE-GF-23.
106200 SIG-DELETE-GF-23.
106300     PERFORM DE-LETE.
106400 SIG-WRITE-GF-23.
106500     MOVE "MULTIPLY BY GIVING  " TO FEATURE.
106600     MOVE "SIG-TEST-GF-23         " TO PAR-NAME.
106700     PERFORM PRINT-DETAIL.
106800 SIG-INIT-GF-24.
106900     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
107000     MOVE ZERO TO WRK-CS-18V00.
107100 SIG-TEST-GF-24-0.
107200     MULTIPLY A01ONES-CS-18V00 BY A02THREES-CS-18V00
107300             GIVING WRK-CS-18V00.
107400 SIG-TEST-GF-24-1.
107500     IF WRK-CS-18V00 EQUAL TO -000000000000000033
107600         PERFORM PASS
107700         GO TO SIG-WRITE-GF-24.
107800     MOVE -000000000000000033 TO CORRECT-18V0.
107900     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
108000     PERFORM FAIL.
108100     GO TO SIG-WRITE-GF-24.
108200 SIG-DELETE-GF-24.
108300     PERFORM DE-LETE.
108400 SIG-WRITE-GF-24.
108500     MOVE "SIG-TEST-GF-24 " TO PAR-NAME.
108600     PERFORM PRINT-DETAIL.
108700 SIG-INIT-GF-25.
108800     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
108900     MOVE ZERO TO WRK-DU-18V00.
109000 SIG-TEST-GF-25-0.
109100     MULTIPLY A02THREES-CS-18V00 BY A14TWOS-CU-18V00
109200             GIVING WRK-DU-18V00.
109300 SIG-TEST-GF-25-1.
109400     IF WRK-DU-18V00 EQUAL TO 000733333333333326
109500         PERFORM PASS
109600         GO TO SIG-WRITE-GF-25.
109700     MOVE 000733333333333326 TO CORRECT-18V0.
109800     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
109900     PERFORM FAIL.
110000     GO TO SIG-WRITE-GF-25.
110100 SIG-DELETE-GF-25.
110200     PERFORM DE-LETE.
110300 SIG-WRITE-GF-25.
110400     MOVE "SIG-TEST-GF-25 " TO PAR-NAME.
110500     PERFORM PRINT-DETAIL.
110600 SIG-INIT-GF-26.
110700     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
110800     MOVE ZERO TO WRK-CS-18V00.
110900 SIG-TEST-GF-26-0.
111000     MULTIPLY A02THREES-CS-18V00 BY A16NINES-CU-18V00
111100             GIVING WRK-CS-18V00.
111200 SIG-TEST-GF-26-1.
111300     IF WRK-CS-18V00 EQUAL TO -329999999999999967
111400         PERFORM PASS
111500         GO TO SIG-WRITE-GF-26.
111600     MOVE -329999999999999967 TO CORRECT-18V0.
111700     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
111800     PERFORM FAIL.
111900     GO TO SIG-WRITE-GF-26.
112000 SIG-DELETE-GF-26.
112100     PERFORM DE-LETE.
112200 SIG-WRITE-GF-26.
112300     MOVE "SIG-TEST-GF-26 " TO PAR-NAME.
112400     PERFORM PRINT-DETAIL.
112500 SIG-INIT-GF-27.
112600     MOVE   "VI-42 5.12.4"      TO ANSI-REFERENCE.
112700     MOVE ZERO TO WRK-DU-18V00.
112800 SIG-TEST-GF-27-0.
112900     MULTIPLY A01ONES-CS-18V00 BY A18SIXES-CU-18V00
113000         GIVING WRK-DU-18V00.
113100 SIG-TEST-GF-27-1.
113200     IF WRK-DU-18V00 EQUAL TO 666666666666666666
113300         PERFORM PASS
113400         GO TO SIG-WRITE-GF-27.
113500     MOVE 666666666666666666 TO CORRECT-18V0.
113600     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
113700     PERFORM FAIL.
113800     GO TO SIG-WRITE-GF-27.
113900 SIG-DELETE-GF-27.
114000     PERFORM DE-LETE.
114100 SIG-WRITE-GF-27.
114200     MOVE "SIG-TEST-GF-27 " TO PAR-NAME.
114300     PERFORM PRINT-DETAIL.
114400     PERFORM END-ROUTINE.
114500 CCVS-EXIT SECTION.
114600 CCVS-999999.
114700     GO TO CLOSE-FILES.
