000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC125A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC125A TESTS THE USE OF PICTURE CHARACTERS
002300*    $ + * . , WITH FORMAT 1 OF THE "MOVE" STATEMENT AND
002400*    FORMAT 2 OF THE "ADD" AND "SUBTRACT" STATEMENTS.
002500*
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 01  W1.
004300     02 WRK-EDIT-001 PIC $$,$$$,$$$,$$$,$$$,$$$.99.
004400 01  W2.
004500     02 WRK-EDIT-002 PIC ++,+++,+++,+++,+++,+++.99.
004600 01  W3.
004700     02 WRK-EDIT-003 PIC --,---,---,---,---,---.99.
004800 01  W4.
004900     02 WRK-EDIT-004 PIC  *,***,***,***,***,***.99.
005000 01  W5.
005100     02 WRK-EDIT-005 PIC  9,9,9,9,9,9,9,9,9,9,9,9,.
005200 01  W6.
005300     02 WRK-EDIT-006 PIC  999999999999..
005400 01  TBL-001.
005500     02 FILLER PIC S9(16)V99 VALUE ZERO.
005600     02 FILLER PIC S9(16)V99 VALUE .01.
005700     02 FILLER PIC S9(16)V99 VALUE .19.
005800     02 FILLER PIC S9(16)V99 VALUE 1.00.
005900     02 FILLER PIC S9(16)V99 VALUE 111.11.
006000     02 FILLER PIC S9(16)V99 VALUE 9999.11.
006100     02 FILLER PIC S9(16)V99 VALUE 1010101.99.
006200     02 FILLER PIC S9(16)V99 VALUE 900000000.11.
006300     02 FILLER PIC S9(16)V99 VALUE 9999999999.99.
006400 01  TBL-001-R REDEFINES TBL-001.
006500     02 TBL-001-O PIC S9(16)V99 OCCURS 9 TIMES.
006600 01  TBL-002.
006700     02 FILLER PIC X(25) VALUE "                     $.00".
006800     02 FILLER PIC X(25) VALUE "                     $.01".
006900     02 FILLER PIC X(25) VALUE "                     $.19".
007000     02 FILLER PIC X(25) VALUE "                    $1.00".
007100     02 FILLER PIC X(25) VALUE "                  $111.11".
007200     02 FILLER PIC X(25) VALUE "                $9,999.11".
007300     02 FILLER PIC X(25) VALUE "            $1,010,101.99".
007400     02 FILLER PIC X(25) VALUE "          $900,000,000.11".
007500     02 FILLER PIC X(25) VALUE "        $9,999,999,999.99".
007600 01  TBL-002-R REDEFINES TBL-002.
007700     02 TBL-002-O PIC X(25) OCCURS 9 TIMES.
007800 01  TBL-003.
007900     02 FILLER PIC X(25) VALUE "                     +.00".
008000     02 FILLER PIC X(25) VALUE "                     +.01".
008100     02 FILLER PIC X(25) VALUE "                     +.19".
008200     02 FILLER PIC X(25) VALUE "                    +1.00".
008300     02 FILLER PIC X(25) VALUE "                  +111.11".
008400     02 FILLER PIC X(25) VALUE "                +9,999.11".
008500     02 FILLER PIC X(25) VALUE "            +1,010,101.99".
008600     02 FILLER PIC X(25) VALUE "          +900,000,000.11".
008700     02 FILLER PIC X(25) VALUE "        +9,999,999,999.99".
008800 01  TBL-003-R REDEFINES TBL-003.
008900     02 TBL-003-O PIC X(25) OCCURS 9 TIMES.
009000 01  TBL-004.
009100     02 FILLER PIC X(25) VALUE "                      .00".
009200     02 FILLER PIC X(25) VALUE "                      .01".
009300     02 FILLER PIC X(25) VALUE "                      .19".
009400     02 FILLER PIC X(25) VALUE "                     1.00".
009500     02 FILLER PIC X(25) VALUE "                   111.11".
009600     02 FILLER PIC X(25) VALUE "                 9,999.11".
009700     02 FILLER PIC X(25) VALUE "             1,010,101.99".
009800     02 FILLER PIC X(25) VALUE "           900,000,000.11".
009900     02 FILLER PIC X(25) VALUE "         9,999,999,999.99".
010000 01  TBL-004-R REDEFINES TBL-004.
010100     02 TBL-004-O PIC X(25) OCCURS 9 TIMES.
010200 01  TBL-005.
010300     02 FILLER PIC X(24) VALUE "*********************.00".
010400     02 FILLER PIC X(24) VALUE "*********************.01".
010500     02 FILLER PIC X(24) VALUE "*********************.19".
010600     02 FILLER PIC X(24) VALUE "********************1.00".
010700     02 FILLER PIC X(24) VALUE "******************111.11".
010800     02 FILLER PIC X(24) VALUE "****************9,999.11".
010900     02 FILLER PIC X(24) VALUE "************1,010,101.99".
011000     02 FILLER PIC X(24) VALUE "**********900,000,000.11".
011100     02 FILLER PIC X(24) VALUE "********9,999,999,999.99".
011200 01  TBL-005-R REDEFINES TBL-005.
011300     02 TBL-005-O PIC X(24) OCCURS 9 TIMES.
011400 01  TBL-006.
011500     02 FILLER PIC X(25) VALUE "                      .00".
011600     02 FILLER PIC X(25) VALUE "                     -.01".
011700     02 FILLER PIC X(25) VALUE "                     -.19".
011800     02 FILLER PIC X(25) VALUE "                    -1.00".
011900     02 FILLER PIC X(25) VALUE "                  -111.11".
012000     02 FILLER PIC X(25) VALUE "                -9,999.11".
012100     02 FILLER PIC X(25) VALUE "            -1,010,101.99".
012200     02 FILLER PIC X(25) VALUE "          -900,000,000.11".
012300     02 FILLER PIC X(25) VALUE "        -9,999,999,999.99".
012400 01  TBL-006-R REDEFINES TBL-006.
012500     02 TBL-006-O PIC X(25) OCCURS 9 TIMES.
012600 01  CTR-1 PIC 999 VALUE 0.
012700 01  CRT-2 PIC 999 VALUE 9.
012800 01  CTR-3 PIC 999 VALUE 0.
012900 01  TEST-RESULTS.
013000     02 FILLER                   PIC X      VALUE SPACE.
013100     02 FEATURE                  PIC X(20)  VALUE SPACE.
013200     02 FILLER                   PIC X      VALUE SPACE.
013300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
013400     02 FILLER                   PIC X      VALUE SPACE.
013500     02  PAR-NAME.
013600       03 FILLER                 PIC X(19)  VALUE SPACE.
013700       03  PARDOT-X              PIC X      VALUE SPACE.
013800       03 DOTVALUE               PIC 99     VALUE ZERO.
013900     02 FILLER                   PIC X(8)   VALUE SPACE.
014000     02 RE-MARK                  PIC X(61).
014100 01  TEST-COMPUTED.
014200     02 FILLER                   PIC X(30)  VALUE SPACE.
014300     02 FILLER                   PIC X(17)  VALUE
014400            "       COMPUTED=".
014500     02 COMPUTED-X.
014600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
014700     03 COMPUTED-N               REDEFINES COMPUTED-A
014800                                 PIC -9(9).9(9).
014900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
015000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
015100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015200     03       CM-18V0 REDEFINES COMPUTED-A.
015300         04 COMPUTED-18V0                    PIC -9(18).
015400         04 FILLER                           PIC X.
015500     03 FILLER PIC X(50) VALUE SPACE.
015600 01  TEST-CORRECT.
015700     02 FILLER PIC X(30) VALUE SPACE.
015800     02 FILLER PIC X(17) VALUE "       CORRECT =".
015900     02 CORRECT-X.
016000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
016100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
016300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
016400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
016500     03      CR-18V0 REDEFINES CORRECT-A.
016600         04 CORRECT-18V0                     PIC -9(18).
016700         04 FILLER                           PIC X.
016800     03 FILLER PIC X(2) VALUE SPACE.
016900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
017000 01  CCVS-C-1.
017100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017200-    "SS  PARAGRAPH-NAME
017300-    "       REMARKS".
017400     02 FILLER                     PIC X(20)    VALUE SPACE.
017500 01  CCVS-C-2.
017600     02 FILLER                     PIC X        VALUE SPACE.
017700     02 FILLER                     PIC X(6)     VALUE "TESTED".
017800     02 FILLER                     PIC X(15)    VALUE SPACE.
017900     02 FILLER                     PIC X(4)     VALUE "FAIL".
018000     02 FILLER                     PIC X(94)    VALUE SPACE.
018100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018200 01  REC-CT                        PIC 99       VALUE ZERO.
018300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
018400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
018500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
018600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
018700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
018800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
018900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
019000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
019100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019200 01  CCVS-H-1.
019300     02  FILLER                    PIC X(39)    VALUE SPACES.
019400     02  FILLER                    PIC X(42)    VALUE
019500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
019600     02  FILLER                    PIC X(39)    VALUE SPACES.
019700 01  CCVS-H-2A.
019800   02  FILLER                        PIC X(40)  VALUE SPACE.
019900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
020000   02  FILLER                        PIC XXXX   VALUE
020100     "4.2 ".
020200   02  FILLER                        PIC X(28)  VALUE
020300            " COPY - NOT FOR DISTRIBUTION".
020400   02  FILLER                        PIC X(41)  VALUE SPACE.
020500
020600 01  CCVS-H-2B.
020700   02  FILLER                        PIC X(15)  VALUE
020800            "TEST RESULT OF ".
020900   02  TEST-ID                       PIC X(9).
021000   02  FILLER                        PIC X(4)   VALUE
021100            " IN ".
021200   02  FILLER                        PIC X(12)  VALUE
021300     " HIGH       ".
021400   02  FILLER                        PIC X(22)  VALUE
021500            " LEVEL VALIDATION FOR ".
021600   02  FILLER                        PIC X(58)  VALUE
021700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021800 01  CCVS-H-3.
021900     02  FILLER                      PIC X(34)  VALUE
022000            " FOR OFFICIAL USE ONLY    ".
022100     02  FILLER                      PIC X(58)  VALUE
022200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022300     02  FILLER                      PIC X(28)  VALUE
022400            "  COPYRIGHT   1985 ".
022500 01  CCVS-E-1.
022600     02 FILLER                       PIC X(52)  VALUE SPACE.
022700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
022800     02 ID-AGAIN                     PIC X(9).
022900     02 FILLER                       PIC X(45)  VALUE SPACES.
023000 01  CCVS-E-2.
023100     02  FILLER                      PIC X(31)  VALUE SPACE.
023200     02  FILLER                      PIC X(21)  VALUE SPACE.
023300     02 CCVS-E-2-2.
023400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
023500         03 FILLER                   PIC X      VALUE SPACE.
023600         03 ENDER-DESC               PIC X(44)  VALUE
023700            "ERRORS ENCOUNTERED".
023800 01  CCVS-E-3.
023900     02  FILLER                      PIC X(22)  VALUE
024000            " FOR OFFICIAL USE ONLY".
024100     02  FILLER                      PIC X(12)  VALUE SPACE.
024200     02  FILLER                      PIC X(58)  VALUE
024300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024400     02  FILLER                      PIC X(13)  VALUE SPACE.
024500     02 FILLER                       PIC X(15)  VALUE
024600             " COPYRIGHT 1985".
024700 01  CCVS-E-4.
024800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
024900     02 FILLER                       PIC X(4)   VALUE " OF ".
025000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
025100     02 FILLER                       PIC X(40)  VALUE
025200      "  TESTS WERE EXECUTED SUCCESSFULLY".
025300 01  XXINFO.
025400     02 FILLER                       PIC X(19)  VALUE
025500            "*** INFORMATION ***".
025600     02 INFO-TEXT.
025700       04 FILLER                     PIC X(8)   VALUE SPACE.
025800       04 XXCOMPUTED                 PIC X(20).
025900       04 FILLER                     PIC X(5)   VALUE SPACE.
026000       04 XXCORRECT                  PIC X(20).
026100     02 INF-ANSI-REFERENCE           PIC X(48).
026200 01  HYPHEN-LINE.
026300     02 FILLER  PIC IS X VALUE IS SPACE.
026400     02 FILLER  PIC IS X(65)    VALUE IS "************************
026500-    "*****************************************".
026600     02 FILLER  PIC IS X(54)    VALUE IS "************************
026700-    "******************************".
026800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
026900     "NC125A".
027000 PROCEDURE DIVISION.
027100 CCVS1 SECTION.
027200 OPEN-FILES.
027300     OPEN     OUTPUT PRINT-FILE.
027400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027500     MOVE    SPACE TO TEST-RESULTS.
027600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
027700     GO TO CCVS1-EXIT.
027800 CLOSE-FILES.
027900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028000 TERMINATE-CCVS.
028100S    EXIT PROGRAM.
028200STERMINATE-CALL.
028300     STOP     RUN.
028400 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
028500 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
028600 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
028700 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
028800     MOVE "****TEST DELETED****" TO RE-MARK.
028900 PRINT-DETAIL.
029000     IF REC-CT NOT EQUAL TO ZERO
029100             MOVE "." TO PARDOT-X
029200             MOVE REC-CT TO DOTVALUE.
029300     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
029400     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
029500        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
029600          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
029700     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
029800     MOVE SPACE TO CORRECT-X.
029900     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030000     MOVE     SPACE TO RE-MARK.
030100 HEAD-ROUTINE.
030200     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030300     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030400     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
030500     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
030600 COLUMN-NAMES-ROUTINE.
030700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031000 END-ROUTINE.
031100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031200 END-RTN-EXIT.
031300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031400 END-ROUTINE-1.
031500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
031600      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
031700      ADD PASS-COUNTER TO ERROR-HOLD.
031800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
031900      MOVE PASS-COUNTER TO CCVS-E-4-1.
032000      MOVE ERROR-HOLD TO CCVS-E-4-2.
032100      MOVE CCVS-E-4 TO CCVS-E-2-2.
032200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
032300  END-ROUTINE-12.
032400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
032500     IF       ERROR-COUNTER IS EQUAL TO ZERO
032600         MOVE "NO " TO ERROR-TOTAL
032700         ELSE
032800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
032900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033000     PERFORM WRITE-LINE.
033100 END-ROUTINE-13.
033200     IF DELETE-COUNTER IS EQUAL TO ZERO
033300         MOVE "NO " TO ERROR-TOTAL  ELSE
033400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
033500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
033600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033700      IF   INSPECT-COUNTER EQUAL TO ZERO
033800          MOVE "NO " TO ERROR-TOTAL
033900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034300 WRITE-LINE.
034400     ADD 1 TO RECORD-COUNT.
034500Y    IF RECORD-COUNT GREATER 42
034600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
034700Y        MOVE SPACE TO DUMMY-RECORD
034800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
034900Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
035000Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
035100Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
035200Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
035300Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
035400Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
035500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
035600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
035700Y        MOVE ZERO TO RECORD-COUNT.
035800     PERFORM WRT-LN.
035900 WRT-LN.
036000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036100     MOVE SPACE TO DUMMY-RECORD.
036200 BLANK-LINE-PRINT.
036300     PERFORM WRT-LN.
036400 FAIL-ROUTINE.
036500     IF     COMPUTED-X NOT EQUAL TO SPACE
036600            GO TO FAIL-ROUTINE-WRITE.
036700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
036900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037100     MOVE   SPACES TO INF-ANSI-REFERENCE.
037200     GO TO  FAIL-ROUTINE-EX.
037300 FAIL-ROUTINE-WRITE.
037400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
037600     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
037700     MOVE   SPACES TO COR-ANSI-REFERENCE.
037800 FAIL-ROUTINE-EX. EXIT.
037900 BAIL-OUT.
038000     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038100     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038200 BAIL-OUT-WRITE.
038300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038600     MOVE   SPACES TO INF-ANSI-REFERENCE.
038700 BAIL-OUT-EX. EXIT.
038800 CCVS1-EXIT.
038900     EXIT.
039000 SECT-NC125A-001 SECTION.
039100 EDI-TEST-GF1.
039200     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
039300     MOVE "EDI-TEST-GF1" TO PAR-NAME.
039400     MOVE "l EDIT MOVE" TO FEATURE.
039500     MOVE 0 TO REC-CT.
039600     MOVE 0 TO CTR-1.
039700     MOVE ZERO TO TBL-001-O (1).
039800     MOVE .01  TO TBL-001-O (2).
039900     PERFORM EDI-TEST-GF1-R CRT-2 TIMES
040000     GO TO EDI-TEST-GF1-EXIT.
040100 EDI-TEST-GF1-DELETE.
040200     PERFORM  DE-LETE.
040300     PERFORM  PRINT-DETAIL.
040400     GO TO    EDI-TEST-GF1-EXIT.
040500 EDI-TEST-GF1-R.
040600     ADD 1 TO REC-CT.
040700     ADD 1 TO CTR-1.
040800     MOVE TBL-001-O (CTR-1) TO WRK-EDIT-001.
040900     IF WRK-EDIT-001 EQUAL TO TBL-002-O (CTR-1) PERFORM PASS
041000     ELSE MOVE W1 TO COMPUTED-X MOVE TBL-002-O (CTR-1) TO
041100         CORRECT-X
041200     PERFORM FAIL.
041300     PERFORM PRINT-DETAIL.
041400 EDI-TEST-GF1-EXIT.
041500     EXIT.
041600 EDI-TEST-GF2.
041700     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
041800     MOVE "EDI-TEST-GF2" TO PAR-NAME.
041900     MOVE "+ EDIT MOVE" TO FEATURE.
042000     MOVE 0 TO REC-CT.
042100     MOVE 0 TO CTR-1.
042200     MOVE ZERO TO TBL-001-O (1).
042300     MOVE .01  TO TBL-001-O (2).
042400     PERFORM EDI-TEST-GF2-R CRT-2 TIMES
042500     GO TO EDI-TEST-GF2-EXIT.
042600 EDI-TEST-GF2-DELETE.
042700     PERFORM  DE-LETE.
042800     PERFORM  PRINT-DETAIL.
042900     GO TO    EDI-TEST-GF2-EXIT.
043000 EDI-TEST-GF2-R.
043100     ADD 1 TO REC-CT.
043200     ADD 1 TO CTR-1.
043300     MOVE TBL-001-O (CTR-1) TO WRK-EDIT-002.
043400     IF WRK-EDIT-002 EQUAL TO TBL-003-O (CTR-1) PERFORM PASS
043500     ELSE MOVE W2 TO COMPUTED-X MOVE TBL-003-O (CTR-1) TO
043600         CORRECT-X
043700     PERFORM FAIL.
043800     PERFORM PRINT-DETAIL.
043900 EDI-TEST-GF2-EXIT.
044000     EXIT.
044100 EDI-TEST-GF3.
044200     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
044300     MOVE "EDI-TEST-GF3" TO PAR-NAME.
044400     MOVE "- EDIT MOVE" TO FEATURE.
044500     MOVE 0 TO REC-CT.
044600     MOVE 0 TO CTR-1.
044700     MOVE ZERO TO TBL-001-O (1).
044800     MOVE .01  TO TBL-001-O (2).
044900     PERFORM EDI-TEST-GF3-R CRT-2 TIMES
045000     GO TO EDI-TEST-GF3-EXIT.
045100 EDI-TEST-GF3-DELETE.
045200     PERFORM  DE-LETE.
045300     PERFORM  PRINT-DETAIL.
045400     GO TO    EDI-TEST-GF3-EXIT.
045500 EDI-TEST-GF3-R.
045600     ADD 1 TO REC-CT.
045700     ADD 1 TO CTR-1.
045800     MOVE TBL-001-O (CTR-1) TO WRK-EDIT-003.
045900     IF WRK-EDIT-003 EQUAL TO TBL-004-O (CTR-1) PERFORM PASS
046000     ELSE MOVE W3 TO COMPUTED-X MOVE TBL-004-O (CTR-1) TO
046100         CORRECT-X
046200     PERFORM FAIL.
046300     PERFORM PRINT-DETAIL.
046400 EDI-TEST-GF3-EXIT.
046500     EXIT.
046600 EDI-TEST-GF4.
046700     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
046800     MOVE "EDI-TEST-GF4" TO PAR-NAME.
046900     MOVE "* EDIT MOVE" TO FEATURE.
047000     MOVE 0 TO REC-CT.
047100     MOVE 0 TO CTR-1.
047200     MOVE ZERO TO TBL-001-O (1).
047300     MOVE .01  TO TBL-001-O (2).
047400     PERFORM EDI-TEST-GF4-R CRT-2 TIMES
047500     GO TO EDI-TEST-GF4-EXIT.
047600 EDI-TEST-GF4-DELETE.
047700     PERFORM  DE-LETE.
047800     PERFORM  PRINT-DETAIL.
047900     GO TO    EDI-TEST-GF4-EXIT.
048000 EDI-TEST-GF4-R.
048100     ADD 1 TO REC-CT.
048200     ADD 1 TO CTR-1.
048300     MOVE TBL-001-O (CTR-1) TO WRK-EDIT-004.
048400     IF WRK-EDIT-004 EQUAL TO TBL-005-O (CTR-1) PERFORM PASS
048500     ELSE MOVE W4 TO COMPUTED-X MOVE TBL-005-O (CTR-1) TO
048600         CORRECT-X
048700     PERFORM FAIL.
048800     PERFORM PRINT-DETAIL.
048900 EDI-TEST-GF4-EXIT.
049000     EXIT.
049100 EDI-TEST-GF5.
049200     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
049300     MOVE "EDI-TEST-GF5" TO PAR-NAME.
049400     MOVE "l EDIT ADD" TO FEATURE.
049500     MOVE 0 TO CTR-1.
049600     MOVE 0 TO CTR-3.
049700     MOVE 0 TO REC-CT.
049800     MOVE ZERO TO TBL-001-O (1).
049900     MOVE .01  TO TBL-001-O (2).
050000     PERFORM EDI-TEST-GF5-R CRT-2 TIMES
050100     GO TO EDI-TEST-GF5-EXIT.
050200 EDI-TEST-GF5-DELETE.
050300     PERFORM  DE-LETE.
050400     PERFORM  PRINT-DETAIL.
050500     GO TO    EDI-TEST-GF5-EXIT.
050600 EDI-TEST-GF5-R.
050700     ADD 1 TO REC-CT.
050800     ADD 1 TO CTR-1.
050900     ADD TBL-001-O (CTR-1)  CTR-3 GIVING WRK-EDIT-001.
051000     IF WRK-EDIT-001 EQUAL TO TBL-002-O (CTR-1) PERFORM PASS
051100     ELSE MOVE W1 TO COMPUTED-X MOVE TBL-002-O (CTR-1) TO
051200         CORRECT-X
051300     PERFORM FAIL.
051400     PERFORM PRINT-DETAIL.
051500 EDI-TEST-GF5-EXIT.
051600     EXIT.
051700 EDI-TEST-GF6.
051800     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
051900     MOVE "EDI-TEST-GF6" TO PAR-NAME.
052000     MOVE "+ EDIT ADD" TO FEATURE.
052100     MOVE 0 TO CTR-1.
052200     MOVE 0 TO CTR-3.
052300     MOVE 0 TO REC-CT.
052400     MOVE ZERO TO TBL-001-O (1).
052500     MOVE .01  TO TBL-001-O (2).
052600     PERFORM EDI-TEST-GF6-R CRT-2 TIMES
052700     GO TO EDI-TEST-GF6-EXIT.
052800 EDI-TEST-GF6-DELETE.
052900     PERFORM  DE-LETE.
053000     PERFORM  PRINT-DETAIL.
053100     GO TO    EDI-TEST-GF6-EXIT.
053200 EDI-TEST-GF6-R.
053300     ADD 1 TO REC-CT.
053400     ADD 1 TO CTR-1.
053500     ADD TBL-001-O (CTR-1)  CTR-3 GIVING WRK-EDIT-002.
053600     IF WRK-EDIT-002 EQUAL TO TBL-003-O (CTR-1) PERFORM PASS
053700     ELSE MOVE W2 TO COMPUTED-X MOVE TBL-003-O (CTR-1) TO
053800         CORRECT-X
053900     PERFORM FAIL.
054000     PERFORM PRINT-DETAIL.
054100 EDI-TEST-GF6-EXIT.
054200     EXIT.
054300 EDI-TEST-GF7.
054400     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
054500     MOVE "EDI-TEST-GF7" TO PAR-NAME.
054600     MOVE "- EDIT ADD" TO FEATURE.
054700     MOVE 0 TO CTR-1.
054800     MOVE 0 TO CTR-3.
054900     MOVE 0 TO REC-CT.
055000     MOVE ZERO TO TBL-001-O (1).
055100     MOVE .01  TO TBL-001-O (2).
055200     PERFORM EDI-TEST-GF7-R CRT-2 TIMES
055300     GO TO EDI-TEST-GF7-EXIT.
055400 EDI-TEST-GF7-DELETE.
055500     PERFORM  DE-LETE.
055600     PERFORM  PRINT-DETAIL.
055700     GO TO    EDI-TEST-GF7-EXIT.
055800 EDI-TEST-GF7-R.
055900     ADD 1 TO REC-CT.
056000     ADD 1 TO CTR-1.
056100     ADD TBL-001-O (CTR-1)  CTR-3 GIVING WRK-EDIT-003.
056200     IF WRK-EDIT-003 EQUAL TO TBL-004-O (CTR-1) PERFORM PASS
056300     ELSE MOVE W3 TO COMPUTED-X MOVE TBL-004-O (CTR-1) TO
056400         CORRECT-X
056500     PERFORM FAIL.
056600     PERFORM PRINT-DETAIL.
056700 EDI-TEST-GF7-EXIT.
056800     EXIT.
056900 EDI-TEST-GF8.
057000     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
057100     MOVE "EDI-TEST-GF8" TO PAR-NAME.
057200     MOVE "* EDIT ADD" TO FEATURE.
057300     MOVE 0 TO CTR-1.
057400     MOVE 0 TO CTR-3.
057500     MOVE 0 TO REC-CT.
057600     MOVE ZERO TO TBL-001-O (1).
057700     MOVE .01  TO TBL-001-O (2).
057800     PERFORM EDI-TEST-GF8-R CRT-2 TIMES
057900     GO TO EDI-TEST-GF8-EXIT.
058000 EDI-TEST-GF8-DELETE.
058100     PERFORM  DE-LETE.
058200     PERFORM  PRINT-DETAIL.
058300     GO TO    EDI-TEST-GF8-EXIT.
058400 EDI-TEST-GF8-R.
058500     ADD 1 TO REC-CT.
058600     ADD 1 TO CTR-1.
058700     ADD TBL-001-O (CTR-1)  CTR-3 GIVING WRK-EDIT-004.
058800     IF WRK-EDIT-004 EQUAL TO TBL-005-O (CTR-1) PERFORM PASS
058900     ELSE MOVE W4 TO COMPUTED-X MOVE TBL-005-O (CTR-1) TO
059000         CORRECT-X
059100     PERFORM FAIL.
059200     PERFORM PRINT-DETAIL.
059300 EDI-TEST-GF8-EXIT.
059400     EXIT.
059500 EDI-TEST-GF9.
059600     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
059700     MOVE "EDI-TEST-GF9" TO PAR-NAME.
059800     MOVE "l EDIT SUB" TO FEATURE.
059900     MOVE 0 TO CTR-1.
060000     MOVE 0 TO CTR-3.
060100     MOVE 0 TO REC-CT.
060200     MOVE ZERO TO TBL-001-O (1).
060300     MOVE .01  TO TBL-001-O (2).
060400     PERFORM EDI-TEST-GF9-R CRT-2 TIMES
060500     GO TO EDI-TEST-GF9-EXIT.
060600 EDI-TEST-GF9-DELETE.
060700     PERFORM  DE-LETE.
060800     PERFORM  PRINT-DETAIL.
060900     GO TO    EDI-TEST-GF9-EXIT.
061000 EDI-TEST-GF9-R.
061100     ADD 1 TO REC-CT.
061200     ADD 1 TO CTR-1.
061300     SUBTRACT TBL-001-O (CTR-1) FROM CTR-3 GIVING WRK-EDIT-001.
061400     IF WRK-EDIT-001 EQUAL TO TBL-002-O (CTR-1) PERFORM PASS
061500     ELSE MOVE W1 TO COMPUTED-X MOVE TBL-002-O (CTR-1) TO
061600         CORRECT-X
061700     PERFORM FAIL.
061800     PERFORM PRINT-DETAIL.
061900 EDI-TEST-GF9-EXIT.
062000     EXIT.
062100 EDI-TEST-GF10.
062200     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
062300     MOVE "EDI-TEST-GF10" TO PAR-NAME.
062400     MOVE "+ EDIT SUB" TO FEATURE.
062500     MOVE 0 TO CTR-1.
062600     MOVE 0 TO CTR-3.
062700     MOVE 0 TO REC-CT.
062800     MOVE ZERO TO TBL-001-O (1).
062900     MOVE .01  TO TBL-001-O (2).
063000     MOVE "                     +.00" TO TBL-006-O (1).
063100     PERFORM EDI-TEST-GF10-R CRT-2 TIMES
063200     GO TO EDI-TEST-GF10-EXIT.
063300 EDI-TEST-GF10-DELETE.
063400     PERFORM  DE-LETE.
063500     PERFORM  PRINT-DETAIL.
063600     GO TO    EDI-TEST-GF10-EXIT.
063700 EDI-TEST-GF10-R.
063800     ADD 1 TO REC-CT.
063900     ADD 1 TO CTR-1.
064000     SUBTRACT TBL-001-O (CTR-1) FROM CTR-3 GIVING WRK-EDIT-002.
064100     IF WRK-EDIT-002 EQUAL TO TBL-006-O (CTR-1) PERFORM PASS
064200     ELSE MOVE W2 TO COMPUTED-X MOVE TBL-006-O (CTR-1) TO
064300         CORRECT-X
064400     PERFORM FAIL.
064500     PERFORM PRINT-DETAIL.
064600 EDI-TEST-GF10-EXIT.
064700     EXIT.
064800 EDI-TEST-GF11.
064900     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
065000     MOVE "EDI-TEST-GF11" TO PAR-NAME.
065100     MOVE "- EDIT SUB" TO FEATURE.
065200     MOVE 0 TO CTR-1.
065300     MOVE 0 TO CTR-3.
065400     MOVE 0 TO REC-CT.
065500     MOVE ZERO TO TBL-001-O (1).
065600     MOVE .01  TO TBL-001-O (2).
065700     MOVE "                      .00" TO TBL-006-O (1).
065800     PERFORM EDI-TEST-GF11-R CRT-2 TIMES
065900     GO TO EDI-TEST-GF11-EXIT.
066000 EDI-TEST-GF11-DELETE.
066100     PERFORM  DE-LETE.
066200     PERFORM  PRINT-DETAIL.
066300     GO TO    EDI-TEST-GF11-EXIT.
066400 EDI-TEST-GF11-R.
066500     ADD 1 TO REC-CT.
066600     ADD 1 TO CTR-1.
066700     SUBTRACT TBL-001-O (CTR-1) FROM CTR-3 GIVING WRK-EDIT-003.
066800     IF WRK-EDIT-003 EQUAL TO TBL-006-O (CTR-1) PERFORM PASS
066900     ELSE MOVE W3 TO COMPUTED-X MOVE TBL-006-O (CTR-1) TO
067000         CORRECT-X
067100     PERFORM FAIL.
067200     PERFORM PRINT-DETAIL.
067300 EDI-TEST-GF11-EXIT.
067400     EXIT.
067500 EDI-TEST-GF12.
067600     MOVE "VI-34 5.9.5 (7), (8)" TO ANSI-REFERENCE.
067700     MOVE "EDI-TEST-GF12" TO PAR-NAME.
067800     MOVE "* EDIT SUB" TO FEATURE.
067900     MOVE 0 TO CTR-1.
068000     MOVE 0 TO CTR-3.
068100     MOVE 0 TO REC-CT.
068200     MOVE ZERO TO TBL-001-O (1).
068300     MOVE .01  TO TBL-001-O (2).
068400     PERFORM EDI-TEST-GF12-R CRT-2 TIMES
068500     GO TO EDI-TEST-GF12-EXIT.
068600 EDI-TEST-GF12-DELETE.
068700     PERFORM  DE-LETE.
068800     PERFORM  PRINT-DETAIL.
068900     GO TO    EDI-TEST-GF12-EXIT.
069000 EDI-TEST-GF12-R.
069100     ADD 1 TO REC-CT.
069200     ADD 1 TO CTR-1.
069300     SUBTRACT TBL-001-O (CTR-1) FROM CTR-3 GIVING WRK-EDIT-004.
069400     IF WRK-EDIT-004 EQUAL TO TBL-005-O (CTR-1) PERFORM PASS
069500     ELSE MOVE W4 TO COMPUTED-X MOVE TBL-005-O (CTR-1) TO
069600         CORRECT-X
069700     PERFORM FAIL.
069800     PERFORM PRINT-DETAIL.
069900 EDI-TEST-GF12-EXIT.
070000     EXIT.
070100*
070200 EDI-INIT-GF-13.
070300     MOVE   "VI-33 5.9.5 (4), (5)" TO ANSI-REFERENCE.
070400     MOVE   "EDI-TEST-GF-13"       TO PAR-NAME.
070500     MOVE   "COMMA AS LAST SYMBOL" TO FEATURE.
070600 EDI-TEST-GF-13-0.
070700     MOVE    123456789012 TO WRK-EDIT-005.
070800 EDI-TEST-GF-13-1.
070900     IF      WRK-EDIT-005 = "1,2,3,4,5,6,7,8,9,0,1,2,"
071000             PERFORM PASS
071100     ELSE
071200             GO TO   EDI-FAIL-GF-13.
071300     GO TO   EDI-WRITE-GF-13.
071400 EDI-DELETE-GF-13.
071500     PERFORM DE-LETE.
071600     PERFORM PRINT-DETAIL.
071700     GO TO   EDI-INIT-GF-14.
071800 EDI-FAIL-GF-13.
071900     MOVE   "1,2,3,4,5,6,7,8,9,0,1,2," TO CORRECT-X.
072000     MOVE    W5 TO COMPUTED-X.
072100     PERFORM FAIL.
072200 EDI-WRITE-GF-13.
072300     PERFORM PRINT-DETAIL.
072400*
072500 EDI-INIT-GF-14.
072600     MOVE   "VI-34 5.9.5 (4), (5)" TO ANSI-REFERENCE.
072700     MOVE   "EDI-TEST-GF-14"       TO PAR-NAME.
072800     MOVE   "PERIOD LAST SYMBOL"   TO FEATURE.
072900 EDI-TEST-GF-14-0.
073000     MOVE    123456789012 TO WRK-EDIT-006.
073100 EDI-TEST-GF-14-1.
073200     IF      WRK-EDIT-006 = "123456789012."
073300             PERFORM PASS
073400     ELSE
073500             GO TO   EDI-FAIL-GF-14.
073600     GO TO   EDI-WRITE-GF-14.
073700 EDI-DELETE-GF-14.
073800     PERFORM DE-LETE.
073900     PERFORM PRINT-DETAIL.
074000     GO TO   EDI-INIT-GF-14.
074100 EDI-FAIL-GF-14.
074200     MOVE   "123456789012." TO CORRECT-X.
074300     MOVE    W6 TO COMPUTED-X.
074400     PERFORM FAIL.
074500 EDI-WRITE-GF-14.
074600     PERFORM PRINT-DETAIL.
074700*
074800 CCVS-EXIT SECTION.
074900 CCVS-999999.
075000     GO TO CLOSE-FILES.
