000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC132A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC132A TESTS THE USE OF SUBSCRIPTS TO ACCESS A
002300*    SINGLE LEVEL TABLE USING INTEGER DISPLAY AND COMPUTATIONAL
002400*    FIELDS AS SUBSCRIPTS.
002500*
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 77  CON-1             PICTURE 9  VALUE 1.
004300 77  CON-2             PICTURE 9  VALUE 2.
004400 77  CON-3             PICTURE 9  VALUE 3.
004500 77  CON-4             PICTURE 9  VALUE 4.
004600 77  SUB-3  PICTURE S9(18) COMPUTATIONAL VALUE 2.
004700 77  SUB-4  PICTURE 9(18)  COMPUTATIONAL VALUE 4.
004800 01  CONSTANTS-77.
004900     02  SUB1   PICTURE 9  VALUE  1.
005000     02  SUB2   PICTURE  S9  VALUE  +4.
005100     02  TABLE-A-VALUES   PICTURE X(20) VALUE "1112223334441122334
005200-    "4".
005300 01  TABLE-A.
005400     02  ENTRY-A-1   PICTURE XXX   OCCURS  4 TIMES.
005500     02  ENTRY-A-2   OCCURS  4 TIMES.
005600       03  ENTRY-A-3    PICTURE   X.
005700       03  ENTRY-A-4    PICTURE   X.
005800 01  TABLE-B.
005900     02  ENTRY-B-1  PICTURE X(4)  VALUE  "1234".
006000     02  ENTRY-B-2  REDEFINES  ENTRY-B-1  PICTURE  9 OCCURS  4.
006100 01  TABLE-C.
006200     02  ENTRY-C    PICTURE 9  OCCURS  4 TIMES.
006300 01  TEST-RESULTS.
006400     02 FILLER                   PIC X      VALUE SPACE.
006500     02 FEATURE                  PIC X(20)  VALUE SPACE.
006600     02 FILLER                   PIC X      VALUE SPACE.
006700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006800     02 FILLER                   PIC X      VALUE SPACE.
006900     02  PAR-NAME.
007000       03 FILLER                 PIC X(19)  VALUE SPACE.
007100       03  PARDOT-X              PIC X      VALUE SPACE.
007200       03 DOTVALUE               PIC 99     VALUE ZERO.
007300     02 FILLER                   PIC X(8)   VALUE SPACE.
007400     02 RE-MARK                  PIC X(61).
007500 01  TEST-COMPUTED.
007600     02 FILLER                   PIC X(30)  VALUE SPACE.
007700     02 FILLER                   PIC X(17)  VALUE
007800            "       COMPUTED=".
007900     02 COMPUTED-X.
008000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
008100     03 COMPUTED-N               REDEFINES COMPUTED-A
008200                                 PIC -9(9).9(9).
008300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
008400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
008500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
008600     03       CM-18V0 REDEFINES COMPUTED-A.
008700         04 COMPUTED-18V0                    PIC -9(18).
008800         04 FILLER                           PIC X.
008900     03 FILLER PIC X(50) VALUE SPACE.
009000 01  TEST-CORRECT.
009100     02 FILLER PIC X(30) VALUE SPACE.
009200     02 FILLER PIC X(17) VALUE "       CORRECT =".
009300     02 CORRECT-X.
009400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
009500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
009600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
009700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009900     03      CR-18V0 REDEFINES CORRECT-A.
010000         04 CORRECT-18V0                     PIC -9(18).
010100         04 FILLER                           PIC X.
010200     03 FILLER PIC X(2) VALUE SPACE.
010300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
010400 01  CCVS-C-1.
010500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
010600-    "SS  PARAGRAPH-NAME
010700-    "       REMARKS".
010800     02 FILLER                     PIC X(20)    VALUE SPACE.
010900 01  CCVS-C-2.
011000     02 FILLER                     PIC X        VALUE SPACE.
011100     02 FILLER                     PIC X(6)     VALUE "TESTED".
011200     02 FILLER                     PIC X(15)    VALUE SPACE.
011300     02 FILLER                     PIC X(4)     VALUE "FAIL".
011400     02 FILLER                     PIC X(94)    VALUE SPACE.
011500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
011600 01  REC-CT                        PIC 99       VALUE ZERO.
011700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
011800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
011900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
012100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
012200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
012300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
012400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
012500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
012600 01  CCVS-H-1.
012700     02  FILLER                    PIC X(39)    VALUE SPACES.
012800     02  FILLER                    PIC X(42)    VALUE
012900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013000     02  FILLER                    PIC X(39)    VALUE SPACES.
013100 01  CCVS-H-2A.
013200   02  FILLER                        PIC X(40)  VALUE SPACE.
013300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
013400   02  FILLER                        PIC XXXX   VALUE
013500     "4.2 ".
013600   02  FILLER                        PIC X(28)  VALUE
013700            " COPY - NOT FOR DISTRIBUTION".
013800   02  FILLER                        PIC X(41)  VALUE SPACE.
013900
014000 01  CCVS-H-2B.
014100   02  FILLER                        PIC X(15)  VALUE
014200            "TEST RESULT OF ".
014300   02  TEST-ID                       PIC X(9).
014400   02  FILLER                        PIC X(4)   VALUE
014500            " IN ".
014600   02  FILLER                        PIC X(12)  VALUE
014700     " HIGH       ".
014800   02  FILLER                        PIC X(22)  VALUE
014900            " LEVEL VALIDATION FOR ".
015000   02  FILLER                        PIC X(58)  VALUE
015100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015200 01  CCVS-H-3.
015300     02  FILLER                      PIC X(34)  VALUE
015400            " FOR OFFICIAL USE ONLY    ".
015500     02  FILLER                      PIC X(58)  VALUE
015600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
015700     02  FILLER                      PIC X(28)  VALUE
015800            "  COPYRIGHT   1985 ".
015900 01  CCVS-E-1.
016000     02 FILLER                       PIC X(52)  VALUE SPACE.
016100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
016200     02 ID-AGAIN                     PIC X(9).
016300     02 FILLER                       PIC X(45)  VALUE SPACES.
016400 01  CCVS-E-2.
016500     02  FILLER                      PIC X(31)  VALUE SPACE.
016600     02  FILLER                      PIC X(21)  VALUE SPACE.
016700     02 CCVS-E-2-2.
016800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
016900         03 FILLER                   PIC X      VALUE SPACE.
017000         03 ENDER-DESC               PIC X(44)  VALUE
017100            "ERRORS ENCOUNTERED".
017200 01  CCVS-E-3.
017300     02  FILLER                      PIC X(22)  VALUE
017400            " FOR OFFICIAL USE ONLY".
017500     02  FILLER                      PIC X(12)  VALUE SPACE.
017600     02  FILLER                      PIC X(58)  VALUE
017700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017800     02  FILLER                      PIC X(13)  VALUE SPACE.
017900     02 FILLER                       PIC X(15)  VALUE
018000             " COPYRIGHT 1985".
018100 01  CCVS-E-4.
018200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
018300     02 FILLER                       PIC X(4)   VALUE " OF ".
018400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
018500     02 FILLER                       PIC X(40)  VALUE
018600      "  TESTS WERE EXECUTED SUCCESSFULLY".
018700 01  XXINFO.
018800     02 FILLER                       PIC X(19)  VALUE
018900            "*** INFORMATION ***".
019000     02 INFO-TEXT.
019100       04 FILLER                     PIC X(8)   VALUE SPACE.
019200       04 XXCOMPUTED                 PIC X(20).
019300       04 FILLER                     PIC X(5)   VALUE SPACE.
019400       04 XXCORRECT                  PIC X(20).
019500     02 INF-ANSI-REFERENCE           PIC X(48).
019600 01  HYPHEN-LINE.
019700     02 FILLER  PIC IS X VALUE IS SPACE.
019800     02 FILLER  PIC IS X(65)    VALUE IS "************************
019900-    "*****************************************".
020000     02 FILLER  PIC IS X(54)    VALUE IS "************************
020100-    "******************************".
020200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
020300     "NC132A".
020400 PROCEDURE DIVISION.
020500 CCVS1 SECTION.
020600 OPEN-FILES.
020700     OPEN     OUTPUT PRINT-FILE.
020800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
020900     MOVE    SPACE TO TEST-RESULTS.
021000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
021100     GO TO CCVS1-EXIT.
021200 CLOSE-FILES.
021300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
021400 TERMINATE-CCVS.
021500S    EXIT PROGRAM.
021600STERMINATE-CALL.
021700     STOP     RUN.
021800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
021900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
022100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
022200     MOVE "****TEST DELETED****" TO RE-MARK.
022300 PRINT-DETAIL.
022400     IF REC-CT NOT EQUAL TO ZERO
022500             MOVE "." TO PARDOT-X
022600             MOVE REC-CT TO DOTVALUE.
022700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
022800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
022900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
023100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
023200     MOVE SPACE TO CORRECT-X.
023300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
023400     MOVE     SPACE TO RE-MARK.
023500 HEAD-ROUTINE.
023600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024000 COLUMN-NAMES-ROUTINE.
024100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
024400 END-ROUTINE.
024500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
024600 END-RTN-EXIT.
024700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024800 END-ROUTINE-1.
024900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
025100      ADD PASS-COUNTER TO ERROR-HOLD.
025200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
025300      MOVE PASS-COUNTER TO CCVS-E-4-1.
025400      MOVE ERROR-HOLD TO CCVS-E-4-2.
025500      MOVE CCVS-E-4 TO CCVS-E-2-2.
025600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
025700  END-ROUTINE-12.
025800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
025900     IF       ERROR-COUNTER IS EQUAL TO ZERO
026000         MOVE "NO " TO ERROR-TOTAL
026100         ELSE
026200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
026300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
026400     PERFORM WRITE-LINE.
026500 END-ROUTINE-13.
026600     IF DELETE-COUNTER IS EQUAL TO ZERO
026700         MOVE "NO " TO ERROR-TOTAL  ELSE
026800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
026900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027100      IF   INSPECT-COUNTER EQUAL TO ZERO
027200          MOVE "NO " TO ERROR-TOTAL
027300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
027400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
027500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027700 WRITE-LINE.
027800     ADD 1 TO RECORD-COUNT.
027900Y    IF RECORD-COUNT GREATER 42
028000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
028100Y        MOVE SPACE TO DUMMY-RECORD
028200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
028300Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028400Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028500Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
028600Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
028700Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
028800Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
028900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029100Y        MOVE ZERO TO RECORD-COUNT.
029200     PERFORM WRT-LN.
029300 WRT-LN.
029400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
029500     MOVE SPACE TO DUMMY-RECORD.
029600 BLANK-LINE-PRINT.
029700     PERFORM WRT-LN.
029800 FAIL-ROUTINE.
029900     IF     COMPUTED-X NOT EQUAL TO SPACE
030000            GO TO FAIL-ROUTINE-WRITE.
030100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
030400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030500     MOVE   SPACES TO INF-ANSI-REFERENCE.
030600     GO TO  FAIL-ROUTINE-EX.
030700 FAIL-ROUTINE-WRITE.
030800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
030900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
031000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
031100     MOVE   SPACES TO COR-ANSI-REFERENCE.
031200 FAIL-ROUTINE-EX. EXIT.
031300 BAIL-OUT.
031400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
031500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
031600 BAIL-OUT-WRITE.
031700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
031800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032000     MOVE   SPACES TO INF-ANSI-REFERENCE.
032100 BAIL-OUT-EX. EXIT.
032200 CCVS1-EXIT.
032300     EXIT.
032400 SECT-TH132A-001 SECTION.
032500 TH-02-001.
032600     MOVE "IV-21 4.3.8.2" TO ANSI-REFERENCE.
032700     MOVE TABLE-A-VALUES  TO  TABLE-A.
032800     MOVE  "SUBSCRIPTING"  TO FEATURE.
032900 SUB-SCRIPT-1.
033000     IF TABLE-A IS NOT EQUAL TO TABLE-A-VALUES
033100     GO TO  SUB-SCRIPT-1B.
033200     PERFORM PASS.
033300     GO TO  SUB-SCRIPT-1C.
033400 SUB-SCRIPT-1A.
033500     PERFORM DE-LETE.
033600     GO TO SUB-SCRIPT-1C.
033700 SUB-SCRIPT-1B.
033800     PERFORM FAIL.
033900     MOVE TABLE-A TO COMPUTED-A.
034000     MOVE   "11122233344411223344" TO CORRECT-A.
034100 SUB-SCRIPT-1C.
034200     MOVE "SUB-SCRIPT-1" TO PAR-NAME.
034300     PERFORM PRINT-DETAIL.
034400*    NOTE    *******  THIS  TEST CHECKS TO SEE  THAT THE TABLE
034500*                     TO BE USED IN THE PROGRAM IS SET UP
034600*                     CORRECTLY.
034700 SUB-SCRIPT-2.
034800     IF  ENTRY-A-1 (1) NOT EQUAL TO "111"
034900     GO TO SUB-SCRIPT-2B.
035000     PERFORM PASS.
035100     GO TO SUB-SCRIPT-2C.
035200 SUB-SCRIPT-2A.
035300     PERFORM DE-LETE.
035400     GO TO SUB-SCRIPT-2C.
035500 SUB-SCRIPT-2B.
035600     PERFORM FAIL.
035700     MOVE ENTRY-A-1 (1) TO COMPUTED-A
035800     MOVE "111" TO CORRECT-A.
035900 SUB-SCRIPT-2C.
036000     MOVE "SUB-SCRIPT-2" TO PAR-NAME.
036100     PERFORM  PRINT-DETAIL.
036200*    NOTE   ******   THIS CHECKS THE USE OF NUMERIC  LITERALS
036300*                    AS SUBSCRIPTS.
036400 SUB-SCRIPT-3.
036500     IF ENTRY-A-1 (SUB1)    NOT EQUAL TO "111"
036600     GO TO SUB-SCRIPT-3B.
036700     PERFORM PASS.
036800     GO TO SUB-SCRIPT-3C.
036900 SUB-SCRIPT-3A.
037000     PERFORM DE-LETE.
037100     GO TO SUB-SCRIPT-3C.
037200 SUB-SCRIPT-3B.
037300     PERFORM FAIL.
037400     MOVE ENTRY-A-1 (SUB1) TO COMPUTED-A.
037500     MOVE "111" TO CORRECT-A.
037600 SUB-SCRIPT-3C.
037700     MOVE "SUB-SCRIPT-3" TO PAR-NAME.
037800     PERFORM PRINT-DETAIL.
037900*    NOTE  *******      THIS CHECKS THE USE OF UNSIGNED
038000*                       CONSTANTS AS SUBSCRIPTS.
038100 SUB-SCRIPT-4.
038200     ADD 1 TO SUB1.
038300     IF ENTRY-A-1 (SUB1) NOT EQUAL TO "222"
038400     GO TO SUB-SCRIPT-4B.
038500     PERFORM PASS.
038600     GO TO SUB-SCRIPT-4C.
038700 SUB-SCRIPT-4A.
038800     PERFORM DE-LETE.
038900     GO TO SUB-SCRIPT-4C.
039000 SUB-SCRIPT-4B.
039100     PERFORM FAIL.
039200     MOVE ENTRY-A-1 (SUB1) TO COMPUTED-A.
039300     MOVE "222" TO CORRECT-A.
039400 SUB-SCRIPT-4C.
039500     MOVE "SUB-SCRIPT-4" TO  PAR-NAME.
039600     PERFORM PRINT-DETAIL.
039700*    NOTE  *******    THIS CHECKS THE VARYING OF AN
039800*                     UNSIGNED SUBSCRIPT.
039900 SUB-SCRIPT-5.
040000     MOVE +4 TO SUB2.
040100     IF ENTRY-A-1 (SUB2)  NOT EQUAL TO "444"
040200     GO TO  SUB-SCRIPT-5B.
040300     PERFORM PASS.
040400     GO TO SUB-SCRIPT-5C.
040500 SUB-SCRIPT-5A.
040600     PERFORM DE-LETE.
040700     GO TO SUB-SCRIPT-5C.
040800 SUB-SCRIPT-5B.
040900     PERFORM FAIL.
041000     MOVE ENTRY-A-1 (SUB2) TO COMPUTED-A.
041100     MOVE "444" TO CORRECT-A.
041200 SUB-SCRIPT-5C.
041300     MOVE "SUB-SCRIPT-5" TO  PAR-NAME.
041400     PERFORM PRINT-DETAIL.
041500*    NOTE  ******  THIS CHECKS THE USE OF A SIGNED
041600*                  CONSTANT AS SUBSCRIPTS.
041700 SUB-SCRIPT-6.
041800     SUBTRACT  +1 FROM SUB2.
041900     IF ENTRY-A-1 (SUB2)  NOT EQUAL TO "333"
042000     GO TO SUB-SCRIPT-6B.
042100     PERFORM PASS.
042200     GO TO SUB-SCRIPT-6C.
042300 SUB-SCRIPT-6A.
042400     PERFORM DE-LETE.
042500     GO TO SUB-SCRIPT-6C.
042600 SUB-SCRIPT-6B.
042700     PERFORM FAIL.
042800     MOVE ENTRY-A-1 (SUB2) TO COMPUTED-A.
042900     MOVE "333" TO CORRECT-A.
043000 SUB-SCRIPT-6C.
043100     MOVE "SUB-SCRIPT-6" TO PAR-NAME.
043200     PERFORM PRINT-DETAIL.
043300*    NOTE  ******   THIS CHECKS THE VARYING OF A
043400*                   SIGNED SUBSCRIPT.
043500*SUB-SCRIPT-7.
043600*    THIS TEST WAS DELETED BY THE FCCTS SINCE IT DID NOT
043700*    APPLY TO THE REVISED FEDERAL STANDARD - FIPS PUB 21-1.
043800 SUB-SCRIPT-8.
043900     IF ENTRY-A-3 (2)  NOT EQUAL TO "2"
044000     GO TO SUB-SCRIPT-8B.
044100     PERFORM PASS.
044200     GO TO SUB-SCRIPT-8C.
044300 SUB-SCRIPT-8A.
044400     PERFORM DE-LETE.
044500     GO TO SUB-SCRIPT-8C.
044600 SUB-SCRIPT-8B.
044700     PERFORM FAIL.
044800     MOVE ENTRY-A-3 (2) TO COMPUTED-A.
044900     MOVE "2" TO CORRECT-A.
045000 SUB-SCRIPT-8C.
045100     MOVE "SUB-SCRIPT-8" TO PAR-NAME.
045200     PERFORM PRINT-DETAIL.
045300*    NOTE  *****  THIS CHECKS THE USE OF AN ELEMENTARY ITEM
045400*                 WHEN THE GROUP ITEM HAS THE OCCURS.
045500 SUB-SCRIPT-9.
045600     IF ENTRY-A-2 (4)    NOT EQUAL TO  "44"
045700     GO TO SUB-SCRIPT-9B.
045800     PERFORM PASS.
045900     GO TO SUB-SCRIPT-9C.
046000 SUB-SCRIPT-9A.
046100     PERFORM DE-LETE.
046200     GO TO SUB-SCRIPT-9C.
046300 SUB-SCRIPT-9B.
046400     PERFORM FAIL.
046500     MOVE ENTRY-A-2 (4) TO COMPUTED-A.
046600     MOVE "44" TO CORRECT-A.
046700 SUB-SCRIPT-9C.
046800     MOVE "SUB-SCRIPT-9" TO PAR-NAME.
046900     PERFORM PRINT-DETAIL.
047000*    NOTE  *******  THIS CHECKS A GROUP ITEM WHEN IT
047100*                   HAS THE OCCURS.
047200 SUB-SCRIPT-10.
047300     IF ENTRY-B-2 (1)  NOT EQUAL TO "1"
047400     GO TO SUB-SCRIPT-10B.
047500     PERFORM PASS.
047600     GO TO SUB-SCRIPT-10C.
047700 SUB-SCRIPT-10A.
047800     PERFORM DE-LETE.
047900     GO TO SUB-SCRIPT-10C.
048000 SUB-SCRIPT-10B.
048100     PERFORM FAIL.
048200     MOVE ENTRY-B-2 (1) TO COMPUTED-A.
048300     MOVE "1" TO CORRECT-A.
048400 SUB-SCRIPT-10C.
048500     MOVE "SUB-SCRIPT-10" TO PAR-NAME.
048600     PERFORM PRINT-DETAIL.
048700*    NOTE   ******  THIS CHECKS THE USE OF THE REDEFINE.
048800 SUB-SCRIPT-11.
048900     MOVE  ENTRY-B-2 (1) TO ENTRY-C (4).
049000     MOVE  ENTRY-B-2 (2) TO ENTRY-C (3).
049100     MOVE  ENTRY-B-2 (3) TO ENTRY-C (2).
049200     MOVE  ENTRY-B-2 (4) TO ENTRY-C (1).
049300     IF TABLE-C    NOT  EQUAL TO "4321"
049400     GO TO SUB-SCRIPT-11B.
049500     PERFORM PASS.
049600     GO TO SUB-SCRIPT-11C.
049700 SUB-SCRIPT-11A.
049800     PERFORM DE-LETE.
049900     GO TO SUB-SCRIPT-11C.
050000 SUB-SCRIPT-11B.
050100     PERFORM FAIL.
050200     MOVE TABLE-C TO COMPUTED-A.
050300     MOVE "4321" TO CORRECT-A.
050400 SUB-SCRIPT-11C.
050500     MOVE "SUB-SCRIPT-11" TO PAR-NAME.
050600     PERFORM PRINT-DETAIL.
050700 SUB-SCRIPT-12.
050800     MOVE "0000" TO TABLE-C.
050900     ADD ENTRY-B-2 (1) TO ENTRY-C (1).
051000     ADD ENTRY-B-2 (2) TO ENTRY-C (2).
051100     ADD ENTRY-B-2 (3) TO ENTRY-C (3).
051200     ADD ENTRY-B-2 (4) TO ENTRY-C (4).
051300     IF TABLE-C NOT EQUAL TO "1234"
051400     GO TO SUB-SCRIPT-12B.
051500     PERFORM PASS.
051600     GO TO SUB-SCRIPT-12C.
051700 SUB-SCRIPT-12A.
051800     PERFORM DE-LETE.
051900     GO TO SUB-SCRIPT-12C.
052000 SUB-SCRIPT-12B.
052100     PERFORM FAIL.
052200     MOVE TABLE-C TO COMPUTED-A.
052300     MOVE "1234" TO CORRECT-A.
052400 SUB-SCRIPT-12C.
052500     MOVE "SUB-SCRIPT-12" TO PAR-NAME.
052600     PERFORM  PRINT-DETAIL.
052700*    THIS TEST CHECKS THE USE OF SUBSCRIPTED DATA-NAMES
052800*    IN AN ADD STATEMENT
052900 SUB-SCRIPT-13.
053000     MOVE  "1234" TO TABLE-C.
053100     SUBTRACT ENTRY-B-2 (1) FROM ENTRY-C (1).
053200     SUBTRACT ENTRY-B-2 (2) FROM ENTRY-C (2).
053300     SUBTRACT ENTRY-B-2 (3) FROM ENTRY-C (3).
053400     SUBTRACT ENTRY-B-2 (4) FROM ENTRY-C (4).
053500     IF TABLE-C  NOT EQUAL TO  "0000"
053600     GO TO  SUB-SCRIPT-13B.
053700     PERFORM PASS.
053800     GO TO SUB-SCRIPT-13C.
053900 SUB-SCRIPT-13A.
054000     PERFORM DE-LETE.
054100     GO TO SUB-SCRIPT-13C.
054200 SUB-SCRIPT-13B.
054300     PERFORM FAIL.
054400     MOVE TABLE-C TO COMPUTED-A.
054500     MOVE "0000" TO CORRECT-A.
054600 SUB-SCRIPT-13C.
054700     MOVE "SUB-SCRIPT-13" TO PAR-NAME.
054800     PERFORM  PRINT-DETAIL.
054900*    THIS TEST CHECKS THE USE OF SUBSCRIPTED DATA-NAMES
055000*    IN A SUBTRACT STATEMENT.
055100 SUB-SCRIPT-14.
055200     MOVE "1111" TO TABLE-C.
055300     MULTIPLY ENTRY-B-2 (1) BY ENTRY-C (1).
055400     MULTIPLY ENTRY-B-2 (2) BY ENTRY-C (2).
055500     MULTIPLY ENTRY-B-2 (3) BY ENTRY-C (3).
055600     MULTIPLY ENTRY-B-2 (4) BY ENTRY-C (4).
055700     IF TABLE-C  NOT EQUAL TO "1234"
055800     GO TO SUB-SCRIPT-14B.
055900     PERFORM PASS.
056000     GO TO SUB-SCRIPT-14C.
056100 SUB-SCRIPT-14A.
056200     PERFORM DE-LETE.
056300     GO TO SUB-SCRIPT-14C.
056400 SUB-SCRIPT-14B.
056500     PERFORM FAIL.
056600     MOVE TABLE-C TO COMPUTED-A.
056700     MOVE "1234" TO CORRECT-A.
056800 SUB-SCRIPT-14C.
056900     MOVE  "SUB-SCRIPT-14" TO PAR-NAME.
057000     PERFORM  PRINT-DETAIL.
057100*    THIS TEST CHECKS THE USE OF SUBSCRIPTED DATA-NAMES
057200*    IN A MULTIPLY STATEMENT.
057300 SUB-SCRIPT-15.
057400     MOVE  "1234" TO TABLE-C.
057500     DIVIDE  ENTRY-B-2 (1) INTO ENTRY-C (1).
057600     DIVIDE  ENTRY-B-2 (2) INTO ENTRY-C (2).
057700     DIVIDE  ENTRY-B-2 (3) INTO ENTRY-C (3).
057800     DIVIDE  ENTRY-B-2 (4) INTO ENTRY-C (4).
057900     IF  TABLE-C  NOT EQUAL TO "1111"
058000     GO TO  SUB-SCRIPT-15B.
058100     PERFORM PASS.
058200     GO TO SUB-SCRIPT-15C.
058300 SUB-SCRIPT-15A.
058400     PERFORM DE-LETE.
058500     GO TO  SUB-SCRIPT-15C.
058600 SUB-SCRIPT-15B.
058700     PERFORM FAIL.
058800     MOVE TABLE-C TO COMPUTED-A.
058900     MOVE "1111" TO CORRECT-A.
059000 SUB-SCRIPT-15C.
059100     MOVE "SUB-SCRIPT-15" TO PAR-NAME.
059200     PERFORM PRINT-DETAIL.
059300*    THIS TEST CHECKS THE USE OF SUBSCRIPTED DATA-NAMES
059400*    IN A DIVIDE STATEMENT.
059500     MOVE TABLE-A-VALUES TO TABLE-A.
059600 SUB-SCRIPT-16.
059700     IF ENTRY-A-1 (SUB-3) EQUAL TO "222"
059800         PERFORM PASS
059900         GO TO SUB-SCRIPT-16B.
060000     MOVE "222" TO CORRECT-A.
060100     MOVE ENTRY-A-1 (SUB-3) TO COMPUTED-A.
060200     PERFORM FAIL.
060300     GO TO SUB-SCRIPT-16B.
060400 SUB-SCRIPT-16A.
060500     PERFORM DE-LETE.
060600 SUB-SCRIPT-16B.
060700     MOVE "SUB-SCRIPT-16" TO PAR-NAME.
060800*    NOTE  COMPUTATIONAL SUBSCRIPT  USED  S9(18).
060900     PERFORM PRINT-DETAIL.
061000 SUB-SCRIPT-17.
061100     IF ENTRY-A-2 (SUB-4) EQUAL TO "44"
061200         PERFORM PASS
061300         GO TO SUB-SCRIPT-17B.
061400     MOVE "44" TO CORRECT-A.
061500     MOVE ENTRY-A-2 (SUB-4) TO COMPUTED-A.
061600     PERFORM FAIL.
061700     GO TO SUB-SCRIPT-17B.
061800 SUB-SCRIPT-17A.
061900     PERFORM DE-LETE.
062000 SUB-SCRIPT-17B.
062100     MOVE "SUB-SCRIPT-17" TO PAR-NAME.
062200*    NOTE COMPUTATIONAL SUBSCRIPT  USED  9(18).
062300     PERFORM PRINT-DETAIL.
062400 SUB-SCRIPT-18.
062500     IF ENTRY-A-2 (+4) EQUAL TO "44"
062600         PERFORM PASS
062700         GO TO SUB-SCRIPT-18B.
062800     MOVE "44" TO CORRECT-A.
062900     MOVE ENTRY-A-2 (+4) TO COMPUTED-A.
063000     PERFORM FAIL.
063100     GO TO SUB-SCRIPT-18B.
063200 SUB-SCRIPT-18A.
063300     PERFORM DE-LETE.
063400 SUB-SCRIPT-18B.
063500     MOVE "SUB-SCRIPT-18" TO PAR-NAME.
063600*    NOTE SIGNED NUMERIC LITERAL SUBSCRIPT.
063700     PERFORM PRINT-DETAIL.
063800 SUB-SCRIPT-19.
063900     IF ENTRY-A-3 (CON-2) NOT EQUAL TO "2"
064000     GO TO SUB-SCRIPT-19B.
064100     PERFORM PASS.
064200     GO TO SUB-SCRIPT-19C.
064300 SUB-SCRIPT-19A.
064400     PERFORM DE-LETE.
064500     GO TO SUB-SCRIPT-19C.
064600 SUB-SCRIPT-19B.
064700     PERFORM FAIL.
064800     MOVE ENTRY-A-3 (CON-2) TO COMPUTED-A.
064900     MOVE "2" TO CORRECT-A.
065000 SUB-SCRIPT-19C.
065100     MOVE "SUB-SCRIPT-19" TO PAR-NAME.
065200     PERFORM PRINT-DETAIL.
065300*    NOTE  *****  THIS CHECKS THE USE OF AN ELEMENTARY ITEM
065400*                 WHEN THE GROUP ITEM HAS THE OCCURS.
065500 SUB-SCRIPT-20.
065600     IF ENTRY-A-2 (CON-4) NOT EQUAL TO "44"
065700     GO TO SUB-SCRIPT-20B.
065800     PERFORM PASS.
065900     GO TO SUB-SCRIPT-20C.
066000 SUB-SCRIPT-20A.
066100     PERFORM DE-LETE.
066200     GO TO SUB-SCRIPT-20C.
066300 SUB-SCRIPT-20B.
066400     PERFORM FAIL.
066500     MOVE ENTRY-A-2 (CON-4) TO COMPUTED-A.
066600     MOVE "44" TO CORRECT-A.
066700 SUB-SCRIPT-20C.
066800     MOVE "SUB-SCRIPT-20" TO PAR-NAME.
066900     PERFORM PRINT-DETAIL.
067000*    NOTE  *******  THIS CHECKS A GROUP ITEM WHEN IT
067100*                   HAS THE OCCURS.
067200 SUB-SCRIPT-21.
067300     IF ENTRY-B-2 (CON-1) NOT EQUAL TO "1"
067400     GO TO SUB-SCRIPT-21B.
067500     PERFORM PASS.
067600     GO TO SUB-SCRIPT-21C.
067700 SUB-SCRIPT-21A.
067800     PERFORM DE-LETE.
067900     GO TO SUB-SCRIPT-21C.
068000 SUB-SCRIPT-21B.
068100     PERFORM FAIL.
068200     MOVE ENTRY-B-2 (CON-1) TO COMPUTED-A.
068300     MOVE "1" TO CORRECT-A.
068400 SUB-SCRIPT-21C.
068500     MOVE "SUB-SCRIPT-21" TO PAR-NAME.
068600     PERFORM PRINT-DETAIL.
068700*    USE OF ITEM WHICH IS DEFINED WITH BOTH THE REDEFINES
068800*    AND THE OCCURS CLAUSE.
068900 SUB-SCRIPT-22.
069000     MOVE ENTRY-B-2 (CON-1) TO ENTRY-C (CON-4).
069100     MOVE ENTRY-B-2 (CON-2) TO ENTRY-C (CON-3).
069200     MOVE ENTRY-B-2 (CON-3) TO ENTRY-C (CON-2).
069300     MOVE ENTRY-B-2 (CON-4) TO ENTRY-C (CON-1).
069400     IF TABLE-C    NOT  EQUAL TO "4321"
069500     GO TO SUB-SCRIPT-22B.
069600     PERFORM PASS.
069700     GO TO SUB-SCRIPT-22C.
069800 SUB-SCRIPT-22A.
069900     PERFORM DE-LETE.
070000     GO TO SUB-SCRIPT-22C.
070100 SUB-SCRIPT-22B.
070200     PERFORM FAIL.
070300     MOVE TABLE-C TO COMPUTED-A.
070400     MOVE "4321" TO CORRECT-A.
070500 SUB-SCRIPT-22C.
070600     MOVE "SUB-SCRIPT-22" TO PAR-NAME.
070700     PERFORM PRINT-DETAIL.
070800 SUB-SCRIPT-23.
070900     MOVE "0000" TO TABLE-C.
071000     ADD ENTRY-B-2 (CON-1) TO ENTRY-C (CON-1).
071100     ADD ENTRY-B-2 (CON-2) TO ENTRY-C (CON-2).
071200     ADD ENTRY-B-2 (CON-3) TO ENTRY-C (CON-3).
071300     ADD ENTRY-B-2 (CON-4) TO ENTRY-C (CON-4).
071400     IF TABLE-C NOT EQUAL TO "1234"
071500     GO TO SUB-SCRIPT-23B.
071600     PERFORM PASS.
071700     GO TO SUB-SCRIPT-23C.
071800 SUB-SCRIPT-23A.
071900     PERFORM DE-LETE.
072000     GO TO SUB-SCRIPT-23C.
072100 SUB-SCRIPT-23B.
072200     PERFORM FAIL.
072300     MOVE TABLE-C TO COMPUTED-A.
072400     MOVE "1234" TO CORRECT-A.
072500 SUB-SCRIPT-23C.
072600     MOVE "SUB-SCRIPT-23" TO PAR-NAME.
072700     PERFORM  PRINT-DETAIL.
072800*    ADD STATEMENTS WITH UNSIGNED NUMERIC ITEMS AS SUBSCRIPTS.
072900 SUB-SCRIPT-24.
073000     MOVE  "1234" TO TABLE-C.
073100     SUBTRACT ENTRY-B-2 (CON-1) FROM ENTRY-C (CON-1).
073200     SUBTRACT ENTRY-B-2 (CON-2) FROM ENTRY-C (CON-2).
073300     SUBTRACT ENTRY-B-2 (CON-3) FROM ENTRY-C (CON-3).
073400     SUBTRACT ENTRY-B-2 (CON-4) FROM ENTRY-C (CON-4).
073500     IF TABLE-C  NOT EQUAL TO  "0000"
073600     GO TO  SUB-SCRIPT-24B.
073700     PERFORM PASS.
073800     GO TO SUB-SCRIPT-24C.
073900 SUB-SCRIPT-24A.
074000     PERFORM DE-LETE.
074100     GO TO SUB-SCRIPT-24C.
074200 SUB-SCRIPT-24B.
074300     PERFORM FAIL.
074400     MOVE TABLE-C TO COMPUTED-A.
074500     MOVE "0000" TO CORRECT-A.
074600 SUB-SCRIPT-24C.
074700     MOVE "SUB-SCRIPT-24" TO PAR-NAME.
074800     PERFORM  PRINT-DETAIL.
074900*    SUBSTRACT STATEMENTS WITH UNSIGNED NUMERIC ITEMS AS SUBSCRIPT
075000 SUB-SCRIPT-25.
075100     MOVE "1111" TO TABLE-C.
075200     MULTIPLY ENTRY-B-2 (CON-1) BY ENTRY-C (CON-1).
075300     MULTIPLY ENTRY-B-2 (CON-2) BY ENTRY-C (CON-2).
075400     MULTIPLY ENTRY-B-2 (CON-3) BY ENTRY-C (CON-3).
075500     MULTIPLY ENTRY-B-2 (CON-4) BY ENTRY-C (CON-4).
075600     IF TABLE-C  NOT EQUAL TO "1234"
075700     GO TO SUB-SCRIPT-25B.
075800     PERFORM PASS.
075900     GO TO SUB-SCRIPT-25C.
076000 SUB-SCRIPT-25A.
076100     PERFORM DE-LETE.
076200     GO TO SUB-SCRIPT-25C.
076300 SUB-SCRIPT-25B.
076400     PERFORM FAIL.
076500     MOVE TABLE-C TO COMPUTED-A.
076600     MOVE "1234" TO CORRECT-A.
076700 SUB-SCRIPT-25C.
076800     MOVE  "SUB-SCRIPT-25" TO PAR-NAME.
076900     PERFORM  PRINT-DETAIL.
077000*    MULTIPLY STATEMENTS WITH UNSIGNED NUMERIC ITEMS AS SUBSCRIPTS
077100 SUB-SCRIPT-26.
077200     MOVE  "1234" TO TABLE-C.
077300     DIVIDE ENTRY-B-2 (CON-1) INTO ENTRY-C (CON-1).
077400     DIVIDE ENTRY-B-2 (CON-2) INTO ENTRY-C (CON-2).
077500     DIVIDE ENTRY-B-2 (CON-3) INTO ENTRY-C (CON-3).
077600     DIVIDE ENTRY-B-2 (CON-4) INTO ENTRY-C (CON-4).
077700     IF  TABLE-C  NOT EQUAL TO "1111"
077800     GO TO  SUB-SCRIPT-26B.
077900     PERFORM PASS.
078000     GO TO SUB-SCRIPT-26C.
078100 SUB-SCRIPT-26A.
078200     PERFORM DE-LETE.
078300     GO TO  SUB-SCRIPT-26C.
078400 SUB-SCRIPT-26B.
078500     PERFORM FAIL.
078600     MOVE TABLE-C TO COMPUTED-A.
078700     MOVE "1111" TO CORRECT-A.
078800 SUB-SCRIPT-26C.
078900     MOVE "SUB-SCRIPT-26" TO PAR-NAME.
079000     PERFORM PRINT-DETAIL.
079100*    DIVIDE STATEMENTS WITH UNSIGNED NUMERIC ITEMS AS SUBSCRIPTS.
079200 CCVS-EXIT SECTION.
079300 CCVS-999999.
079400     GO TO CLOSE-FILES.
