000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC131A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC131A TESTS FORMAT 1 OF THE SET STATEMENT USING
002300*    VARIOUS COMBINATIONS OF INDEX-NAMES, IDENTIFIERS & INTEGERS
002400*
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.
002800     XXXXX082.
002900 OBJECT-COMPUTER.
003000     XXXXX083.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300     SELECT PRINT-FILE ASSIGN TO
003400     XXXXX055.
003500 DATA DIVISION.
003600 FILE SECTION.
003700 FD  PRINT-FILE.
003800 01  PRINT-REC PICTURE X(120).
003900 01  DUMMY-RECORD PICTURE X(120).
004000 WORKING-STORAGE SECTION.
004100 77  I-DATA-1  USAGE IS INDEX.
004200 77  IDENT-1   PICTURE   9 VALUE IS 4.
004300 77  IDENT-2   PICTURE 9.
004400 77  IDENT-3  PICTURE S99  USAGE COMPUTATIONAL.
004500 77  SGN-IDX          PICTURE  9(18).
004600 01   INDEX-VALUE  PIC 9999.
004700 01  I-DATA-GROUP USAGE IS INDEX.
004800     02  I-DATA-2 USAGE IS INDEX.
004900     02  I-DATA-3 USAGE IS INDEX.
005000 01  TABLE-1.
005100     02  TAB1-REC  PICTURE  99  OCCURS 100 TIMES
005200                   INDEXED BY INDEX1.
005300 01  TABLE-2.
005400     02  TAB2-REC  PICTURE 999 OCCURS 100 TIMES
005500                   INDEXED BY INDEX2.
005600 01  TEST-RESULTS.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02 FEATURE                  PIC X(20)  VALUE SPACE.
005900     02 FILLER                   PIC X      VALUE SPACE.
006000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006100     02 FILLER                   PIC X      VALUE SPACE.
006200     02  PAR-NAME.
006300       03 FILLER                 PIC X(19)  VALUE SPACE.
006400       03  PARDOT-X              PIC X      VALUE SPACE.
006500       03 DOTVALUE               PIC 99     VALUE ZERO.
006600     02 FILLER                   PIC X(8)   VALUE SPACE.
006700     02 RE-MARK                  PIC X(61).
006800 01  TEST-COMPUTED.
006900     02 FILLER                   PIC X(30)  VALUE SPACE.
007000     02 FILLER                   PIC X(17)  VALUE
007100            "       COMPUTED=".
007200     02 COMPUTED-X.
007300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007400     03 COMPUTED-N               REDEFINES COMPUTED-A
007500                                 PIC -9(9).9(9).
007600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007900     03       CM-18V0 REDEFINES COMPUTED-A.
008000         04 COMPUTED-18V0                    PIC -9(18).
008100         04 FILLER                           PIC X.
008200     03 FILLER PIC X(50) VALUE SPACE.
008300 01  TEST-CORRECT.
008400     02 FILLER PIC X(30) VALUE SPACE.
008500     02 FILLER PIC X(17) VALUE "       CORRECT =".
008600     02 CORRECT-X.
008700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
009000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009200     03      CR-18V0 REDEFINES CORRECT-A.
009300         04 CORRECT-18V0                     PIC -9(18).
009400         04 FILLER                           PIC X.
009500     03 FILLER PIC X(2) VALUE SPACE.
009600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009700 01  CCVS-C-1.
009800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
009900-    "SS  PARAGRAPH-NAME
010000-    "       REMARKS".
010100     02 FILLER                     PIC X(20)    VALUE SPACE.
010200 01  CCVS-C-2.
010300     02 FILLER                     PIC X        VALUE SPACE.
010400     02 FILLER                     PIC X(6)     VALUE "TESTED".
010500     02 FILLER                     PIC X(15)    VALUE SPACE.
010600     02 FILLER                     PIC X(4)     VALUE "FAIL".
010700     02 FILLER                     PIC X(94)    VALUE SPACE.
010800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
010900 01  REC-CT                        PIC 99       VALUE ZERO.
011000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
011100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
011200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
011300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
011400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
011500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
011600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
011700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
011800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
011900 01  CCVS-H-1.
012000     02  FILLER                    PIC X(39)    VALUE SPACES.
012100     02  FILLER                    PIC X(42)    VALUE
012200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
012300     02  FILLER                    PIC X(39)    VALUE SPACES.
012400 01  CCVS-H-2A.
012500   02  FILLER                        PIC X(40)  VALUE SPACE.
012600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
012700   02  FILLER                        PIC XXXX   VALUE
012800     "4.2 ".
012900   02  FILLER                        PIC X(28)  VALUE
013000            " COPY - NOT FOR DISTRIBUTION".
013100   02  FILLER                        PIC X(41)  VALUE SPACE.
013200
013300 01  CCVS-H-2B.
013400   02  FILLER                        PIC X(15)  VALUE
013500            "TEST RESULT OF ".
013600   02  TEST-ID                       PIC X(9).
013700   02  FILLER                        PIC X(4)   VALUE
013800            " IN ".
013900   02  FILLER                        PIC X(12)  VALUE
014000     " HIGH       ".
014100   02  FILLER                        PIC X(22)  VALUE
014200            " LEVEL VALIDATION FOR ".
014300   02  FILLER                        PIC X(58)  VALUE
014400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014500 01  CCVS-H-3.
014600     02  FILLER                      PIC X(34)  VALUE
014700            " FOR OFFICIAL USE ONLY    ".
014800     02  FILLER                      PIC X(58)  VALUE
014900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
015000     02  FILLER                      PIC X(28)  VALUE
015100            "  COPYRIGHT   1985 ".
015200 01  CCVS-E-1.
015300     02 FILLER                       PIC X(52)  VALUE SPACE.
015400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
015500     02 ID-AGAIN                     PIC X(9).
015600     02 FILLER                       PIC X(45)  VALUE SPACES.
015700 01  CCVS-E-2.
015800     02  FILLER                      PIC X(31)  VALUE SPACE.
015900     02  FILLER                      PIC X(21)  VALUE SPACE.
016000     02 CCVS-E-2-2.
016100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
016200         03 FILLER                   PIC X      VALUE SPACE.
016300         03 ENDER-DESC               PIC X(44)  VALUE
016400            "ERRORS ENCOUNTERED".
016500 01  CCVS-E-3.
016600     02  FILLER                      PIC X(22)  VALUE
016700            " FOR OFFICIAL USE ONLY".
016800     02  FILLER                      PIC X(12)  VALUE SPACE.
016900     02  FILLER                      PIC X(58)  VALUE
017000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017100     02  FILLER                      PIC X(13)  VALUE SPACE.
017200     02 FILLER                       PIC X(15)  VALUE
017300             " COPYRIGHT 1985".
017400 01  CCVS-E-4.
017500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
017600     02 FILLER                       PIC X(4)   VALUE " OF ".
017700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
017800     02 FILLER                       PIC X(40)  VALUE
017900      "  TESTS WERE EXECUTED SUCCESSFULLY".
018000 01  XXINFO.
018100     02 FILLER                       PIC X(19)  VALUE
018200            "*** INFORMATION ***".
018300     02 INFO-TEXT.
018400       04 FILLER                     PIC X(8)   VALUE SPACE.
018500       04 XXCOMPUTED                 PIC X(20).
018600       04 FILLER                     PIC X(5)   VALUE SPACE.
018700       04 XXCORRECT                  PIC X(20).
018800     02 INF-ANSI-REFERENCE           PIC X(48).
018900 01  HYPHEN-LINE.
019000     02 FILLER  PIC IS X VALUE IS SPACE.
019100     02 FILLER  PIC IS X(65)    VALUE IS "************************
019200-    "*****************************************".
019300     02 FILLER  PIC IS X(54)    VALUE IS "************************
019400-    "******************************".
019500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
019600     "NC131A".
019700 PROCEDURE DIVISION.
019800 CCVS1 SECTION.
019900 OPEN-FILES.
020000     OPEN     OUTPUT PRINT-FILE.
020100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
020200     MOVE    SPACE TO TEST-RESULTS.
020300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
020400     GO TO CCVS1-EXIT.
020500 CLOSE-FILES.
020600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
020700 TERMINATE-CCVS.
020800S    EXIT PROGRAM.
020900STERMINATE-CALL.
021000     STOP     RUN.
021100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
021200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
021300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
021400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
021500     MOVE "****TEST DELETED****" TO RE-MARK.
021600 PRINT-DETAIL.
021700     IF REC-CT NOT EQUAL TO ZERO
021800             MOVE "." TO PARDOT-X
021900             MOVE REC-CT TO DOTVALUE.
022000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
022100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
022200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
022300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
022400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
022500     MOVE SPACE TO CORRECT-X.
022600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
022700     MOVE     SPACE TO RE-MARK.
022800 HEAD-ROUTINE.
022900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023300 COLUMN-NAMES-ROUTINE.
023400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
023700 END-ROUTINE.
023800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
023900 END-RTN-EXIT.
024000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024100 END-ROUTINE-1.
024200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
024300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
024400      ADD PASS-COUNTER TO ERROR-HOLD.
024500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
024600      MOVE PASS-COUNTER TO CCVS-E-4-1.
024700      MOVE ERROR-HOLD TO CCVS-E-4-2.
024800      MOVE CCVS-E-4 TO CCVS-E-2-2.
024900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
025000  END-ROUTINE-12.
025100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
025200     IF       ERROR-COUNTER IS EQUAL TO ZERO
025300         MOVE "NO " TO ERROR-TOTAL
025400         ELSE
025500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
025600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
025700     PERFORM WRITE-LINE.
025800 END-ROUTINE-13.
025900     IF DELETE-COUNTER IS EQUAL TO ZERO
026000         MOVE "NO " TO ERROR-TOTAL  ELSE
026100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
026200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
026300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026400      IF   INSPECT-COUNTER EQUAL TO ZERO
026500          MOVE "NO " TO ERROR-TOTAL
026600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
026700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
026800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027000 WRITE-LINE.
027100     ADD 1 TO RECORD-COUNT.
027200Y    IF RECORD-COUNT GREATER 42
027300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
027400Y        MOVE SPACE TO DUMMY-RECORD
027500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
027600Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
027700Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
027800Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
027900Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
028000Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
028100Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
028200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
028300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
028400Y        MOVE ZERO TO RECORD-COUNT.
028500     PERFORM WRT-LN.
028600 WRT-LN.
028700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
028800     MOVE SPACE TO DUMMY-RECORD.
028900 BLANK-LINE-PRINT.
029000     PERFORM WRT-LN.
029100 FAIL-ROUTINE.
029200     IF     COMPUTED-X NOT EQUAL TO SPACE
029300            GO TO FAIL-ROUTINE-WRITE.
029400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
029700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029800     MOVE   SPACES TO INF-ANSI-REFERENCE.
029900     GO TO  FAIL-ROUTINE-EX.
030000 FAIL-ROUTINE-WRITE.
030100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
030200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
030300     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
030400     MOVE   SPACES TO COR-ANSI-REFERENCE.
030500 FAIL-ROUTINE-EX. EXIT.
030600 BAIL-OUT.
030700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
030800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
030900 BAIL-OUT-WRITE.
031000     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
031100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031300     MOVE   SPACES TO INF-ANSI-REFERENCE.
031400 BAIL-OUT-EX. EXIT.
031500 CCVS1-EXIT.
031600     EXIT.
031700 SECT-NC131A-001 SECTION.
031800 TEST-1.
031900     MOVE "VI-127 6.23.4" TO ANSI-REFERENCE.
032000     SET INDEX1 TO 5.
032100     IF INDEX1 EQUAL TO 5 PERFORM PASS GO TO OK1.
032200     SET SGN-IDX TO INDEX1.
032300     MOVE SGN-IDX TO COMPUTED-18V0.
032400     MOVE 5 TO CORRECT-18V0.
032500     PERFORM FAIL.
032600 OK1.
032700     MOVE "TEST-1" TO PAR-NAME.
032800     MOVE  "SET  OPT 1" TO FEATURE.
032900     PERFORM PRINT-DETAIL.
033000 TEST-2.
033100     SET INDEX1 TO IDENT-1.
033200     IF INDEX1 EQUAL TO 4 PERFORM PASS GO TO OK2.
033300     SET SGN-IDX TO INDEX1.
033400     MOVE SGN-IDX TO COMPUTED-18V0.
033500     MOVE IDENT-1 TO CORRECT-18V0.
033600     PERFORM FAIL.
033700 OK2.
033800     MOVE "TEST-2" TO PAR-NAME.
033900     MOVE "SET  OPT 2" TO FEATURE.
034000     PERFORM PRINT-DETAIL.
034100 TEST-3.
034200     SET INDEX1 TO 4.
034300     SET INDEX2 TO INDEX1.
034400     IF INDEX2 EQUAL TO INDEX1 PERFORM PASS GO TO OK3.
034500     SET SGN-IDX TO INDEX2.
034600     MOVE SGN-IDX TO COMPUTED-18V0.
034700     MOVE 4 TO CORRECT-18V0.
034800     PERFORM FAIL.
034900 OK3.
035000     MOVE "TEST-3" TO PAR-NAME.
035100     MOVE "SET  OPT 3" TO FEATURE.
035200     PERFORM PRINT-DETAIL.
035300 TEST-4.
035400     SET INDEX2 TO 4.
035500     SET I-DATA-1  TO INDEX2.
035600     IF I-DATA-1 EQUAL TO INDEX2 PERFORM PASS GO TO OK4.
035700     SET      INDEX-VALUE TO INDEX2.
035800     MOVE     INDEX-VALUE TO COMPUTED-18V0.
035900     MOVE 4 TO CORRECT-18V0.
036000     PERFORM FAIL.
036100 OK4.
036200     MOVE "TEST-4" TO PAR-NAME.
036300     MOVE  "SET  OPT 4" TO FEATURE.
036400     PERFORM PRINT-DETAIL.
036500 TEST-5.
036600     SET INDEX2 TO 4.
036700     SET I-DATA-1 TO INDEX2.
036800     SET I-DATA-2 TO I-DATA-1.
036900     IF I-DATA-2 EQUAL TO I-DATA-1 PERFORM PASS GO TO OK5.
037000     SET      INDEX-VALUE TO INDEX2.
037100     MOVE     INDEX-VALUE TO COMPUTED-18V0.
037200     MOVE 4 TO CORRECT-18V0.
037300     PERFORM FAIL.
037400 OK5.
037500     MOVE "TEST-5" TO PAR-NAME.
037600     MOVE "SET  OPT 5" TO FEATURE.
037700     PERFORM PRINT-DETAIL.
037800 TEST-6.
037900     SET INDEX2 TO 6.
038000     SET IDENT-2 TO  INDEX2.
038100     IF IDENT-2 EQUAL TO INDEX2 PERFORM PASS GO TO OK6.
038200     SET SGN-IDX TO INDEX2.
038300     MOVE SGN-IDX TO COMPUTED-18V0.
038400     MOVE 6 TO CORRECT-18V0.
038500     PERFORM FAIL.
038600 OK6.
038700     MOVE "TEST-6" TO PAR-NAME.
038800     MOVE "SET  OPT 6" TO FEATURE.
038900     PERFORM PRINT-DETAIL.
039000     MOVE SPACE TO FEATURE.
039100 END-TEST.
039200     PERFORM BLANK-LINE-PRINT 2 TIMES.
039300      MOVE "ASCENDING NUMBER LIST" TO RE-MARK.
039400      PERFORM PRINT-DETAIL.
039500     PERFORM BLANK-LINE-PRINT.
039600     SET INDEX1 TO 1.
039700     MOVE 1 TO IDENT-3.
039800 L.  MOVE IDENT-3 TO TAB1-REC (INDEX1).
039900     IF   IDENT-3          EQUAL TO 99 GO TO P-LIST.
040000     ADD 1 TO IDENT-3.
040100     SET INDEX1 TO IDENT-3.
040200     GO TO L.
040300 P-LIST.
040400     SET INDEX1 TO 1.
040500     MOVE 1 TO IDENT-3.
040600 M.
040700      MOVE TAB1-REC (INDEX1) TO RE-MARK.
040800      PERFORM PRINT-DETAIL.
040900     IF IDENT-3 EQUAL TO 99 GO TO CL-OSE.
041000     ADD 1 TO  IDENT-3.
041100     SET INDEX1 TO IDENT-3.
041200     GO TO M.
041300 CL-OSE.
041400     PERFORM BLANK-LINE-PRINT.
041500     MOVE "END OF TABLE LIST" TO RE-MARK.
041600     PERFORM PRINT-DETAIL.
041700*
041800 IDX-INIT-8.
041900     MOVE   "VI-127 6.23.4 GR3(c)" TO ANSI-REFERENCE.
042000     SET     INDEX1 TO 4.
042100 IDX-TEST-8-0.
042200     SET     INDEX2
042300             IDENT-1 TO INDEX1.
042400 IDX-TEST-8-1.
042500     IF      IDENT-1 EQUAL TO 4 PERFORM PASS GO TO OK8-1.
042600     MOVE    IDENT-1 TO COMPUTED-18V0.
042700     MOVE    4 TO CORRECT-18V0.
042800     PERFORM FAIL.
042900 OK8-1.
043000     MOVE   "IDX-TEST-8-1" TO PAR-NAME.
043100     PERFORM PRINT-DETAIL.
043200 IDX-TEST-8-2.
043300     IF      INDEX2  EQUAL TO INDEX1 PERFORM PASS GO TO OK8-2.
043400     SET     INDEX-VALUE TO INDEX2.
043500     MOVE    INDEX-VALUE TO COMPUTED-18V0.
043600     MOVE    4 TO CORRECT-18V0.
043700     PERFORM FAIL.
043800 OK8-2.
043900     MOVE   "IDX-TEST-8-2" TO PAR-NAME.
044000     PERFORM PRINT-DETAIL.
044100*
044200 IDX-INIT-9.
044300     MOVE   "VI-127 6.23.4 GR3(c)" TO ANSI-REFERENCE.
044400     SET     INDEX1 TO 4.
044500 IDX-TEST-9-0.
044600     SET IDENT-1
044700         INDEX2  TO INDEX1.
044800 IDX-TEST-9-1.
044900     IF      IDENT-1 EQUAL TO 4 PERFORM PASS GO TO OK9-1.
045000     MOVE    IDENT-1 TO COMPUTED-18V0.
045100     MOVE    4 TO CORRECT-18V0.
045200     PERFORM FAIL.
045300 OK9-1.
045400     MOVE   "IDX-TEST-9-1" TO PAR-NAME.
045500     PERFORM PRINT-DETAIL.
045600 IDX-TEST-9-2.
045700     IF      INDEX2  EQUAL TO INDEX1 PERFORM PASS GO TO OK9-2.
045800     SET     INDEX-VALUE TO INDEX2.
045900     MOVE    INDEX-VALUE TO COMPUTED-18V0.
046000     MOVE    4 TO CORRECT-18V0.
046100     PERFORM FAIL.
046200 OK9-2.
046300     MOVE   "IDX-TEST-9-2" TO PAR-NAME.
046400     PERFORM PRINT-DETAIL.
046500*
046600 CCVS-EXIT SECTION.
046700 CCVS-999999.
046800     GO TO CLOSE-FILES.
