000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC133A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*     PROGRAM NC133A TESTS THE USE OF FORMAT 1 OF THE SET
002300*     STATEMENT USING VARIOUS INTEGERS, INDEX-NAMES AND
002400*     IDENTIFIERS.
002500*     REDEFINED SINGLE LEVEL TABLES ARE USED.
002600*
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 77  SGN-IDX                     PIC S9(18) VALUE ZERO.
004400 77  UNSGN-IDX                   PIC 9(18)  VALUE ZERO.
004500 77  USE-IDX                     USAGE INDEX.
004600 77  COMP-U-IDX18  PICTURE 9(18) COMPUTATIONAL VALUE ZERO.
004700 77  COMP-S-IDX18 PICTURE S9(18) COMPUTATIONAL VALUE ZERO.
004800 77  COMP-U-IDX1   PICTURE 9 COMPUTATIONAL VALUE ZERO.
004900 77  COMP-S-IDX1  PICTURE S9 COMPUTATIONAL VALUE ZERO.
005000 01   INDEX-VALUE  PIC 9999.
005100 01  TABLE-A-VALUES PIC X(20) VALUE "11122233344415263748".
005200 01  TABLE-A.
005300     02  ENTRY-A-1 PICTURE XXX OCCURS 4 TIMES INDEXED IDX-1.
005400     02  ENTRY-A-2  OCCURS 4 TIMES INDEXED BY IDX-2.
005500         03  ENTRY-A-3  PIC X.
005600         03  ENTRY-A-4  PIC X.
005700 01  TABLE-A1 REDEFINES TABLE-A.
005800     02  ENTRY-A-5  PICTURE XXX OCCURS 4 TIMES.
005900     02  ENTRY-A-6 OCCURS 4 TIMES INDEXED BY IDX-X2.
006000         03  ENTRY-A-7 PIC X.
006100         03  ENTRY-A-8 PIC X.
006200 01  TABLE-B.
006300     02  ENTRY-B-1  PIC X(4) VALUE "1234".
006400     02  ENTRY-B-2 REDEFINES ENTRY-B-1 PIC 9 OCCURS 4 INDEXED
006500              BY  IDX-3.
006600 01  TEST-RESULTS.
006700     02 FILLER                   PIC X      VALUE SPACE.
006800     02 FEATURE                  PIC X(20)  VALUE SPACE.
006900     02 FILLER                   PIC X      VALUE SPACE.
007000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
007100     02 FILLER                   PIC X      VALUE SPACE.
007200     02  PAR-NAME.
007300       03 FILLER                 PIC X(19)  VALUE SPACE.
007400       03  PARDOT-X              PIC X      VALUE SPACE.
007500       03 DOTVALUE               PIC 99     VALUE ZERO.
007600     02 FILLER                   PIC X(8)   VALUE SPACE.
007700     02 RE-MARK                  PIC X(61).
007800 01  TEST-COMPUTED.
007900     02 FILLER                   PIC X(30)  VALUE SPACE.
008000     02 FILLER                   PIC X(17)  VALUE
008100            "       COMPUTED=".
008200     02 COMPUTED-X.
008300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
008400     03 COMPUTED-N               REDEFINES COMPUTED-A
008500                                 PIC -9(9).9(9).
008600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
008700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
008800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
008900     03       CM-18V0 REDEFINES COMPUTED-A.
009000         04 COMPUTED-18V0                    PIC -9(18).
009100         04 FILLER                           PIC X.
009200     03 FILLER PIC X(50) VALUE SPACE.
009300 01  TEST-CORRECT.
009400     02 FILLER PIC X(30) VALUE SPACE.
009500     02 FILLER PIC X(17) VALUE "       CORRECT =".
009600     02 CORRECT-X.
009700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
009800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
009900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
010000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
010100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
010200     03      CR-18V0 REDEFINES CORRECT-A.
010300         04 CORRECT-18V0                     PIC -9(18).
010400         04 FILLER                           PIC X.
010500     03 FILLER PIC X(2) VALUE SPACE.
010600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
010700 01  CCVS-C-1.
010800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
010900-    "SS  PARAGRAPH-NAME
011000-    "       REMARKS".
011100     02 FILLER                     PIC X(20)    VALUE SPACE.
011200 01  CCVS-C-2.
011300     02 FILLER                     PIC X        VALUE SPACE.
011400     02 FILLER                     PIC X(6)     VALUE "TESTED".
011500     02 FILLER                     PIC X(15)    VALUE SPACE.
011600     02 FILLER                     PIC X(4)     VALUE "FAIL".
011700     02 FILLER                     PIC X(94)    VALUE SPACE.
011800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
011900 01  REC-CT                        PIC 99       VALUE ZERO.
012000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
012400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
012500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
012600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
012700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
012800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
012900 01  CCVS-H-1.
013000     02  FILLER                    PIC X(39)    VALUE SPACES.
013100     02  FILLER                    PIC X(42)    VALUE
013200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013300     02  FILLER                    PIC X(39)    VALUE SPACES.
013400 01  CCVS-H-2A.
013500   02  FILLER                        PIC X(40)  VALUE SPACE.
013600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
013700   02  FILLER                        PIC XXXX   VALUE
013800     "4.2 ".
013900   02  FILLER                        PIC X(28)  VALUE
014000            " COPY - NOT FOR DISTRIBUTION".
014100   02  FILLER                        PIC X(41)  VALUE SPACE.
014200
014300 01  CCVS-H-2B.
014400   02  FILLER                        PIC X(15)  VALUE
014500            "TEST RESULT OF ".
014600   02  TEST-ID                       PIC X(9).
014700   02  FILLER                        PIC X(4)   VALUE
014800            " IN ".
014900   02  FILLER                        PIC X(12)  VALUE
015000     " HIGH       ".
015100   02  FILLER                        PIC X(22)  VALUE
015200            " LEVEL VALIDATION FOR ".
015300   02  FILLER                        PIC X(58)  VALUE
015400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015500 01  CCVS-H-3.
015600     02  FILLER                      PIC X(34)  VALUE
015700            " FOR OFFICIAL USE ONLY    ".
015800     02  FILLER                      PIC X(58)  VALUE
015900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016000     02  FILLER                      PIC X(28)  VALUE
016100            "  COPYRIGHT   1985 ".
016200 01  CCVS-E-1.
016300     02 FILLER                       PIC X(52)  VALUE SPACE.
016400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
016500     02 ID-AGAIN                     PIC X(9).
016600     02 FILLER                       PIC X(45)  VALUE SPACES.
016700 01  CCVS-E-2.
016800     02  FILLER                      PIC X(31)  VALUE SPACE.
016900     02  FILLER                      PIC X(21)  VALUE SPACE.
017000     02 CCVS-E-2-2.
017100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017200         03 FILLER                   PIC X      VALUE SPACE.
017300         03 ENDER-DESC               PIC X(44)  VALUE
017400            "ERRORS ENCOUNTERED".
017500 01  CCVS-E-3.
017600     02  FILLER                      PIC X(22)  VALUE
017700            " FOR OFFICIAL USE ONLY".
017800     02  FILLER                      PIC X(12)  VALUE SPACE.
017900     02  FILLER                      PIC X(58)  VALUE
018000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018100     02  FILLER                      PIC X(13)  VALUE SPACE.
018200     02 FILLER                       PIC X(15)  VALUE
018300             " COPYRIGHT 1985".
018400 01  CCVS-E-4.
018500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
018600     02 FILLER                       PIC X(4)   VALUE " OF ".
018700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
018800     02 FILLER                       PIC X(40)  VALUE
018900      "  TESTS WERE EXECUTED SUCCESSFULLY".
019000 01  XXINFO.
019100     02 FILLER                       PIC X(19)  VALUE
019200            "*** INFORMATION ***".
019300     02 INFO-TEXT.
019400       04 FILLER                     PIC X(8)   VALUE SPACE.
019500       04 XXCOMPUTED                 PIC X(20).
019600       04 FILLER                     PIC X(5)   VALUE SPACE.
019700       04 XXCORRECT                  PIC X(20).
019800     02 INF-ANSI-REFERENCE           PIC X(48).
019900 01  HYPHEN-LINE.
020000     02 FILLER  PIC IS X VALUE IS SPACE.
020100     02 FILLER  PIC IS X(65)    VALUE IS "************************
020200-    "*****************************************".
020300     02 FILLER  PIC IS X(54)    VALUE IS "************************
020400-    "******************************".
020500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
020600     "NC133A".
020700 PROCEDURE DIVISION.
020800 CCVS1 SECTION.
020900 OPEN-FILES.
021000     OPEN     OUTPUT PRINT-FILE.
021100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021200     MOVE    SPACE TO TEST-RESULTS.
021300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
021400     GO TO CCVS1-EXIT.
021500 CLOSE-FILES.
021600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
021700 TERMINATE-CCVS.
021800S    EXIT PROGRAM.
021900STERMINATE-CALL.
022000     STOP     RUN.
022100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
022400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
022500     MOVE "****TEST DELETED****" TO RE-MARK.
022600 PRINT-DETAIL.
022700     IF REC-CT NOT EQUAL TO ZERO
022800             MOVE "." TO PARDOT-X
022900             MOVE REC-CT TO DOTVALUE.
023000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
023400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
023500     MOVE SPACE TO CORRECT-X.
023600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
023700     MOVE     SPACE TO RE-MARK.
023800 HEAD-ROUTINE.
023900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024300 COLUMN-NAMES-ROUTINE.
024400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
024700 END-ROUTINE.
024800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
024900 END-RTN-EXIT.
025000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025100 END-ROUTINE-1.
025200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
025400      ADD PASS-COUNTER TO ERROR-HOLD.
025500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
025600      MOVE PASS-COUNTER TO CCVS-E-4-1.
025700      MOVE ERROR-HOLD TO CCVS-E-4-2.
025800      MOVE CCVS-E-4 TO CCVS-E-2-2.
025900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026000  END-ROUTINE-12.
026100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026200     IF       ERROR-COUNTER IS EQUAL TO ZERO
026300         MOVE "NO " TO ERROR-TOTAL
026400         ELSE
026500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
026600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
026700     PERFORM WRITE-LINE.
026800 END-ROUTINE-13.
026900     IF DELETE-COUNTER IS EQUAL TO ZERO
027000         MOVE "NO " TO ERROR-TOTAL  ELSE
027100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027400      IF   INSPECT-COUNTER EQUAL TO ZERO
027500          MOVE "NO " TO ERROR-TOTAL
027600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
027700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
027800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028000 WRITE-LINE.
028100     ADD 1 TO RECORD-COUNT.
028200Y    IF RECORD-COUNT GREATER 42
028300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
028400Y        MOVE SPACE TO DUMMY-RECORD
028500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
028600Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028700Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028800Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
028900Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029000Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
029100Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029400Y        MOVE ZERO TO RECORD-COUNT.
029500     PERFORM WRT-LN.
029600 WRT-LN.
029700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
029800     MOVE SPACE TO DUMMY-RECORD.
029900 BLANK-LINE-PRINT.
030000     PERFORM WRT-LN.
030100 FAIL-ROUTINE.
030200     IF     COMPUTED-X NOT EQUAL TO SPACE
030300            GO TO FAIL-ROUTINE-WRITE.
030400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
030700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030800     MOVE   SPACES TO INF-ANSI-REFERENCE.
030900     GO TO  FAIL-ROUTINE-EX.
031000 FAIL-ROUTINE-WRITE.
031100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
031200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
031300     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
031400     MOVE   SPACES TO COR-ANSI-REFERENCE.
031500 FAIL-ROUTINE-EX. EXIT.
031600 BAIL-OUT.
031700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
031800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
031900 BAIL-OUT-WRITE.
032000     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
032100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032300     MOVE   SPACES TO INF-ANSI-REFERENCE.
032400 BAIL-OUT-EX. EXIT.
032500 CCVS1-EXIT.
032600     EXIT.
032700 SECT-TH133A-001 SECTION.
032800 TH-04-001.
032900 IDX-INIT-A.
033000     MOVE "INDEXING " TO FEATURE.
033100     MOVE TABLE-A-VALUES TO TABLE-A.
033200     IF TABLE-A EQUAL TO TABLE-A-VALUES
033300         PERFORM PASS
033400         MOVE "TABLE CREATED CORRECTLY" TO RE-MARK
033500         GO TO INIT-WRITE.
033600     MOVE "TABLE CREATED INCORRECTLY" TO RE-MARK.
033700     PERFORM FAIL.
033800     PERFORM INIT-WRITE.
033900     GO TO   CCVS-EXIT.
034000 INIT-WRITE.
034100     MOVE     "TABLE BUILD" TO PAR-NAME.
034200     PERFORM PRINT-DETAIL.
034300 IDX-TEST-1.
034400     SET IDX-1 TO 3.
034500     IF ENTRY-A-1 (IDX-1) EQUAL TO "333"
034600         PERFORM PASS
034700         GO TO IDX-WRITE-1.
034800     MOVE ENTRY-A-1 (IDX-1) TO COMPUTED-A.
034900     MOVE "333" TO CORRECT-A.
035000     PERFORM FAIL.
035100     GO TO IDX-WRITE-1.
035200 IDX-DELETE-1.
035300     PERFORM DE-LETE.
035400 IDX-WRITE-1.
035500     MOVE "IDX-TEST-1 " TO PAR-NAME.
035600     PERFORM PRINT-DETAIL.
035700 IDX-TEST-2.
035800     SET IDX-1 TO 2.
035900     IF ENTRY-A-1 (IDX-1) EQUAL TO "222"
036000         PERFORM PASS
036100         GO TO IDX-WRITE-2.
036200     MOVE 222 TO CORRECT-A.
036300     MOVE ENTRY-A-1 (IDX-1) TO COMPUTED-A.
036400     PERFORM FAIL.
036500     GO TO IDX-WRITE-2.
036600 IDX-DELETE-2.
036700     PERFORM DE-LETE.
036800 IDX-WRITE-2.
036900     MOVE "IDX-TEST-2" TO PAR-NAME.
037000     PERFORM PRINT-DETAIL.
037100 IDX-TEST-3.
037200     SET IDX-1 TO 000001.
037300     IF ENTRY-A-1 (IDX-1) EQUAL TO "111"
037400         PERFORM PASS
037500         GO TO IDX-WRITE-3.
037600     MOVE ENTRY-A-1 (IDX-1) TO COMPUTED-A.
037700     MOVE 111 TO CORRECT-A.
037800     PERFORM FAIL.
037900     GO TO IDX-WRITE-3.
038000 IDX-DELETE-3.
038100     PERFORM DE-LETE.
038200 IDX-WRITE-3.
038300     MOVE "IDX-TEST-3" TO PAR-NAME.
038400     PERFORM PRINT-DETAIL.
038500 IDX-TEST-4.
038600     SET IDX-1 TO 000000000000000004.
038700     IF ENTRY-A-1 (IDX-1) EQUAL TO "444"
038800         PERFORM PASS
038900         GO TO IDX-WRITE-4.
039000     MOVE ENTRY-A-1 (IDX-1) TO COMPUTED-A.
039100     MOVE 444 TO CORRECT-A.
039200     PERFORM FAIL.
039300     GO TO IDX-WRITE-4.
039400 IDX-DELETE-4.
039500     PERFORM DE-LETE.
039600 IDX-WRITE-4.
039700     MOVE "IDX-TEST-4" TO PAR-NAME.
039800     PERFORM PRINT-DETAIL.
039900 IDX-TEST-5.
040000     MOVE 3 TO SGN-IDX.
040100     SET IDX-2 TO SGN-IDX.
040200     IF ENTRY-A-4 (IDX-2) EQUAL TO "7"
040300         PERFORM PASS
040400         GO TO IDX-WRITE-5.
040500     MOVE ENTRY-A-4 (IDX-2) TO COMPUTED-A.
040600     MOVE 7 TO CORRECT-A.
040700     PERFORM FAIL.
040800     GO TO IDX-WRITE-5.
040900 IDX-DELETE-5.
041000     PERFORM DE-LETE.
041100 IDX-WRITE-5.
041200     MOVE "IDX-TEST-5" TO PAR-NAME.
041300     PERFORM PRINT-DETAIL.
041400     MOVE "SET STATEMENT" TO FEATURE.
041500 IDX-TEST-6.
041600     MOVE 1 TO UNSGN-IDX.
041700     SET IDX-2 TO UNSGN-IDX.
041800     IF ENTRY-A-2 (IDX-2) EQUAL TO "15"
041900         PERFORM PASS
042000         GO TO IDX-WRITE-6.
042100     MOVE ENTRY-A-2 (IDX-2) TO COMPUTED-A.
042200     MOVE 15 TO CORRECT-A.
042300     PERFORM FAIL.
042400     GO TO IDX-WRITE-6.
042500 IDX-DELETE-6.
042600     PERFORM DE-LETE.
042700 IDX-WRITE-6.
042800     MOVE "IDX-TEST-6" TO PAR-NAME.
042900     PERFORM PRINT-DETAIL.
043000 IDX-TEST-7.
043100     SET IDX-1 TO 4.
043200     SET IDX-2 TO IDX-1.
043300     IF IDX-2 EQUAL TO 4
043400         PERFORM PASS
043500         GO TO IDX-WRITE-7.
043600     MOVE 4 TO CORRECT-A.
043700     SET      INDEX-VALUE TO IDX-2.
043800     MOVE     INDEX-VALUE TO COMPUTED-18V0.
043900     PERFORM FAIL.
044000     GO TO IDX-WRITE-7.
044100 IDX-DELETE-7.
044200     PERFORM DE-LETE.
044300 IDX-WRITE-7.
044400     MOVE "IDX-TEST-7" TO PAR-NAME.
044500     PERFORM PRINT-DETAIL.
044600 IDX-TEST-8.
044700     SET IDX-1 TO 4.
044800     SET IDX-2 TO IDX-1.
044900     IF ENTRY-A-4 (IDX-2) EQUAL TO "8"
045000         PERFORM PASS
045100         GO TO IDX-WRITE-8.
045200     MOVE 8 TO CORRECT-A.
045300     MOVE     ENTRY-A-4 (IDX-2) TO COMPUTED-A.
045400     PERFORM FAIL.
045500     GO TO IDX-WRITE-8.
045600 IDX-DELETE-8.
045700     PERFORM DE-LETE.
045800 IDX-WRITE-8.
045900     MOVE "IDX-TEST-8" TO PAR-NAME.
046000     PERFORM PRINT-DETAIL.
046100 IDX-TEST-9.
046200     SET IDX-X2 TO 02.
046300     SET USE-IDX TO IDX-X2.
046400     SET IDX-2 TO USE-IDX.
046500     IF IDX-2 EQUAL TO 2
046600         PERFORM PASS
046700         GO TO IDX-WRITE-9.
046800     MOVE 2 TO CORRECT-A.
046900     SET      INDEX-VALUE TO IDX-2.
047000     MOVE     INDEX-VALUE TO COMPUTED-18V0.
047100     PERFORM FAIL.
047200     GO TO IDX-WRITE-9.
047300 IDX-DELETE-9.
047400     PERFORM DE-LETE.
047500 IDX-WRITE-9.
047600     MOVE "IDX-TEST-9" TO PAR-NAME.
047700     PERFORM PRINT-DETAIL.
047800 IDX-TEST-10.
047900     SET IDX-2 TO 4.
048000     SET USE-IDX TO IDX-2.
048100     SET IDX-X2 TO USE-IDX.
048200     IF ENTRY-A-8 (IDX-X2) EQUAL TO ENTRY-A-4 (IDX-2)
048300         PERFORM PASS
048400         GO TO IDX-WRITE-10.
048500     MOVE ENTRY-A-4 (IDX-2) TO COMPUTED-A.
048600     MOVE ENTRY-A-8 (IDX-X2) TO CORRECT-A.
048700     MOVE "TABLE ENTRIES SHOULD BE EQUAL" TO RE-MARK.
048800     PERFORM FAIL.
048900     GO TO IDX-WRITE-10.
049000 IDX-DELETE-10.
049100     PERFORM DE-LETE.
049200 IDX-WRITE-10.
049300     MOVE "IDX-TEST-10" TO PAR-NAME.
049400     PERFORM PRINT-DETAIL.
049500 IDX-TEST-11.
049600     SET IDX-3 TO 0004.
049700     IF ENTRY-B-2 (IDX-3) EQUAL TO 4
049800         PERFORM PASS
049900         GO TO IDX-WRITE-11.
050000     MOVE ENTRY-B-2 (IDX-3) TO COMPUTED-A.
050100     MOVE 4 TO CORRECT-A.
050200     PERFORM FAIL.
050300     GO TO IDX-WRITE-11.
050400 IDX-DELETE-11.
050500     PERFORM DE-LETE.
050600 IDX-WRITE-11.
050700     MOVE "IDX-TEST-11" TO PAR-NAME.
050800     PERFORM PRINT-DETAIL.
050900 IDX-TEST-12.
051000     SET IDX-3 TO 0000002.
051100     IF ENTRY-B-2 (IDX-3) EQUAL TO 2
051200         PERFORM PASS
051300         GO TO IDX-WRITE-12.
051400     MOVE ENTRY-B-2 (IDX-3) TO COMPUTED-A.
051500     MOVE 2 TO CORRECT-A.
051600     PERFORM FAIL.
051700     GO TO IDX-WRITE-12.
051800 IDX-DELETE-12.
051900     PERFORM DE-LETE.
052000 IDX-WRITE-12.
052100     MOVE "IDX-TEST-12" TO PAR-NAME.
052200     PERFORM PRINT-DETAIL.
052300 IDX-TEST-13.
052400     SET IDX-3 TO 000000000000000003.
052500     IF ENTRY-B-2 (IDX-3) EQUAL TO 3
052600         PERFORM PASS
052700         GO TO IDX-WRITE-13.
052800     MOVE ENTRY-B-2 (IDX-3) TO COMPUTED-A.
052900     MOVE 3 TO CORRECT-A.
053000     PERFORM FAIL.
053100     GO TO IDX-WRITE-13.
053200 IDX-DELETE-13.
053300     PERFORM DE-LETE.
053400 IDX-WRITE-13.
053500     MOVE "IDX-TEST-13" TO PAR-NAME.
053600     PERFORM PRINT-DETAIL.
053700 IDX-TEST-14.
053800     SET IDX-3 TO 000000000000000004.
053900     IF ENTRY-B-2 (IDX-3) EQUAL TO 4
054000         PERFORM PASS
054100         GO TO IDX-WRITE-14.
054200     MOVE ENTRY-B-2 (IDX-3) TO COMPUTED-A.
054300     MOVE 4 TO CORRECT-A.
054400     PERFORM FAIL.
054500     GO TO IDX-WRITE-14.
054600 IDX-DELETE-14.
054700     PERFORM DE-LETE.
054800 IDX-WRITE-14.
054900     MOVE "IDX-TEST-14" TO PAR-NAME.
055000     PERFORM PRINT-DETAIL.
055100 IDX-TEST-15.
055200     SET IDX-3 TO 000000000000000002.
055300     IF ENTRY-B-2 (IDX-3) EQUAL TO 2
055400         PERFORM PASS
055500         GO TO IDX-WRITE-15.
055600     MOVE ENTRY-B-2 (IDX-3) TO COMPUTED-A.
055700     MOVE 2 TO CORRECT-A.
055800     PERFORM FAIL.
055900     GO TO IDX-WRITE-15.
056000 IDX-DELETE-15.
056100     PERFORM DE-LETE.
056200 IDX-WRITE-15.
056300     MOVE "IDX-TEST-15" TO PAR-NAME.
056400     PERFORM PRINT-DETAIL.
056500 IDX-TEST-16.
056600     SET IDX-3 TO 03.
056700     SET IDX-2 TO 03.
056800     IF ENTRY-A-3 (IDX-2) EQUAL TO ENTRY-B-2 (IDX-3)
056900         PERFORM PASS
057000         GO TO IDX-WRITE-16.
057100     MOVE ENTRY-A-3 (IDX-2) TO COMPUTED-A.
057200     MOVE ENTRY-B-2 (IDX-3) TO CORRECT-A.
057300     MOVE "TABLE ENTRIES SHOULD BE EQUAL" TO RE-MARK.
057400     PERFORM FAIL.
057500     GO TO IDX-WRITE-16.
057600 IDX-DELETE-16.
057700     PERFORM DE-LETE.
057800 IDX-WRITE-16.
057900     MOVE "IDX-TEST-16" TO PAR-NAME.
058000     PERFORM PRINT-DETAIL.
058100 IDX-TEST-17.
058200     MOVE 3 TO COMP-U-IDX18.
058300     SET IDX-1 TO COMP-U-IDX18.
058400     IF ENTRY-A-1 (IDX-1) EQUAL TO "333"
058500         PERFORM PASS
058600         GO TO IDX-WRITE-17.
058700     MOVE "333" TO CORRECT-A.
058800     MOVE ENTRY-A-1 (IDX-1) TO COMPUTED-A.
058900     PERFORM FAIL.
059000     GO TO IDX-WRITE-17.
059100 IDX-DELETE-17.
059200     PERFORM DE-LETE.
059300 IDX-WRITE-17.
059400     MOVE "IDX-TEST-17" TO PAR-NAME.
059500     PERFORM PRINT-DETAIL.
059600 IDX-TEST-18.
059700     MOVE 4 TO COMP-S-IDX18.
059800     SET IDX-2 TO COMP-S-IDX18.
059900     IF ENTRY-A-2 (IDX-2) EQUAL TO "48"
060000         PERFORM PASS
060100         GO TO IDX-WRITE-18.
060200     MOVE "48" TO CORRECT-A.
060300     MOVE ENTRY-A-2 (IDX-2) TO COMPUTED-A.
060400     PERFORM FAIL.
060500     GO TO IDX-WRITE-18.
060600 IDX-DELETE-18.
060700     PERFORM DE-LETE.
060800 IDX-WRITE-18.
060900     MOVE "IDX-TEST-18" TO PAR-NAME.
061000     PERFORM PRINT-DETAIL.
061100 IDX-TEST-19.
061200     MOVE 1 TO COMP-U-IDX1.
061300     SET IDX-3 TO COMP-U-IDX1.
061400     IF ENTRY-B-2 (IDX-3) EQUAL TO 1
061500         PERFORM PASS
061600         GO TO IDX-WRITE-19.
061700     MOVE "1" TO CORRECT-A.
061800     MOVE ENTRY-B-2 (IDX-3) TO COMPUTED-A.
061900     PERFORM FAIL.
062000     GO TO IDX-WRITE-19.
062100 IDX-DELETE-19.
062200     PERFORM DE-LETE.
062300 IDX-WRITE-19.
062400     MOVE "IDX-TEST-19" TO PAR-NAME.
062500     PERFORM PRINT-DETAIL.
062600 IDX-TEST-20.
062700     MOVE 2 TO COMP-S-IDX1.
062800     SET IDX-2 TO COMP-S-IDX1.
062900     IF ENTRY-A-3 (IDX-2) EQUAL TO "2"
063000         PERFORM PASS
063100         GO TO IDX-WRITE-20.
063200     MOVE "2" TO CORRECT-A.
063300     MOVE ENTRY-A-3 (IDX-2) TO COMPUTED-A.
063400     PERFORM FAIL.
063500     GO TO IDX-WRITE-20.
063600 IDX-DELETE-20.
063700     PERFORM DE-LETE.
063800 IDX-WRITE-20.
063900     MOVE "IDX-TEST-20" TO PAR-NAME.
064000     PERFORM PRINT-DETAIL.
064100 IDX-TEST-21.
064200     SET IDX-1 TO 3.
064300     SET COMP-S-IDX18 TO IDX-1.
064400     IF COMP-S-IDX18 EQUAL TO +3
064500         PERFORM PASS
064600         GO TO IDX-WRITE-21.
064700     MOVE +3 TO CORRECT-N.
064800     MOVE COMP-S-IDX18 TO COMPUTED-N.
064900     PERFORM FAIL.
065000     GO TO IDX-WRITE-21.
065100 IDX-DELETE-21.
065200     PERFORM DE-LETE.
065300 IDX-WRITE-21.
065400     MOVE "IDX-TEST-21" TO PAR-NAME.
065500     PERFORM PRINT-DETAIL.
065600 IDX-TEST-22.
065700     SET IDX-2 TO 2.
065800     SET COMP-U-IDX1 TO IDX-2.
065900     IF COMP-U-IDX1 EQUAL TO 2
066000         PERFORM PASS
066100         GO TO IDX-WRITE-22.
066200     MOVE COMP-U-IDX1 TO COMPUTED-N.
066300     MOVE 2 TO CORRECT-N.
066400     PERFORM FAIL.
066500     GO TO IDX-WRITE-22.
066600 IDX-DELETE-22.
066700     PERFORM DE-LETE.
066800 IDX-WRITE-22.
066900     MOVE "IDX-TEST-22" TO PAR-NAME.
067000     PERFORM PRINT-DETAIL.
067100 IDX-TEST-23.
067200     MOVE 4 TO COMP-S-IDX18.
067300     SET IDX-2 TO COMP-S-IDX18.
067400     IF COMP-S-IDX18 EQUAL TO IDX-2
067500         PERFORM PASS
067600         GO TO IDX-WRITE-23.
067700     SET      INDEX-VALUE TO IDX-2.
067800     MOVE     INDEX-VALUE TO COMPUTED-18V0.
067900     MOVE    COMP-S-IDX18 TO CORRECT-18V0.
068000     MOVE "INDEX VALUES SHOULD BE EQUAL" TO RE-MARK.
068100     PERFORM FAIL.
068200     GO TO IDX-WRITE-23.
068300 IDX-DELETE-23.
068400     PERFORM DE-LETE.
068500 IDX-WRITE-23.
068600     MOVE "IDX-TEST-23" TO PAR-NAME.
068700     PERFORM PRINT-DETAIL.
068800 IDX-TEST-24.
068900     MOVE 2 TO COMP-U-IDX1.
069000     SET IDX-3 TO COMP-U-IDX1.
069100     IF IDX-3 EQUAL TO COMP-U-IDX1
069200         PERFORM PASS
069300         GO TO IDX-WRITE-24.
069400     MOVE     COMP-U-IDX1 TO CORRECT-18V0.
069500     SET      INDEX-VALUE TO IDX-3.
069600     MOVE     INDEX-VALUE TO COMPUTED-18V0.
069700     MOVE "INDEX VALUES SHOULD BE EQUAL" TO RE-MARK.
069800     PERFORM FAIL.
069900     GO TO IDX-WRITE-24.
070000 IDX-DELETE-24.
070100     PERFORM DE-LETE.
070200 IDX-WRITE-24.
070300     MOVE "IDX-TEST-24" TO PAR-NAME.
070400     PERFORM PRINT-DETAIL.
070500*IDX-TEST-25.
070600*    THIS TEST WAS DELETED BY THE FCCTS SINCE IT DID NOT
070700*    APPLY TO THE REVISED FEDERAL STANDARD - FIPS PUB 21-1.
070800*IDX-TEST-26.
070900*    THIS TEST WAS DELETED BY THE FCCTS SINCE IT DID NOT
071000*    APPLY TO THE REVISED FEDERAL STANDARD - FIPS PUB 21-1.
071100 CCVS-EXIT SECTION.
071200 CCVS-999999.
071300     GO TO CLOSE-FILES.
