000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC135A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*     PROGRAM NC135A TESTS THE USE OF INDEX-NAMES TO REFERENCE
002300*     3 DIMENSIONAL TABLE WHICH HAS BEEN REDEFINED.
002400*     FORMAT 2 OF THE SET STATEMENT AND RELATIVE INDEXING ARE
002500*     ALSO TESTED.
002600*
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 77  ONE PICTURE 999 VALUE IS 001.
004400 77  CTR-1 PICTURE 999 VALUE IS ZERO.
004500 77  W-3 PICTURE 999 VALUE ZERO.
004600 01  IDEN-1 PICTURE 99 VALUE 03.
004700 01  TABLE-9.
004800     02 TABLE-8 OCCURS 10 TIMES INDEXED BY INXEX1.
004900     03 TABLE-7 OCCURS 10 TIMES INDEXED BY INXEX2.
005000     04 TABLE-1 PICTURE 999 OCCURS 3 TIMES INDEXED BY INXEX3.
005100 01  TABLE-6 REDEFINES TABLE-9.
005200     02 TABLE-5 OCCURS 10 TIMES.
005300     03 TABLE-4 OCCURS 10 TIMES.
005400     04 TABLE-2 PICTURE 999 OCCURS 3 TIMES.
005500 01  NUMBER-LIST.
005600     02  FILLER PICTURE IS X VALUE IS SPACE.
005700     02 LINE-1 OCCURS 20 TIMES.
005800       03 BLANKSPACE PICTURE IS XX.
005900       03 PRINT-ELE PICTURE IS 999.
006000 01  DATA-NAMES USAGE IS INDEX.
006100     02 KEY-1.
006200     02 KEY-2.
006300     02 KEY-3.
006400 01  TEST-RESULTS.
006500     02 FILLER                   PIC X      VALUE SPACE.
006600     02 FEATURE                  PIC X(20)  VALUE SPACE.
006700     02 FILLER                   PIC X      VALUE SPACE.
006800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006900     02 FILLER                   PIC X      VALUE SPACE.
007000     02  PAR-NAME.
007100       03 FILLER                 PIC X(19)  VALUE SPACE.
007200       03  PARDOT-X              PIC X      VALUE SPACE.
007300       03 DOTVALUE               PIC 99     VALUE ZERO.
007400     02 FILLER                   PIC X(8)   VALUE SPACE.
007500     02 RE-MARK                  PIC X(61).
007600 01  TEST-COMPUTED.
007700     02 FILLER                   PIC X(30)  VALUE SPACE.
007800     02 FILLER                   PIC X(17)  VALUE
007900            "       COMPUTED=".
008000     02 COMPUTED-X.
008100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
008200     03 COMPUTED-N               REDEFINES COMPUTED-A
008300                                 PIC -9(9).9(9).
008400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
008500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
008600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
008700     03       CM-18V0 REDEFINES COMPUTED-A.
008800         04 COMPUTED-18V0                    PIC -9(18).
008900         04 FILLER                           PIC X.
009000     03 FILLER PIC X(50) VALUE SPACE.
009100 01  TEST-CORRECT.
009200     02 FILLER PIC X(30) VALUE SPACE.
009300     02 FILLER PIC X(17) VALUE "       CORRECT =".
009400     02 CORRECT-X.
009500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
009600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
009700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
009800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
010000     03      CR-18V0 REDEFINES CORRECT-A.
010100         04 CORRECT-18V0                     PIC -9(18).
010200         04 FILLER                           PIC X.
010300     03 FILLER PIC X(2) VALUE SPACE.
010400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
010500 01  CCVS-C-1.
010600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
010700-    "SS  PARAGRAPH-NAME
010800-    "       REMARKS".
010900     02 FILLER                     PIC X(20)    VALUE SPACE.
011000 01  CCVS-C-2.
011100     02 FILLER                     PIC X        VALUE SPACE.
011200     02 FILLER                     PIC X(6)     VALUE "TESTED".
011300     02 FILLER                     PIC X(15)    VALUE SPACE.
011400     02 FILLER                     PIC X(4)     VALUE "FAIL".
011500     02 FILLER                     PIC X(94)    VALUE SPACE.
011600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
011700 01  REC-CT                        PIC 99       VALUE ZERO.
011800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
011900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
012200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
012300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
012400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
012500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
012600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
012700 01  CCVS-H-1.
012800     02  FILLER                    PIC X(39)    VALUE SPACES.
012900     02  FILLER                    PIC X(42)    VALUE
013000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013100     02  FILLER                    PIC X(39)    VALUE SPACES.
013200 01  CCVS-H-2A.
013300   02  FILLER                        PIC X(40)  VALUE SPACE.
013400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
013500   02  FILLER                        PIC XXXX   VALUE
013600     "4.2 ".
013700   02  FILLER                        PIC X(28)  VALUE
013800            " COPY - NOT FOR DISTRIBUTION".
013900   02  FILLER                        PIC X(41)  VALUE SPACE.
014000
014100 01  CCVS-H-2B.
014200   02  FILLER                        PIC X(15)  VALUE
014300            "TEST RESULT OF ".
014400   02  TEST-ID                       PIC X(9).
014500   02  FILLER                        PIC X(4)   VALUE
014600            " IN ".
014700   02  FILLER                        PIC X(12)  VALUE
014800     " HIGH       ".
014900   02  FILLER                        PIC X(22)  VALUE
015000            " LEVEL VALIDATION FOR ".
015100   02  FILLER                        PIC X(58)  VALUE
015200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015300 01  CCVS-H-3.
015400     02  FILLER                      PIC X(34)  VALUE
015500            " FOR OFFICIAL USE ONLY    ".
015600     02  FILLER                      PIC X(58)  VALUE
015700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
015800     02  FILLER                      PIC X(28)  VALUE
015900            "  COPYRIGHT   1985 ".
016000 01  CCVS-E-1.
016100     02 FILLER                       PIC X(52)  VALUE SPACE.
016200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
016300     02 ID-AGAIN                     PIC X(9).
016400     02 FILLER                       PIC X(45)  VALUE SPACES.
016500 01  CCVS-E-2.
016600     02  FILLER                      PIC X(31)  VALUE SPACE.
016700     02  FILLER                      PIC X(21)  VALUE SPACE.
016800     02 CCVS-E-2-2.
016900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017000         03 FILLER                   PIC X      VALUE SPACE.
017100         03 ENDER-DESC               PIC X(44)  VALUE
017200            "ERRORS ENCOUNTERED".
017300 01  CCVS-E-3.
017400     02  FILLER                      PIC X(22)  VALUE
017500            " FOR OFFICIAL USE ONLY".
017600     02  FILLER                      PIC X(12)  VALUE SPACE.
017700     02  FILLER                      PIC X(58)  VALUE
017800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017900     02  FILLER                      PIC X(13)  VALUE SPACE.
018000     02 FILLER                       PIC X(15)  VALUE
018100             " COPYRIGHT 1985".
018200 01  CCVS-E-4.
018300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
018400     02 FILLER                       PIC X(4)   VALUE " OF ".
018500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
018600     02 FILLER                       PIC X(40)  VALUE
018700      "  TESTS WERE EXECUTED SUCCESSFULLY".
018800 01  XXINFO.
018900     02 FILLER                       PIC X(19)  VALUE
019000            "*** INFORMATION ***".
019100     02 INFO-TEXT.
019200       04 FILLER                     PIC X(8)   VALUE SPACE.
019300       04 XXCOMPUTED                 PIC X(20).
019400       04 FILLER                     PIC X(5)   VALUE SPACE.
019500       04 XXCORRECT                  PIC X(20).
019600     02 INF-ANSI-REFERENCE           PIC X(48).
019700 01  HYPHEN-LINE.
019800     02 FILLER  PIC IS X VALUE IS SPACE.
019900     02 FILLER  PIC IS X(65)    VALUE IS "************************
020000-    "*****************************************".
020100     02 FILLER  PIC IS X(54)    VALUE IS "************************
020200-    "******************************".
020300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
020400     "NC135A".
020500 PROCEDURE DIVISION.
020600 CCVS1 SECTION.
020700 OPEN-FILES.
020800     OPEN     OUTPUT PRINT-FILE.
020900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021000     MOVE    SPACE TO TEST-RESULTS.
021100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
021200     GO TO CCVS1-EXIT.
021300 CLOSE-FILES.
021400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
021500 TERMINATE-CCVS.
021600S    EXIT PROGRAM.
021700STERMINATE-CALL.
021800     STOP     RUN.
021900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
022200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
022300     MOVE "****TEST DELETED****" TO RE-MARK.
022400 PRINT-DETAIL.
022500     IF REC-CT NOT EQUAL TO ZERO
022600             MOVE "." TO PARDOT-X
022700             MOVE REC-CT TO DOTVALUE.
022800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
022900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
023200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
023300     MOVE SPACE TO CORRECT-X.
023400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
023500     MOVE     SPACE TO RE-MARK.
023600 HEAD-ROUTINE.
023700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024100 COLUMN-NAMES-ROUTINE.
024200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
024500 END-ROUTINE.
024600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
024700 END-RTN-EXIT.
024800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024900 END-ROUTINE-1.
025000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
025200      ADD PASS-COUNTER TO ERROR-HOLD.
025300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
025400      MOVE PASS-COUNTER TO CCVS-E-4-1.
025500      MOVE ERROR-HOLD TO CCVS-E-4-2.
025600      MOVE CCVS-E-4 TO CCVS-E-2-2.
025700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
025800  END-ROUTINE-12.
025900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026000     IF       ERROR-COUNTER IS EQUAL TO ZERO
026100         MOVE "NO " TO ERROR-TOTAL
026200         ELSE
026300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
026400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
026500     PERFORM WRITE-LINE.
026600 END-ROUTINE-13.
026700     IF DELETE-COUNTER IS EQUAL TO ZERO
026800         MOVE "NO " TO ERROR-TOTAL  ELSE
026900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027200      IF   INSPECT-COUNTER EQUAL TO ZERO
027300          MOVE "NO " TO ERROR-TOTAL
027400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
027500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
027600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027800 WRITE-LINE.
027900     ADD 1 TO RECORD-COUNT.
028000Y    IF RECORD-COUNT GREATER 42
028100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
028200Y        MOVE SPACE TO DUMMY-RECORD
028300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
028400Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028500Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
028600Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
028700Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
028800Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
028900Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
029000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029200Y        MOVE ZERO TO RECORD-COUNT.
029300     PERFORM WRT-LN.
029400 WRT-LN.
029500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
029600     MOVE SPACE TO DUMMY-RECORD.
029700 BLANK-LINE-PRINT.
029800     PERFORM WRT-LN.
029900 FAIL-ROUTINE.
030000     IF     COMPUTED-X NOT EQUAL TO SPACE
030100            GO TO FAIL-ROUTINE-WRITE.
030200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
030500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030600     MOVE   SPACES TO INF-ANSI-REFERENCE.
030700     GO TO  FAIL-ROUTINE-EX.
030800 FAIL-ROUTINE-WRITE.
030900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
031000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
031100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
031200     MOVE   SPACES TO COR-ANSI-REFERENCE.
031300 FAIL-ROUTINE-EX. EXIT.
031400 BAIL-OUT.
031500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
031600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
031700 BAIL-OUT-WRITE.
031800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
031900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032100     MOVE   SPACES TO INF-ANSI-REFERENCE.
032200 BAIL-OUT-EX. EXIT.
032300 CCVS1-EXIT.
032400     EXIT.
032500 SECT-NC135A-001 SECTION.
032600 PARAGRAPH-NAME-4.
032700     MOVE "IV-21 4.3.8.2" TO ANSI-REFERENCE.
032800     SET INXEX1  INXEX2 INXEX3 TO 001.
032900     MOVE 001 TO W-3.
033000 PARAGRAPH-NAME-5.
033100     MOVE W-3 TO TABLE-1 (INXEX1  INXEX2  INXEX3).
033200     ADD 01 TO W-3.
033300     IF       INXEX3 EQUAL TO 3
033400              GO TO PARAGRAPH-NAME-6.
033500     SET INXEX3 UP BY 1.
033600     GO TO PARAGRAPH-NAME-5.
033700 PARAGRAPH-NAME-6.
033800     SET     INXEX3 TO 1
033900     IF       INXEX2 EQUAL TO 10
034000                  GO TO PARAGRAPH-NAME-7.
034100     SET INXEX2 UP BY 001.
034200     GO TO PARAGRAPH-NAME-5.
034300 PARAGRAPH-NAME-7.
034400     SET     INXEX2 TO 1
034500     IF       INXEX1 EQUAL TO 10
034600               GO TO PARAGRAPH-NAME-8.
034700     SET INXEX1 UP BY 001.
034800     GO TO PARAGRAPH-NAME-5.
034900*    THIS SECTION GENERATES VALUES FOR A 10X10X3 TABLE
035000*    AND THE TABLE IS USED IN THE TESTS IN THIS ROUTINE.
035100 PARAGRAPH-NAME-8.
035200     EXIT.
035300 SECTION-NAME-2 SECTION.
035400 PARAGRAPH-NAME-9.
035500*
035600     MOVE SPACE TO COMPUTED-A  CORRECT-A.
035700     MOVE "INDEXING" TO FEATURE.
035800     SET INXEX1 INXEX2 INXEX3 TO  01.
035900 INDEX-TEST-1.
036000     IF TABLE-1 (INXEX1  INXEX2  INXEX3) EQUAL TO  001
036100     PERFORM PASS
036200     GO TO WRITE-1.
036300     MOVE TABLE-1 (INXEX1  INXEX2  INXEX3) TO COMPUTED-A.
036400     MOVE 001 TO CORRECT-A.
036500     PERFORM FAIL.
036600     GO TO WRITE-1.
036700 DELETE-1.
036800     PERFORM DE-LETE.
036900 WRITE-1.
037000     MOVE "INDEX-TEST-1" TO PAR-NAME.
037100     PERFORM PRINT-DETAIL.
037200 INDEX-TEST-2.
037300     SET INXEX1 INXEX2 INXEX3 TO 01.
037400     IF TABLE-1 (INXEX1  INXEX2 + 1  INXEX3 + 1) EQUAL TO 005
037500     PERFORM PASS
037600     GO TO WRITE-2.
037700     MOVE TABLE-1 (INXEX1  INXEX2 + 1  INXEX3 + 1) TO
037800         COMPUTED-A.
037900     MOVE "005" TO CORRECT-A.
038000     PERFORM FAIL.
038100     GO TO WRITE-2.
038200 DELETE-2.
038300     PERFORM DE-LETE.
038400 WRITE-2.
038500     MOVE "INDEX-TEST-2" TO PAR-NAME.
038600     PERFORM PRINT-DETAIL.
038700 INDEX-TEST-3.
038800     SET INXEX1 INXEX2 TO  10.
038900     SET INXEX3 TO  03.
039000     IF TABLE-1 (INXEX1  INXEX2  INXEX3 - 1) EQUAL TO 299
039100     PERFORM PASS
039200     GO TO WRITE-3.
039300     MOVE TABLE-1 (INXEX1  INXEX2  INXEX3 - 1) TO COMPUTED-A.
039400     MOVE "299" TO CORRECT-A.
039500     PERFORM FAIL.
039600     GO TO WRITE-3.
039700 DELETE-3.
039800     PERFORM DE-LETE.
039900 WRITE-3.
040000     MOVE "INDEX-TEST-3" TO PAR-NAME.
040100     PERFORM PRINT-DETAIL.
040200 INDEX-TEST-4.
040300     SET INXEX1 INXEX2 TO 10.
040400     SET INXEX3 TO 03.
040500     IF TABLE-1 (INXEX1 - 5  INXEX2 - 7  INXEX3) EQUAL TO 129
040600     PERFORM PASS
040700     GO TO WRITE-4.
040800     MOVE TABLE-1 (INXEX1 - 5  INXEX2 - 7  INXEX3) TO
040900         COMPUTED-A.
041000     MOVE "129" TO CORRECT-A.
041100     PERFORM FAIL.
041200     GO TO WRITE-4.
041300 DELETE-4.
041400     PERFORM DE-LETE.
041500 WRITE-4.
041600     MOVE "INDEX-TEST-4" TO PAR-NAME.
041700     PERFORM PRINT-DETAIL.
041800 INDEX-TEST-5.
041900     SET INXEX1 TO 10.
042000     SET KEY-1 TO INXEX1.
042100     SET INXEX1 TO 05.
042200     SET INXEX2 TO 10.
042300     SET INXEX3 TO 03.
042400     SET INXEX1 TO KEY-1.
042500     IF TABLE-1  (INXEX1  INXEX2  INXEX3) EQUAL TO 300
042600         PERFORM PASS
042700         GO TO WRITE-5.
042800     MOVE TABLE-1 (INXEX1  INXEX2  INXEX3) TO COMPUTED-A.
042900     MOVE "300" TO CORRECT-A.
043000     PERFORM FAIL.
043100     GO TO WRITE-5.
043200 DELETE-5.
043300     PERFORM DE-LETE.
043400 WRITE-5.
043500     MOVE "INDEX-TEST-5" TO PAR-NAME.
043600     PERFORM PRINT-DETAIL.
043700 INDEX-TEST-6.
043800     SET INXEX1 INXEX2 TO 10.
043900     SET INXEX3 TO 03.
044000     SET INXEX1 DOWN BY 01.
044100     SET  INXEX2 DOWN BY  IDEN-1.
044200*    NOTE IDEN-1 IS EQUAL TO 03.
044300     SET INXEX3 DOWN BY 2.
044400     IF TABLE-1  (INXEX1  INXEX2  INXEX3) EQUAL TO 259
044500         PERFORM PASS
044600         GO TO WRITE-6.
044700     MOVE TABLE-1 (INXEX1  INXEX2  INXEX3) TO COMPUTED-A.
044800     MOVE "259" TO CORRECT-A.
044900     PERFORM FAIL.
045000     GO TO WRITE-6.
045100 DELETE-6.
045200     PERFORM DE-LETE.
045300 WRITE-6.
045400     MOVE "INDEX-TEST-6" TO PAR-NAME.
045500     PERFORM PRINT-DETAIL.
045600 INDEX-TEST-7.
045700     SET INXEX1 TO ONE.
045800     SET INXEX2 INXEX3 TO INXEX1.
045900     IF TABLE-1  (INXEX1  INXEX2  INXEX3) EQUAL TO 001
046000         PERFORM PASS
046100         GO TO WRITE-7.
046200     MOVE TABLE-1 (INXEX1  INXEX2  INXEX3) TO COMPUTED-A.
046300     MOVE "001" TO CORRECT-A.
046400     PERFORM FAIL.
046500     GO TO WRITE-7.
046600 DELETE-7.
046700     PERFORM DE-LETE.
046800 WRITE-7.
046900     MOVE "INDEX-TEST-7" TO PAR-NAME.
047000     PERFORM PRINT-DETAIL.
047100 SECTION-NAME-3 SECTION.
047200 PARAGRAPH-NAME-10.
047300     PERFORM BLANK-LINE-PRINT 2 TIMES.
047400     PERFORM INSPT.
047500     MOVE SPACES TO PRINT-REC.
047600     WRITE PRINT-REC.
047700     MOVE "NOTE THIS SECTION WRITES A 20X15 TABLE OF THREE-DIGIT
047800-       "NUMBERS 001 TO 300 --- THERE SHOULD BE TWO" TO PRINT-REC.
047900     WRITE PRINT-REC.
048000     MOVE SPACES TO PRINT-REC.
048100     MOVE "SPACES BETWEEN EACH NUMBER ON A LINE --- THE NUMBERS
048200-      "001 THRU 020 SHOULD FORM THE FIRST LINE ---" TO PRINT-REC.
048300     WRITE PRINT-REC.
048400     MOVE SPACES TO PRINT-REC.
048500     MOVE "THE VALUES IN THIS TABLE WERE GENERATED IN
048600-       "SECTION-NAME-1 SECTION." TO PRINT-REC.
048700     WRITE PRINT-REC.
048800     MOVE SPACES TO PRINT-REC.
048900     SET INXEX1  INXEX2 INXEX3 TO ONE.
049000     MOVE 01 TO CTR-1.
049100 PARAGRAPH-NAME-11.
049200     MOVE TABLE-1 (INXEX1  INXEX2  INXEX3)  TO
049300     PRINT-ELE (CTR-1)
049400     MOVE SPACE TO BLANKSPACE (CTR-1).
049500     ADD 1 TO CTR-1
049600     IF CTR-1 EQUAL TO 21 PERFORM PARAGRAPH-NAME-15.
049700     IF       INXEX3 EQUAL TO 3 GO TO PARAGRAPH-NAME-12.
049800     SET INXEX3 UP BY   1.
049900     GO TO    PARAGRAPH-NAME-11.
050000 PARAGRAPH-NAME-12.
050100     SET INXEX3 TO 1.
050200     IF       INXEX2 EQUAL TO 10 GO TO PARAGRAPH-NAME-13.
050300     SET INXEX2 UP BY 1.
050400     GO TO    PARAGRAPH-NAME-11.
050500 PARAGRAPH-NAME-13.
050600     SET INXEX2 TO 1.
050700     IF       INXEX1 EQUAL TO 10 GO TO PARAGRAPH-NAME-14.
050800     SET INXEX1 UP BY 1.
050900     GO TO    PARAGRAPH-NAME-11.
051000 PARAGRAPH-NAME-14.
051100     GO TO PARAGRAPH-NAME-16.
051200 PARAGRAPH-NAME-15.
051300     MOVE SPACE TO PRINT-REC.
051400     MOVE NUMBER-LIST TO PRINT-REC.
051500     WRITE PRINT-REC AFTER 1.
051600     MOVE 01 TO CTR-1.
051700 PARAGRAPH-NAME-16.
051800     EXIT.
051900 CCVS-EXIT SECTION.
052000 CCVS-999999.
052100     GO TO CLOSE-FILES.
