000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC137A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC137A VERIFIES THE ACCURACY OF BUILDING AND
002300*    ACCESSING A 3 DIMENSIONAL TABLE USING INDEXES.
002400*
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.
002800     XXXXX082.
002900 OBJECT-COMPUTER.
003000     XXXXX083.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300     SELECT PRINT-FILE ASSIGN TO
003400     XXXXX055.
003500 DATA DIVISION.
003600 FILE SECTION.
003700 FD  PRINT-FILE.
003800 01  PRINT-REC PICTURE X(120).
003900 01  DUMMY-RECORD PICTURE X(120).
004000 WORKING-STORAGE SECTION.
004100 77  SUB-1              PICTURE S99  VALUE ZERO.
004200 77  SUB-2              PICTURE 99   VALUE ZERO.
004300 77  SUB-3              PICTURE 99  VALUE ZERO.
004400 77  CON-7              PICTURE 99  VALUE 07.
004500 77  CON-10             PICTURE 99  VALUE 10.
004600 77  CON-5              PICTURE 99  VALUE 05.
004700 77  CON-6              PICTURE 99  VALUE 06.
004800 01  GRP-NAME.
004900     02  FILLER              PICTURE XXX    VALUE "GRP".
005000     02  ADD-GRP             PICTURE 99     VALUE 01.
005100
005200 01  SEC-NAME.
005300     02  FILLER              PICTURE X(5)   VALUE "SEC (".
005400     02  SEC-GRP             PICTURE 99     VALUE 00.
005500     02  FILLER              PICTURE X      VALUE " ".
005600     02  ADD-SEC             PICTURE 99     VALUE 01.
005700     02  FILLER              PICTURE X      VALUE ")".
005800
005900 01  ELEM-NAME.
006000     02  FILLER              PICTURE X(6)   VALUE "ELEM (".
006100     02  ELEM-GRP            PICTURE 99     VALUE 00.
006200     02  FILLER              PICTURE X      VALUE " ".
006300     02  ELEM-SEC            PICTURE 99     VALUE 00.
006400     02  FILLER              PICTURE X      VALUE " ".
006500     02  ADD-ELEM            PICTURE 99     VALUE 01.
006600     02  FILLER              PICTURE X      VALUE ")".
006700
006800 01  THREE-DIMENSION-TBL.
006900     02  GRP-ENTRY OCCURS 10 TIMES INDEXED BY IDX-1.
007000         03  ENTRY-1         PICTURE X(5).
007100         03  GRP2-ENTRY OCCURS 10 TIMES INDEXED BY IDX-2.
007200             04  ENTRY-2     PICTURE X(11).
007300             04  GRP3-ENTRY OCCURS 10 TIMES INDEXED BY IDX-3.
007400                 05  ENTRY-3 PICTURE X(15).
007500
007600 01  TEST-RESULTS.
007700     02 FILLER                   PIC X      VALUE SPACE.
007800     02 FEATURE                  PIC X(20)  VALUE SPACE.
007900     02 FILLER                   PIC X      VALUE SPACE.
008000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
008100     02 FILLER                   PIC X      VALUE SPACE.
008200     02  PAR-NAME.
008300       03 FILLER                 PIC X(19)  VALUE SPACE.
008400       03  PARDOT-X              PIC X      VALUE SPACE.
008500       03 DOTVALUE               PIC 99     VALUE ZERO.
008600     02 FILLER                   PIC X(8)   VALUE SPACE.
008700     02 RE-MARK                  PIC X(61).
008800 01  TEST-COMPUTED.
008900     02 FILLER                   PIC X(30)  VALUE SPACE.
009000     02 FILLER                   PIC X(17)  VALUE
009100            "       COMPUTED=".
009200     02 COMPUTED-X.
009300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009400     03 COMPUTED-N               REDEFINES COMPUTED-A
009500                                 PIC -9(9).9(9).
009600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
009700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
009800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
009900     03       CM-18V0 REDEFINES COMPUTED-A.
010000         04 COMPUTED-18V0                    PIC -9(18).
010100         04 FILLER                           PIC X.
010200     03 FILLER PIC X(50) VALUE SPACE.
010300 01  TEST-CORRECT.
010400     02 FILLER PIC X(30) VALUE SPACE.
010500     02 FILLER PIC X(17) VALUE "       CORRECT =".
010600     02 CORRECT-X.
010700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
010800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
010900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
011000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
011100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
011200     03      CR-18V0 REDEFINES CORRECT-A.
011300         04 CORRECT-18V0                     PIC -9(18).
011400         04 FILLER                           PIC X.
011500     03 FILLER PIC X(2) VALUE SPACE.
011600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011700 01  CCVS-C-1.
011800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011900-    "SS  PARAGRAPH-NAME
012000-    "       REMARKS".
012100     02 FILLER                     PIC X(20)    VALUE SPACE.
012200 01  CCVS-C-2.
012300     02 FILLER                     PIC X        VALUE SPACE.
012400     02 FILLER                     PIC X(6)     VALUE "TESTED".
012500     02 FILLER                     PIC X(15)    VALUE SPACE.
012600     02 FILLER                     PIC X(4)     VALUE "FAIL".
012700     02 FILLER                     PIC X(94)    VALUE SPACE.
012800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012900 01  REC-CT                        PIC 99       VALUE ZERO.
013000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013900 01  CCVS-H-1.
014000     02  FILLER                    PIC X(39)    VALUE SPACES.
014100     02  FILLER                    PIC X(42)    VALUE
014200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014300     02  FILLER                    PIC X(39)    VALUE SPACES.
014400 01  CCVS-H-2A.
014500   02  FILLER                        PIC X(40)  VALUE SPACE.
014600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014700   02  FILLER                        PIC XXXX   VALUE
014800     "4.2 ".
014900   02  FILLER                        PIC X(28)  VALUE
015000            " COPY - NOT FOR DISTRIBUTION".
015100   02  FILLER                        PIC X(41)  VALUE SPACE.
015200
015300 01  CCVS-H-2B.
015400   02  FILLER                        PIC X(15)  VALUE
015500            "TEST RESULT OF ".
015600   02  TEST-ID                       PIC X(9).
015700   02  FILLER                        PIC X(4)   VALUE
015800            " IN ".
015900   02  FILLER                        PIC X(12)  VALUE
016000     " HIGH       ".
016100   02  FILLER                        PIC X(22)  VALUE
016200            " LEVEL VALIDATION FOR ".
016300   02  FILLER                        PIC X(58)  VALUE
016400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016500 01  CCVS-H-3.
016600     02  FILLER                      PIC X(34)  VALUE
016700            " FOR OFFICIAL USE ONLY    ".
016800     02  FILLER                      PIC X(58)  VALUE
016900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017000     02  FILLER                      PIC X(28)  VALUE
017100            "  COPYRIGHT   1985 ".
017200 01  CCVS-E-1.
017300     02 FILLER                       PIC X(52)  VALUE SPACE.
017400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017500     02 ID-AGAIN                     PIC X(9).
017600     02 FILLER                       PIC X(45)  VALUE SPACES.
017700 01  CCVS-E-2.
017800     02  FILLER                      PIC X(31)  VALUE SPACE.
017900     02  FILLER                      PIC X(21)  VALUE SPACE.
018000     02 CCVS-E-2-2.
018100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018200         03 FILLER                   PIC X      VALUE SPACE.
018300         03 ENDER-DESC               PIC X(44)  VALUE
018400            "ERRORS ENCOUNTERED".
018500 01  CCVS-E-3.
018600     02  FILLER                      PIC X(22)  VALUE
018700            " FOR OFFICIAL USE ONLY".
018800     02  FILLER                      PIC X(12)  VALUE SPACE.
018900     02  FILLER                      PIC X(58)  VALUE
019000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019100     02  FILLER                      PIC X(13)  VALUE SPACE.
019200     02 FILLER                       PIC X(15)  VALUE
019300             " COPYRIGHT 1985".
019400 01  CCVS-E-4.
019500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019600     02 FILLER                       PIC X(4)   VALUE " OF ".
019700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019800     02 FILLER                       PIC X(40)  VALUE
019900      "  TESTS WERE EXECUTED SUCCESSFULLY".
020000 01  XXINFO.
020100     02 FILLER                       PIC X(19)  VALUE
020200            "*** INFORMATION ***".
020300     02 INFO-TEXT.
020400       04 FILLER                     PIC X(8)   VALUE SPACE.
020500       04 XXCOMPUTED                 PIC X(20).
020600       04 FILLER                     PIC X(5)   VALUE SPACE.
020700       04 XXCORRECT                  PIC X(20).
020800     02 INF-ANSI-REFERENCE           PIC X(48).
020900 01  HYPHEN-LINE.
021000     02 FILLER  PIC IS X VALUE IS SPACE.
021100     02 FILLER  PIC IS X(65)    VALUE IS "************************
021200-    "*****************************************".
021300     02 FILLER  PIC IS X(54)    VALUE IS "************************
021400-    "******************************".
021500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021600     "NC137A".
021700 PROCEDURE DIVISION.
021800 CCVS1 SECTION.
021900 OPEN-FILES.
022000     OPEN     OUTPUT PRINT-FILE.
022100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022200     MOVE    SPACE TO TEST-RESULTS.
022300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022400     GO TO CCVS1-EXIT.
022500 CLOSE-FILES.
022600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022700 TERMINATE-CCVS.
022800S    EXIT PROGRAM.
022900STERMINATE-CALL.
023000     STOP     RUN.
023100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023500     MOVE "****TEST DELETED****" TO RE-MARK.
023600 PRINT-DETAIL.
023700     IF REC-CT NOT EQUAL TO ZERO
023800             MOVE "." TO PARDOT-X
023900             MOVE REC-CT TO DOTVALUE.
024000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024500     MOVE SPACE TO CORRECT-X.
024600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024700     MOVE     SPACE TO RE-MARK.
024800 HEAD-ROUTINE.
024900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025300 COLUMN-NAMES-ROUTINE.
025400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025700 END-ROUTINE.
025800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025900 END-RTN-EXIT.
026000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026100 END-ROUTINE-1.
026200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026400      ADD PASS-COUNTER TO ERROR-HOLD.
026500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
026600      MOVE PASS-COUNTER TO CCVS-E-4-1.
026700      MOVE ERROR-HOLD TO CCVS-E-4-2.
026800      MOVE CCVS-E-4 TO CCVS-E-2-2.
026900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027000  END-ROUTINE-12.
027100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027200     IF       ERROR-COUNTER IS EQUAL TO ZERO
027300         MOVE "NO " TO ERROR-TOTAL
027400         ELSE
027500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027700     PERFORM WRITE-LINE.
027800 END-ROUTINE-13.
027900     IF DELETE-COUNTER IS EQUAL TO ZERO
028000         MOVE "NO " TO ERROR-TOTAL  ELSE
028100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028400      IF   INSPECT-COUNTER EQUAL TO ZERO
028500          MOVE "NO " TO ERROR-TOTAL
028600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029000 WRITE-LINE.
029100     ADD 1 TO RECORD-COUNT.
029200Y    IF RECORD-COUNT GREATER 42
029300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029400Y        MOVE SPACE TO DUMMY-RECORD
029500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029600Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029700Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029800Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
029900Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030000Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
030100Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
030200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030400Y        MOVE ZERO TO RECORD-COUNT.
030500     PERFORM WRT-LN.
030600 WRT-LN.
030700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030800     MOVE SPACE TO DUMMY-RECORD.
030900 BLANK-LINE-PRINT.
031000     PERFORM WRT-LN.
031100 FAIL-ROUTINE.
031200     IF     COMPUTED-X NOT EQUAL TO SPACE
031300            GO TO FAIL-ROUTINE-WRITE.
031400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031800     MOVE   SPACES TO INF-ANSI-REFERENCE.
031900     GO TO  FAIL-ROUTINE-EX.
032000 FAIL-ROUTINE-WRITE.
032100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
032200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
032300     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
032400     MOVE   SPACES TO COR-ANSI-REFERENCE.
032500 FAIL-ROUTINE-EX. EXIT.
032600 BAIL-OUT.
032700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032900 BAIL-OUT-WRITE.
033000     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
033100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033300     MOVE   SPACES TO INF-ANSI-REFERENCE.
033400 BAIL-OUT-EX. EXIT.
033500 CCVS1-EXIT.
033600     EXIT.
033700 SECT-NC137A-001 SECTION.
033800 NC137A-001.
033900
034000 BUILD-LEVEL-1.
034100     MOVE "IV-21 4.3.8.2" TO ANSI-REFERENCE.
034200     ADD 1 TO SUB-1.
034300     IF SUB-1 EQUAL TO 11 GO TO CHECK-ENTRIES.
034400     MOVE GRP-NAME TO ENTRY-1 (SUB-1).
034500     ADD 1 TO ADD-GRP.
034600
034700 BUILD-LEVEL-2.
034800     ADD 1 TO SUB-2.
034900     IF SUB-2 EQUAL TO 11
035000         MOVE ZERO TO SUB-2
035100         MOVE 01 TO ADD-SEC
035200         GO TO BUILD-LEVEL-1.
035300     MOVE SUB-1 TO SEC-GRP.
035400     MOVE SEC-NAME TO ENTRY-2 (SUB-1  SUB-2).
035500     ADD 1 TO ADD-SEC.
035600
035700 BUILD-LEVEL-3.
035800     ADD 1 TO SUB-3.
035900     IF SUB-3 EQUAL TO 11
036000         MOVE ZERO TO SUB-3
036100              MOVE 01 TO ADD-ELEM
036200              GO TO BUILD-LEVEL-2.
036300     MOVE SUB-1 TO ELEM-GRP.
036400     MOVE SUB-2 TO ELEM-SEC.
036500     MOVE ELEM-NAME TO ENTRY-3 (SUB-1  SUB-2  SUB-3).
036600     ADD 1 TO ADD-ELEM.
036700     GO TO BUILD-LEVEL-3.
036800
036900 CHECK-ENTRIES.
037000     MOVE "LEVEL 1 INT INDEXING" TO FEATURE.
037100     MOVE "CHECK-ENTRIES       " TO PAR-NAME.
037200     SET IDX-1 TO 5.
037300     IF ENTRY-1 (IDX-1) IS NOT EQUAL TO "GRP05"
037400         MOVE "GRP05" TO CORRECT-A
037500         MOVE ENTRY-1 (IDX-1) TO COMPUTED-A
037600
037700         MOVE "INTERNAL INDEXING LEVEL 1  " TO RE-MARK
037800         PERFORM FAIL
037900         GO TO TEST-1-WRITE.
038000
038100     PERFORM PASS.
038200 TEST-1-WRITE.
038300     PERFORM PRINT-DETAIL.
038400
038500 TEST-1-2.
038600     MOVE "TEST-1-2            " TO PAR-NAME.
038700     SET IDX-1 TO 8.
038800     IF ENTRY-1 (IDX-1) IS NOT EQUAL TO "GRP08"
038900         MOVE "GRP08" TO CORRECT-A
039000         MOVE ENTRY-1 (IDX-1) TO COMPUTED-A
039100
039200         MOVE "INTERNAL INDEXING LEVEL 1  " TO RE-MARK
039300         PERFORM FAIL
039400          GO TO TEST-1-2-WRITE.
039500
039600     PERFORM PASS.
039700 TEST-1-2-WRITE.
039800     PERFORM PRINT-DETAIL.
039900
040000 TEST-2.
040100     MOVE "LEVEL 2 INT INDEXING" TO FEATURE.
040200     MOVE "TEST-2              " TO PAR-NAME.
040300     SET IDX-1 TO 5.
040400     SET IDX-2 TO 6.
040500     IF ENTRY-2 (IDX-1  IDX-2) IS NOT EQUAL TO "SEC (05 06)"
040600         MOVE "SEC (05 06)" TO CORRECT-A
040700         MOVE ENTRY-2 (IDX-1  IDX-2) TO COMPUTED-A
040800
040900         MOVE "INTERNAL INDEXING LEVEL 2  " TO RE-MARK
041000         PERFORM FAIL
041100         GO TO TEST-2-WRITE.
041200
041300     PERFORM PASS.
041400 TEST-2-WRITE.
041500     PERFORM PRINT-DETAIL.
041600
041700 TEST-2-2.
041800     MOVE "TEST-2-2            " TO PAR-NAME.
041900     SET IDX-1  IDX-2 TO 8.
042000     IF ENTRY-2 (IDX-1  IDX-2) IS NOT EQUAL TO "SEC (08 08)"
042100         MOVE "SEC (08 08)" TO CORRECT-A
042200         MOVE ENTRY-2 (IDX-1  IDX-2) TO COMPUTED-A
042300
042400         MOVE "INTERNAL INDEXING LEVEL 2  " TO RE-MARK
042500         PERFORM FAIL
042600         GO TO TEST-2-2-WRITE.
042700
042800     PERFORM PASS.
042900 TEST-2-2-WRITE.
043000     PERFORM PRINT-DETAIL.
043100
043200 TEST-2-3.
043300     MOVE "TEST-2-3            " TO PAR-NAME.
043400     SET IDX-1 TO 3.
043500     SET IDX-2 TO 7.
043600     IF ENTRY-2 (IDX-1  IDX-2) IS NOT EQUAL TO "SEC (03 07)"
043700         MOVE "SEC (03 07)" TO CORRECT-A
043800         MOVE ENTRY-2 (IDX-1  IDX-2) TO COMPUTED-A
043900
044000         MOVE "INTERNAL INDEXING LEVEL 2  " TO RE-MARK
044100         PERFORM FAIL
044200         GO TO TEST-2-3-WRITE.
044300
044400     PERFORM PASS.
044500 TEST-2-3-WRITE.
044600     PERFORM PRINT-DETAIL.
044700
044800 TEST-3.
044900     MOVE "LEVEL 3 INT INDEXING" TO FEATURE.
045000     MOVE "TEST-3              " TO PAR-NAME.
045100     SET IDX-1 TO 2.
045200     SET IDX-2 TO 6.
045300     SET IDX-3 TO 10.
045400     IF ENTRY-3 (IDX-1  IDX-2  IDX-3) IS NOT EQUAL TO
045500              "ELEM (02 06 10)"
045600         MOVE "ELEM (02 06 10)" TO CORRECT-A
045700         MOVE ENTRY-3 (IDX-1  IDX-2  IDX-3) TO COMPUTED-A
045800
045900         MOVE "INTERNAL INDEXING LEVEL 3  " TO RE-MARK
046000         PERFORM FAIL
046100         GO TO TEST-3-WRITE.
046200
046300     PERFORM PASS.
046400 TEST-3-WRITE.
046500     PERFORM PRINT-DETAIL.
046600
046700 TEST-3-2.
046800     MOVE "TEST-3-2            " TO PAR-NAME.
046900     SET IDX-1  IDX-2  IDX-3 TO 6.
047000     IF ENTRY-3 (IDX-1  IDX-2  IDX-3) IS NOT EQUAL TO
047100              "ELEM (06 06 06)"
047200         MOVE "ELEM (06 06 06)" TO CORRECT-A
047300         MOVE ENTRY-3 (IDX-1  IDX-2  IDX-3) TO COMPUTED-A
047400
047500         MOVE "INTERNAL INDEXING LEVEL 3  " TO RE-MARK
047600         PERFORM FAIL
047700         GO TO TEST-3-2-WRITE.
047800
047900     PERFORM PASS.
048000 TEST-3-2-WRITE.
048100     PERFORM PRINT-DETAIL.
048200
048300 TEST-3-3.
048400     MOVE "TEST-3-3            " TO PAR-NAME.
048500     SET IDX-1 TO 9.
048600     SET IDX-2 TO 8.
048700     SET IDX-3 TO 7.
048800     IF ENTRY-3 (IDX-1  IDX-2  IDX-3) IS NOT EQUAL TO
048900         "ELEM (09 08 07)" MOVE "ELEM (09 08 07)" TO CORRECT-A
049000         MOVE ENTRY-3 (IDX-1  IDX-2  IDX-3) TO COMPUTED-A
049100
049200         MOVE "INTERNAL INDEXING LEVEL 3  " TO RE-MARK
049300         PERFORM FAIL
049400         GO TO END-3LEVEL-SUBSCRPT-TEST.
049500
049600     PERFORM PASS.
049700     GO TO END-3LEVEL-SUBSCRPT-TEST.
049800
049900 END-3LEVEL-SUBSCRPT-TEST.
050000     PERFORM PRINT-DETAIL.
050100 CCVS-EXIT SECTION.
050200 CCVS-999999.
050300     GO TO CLOSE-FILES.
