000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC136A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC136A VERIFIES THE ACCURACY OF BUILDING AND
002300*    ACCESSING A 3 DIMENSIONAL TABLE USING VARIOUS COMBINATIONS
002400*    OF NUMERIC LITERAL AND DATA-NAME SUBSCRIPTS.
002500*
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 77  SUB-1              PICTURE S99  VALUE ZERO.
004300 77  SUB-2              PICTURE 99   VALUE ZERO.
004400 77  SUB-3              PICTURE 99   VALUE ZERO.
004500 77  CON-7              PICTURE 99   VALUE 07.
004600 77  CON-10             PICTURE 99   VALUE 10.
004700 77  CON-5              PICTURE 99   VALUE 05.
004800 77  CON-6              PICTURE 99   VALUE 06.
004900 01  GRP-NAME.
005000     02  FILLER              PICTURE XXX    VALUE "GRP".
005100     02  ADD-GRP             PICTURE 99     VALUE 01.
005200
005300 01  SEC-NAME.
005400     02  FILLER              PICTURE X(5)   VALUE "SEC (".
005500     02  SEC-GRP             PICTURE 99     VALUE 00.
005600     02  FILLER              PICTURE X      VALUE " ".
005700     02  ADD-SEC             PICTURE 99     VALUE 01.
005800     02  FILLER              PICTURE X      VALUE ")".
005900
006000 01  ELEM-NAME.
006100     02  FILLER              PICTURE X(6)   VALUE "ELEM (".
006200     02  ELEM-GRP            PICTURE 99     VALUE 00.
006300     02  FILLER              PICTURE X      VALUE " ".
006400     02  ELEM-SEC            PICTURE 99     VALUE 00.
006500     02  FILLER              PICTURE X      VALUE " ".
006600     02  ADD-ELEM            PICTURE 99     VALUE 01.
006700     02  FILLER              PICTURE X      VALUE ")".
006800
006900 01  THREE-DIMENSION-TBL.
007000     02  GRP-ENTRY OCCURS 10 TIMES INDEXED BY IDX-1.
007100         03  ENTRY-1         PICTURE X(5).
007200         03  GRP2-ENTRY OCCURS 10 TIMES INDEXED BY IDX-2.
007300             04  ENTRY-2     PICTURE X(11).
007400             04  GRP3-ENTRY OCCURS 10 TIMES INDEXED BY IDX-3.
007500                 05  ENTRY-3 PICTURE X(15).
007600
007700 01  TEST-RESULTS.
007800     02 FILLER                   PIC X      VALUE SPACE.
007900     02 FEATURE                  PIC X(20)  VALUE SPACE.
008000     02 FILLER                   PIC X      VALUE SPACE.
008100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
008200     02 FILLER                   PIC X      VALUE SPACE.
008300     02  PAR-NAME.
008400       03 FILLER                 PIC X(19)  VALUE SPACE.
008500       03  PARDOT-X              PIC X      VALUE SPACE.
008600       03 DOTVALUE               PIC 99     VALUE ZERO.
008700     02 FILLER                   PIC X(8)   VALUE SPACE.
008800     02 RE-MARK                  PIC X(61).
008900 01  TEST-COMPUTED.
009000     02 FILLER                   PIC X(30)  VALUE SPACE.
009100     02 FILLER                   PIC X(17)  VALUE
009200            "       COMPUTED=".
009300     02 COMPUTED-X.
009400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009500     03 COMPUTED-N               REDEFINES COMPUTED-A
009600                                 PIC -9(9).9(9).
009700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
009800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
009900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
010000     03       CM-18V0 REDEFINES COMPUTED-A.
010100         04 COMPUTED-18V0                    PIC -9(18).
010200         04 FILLER                           PIC X.
010300     03 FILLER PIC X(50) VALUE SPACE.
010400 01  TEST-CORRECT.
010500     02 FILLER PIC X(30) VALUE SPACE.
010600     02 FILLER PIC X(17) VALUE "       CORRECT =".
010700     02 CORRECT-X.
010800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
010900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
011000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
011100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
011200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
011300     03      CR-18V0 REDEFINES CORRECT-A.
011400         04 CORRECT-18V0                     PIC -9(18).
011500         04 FILLER                           PIC X.
011600     03 FILLER PIC X(2) VALUE SPACE.
011700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011800 01  CCVS-C-1.
011900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012000-    "SS  PARAGRAPH-NAME
012100-    "       REMARKS".
012200     02 FILLER                     PIC X(20)    VALUE SPACE.
012300 01  CCVS-C-2.
012400     02 FILLER                     PIC X        VALUE SPACE.
012500     02 FILLER                     PIC X(6)     VALUE "TESTED".
012600     02 FILLER                     PIC X(15)    VALUE SPACE.
012700     02 FILLER                     PIC X(4)     VALUE "FAIL".
012800     02 FILLER                     PIC X(94)    VALUE SPACE.
012900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013000 01  REC-CT                        PIC 99       VALUE ZERO.
013100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014000 01  CCVS-H-1.
014100     02  FILLER                    PIC X(39)    VALUE SPACES.
014200     02  FILLER                    PIC X(42)    VALUE
014300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014400     02  FILLER                    PIC X(39)    VALUE SPACES.
014500 01  CCVS-H-2A.
014600   02  FILLER                        PIC X(40)  VALUE SPACE.
014700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014800   02  FILLER                        PIC XXXX   VALUE
014900     "4.2 ".
015000   02  FILLER                        PIC X(28)  VALUE
015100            " COPY - NOT FOR DISTRIBUTION".
015200   02  FILLER                        PIC X(41)  VALUE SPACE.
015300
015400 01  CCVS-H-2B.
015500   02  FILLER                        PIC X(15)  VALUE
015600            "TEST RESULT OF ".
015700   02  TEST-ID                       PIC X(9).
015800   02  FILLER                        PIC X(4)   VALUE
015900            " IN ".
016000   02  FILLER                        PIC X(12)  VALUE
016100     " HIGH       ".
016200   02  FILLER                        PIC X(22)  VALUE
016300            " LEVEL VALIDATION FOR ".
016400   02  FILLER                        PIC X(58)  VALUE
016500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016600 01  CCVS-H-3.
016700     02  FILLER                      PIC X(34)  VALUE
016800            " FOR OFFICIAL USE ONLY    ".
016900     02  FILLER                      PIC X(58)  VALUE
017000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017100     02  FILLER                      PIC X(28)  VALUE
017200            "  COPYRIGHT   1985 ".
017300 01  CCVS-E-1.
017400     02 FILLER                       PIC X(52)  VALUE SPACE.
017500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017600     02 ID-AGAIN                     PIC X(9).
017700     02 FILLER                       PIC X(45)  VALUE SPACES.
017800 01  CCVS-E-2.
017900     02  FILLER                      PIC X(31)  VALUE SPACE.
018000     02  FILLER                      PIC X(21)  VALUE SPACE.
018100     02 CCVS-E-2-2.
018200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018300         03 FILLER                   PIC X      VALUE SPACE.
018400         03 ENDER-DESC               PIC X(44)  VALUE
018500            "ERRORS ENCOUNTERED".
018600 01  CCVS-E-3.
018700     02  FILLER                      PIC X(22)  VALUE
018800            " FOR OFFICIAL USE ONLY".
018900     02  FILLER                      PIC X(12)  VALUE SPACE.
019000     02  FILLER                      PIC X(58)  VALUE
019100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019200     02  FILLER                      PIC X(13)  VALUE SPACE.
019300     02 FILLER                       PIC X(15)  VALUE
019400             " COPYRIGHT 1985".
019500 01  CCVS-E-4.
019600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019700     02 FILLER                       PIC X(4)   VALUE " OF ".
019800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019900     02 FILLER                       PIC X(40)  VALUE
020000      "  TESTS WERE EXECUTED SUCCESSFULLY".
020100 01  XXINFO.
020200     02 FILLER                       PIC X(19)  VALUE
020300            "*** INFORMATION ***".
020400     02 INFO-TEXT.
020500       04 FILLER                     PIC X(8)   VALUE SPACE.
020600       04 XXCOMPUTED                 PIC X(20).
020700       04 FILLER                     PIC X(5)   VALUE SPACE.
020800       04 XXCORRECT                  PIC X(20).
020900     02 INF-ANSI-REFERENCE           PIC X(48).
021000 01  HYPHEN-LINE.
021100     02 FILLER  PIC IS X VALUE IS SPACE.
021200     02 FILLER  PIC IS X(65)    VALUE IS "************************
021300-    "*****************************************".
021400     02 FILLER  PIC IS X(54)    VALUE IS "************************
021500-    "******************************".
021600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021700     "NC136A".
021800 PROCEDURE DIVISION.
021900 CCVS1 SECTION.
022000 OPEN-FILES.
022100     OPEN     OUTPUT PRINT-FILE.
022200     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022300     MOVE    SPACE TO TEST-RESULTS.
022400     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022500     GO TO CCVS1-EXIT.
022600 CLOSE-FILES.
022700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022800 TERMINATE-CCVS.
022900S    EXIT PROGRAM.
023000STERMINATE-CALL.
023100     STOP     RUN.
023200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023600     MOVE "****TEST DELETED****" TO RE-MARK.
023700 PRINT-DETAIL.
023800     IF REC-CT NOT EQUAL TO ZERO
023900             MOVE "." TO PARDOT-X
024000             MOVE REC-CT TO DOTVALUE.
024100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024600     MOVE SPACE TO CORRECT-X.
024700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024800     MOVE     SPACE TO RE-MARK.
024900 HEAD-ROUTINE.
025000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025400 COLUMN-NAMES-ROUTINE.
025500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025800 END-ROUTINE.
025900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026000 END-RTN-EXIT.
026100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026200 END-ROUTINE-1.
026300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026500      ADD PASS-COUNTER TO ERROR-HOLD.
026600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
026700      MOVE PASS-COUNTER TO CCVS-E-4-1.
026800      MOVE ERROR-HOLD TO CCVS-E-4-2.
026900      MOVE CCVS-E-4 TO CCVS-E-2-2.
027000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027100  END-ROUTINE-12.
027200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027300     IF       ERROR-COUNTER IS EQUAL TO ZERO
027400         MOVE "NO " TO ERROR-TOTAL
027500         ELSE
027600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027800     PERFORM WRITE-LINE.
027900 END-ROUTINE-13.
028000     IF DELETE-COUNTER IS EQUAL TO ZERO
028100         MOVE "NO " TO ERROR-TOTAL  ELSE
028200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028500      IF   INSPECT-COUNTER EQUAL TO ZERO
028600          MOVE "NO " TO ERROR-TOTAL
028700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029100 WRITE-LINE.
029200     ADD 1 TO RECORD-COUNT.
029300Y    IF RECORD-COUNT GREATER 42
029400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029500Y        MOVE SPACE TO DUMMY-RECORD
029600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029700Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029800Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
029900Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030000Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
030100Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
030200Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
030300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030500Y        MOVE ZERO TO RECORD-COUNT.
030600     PERFORM WRT-LN.
030700 WRT-LN.
030800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030900     MOVE SPACE TO DUMMY-RECORD.
031000 BLANK-LINE-PRINT.
031100     PERFORM WRT-LN.
031200 FAIL-ROUTINE.
031300     IF     COMPUTED-X NOT EQUAL TO SPACE
031400            GO TO FAIL-ROUTINE-WRITE.
031500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031900     MOVE   SPACES TO INF-ANSI-REFERENCE.
032000     GO TO  FAIL-ROUTINE-EX.
032100 FAIL-ROUTINE-WRITE.
032200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
032300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
032400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
032500     MOVE   SPACES TO COR-ANSI-REFERENCE.
032600 FAIL-ROUTINE-EX. EXIT.
032700 BAIL-OUT.
032800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033000 BAIL-OUT-WRITE.
033100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
033200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033400     MOVE   SPACES TO INF-ANSI-REFERENCE.
033500 BAIL-OUT-EX. EXIT.
033600 CCVS1-EXIT.
033700     EXIT.
033800 SECT-NC136A-001 SECTION.
033900 NC136-001.
034000
034100 BUILD-LEVEL-1.
034200     MOVE "IV-21 4.3.8.2" TO ANSI-REFERENCE.
034300     ADD 1 TO SUB-1.
034400     IF SUB-1 EQUAL TO 11 GO TO CHECK-ENTRIES.
034500     MOVE GRP-NAME TO ENTRY-1 (SUB-1).
034600     ADD 1 TO ADD-GRP.
034700
034800 BUILD-LEVEL-2.
034900     ADD 1 TO SUB-2.
035000     IF SUB-2 EQUAL TO 11
035100         MOVE ZERO TO SUB-2
035200         MOVE 01 TO ADD-SEC
035300         GO TO BUILD-LEVEL-1.
035400     MOVE SUB-1 TO SEC-GRP.
035500     MOVE SEC-NAME TO ENTRY-2 (SUB-1  SUB-2).
035600     ADD 1 TO ADD-SEC.
035700
035800 BUILD-LEVEL-3.
035900     ADD 1 TO SUB-3.
036000     IF SUB-3 EQUAL TO 11
036100         MOVE ZERO TO SUB-3
036200              MOVE 01 TO ADD-ELEM
036300              GO TO BUILD-LEVEL-2.
036400     MOVE SUB-1 TO ELEM-GRP.
036500     MOVE SUB-2 TO ELEM-SEC.
036600     MOVE ELEM-NAME TO ENTRY-3 (SUB-1  SUB-2  SUB-3).
036700     ADD 1 TO ADD-ELEM.
036800     GO TO BUILD-LEVEL-3.
036900
037000 CHECK-ENTRIES.
037100     MOVE "LEVEL 1 TBL SUBSCRPT" TO FEATURE.
037200     MOVE "CHECK-ENTRIES       " TO PAR-NAME.
037300     IF ENTRY-1 (5) IS NOT EQUAL TO "GRP05"
037400         MOVE "GRP05" TO CORRECT-A
037500         MOVE ENTRY-1 (5) TO COMPUTED-A
037600
037700         MOVE "NUMERIC LITERAL SUBSCRIPT  " TO RE-MARK
037800         PERFORM FAIL
037900         GO TO TEST-1-WRITE.
038000
038100     PERFORM PASS.
038200 TEST-1-WRITE.
038300     PERFORM PRINT-DETAIL.
038400
038500 TEST-1-2.
038600     MOVE "TEST-1-2            " TO PAR-NAME.
038700     IF ENTRY-1 (CON-5) IS NOT EQUAL TO "GRP05"
038800         MOVE "GRP05" TO CORRECT-A
038900         MOVE ENTRY-1 (CON-5) TO COMPUTED-A
039000
039100         MOVE "NUMERIC CONSTANT SUBSCRIPT " TO RE-MARK
039200         PERFORM FAIL
039300          GO TO TEST-1-2-WRITE.
039400
039500     PERFORM PASS.
039600 TEST-1-2-WRITE.
039700     PERFORM PRINT-DETAIL.
039800
039900 TEST-2.
040000     MOVE "LEVEL 2 TBL SUBSCRPT" TO FEATURE.
040100     MOVE "TEST-2              " TO PAR-NAME.
040200     IF ENTRY-2 (5  6) IS NOT EQUAL TO "SEC (05 06)"
040300         MOVE "SEC (05 06)" TO CORRECT-A
040400         MOVE ENTRY-2 (5  6) TO COMPUTED-A
040500
040600         MOVE "NUMERIC LITERAL SUBSCRIPT  " TO RE-MARK
040700         PERFORM FAIL
040800         GO TO TEST-2-WRITE.
040900
041000     PERFORM PASS.
041100 TEST-2-WRITE.
041200     PERFORM PRINT-DETAIL.
041300
041400 TEST-2-2.
041500     MOVE "TEST-2-2            " TO PAR-NAME.
041600     IF ENTRY-2 (05  CON-6) IS NOT EQUAL TO "SEC (05 06)"
041700         MOVE "SEC (05 06)" TO CORRECT-A
041800         MOVE ENTRY-2 (05  CON-6) TO COMPUTED-A
041900
042000         MOVE "NUM LITRL/CONSTANT SUBSCRPT" TO RE-MARK
042100         PERFORM FAIL
042200         GO TO TEST-2-2-WRITE.
042300
042400     PERFORM PASS.
042500 TEST-2-2-WRITE.
042600     PERFORM PRINT-DETAIL.
042700
042800 TEST-2-3.
042900     MOVE "TEST-2-3            " TO PAR-NAME.
043000     IF ENTRY-2 (CON-5  CON-6) IS NOT EQUAL TO "SEC (05 06)"
043100         MOVE "SEC (05 06)" TO CORRECT-A
043200         MOVE ENTRY-2 (CON-5  CON-6) TO COMPUTED-A
043300
043400         MOVE "2 NUMERIC CONSTANT SUBSCRPT" TO RE-MARK
043500         PERFORM FAIL
043600         GO TO TEST-2-3-WRITE.
043700
043800     PERFORM PASS.
043900 TEST-2-3-WRITE.
044000     PERFORM PRINT-DETAIL.
044100
044200 TEST-3.
044300     MOVE "LEVEL 3 TBL SUBSCRPT" TO FEATURE.
044400     MOVE "TEST-3              " TO PAR-NAME.
044500     IF ENTRY-3 (10  05  06) IS NOT EQUAL TO "ELEM (10 05 06)"
044600         MOVE "ELEM (10 05 06)" TO CORRECT-A
044700         MOVE ENTRY-3 (10  05  06) TO COMPUTED-A
044800
044900         MOVE "3 NUMERIC LITERAL SUBSCRPTS" TO RE-MARK
045000         PERFORM FAIL
045100         GO TO TEST-3-WRITE.
045200
045300     PERFORM PASS.
045400 TEST-3-WRITE.
045500     PERFORM PRINT-DETAIL.
045600
045700 TEST-3-2.
045800     MOVE "TEST-3-2            " TO PAR-NAME.
045900     IF ENTRY-3 (10  CON-5  CON-6) IS NOT EQUAL TO
046000         "ELEM (10 05 06)"
046100         MOVE "ELEM (10 05 06)" TO CORRECT-A
046200         MOVE ENTRY-3 (10  CON-5  CON-6) TO COMPUTED-A
046300
046400         MOVE "1 NUM LTRL/2 CONSTANT SUBS " TO RE-MARK
046500         PERFORM FAIL
046600         GO TO TEST-3-2-WRITE.
046700
046800     PERFORM PASS.
046900 TEST-3-2-WRITE.
047000     PERFORM PRINT-DETAIL.
047100
047200 TEST-3-3.
047300     MOVE "TEST-3-3            " TO PAR-NAME.
047400     IF ENTRY-3 (CON-10  CON-5  CON-6) IS NOT EQUAL TO
047500         "ELEM (10 05 06)" MOVE "ELEM (10 05 06)" TO CORRECT-A
047600         MOVE ENTRY-3 (CON-10  CON-5  CON-6) TO COMPUTED-A
047700
047800         MOVE "3 NUMERIC CONSTANT SUBSCRPT" TO RE-MARK
047900         PERFORM FAIL
048000         GO TO END-3LEVEL-SUBSCRPT-TEST.
048100
048200     PERFORM PASS.
048300     GO TO END-3LEVEL-SUBSCRPT-TEST.
048400
048500 END-3LEVEL-SUBSCRPT-TEST.
048600     PERFORM PRINT-DETAIL.
048700 CCVS-EXIT SECTION.
048800 CCVS-999999.
048900     GO TO CLOSE-FILES.
