000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC141A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC141A TESTS FORMAT 1 AND 2 OF THE "SET"
002300*    STATEMENT USING IDENTIFIERS INDEXED BY RELATIVE INDEXES
002400*    AND NUMERIC LITERALS.
002500*
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 01  TABLE1.
004300     02  TABLE1-REC              PICTURE 99
004400                                 OCCURS 100 TIMES
004500                                 INDEXED BY INDEX1.
004600 01  TABLE2.
004700     02  TABLE2-REC              PICTURE 99
004800                                 OCCURS 12 TIMES
004900                                 INDEXED BY INDEX2.
005000 01  INDEX-ID                    PIC 999         VALUE ZERO.
005100 01  TEST-RESULTS.
005200     02 FILLER                   PIC X      VALUE SPACE.
005300     02 FEATURE                  PIC X(20)  VALUE SPACE.
005400     02 FILLER                   PIC X      VALUE SPACE.
005500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005600     02 FILLER                   PIC X      VALUE SPACE.
005700     02  PAR-NAME.
005800       03 FILLER                 PIC X(19)  VALUE SPACE.
005900       03  PARDOT-X              PIC X      VALUE SPACE.
006000       03 DOTVALUE               PIC 99     VALUE ZERO.
006100     02 FILLER                   PIC X(8)   VALUE SPACE.
006200     02 RE-MARK                  PIC X(61).
006300 01  TEST-COMPUTED.
006400     02 FILLER                   PIC X(30)  VALUE SPACE.
006500     02 FILLER                   PIC X(17)  VALUE
006600            "       COMPUTED=".
006700     02 COMPUTED-X.
006800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006900     03 COMPUTED-N               REDEFINES COMPUTED-A
007000                                 PIC -9(9).9(9).
007100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007400     03       CM-18V0 REDEFINES COMPUTED-A.
007500         04 COMPUTED-18V0                    PIC -9(18).
007600         04 FILLER                           PIC X.
007700     03 FILLER PIC X(50) VALUE SPACE.
007800 01  TEST-CORRECT.
007900     02 FILLER PIC X(30) VALUE SPACE.
008000     02 FILLER PIC X(17) VALUE "       CORRECT =".
008100     02 CORRECT-X.
008200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008700     03      CR-18V0 REDEFINES CORRECT-A.
008800         04 CORRECT-18V0                     PIC -9(18).
008900         04 FILLER                           PIC X.
009000     03 FILLER PIC X(2) VALUE SPACE.
009100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009200 01  CCVS-C-1.
009300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
009400-    "SS  PARAGRAPH-NAME
009500-    "       REMARKS".
009600     02 FILLER                     PIC X(20)    VALUE SPACE.
009700 01  CCVS-C-2.
009800     02 FILLER                     PIC X        VALUE SPACE.
009900     02 FILLER                     PIC X(6)     VALUE "TESTED".
010000     02 FILLER                     PIC X(15)    VALUE SPACE.
010100     02 FILLER                     PIC X(4)     VALUE "FAIL".
010200     02 FILLER                     PIC X(94)    VALUE SPACE.
010300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
010400 01  REC-CT                        PIC 99       VALUE ZERO.
010500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
010600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
010700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
010800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
010900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
011000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
011100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
011200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
011300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
011400 01  CCVS-H-1.
011500     02  FILLER                    PIC X(39)    VALUE SPACES.
011600     02  FILLER                    PIC X(42)    VALUE
011700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
011800     02  FILLER                    PIC X(39)    VALUE SPACES.
011900 01  CCVS-H-2A.
012000   02  FILLER                        PIC X(40)  VALUE SPACE.
012100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
012200   02  FILLER                        PIC XXXX   VALUE
012300     "4.2 ".
012400   02  FILLER                        PIC X(28)  VALUE
012500            " COPY - NOT FOR DISTRIBUTION".
012600   02  FILLER                        PIC X(41)  VALUE SPACE.
012700
012800 01  CCVS-H-2B.
012900   02  FILLER                        PIC X(15)  VALUE
013000            "TEST RESULT OF ".
013100   02  TEST-ID                       PIC X(9).
013200   02  FILLER                        PIC X(4)   VALUE
013300            " IN ".
013400   02  FILLER                        PIC X(12)  VALUE
013500     " HIGH       ".
013600   02  FILLER                        PIC X(22)  VALUE
013700            " LEVEL VALIDATION FOR ".
013800   02  FILLER                        PIC X(58)  VALUE
013900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014000 01  CCVS-H-3.
014100     02  FILLER                      PIC X(34)  VALUE
014200            " FOR OFFICIAL USE ONLY    ".
014300     02  FILLER                      PIC X(58)  VALUE
014400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
014500     02  FILLER                      PIC X(28)  VALUE
014600            "  COPYRIGHT   1985 ".
014700 01  CCVS-E-1.
014800     02 FILLER                       PIC X(52)  VALUE SPACE.
014900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
015000     02 ID-AGAIN                     PIC X(9).
015100     02 FILLER                       PIC X(45)  VALUE SPACES.
015200 01  CCVS-E-2.
015300     02  FILLER                      PIC X(31)  VALUE SPACE.
015400     02  FILLER                      PIC X(21)  VALUE SPACE.
015500     02 CCVS-E-2-2.
015600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
015700         03 FILLER                   PIC X      VALUE SPACE.
015800         03 ENDER-DESC               PIC X(44)  VALUE
015900            "ERRORS ENCOUNTERED".
016000 01  CCVS-E-3.
016100     02  FILLER                      PIC X(22)  VALUE
016200            " FOR OFFICIAL USE ONLY".
016300     02  FILLER                      PIC X(12)  VALUE SPACE.
016400     02  FILLER                      PIC X(58)  VALUE
016500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016600     02  FILLER                      PIC X(13)  VALUE SPACE.
016700     02 FILLER                       PIC X(15)  VALUE
016800             " COPYRIGHT 1985".
016900 01  CCVS-E-4.
017000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
017100     02 FILLER                       PIC X(4)   VALUE " OF ".
017200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
017300     02 FILLER                       PIC X(40)  VALUE
017400      "  TESTS WERE EXECUTED SUCCESSFULLY".
017500 01  XXINFO.
017600     02 FILLER                       PIC X(19)  VALUE
017700            "*** INFORMATION ***".
017800     02 INFO-TEXT.
017900       04 FILLER                     PIC X(8)   VALUE SPACE.
018000       04 XXCOMPUTED                 PIC X(20).
018100       04 FILLER                     PIC X(5)   VALUE SPACE.
018200       04 XXCORRECT                  PIC X(20).
018300     02 INF-ANSI-REFERENCE           PIC X(48).
018400 01  HYPHEN-LINE.
018500     02 FILLER  PIC IS X VALUE IS SPACE.
018600     02 FILLER  PIC IS X(65)    VALUE IS "************************
018700-    "*****************************************".
018800     02 FILLER  PIC IS X(54)    VALUE IS "************************
018900-    "******************************".
019000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
019100     "NC141A".
019200 PROCEDURE DIVISION.
019300 CCVS1 SECTION.
019400 OPEN-FILES.
019500     OPEN     OUTPUT PRINT-FILE.
019600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
019700     MOVE    SPACE TO TEST-RESULTS.
019800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
019900     GO TO CCVS1-EXIT.
020000 CLOSE-FILES.
020100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
020200 TERMINATE-CCVS.
020300S    EXIT PROGRAM.
020400STERMINATE-CALL.
020500     STOP     RUN.
020600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
020700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
020800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
020900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
021000     MOVE "****TEST DELETED****" TO RE-MARK.
021100 PRINT-DETAIL.
021200     IF REC-CT NOT EQUAL TO ZERO
021300             MOVE "." TO PARDOT-X
021400             MOVE REC-CT TO DOTVALUE.
021500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
021600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
021700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
021800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
021900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
022000     MOVE SPACE TO CORRECT-X.
022100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
022200     MOVE     SPACE TO RE-MARK.
022300 HEAD-ROUTINE.
022400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022800 COLUMN-NAMES-ROUTINE.
022900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
023200 END-ROUTINE.
023300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
023400 END-RTN-EXIT.
023500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023600 END-ROUTINE-1.
023700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
023800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
023900      ADD PASS-COUNTER TO ERROR-HOLD.
024000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
024100      MOVE PASS-COUNTER TO CCVS-E-4-1.
024200      MOVE ERROR-HOLD TO CCVS-E-4-2.
024300      MOVE CCVS-E-4 TO CCVS-E-2-2.
024400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
024500  END-ROUTINE-12.
024600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
024700     IF       ERROR-COUNTER IS EQUAL TO ZERO
024800         MOVE "NO " TO ERROR-TOTAL
024900         ELSE
025000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
025100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
025200     PERFORM WRITE-LINE.
025300 END-ROUTINE-13.
025400     IF DELETE-COUNTER IS EQUAL TO ZERO
025500         MOVE "NO " TO ERROR-TOTAL  ELSE
025600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
025700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
025800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025900      IF   INSPECT-COUNTER EQUAL TO ZERO
026000          MOVE "NO " TO ERROR-TOTAL
026100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
026200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
026300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026500 WRITE-LINE.
026600     ADD 1 TO RECORD-COUNT.
026700Y    IF RECORD-COUNT GREATER 42
026800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
026900Y        MOVE SPACE TO DUMMY-RECORD
027000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
027100Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
027200Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
027300Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
027400Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
027500Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
027600Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
027700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
027800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
027900Y        MOVE ZERO TO RECORD-COUNT.
028000     PERFORM WRT-LN.
028100 WRT-LN.
028200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
028300     MOVE SPACE TO DUMMY-RECORD.
028400 BLANK-LINE-PRINT.
028500     PERFORM WRT-LN.
028600 FAIL-ROUTINE.
028700     IF     COMPUTED-X NOT EQUAL TO SPACE
028800            GO TO FAIL-ROUTINE-WRITE.
028900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
029200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029300     MOVE   SPACES TO INF-ANSI-REFERENCE.
029400     GO TO  FAIL-ROUTINE-EX.
029500 FAIL-ROUTINE-WRITE.
029600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
029700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
029800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
029900     MOVE   SPACES TO COR-ANSI-REFERENCE.
030000 FAIL-ROUTINE-EX. EXIT.
030100 BAIL-OUT.
030200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
030300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
030400 BAIL-OUT-WRITE.
030500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
030600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030800     MOVE   SPACES TO INF-ANSI-REFERENCE.
030900 BAIL-OUT-EX. EXIT.
031000 CCVS1-EXIT.
031100     EXIT.
031200 SECT-NC141A-001 SECTION.
031300 INIT-PARA.
031400     MOVE "VI-127 6.22.4" TO ANSI-REFERENCE.
031500 BUILD-TABLE2.
031600     MOVE 21 TO TABLE2-REC (1).
031700     MOVE 02 TO TABLE2-REC (2).
031800     MOVE 03 TO TABLE2-REC (3).
031900     MOVE 11 TO TABLE2-REC (4).
032000     MOVE 05 TO TABLE2-REC (5).
032100     MOVE 10 TO TABLE2-REC (6).
032200     MOVE 26 TO TABLE2-REC (7).
032300     MOVE 02 TO TABLE2-REC (8).
032400     MOVE 16 TO TABLE2-REC (9).
032500     MOVE 62 TO TABLE2-REC (10).
032600     MOVE 10 TO TABLE2-REC (11).
032700     MOVE 04 TO TABLE2-REC (12).
032800 SET-TEST-1.
032900     MOVE "SET ... TO" TO FEATURE.
033000     SET INDEX1 TO 1.
033100     SET INDEX2 TO 7.
033200     SET INDEX1 TO TABLE2-REC (INDEX2).
033300     IF INDEX1 EQUAL TO 26
033400        PERFORM PASS
033500        ELSE GO TO SET-FAIL-1.
033600     GO TO SET-WRITE-1.
033700 SET-DELETE-1.
033800     PERFORM DE-LETE.
033900     GO TO SET-WRITE-1.
034000 SET-FAIL-1.
034100     PERFORM FAIL.
034200     SET INDEX-ID TO INDEX1.
034300     MOVE INDEX-ID TO COMPUTED-18V0.
034400     MOVE 26 TO CORRECT-18V0.
034500 SET-WRITE-1.
034600     MOVE "SET-TEST-1" TO PAR-NAME.
034700     PERFORM PRINT-DETAIL.
034800 SET-TEST-2.
034900     MOVE "SET ... UP BY" TO FEATURE.
035000     SET INDEX1 TO 7.
035100     SET INDEX2 TO 8.
035200     SET INDEX1 UP BY TABLE2-REC (INDEX2).
035300     IF INDEX1 EQUAL TO 9
035400        PERFORM PASS
035500        ELSE GO TO SET-FAIL-2.
035600     GO TO SET-WRITE-2.
035700 SET-DELETE-2.
035800     PERFORM DE-LETE.
035900     GO TO SET-WRITE-2.
036000 SET-FAIL-2.
036100     PERFORM FAIL.
036200     SET INDEX-ID TO INDEX1.
036300     MOVE INDEX-ID TO COMPUTED-18V0.
036400     MOVE 09 TO CORRECT-18V0.
036500 SET-WRITE-2.
036600     MOVE "SET-TEST-2" TO PAR-NAME.
036700     PERFORM PRINT-DETAIL.
036800 SET-TEST-3.
036900     MOVE "SET ... DOWN BY" TO FEATURE.
037000     SET INDEX1 TO 56.
037100     SET INDEX2 TO 9.
037200     SET INDEX1 DOWN BY TABLE2-REC (INDEX2).
037300     IF INDEX1 EQUAL TO 40
037400        PERFORM PASS
037500        ELSE GO TO SET-FAIL-3.
037600     GO TO SET-WRITE-3.
037700 SET-DELETE-3.
037800     PERFORM DE-LETE.
037900     GO TO SET-WRITE-3.
038000 SET-FAIL-3.
038100     PERFORM FAIL.
038200     SET INDEX-ID TO INDEX1.
038300     MOVE INDEX-ID TO COMPUTED-18V0.
038400     MOVE 40 TO CORRECT-18V0.
038500 SET-WRITE-3.
038600     MOVE "SET-TEST-3" TO PAR-NAME.
038700     PERFORM PRINT-DETAIL.
038800 SET-TEST-4.
038900     MOVE "SET ... TO" TO FEATURE.
039000     SET INDEX1 TO 1.
039100     SET INDEX2 TO 9.
039200     SET INDEX1 TO TABLE2-REC (INDEX2 + 1).
039300     IF INDEX1 EQUAL TO 62
039400        PERFORM PASS
039500        ELSE GO TO SET-FAIL-4.
039600     GO TO SET-WRITE-4.
039700 SET-DELETE-4.
039800     PERFORM DE-LETE.
039900     GO TO SET-WRITE-4.
040000 SET-FAIL-4.
040100     PERFORM FAIL.
040200     SET INDEX-ID TO INDEX1.
040300     MOVE INDEX-ID TO COMPUTED-18V0.
040400     MOVE 62 TO CORRECT-18V0.
040500 SET-WRITE-4.
040600     MOVE "SET-TEST-4" TO PAR-NAME.
040700     PERFORM PRINT-DETAIL.
040800 SET-TEST-5.
040900     MOVE "SET ... UP BY" TO FEATURE.
041000     SET INDEX1 TO 10.
041100     SET INDEX2 TO 12.
041200     SET INDEX1 UP BY TABLE2-REC (INDEX2 - 1).
041300     IF INDEX1 EQUAL TO 20
041400        PERFORM PASS
041500        ELSE GO TO SET-FAIL-5.
041600     GO TO SET-WRITE-5.
041700 SET-DELETE-5.
041800     PERFORM DE-LETE.
041900     GO TO SET-WRITE-5.
042000 SET-FAIL-5.
042100     PERFORM FAIL.
042200     SET INDEX-ID TO INDEX1.
042300     MOVE INDEX-ID TO COMPUTED-18V0.
042400     MOVE 20 TO CORRECT-18V0.
042500 SET-WRITE-5.
042600     MOVE "SET-TEST-5" TO PAR-NAME.
042700     PERFORM PRINT-DETAIL.
042800 SET-TEST-6.
042900     MOVE "SET ... DOWN BY" TO FEATURE.
043000     SET INDEX1 TO 15.
043100     SET INDEX2 TO 8.
043200     SET INDEX1 DOWN BY TABLE2-REC (INDEX2 + 4).
043300     IF INDEX1 EQUAL TO 11
043400        PERFORM PASS
043500        ELSE GO TO SET-FAIL-6.
043600     GO TO SET-WRITE-6.
043700 SET-DELETE-6.
043800     PERFORM DE-LETE.
043900     GO TO SET-WRITE-6.
044000 SET-FAIL-6.
044100     PERFORM FAIL.
044200     SET INDEX-ID TO INDEX1.
044300     MOVE INDEX-ID TO COMPUTED-18V0.
044400     MOVE 11 TO CORRECT-18V0.
044500 SET-WRITE-6.
044600     MOVE "SET-TEST-6" TO PAR-NAME.
044700     PERFORM PRINT-DETAIL.
044800 SET-TEST-7.
044900     MOVE "SET ... TO" TO FEATURE.
045000     SET INDEX1 TO 1.
045100     SET INDEX1 TO TABLE2-REC (1).
045200     IF INDEX1 EQUAL TO 21
045300        PERFORM PASS
045400        ELSE GO TO SET-FAIL-7.
045500     GO TO SET-WRITE-7.
045600 SET-DELETE-7.
045700     PERFORM DE-LETE.
045800     GO TO SET-WRITE-7.
045900 SET-FAIL-7.
046000     PERFORM FAIL.
046100     SET INDEX-ID TO INDEX1.
046200     MOVE INDEX-ID TO COMPUTED-18V0.
046300     MOVE 21 TO CORRECT-18V0.
046400 SET-WRITE-7.
046500     MOVE "SET-TEST-7" TO PAR-NAME.
046600     PERFORM PRINT-DETAIL.
046700 SET-TEST-8.
046800     MOVE "SET ... UP BY" TO FEATURE.
046900     SET INDEX1 TO 21.
047000     SET INDEX1 UP BY TABLE2-REC (2).
047100     IF INDEX1 EQUAL TO 23
047200        PERFORM PASS
047300        ELSE GO TO SET-FAIL-8.
047400     GO TO SET-WRITE-8.
047500 SET-DELETE-8.
047600     PERFORM DE-LETE.
047700     GO TO SET-WRITE-8.
047800 SET-FAIL-8.
047900     PERFORM FAIL.
048000     SET INDEX-ID TO INDEX1.
048100     MOVE INDEX-ID TO COMPUTED-18V0.
048200     MOVE 23 TO CORRECT-18V0.
048300 SET-WRITE-8.
048400     MOVE "SET-TEST-8" TO PAR-NAME.
048500     PERFORM PRINT-DETAIL.
048600 SET-TEST-9.
048700     MOVE "SET ... DOWN BY" TO FEATURE.
048800     SET INDEX1 TO 23.
048900     SET INDEX1 DOWN BY TABLE2-REC (3).
049000     IF INDEX1 EQUAL TO 20
049100        PERFORM PASS
049200        ELSE GO TO SET-FAIL-9.
049300     GO TO SET-WRITE-9.
049400 SET-DELETE-9.
049500     PERFORM DE-LETE.
049600     GO TO SET-WRITE-9.
049700 SET-FAIL-9.
049800     PERFORM FAIL.
049900     SET INDEX-ID TO INDEX1.
050000     MOVE INDEX-ID TO COMPUTED-18V0.
050100     MOVE 20 TO CORRECT-18V0.
050200 SET-WRITE-9.
050300     MOVE "SET-TEST-9" TO PAR-NAME.
050400     PERFORM PRINT-DETAIL.
050500 CCVS-EXIT SECTION.
050600 CCVS-999999.
050700     GO TO CLOSE-FILES.
