000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC177A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC177A TESTS FORMAT 2 OF THE ADD STATEMENT.
002300*    VARIOUS COMBINATINS OF DATA-ITEMS AND ALL
002400*    OPTIONAL PHRASES ARE TESTED.
002500*
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 77  SIZE-ERR                     PICTURE X  VALUE SPACE.
004300 77  SIZE-ERR2                    PICTURE X  VALUE SPACE.
004400 77  SIZE-ERR3                    PICTURE X  VALUE SPACE.
004500 77  SIZE-ERR4                    PICTURE X  VALUE SPACE.
004600 77  A17TWOS-DS-17V00             PICTURE S9(17)
004700                                  VALUE 22222222222222222.
004800 77  A18ONES-DS-18V00             PICTURE S9(18)
004900                                  VALUE 111111111111111111.
005000 77  WRK-DS-10V00                 PICTURE S9(10).
005100 77  A10ONES-DS-10V00             PICTURE S9(10)
005200                                  VALUE 1111111111.
005300 77  A05ONES-DS-05V00             PICTURE S9(5)
005400                                  VALUE 11111.
005500 77  A02ONES-DS-02V00             PICTURE S99
005600                                  VALUE 11.
005700 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
005800 77  WRK-DS-18V00 REDEFINES WRK-DS-09V09
005900                                  PICTURE S9(18).
006000 77  A06THREES-DS-03V03           PICTURE S999V999
006100                                  VALUE 333.333.
006200 77  A12THREES-DS-06V06           PICTURE S9(6)V9(6)
006300                                  VALUE 333333.333333.
006400 77  WRK-DS-06V06                 PICTURE S9(6)V9(6).
006500 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06
006600                                  PICTURE S9(12).
006700 77  A05ONES-DS-00V05             PICTURE SV9(5)
006800                                  VALUE .11111.
006900 77  WRK-DS-05V00                 PICTURE S9(5).
007000 77  WRK-DS-02V00                 PICTURE S99.
007100 77  A12ONES-DS-12V00             PICTURE S9(12)
007200                                  VALUE 111111111111.
007300 77  WRK-DS-03V10                 PICTURE S999V9(10).
007400 77  WRK-DS-13V00-S REDEFINES WRK-DS-03V10
007500                                  PICTURE S9(13).
007600 77  A99-DS-02V00                 PICTURE S99
007700                                  VALUE 99.
007800 77  A03ONES-DS-02V01             PICTURE S99V9
007900                                  VALUE 11.1.
008000 77  A06ONES-DS-03V03             PICTURE S999V999
008100                                  VALUE 111.111.
008200 77  A08TWOS-DS-02V06             PICTURE S99V9(6)
008300                                  VALUE 22.222222.
008400 77  A01ONE-DS-P0801              PICTURE SP(8)9
008500                                  VALUE .000000001.
008600 77  WRK-CS-18V00                 PICTURE S9(18) COMPUTATIONAL.
008700 77  A18ONES-CS-18V00             PICTURE S9(18) COMPUTATIONAL
008800                                  VALUE 111111111111111111.
008900 77  WRK-CS-02V02                 PICTURE S99V99 COMPUTATIONAL.
009000 77  A99-CS-02V00                 PICTURE S99 COMPUTATIONAL
009100                                  VALUE 99.
009200 77  WRK-DS-0201P                 PICTURE S99P.
009300 77  WRK-DS-06V00                 PICTURE S9(6).
009400 77  AZERO-DS-05V05               PICTURE S9(5)V9(5)
009500                                  VALUE ZERO.
009600 77  NDATA-DS-09V09               PICTURE S9(9)V9(9)
009700                                  VALUE +012345678.876543210.
009800 77  XDATA-XN-00018               PICTURE X(18)
009900                                  VALUE "00ABCDEFGHI  4321 ".
010000 77  WRK-XN-00018                 PICTURE X(18).
010100 77  WRK-XN-00001                 PICTURE X.
010200 77  ADD-12    PICTURE PP9        VALUE .001.
010300 77  ADD-13    PICTURE 9PP        VALUE 100.
010400 77  ADD-14    PICTURE 999V999.
010500 77  WRK-CU-18V00      PICTURE 9(18) VALUE ZERO COMPUTATIONAL.
010600 01  WRK-DU-1V0-1 PIC 9 VALUE ZERO.
010700 01  WRK-DU-1V1-1 PIC 9V9 VALUE 1.1.
010800 01  WRK-DU-1V1-2 PIC 9V9 VALUE 2.4.
010900 01  WRK-DU-1V3-1 PIC 9V999 VALUE 1.001.
011000 01  WRK-DU-1V3-2 PIC 9V999 VALUE 1.001.
011100 01  WRK-DU-1V5-1 PIC 9V9(5).
011200 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
011300 01  WRK-DU-2P6-1 PIC 99P(6) VALUE 99000000.
011400 01  WRK-DU-2V0-1 PIC 99.
011500 01  WRK-DU-2V0-2 PIC 99.
011600 01  WRK-DU-2V0-3 PIC 99.
011700 01  WRK-DU-2V1-1 PIC 99V9.
011800 01  WRK-DU-2V1-2 PIC 99V9.
011900 01  WRK-DU-2V1-3 PIC 99V9.
012000 77  A18EIGHTS-CS-18V00 PICTURE S9(18) VALUE -888888888888888888
012100             COMPUTATIONAL.
012200 77  A14TWOS-CS-18V00  PICTURE S9(18) VALUE -000022222222222222
012300             COMPUTATIONAL.
012400 77  A12THREES-CU-18V00 PICTURE 9(18) VALUE 000000333333333333
012500             COMPUTATIONAL.
012600 77  A16FOURS-CS-18V00 PICTURE S9(18) VALUE 004444444444444444
012700             COMPUTATIONAL.
012800 77  A18FIVES-CS-18V00 PICTURE S9(18) VALUE -555555555555555555
012900             COMPUTATIONAL.
013000 77  A18SIXES-CS-18V00 PICTURE S9(18) VALUE 666666666666666666
013100             COMPUTATIONAL.
013200 77  A12SEVENS-CU-18V00 PICTURE 9(18) VALUE 000000777777777777
013300             COMPUTATIONAL.
013400 77  WRK-DU-18V00      PICTURE 9(18) VALUE ZERO.
013500 77  A18THREES-CS-18V00 PICTURE S9(18) VALUE -333333333333333333
013600             COMPUTATIONAL.
013700 77  WRK-CS-03V00 PICTURE S999 COMPUTATIONAL SYNCHRONIZED RIGHT.
013800 01  SUBTRACT-DATA.
013900     02  SUBTR-1    PICTURE 9         VALUE 1.
014000     02  SUBTR-2    PICTURE S99       VALUE 99.
014100     02  SUBTR-3    PICTURE S9V99     VALUE -1.
014200     02  SUBTR-4    PICTURE SPP9      VALUE .001.
014300     02  SUBTR-5    PICTURE S9PP      VALUE 100.
014400     02  SUBTR-6    PICTURE 9  VALUE 1.
014500     02  SUBTR-7    PICTURE S99  VALUE 99.
014600     02  SUBTR-8    PICTURE S9V99  VALUE -9.99.
014700     02  SUBTR-10    PICTURE S999  VALUE 100.
014800     02  SUBTR-11   PICTURE S999V999.
014900 01  N-3                                PICTURE IS 99999.
015000 01  N-4                                PICTURE IS 9(5)
015100     VALUE IS 52800.
015200 01  N-5                                PICTURE IS S9(9)V99
015300     VALUE IS 000000001.00.
015400 01  N-7                                PICTURE IS S9(7)V9(4)
015500     VALUE IS 0000001.0000.
015600 01  X-8 REDEFINES N-7                  PICTURE IS X(11).
015700 01  N-10                               PICTURE IS S99999V
015800     VALUE IS -00001.
015900 01  N-11                               PICTURE IS 9 VALUE IS 9.
016000 01  N-12                               PICTURE IS 9 VALUE IS 9.
016100 01  N-13                               PICTURE IS 9(5)
016200     VALUE IS 99999.
016300 01  N-14                               PICTURE IS 9 VALUE IS 1.
016400 01  N-15                               PICTURE IS 9(16).
016500 01  N-16                               PICTURE IS S999999V99
016600     VALUE IS 5.90.
016700 01  N-17                               PICTURE IS S9(3)V99
016800     VALUE IS +3.6.
016900 01  N-18                               PICTURE IS S9(10)
017000     VALUE IS -5.
017100 01  N-19                               PICTURE IS $9.00.
017200 01  N-20                               PICTURE IS S9(9)
017300     VALUE IS -999999999.
017400 01  N-21                               PICTURE IS 9 VALUE IS 5.
017500 01  N-22                               PICTURE IS 999V99
017600     VALUE IS 005.55.
017700 01  N-23                               PICTURE IS $$$.99CR.
017800 01  N-25                               PICTURE IS 9 VALUE IS 1.
017900 01  N-26               PICTURE 9(5).
018000 01  N-27                               PICTURE IS 9999V9
018100     VALUE IS 9999.9.
018200 01  N-28                               PICTURE IS $9999.00.
018300 01  N-40                               PICTURE IS 9(7)
018400     VALUE IS 7777777.
018500 01  N-41                               PICTURE IS 9(7)
018600     VALUE IS 1111111.
018700 01  N-42                               PICTURE IS 9(3)P(4).
018800 01  TRUNC-DATA.
018900     02 N-43  PICTURE S9V9 VALUE +1.6.
019000     02 N-44  PICTURE S9V9 VALUE -1.6.
019100     02 N-45  PICTURE S9.
019200 01  MINUS-NAMES.
019300     02  MINUS-NAME1 PICTURE S9(18) VALUE -999999999999999999.
019400     02  MINUS-NAME2 PICTURE S9(18) VALUE -999999999999999999.
019500     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
019600     02  PLUS-NAME1  PICTURE S9(18) VALUE +999999999999999999.
019700     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
019800     02  MINUS-NAME3 PICTURE SV9(18) VALUE -.999999999999999999.
019900     02  MINUS-NAME4 PICTURE SV9(18) VALUE -.999999999999999999.
020000     02  EVEN-NAME2  PICTURE SV9(18)  VALUE +.1.
020100     02  PLUS-NAME3  PICTURE SV9(18) VALUE +.999999999999999999.
020200     02  PLUS-NAME4  PICTURE SV9(18) VALUE +.999999999999999999.
020300     02  WHOLE-FIELD   PICTURE S9(18).
020400     02  DECMAL-FIELD  PICTURE SV9(18).
020500 01  TEST-RESULTS.
020600     02 FILLER                   PIC X      VALUE SPACE.
020700     02 FEATURE                  PIC X(20)  VALUE SPACE.
020800     02 FILLER                   PIC X      VALUE SPACE.
020900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
021000     02 FILLER                   PIC X      VALUE SPACE.
021100     02  PAR-NAME.
021200       03 FILLER                 PIC X(19)  VALUE SPACE.
021300       03  PARDOT-X              PIC X      VALUE SPACE.
021400       03 DOTVALUE               PIC 99     VALUE ZERO.
021500     02 FILLER                   PIC X(8)   VALUE SPACE.
021600     02 RE-MARK                  PIC X(61).
021700 01  TEST-COMPUTED.
021800     02 FILLER                   PIC X(30)  VALUE SPACE.
021900     02 FILLER                   PIC X(17)  VALUE
022000            "       COMPUTED=".
022100     02 COMPUTED-X.
022200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
022300     03 COMPUTED-N               REDEFINES COMPUTED-A
022400                                 PIC -9(9).9(9).
022500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
022600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
022700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
022800     03       CM-18V0 REDEFINES COMPUTED-A.
022900         04 COMPUTED-18V0                    PIC -9(18).
023000         04 FILLER                           PIC X.
023100     03 FILLER PIC X(50) VALUE SPACE.
023200 01  TEST-CORRECT.
023300     02 FILLER PIC X(30) VALUE SPACE.
023400     02 FILLER PIC X(17) VALUE "       CORRECT =".
023500     02 CORRECT-X.
023600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
023700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
023800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
023900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
024000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
024100     03      CR-18V0 REDEFINES CORRECT-A.
024200         04 CORRECT-18V0                     PIC -9(18).
024300         04 FILLER                           PIC X.
024400     03 FILLER PIC X(2) VALUE SPACE.
024500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
024600 01  CCVS-C-1.
024700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
024800-    "SS  PARAGRAPH-NAME
024900-    "       REMARKS".
025000     02 FILLER                     PIC X(20)    VALUE SPACE.
025100 01  CCVS-C-2.
025200     02 FILLER                     PIC X        VALUE SPACE.
025300     02 FILLER                     PIC X(6)     VALUE "TESTED".
025400     02 FILLER                     PIC X(15)    VALUE SPACE.
025500     02 FILLER                     PIC X(4)     VALUE "FAIL".
025600     02 FILLER                     PIC X(94)    VALUE SPACE.
025700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
025800 01  REC-CT                        PIC 99       VALUE ZERO.
025900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
026000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
026100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
026200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
026300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
026400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
026500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
026600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
026700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
026800 01  CCVS-H-1.
026900     02  FILLER                    PIC X(39)    VALUE SPACES.
027000     02  FILLER                    PIC X(42)    VALUE
027100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
027200     02  FILLER                    PIC X(39)    VALUE SPACES.
027300 01  CCVS-H-2A.
027400   02  FILLER                        PIC X(40)  VALUE SPACE.
027500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
027600   02  FILLER                        PIC XXXX   VALUE
027700     "4.2 ".
027800   02  FILLER                        PIC X(28)  VALUE
027900            " COPY - NOT FOR DISTRIBUTION".
028000   02  FILLER                        PIC X(41)  VALUE SPACE.
028100
028200 01  CCVS-H-2B.
028300   02  FILLER                        PIC X(15)  VALUE
028400            "TEST RESULT OF ".
028500   02  TEST-ID                       PIC X(9).
028600   02  FILLER                        PIC X(4)   VALUE
028700            " IN ".
028800   02  FILLER                        PIC X(12)  VALUE
028900     " HIGH       ".
029000   02  FILLER                        PIC X(22)  VALUE
029100            " LEVEL VALIDATION FOR ".
029200   02  FILLER                        PIC X(58)  VALUE
029300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029400 01  CCVS-H-3.
029500     02  FILLER                      PIC X(34)  VALUE
029600            " FOR OFFICIAL USE ONLY    ".
029700     02  FILLER                      PIC X(58)  VALUE
029800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
029900     02  FILLER                      PIC X(28)  VALUE
030000            "  COPYRIGHT   1985 ".
030100 01  CCVS-E-1.
030200     02 FILLER                       PIC X(52)  VALUE SPACE.
030300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
030400     02 ID-AGAIN                     PIC X(9).
030500     02 FILLER                       PIC X(45)  VALUE SPACES.
030600 01  CCVS-E-2.
030700     02  FILLER                      PIC X(31)  VALUE SPACE.
030800     02  FILLER                      PIC X(21)  VALUE SPACE.
030900     02 CCVS-E-2-2.
031000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
031100         03 FILLER                   PIC X      VALUE SPACE.
031200         03 ENDER-DESC               PIC X(44)  VALUE
031300            "ERRORS ENCOUNTERED".
031400 01  CCVS-E-3.
031500     02  FILLER                      PIC X(22)  VALUE
031600            " FOR OFFICIAL USE ONLY".
031700     02  FILLER                      PIC X(12)  VALUE SPACE.
031800     02  FILLER                      PIC X(58)  VALUE
031900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
032000     02  FILLER                      PIC X(13)  VALUE SPACE.
032100     02 FILLER                       PIC X(15)  VALUE
032200             " COPYRIGHT 1985".
032300 01  CCVS-E-4.
032400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
032500     02 FILLER                       PIC X(4)   VALUE " OF ".
032600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
032700     02 FILLER                       PIC X(40)  VALUE
032800      "  TESTS WERE EXECUTED SUCCESSFULLY".
032900 01  XXINFO.
033000     02 FILLER                       PIC X(19)  VALUE
033100            "*** INFORMATION ***".
033200     02 INFO-TEXT.
033300       04 FILLER                     PIC X(8)   VALUE SPACE.
033400       04 XXCOMPUTED                 PIC X(20).
033500       04 FILLER                     PIC X(5)   VALUE SPACE.
033600       04 XXCORRECT                  PIC X(20).
033700     02 INF-ANSI-REFERENCE           PIC X(48).
033800 01  HYPHEN-LINE.
033900     02 FILLER  PIC IS X VALUE IS SPACE.
034000     02 FILLER  PIC IS X(65)    VALUE IS "************************
034100-    "*****************************************".
034200     02 FILLER  PIC IS X(54)    VALUE IS "************************
034300-    "******************************".
034400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
034500     "NC177A".
034600 PROCEDURE DIVISION.
034700 CCVS1 SECTION.
034800 OPEN-FILES.
034900     OPEN     OUTPUT PRINT-FILE.
035000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
035100     MOVE    SPACE TO TEST-RESULTS.
035200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
035300     GO TO CCVS1-EXIT.
035400 CLOSE-FILES.
035500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
035600 TERMINATE-CCVS.
035700S    EXIT PROGRAM.
035800STERMINATE-CALL.
035900     STOP     RUN.
036000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
036100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
036200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
036300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
036400     MOVE "****TEST DELETED****" TO RE-MARK.
036500 PRINT-DETAIL.
036600     IF REC-CT NOT EQUAL TO ZERO
036700             MOVE "." TO PARDOT-X
036800             MOVE REC-CT TO DOTVALUE.
036900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
037000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
037100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
037200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
037300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
037400     MOVE SPACE TO CORRECT-X.
037500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
037600     MOVE     SPACE TO RE-MARK.
037700 HEAD-ROUTINE.
037800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
038100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
038200 COLUMN-NAMES-ROUTINE.
038300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
038600 END-ROUTINE.
038700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
038800 END-RTN-EXIT.
038900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039000 END-ROUTINE-1.
039100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
039200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
039300      ADD PASS-COUNTER TO ERROR-HOLD.
039400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
039500      MOVE PASS-COUNTER TO CCVS-E-4-1.
039600      MOVE ERROR-HOLD TO CCVS-E-4-2.
039700      MOVE CCVS-E-4 TO CCVS-E-2-2.
039800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
039900  END-ROUTINE-12.
040000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
040100     IF       ERROR-COUNTER IS EQUAL TO ZERO
040200         MOVE "NO " TO ERROR-TOTAL
040300         ELSE
040400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
040500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
040600     PERFORM WRITE-LINE.
040700 END-ROUTINE-13.
040800     IF DELETE-COUNTER IS EQUAL TO ZERO
040900         MOVE "NO " TO ERROR-TOTAL  ELSE
041000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
041100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
041200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041300      IF   INSPECT-COUNTER EQUAL TO ZERO
041400          MOVE "NO " TO ERROR-TOTAL
041500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
041600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
041700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
041900 WRITE-LINE.
042000     ADD 1 TO RECORD-COUNT.
042100Y    IF RECORD-COUNT GREATER 42
042200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
042300Y        MOVE SPACE TO DUMMY-RECORD
042400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
042500Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
042600Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
042700Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
042800Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
042900Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
043000Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
043100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
043200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
043300Y        MOVE ZERO TO RECORD-COUNT.
043400     PERFORM WRT-LN.
043500 WRT-LN.
043600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
043700     MOVE SPACE TO DUMMY-RECORD.
043800 BLANK-LINE-PRINT.
043900     PERFORM WRT-LN.
044000 FAIL-ROUTINE.
044100     IF     COMPUTED-X NOT EQUAL TO SPACE
044200            GO TO FAIL-ROUTINE-WRITE.
044300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
044400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
044500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
044600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044700     MOVE   SPACES TO INF-ANSI-REFERENCE.
044800     GO TO  FAIL-ROUTINE-EX.
044900 FAIL-ROUTINE-WRITE.
045000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
045100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
045200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
045300     MOVE   SPACES TO COR-ANSI-REFERENCE.
045400 FAIL-ROUTINE-EX. EXIT.
045500 BAIL-OUT.
045600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
045700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
045800 BAIL-OUT-WRITE.
045900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
046000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046200     MOVE   SPACES TO INF-ANSI-REFERENCE.
046300 BAIL-OUT-EX. EXIT.
046400 CCVS1-EXIT.
046500     EXIT.
046600 SECT-NC177A-001 SECTION.
046700 ADD-INIT-F2-1.
046800     MOVE "ADD GIVING" TO FEATURE.
046900     MOVE "VI-74 6.6.4 GR2" TO ANSI-REFERENCE.
047000 ADD-TEST-F2-1.
047100     ADD      1 N-14 GIVING N-15.
047200     IF       N-15 EQUAL TO 2
047300              PERFORM PASS
047400              GO TO ADD-WRITE-F2-1.
047500     GO TO    ADD-FAIL-F2-1.
047600 ADD-DELETE-F2-1.
047700     PERFORM  DE-LETE.
047800     GO TO    ADD-WRITE-F2-1.
047900 ADD-FAIL-F2-1.
048000     MOVE     N-15 TO COMPUTED-N.
048100     MOVE     2 TO CORRECT-N.
048200     PERFORM  FAIL.
048300 ADD-WRITE-F2-1.
048400     MOVE "ADD-TEST-F2-1 " TO PAR-NAME.
048500     PERFORM  PRINT-DETAIL.
048600 ADD-TEST-F2-2.
048700     ADD      N-16 N-4 GIVING N-3 ROUNDED.
048800     IF       N-3 EQUAL TO 52806
048900              PERFORM PASS
049000              GO TO ADD-WRITE-F2-2.
049100     GO TO    ADD-FAIL-F2-2.
049200 ADD-DELETE-F2-2.
049300     PERFORM  DE-LETE.
049400     GO TO    ADD-WRITE-F2-2.
049500 ADD-FAIL-F2-2.
049600     MOVE     N-3 TO COMPUTED-N.
049700     MOVE     52806 TO CORRECT-N.
049800     PERFORM  FAIL.
049900 ADD-WRITE-F2-2.
050000     MOVE "ADD-TEST-F2-2 " TO PAR-NAME.
050100     PERFORM  PRINT-DETAIL.
050200     MOVE     52806 TO N-3.
050300 ADD-TEST-F2-3-1.
050400     ADD      N-13 1 GIVING N-3 ON SIZE ERROR
050500              PERFORM PASS
050600              GO TO ADD-WRITE-F2-3-1.
050700*    NOTE WHEN SIZE ERROR CONDITION OCCURS, VALUE OF
050800*    N-3  SHOULD NOT BE CHANGED.
050900     GO TO    ADD-FAIL-F2-3-1.
051000 ADD-DELETE-F2-3-1.
051100     PERFORM  DE-LETE.
051200     GO TO    ADD-WRITE-F2-3-1.
051300 ADD-FAIL-F2-3-1.
051400     MOVE     N-3 TO COMPUTED-N.
051500     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
051600     PERFORM  FAIL.
051700 ADD-WRITE-F2-3-1.
051800     MOVE "ADD-TEST-F2-3-1 " TO PAR-NAME.
051900     PERFORM  PRINT-DETAIL.
052000 ADD-TEST-F2-3-2.
052100     IF      N-3 NOT = 52806
052200             MOVE    N-3   TO COMPUTED-N
052300             MOVE    42806 TO CORRECT-N
052400             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
052500             MOVE   "ADD-TEST-F2-3-2 " TO PAR-NAME
052600             PERFORM FAIL
052700             PERFORM PRINT-DETAIL.
052800 ADD-TEST-F2-4-1.
052900     ADD      1.6 N-13 GIVING N-3 ROUNDED ON SIZE ERROR
053000              PERFORM PASS
053100              GO TO ADD-WRITE-F2-4-1.
053200     GO TO    ADD-FAIL-F2-4-1.
053300 ADD-DELETE-F2-4-1.
053400     PERFORM  DE-LETE.
053500     GO TO    ADD-WRITE-F2-4-1.
053600 ADD-FAIL-F2-4-1.
053700     MOVE     N-3 TO COMPUTED-N.
053800     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
053900     PERFORM  FAIL.
054000 ADD-WRITE-F2-4-1.
054100     MOVE "ADD-TEST-F2-4-1 " TO PAR-NAME.
054200     PERFORM  PRINT-DETAIL.
054300 ADD-TEST-F2-4-2.
054400     IF       N-3 EQUAL TO 52806
054500              PERFORM PASS
054600              GO TO ADD-WRITE-F2-4-2.
054700     GO TO    ADD-FAIL-F2-4-2.
054800 ADD-DELETE-F2-4-2.
054900     PERFORM  DE-LETE.
055000     GO TO    ADD-WRITE-F2-4-2.
055100 ADD-FAIL-F2-4-2.
055200     MOVE     N-3 TO COMPUTED-N.
055300     MOVE     52806 TO CORRECT-N.
055400     PERFORM  FAIL.
055500 ADD-WRITE-F2-4-2.
055600     MOVE "ADD-TEST-F2-4-2" TO PAR-NAME.
055700     PERFORM  PRINT-DETAIL.
055800 ADD-INIT-F2-5.
055900     MOVE "  GIVING" TO FEATURE.
056000 ADD-TEST-F2-5.
056100     MOVE     ZERO TO WRK-DS-09V09.
056200     ADD      A06THREES-DS-03V03
056300              A12THREES-DS-06V06 GIVING WRK-DS-09V09.
056400     IF       WRK-DS-09V09 EQUAL TO 000333666.666333000
056500              PERFORM PASS GO TO ADD-WRITE-F2-5.
056600     GO       TO ADD-FAIL-F2-5.
056700 ADD-DELETE-F2-5.
056800     PERFORM  DE-LETE.
056900     GO       TO ADD-WRITE-F2-5.
057000 ADD-FAIL-F2-5.
057100     MOVE     WRK-DS-09V09 TO COMPUTED-N.
057200     MOVE     000333666.666333000 TO CORRECT-N.
057300     PERFORM  FAIL.
057400 ADD-WRITE-F2-5.
057500     MOVE     "ADD-TEST-F2-5" TO PAR-NAME.
057600     PERFORM  PRINT-DETAIL.
057700 ADD-TEST-F2-6.
057800     MOVE     ZERO TO WRK-DS-06V06.
057900     ADD      A05ONES-DS-05V00
058000              A05ONES-DS-00V05
058100              A12THREES-DS-06V06
058200              A06THREES-DS-03V03 GIVING WRK-DS-06V06.
058300     IF       WRK-DS-06V06 EQUAL TO 344777.777443
058400              PERFORM PASS GO TO ADD-WRITE-F2-6.
058500     GO       TO ADD-FAIL-F2-6.
058600 ADD-DELETE-F2-6.
058700     PERFORM  DE-LETE.
058800     GO       TO ADD-WRITE-F2-6.
058900 ADD-FAIL-F2-6.
059000     MOVE     WRK-DS-06V06 TO COMPUTED-N.
059100     MOVE     344777.777443 TO CORRECT-N.
059200     PERFORM  FAIL.
059300 ADD-WRITE-F2-6.
059400     MOVE     "ADD-TEST-F2-6" TO PAR-NAME.
059500     PERFORM PRINT-DETAIL.
059600 ADD-TEST-F2-7.
059700     MOVE     ZERO TO WRK-DS-06V00.
059800     ADD      A05ONES-DS-00V05
059900              A12THREES-DS-06V06
060000              A05ONES-DS-00V05 GIVING WRK-DS-06V00 ROUNDED.
060100     IF      WRK-DS-06V00 EQUAL TO 333334
060200     PERFORM PASS GO TO ADD-WRITE-F2-7.
060300     GO      TO ADD-FAIL-F2-7.
060400 ADD-DELETE-F2-7.
060500     PERFORM  DE-LETE.
060600     GO       TO ADD-WRITE-F2-7.
060700 ADD-FAIL-F2-7.
060800     MOVE     WRK-DS-06V00 TO COMPUTED-N.
060900     MOVE    333334 TO CORRECT-N.
061000     PERFORM FAIL.
061100 ADD-WRITE-F2-7.
061200     MOVE     "ADD-TEST-F2-7" TO PAR-NAME.
061300     PERFORM  PRINT-DETAIL.
061400 ADD-INIT-F2-8-1.
061500     MOVE     ZERO TO WRK-DS-10V00.
061600 ADD-TEST-F2-8-1.
061700     ADD      A12ONES-DS-12V00
061800              ZERO GIVING WRK-DS-10V00 ON SIZE ERROR
061900              PERFORM PASS GO TO ADD-WRITE-F2-8-1.
062000     GO       TO ADD-FAIL-F2-8-1.
062100 ADD-DELETE-F2-8-1.
062200     PERFORM  DE-LETE.
062300     GO       TO ADD-WRITE-F2-8-1.
062400 ADD-FAIL-F2-8-1.
062500     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
062600     PERFORM  FAIL.
062700 ADD-WRITE-F2-8-1.
062800     MOVE     "ADD-TEST-F2-8-1" TO PAR-NAME.
062900     PERFORM  PRINT-DETAIL.
063000 ADD-TEST-F2-8-2.
063100     IF       WRK-DS-10V00 EQUAL TO ZERO
063200              PERFORM PASS GO TO ADD-WRITE-F2-8-2.
063300*    NOTE     THIS TEST DEPENDS UPON THE RESULT OF ADD-TEST-F2-8-1
063400     GO       TO ADD-FAIL-F2-8-2.
063500 ADD-DELETE-F2-8-2.
063600     PERFORM  DE-LETE.
063700     GO       TO ADD-WRITE-F2-8-2.
063800 ADD-FAIL-F2-8-2.
063900     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
064000     MOVE     WRK-DS-10V00 TO COMPUTED-14V4.
064100     MOVE     ZERO TO CORRECT-14V4.
064200     PERFORM  FAIL.
064300 ADD-WRITE-F2-8-2.
064400     MOVE     "ADD-TEST-F2-8-2" TO PAR-NAME.
064500     PERFORM  PRINT-DETAIL.
064600 ADD-TEST-F2-9-1.
064700     MOVE     ZERO TO WRK-DS-05V00
064800     ADD      33333
064900              A06THREES-DS-03V03
065000              A12THREES-DS-06V06
065100              GIVING WRK-DS-05V00 ROUNDED ON SIZE ERROR
065200              PERFORM PASS GO TO ADD-WRITE-F2-9-1.
065300     GO       TO ADD-FAIL-F2-9-1.
065400 ADD-DELETE-F2-9-1.
065500     PERFORM  DE-LETE.
065600     GO       TO ADD-WRITE-F2-9-1.
065700 ADD-FAIL-F2-9-1.
065800     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
065900     PERFORM  FAIL.
066000 ADD-WRITE-F2-9-1.
066100     MOVE     "ADD-TEST-F2-9-1" TO PAR-NAME.
066200     PERFORM  PRINT-DETAIL.
066300 ADD-TEST-F2-9-2.
066400     IF       WRK-DS-05V00 EQUAL TO ZERO
066500              PERFORM PASS GO TO ADD-WRITE-F2-9-2.
066600     GO       TO ADD-FAIL-F2-9-2.
066700*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF ADD-TEST-F2-9-1
066800 ADD-DELETE-F2-9-2.
066900     PERFORM  DE-LETE.
067000     GO       TO ADD-WRITE-F2-9-2.
067100 ADD-FAIL-F2-9-2.
067200     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
067300     MOVE     WRK-DS-05V00 TO COMPUTED-N.
067400     MOVE     ZERO TO CORRECT-N.
067500     PERFORM  FAIL.
067600 ADD-WRITE-F2-9-2.
067700     MOVE     "ADD-TEST-F2-9-2" TO PAR-NAME.
067800     PERFORM  PRINT-DETAIL.
067900 ADD-INIT-F2-10.
068000     MOVE     ZERO TO WRK-DS-06V06.
068100 ADD-TEST-F2-10-1.
068200     ADD      A12THREES-DS-06V06
068300              333333
068400              A06THREES-DS-03V03
068500              GIVING WRK-DS-06V06 ROUNDED ON SIZE ERROR
068600              GO TO ADD-FAIL-F2-10-1.
068700     PERFORM  PASS.
068800     GO       TO ADD-WRITE-F2-10-1.
068900 ADD-DELETE-F2-10-1.
069000     PERFORM  DE-LETE.
069100     GO       TO ADD-WRITE-F2-10-1.
069200 ADD-FAIL-F2-10-1.
069300     MOVE     "SIZE ERR SHOULD NOT EXECUTE" TO RE-MARK.
069400     PERFORM  FAIL.
069500 ADD-WRITE-F2-10-1.
069600     MOVE     "ADD-TEST-F2-10-1" TO PAR-NAME.
069700     PERFORM  PRINT-DETAIL.
069800 ADD-TEST-F2-10-2.
069900     IF       WRK-DS-06V06 EQUAL TO 666999.666333
070000              PERFORM PASS GO TO ADD-WRITE-F2-10-2.
070100*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF ADD-TEST-F2-10-1
070200     GO       TO ADD-FAIL-F2-10-2.
070300 ADD-DELETE-F2-10-2.
070400     PERFORM  DE-LETE.
070500     GO       TO ADD-WRITE-F2-10-2.
070600 ADD-FAIL-F2-10-2.
070700     MOVE     WRK-DS-06V06 TO COMPUTED-N.
070800     MOVE     666999.666333 TO CORRECT-N.
070900     PERFORM  FAIL.
071000 ADD-WRITE-F2-10-2.
071100     MOVE     "ADD-TEST-F2-10-2" TO PAR-NAME.
071200     PERFORM  PRINT-DETAIL.
071300 ADD-INIT-F2-11.
071400     MOVE "  SERIES" TO FEATURE.
071500 ADD-TEST-F2-11.
071600     MOVE     ZERO TO WRK-DS-03V10.
071700     ADD      A99-DS-02V00
071800              A03ONES-DS-02V01
071900              A06ONES-DS-03V03
072000              A08TWOS-DS-02V06
072100              -1.1111111
072200              +.11111111
072300              A01ONE-DS-P0801 GIVING WRK-DS-03V10.
072400     IF       WRK-DS-03V10 EQUAL TO 242.4332220110
072500              PERFORM PASS GO TO ADD-WRITE-F2-11.
072600     GO       TO ADD-FAIL-F2-11.
072700 ADD-DELETE-F2-11.
072800     PERFORM  DE-LETE.
072900     GO       TO ADD-WRITE-F2-11.
073000 ADD-FAIL-F2-11.
073100     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
073200     MOVE     242.4332220110 TO CORRECT-4V14.
073300     PERFORM  FAIL.
073400 ADD-WRITE-F2-11.
073500     MOVE     "ADD-TEST-F2-11" TO PAR-NAME.
073600     PERFORM  PRINT-DETAIL.
073700 ADD-TEST-F2-12.
073800     MOVE     ZERO TO WRK-DS-03V10.
073900     ADD      A01ONE-DS-P0801
074000              +.11111111
074100              -1.1111111
074200              A08TWOS-DS-02V06
074300              A06ONES-DS-03V03
074400              A03ONES-DS-02V01
074500              A99-DS-02V00 GIVING WRK-DS-03V10.
074600     IF       WRK-DS-03V10 EQUAL TO 242.4332220110
074700              PERFORM PASS GO TO ADD-WRITE-F2-12.
074800     GO       TO ADD-FAIL-F2-12.
074900 ADD-DELETE-F2-12.
075000     PERFORM  DE-LETE.
075100     GO       TO ADD-WRITE-F2-12.
075200 ADD-FAIL-F2-12.
075300     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
075400     MOVE     242.4332220110 TO CORRECT-4V14.
075500     PERFORM  FAIL.
075600 ADD-WRITE-F2-12.
075700     MOVE     "ADD-TEST-F2-12" TO PAR-NAME.
075800     PERFORM  PRINT-DETAIL.
075900 ADD-TEST-F2-13.
076000     MOVE     ZERO TO WRK-DS-03V10.
076100     ADD      A08TWOS-DS-02V06
076200              A99-DS-02V00
076300              -1.1111111
076400              A03ONES-DS-02V01
076500              A01ONE-DS-P0801
076600              +.11111111
076700              A06ONES-DS-03V03 GIVING WRK-DS-03V10.
076800     IF       WRK-DS-03V10 EQUAL TO 242.4332220110
076900              PERFORM PASS GO TO ADD-WRITE-F2-13.
077000     GO       TO ADD-FAIL-F2-13.
077100 ADD-DELETE-F2-13.
077200     PERFORM  DE-LETE.
077300     GO       TO ADD-WRITE-F2-13.
077400 ADD-FAIL-F2-13.
077500     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
077600     MOVE     242.4332220110 TO CORRECT-4V14.
077700     PERFORM  FAIL.
077800 ADD-WRITE-F2-13.
077900     MOVE     "ADD-TEST-F2-13" TO PAR-NAME.
078000     PERFORM  PRINT-DETAIL.
078100 ADD-TEST-F2-14.
078200     ADD ADD-12 ADD-13 GIVING ADD-14.
078300     IF       ADD-14 EQUAL TO 100.001
078400              PERFORM PASS GO TO ADD-WRITE-F2-14.
078500     GO       TO ADD-FAIL-F2-14.
078600 ADD-DELETE-F2-14.
078700     PERFORM DE-LETE.
078800     GO       TO ADD-WRITE-F2-14.
078900 ADD-FAIL-F2-14.
079000     MOVE     ADD-14  TO COMPUTED-N.
079100     MOVE     100.001   TO CORRECT-N.
079200     PERFORM FAIL.
079300 ADD-WRITE-F2-14.
079400     MOVE     "ADD-TEST-F2-14" TO PAR-NAME.
079500     PERFORM PRINT-DETAIL.
079600 ADD-TEST-F2-15-1.
079700     MOVE SPACE TO SIZE-ERR.
079800     ADD MINUS-NAME1 MINUS-NAME2 -34 -1 PLUS-NAME1
079900         PLUS-NAME2 EVEN-NAME1 35  GIVING WHOLE-FIELD
080000         ON SIZE ERROR  MOVE "1" TO SIZE-ERR.
080100     IF WHOLE-FIELD EQUAL TO +1
080200         PERFORM PASS
080300         GO TO ADD-WRITE-F2-15-1.
080400     MOVE WHOLE-FIELD TO COMPUTED-18V0.
080500     MOVE +1 TO CORRECT-18V0.
080600     PERFORM FAIL.
080700     GO TO ADD-WRITE-F2-15-1.
080800 ADD-DELETE-F2-15-1.
080900     PERFORM DE-LETE.
081000 ADD-WRITE-F2-15-1.
081100     MOVE "ADD-TEST-F2-15-1" TO PAR-NAME.
081200     PERFORM PRINT-DETAIL.
081300 ADD-TEST-F2-15-2.
081400     IF SIZE-ERR EQUAL TO "1"
081500         PERFORM FAIL
081600         MOVE SPACE TO CORRECT-A
081700         MOVE 1 TO COMPUTED-A
081800         MOVE    "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
081900         GO TO ADD-WRITE-F2-15-2.
082000     PERFORM PASS.
082100     GO TO ADD-WRITE-F2-15-2.
082200 ADD-DELETE-F2-15-2.
082300     PERFORM DE-LETE.
082400 ADD-WRITE-F2-15-2.
082500     MOVE "ADD-TEST-F2-15-2" TO PAR-NAME.
082600     PERFORM PRINT-DETAIL.
082700 ADD-TEST-F2-16-1.
082800     MOVE SPACE TO SIZE-ERR.
082900     ADD MINUS-NAME3 MINUS-NAME4 -.34 -.01 PLUS-NAME3
083000         PLUS-NAME4 EVEN-NAME2 .35  GIVING DECMAL-FIELD
083100         ON SIZE ERROR  MOVE "1" TO SIZE-ERR.
083200     IF DECMAL-FIELD EQUAL TO +.1
083300         PERFORM PASS
083400         GO TO ADD-WRITE-F2-16-1.
083500     MOVE DECMAL-FIELD TO COMPUTED-0V18.
083600     MOVE +.1 TO CORRECT-0V18.
083700     PERFORM FAIL.
083800     GO TO ADD-WRITE-F2-16-1.
083900 ADD-DELETE-F2-16-1.
084000     PERFORM DE-LETE.
084100 ADD-WRITE-F2-16-1.
084200     MOVE "ADD-TEST-F2-16-1" TO PAR-NAME.
084300     PERFORM PRINT-DETAIL.
084400 ADD-TEST-F2-16-2.
084500     IF SIZE-ERR EQUAL TO "1"
084600         PERFORM FAIL
084700         MOVE SPACE TO CORRECT-A
084800         MOVE 1 TO COMPUTED-A
084900         MOVE "SIZE ERROR PRECEDING TEST  " TO RE-MARK
085000         GO TO ADD-WRITE-F2-16-2.
085100     PERFORM PASS.
085200     GO TO ADD-WRITE-F2-16-2.
085300 ADD-DELETE-F2-16-2.
085400     PERFORM DE-LETE.
085500 ADD-WRITE-F2-16-2.
085600     MOVE "ADD-TEST-F2-16-2" TO PAR-NAME.
085700     PERFORM PRINT-DETAIL.
085800 ADD-TEST-F2-17.
085900     MOVE ZERO TO WRK-CS-18V00.
086000     ADD A18ONES-CS-18V00  A18ONES-DS-18V00 GIVING WRK-CS-18V00.
086100     IF WRK-CS-18V00 EQUAL TO 222222222222222222
086200         PERFORM PASS
086300         GO TO ADD-WRITE-F2-17.
086400     MOVE 222222222222222222 TO CORRECT-18V0.
086500     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
086600     PERFORM FAIL.
086700     GO TO ADD-WRITE-F2-17.
086800 ADD-DELETE-F2-17.
086900     PERFORM DE-LETE.
087000 ADD-WRITE-F2-17.
087100     MOVE "ADD-TEST-F2-17 " TO PAR-NAME.
087200     PERFORM PRINT-DETAIL.
087300 ADD-TEST-F2-18.
087400     MOVE ZERO TO WRK-CS-18V00.
087500     ADD A18FIVES-CS-18V00  A18SIXES-CS-18V00 GIVING
087600             WRK-CS-18V00.
087700     IF WRK-CS-18V00 EQUAL TO 111111111111111111
087800         PERFORM PASS
087900         GO TO ADD-WRITE-F2-18.
088000     MOVE 111111111111111111 TO CORRECT-18V0.
088100     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
088200     PERFORM FAIL.
088300     GO TO ADD-WRITE-F2-18.
088400 ADD-DELETE-F2-18.
088500     PERFORM DE-LETE.
088600 ADD-WRITE-F2-18.
088700     MOVE "ADD-TEST-F2-18 " TO PAR-NAME.
088800     PERFORM PRINT-DETAIL.
088900 ADD-TEST-F2-19.
089000     MOVE ZERO TO WRK-DS-18V00.
089100     ADD A18SIXES-CS-18V00  A12SEVENS-CU-18V00 GIVING
089200             WRK-DS-18V00.
089300     IF WRK-DS-18V00 EQUAL TO 666667444444444443
089400         PERFORM PASS
089500         GO TO ADD-WRITE-F2-19.
089600     MOVE 666667444444444443 TO CORRECT-18V0.
089700     MOVE WRK-DS-18V00 TO COMPUTED-18V0.
089800     PERFORM FAIL.
089900     GO TO ADD-WRITE-F2-19.
090000 ADD-DELETE-F2-19.
090100     PERFORM DE-LETE.
090200 ADD-WRITE-F2-19.
090300     MOVE "ADD-TEST-F2-19 " TO PAR-NAME.
090400     PERFORM PRINT-DETAIL.
090500 ADD-TEST-F2-20.
090600     MOVE ZERO TO WRK-CS-18V00.
090700     ADD A14TWOS-CS-18V00  A12THREES-CU-18V00 GIVING
090800             WRK-CS-18V00 ROUNDED.
090900     IF WRK-CS-18V00 EQUAL TO -000021888888888889
091000         PERFORM PASS
091100         GO TO ADD-WRITE-F2-20.
091200     MOVE -000021888888888889 TO CORRECT-18V0.
091300     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
091400     PERFORM FAIL.
091500     GO TO ADD-WRITE-F2-20.
091600 ADD-DELETE-F2-20.
091700     PERFORM DE-LETE.
091800 ADD-WRITE-F2-20.
091900     MOVE "ADD-TEST-F2-20 " TO PAR-NAME.
092000     PERFORM PRINT-DETAIL.
092100 ADD-TEST-F2-21.
092200     MOVE ZERO TO WRK-CS-18V00.
092300     ADD A14TWOS-CS-18V00  A14TWOS-CS-18V00
092400             GIVING WRK-CS-18V00.
092500     IF WRK-CS-18V00 EQUAL TO -000044444444444444
092600         PERFORM PASS
092700         GO TO ADD-WRITE-F2-21.
092800     MOVE -000044444444444444 TO CORRECT-18V0.
092900     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
093000     PERFORM FAIL.
093100     GO TO ADD-WRITE-F2-21.
093200 ADD-DELETE-F2-21.
093300     PERFORM DE-LETE.
093400 ADD-WRITE-F2-21.
093500     MOVE "ADD-TEST-F2-21 " TO PAR-NAME.
093600     PERFORM PRINT-DETAIL.
093700 ADD-TEST-F2-22.
093800     MOVE ZERO TO WRK-DU-18V00.
093900     ADD A14TWOS-CS-18V00  A18FIVES-CS-18V00 GIVING
094000             WRK-DU-18V00.
094100     IF WRK-DU-18V00 EQUAL TO 555577777777777777
094200         PERFORM PASS
094300         GO TO ADD-WRITE-F2-22.
094400     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
094500     MOVE 555577777777777777 TO CORRECT-18V0.
094600     PERFORM FAIL.
094700     GO TO ADD-WRITE-F2-22.
094800 ADD-DELETE-F2-22.
094900     PERFORM DE-LETE.
095000 ADD-WRITE-F2-22.
095100     MOVE "ADD-TEST-F2-22 " TO PAR-NAME.
095200     PERFORM PRINT-DETAIL.
095300*
095400 ADD-INIT-F2-23.
095500*    ==-->  NEW SIZE ERROR TESTS  <--==
095600     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
095700     MOVE     ZERO TO WRK-DS-10V00.
095800 ADD-TEST-F2-23.
095900     ADD      A12ONES-DS-12V00
096000              ZERO GIVING WRK-DS-10V00
096100              NOT ON SIZE ERROR
096200              MOVE "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
096300                   TO RE-MARK
096400              PERFORM FAIL GO TO ADD-WRITE-F2-23.
096500     GO       TO ADD-PASS-F2-23.
096600 ADD-DELETE-F2-23.
096700     PERFORM  DE-LETE.
096800     GO       TO ADD-WRITE-F2-23.
096900 ADD-PASS-F2-23.
097000     PERFORM  PASS.
097100 ADD-WRITE-F2-23.
097200     MOVE     "ADD-TEST-F2-23" TO PAR-NAME.
097300     PERFORM  PRINT-DETAIL.
097400*
097500 ADD-INIT-F2-24.
097600*    ==-->  NEW SIZE ERROR TESTS  <--==
097700     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
097800     MOVE     ZERO TO WRK-DS-06V06.
097900 ADD-TEST-F2-24.
098000     ADD      A12THREES-DS-06V06
098100              333333
098200              A06THREES-DS-03V03
098300              GIVING WRK-DS-06V06 ROUNDED
098400              NOT ON SIZE ERROR
098500              PERFORM PASS
098600              GO TO   ADD-WRITE-F2-24.
098700     GO TO    ADD-FAIL-F2-24.
098800 ADD-DELETE-F2-24.
098900     PERFORM  DE-LETE.
099000     GO       TO ADD-WRITE-F2-24.
099100 ADD-FAIL-F2-24.
099200     MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED" TO RE-MARK.
099300     PERFORM FAIL.
099400 ADD-WRITE-F2-24.
099500     MOVE     "ADD-TEST-F2-24" TO PAR-NAME.
099600     PERFORM  PRINT-DETAIL.
099700*
099800 ADD-INIT-F2-25.
099900*    ==-->  NEW SIZE ERROR TESTS  <--==
100000     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
100100     MOVE     ZERO TO WRK-DS-10V00.
100200 ADD-TEST-F2-25.
100300     ADD      A12ONES-DS-12V00
100400              ZERO GIVING WRK-DS-10V00
100500              ON SIZE ERROR
100600              GO TO ADD-PASS-F2-25
100700              NOT ON SIZE ERROR
100800              MOVE "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
100900                   TO RE-MARK
101000              PERFORM FAIL GO TO ADD-WRITE-F2-25.
101100 ADD-DELETE-F2-25.
101200     PERFORM  DE-LETE.
101300     GO       TO ADD-WRITE-F2-25.
101400 ADD-PASS-F2-25.
101500     PERFORM  PASS.
101600 ADD-WRITE-F2-25.
101700     MOVE     "ADD-TEST-F2-25" TO PAR-NAME.
101800     PERFORM  PRINT-DETAIL.
101900*
102000 ADD-INIT-F2-26.
102100*    ==-->  NEW SIZE ERROR TESTS  <--==
102200     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
102300     MOVE     ZERO TO WRK-DS-06V06.
102400 ADD-TEST-F2-26.
102500     ADD      A12THREES-DS-06V06
102600              333333
102700              A06THREES-DS-03V03
102800              GIVING WRK-DS-06V06 ROUNDED
102900              ON SIZE ERROR
103000              GO TO    ADD-FAIL-F2-26
103100              NOT ON SIZE ERROR
103200              PERFORM PASS
103300              GO TO   ADD-WRITE-F2-26.
103400 ADD-DELETE-F2-26.
103500     PERFORM  DE-LETE.
103600     GO       TO ADD-WRITE-F2-26.
103700 ADD-FAIL-F2-26.
103800     MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED" TO RE-MARK.
103900     PERFORM FAIL.
104000 ADD-WRITE-F2-26.
104100     MOVE     "ADD-TEST-F2-26" TO PAR-NAME.
104200     PERFORM  PRINT-DETAIL.
104300*
104400 ADD-INIT-F2-27.
104500*    ==-->  NEW SIZE ERROR TESTS  <--==
104600     MOVE   "VI-74 6.6.4 GR2" TO ANSI-REFERENCE.
104700     MOVE   "ADD-TEST-F2-27" TO PAR-NAME.
104800     MOVE    1    TO REC-CT.
104900     MOVE    1.1  TO WRK-DU-1V1-1.
105000     MOVE    2.3  TO WRK-DU-1V1-2.
105100     MOVE    ZERO TO WRK-DU-2V0-1.
105200     MOVE    ZERO TO WRK-DU-2V1-1.
105300     MOVE    ZERO TO WRK-DU-2V0-2.
105400     MOVE    ZERO TO WRK-DU-2V1-2.
105500     MOVE    ZERO TO WRK-DU-2V0-3.
105600     MOVE    ZERO TO WRK-DU-2V1-3.
105700 ADD-GIVING-TEST-F2-27-0.
105800     ADD WRK-DU-1V1-1 6 WRK-DU-1V1-2 GIVING WRK-DU-2V1-1
105900         WRK-DU-2V0-1 ROUNDED WRK-DU-2V1-2 WRK-DU-2V0-2 ROUNDED
106000         WRK-DU-2V1-3 WRK-DU-2V0-3.
106100     GO TO ADD-TEST-F2-27-1.
106200 ADD-DELETE-F2-27.
106300     PERFORM DE-LETE.
106400     PERFORM PRINT-DETAIL.
106500     GO TO   ADD-INIT-F2-28.
106600 ADD-TEST-F2-27-1.
106700     IF WRK-DU-2V1-1 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
106800     ELSE
106900     PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 9.4
107000         TO CORRECT-N PERFORM PRINT-DETAIL.
107100     ADD 1 TO REC-CT.
107200 ADD-TEST-F2-27-2.
107300     IF WRK-DU-2V0-1 = 9 PERFORM PASS PERFORM PRINT-DETAIL
107400     ELSE
107500     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 9
107600     TO CORRECT-N PERFORM PRINT-DETAIL.
107700     ADD 1 TO REC-CT.
107800 ADD-ADD-TEST-F2-27-3.
107900     IF WRK-DU-2V1-2 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
108000     ELSE
108100     PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 9.4
108200     TO CORRECT-N PERFORM PRINT-DETAIL.
108300     ADD 1 TO REC-CT.
108400 ADD-TEST-F2-27-4.
108500     IF WRK-DU-2V0-2 = 9 PERFORM PASS PERFORM PRINT-DETAIL
108600     ELSE
108700     PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 9
108800     TO CORRECT-N PERFORM PRINT-DETAIL.
108900     ADD 1 TO REC-CT.
109000 ADD-TEST-F2-27-5.
109100     IF WRK-DU-2V1-3 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
109200     ELSE
109300     PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 9.4
109400     TO CORRECT-N PERFORM PRINT-DETAIL.
109500     ADD 1 TO REC-CT.
109600 ADD-TEST-F2-27-6.
109700     IF WRK-DU-2V0-3 = 9 PERFORM PASS PERFORM PRINT-DETAIL
109800     ELSE
109900     PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 9
110000     TO CORRECT-N PERFORM PRINT-DETAIL.
110100*
110200 ADD-INIT-F2-28.
110300*    ==-->  NEW SIZE ERROR TESTS  <--==
110400*    ==-->      SIZE ERROR        <--==
110500     MOVE   "VI-67 6.4.2"    TO ANSI-REFERENCE.
110600     MOVE    1     TO REC-CT.
110700     MOVE    1.1   TO WRK-DU-1V1-1.
110800     MOVE    2.3   TO WRK-DU-1V1-2.
110900     MOVE    ZERO  TO WRK-DU-2V0-1.
111000     MOVE    ZERO  TO WRK-DU-2V1-1.
111100     MOVE    ZERO  TO WRK-DU-2V0-2.
111200     MOVE    ZERO  TO WRK-DU-2V1-2.
111300     MOVE    ZERO  TO WRK-DU-2V0-3.
111400     MOVE    ZERO  TO WRK-DU-2V1-3.
111500     MOVE    SPACE TO SIZE-ERR2.
111600 ADD-GIVING-TEST-F2-28-0.
111700     ADD     A17TWOS-DS-17V00
111800             WRK-DU-1V1-1
111900             6
112000             WRK-DU-1V1-2
112100      GIVING WRK-DU-2V1-1
112200         WRK-DU-2V0-1 ROUNDED WRK-DU-2V1-2 WRK-DU-2V0-2 ROUNDED
112300         WRK-DU-2V1-3 WRK-DU-2V0-3
112400         ON SIZE ERROR
112500            MOVE "A" TO SIZE-ERR2.
112600     GO TO  ADD-TEST-F2-28-1.
112700 ADD-DELETE-F2-28.
112800     PERFORM DE-LETE.
112900     PERFORM PRINT-DETAIL.
113000     GO TO   ADD-INIT-F2-29.
113100 ADD-TEST-F2-28-1.
113200     MOVE   "ADD-TEST-F2-28-1" TO PAR-NAME.
113300     IF WRK-DU-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
113400     ELSE
113500     PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE ZERO
113600         TO CORRECT-N PERFORM PRINT-DETAIL.
113700     ADD 1 TO REC-CT.
113800 ADD-TEST-F2-28-2.
113900     MOVE   "ADD-TEST-F2-28-2" TO PAR-NAME.
114000     IF WRK-DU-2V0-1 = ZERO  PERFORM PASS PERFORM PRINT-DETAIL
114100     ELSE
114200     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE ZERO
114300     TO CORRECT-N PERFORM PRINT-DETAIL.
114400     ADD 1 TO REC-CT.
114500 ADD-ADD-TEST-F2-28-3.
114600     MOVE   "ADD-TEST-F2-28-3" TO PAR-NAME.
114700     IF WRK-DU-2V1-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
114800     ELSE
114900     PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE ZERO
115000     TO CORRECT-N PERFORM PRINT-DETAIL.
115100     ADD 1 TO REC-CT.
115200 ADD-TEST-F2-28-4.
115300     MOVE   "ADD-TEST-F2-28-4" TO PAR-NAME.
115400     IF WRK-DU-2V0-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
115500     ELSE
115600     PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE ZERO
115700     TO CORRECT-N PERFORM PRINT-DETAIL.
115800     ADD 1 TO REC-CT.
115900 ADD-TEST-F2-28-5.
116000     MOVE   "ADD-TEST-F2-28-5" TO PAR-NAME.
116100     IF WRK-DU-2V1-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
116200     ELSE
116300     PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE ZERO
116400     TO CORRECT-N PERFORM PRINT-DETAIL.
116500     ADD 1 TO REC-CT.
116600 ADD-TEST-F2-28-6.
116700     MOVE   "ADD-TEST-F2-28-6" TO PAR-NAME.
116800     IF WRK-DU-2V0-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
116900     ELSE
117000     PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE ZERO
117100     TO CORRECT-N PERFORM PRINT-DETAIL.
117200     ADD 1 TO REC-CT.
117300 ADD-TEST-F2-28-7.
117400     MOVE   "ADD-TEST-F2-28-7" TO PAR-NAME.
117500     IF      SIZE-ERR2 = "A"
117600             PERFORM PASS
117700             PERFORM PRINT-DETAIL
117800     ELSE
117900             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
118000                  TO RE-MARK
118100             MOVE   "A"        TO CORRECT-X
118200             MOVE    SIZE-ERR2 TO COMPUTED-X
118300             PERFORM FAIL
118400             PERFORM PRINT-DETAIL.
118500*
118600 ADD-INIT-F2-29.
118700*    ==-->  NEW SIZE ERROR TESTS  <--==
118800*    ==-->   NO SIZE ERROR        <--==
118900     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
119000     MOVE    1     TO REC-CT.
119100     MOVE    1.1   TO WRK-DU-1V1-1.
119200     MOVE    2.3   TO WRK-DU-1V1-2.
119300     MOVE    ZERO  TO WRK-DU-2V0-1.
119400     MOVE    ZERO  TO WRK-DU-2V1-1.
119500     MOVE    ZERO  TO WRK-DU-2V0-2.
119600     MOVE    ZERO  TO WRK-DU-2V1-2.
119700     MOVE    ZERO  TO WRK-DU-2V0-3.
119800     MOVE    ZERO  TO WRK-DU-2V1-3.
119900     MOVE    SPACE TO SIZE-ERR2.
120000 ADD-GIVING-TEST-F2-29-0.
120100     ADD WRK-DU-1V1-1 6 WRK-DU-1V1-2 GIVING WRK-DU-2V1-1
120200         WRK-DU-2V0-1 ROUNDED WRK-DU-2V1-2 WRK-DU-2V0-2 ROUNDED
120300         WRK-DU-2V1-3 WRK-DU-2V0-3
120400         ON SIZE ERROR
120500            MOVE "A" TO SIZE-ERR2.
120600     GO TO  ADD-TEST-F2-29-1.
120700 ADD-DELETE-F2-29.
120800     PERFORM DE-LETE.
120900     PERFORM PRINT-DETAIL.
121000     GO TO   ADD-INIT-F2-30.
121100 ADD-TEST-F2-29-1.
121200     MOVE   "ADD-TEST-F2-29-1" TO PAR-NAME.
121300     IF WRK-DU-2V1-1 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
121400     ELSE
121500     PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 9.4
121600         TO CORRECT-N PERFORM PRINT-DETAIL.
121700     ADD 1 TO REC-CT.
121800 ADD-TEST-F2-29-2.
121900     MOVE   "ADD-TEST-F2-29-2" TO PAR-NAME.
122000     IF WRK-DU-2V0-1 = 9 PERFORM PASS PERFORM PRINT-DETAIL
122100     ELSE
122200     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 9
122300     TO CORRECT-N PERFORM PRINT-DETAIL.
122400     ADD 1 TO REC-CT.
122500 ADD-ADD-TEST-F2-29-3.
122600     MOVE   "ADD-TEST-F2-29-3" TO PAR-NAME.
122700     IF WRK-DU-2V1-2 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
122800     ELSE
122900     PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 9.4
123000     TO CORRECT-N PERFORM PRINT-DETAIL.
123100     ADD 1 TO REC-CT.
123200 ADD-TEST-F2-29-4.
123300     MOVE   "ADD-TEST-F2-29-4" TO PAR-NAME.
123400     IF WRK-DU-2V0-2 = 9 PERFORM PASS PERFORM PRINT-DETAIL
123500     ELSE
123600     PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 9
123700     TO CORRECT-N PERFORM PRINT-DETAIL.
123800     ADD 1 TO REC-CT.
123900 ADD-TEST-F2-29-5.
124000     MOVE   "ADD-TEST-F2-29-5" TO PAR-NAME.
124100     IF WRK-DU-2V1-3 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
124200     ELSE
124300     PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 9.4
124400     TO CORRECT-N PERFORM PRINT-DETAIL.
124500     ADD 1 TO REC-CT.
124600 ADD-TEST-F2-29-6.
124700     MOVE   "ADD-TEST-F2-29-6" TO PAR-NAME.
124800     IF WRK-DU-2V0-3 = 9 PERFORM PASS PERFORM PRINT-DETAIL
124900     ELSE
125000     PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 9
125100     TO CORRECT-N PERFORM PRINT-DETAIL.
125200     ADD 1 TO REC-CT.
125300 ADD-TEST-F2-29-7.
125400     MOVE   "ADD-TEST-F2-29-7" TO PAR-NAME.
125500     IF      SIZE-ERR2 = SPACE
125600             PERFORM PASS
125700             PERFORM PRINT-DETAIL
125800     ELSE
125900             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
126000                  TO RE-MARK
126100             MOVE    SPACE     TO CORRECT-X
126200             MOVE    SIZE-ERR2 TO COMPUTED-X
126300             PERFORM FAIL
126400             PERFORM PRINT-DETAIL.
126500*
126600 ADD-INIT-F2-30.
126700*    ==-->  NEW SIZE ERROR TESTS  <--==
126800*    ==-->      SIZE ERROR        <--==
126900     MOVE   "VI-67 6.4.2"    TO ANSI-REFERENCE.
127000     MOVE    1     TO REC-CT.
127100     MOVE    1.1   TO WRK-DU-1V1-1.
127200     MOVE    2.3   TO WRK-DU-1V1-2.
127300     MOVE    ZERO  TO WRK-DU-2V0-1.
127400     MOVE    ZERO  TO WRK-DU-2V1-1.
127500     MOVE    ZERO  TO WRK-DU-2V0-2.
127600     MOVE    ZERO  TO WRK-DU-2V1-2.
127700     MOVE    ZERO  TO WRK-DU-2V0-3.
127800     MOVE    ZERO  TO WRK-DU-2V1-3.
127900     MOVE    SPACE TO SIZE-ERR2.
128000 ADD-GIVING-TEST-F2-30-0.
128100     ADD     A17TWOS-DS-17V00
128200             WRK-DU-1V1-1
128300             6
128400             WRK-DU-1V1-2
128500      GIVING WRK-DU-2V1-1
128600         WRK-DU-2V0-1 ROUNDED WRK-DU-2V1-2 WRK-DU-2V0-2 ROUNDED
128700         WRK-DU-2V1-3 WRK-DU-2V0-3
128800      NOT ON SIZE ERROR
128900             MOVE "A" TO SIZE-ERR2.
129000     GO TO   ADD-TEST-F2-30-1.
129100 ADD-DELETE-F2-30.
129200     PERFORM DE-LETE.
129300     PERFORM PRINT-DETAIL.
129400     GO TO   ADD-INIT-F2-31.
129500 ADD-TEST-F2-30-1.
129600     MOVE   "ADD-TEST-F2-30-1" TO PAR-NAME.
129700     IF WRK-DU-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
129800     ELSE
129900     PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE ZERO
130000         TO CORRECT-N PERFORM PRINT-DETAIL.
130100     ADD 1 TO REC-CT.
130200 ADD-TEST-F2-30-2.
130300     MOVE   "ADD-TEST-F2-30-2" TO PAR-NAME.
130400     IF WRK-DU-2V0-1 = ZERO  PERFORM PASS PERFORM PRINT-DETAIL
130500     ELSE
130600     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE ZERO
130700     TO CORRECT-N PERFORM PRINT-DETAIL.
130800     ADD 1 TO REC-CT.
130900 ADD-ADD-TEST-F2-30-3.
131000     MOVE   "ADD-TEST-F2-30-3" TO PAR-NAME.
131100     IF WRK-DU-2V1-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
131200     ELSE
131300     PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE ZERO
131400     TO CORRECT-N PERFORM PRINT-DETAIL.
131500     ADD 1 TO REC-CT.
131600 ADD-TEST-F2-30-4.
131700     MOVE   "ADD-TEST-F2-30-4" TO PAR-NAME.
131800     IF WRK-DU-2V0-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
131900     ELSE
132000     PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE ZERO
132100     TO CORRECT-N PERFORM PRINT-DETAIL.
132200     ADD 1 TO REC-CT.
132300 ADD-TEST-F2-30-5.
132400     MOVE   "ADD-TEST-F2-30-5" TO PAR-NAME.
132500     IF WRK-DU-2V1-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
132600     ELSE
132700     PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE ZERO
132800     TO CORRECT-N PERFORM PRINT-DETAIL.
132900     ADD 1 TO REC-CT.
133000 ADD-TEST-F2-30-6.
133100     MOVE   "ADD-TEST-F2-30-6" TO PAR-NAME.
133200     IF WRK-DU-2V0-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
133300     ELSE
133400     PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE ZERO
133500     TO CORRECT-N PERFORM PRINT-DETAIL.
133600     ADD 1 TO REC-CT.
133700 ADD-TEST-F2-30-7.
133800     MOVE   "ADD-TEST-F2-30-7" TO PAR-NAME.
133900     IF      SIZE-ERR2 = SPACE
134000             PERFORM PASS
134100             PERFORM PRINT-DETAIL
134200     ELSE
134300             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
134400                  TO RE-MARK
134500             MOVE    SPACE     TO CORRECT-X
134600             MOVE    SIZE-ERR2 TO COMPUTED-X
134700             PERFORM FAIL
134800             PERFORM PRINT-DETAIL.
134900*
135000 ADD-INIT-F2-31.
135100*    ==-->  NEW SIZE ERROR TESTS  <--==
135200*    ==-->   NO SIZE ERROR        <--==
135300     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
135400     MOVE    1     TO REC-CT.
135500     MOVE    1.1   TO WRK-DU-1V1-1.
135600     MOVE    2.3   TO WRK-DU-1V1-2.
135700     MOVE    ZERO  TO WRK-DU-2V0-1.
135800     MOVE    ZERO  TO WRK-DU-2V1-1.
135900     MOVE    ZERO  TO WRK-DU-2V0-2.
136000     MOVE    ZERO  TO WRK-DU-2V1-2.
136100     MOVE    ZERO  TO WRK-DU-2V0-3.
136200     MOVE    ZERO  TO WRK-DU-2V1-3.
136300     MOVE    SPACE TO SIZE-ERR2.
136400 ADD-GIVING-TEST-F2-31-0.
136500     ADD WRK-DU-1V1-1 6 WRK-DU-1V1-2 GIVING WRK-DU-2V1-1
136600         WRK-DU-2V0-1 ROUNDED WRK-DU-2V1-2 WRK-DU-2V0-2 ROUNDED
136700         WRK-DU-2V1-3 WRK-DU-2V0-3
136800      NOT ON SIZE ERROR
136900             MOVE "A" TO SIZE-ERR2.
137000     GO TO   ADD-TEST-F2-31-1.
137100 ADD-DELETE-F2-31.
137200     PERFORM DE-LETE.
137300     PERFORM PRINT-DETAIL.
137400     GO TO   ADD-INIT-F2-32.
137500 ADD-TEST-F2-31-1.
137600     MOVE   "ADD-TEST-F2-31-1" TO PAR-NAME.
137700     IF WRK-DU-2V1-1 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
137800     ELSE
137900     PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 9.4
138000         TO CORRECT-N PERFORM PRINT-DETAIL.
138100     ADD 1 TO REC-CT.
138200 ADD-TEST-F2-31-2.
138300     MOVE   "ADD-TEST-F2-31-2" TO PAR-NAME.
138400     IF WRK-DU-2V0-1 = 9 PERFORM PASS PERFORM PRINT-DETAIL
138500     ELSE
138600     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 9
138700     TO CORRECT-N PERFORM PRINT-DETAIL.
138800     ADD 1 TO REC-CT.
138900 ADD-ADD-TEST-F2-31-3.
139000     MOVE   "ADD-TEST-F2-31-3" TO PAR-NAME.
139100     IF WRK-DU-2V1-2 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
139200     ELSE
139300     PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 9.4
139400     TO CORRECT-N PERFORM PRINT-DETAIL.
139500     ADD 1 TO REC-CT.
139600 ADD-TEST-F2-31-4.
139700     MOVE   "ADD-TEST-F2-31-4" TO PAR-NAME.
139800     IF WRK-DU-2V0-2 = 9 PERFORM PASS PERFORM PRINT-DETAIL
139900     ELSE
140000     PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 9
140100     TO CORRECT-N PERFORM PRINT-DETAIL.
140200     ADD 1 TO REC-CT.
140300 ADD-TEST-F2-31-5.
140400     MOVE   "ADD-TEST-F2-31-5" TO PAR-NAME.
140500     IF WRK-DU-2V1-3 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
140600     ELSE
140700     PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 9.4
140800     TO CORRECT-N PERFORM PRINT-DETAIL.
140900     ADD 1 TO REC-CT.
141000 ADD-TEST-F2-31-6.
141100     MOVE   "ADD-TEST-F2-31-6" TO PAR-NAME.
141200     IF WRK-DU-2V0-3 = 9 PERFORM PASS PERFORM PRINT-DETAIL
141300     ELSE
141400     PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 9
141500     TO CORRECT-N PERFORM PRINT-DETAIL.
141600     ADD 1 TO REC-CT.
141700 ADD-TEST-F2-31-7.
141800     MOVE   "ADD-TEST-F2-31-7" TO PAR-NAME.
141900     IF      SIZE-ERR2 = "A"
142000             PERFORM PASS
142100             PERFORM PRINT-DETAIL
142200     ELSE
142300             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
142400                  TO RE-MARK
142500             MOVE   "A"        TO CORRECT-X
142600             MOVE    SIZE-ERR2 TO COMPUTED-X
142700             PERFORM FAIL
142800             PERFORM PRINT-DETAIL.
142900*
143000 ADD-INIT-F2-32.
143100*    ==-->  NEW SIZE ERROR TESTS  <--==
143200*    ==-->      SIZE ERROR        <--==
143300     MOVE   "VI-67 6.4.2"    TO ANSI-REFERENCE.
143400     MOVE    1     TO REC-CT.
143500     MOVE    1.1   TO WRK-DU-1V1-1.
143600     MOVE    2.3   TO WRK-DU-1V1-2.
143700     MOVE    ZERO  TO WRK-DU-2V0-1.
143800     MOVE    ZERO  TO WRK-DU-2V1-1.
143900     MOVE    ZERO  TO WRK-DU-2V0-2.
144000     MOVE    ZERO  TO WRK-DU-2V1-2.
144100     MOVE    ZERO  TO WRK-DU-2V0-3.
144200     MOVE    ZERO  TO WRK-DU-2V1-3.
144300     MOVE    SPACE TO SIZE-ERR2.
144400 ADD-GIVING-TEST-F2-32-0.
144500     ADD     A17TWOS-DS-17V00
144600             WRK-DU-1V1-1
144700             6
144800             WRK-DU-1V1-2
144900      GIVING WRK-DU-2V1-1
145000         WRK-DU-2V0-1 ROUNDED WRK-DU-2V1-2 WRK-DU-2V0-2 ROUNDED
145100         WRK-DU-2V1-3 WRK-DU-2V0-3
145200          ON SIZE ERROR
145300             MOVE "A" TO SIZE-ERR2
145400      NOT ON SIZE ERROR
145500             MOVE "B" TO SIZE-ERR2.
145600     GO TO   ADD-TEST-F2-32-1.
145700 ADD-DELETE-F2-32.
145800     PERFORM DE-LETE.
145900     PERFORM PRINT-DETAIL.
146000     GO TO   ADD-INIT-F2-33.
146100 ADD-TEST-F2-32-1.
146200     MOVE   "ADD-TEST-F2-32-1" TO PAR-NAME.
146300     IF WRK-DU-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
146400     ELSE
146500     PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE ZERO
146600         TO CORRECT-N PERFORM PRINT-DETAIL.
146700     ADD 1 TO REC-CT.
146800 ADD-TEST-F2-32-2.
146900     MOVE   "ADD-TEST-F2-32-2" TO PAR-NAME.
147000     IF WRK-DU-2V0-1 = ZERO  PERFORM PASS PERFORM PRINT-DETAIL
147100     ELSE
147200     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE ZERO
147300     TO CORRECT-N PERFORM PRINT-DETAIL.
147400     ADD 1 TO REC-CT.
147500 ADD-ADD-TEST-F2-32-3.
147600     MOVE   "ADD-TEST-F2-32-3" TO PAR-NAME.
147700     IF WRK-DU-2V1-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
147800     ELSE
147900     PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE ZERO
148000     TO CORRECT-N PERFORM PRINT-DETAIL.
148100     ADD 1 TO REC-CT.
148200 ADD-TEST-F2-32-4.
148300     MOVE   "ADD-TEST-F2-32-4" TO PAR-NAME.
148400     IF WRK-DU-2V0-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
148500     ELSE
148600     PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE ZERO
148700     TO CORRECT-N PERFORM PRINT-DETAIL.
148800     ADD 1 TO REC-CT.
148900 ADD-TEST-F2-32-5.
149000     MOVE   "ADD-TEST-F2-32-5" TO PAR-NAME.
149100     IF WRK-DU-2V1-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
149200     ELSE
149300     PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE ZERO
149400     TO CORRECT-N PERFORM PRINT-DETAIL.
149500     ADD 1 TO REC-CT.
149600 ADD-TEST-F2-32-6.
149700     MOVE   "ADD-TEST-F2-32-6" TO PAR-NAME.
149800     IF WRK-DU-2V0-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
149900     ELSE
150000     PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE ZERO
150100     TO CORRECT-N PERFORM PRINT-DETAIL.
150200     ADD 1 TO REC-CT.
150300 ADD-TEST-F2-32-7.
150400     MOVE   "ADD-TEST-F2-32-7" TO PAR-NAME.
150500     IF      SIZE-ERR2 = "A"
150600             PERFORM PASS
150700             PERFORM PRINT-DETAIL
150800     ELSE
150900             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
151000                  TO RE-MARK
151100             MOVE   "A"        TO CORRECT-X
151200             MOVE    SIZE-ERR2 TO COMPUTED-X
151300             PERFORM FAIL
151400             PERFORM PRINT-DETAIL.
151500*
151600 ADD-INIT-F2-33.
151700*    ==-->  NEW SIZE ERROR TESTS  <--==
151800*    ==-->   NO SIZE ERROR        <--==
151900     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
152000     MOVE    1     TO REC-CT.
152100     MOVE    1.1   TO WRK-DU-1V1-1.
152200     MOVE    2.3   TO WRK-DU-1V1-2.
152300     MOVE    ZERO  TO WRK-DU-2V0-1.
152400     MOVE    ZERO  TO WRK-DU-2V1-1.
152500     MOVE    ZERO  TO WRK-DU-2V0-2.
152600     MOVE    ZERO  TO WRK-DU-2V1-2.
152700     MOVE    ZERO  TO WRK-DU-2V0-3.
152800     MOVE    ZERO  TO WRK-DU-2V1-3.
152900     MOVE    SPACE TO SIZE-ERR2.
153000 ADD-GIVING-TEST-F2-33-0.
153100     ADD WRK-DU-1V1-1 6 WRK-DU-1V1-2 GIVING WRK-DU-2V1-1
153200         WRK-DU-2V0-1 ROUNDED WRK-DU-2V1-2 WRK-DU-2V0-2 ROUNDED
153300         WRK-DU-2V1-3 WRK-DU-2V0-3
153400          ON SIZE ERROR
153500             MOVE "A" TO SIZE-ERR2
153600      NOT ON SIZE ERROR
153700             MOVE "B" TO SIZE-ERR2.
153800     GO TO   ADD-TEST-F2-33-1.
153900 ADD-DELETE-F2-33.
154000     PERFORM DE-LETE.
154100     PERFORM PRINT-DETAIL.
154200     GO TO   ADD-INIT-F2-34.
154300 ADD-TEST-F2-33-1.
154400     MOVE   "ADD-TEST-F2-33-1" TO PAR-NAME.
154500     IF WRK-DU-2V1-1 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
154600     ELSE
154700     PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 9.4
154800         TO CORRECT-N PERFORM PRINT-DETAIL.
154900     ADD 1 TO REC-CT.
155000 ADD-TEST-F2-33-2.
155100     MOVE   "ADD-TEST-F2-33-2" TO PAR-NAME.
155200     IF WRK-DU-2V0-1 = 9 PERFORM PASS PERFORM PRINT-DETAIL
155300     ELSE
155400     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 9
155500     TO CORRECT-N PERFORM PRINT-DETAIL.
155600     ADD 1 TO REC-CT.
155700 ADD-ADD-TEST-F2-33-3.
155800     MOVE   "ADD-TEST-F2-33-3" TO PAR-NAME.
155900     IF WRK-DU-2V1-2 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
156000     ELSE
156100     PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 9.4
156200     TO CORRECT-N PERFORM PRINT-DETAIL.
156300     ADD 1 TO REC-CT.
156400 ADD-TEST-F2-33-4.
156500     MOVE   "ADD-TEST-F2-33-4" TO PAR-NAME.
156600     IF WRK-DU-2V0-2 = 9 PERFORM PASS PERFORM PRINT-DETAIL
156700     ELSE
156800     PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 9
156900     TO CORRECT-N PERFORM PRINT-DETAIL.
157000     ADD 1 TO REC-CT.
157100 ADD-TEST-F2-33-5.
157200     MOVE   "ADD-TEST-F2-33-5" TO PAR-NAME.
157300     IF WRK-DU-2V1-3 = 9.4 PERFORM PASS PERFORM PRINT-DETAIL
157400     ELSE
157500     PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 9.4
157600     TO CORRECT-N PERFORM PRINT-DETAIL.
157700     ADD 1 TO REC-CT.
157800 ADD-TEST-F2-33-6.
157900     MOVE   "ADD-TEST-F2-33-6" TO PAR-NAME.
158000     IF WRK-DU-2V0-3 = 9 PERFORM PASS PERFORM PRINT-DETAIL
158100     ELSE
158200     PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 9
158300     TO CORRECT-N PERFORM PRINT-DETAIL.
158400     ADD 1 TO REC-CT.
158500 ADD-TEST-F2-33-7.
158600     MOVE   "ADD-TEST-F2-33-7" TO PAR-NAME.
158700     IF      SIZE-ERR2 = "B"
158800             PERFORM PASS
158900             PERFORM PRINT-DETAIL
159000     ELSE
159100             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
159200                  TO RE-MARK
159300             MOVE   "B"        TO CORRECT-X
159400             MOVE    SIZE-ERR2 TO COMPUTED-X
159500             PERFORM FAIL
159600             PERFORM PRINT-DETAIL.
159700*
159800 ADD-INIT-F2-34.
159900*    ==-->EXPLICIT SCOPE TERMINATOR<--==
160000*    ==-->      SIZE ERROR        <--==
160100     MOVE   "VI-67 6.4.3" TO ANSI-REFERENCE.
160200     MOVE   "ADD-TEST-F2-34" TO PAR-NAME.
160300     MOVE    ZERO  TO WRK-DS-10V00.
160400     MOVE    1     TO REC-CT.
160500     MOVE    SPACE TO WRK-XN-00001.
160600     MOVE    SPACE TO SIZE-ERR2.
160700     MOVE    SPACE TO SIZE-ERR3.
160800     MOVE    SPACE TO SIZE-ERR4.
160900 ADD-TEST-F2-34-0.
161000     ADD     A12ONES-DS-12V00
161100             ZERO
161200      GIVING WRK-DS-10V00
161300          ON SIZE ERROR
161400             MOVE "A" TO SIZE-ERR2
161500             MOVE "B" TO SIZE-ERR3
161600             MOVE "C" TO SIZE-ERR4
161700     END-ADD
161800     MOVE   "1" TO WRK-XN-00001.
161900     GO TO   ADD-TEST-F2-34-1.
162000 ADD-DELETE-F2-34.
162100     PERFORM DE-LETE.
162200     PERFORM PRINT-DETAIL.
162300     GO TO   ADD-INIT-F2-35.
162400 ADD-TEST-F2-34-1.
162500     MOVE   "ADD-TEST-F2-34-1" TO PAR-NAME.
162600     IF      SIZE-ERR2 = "A"
162700             PERFORM PASS
162800             PERFORM PRINT-DETAIL
162900     ELSE
163000             MOVE   "A"        TO CORRECT-X
163100             MOVE    SIZE-ERR2 TO COMPUTED-X
163200             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
163300                  TO RE-MARK
163400             PERFORM FAIL
163500             PERFORM PRINT-DETAIL.
163600     ADD     1 TO REC-CT.
163700 ADD-TEST-F2-34-2.
163800     MOVE   "ADD-TEST-F2-34-2" TO PAR-NAME.
163900     IF      SIZE-ERR3 = "B"
164000             PERFORM PASS
164100             PERFORM PRINT-DETAIL
164200     ELSE
164300             MOVE   "B"        TO CORRECT-X
164400             MOVE    SIZE-ERR3 TO COMPUTED-X
164500             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
164600                  TO RE-MARK
164700             PERFORM FAIL
164800             PERFORM PRINT-DETAIL.
164900     ADD     1 TO REC-CT.
165000 ADD-TEST-F2-34-3.
165100     MOVE   "ADD-TEST-F2-34-3" TO PAR-NAME.
165200     IF      SIZE-ERR4 = "C"
165300             PERFORM PASS
165400             PERFORM PRINT-DETAIL
165500     ELSE
165600             MOVE   "C"        TO CORRECT-X
165700             MOVE    SIZE-ERR4 TO COMPUTED-X
165800             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
165900                  TO RE-MARK
166000             PERFORM FAIL
166100             PERFORM PRINT-DETAIL.
166200     ADD     1 TO REC-CT.
166300 ADD-TEST-F2-34-4.
166400     MOVE   "ADD-TEST-F2-34-4" TO PAR-NAME.
166500     IF      WRK-XN-00001 = "1"
166600             PERFORM PASS
166700             PERFORM PRINT-DETAIL
166800     ELSE
166900             MOVE   "1"           TO CORRECT-X
167000             MOVE    WRK-XN-00001 TO COMPUTED-X
167100             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
167200             PERFORM FAIL
167300             PERFORM PRINT-DETAIL.
167400     ADD     1 TO REC-CT.
167500 ADD-TEST-F2-34-5.
167600     MOVE   "ADD-TEST-F2-34-5" TO PAR-NAME.
167700     IF      WRK-DS-10V00  = ZERO
167800             PERFORM PASS
167900             PERFORM PRINT-DETAIL
168000     ELSE
168100             MOVE    ZERO         TO CORRECT-N
168200             MOVE    WRK-DS-10V00 TO COMPUTED-N
168300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
168400                  TO RE-MARK
168500             PERFORM FAIL
168600             PERFORM PRINT-DETAIL.
168700*
168800 ADD-INIT-F2-35.
168900*    ==-->EXPLICIT SCOPE TERMINATOR<--==
169000*    ==-->   NO SIZE ERROR        <--==
169100     MOVE   "VI-67 6.4.3" TO ANSI-REFERENCE.
169200     MOVE   "ADD-TEST-F2-35" TO PAR-NAME.
169300     MOVE    1     TO REC-CT.
169400     MOVE    SPACE TO WRK-XN-00001.
169500     MOVE    SPACE TO SIZE-ERR2.
169600     MOVE    SPACE TO SIZE-ERR3.
169700     MOVE    SPACE TO SIZE-ERR4.
169800     MOVE     ZERO TO WRK-DS-06V06.
169900 ADD-TEST-F2-35-0.
170000     ADD     A12THREES-DS-06V06
170100             333333
170200             A06THREES-DS-03V03
170300      GIVING WRK-DS-06V06 ROUNDED
170400          ON SIZE ERROR
170500             MOVE "A" TO SIZE-ERR2
170600             MOVE "B" TO SIZE-ERR3
170700             MOVE "C" TO SIZE-ERR4
170800     END-ADD
170900     MOVE   "1" TO WRK-XN-00001.
171000     GO TO   ADD-TEST-F2-35-1.
171100 ADD-DELETE-F2-35.
171200     PERFORM DE-LETE.
171300     PERFORM PRINT-DETAIL.
171400     GO TO   ADD-INIT-F2-36.
171500 ADD-TEST-F2-35-1.
171600     MOVE   "ADD-TEST-F2-35-1" TO PAR-NAME.
171700     IF      SIZE-ERR2 = SPACE
171800             PERFORM PASS
171900             PERFORM PRINT-DETAIL
172000     ELSE
172100             MOVE    SPACE     TO CORRECT-X
172200             MOVE    SIZE-ERR2 TO COMPUTED-X
172300             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
172400                  TO RE-MARK
172500             PERFORM FAIL
172600             PERFORM PRINT-DETAIL.
172700     ADD     1 TO REC-CT.
172800 ADD-TEST-F2-35-2.
172900     MOVE   "ADD-TEST-F2-35-2" TO PAR-NAME.
173000     IF      SIZE-ERR3 = SPACE
173100             PERFORM PASS
173200             PERFORM PRINT-DETAIL
173300     ELSE
173400             MOVE    SPACE     TO CORRECT-X
173500             MOVE    SIZE-ERR3 TO COMPUTED-X
173600             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
173700                  TO RE-MARK
173800             PERFORM FAIL
173900             PERFORM PRINT-DETAIL.
174000     ADD     1 TO REC-CT.
174100 ADD-TEST-F2-35-3.
174200     MOVE   "ADD-TEST-F2-35-3" TO PAR-NAME.
174300     IF      SIZE-ERR4 = SPACE
174400             PERFORM PASS
174500             PERFORM PRINT-DETAIL
174600     ELSE
174700             MOVE   "C"        TO CORRECT-X
174800             MOVE    SIZE-ERR4 TO COMPUTED-X
174900             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
175000                  TO RE-MARK
175100             PERFORM FAIL
175200             PERFORM PRINT-DETAIL.
175300     ADD     1 TO REC-CT.
175400 ADD-TEST-F2-35-4.
175500     MOVE   "ADD-TEST-F2-35-4" TO PAR-NAME.
175600     IF      WRK-XN-00001 = "1"
175700             PERFORM PASS
175800             PERFORM PRINT-DETAIL
175900     ELSE
176000             MOVE   "1"           TO CORRECT-X
176100             MOVE    WRK-XN-00001 TO COMPUTED-X
176200             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
176300             PERFORM FAIL
176400             PERFORM PRINT-DETAIL
176500     ADD     1 TO REC-CT.
176600 ADD-TEST-F2-35-5.
176700     MOVE   "ADD-TEST-F2-35-5" TO PAR-NAME.
176800     IF      WRK-DS-06V06 = 666999.666333
176900             PERFORM PASS
177000             PERFORM PRINT-DETAIL
177100     ELSE
177200             MOVE    666999.666333 TO CORRECT-N
177300             MOVE    WRK-DS-06V06  TO COMPUTED-N
177400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
177500                  TO RE-MARK
177600             PERFORM FAIL
177700             PERFORM PRINT-DETAIL.
177800*
177900 ADD-INIT-F2-36.
178000*    ==-->EXPLICIT SCOPE TERMINATOR<--==
178100*    ==-->      SIZE ERROR        <--==
178200     MOVE   "VI-67 6.4.3" TO ANSI-REFERENCE.
178300     MOVE   "ADD-TEST-F2-36" TO PAR-NAME.
178400     MOVE    ZERO  TO WRK-DS-10V00.
178500     MOVE    1     TO REC-CT.
178600     MOVE    SPACE TO WRK-XN-00001.
178700     MOVE    SPACE TO SIZE-ERR2.
178800     MOVE    SPACE TO SIZE-ERR3.
178900     MOVE    SPACE TO SIZE-ERR4.
179000 ADD-TEST-F2-36-0.
179100     ADD     A12ONES-DS-12V00
179200             ZERO
179300      GIVING WRK-DS-10V00
179400      NOT ON SIZE ERROR
179500             MOVE "A" TO SIZE-ERR2
179600             MOVE "B" TO SIZE-ERR3
179700             MOVE "C" TO SIZE-ERR4
179800     END-ADD
179900     MOVE   "1" TO WRK-XN-00001.
180000     GO TO   ADD-TEST-F2-36-1.
180100 ADD-DELETE-F2-36.
180200     PERFORM DE-LETE.
180300     PERFORM PRINT-DETAIL.
180400     GO TO   ADD-INIT-F2-37.
180500 ADD-TEST-F2-36-1.
180600     MOVE   "ADD-TEST-F2-36-1" TO PAR-NAME.
180700     IF      SIZE-ERR2 = SPACE
180800             PERFORM PASS
180900             PERFORM PRINT-DETAIL
181000     ELSE
181100             MOVE    SPACE     TO CORRECT-X
181200             MOVE    SIZE-ERR2 TO COMPUTED-X
181300             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
181400                  TO RE-MARK
181500             PERFORM FAIL
181600             PERFORM PRINT-DETAIL.
181700     ADD     1 TO REC-CT.
181800 ADD-TEST-F2-36-2.
181900     MOVE   "ADD-TEST-F2-36-2" TO PAR-NAME.
182000     IF      SIZE-ERR3 = SPACE
182100             PERFORM PASS
182200             PERFORM PRINT-DETAIL
182300     ELSE
182400             MOVE    SPACE     TO CORRECT-X
182500             MOVE    SIZE-ERR3 TO COMPUTED-X
182600             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
182700                  TO RE-MARK
182800             PERFORM FAIL
182900             PERFORM PRINT-DETAIL.
183000     ADD     1 TO REC-CT.
183100 ADD-TEST-F2-36-3.
183200     MOVE   "ADD-TEST-F2-36-3" TO PAR-NAME.
183300     IF      SIZE-ERR4 = SPACE
183400             PERFORM PASS
183500             PERFORM PRINT-DETAIL
183600     ELSE
183700             MOVE    SPACE     TO CORRECT-X
183800             MOVE    SIZE-ERR4 TO COMPUTED-X
183900             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
184000                  TO RE-MARK
184100             PERFORM FAIL
184200             PERFORM PRINT-DETAIL.
184300     ADD     1 TO REC-CT.
184400 ADD-TEST-F2-36-4.
184500     MOVE   "ADD-TEST-F2-36-4" TO PAR-NAME.
184600     IF      WRK-XN-00001 = "1"
184700             PERFORM PASS
184800             PERFORM PRINT-DETAIL
184900     ELSE
185000             MOVE   "1"           TO CORRECT-X
185100             MOVE    WRK-XN-00001 TO COMPUTED-X
185200             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
185300             PERFORM FAIL
185400             PERFORM PRINT-DETAIL.
185500     ADD     1 TO REC-CT.
185600 ADD-TEST-F2-36-5.
185700     MOVE   "ADD-TEST-F2-36-5" TO PAR-NAME.
185800     IF      WRK-DS-10V00 = ZERO
185900             PERFORM PASS
186000             PERFORM PRINT-DETAIL
186100     ELSE
186200             MOVE    ZERO         TO CORRECT-N
186300             MOVE    WRK-DS-10V00 TO COMPUTED-N
186400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
186500                  TO RE-MARK
186600             PERFORM FAIL
186700             PERFORM PRINT-DETAIL.
186800*
186900 ADD-INIT-F2-37.
187000*    ==-->EXPLICIT SCOPE TERMINATOR<--==
187100*    ==-->   NO SIZE ERROR        <--==
187200     MOVE   "VI-67 6.4.3" TO ANSI-REFERENCE.
187300     MOVE   "ADD-TEST-F2-37" TO PAR-NAME.
187400     MOVE    1     TO REC-CT.
187500     MOVE    SPACE TO WRK-XN-00001.
187600     MOVE    SPACE TO SIZE-ERR2.
187700     MOVE    SPACE TO SIZE-ERR3.
187800     MOVE    SPACE TO SIZE-ERR4.
187900     MOVE     ZERO TO WRK-DS-06V06.
188000 ADD-TEST-F2-37-0.
188100     ADD     A12THREES-DS-06V06
188200             333333
188300             A06THREES-DS-03V03
188400      GIVING WRK-DS-06V06 ROUNDED
188500      NOT ON SIZE ERROR
188600             MOVE "A" TO SIZE-ERR2
188700             MOVE "B" TO SIZE-ERR3
188800             MOVE "C" TO SIZE-ERR4
188900     END-ADD
189000     MOVE   "1" TO WRK-XN-00001.
189100     GO TO   ADD-TEST-F2-37-1.
189200 ADD-DELETE-F2-37.
189300     PERFORM DE-LETE.
189400     PERFORM PRINT-DETAIL.
189500     GO TO   ADD-INIT-F2-38.
189600 ADD-TEST-F2-37-1.
189700     MOVE   "ADD-TEST-F2-37-1" TO PAR-NAME.
189800     IF      SIZE-ERR2 = "A"
189900             PERFORM PASS
190000             PERFORM PRINT-DETAIL
190100     ELSE
190200             MOVE   "A"        TO CORRECT-X
190300             MOVE    SIZE-ERR2 TO COMPUTED-X
190400             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
190500                  TO RE-MARK
190600             PERFORM FAIL
190700             PERFORM PRINT-DETAIL.
190800     ADD     1 TO REC-CT.
190900 ADD-TEST-F2-37-2.
191000     MOVE   "ADD-TEST-F2-37-2" TO PAR-NAME.
191100     IF      SIZE-ERR3 = "B"
191200             PERFORM PASS
191300             PERFORM PRINT-DETAIL
191400     ELSE
191500             MOVE   "B"        TO CORRECT-X
191600             MOVE    SIZE-ERR3 TO COMPUTED-X
191700             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
191800                  TO RE-MARK
191900             PERFORM FAIL
192000             PERFORM PRINT-DETAIL.
192100     ADD     1 TO REC-CT.
192200 ADD-TEST-F2-37-3.
192300     MOVE   "ADD-TEST-F2-37-3" TO PAR-NAME
192400     IF      SIZE-ERR4 = "C"
192500             PERFORM PASS
192600             PERFORM PRINT-DETAIL
192700     ELSE
192800             MOVE   "C"        TO CORRECT-X
192900             MOVE    SIZE-ERR4 TO COMPUTED-X
193000             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
193100                  TO RE-MARK
193200             PERFORM FAIL
193300             PERFORM PRINT-DETAIL.
193400     ADD     1 TO REC-CT.
193500 ADD-TEST-F2-37-4.
193600     MOVE   "ADD-TEST-F2-37-4" TO PAR-NAME.
193700     IF      WRK-XN-00001 = "1"
193800             PERFORM PASS
193900             PERFORM PRINT-DETAIL
194000     ELSE
194100             MOVE   "1"           TO CORRECT-X
194200             MOVE    WRK-XN-00001 TO COMPUTED-X
194300             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
194400             PERFORM FAIL
194500             PERFORM PRINT-DETAIL.
194600     ADD     1 TO REC-CT.
194700 ADD-TEST-F2-37-5.
194800     MOVE   "ADD-TEST-F2-37-5" TO PAR-NAME.
194900     IF      WRK-DS-06V06 = 666999.666333
195000             PERFORM PASS
195100             PERFORM PRINT-DETAIL
195200     ELSE
195300             MOVE    666999.666333 TO CORRECT-N
195400             MOVE    WRK-DS-06V06  TO COMPUTED-N
195500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
195600                  TO RE-MARK
195700             PERFORM FAIL
195800             PERFORM PRINT-DETAIL.
195900*
196000 ADD-INIT-F2-38.
196100*    ==-->EXPLICIT SCOPE TERMINATOR<--==
196200*    ==-->      SIZE ERROR        <--==
196300     MOVE   "VI-67 6.4.3" TO ANSI-REFERENCE.
196400     MOVE   "ADD-TEST-F2-38" TO PAR-NAME.
196500     MOVE    ZERO  TO WRK-DS-10V00.
196600     MOVE    1     TO REC-CT.
196700     MOVE    SPACE TO WRK-XN-00001.
196800     MOVE    SPACE TO SIZE-ERR2.
196900     MOVE    SPACE TO SIZE-ERR3.
197000     MOVE    SPACE TO SIZE-ERR4.
197100 ADD-TEST-F2-38-0.
197200     ADD     A12ONES-DS-12V00
197300             ZERO
197400      GIVING WRK-DS-10V00
197500          ON SIZE ERROR
197600             MOVE "A" TO SIZE-ERR2
197700      NOT ON SIZE ERROR
197800             MOVE "X" TO SIZE-ERR2
197900     END-ADD
198000     MOVE   "1" TO WRK-XN-00001.
198100     GO TO   ADD-TEST-F2-38-1.
198200 ADD-DELETE-F2-38.
198300     PERFORM DE-LETE.
198400     PERFORM PRINT-DETAIL.
198500     GO TO   ADD-INIT-F2-39.
198600 ADD-TEST-F2-38-1.
198700     MOVE   "ADD-TEST-F2-38-1" TO PAR-NAME.
198800     IF      SIZE-ERR2 = "A"
198900             PERFORM PASS
199000             PERFORM PRINT-DETAIL
199100     ELSE
199200             MOVE   "A"        TO CORRECT-X
199300             MOVE    SIZE-ERR2 TO COMPUTED-X
199400             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
199500                  TO RE-MARK
199600             PERFORM FAIL
199700             PERFORM PRINT-DETAIL.
199800     ADD     1 TO REC-CT.
199900 ADD-TEST-F2-38-2.
200000     MOVE   "ADD-TEST-F2-38-2" TO PAR-NAME.
200100     IF      WRK-XN-00001 = "1"
200200             PERFORM PASS
200300             PERFORM PRINT-DETAIL
200400     ELSE
200500             MOVE   "1"           TO CORRECT-X
200600             MOVE    WRK-XN-00001 TO COMPUTED-X
200700             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
200800             PERFORM FAIL
200900             PERFORM PRINT-DETAIL.
201000     ADD     1 TO REC-CT.
201100 ADD-TEST-F2-38-3.
201200     MOVE   "ADD-TEST-F2-38-3" TO PAR-NAME.
201300     IF      WRK-DS-10V00 = ZERO
201400             PERFORM PASS
201500             PERFORM PRINT-DETAIL
201600     ELSE
201700             MOVE    ZERO         TO CORRECT-N
201800             MOVE    WRK-DS-10V00 TO COMPUTED-N
201900             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
202000                  TO RE-MARK
202100             PERFORM FAIL
202200             PERFORM PRINT-DETAIL.
202300*
202400 ADD-INIT-F2-39.
202500*    ==-->EXPLICIT SCOPE TERMINATOR<--==
202600*    ==-->    NO SIZE ERROR        <--==
202700     MOVE   "VI-67 6.4.3" TO ANSI-REFERENCE.
202800     MOVE   "ADD-TEST-F2-39" TO PAR-NAME.
202900     MOVE    1     TO REC-CT.
203000     MOVE    SPACE TO WRK-XN-00001.
203100     MOVE    SPACE TO SIZE-ERR2.
203200     MOVE    SPACE TO SIZE-ERR3.
203300     MOVE    SPACE TO SIZE-ERR4.
203400     MOVE     ZERO TO WRK-DS-06V06.
203500 ADD-TEST-F2-39-0.
203600     ADD     A12THREES-DS-06V06
203700             333333
203800             A06THREES-DS-03V03
203900      GIVING WRK-DS-06V06 ROUNDED
204000          ON SIZE ERROR
204100             MOVE "1" TO SIZE-ERR2
204200      NOT ON SIZE ERROR
204300             MOVE "A" TO SIZE-ERR2
204400     END-ADD
204500     MOVE   "1" TO WRK-XN-00001.
204600     GO TO   ADD-TEST-F2-39-1.
204700 ADD-DELETE-F2-39.
204800     PERFORM DE-LETE.
204900     PERFORM PRINT-DETAIL.
205000     GO TO   ADD-INIT-F2-40.
205100 ADD-TEST-F2-39-1.
205200     MOVE   "ADD-TEST-F2-39-1" TO PAR-NAME.
205300     IF      SIZE-ERR2 = "A"
205400             PERFORM PASS
205500             PERFORM PRINT-DETAIL
205600     ELSE
205700             MOVE   "A"        TO CORRECT-X
205800             MOVE    SIZE-ERR2 TO COMPUTED-X
205900             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
206000                  TO RE-MARK
206100             PERFORM FAIL
206200             PERFORM PRINT-DETAIL.
206300     ADD     1 TO REC-CT.
206400 ADD-TEST-F2-39-2.
206500     MOVE   "ADD-TEST-F2-39-2" TO PAR-NAME.
206600     IF      WRK-XN-00001 = "1"
206700             PERFORM PASS
206800             PERFORM PRINT-DETAIL
206900     ELSE
207000             MOVE   "1"           TO CORRECT-X
207100             MOVE    WRK-XN-00001 TO COMPUTED-X
207200             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
207300             PERFORM FAIL
207400             PERFORM PRINT-DETAIL.
207500     ADD     1 TO REC-CT.
207600 ADD-TEST-F2-39-3.
207700     MOVE   "ADD-TEST-F2-39-3" TO PAR-NAME.
207800     IF      WRK-DS-06V06 = 666999.666333
207900             PERFORM PASS
208000             PERFORM PRINT-DETAIL
208100     ELSE
208200             MOVE    666999.666333 TO CORRECT-N
208300             MOVE    WRK-DS-06V06  TO COMPUTED-N
208400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
208500                  TO RE-MARK
208600             PERFORM FAIL
208700             PERFORM PRINT-DETAIL.
208800*
208900 ADD-INIT-F2-40.
209000     MOVE   "VI-73 6.6.2" TO ANSI-REFERENCE.
209100*    ==-->  OPTIONAL WORD "TO"  <--==
209200     MOVE     ZERO TO WRK-DS-09V09.
209300 ADD-TEST-F2-40-0.
209400     ADD      A06THREES-DS-03V03
209500           TO A12THREES-DS-06V06 GIVING WRK-DS-09V09.
209600 ADD-TEST-F2-40-1.
209700     IF       WRK-DS-09V09 EQUAL TO 000333666.666333000
209800              PERFORM PASS GO TO ADD-WRITE-F2-40.
209900     GO       TO ADD-FAIL-F2-40.
210000 ADD-DELETE-F2-40.
210100     PERFORM  DE-LETE.
210200     GO       TO ADD-WRITE-F2-40.
210300 ADD-FAIL-F2-40.
210400     MOVE     WRK-DS-09V09 TO COMPUTED-N.
210500     MOVE     000333666.666333000 TO CORRECT-N.
210600     PERFORM  FAIL.
210700 ADD-WRITE-F2-40.
210800     MOVE     "ADD-TEST-F2-40" TO PAR-NAME.
210900     PERFORM  PRINT-DETAIL.
211000*
211100 ADD-INIT-F2-41.
211200     MOVE   "VI-73 6.6.2" TO ANSI-REFERENCE.
211300*    ==-->  OPTIONAL WORD "TO"  <--==
211400     MOVE     ZERO TO WRK-DS-06V06.
211500 ADD-TEST-F2-41-0.
211600     ADD      A05ONES-DS-05V00
211700              A05ONES-DS-00V05
211800              A12THREES-DS-06V06
211900          TO  A06THREES-DS-03V03 GIVING WRK-DS-06V06.
212000 ADD-TEST-F2-41-1.
212100     IF       WRK-DS-06V06 EQUAL TO 344777.777443
212200              PERFORM PASS GO TO ADD-WRITE-F2-41.
212300     GO       TO ADD-FAIL-F2-41.
212400 ADD-DELETE-F2-41.
212500     PERFORM  DE-LETE.
212600     GO       TO ADD-WRITE-F2-41.
212700 ADD-FAIL-F2-41.
212800     MOVE     WRK-DS-06V06 TO COMPUTED-N.
212900     MOVE     344777.777443 TO CORRECT-N.
213000     PERFORM  FAIL.
213100 ADD-WRITE-F2-41.
213200     MOVE     "ADD-TEST-F2-41" TO PAR-NAME.
213300     PERFORM PRINT-DETAIL.
213400*
213500 CCVS-EXIT SECTION.
213600 CCVS-999999.
213700     GO TO CLOSE-FILES.
