000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC171A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*    THIS PROGRAM TESTS THE FORMAT 1 DIVIDE STATEMENT FOUND
002200*    IN LEVEL 1.   ALL COMBINATIONS OF THE OPTIONAL PHRASES
002300*    "SIZE ERROR", "NOT SIZE ERROR" AND "END-MULTIPLY" ARE
002400*    TESTED, AS WELL AS THE ROUNDED OPTION.
002500*
002600*    VARIOUS COMBINATIONS OF SIGNED AND UNSIGNED NUMERIC
002700*    LITERALS, DISPLAY AND COMPUTATIONAL FIELDS ARE USED
002800*    AS OPERANDS.
002900*
003000
003100
003200 ENVIRONMENT DIVISION.
003300 CONFIGURATION SECTION.
003400 SOURCE-COMPUTER.
003500     XXXXX082.
003600 OBJECT-COMPUTER.
003700     XXXXX083.
003800 INPUT-OUTPUT SECTION.
003900 FILE-CONTROL.
004000     SELECT PRINT-FILE ASSIGN TO
004100     XXXXX055.
004200 DATA DIVISION.
004300 FILE SECTION.
004400 FD  PRINT-FILE.
004500 01  PRINT-REC PICTURE X(120).
004600 01  DUMMY-RECORD PICTURE X(120).
004700 WORKING-STORAGE SECTION.
004800 77  WRK-DS-18V00                PICTURE S9(18).
004900 77  A06THREES-DS-03V03          PICTURE S999V999 VALUE 333.333.
005000 77  WRK-DS-06V06                PICTURE S9(6)V9(6).
005100 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06 PICTURE S9(12).
005200 77  A08TWOS-DS-02V06            PICTURE S99V9(6) VALUE 22.222222.
005300 77  WRK-DS-10V00                PICTURE S9(10).
005400 77  WRK-XN-00001                PICTURE X.
005500 77  A10ONES-DS-10V00            PICTURE S9(10)
005600                                 VALUE 1111111111.
005700 77  A12THREES-DS-06V06          PICTURE S9(6)V9(6)
005800                                 VALUE 333333.333333.
005900 77  WRK-DS-02V00                PICTURE S99.
006000 77  AZERO-DS-05V05              PICTURE S9(5)V9(5) VALUE ZERO.
006100 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
006200 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09 PICTURE S9(18).
006300 77  A05ONES-DS-00V05            PICTURE SV9(5) VALUE .11111.
006400 77  A12ONES-DS-12V00            PICTURE S9(12)
006500                                 VALUE 111111111111.
006600 77  A01ONE-DS-P0801             PICTURE SP(8)9 VALUE .000000001.
006700 77  WRK-DS-09V08                PICTURE S9(9)V9(8).
006800 77  WRK-DS-17V00-S REDEFINES WRK-DS-09V08 PICTURE S9(17).
006900 77  A18ONES-DS-18V00            PICTURE S9(18)
007000                                 VALUE 111111111111111111.
007100 77  WRK-DS-0201P                PICTURE S99P.
007200 77  WRK-CS-18V00                PICTURE S9(18) COMPUTATIONAL.
007300 77  WRK-DU-18V00                PICTURE 9(18).
007400 77  A99-CS-02V00                PICTURE S99 COMPUTATIONAL
007500                                 VALUE 99.
007600 77  A01ONE-CS-00V01             PICTURE SV9 COMPUTATIONAL
007700                                 VALUE .1.
007800 77  A99-DS-02V00                PICTURE S99   VALUE 99.
007900 77  WRK-DS-12V00                PICTURE S9(12).
008000 77  WRK-DS-01V00                PICTURE S9.
008100 77  WRK-DS-03V10                PICTURE S9(3)V9(10).
008200 77  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
008300                                 VALUE 111111111.111111111.
008400 77  A02TWOS-DU-02V00            PICTURE 99  VALUE 22.
008500 77  WRK-DS-05V00                PICTURE S9(5).
008600 77  A02TWOS-DS-03V02            PICTURE S999V99 VALUE +022.00.
008700 77  WRK-CS-02V02                PICTURE S99V99  COMPUTATIONAL.
008800 77  A990-DS-0201P               PICTURE S99P   VALUE +990.
008900 77  XRAY                        PICTURE X.
009000 01  WRK-XN-18-1 PIC X(18).
009100 01  WRK-AN-X-18-1, REDEFINES WRK-XN-18-1 PIC A(18).
009200 01  WRK-DU-X-18V0-1; REDEFINES WRK-XN-18-1 PIC 9(18).
009300 01  WRK-DU-0V1-1 PIC V9 VALUE .3.
009400 01  WRK-DU-0V2-1 PIC V99 VALUE .25.
009500 01  WRK-DU-0V12-1 PIC V9(12) VALUE .00001.
009600 01  WRK-DU-1V0-1 PIC 9 VALUE ZERO.
009700 01  WRK-DU-1V1-1 PIC 9V9 VALUE 1.1.
009800 01  WRK-DU-1V1-2 PIC 9V9 VALUE 2.4.
009900 01  WRK-DU-1V3-1 PIC 9V999 VALUE 1.001.
010000 01  WRK-DU-1V3-2 PIC 9V999 VALUE 1.001.
010100 01  WRK-DU-1V5-1 PIC 9V9(5).
010200 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
010300 01  WRK-DU-2P6-1 PIC 99P(6) VALUE 99000000.
010400 01  WRK-DU-2V0-1 PIC 99.
010500 01  WRK-DU-2V0-2 PIC 99.
010600 01  WRK-DU-2V0-3 PIC 99.
010700 01  WRK-DU-2V1-1 PIC 99V9.
010800 01  WRK-DU-2V1-2 PIC 99V9.
010900 01  WRK-DU-2V1-3 PIC 99V9.
011000 01  WRK-DU-2V2-1 PIC 99V99 VALUE 15.44.
011100 01  WRK-DU-2V2-2 PIC 99V99 VALUE 60.89.
011200 01  WRK-DU-2V2-3 PIC 99V99 VALUE 60.99.
011300 01  WRK-DU-2V2-4 PIC 99V99 VALUE 60.99.
011400 01  WRK-DU-2V2-5 PIC 99V99 VALUE 10.00.
011500 01  WRK-DU-2V5-1 PIC 99V9(5).
011600 01  WRK-DU-4P1-1 PIC P(4)9 VALUE .00001.
011700 01  WRK-DU-5V1-1 PIC 9(5)V9 VALUE 12345.6.
011800 01  WRK-DU-6V0-1 PIC 9(6) VALUE 99999.
011900 01  WRK-DU-6V0-2 PIC 9(6) VALUE 99999.
012000 01  WRK-DU-16V2-1 PIC 9(16)V99 VALUE 9999999999999999.99.
012100 01  WRK-NE-X-1 PIC 9(16).99.
012200 01  WRK-DS-1V0-1 PIC S9 VALUE -3.
012300 01  WRK-DS-1V0-2 PIC S9 VALUE 2.
012400 01  WRK-DS-1V2-1 PIC S9V99 VALUE ZERO.
012500 01  WRK-DS-2V0-1 PIC S99 VALUE ZERO.
012600 01  WRK-DS-2V1-1 PIC S99V9 VALUE ZERO.
012700 01  WRK-DS-2V2-1 PIC S99V99 VALUE ZERO.
012800 01  WRK-DS-2V2-2 PIC S99V99 VALUE -12.34.
012900 01  WRK-DS-16V2-1 PIC S9(16)V99 VALUE -9999999999999999.99.
013000 01  WRK-NE-X-2 PIC -9(16).99.
013100 01  WRK-NE-1 PIC .9999/99999,99999,99.
013200 01  WRK-NE-2 PIC $**.99.
013300 01  WRK-NE-3 PIC $99.99CR.
013400 01  WRK-NE-4 PIC $*9.99 VALUE ZERO.
013500 77  A01ONES-CS-18V00   PICTURE S9(18) COMPUTATIONAL
013600             VALUE +000000000000000001.
013700 77  A02THREES-CS-18V00 PICTURE S9(18) COMPUTATIONAL
013800             VALUE -000000000000000033.
013900 77  A18SIXES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014000             VALUE 666666666666666666.
014100 77  A16NINES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014200             VALUE 009999999999999999.
014300 77  A14TWOS-CU-18V00   PICTURE 9(18) COMPUTATIONAL
014400             VALUE 000022222222222222.
014500 01  MULTIPLY-DATA.
014600     02 MULT1                           PICTURE IS 999V99
014700     VALUE IS 80.12.
014800     02 MULT2                           PICTURE IS 999V999.
014900     02 MULT3                           PICTURE IS $$99.99.
015000     02 MULT4                           PICTURE IS S99
015100     VALUE IS -56.
015200     02 MULT5                           PICTURE IS 9 VALUE IS 4.
015300     02 MULT6                           PICTURE IS 99 VALUE IS
015400     20.
015500 01  DIVIDE-DATA.
015600     02 DIV1                            PICTURE IS 9(4)V99
015700     VALUE IS 1620.36.
015800     02 DIV2                            PICTURE IS 99V9
015900     VALUE IS 44.1.
016000     02 DIV3                            PICTURE IS 9(4)V9
016100     VALUE IS 1661.7.
016200     02 DIV4                            PICTURE IS S9V999
016300     VALUE IS -9.642.
016400     02 DIV-02LEVEL-1.
016500     03 DIV5                            PICTURE IS V99
016600     VALUE IS .82.
016700     03 DIV6                            PICTURE IS 9 VALUE IS 0.
016800     03 DIV7                            PICTURE IS 9V9
016900     VALUE IS 9.6.
017000 01  DIV-DATA-2.
017100     02 DIV8                            PICTURE IS 99V9.
017200     02 DIV9                            PICTURE IS ZZ,ZZZ.9.
017300     02 DIV10                           PICTURE IS V999.
017400 01  TEST-RESULTS.
017500     02 FILLER                   PIC X      VALUE SPACE.
017600     02 FEATURE                  PIC X(20)  VALUE SPACE.
017700     02 FILLER                   PIC X      VALUE SPACE.
017800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
017900     02 FILLER                   PIC X      VALUE SPACE.
018000     02  PAR-NAME.
018100       03 FILLER                 PIC X(19)  VALUE SPACE.
018200       03  PARDOT-X              PIC X      VALUE SPACE.
018300       03 DOTVALUE               PIC 99     VALUE ZERO.
018400     02 FILLER                   PIC X(8)   VALUE SPACE.
018500     02 RE-MARK                  PIC X(61).
018600 01  TEST-COMPUTED.
018700     02 FILLER                   PIC X(30)  VALUE SPACE.
018800     02 FILLER                   PIC X(17)  VALUE
018900            "       COMPUTED=".
019000     02 COMPUTED-X.
019100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
019200     03 COMPUTED-N               REDEFINES COMPUTED-A
019300                                 PIC -9(9).9(9).
019400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
019500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
019600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
019700     03       CM-18V0 REDEFINES COMPUTED-A.
019800         04 COMPUTED-18V0                    PIC -9(18).
019900         04 FILLER                           PIC X.
020000     03 FILLER PIC X(50) VALUE SPACE.
020100 01  TEST-CORRECT.
020200     02 FILLER PIC X(30) VALUE SPACE.
020300     02 FILLER PIC X(17) VALUE "       CORRECT =".
020400     02 CORRECT-X.
020500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
020700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
020900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
021000     03      CR-18V0 REDEFINES CORRECT-A.
021100         04 CORRECT-18V0                     PIC -9(18).
021200         04 FILLER                           PIC X.
021300     03 FILLER PIC X(2) VALUE SPACE.
021400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021500 01  CCVS-C-1.
021600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
021700-    "SS  PARAGRAPH-NAME
021800-    "       REMARKS".
021900     02 FILLER                     PIC X(20)    VALUE SPACE.
022000 01  CCVS-C-2.
022100     02 FILLER                     PIC X        VALUE SPACE.
022200     02 FILLER                     PIC X(6)     VALUE "TESTED".
022300     02 FILLER                     PIC X(15)    VALUE SPACE.
022400     02 FILLER                     PIC X(4)     VALUE "FAIL".
022500     02 FILLER                     PIC X(94)    VALUE SPACE.
022600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
022700 01  REC-CT                        PIC 99       VALUE ZERO.
022800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
022900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
023000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
023100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
023200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
023300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
023400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
023500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
023600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
023700 01  CCVS-H-1.
023800     02  FILLER                    PIC X(39)    VALUE SPACES.
023900     02  FILLER                    PIC X(42)    VALUE
024000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024100     02  FILLER                    PIC X(39)    VALUE SPACES.
024200 01  CCVS-H-2A.
024300   02  FILLER                        PIC X(40)  VALUE SPACE.
024400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
024500   02  FILLER                        PIC XXXX   VALUE
024600     "4.2 ".
024700   02  FILLER                        PIC X(28)  VALUE
024800            " COPY - NOT FOR DISTRIBUTION".
024900   02  FILLER                        PIC X(41)  VALUE SPACE.
025000
025100 01  CCVS-H-2B.
025200   02  FILLER                        PIC X(15)  VALUE
025300            "TEST RESULT OF ".
025400   02  TEST-ID                       PIC X(9).
025500   02  FILLER                        PIC X(4)   VALUE
025600            " IN ".
025700   02  FILLER                        PIC X(12)  VALUE
025800     " HIGH       ".
025900   02  FILLER                        PIC X(22)  VALUE
026000            " LEVEL VALIDATION FOR ".
026100   02  FILLER                        PIC X(58)  VALUE
026200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026300 01  CCVS-H-3.
026400     02  FILLER                      PIC X(34)  VALUE
026500            " FOR OFFICIAL USE ONLY    ".
026600     02  FILLER                      PIC X(58)  VALUE
026700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026800     02  FILLER                      PIC X(28)  VALUE
026900            "  COPYRIGHT   1985 ".
027000 01  CCVS-E-1.
027100     02 FILLER                       PIC X(52)  VALUE SPACE.
027200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027300     02 ID-AGAIN                     PIC X(9).
027400     02 FILLER                       PIC X(45)  VALUE SPACES.
027500 01  CCVS-E-2.
027600     02  FILLER                      PIC X(31)  VALUE SPACE.
027700     02  FILLER                      PIC X(21)  VALUE SPACE.
027800     02 CCVS-E-2-2.
027900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
028000         03 FILLER                   PIC X      VALUE SPACE.
028100         03 ENDER-DESC               PIC X(44)  VALUE
028200            "ERRORS ENCOUNTERED".
028300 01  CCVS-E-3.
028400     02  FILLER                      PIC X(22)  VALUE
028500            " FOR OFFICIAL USE ONLY".
028600     02  FILLER                      PIC X(12)  VALUE SPACE.
028700     02  FILLER                      PIC X(58)  VALUE
028800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028900     02  FILLER                      PIC X(13)  VALUE SPACE.
029000     02 FILLER                       PIC X(15)  VALUE
029100             " COPYRIGHT 1985".
029200 01  CCVS-E-4.
029300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
029400     02 FILLER                       PIC X(4)   VALUE " OF ".
029500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
029600     02 FILLER                       PIC X(40)  VALUE
029700      "  TESTS WERE EXECUTED SUCCESSFULLY".
029800 01  XXINFO.
029900     02 FILLER                       PIC X(19)  VALUE
030000            "*** INFORMATION ***".
030100     02 INFO-TEXT.
030200       04 FILLER                     PIC X(8)   VALUE SPACE.
030300       04 XXCOMPUTED                 PIC X(20).
030400       04 FILLER                     PIC X(5)   VALUE SPACE.
030500       04 XXCORRECT                  PIC X(20).
030600     02 INF-ANSI-REFERENCE           PIC X(48).
030700 01  HYPHEN-LINE.
030800     02 FILLER  PIC IS X VALUE IS SPACE.
030900     02 FILLER  PIC IS X(65)    VALUE IS "************************
031000-    "*****************************************".
031100     02 FILLER  PIC IS X(54)    VALUE IS "************************
031200-    "******************************".
031300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
031400     "NC171A".
031500 PROCEDURE DIVISION.
031600 CCVS1 SECTION.
031700 OPEN-FILES.
031800     OPEN     OUTPUT PRINT-FILE.
031900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
032000     MOVE    SPACE TO TEST-RESULTS.
032100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
032200     GO TO CCVS1-EXIT.
032300 CLOSE-FILES.
032400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
032500 TERMINATE-CCVS.
032600S    EXIT PROGRAM.
032700STERMINATE-CALL.
032800     STOP     RUN.
032900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
033000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
033100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
033200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
033300     MOVE "****TEST DELETED****" TO RE-MARK.
033400 PRINT-DETAIL.
033500     IF REC-CT NOT EQUAL TO ZERO
033600             MOVE "." TO PARDOT-X
033700             MOVE REC-CT TO DOTVALUE.
033800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
033900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
034000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
034100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
034200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
034300     MOVE SPACE TO CORRECT-X.
034400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
034500     MOVE     SPACE TO RE-MARK.
034600 HEAD-ROUTINE.
034700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035100 COLUMN-NAMES-ROUTINE.
035200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
035500 END-ROUTINE.
035600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
035700 END-RTN-EXIT.
035800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035900 END-ROUTINE-1.
036000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
036100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
036200      ADD PASS-COUNTER TO ERROR-HOLD.
036300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
036400      MOVE PASS-COUNTER TO CCVS-E-4-1.
036500      MOVE ERROR-HOLD TO CCVS-E-4-2.
036600      MOVE CCVS-E-4 TO CCVS-E-2-2.
036700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
036800  END-ROUTINE-12.
036900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
037000     IF       ERROR-COUNTER IS EQUAL TO ZERO
037100         MOVE "NO " TO ERROR-TOTAL
037200         ELSE
037300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
037400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
037500     PERFORM WRITE-LINE.
037600 END-ROUTINE-13.
037700     IF DELETE-COUNTER IS EQUAL TO ZERO
037800         MOVE "NO " TO ERROR-TOTAL  ELSE
037900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
038000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
038100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038200      IF   INSPECT-COUNTER EQUAL TO ZERO
038300          MOVE "NO " TO ERROR-TOTAL
038400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
038500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038800 WRITE-LINE.
038900     ADD 1 TO RECORD-COUNT.
039000Y    IF RECORD-COUNT GREATER 42
039100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
039200Y        MOVE SPACE TO DUMMY-RECORD
039300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039400Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039500Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039600Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039700Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039800Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
039900Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
040000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
040100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
040200Y        MOVE ZERO TO RECORD-COUNT.
040300     PERFORM WRT-LN.
040400 WRT-LN.
040500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
040600     MOVE SPACE TO DUMMY-RECORD.
040700 BLANK-LINE-PRINT.
040800     PERFORM WRT-LN.
040900 FAIL-ROUTINE.
041000     IF     COMPUTED-X NOT EQUAL TO SPACE
041100            GO TO FAIL-ROUTINE-WRITE.
041200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
041300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041600     MOVE   SPACES TO INF-ANSI-REFERENCE.
041700     GO TO  FAIL-ROUTINE-EX.
041800 FAIL-ROUTINE-WRITE.
041900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
042000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
042100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
042200     MOVE   SPACES TO COR-ANSI-REFERENCE.
042300 FAIL-ROUTINE-EX. EXIT.
042400 BAIL-OUT.
042500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
042600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
042700 BAIL-OUT-WRITE.
042800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
042900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
043000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043100     MOVE   SPACES TO INF-ANSI-REFERENCE.
043200 BAIL-OUT-EX. EXIT.
043300 CCVS1-EXIT.
043400     EXIT.
043500 SECT-NC171A-001 SECTION.
043600*
043700*
043800 DIV-INIT-F1-1.
043900     MOVE "DIVIDE INTO" TO FEATURE.
044000     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
044100     MOVE    1620.36 TO DIV1.
044200 DIV-TEST-F1-1.
044300     DIVIDE   64.3 INTO DIV1.
044400     IF       DIV1 EQUAL TO 25.2
044500              PERFORM PASS
044600              ELSE
044700              GO TO DIV-FAIL-F1-1.
044800     GO TO    DIV-WRITE-F1-1.
044900 DIV-DELETE-F1-1.
045000     PERFORM  DE-LETE.
045100     GO TO    DIV-WRITE-F1-1.
045200 DIV-FAIL-F1-1.
045300     PERFORM  FAIL.
045400     MOVE     DIV1 TO COMPUTED-N.
045500     MOVE     +25.2 TO CORRECT-N.
045600 DIV-WRITE-F1-1.
045700     MOVE "DIV-TEST-F1-1" TO PAR-NAME.
045800     PERFORM  PRINT-DETAIL.
045900 DIV-INIT-F1-2.
046000     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
046100     MOVE      44.1  TO DIV2.
046200     MOVE    1661.7  TO DIV3.
046300 DIV-TEST-F1-2.
046400     DIVIDE   DIV2 INTO DIV3 ROUNDED.
046500     IF       DIV3 EQUAL TO 37.7
046600              PERFORM PASS
046700              ELSE
046800              GO TO DIV-FAIL-F1-2.
046900     GO TO    DIV-WRITE-F1-2.
047000 DIV-DELETE-F1-2.
047100     PERFORM  DE-LETE.
047200     GO TO    DIV-WRITE-F1-2.
047300 DIV-FAIL-F1-2.
047400     PERFORM  FAIL.
047500     MOVE     DIV3 TO COMPUTED-N.
047600     MOVE     +37.7 TO CORRECT-N.
047700 DIV-WRITE-F1-2.
047800     MOVE "DIV-TEST-F1-2 " TO PAR-NAME.
047900     PERFORM  PRINT-DETAIL.
048000 DIV-INIT-F1-3.
048100     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
048200     MOVE   -9.642   TO DIV4.
048300     MOVE     .82    TO DIV5.
048400 DIV-TEST-F1-3-1.
048500     DIVIDE   DIV5 INTO DIV4 ON SIZE ERROR
048600              MOVE "M" TO XRAY.
048700     IF       XRAY EQUAL TO "M"
048800              PERFORM PASS
048900              ELSE
049000              GO TO DIV-FAIL-F1-3-1.
049100     GO TO    DIV-WRITE-F1-3-1.
049200 DIV-DELETE-F1-3-1.
049300     PERFORM  DE-LETE.
049400     GO TO    DIV-WRITE-F1-3-1.
049500 DIV-FAIL-F1-3-1.
049600     MOVE     XRAY TO COMPUTED-X.
049700     MOVE    "M"   TO CORRECT-X.
049800     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
049900     PERFORM  FAIL.
050000 DIV-WRITE-F1-3-1.
050100     MOVE "DIV-TEST-F1-3-1 " TO PAR-NAME.
050200     PERFORM  PRINT-DETAIL.
050300 DIV-TEST-F1-3-2.
050400     IF       DIV4 EQUAL TO -9.642
050500              PERFORM PASS
050600              ELSE
050700              GO TO DIV-FAIL-F1-3-2.
050800     GO TO    DIV-WRITE-F1-3-2.
050900 DIV-DELETE-F1-3-2.
051000     PERFORM  DE-LETE.
051100     GO TO    DIV-WRITE-F1-3-2.
051200 DIV-FAIL-F1-3-2.
051300     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
051400     PERFORM  FAIL.
051500     MOVE    DIV4 TO COMPUTED-N.
051600     MOVE    -9.642 TO CORRECT-N.
051700 DIV-WRITE-F1-3-2.
051800     MOVE "DIV-TEST-F1-3-2 " TO PAR-NAME.
051900     PERFORM PRINT-DETAIL.
052000 DIV-INIT-F1-4.
052100     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
052200     MOVE    44.1   TO DIV2.
052300     MOVE     0     TO DIV6.
052400     MOVE    "A"    TO XRAY.
052500 DIV-TEST-F1-4-0.
052600     DIVIDE  DIV6 INTO DIV2 ON SIZE ERROR
052700             MOVE "N" TO XRAY.
052800 DIV-TEST-F1-4-1.
052900     IF      XRAY EQUAL TO "N"
053000             PERFORM PASS
053100     ELSE
053200             GO TO DIV-FAIL-F1-4-1.
053300     GO TO   DIV-WRITE-F1-4-1.
053400 DIV-DELETE-F1-4-1.
053500     PERFORM DE-LETE.
053600     GO TO   DIV-WRITE-F1-4-1.
053700 DIV-FAIL-F1-4-1.
053800     MOVE    XRAY TO COMPUTED-X.
053900     MOVE   "N"   TO CORRECT-X.
054000     MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
054100     PERFORM FAIL.
054200 DIV-WRITE-F1-4-1.
054300     MOVE   "DIV-TEST-F1-4-1 " TO PAR-NAME.
054400     PERFORM PRINT-DETAIL.
054500 DIV-TEST-F1-4-2.
054600     IF      DIV2 EQUAL TO 44.1
054700             PERFORM PASS
054800     ELSE
054900             GO TO DIV-FAIL-F1-4-2.
055000     GO TO   DIV-WRITE-F1-4-2.
055100 DIV-DELETE-F1-4-2.
055200     PERFORM  DE-LETE.
055300     GO TO   DIV-WRITE-F1-4-2.
055400 DIV-FAIL-F1-4-2.
055500     PERFORM  FAIL.
055600     MOVE    DIV2 TO COMPUTED-N.
055700     MOVE   +44.1000 TO CORRECT-N.
055800     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
055900 DIV-WRITE-F1-4-2.
056000     MOVE   "DIV-TEST-F1-4-2 " TO PAR-NAME.
056100     PERFORM PRINT-DETAIL.
056200 DIV-INIT-F1-5.
056300     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
056400     MOVE    9.6    TO DIV7.
056500     MOVE   "B"     TO XRAY.
056600 DIV-TEST-F1-5-1.
056700     DIVIDE  0.097 INTO DIV7 ROUNDED ON SIZE ERROR
056800             MOVE "N" TO XRAY.
056900     IF      XRAY EQUAL TO "N"
057000             PERFORM PASS
057100     ELSE
057200             GO TO DIV-FAIL-F1-5-1.
057300     GO TO   DIV-WRITE-F1-5-1.
057400 DIV-DELETE-F1-5-1.
057500     PERFORM DE-LETE.
057600     GO TO   DIV-WRITE-F1-5-1.
057700 DIV-FAIL-F1-5-1.
057800     MOVE    XRAY TO COMPUTED-X.
057900     MOVE   "N"   TO CORRECT-X.
058000     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
058100     PERFORM FAIL.
058200 DIV-WRITE-F1-5-1.
058300     MOVE "DIV-TEST-F1-5-1 " TO PAR-NAME.
058400     PERFORM PRINT-DETAIL.
058500 DIV-TEST-F1-5-2.
058600     IF       DIV7 NOT EQUAL TO 9.6
058700              GO TO DIV-FAIL-F1-5-2.
058800     PERFORM  PASS.
058900     GO TO    DIV-WRITE-F1-5-2.
059000 DIV-DELETE-F1-5-2.
059100     PERFORM  DE-LETE.
059200     GO TO    DIV-WRITE-F1-5-2.
059300 DIV-FAIL-F1-5-2.
059400     PERFORM  FAIL.
059500     MOVE     DIV7 TO COMPUTED-N.
059600     MOVE     +9.6 TO CORRECT-N.
059700     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
059800 DIV-WRITE-F1-5-2.
059900     MOVE "DIV-TEST-F1-5-2 " TO PAR-NAME.
060000     PERFORM  PRINT-DETAIL.
060100 DIV-INIT-F1-6.
060200     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
060300     MOVE    99 TO WRK-DS-18V00.
060400     MOVE    99 TO A99-DS-02V00.
060500 DIV-TEST-F1-6-0.
060600     DIVIDE  A99-DS-02V00 INTO WRK-DS-18V00.
060700 DIV-TEST-F1-6-1.
060800     IF      WRK-DS-18V00 EQUAL TO 000000000000000001
060900             PERFORM PASS
061000             GO TO   DIV-WRITE-F1-6.
061100     GO TO   DIV-FAIL-F1-6.
061200 DIV-DELETE-F1-6.
061300     PERFORM DE-LETE.
061400     GO TO   DIV-WRITE-F1-6.
061500 DIV-FAIL-F1-6.
061600     MOVE  000000000000000001 TO CORRECT-18V0.
061700     MOVE  WRK-DS-18V00       TO COMPUTED-18V0.
061800     PERFORM FAIL.
061900 DIV-WRITE-F1-6.
062000     MOVE "DIV-TEST-F1-6         " TO PAR-NAME.
062100     PERFORM PRINT-DETAIL.
062200 DIV-INIT-F1-7.
062300     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
062400     MOVE 2 TO WRK-DS-12V00.
062500 DIV-TEST-F1-7-0.
062600     DIVIDE 4 INTO WRK-DS-12V00 ROUNDED.
062700 DIV-TEST-F1-7-1.
062800     IF WRK-DS-12V00 EQUAL TO 000000000001
062900         PERFORM PASS
063000         GO TO DIV-WRITE-F1-7.
063100     GO TO DIV-FAIL-F1-7.
063200 DIV-DELETE-F1-7.
063300     PERFORM DE-LETE.
063400     GO TO DIV-WRITE-F1-7.
063500 DIV-FAIL-F1-7.
063600     MOVE  WRK-DS-12V00       TO COMPUTED-18V0.
063700     MOVE  000000000001       TO CORRECT-18V0.
063800     PERFORM FAIL.
063900 DIV-WRITE-F1-7.
064000     MOVE "DIV-TEST-F1-7         " TO PAR-NAME.
064100     PERFORM PRINT-DETAIL.
064200 DIV-INIT-F1-8.
064300     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
064400     MOVE  1 TO WRK-DS-01V00.
064500     MOVE "0" TO WRK-XN-00001.
064600 DIV-TEST-F1-8-0.
064700     DIVIDE 0.1 INTO WRK-DS-01V00 ON SIZE ERROR
064800         MOVE "1" TO WRK-XN-00001.
064900 DIV-TEST-F1-8-1.
065000     IF WRK-DS-01V00 EQUAL TO 1
065100         PERFORM PASS
065200         GO TO DIV-WRITE-F1-8-1.
065300     GO TO DIV-FAIL-F1-8-1.
065400 DIV-DELETE-F1-8-1.
065500     PERFORM DE-LETE.
065600     GO TO DIV-WRITE-F1-8-1.
065700 DIV-FAIL-F1-8-1.
065800     MOVE  1                  TO CORRECT-N.
065900     MOVE  WRK-DS-01V00       TO COMPUTED-N.
066000     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
066100     PERFORM FAIL.
066200 DIV-WRITE-F1-8-1.
066300     MOVE "DIV-TEST-F1-8-1         " TO PAR-NAME.
066400     PERFORM PRINT-DETAIL.
066500 DIV-TEST-F1-8-2.
066600     IF WRK-XN-00001 EQUAL TO "1"
066700         PERFORM PASS
066800         GO TO DIV-WRITE-F1-8-2.
066900     MOVE "1" TO CORRECT-A.
067000     MOVE WRK-XN-00001 TO COMPUTED-A.
067100     MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
067200     PERFORM FAIL.
067300     GO TO DIV-WRITE-F1-8-2.
067400 DIV-DELETE-F1-8-2.
067500     PERFORM DE-LETE.
067600 DIV-WRITE-F1-8-2.
067700     MOVE "DIV-TEST-F1-8-2         " TO PAR-NAME.
067800     PERFORM PRINT-DETAIL.
067900 DIV-INIT-F1-9.
068000     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
068100     MOVE -.000000001 TO WRK-DS-09V09.
068200     MOVE "1" TO WRK-XN-00001.
068300 DIV-TEST-F1-9-0.
068400     DIVIDE A01ONE-DS-P0801 INTO WRK-DS-09V09 ON SIZE ERROR
068500         MOVE "0" TO WRK-XN-00001.
068600 DIV-TEST-F1-9-1.
068700     IF WRK-DS-18V00-S EQUAL TO -000000001000000000
068800         PERFORM PASS
068900         GO TO DIV-WRITE-F1-9-1.
069000     GO TO DIV-FAIL-F1-9-1.
069100 DIV-DELETE-F1-9-1.
069200     PERFORM DE-LETE.
069300     GO TO DIV-WRITE-F1-9-1.
069400 DIV-FAIL-F1-9-1.
069500     MOVE -000000001000000000 TO CORRECT-18V0.
069600     MOVE WRK-DS-18V00-S TO COMPUTED-18V0.
069700     PERFORM FAIL.
069800 DIV-WRITE-F1-9-1.
069900     MOVE "DIV-TEST-F1-9-1         " TO PAR-NAME.
070000     PERFORM PRINT-DETAIL.
070100 DIV-TEST-F1-9-2.
070200     IF WRK-XN-00001 EQUAL TO "0"
070300         MOVE "1" TO CORRECT-A
070400         MOVE "0" TO COMPUTED-A
070500         MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
070600         PERFORM FAIL
070700         GO TO DIV-WRITE-F1-9-2.
070800     PERFORM PASS.
070900     GO TO DIV-WRITE-F1-9-2.
071000 DIV-DELETE-F1-9-2.
071100     PERFORM DE-LETE.
071200 DIV-WRITE-F1-9-2.
071300     MOVE "DIV-TEST-F1-9-2         " TO PAR-NAME.
071400     PERFORM PRINT-DETAIL.
071500 DIV-INIT-F1-10.
071600     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
071700     MOVE ZERO TO WRK-DS-01V00  AZERO-DS-05V05.
071800     MOVE "0" TO WRK-XN-00001.
071900 DIV-TEST-F1-10-0.
072000     DIVIDE AZERO-DS-05V05 INTO WRK-DS-01V00 ROUNDED
072100         ON SIZE ERROR  MOVE "1" TO WRK-XN-00001.
072200 DIV-TEST-F1-10-1.
072300     IF WRK-DS-01V00 EQUAL TO 0
072400         PERFORM PASS
072500         GO TO DIV-WRITE-F1-10-1.
072600     GO TO DIV-FAIL-F1-10-1.
072700 DIV-DELETE-F1-10-1.
072800     PERFORM DE-LETE.
072900     GO TO DIV-WRITE-F1-10-1.
073000 DIV-FAIL-F1-10-1.
073100     MOVE  0                  TO CORRECT-N.
073200     MOVE  WRK-DS-01V00       TO COMPUTED-N.
073300     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
073400     PERFORM FAIL.
073500 DIV-WRITE-F1-10-1.
073600     MOVE "DIV-TEST-F1-10-1         " TO PAR-NAME.
073700     PERFORM PRINT-DETAIL.
073800 DIV-TEST-F1-10-2.
073900     IF WRK-XN-00001 EQUAL TO "1"
074000         PERFORM PASS
074100         GO TO DIV-WRITE-F1-10-2.
074200 DIV-FAIL-F1-10-2.
074300     MOVE "1" TO CORRECT-A.
074400     MOVE WRK-XN-00001 TO COMPUTED-A.
074500     MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
074600     PERFORM FAIL.
074700     GO TO DIV-WRITE-F1-10-2.
074800 DIV-DELETE-F1-10-2.
074900     PERFORM DE-LETE.
075000 DIV-WRITE-F1-10-2.
075100     MOVE "DIV-TEST-F1-10-2         " TO PAR-NAME.
075200     PERFORM PRINT-DETAIL.
075300 DIV-INIT-F1-11.
075400     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
075500     MOVE A18ONES-DS-09V09 TO WRK-DS-09V09.
075600     MOVE "1" TO WRK-XN-00001.
075700 DIV-TEST-F1-11-0.
075800     DIVIDE A18ONES-DS-09V09 INTO WRK-DS-09V09 ROUNDED
075900         ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
076000 DIV-TEST-F1-11-1.
076100     IF WRK-DS-18V00-S EQUAL TO 000000001000000000
076200         PERFORM PASS
076300         GO TO DIV-WRITE-F1-11-1.
076400     GO TO DIV-FAIL-F1-11-1.
076500 DIV-DELETE-F1-11-1.
076600     PERFORM DE-LETE.
076700     GO TO DIV-WRITE-F1-11-1.
076800 DIV-FAIL-F1-11-1.
076900     MOVE  000000001000000000 TO CORRECT-18V0.
077000     MOVE  WRK-DS-18V00       TO COMPUTED-18V0.
077100     PERFORM FAIL.
077200 DIV-WRITE-F1-11-1.
077300     MOVE "DIV-TEST-F1-11-1         " TO PAR-NAME.
077400     PERFORM PRINT-DETAIL.
077500 DIV-TEST-F1-11-2.
077600     IF WRK-XN-00001 EQUAL TO "0"
077700         MOVE WRK-XN-00001 TO COMPUTED-A
077800         MOVE "1" TO CORRECT-A
077900         MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
078000         PERFORM FAIL
078100         GO TO DIV-WRITE-F1-11-2.
078200     PERFORM PASS.
078300     GO TO DIV-WRITE-F1-11-2.
078400 DIV-DELETE-F1-11-2.
078500     PERFORM DE-LETE.
078600 DIV-WRITE-F1-11-2.
078700     MOVE "DIV-TEST-F1-11-2         " TO PAR-NAME.
078800     PERFORM PRINT-DETAIL.
078900 DIV-INIT-F1-12.
079000     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
079100     MOVE -99 TO WRK-DS-02V00.
079200 DIV-TEST-F1-12-0.
079300     DIVIDE A99-DS-02V00 INTO WRK-DS-02V00.
079400 DIV-TEST-F1-12-1.
079500     IF WRK-DS-02V00 EQUAL TO -01
079600         PERFORM PASS
079700         GO TO DIV-WRITE-F1-12.
079800 DIV-FAIL-F1-12.
079900     MOVE  -01                TO CORRECT-N.
080000     MOVE  WRK-DS-02V00       TO COMPUTED-N.
080100     PERFORM FAIL.
080200     GO TO DIV-WRITE-F1-12.
080300 DIV-DELETE-F1-12.
080400     PERFORM DE-LETE.
080500 DIV-WRITE-F1-12.
080600     MOVE "DIV-TEST-F1-12         " TO PAR-NAME.
080700     PERFORM PRINT-DETAIL.
080800 DIV-INIT-F1-13.
080900     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
081000     MOVE -99.00 TO WRK-CS-02V02.
081100 DIV-TEST-F1-13-0.
081200     DIVIDE A990-DS-0201P INTO WRK-CS-02V02.
081300 DIV-TEST-F1-13-1.
081400     MOVE WRK-CS-02V02 TO WRK-DS-06V06.
081500     IF WRK-DS-12V00-S EQUAL TO -000000100000
081600         PERFORM PASS
081700     GO TO DIV-WRITE-F1-13.
081800     MOVE -000000.100000 TO CORRECT-N.
081900     MOVE WRK-DS-06V06 TO COMPUTED-N.
082000     PERFORM FAIL.
082100         GO TO DIV-WRITE-F1-13.
082200 DIV-DELETE-F1-13.
082300     PERFORM DE-LETE.
082400 DIV-WRITE-F1-13.
082500     MOVE "DIV-TEST-F1-13         " TO PAR-NAME.
082600     PERFORM PRINT-DETAIL.
082700*
082800*
082900 DIV-INIT-F1-14.
083000*    ==-->  NEW SIZE ERROR TESTS  <--==
083100     MOVE   "V1-67 6.4.2"  TO ANSI-REFERENCE.
083200     MOVE   "DIV-TEST-F1-14         " TO PAR-NAME
083300     MOVE   "Z" TO XRAY.
083400     MOVE    1  TO REC-CT.
083500     MOVE    1620.36 TO DIV1.
083600     MOVE    44.1    TO DIV2.
083700 DIV-TEST-F1-14-0.
083800     DIVIDE  DIV2 INTO DIV1
083900      NOT ON SIZE ERROR
084000             MOVE "N" TO XRAY.
084100     GO TO   DIV-TEST-F1-14-1.
084200 DIV-DELETE-F1-14-1.
084300     PERFORM DE-LETE.
084400     PERFORM PRINT-DETAIL.
084500     GO TO   DIV-INIT-F1-15.
084600 DIV-TEST-F1-14-1.
084700     MOVE   "DIV-TEST-F1-14-1 " TO PAR-NAME.
084800     IF      DIV1    = 36.74
084900             PERFORM PASS
085000             PERFORM PRINT-DETAIL
085100     ELSE
085200             MOVE    DIV1 TO COMPUTED-N
085300             MOVE    36.74 TO CORRECT-N
085400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
085500             PERFORM FAIL
085600             PERFORM PRINT-DETAIL.
085700     ADD     1  TO REC-CT.
085800 DIV-TEST-F1-14-2.
085900     MOVE   "DIV-TEST-F1-14-2 " TO PAR-NAME.
086000     IF      XRAY    = "N"
086100             PERFORM PASS
086200             PERFORM PRINT-DETAIL
086300     ELSE
086400             MOVE    XRAY TO COMPUTED-X
086500             MOVE   "N"   TO CORRECT-X
086600             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
086700                  TO RE-MARK
086800             PERFORM FAIL
086900             PERFORM PRINT-DETAIL.
087000*
087100*
087200 DIV-INIT-F1-15.
087300*    ==-->  NEW SIZE ERROR TESTS  <--==
087400     MOVE   "V1-67 6.4.2"  TO ANSI-REFERENCE.
087500     MOVE   "DIV-TEST-F1-15         " TO PAR-NAME
087600     MOVE A18ONES-DS-09V09 TO WRK-DS-09V09.
087700     MOVE "1" TO WRK-XN-00001.
087800     MOVE  1    TO REC-CT.
087900 DIV-TEST-F1-15-0.
088000     DIVIDE A18ONES-DS-09V09
088100       INTO WRK-DS-09V09 ROUNDED
088200     NOT ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
088300     GO TO   DIV-TEST-F1-15-1.
088400 DIV-DELETE-F1-15-1.
088500     PERFORM DE-LETE.
088600     PERFORM PRINT-DETAIL.
088700     GO TO   DIV-INIT-F1-16.
088800 DIV-TEST-F1-15-1.
088900     MOVE   "DIV-TEST-F1-15-1         " TO PAR-NAME.
089000     IF      WRK-XN-00001 = "0"
089100             PERFORM PASS
089200             PERFORM PRINT-DETAIL
089300     ELSE
089400             MOVE   "0"           TO CORRECT-X
089500             MOVE    WRK-XN-00001 TO COMPUTED-X
089600             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
089700                  TO RE-MARK
089800             PERFORM FAIL
089900             PERFORM PRINT-DETAIL.
090000     ADD     1 TO REC-CT.
090100 DIV-TEST-F1-15-2.
090200     MOVE   "DIV-TEST-F1-15-2         " TO PAR-NAME.
090300     IF      WRK-DS-09V09 =  1
090400             PERFORM PASS
090500             PERFORM PRINT-DETAIL
090600     ELSE
090700             MOVE    1             TO CORRECT-N
090800             MOVE    WRK-DS-09V09  TO COMPUTED-18V0
090900             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
091000                  TO RE-MARK
091100             PERFORM FAIL
091200             PERFORM PRINT-DETAIL.
091300*
091400*
091500 DIV-INIT-F1-16.
091600*    ==-->  NEW SIZE ERROR TESTS  <--==
091700     MOVE   "V1-67 6.4.2"  TO ANSI-REFERENCE.
091800     MOVE   "DIV-TEST-F1-16         " TO PAR-NAME.
091900     MOVE   "Z" TO XRAY.
092000     MOVE   1620.36 TO DIV1.
092100     MOVE     44.1  TO DIV2.
092200     MOVE    1    TO REC-CT.
092300 DIV-TEST-F1-16-0.
092400     DIVIDE  DIV2 INTO DIV1
092500          ON SIZE ERROR
092600             MOVE "E" TO XRAY
092700      NOT ON SIZE ERROR
092800             MOVE "N" TO XRAY.
092900     GO TO   DIV-TEST-F1-16-1.
093000 DIV-DELETE-F1-16-1.
093100     PERFORM DE-LETE.
093200     PERFORM PRINT-DETAIL.
093300     GO TO   DIV-INIT-F1-17.
093400 DIV-TEST-F1-16-1.
093500     MOVE   "DIV-TEST-F1-16-1 " TO PAR-NAME.
093600     IF      XRAY    = "N"
093700             PERFORM PASS
093800             PERFORM PRINT-DETAIL
093900     ELSE
094000             MOVE   "N"   TO CORRECT-X
094100             MOVE    XRAY TO COMPUTED-X
094200             MOVE  "NOT SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK
094300             PERFORM FAIL
094400             PERFORM PRINT-DETAIL.
094500     ADD     1 TO REC-CT.
094600 DIV-TEST-F1-16-2.
094700     MOVE   "DIV-TEST-F1-16-2" TO PAR-NAME.
094800     IF      DIV1    = 36.74
094900             PERFORM PASS
095000             PERFORM PRINT-DETAIL
095100     ELSE
095200             ADD     1 TO REC-CT
095300             MOVE    DIV1 TO COMPUTED-N
095400             MOVE    36.74 TO CORRECT-N
095500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
095600             PERFORM FAIL
095700             PERFORM PRINT-DETAIL.
095800*
095900*
096000 DIV-INIT-F1-17.
096100*    ==-->  NEW SIZE ERROR TESTS  <--==
096200     MOVE   "DIV-TEST-F1-17         " TO PAR-NAME
096300     MOVE   "V1-67 6.4.2"  TO ANSI-REFERENCE.
096400     MOVE A18ONES-DS-09V09 TO WRK-DS-09V09.
096500     MOVE "0" TO WRK-XN-00001.
096600     MOVE    1    TO REC-CT.
096700 DIV-TEST-F1-17-0.
096800     DIVIDE A18ONES-DS-09V09
096900       INTO WRK-DS-09V09 ROUNDED
097000         ON SIZE ERROR
097100            MOVE "1" TO WRK-XN-00001
097200     NOT ON SIZE ERROR
097300            MOVE "2" TO WRK-XN-00001.
097400     GO TO   DIV-TEST-F1-17-1.
097500 DIV-DELETE-F1-17-1.
097600     PERFORM DE-LETE.
097700     PERFORM PRINT-DETAIL.
097800     GO TO   DIV-INIT-F1-18.
097900 DIV-TEST-F1-17-1.
098000     MOVE   "DIV-TEST-F1-17-1 " TO PAR-NAME.
098100     IF      WRK-XN-00001 = "2"
098200             PERFORM PASS
098300             PERFORM PRINT-DETAIL
098400     ELSE
098500             MOVE   "2"           TO CORRECT-X
098600             MOVE    WRK-XN-00001 TO COMPUTED-X
098700             PERFORM FAIL
098800             PERFORM PRINT-DETAIL.
098900     ADD     1 TO REC-CT.
099000 DIV-TEST-F1-17-2.
099100     MOVE   "DIV-TEST-F1-17-2 " TO PAR-NAME.
099200     IF      WRK-DS-09V09 =  1
099300             PERFORM PASS
099400             PERFORM PRINT-DETAIL
099500     ELSE
099600             MOVE    1             TO CORRECT-18V0
099700             MOVE    WRK-DS-09V09  TO COMPUTED-18V0
099800             PERFORM FAIL
099900             PERFORM PRINT-DETAIL.
100000*
100100*
100200 DIV-INIT-F1-18.
100300*    ==-->  MULTIPLE RESULT FIELDS  <--==
100400     MOVE   "V1-81 6.11.4 GR1"  TO ANSI-REFERENCE.
100500     MOVE   "DIV-TEST-F1-18" TO PAR-NAME.
100600     MOVE     1.001          TO WRK-DU-1V3-1.
100700     MOVE    15.44           TO WRK-DU-2V2-1.
100800     MOVE    60.89           TO WRK-DU-2V2-2.
100900     MOVE    60.99           TO WRK-DU-2V2-3.
101000     MOVE    60.99           TO WRK-DU-2V2-4.
101100     MOVE    10.0            TO WRK-DU-2V2-5.
101200     MOVE     1.001          TO WRK-DU-1V3-2.
101300     MOVE    10.0            TO WRK-DU-2V1-1.
101400     MOVE    1 TO REC-CT.
101500 DIV-TEST-F1-18-0.
101600     DIVIDE  WRK-DU-1V3-1
101700       INTO  WRK-DU-2V2-1
101800             WRK-DU-2V2-2 ROUNDED
101900             WRK-DU-2V2-3
102000             WRK-DU-2V2-4 ROUNDED
102100             WRK-DU-1V3-2
102200             WRK-DU-2V2-5
102300             WRK-DU-2V1-1 ROUNDED.
102400     GO TO   DIV-TEST-F1-18-1.
102500 DIV-DELETE-F1-18.
102600     PERFORM DE-LETE.
102700     PERFORM PRINT-DETAIL.
102800     GO TO   DIV-INIT-F1-19.
102900 DIV-TEST-F1-18-1.
103000     IF      WRK-DU-2V2-1 = 15.42
103100             PERFORM PASS
103200             PERFORM PRINT-DETAIL
103300     ELSE
103400             PERFORM FAIL
103500             MOVE    WRK-DU-2V2-1 TO COMPUTED-N
103600             MOVE    15.42        TO CORRECT-N
103700             PERFORM PRINT-DETAIL.
103800     ADD 1 TO REC-CT.
103900 DIV-TEST-F1-18-2.
104000     IF      WRK-DU-2V2-2 = 60.83
104100             PERFORM PASS
104200             PERFORM PRINT-DETAIL
104300     ELSE
104400             PERFORM FAIL
104500             MOVE    WRK-DU-2V2-2 TO COMPUTED-N
104600             MOVE    60.83        TO CORRECT-N
104700             PERFORM PRINT-DETAIL.
104800     ADD 1 TO REC-CT.
104900 DIV-TEST-F1-18-3.
105000     IF      WRK-DU-2V2-3 = 60.92
105100             PERFORM PASS
105200             PERFORM PRINT-DETAIL
105300     ELSE
105400             PERFORM FAIL
105500             MOVE    WRK-DU-2V2-3 TO COMPUTED-N
105600             MOVE    60.92        TO CORRECT-N
105700             PERFORM PRINT-DETAIL.
105800     ADD 1 TO REC-CT.
105900 DIV-TEST-F1-18-4.
106000     IF      WRK-DU-2V2-4 = 60.93
106100             PERFORM PASS
106200             PERFORM PRINT-DETAIL
106300     ELSE
106400             PERFORM FAIL
106500             MOVE    WRK-DU-2V2-4 TO COMPUTED-N
106600             MOVE    60.93        TO CORRECT-N
106700             PERFORM PRINT-DETAIL.
106800     ADD 1 TO REC-CT.
106900 DIV-TEST-F1-18-5.
107000     IF      WRK-DU-1V3-2 = 1.000
107100             PERFORM PASS
107200             PERFORM PRINT-DETAIL
107300     ELSE
107400             PERFORM FAIL
107500             MOVE    WRK-DU-1V3-2 TO COMPUTED-N
107600             MOVE    1.000        TO CORRECT-N
107700             PERFORM PRINT-DETAIL.
107800     ADD 1 TO REC-CT.
107900 DIV-TEST-F1-18-6.
108000     IF      WRK-DU-2V2-5 = 09.99
108100             PERFORM PASS
108200             PERFORM PRINT-DETAIL
108300     ELSE
108400             PERFORM FAIL
108500             MOVE    WRK-DU-2V2-5 TO COMPUTED-N
108600             MOVE    09.99        TO CORRECT-N
108700             PERFORM PRINT-DETAIL.
108800     ADD 1 TO REC-CT.
108900 DIV-TEST-F1-18-7.
109000     IF      WRK-DU-2V1-1 = 10.0
109100             PERFORM PASS
109200             PERFORM PRINT-DETAIL
109300     ELSE
109400             PERFORM FAIL
109500             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
109600             MOVE    10.00        TO CORRECT-N
109700             PERFORM PRINT-DETAIL.
109800*
109900*
110000 DIV-INIT-F1-19.
110100*            ==-->   SIZE ERROR CONDITION  <--==
110200*            ==-->   NEW SIZE ERRROR TESTS <--==
110300     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
110400     MOVE   "DIV-TEST-F1-19" TO PAR-NAME.
110500     MOVE      .01           TO WRK-DU-0V2-1.
110600     MOVE     1.001          TO WRK-DU-1V3-1.
110700     MOVE    15.44           TO WRK-DU-2V2-1.
110800     MOVE    60.89           TO WRK-DU-2V2-2.
110900     MOVE    60.99           TO WRK-DU-2V2-3.
111000     MOVE    60.99           TO WRK-DU-2V2-4.
111100     MOVE    10.0            TO WRK-DU-2V2-5.
111200     MOVE     1.001          TO WRK-DU-1V3-2.
111300     MOVE    10.0            TO WRK-DU-2V1-1.
111400     MOVE     "0"            TO WRK-XN-00001.
111500     MOVE    1 TO REC-CT.
111600 DIV-TEST-F1-19-0.
111700     DIVIDE  WRK-DU-0V2-1
111800       INTO  WRK-DU-2V2-1
111900             WRK-DU-2V2-2
112000             WRK-DU-2V2-3
112100             WRK-DU-2V2-4
112200             WRK-DU-1V3-2
112300             WRK-DU-2V2-5
112400             WRK-DU-2V1-1
112500          ON SIZE ERROR
112600             MOVE   "1"  TO WRK-XN-00001.
112700     GO TO   DIV-TEST-F1-19-1.
112800 DIV-DELETE-F1-19.
112900     PERFORM DE-LETE.
113000     PERFORM PRINT-DETAIL.
113100     GO TO   DIV-INIT-F1-20.
113200 DIV-TEST-F1-19-1.
113300     IF      WRK-DU-2V2-1 = 15.44
113400             PERFORM PASS
113500             PERFORM PRINT-DETAIL
113600     ELSE
113700             MOVE   "NOT AFFECTED BY SIZE ERROR" TO RE-MARK
113800             PERFORM FAIL
113900             MOVE    WRK-DU-2V2-1 TO COMPUTED-N
114000             MOVE    15.44        TO CORRECT-N
114100             PERFORM PRINT-DETAIL.
114200     ADD 1 TO REC-CT.
114300 DIV-TEST-F1-19-2.
114400     IF      WRK-DU-2V2-2 = 60.89
114500             PERFORM PASS
114600             PERFORM PRINT-DETAIL
114700     ELSE
114800             MOVE   "NOT AFFECTED BY SIZE ERROR" TO RE-MARK
114900             PERFORM FAIL
115000             MOVE    WRK-DU-2V2-2 TO COMPUTED-N
115100             MOVE    60.89        TO CORRECT-N
115200             PERFORM PRINT-DETAIL.
115300     ADD 1 TO REC-CT.
115400 DIV-TEST-F1-19-3.
115500     IF      WRK-DU-2V2-3 = 60.99
115600             PERFORM PASS
115700             PERFORM PRINT-DETAIL
115800     ELSE
115900             MOVE   "NOT AFFECTED BY SIZE ERROR" TO RE-MARK
116000             PERFORM FAIL
116100             MOVE    WRK-DU-2V2-3 TO COMPUTED-N
116200             MOVE    60.92        TO CORRECT-N
116300             PERFORM PRINT-DETAIL.
116400     ADD 1 TO REC-CT.
116500 DIV-TEST-F1-19-4.
116600     IF      WRK-DU-2V2-4 = 60.99
116700             PERFORM PASS
116800             PERFORM PRINT-DETAIL
116900     ELSE
117000             MOVE   "NOT AFFECTED BY SIZE ERROR" TO RE-MARK
117100             PERFORM FAIL
117200             MOVE    WRK-DU-2V2-4 TO COMPUTED-N
117300             MOVE    60.99        TO CORRECT-N
117400             PERFORM PRINT-DETAIL.
117500     ADD 1 TO REC-CT.
117600 DIV-TEST-F1-19-5.
117700     IF      WRK-DU-1V3-2 = 1.001
117800             PERFORM PASS
117900             PERFORM PRINT-DETAIL
118000     ELSE
118100             MOVE   "NOT AFFECTED BY SIZE ERROR" TO RE-MARK
118200             PERFORM FAIL
118300             MOVE    WRK-DU-1V3-2 TO COMPUTED-N
118400             MOVE    1.001        TO CORRECT-N
118500             PERFORM PRINT-DETAIL.
118600     ADD 1 TO REC-CT.
118700 DIV-TEST-F1-19-6.
118800     IF      WRK-DU-2V2-5 = 10.00
118900             PERFORM PASS
119000             PERFORM PRINT-DETAIL
119100     ELSE
119200             MOVE   "NOT AFFECTED BY SIZE ERROR" TO RE-MARK
119300             PERFORM FAIL
119400             MOVE    WRK-DU-2V2-5 TO COMPUTED-N
119500             MOVE    09.99        TO CORRECT-N
119600             PERFORM PRINT-DETAIL.
119700     ADD 1 TO REC-CT.
119800 DIV-TEST-F1-19-7.
119900     IF      WRK-DU-2V1-1 = 10.0
120000             PERFORM PASS
120100             PERFORM PRINT-DETAIL
120200     ELSE
120300             MOVE   "NOT AFFECTED BY SIZE ERROR" TO RE-MARK
120400             PERFORM FAIL
120500             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
120600             MOVE    10.0         TO CORRECT-N
120700             PERFORM PRINT-DETAIL.
120800     ADD 1 TO REC-CT.
120900 DIV-TEST-F1-19-8.
121000     IF      WRK-XN-00001 = "1"
121100             PERFORM PASS
121200             PERFORM PRINT-DETAIL
121300     ELSE
121400             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
121500             PERFORM FAIL
121600             MOVE    WRK-XN-00001 TO COMPUTED-X
121700             MOVE    "1"          TO CORRECT-X
121800             PERFORM PRINT-DETAIL.
121900*
122000*
122100 DIV-INIT-F1-20.
122200*            ==-->  NO SIZE ERROR CONDITION  <--==
122300*            ==-->   NEW SIZE ERRROR TESTS <--==
122400     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
122500     MOVE   "DIV-TEST-F1-20" TO PAR-NAME.
122600     MOVE     1.001          TO WRK-DU-1V3-1.
122700     MOVE    15.44           TO WRK-DU-2V2-1.
122800     MOVE    60.89           TO WRK-DU-2V2-2.
122900     MOVE    60.99           TO WRK-DU-2V2-3.
123000     MOVE    60.99           TO WRK-DU-2V2-4.
123100     MOVE    10.0            TO WRK-DU-2V2-5.
123200     MOVE     1.001          TO WRK-DU-1V3-2.
123300     MOVE    10.0            TO WRK-DU-2V1-1.
123400     MOVE     "0"            TO WRK-XN-00001.
123500     MOVE    1 TO REC-CT.
123600 DIV-TEST-F1-20-0.
123700     DIVIDE  WRK-DU-1V3-1
123800       INTO  WRK-DU-2V2-1
123900             WRK-DU-2V2-2 ROUNDED
124000             WRK-DU-2V2-3
124100             WRK-DU-2V2-4 ROUNDED
124200             WRK-DU-1V3-2
124300             WRK-DU-2V2-5
124400             WRK-DU-2V1-1 ROUNDED
124500          ON SIZE ERROR
124600             MOVE   "1"  TO WRK-XN-00001.
124700     GO TO   DIV-TEST-F1-20-1.
124800 DIV-DELETE-F1-20.
124900     PERFORM DE-LETE.
125000     PERFORM PRINT-DETAIL.
125100     GO TO   DIV-INIT-F1-21.
125200 DIV-TEST-F1-20-1.
125300     IF      WRK-DU-2V2-1 = 15.42
125400             PERFORM PASS
125500             PERFORM PRINT-DETAIL
125600     ELSE
125700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
125800             PERFORM FAIL
125900             MOVE    WRK-DU-2V2-1 TO COMPUTED-N
126000             MOVE    15.42        TO CORRECT-N
126100             PERFORM PRINT-DETAIL.
126200     ADD 1 TO REC-CT.
126300 DIV-TEST-F1-20-2.
126400     IF      WRK-DU-2V2-2 = 60.83
126500             PERFORM PASS
126600             PERFORM PRINT-DETAIL
126700     ELSE
126800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
126900             PERFORM FAIL
127000             MOVE    WRK-DU-2V2-2 TO COMPUTED-N
127100             MOVE    60.83        TO CORRECT-N
127200             PERFORM PRINT-DETAIL.
127300     ADD 1 TO REC-CT.
127400 DIV-TEST-F1-20-3.
127500     IF      WRK-DU-2V2-3 = 60.92
127600             PERFORM PASS
127700             PERFORM PRINT-DETAIL
127800     ELSE
127900             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
128000             PERFORM FAIL
128100             MOVE    WRK-DU-2V2-3 TO COMPUTED-N
128200             MOVE    60.92        TO CORRECT-N
128300             PERFORM PRINT-DETAIL.
128400     ADD 1 TO REC-CT.
128500 DIV-TEST-F1-20-4.
128600     IF      WRK-DU-2V2-4 = 60.93
128700             PERFORM PASS
128800             PERFORM PRINT-DETAIL
128900     ELSE
129000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
129100             PERFORM FAIL
129200             MOVE    WRK-DU-2V2-4 TO COMPUTED-N
129300             MOVE    60.93        TO CORRECT-N
129400             PERFORM PRINT-DETAIL.
129500     ADD 1 TO REC-CT.
129600 DIV-TEST-F1-20-5.
129700     IF      WRK-DU-1V3-2 = 1.000
129800             PERFORM PASS
129900             PERFORM PRINT-DETAIL
130000     ELSE
130100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
130200             PERFORM FAIL
130300             MOVE    WRK-DU-1V3-2 TO COMPUTED-N
130400             MOVE    1.000        TO CORRECT-N
130500             PERFORM PRINT-DETAIL.
130600     ADD 1 TO REC-CT.
130700 DIV-TEST-F1-20-6.
130800     IF      WRK-DU-2V2-5 = 09.99
130900             PERFORM PASS
131000             PERFORM PRINT-DETAIL
131100     ELSE
131200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
131300             PERFORM FAIL
131400             MOVE    WRK-DU-2V2-5 TO COMPUTED-N
131500             MOVE    09.99        TO CORRECT-N
131600             PERFORM PRINT-DETAIL.
131700     ADD 1 TO REC-CT.
131800 DIV-TEST-F1-20-7.
131900     IF      WRK-DU-2V1-1 = 10.0
132000             PERFORM PASS
132100             PERFORM PRINT-DETAIL
132200     ELSE
132300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
132400             PERFORM FAIL
132500             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
132600             MOVE    10.00        TO CORRECT-N
132700             PERFORM PRINT-DETAIL.
132800     ADD 1 TO REC-CT.
132900 DIV-TEST-F1-20-8.
133000     IF      WRK-XN-00001 = "0"
133100             PERFORM PASS
133200             PERFORM PRINT-DETAIL
133300     ELSE
133400             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
133500                  TO RE-MARK
133600             PERFORM FAIL
133700             MOVE    WRK-XN-00001 TO COMPUTED-X
133800             MOVE    "0"          TO CORRECT-X
133900             PERFORM PRINT-DETAIL.
134000*
134100*
134200 DIV-INIT-F1-21.
134300*            ==-->   SIZE ERROR CONDITION  <--==
134400*            ==-->   NEW SIZE ERRROR TESTS <--==
134500     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
134600     MOVE   "DIV-TEST-F1-21" TO PAR-NAME.
134700     MOVE      .01           TO WRK-DU-0V2-1.
134800     MOVE     1.001          TO WRK-DU-1V3-1.
134900     MOVE    15.44           TO WRK-DU-2V2-1.
135000     MOVE    60.89           TO WRK-DU-2V2-2.
135100     MOVE    60.99           TO WRK-DU-2V2-3.
135200     MOVE    60.99           TO WRK-DU-2V2-4.
135300     MOVE    10.0            TO WRK-DU-2V2-5.
135400     MOVE     1.001          TO WRK-DU-1V3-2.
135500     MOVE    10.0            TO WRK-DU-2V1-1.
135600     MOVE     "0"            TO WRK-XN-00001.
135700     MOVE    1 TO REC-CT.
135800 DIV-TEST-F1-21-0.
135900     DIVIDE  WRK-DU-0V2-1
136000       INTO  WRK-DU-2V2-1
136100             WRK-DU-2V2-2
136200             WRK-DU-2V2-3
136300             WRK-DU-2V2-4
136400             WRK-DU-1V3-2
136500             WRK-DU-2V2-5
136600             WRK-DU-2V1-1
136700      NOT ON SIZE ERROR
136800             MOVE   "1"  TO WRK-XN-00001.
136900     GO TO   DIV-TEST-F1-21-1.
137000 DIV-DELETE-F1-21.
137100     PERFORM DE-LETE.
137200     PERFORM PRINT-DETAIL.
137300     GO TO   DIV-INIT-F1-22.
137400 DIV-TEST-F1-21-1.
137500     IF      WRK-DU-2V2-1 = 15.44
137600             PERFORM PASS
137700             PERFORM PRINT-DETAIL
137800     ELSE
137900             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
138000             PERFORM FAIL
138100             MOVE    WRK-DU-2V2-1 TO COMPUTED-N
138200             MOVE    15.44        TO CORRECT-N
138300             PERFORM PRINT-DETAIL.
138400     ADD 1 TO REC-CT.
138500 DIV-TEST-F1-21-2.
138600     IF      WRK-DU-2V2-2 = 60.89
138700             PERFORM PASS
138800             PERFORM PRINT-DETAIL
138900     ELSE
139000             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
139100             PERFORM FAIL
139200             MOVE    WRK-DU-2V2-2 TO COMPUTED-N
139300             MOVE    60.89        TO CORRECT-N
139400             PERFORM PRINT-DETAIL.
139500     ADD 1 TO REC-CT.
139600 DIV-TEST-F1-21-3.
139700     IF      WRK-DU-2V2-3 = 60.99
139800             PERFORM PASS
139900             PERFORM PRINT-DETAIL
140000     ELSE
140100             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
140200             PERFORM FAIL
140300             MOVE    WRK-DU-2V2-3 TO COMPUTED-N
140400             MOVE    60.99        TO CORRECT-N
140500             PERFORM PRINT-DETAIL.
140600     ADD 1 TO REC-CT.
140700 DIV-TEST-F1-21-4.
140800     IF      WRK-DU-2V2-4 = 60.99
140900             PERFORM PASS
141000             PERFORM PRINT-DETAIL
141100     ELSE
141200             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
141300             PERFORM FAIL
141400             MOVE    WRK-DU-2V2-4 TO COMPUTED-N
141500             MOVE    60.99        TO CORRECT-N
141600             PERFORM PRINT-DETAIL.
141700     ADD 1 TO REC-CT.
141800 DIV-TEST-F1-21-5.
141900     IF      WRK-DU-1V3-2 = 1.001
142000             PERFORM PASS
142100             PERFORM PRINT-DETAIL
142200     ELSE
142300             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
142400             PERFORM FAIL
142500             MOVE    WRK-DU-1V3-2 TO COMPUTED-N
142600             MOVE    1.001        TO CORRECT-N
142700             PERFORM PRINT-DETAIL.
142800     ADD 1 TO REC-CT.
142900 DIV-TEST-F1-21-6.
143000     IF      WRK-DU-2V2-5 = 10.00
143100             PERFORM PASS
143200             PERFORM PRINT-DETAIL
143300     ELSE
143400             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
143500             PERFORM FAIL
143600             MOVE    WRK-DU-2V2-5 TO COMPUTED-N
143700             MOVE    10.00        TO CORRECT-N
143800             PERFORM PRINT-DETAIL.
143900     ADD 1 TO REC-CT.
144000 DIV-TEST-F1-21-7.
144100     IF      WRK-DU-2V1-1 = 10.0
144200             PERFORM PASS
144300             PERFORM PRINT-DETAIL
144400     ELSE
144500             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
144600             PERFORM FAIL
144700             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
144800             MOVE    10.0         TO CORRECT-N
144900             PERFORM PRINT-DETAIL.
145000     ADD 1 TO REC-CT.
145100 DIV-TEST-F1-21-8.
145200     IF      WRK-XN-00001 = "0"
145300             PERFORM PASS
145400             PERFORM PRINT-DETAIL
145500     ELSE
145600             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
145700                  TO RE-MARK
145800             PERFORM FAIL
145900             MOVE    WRK-XN-00001 TO COMPUTED-X
146000             MOVE    "0"          TO CORRECT-X
146100             PERFORM PRINT-DETAIL.
146200*
146300*
146400 DIV-INIT-F1-22.
146500*            ==-->  NO SIZE ERROR CONDITION <--==
146600*            ==-->   NEW SIZE ERRROR TESTS <--==
146700     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
146800     MOVE   "DIV-TEST-F1-22" TO PAR-NAME.
146900     MOVE     1.001          TO WRK-DU-1V3-1.
147000     MOVE    15.44           TO WRK-DU-2V2-1.
147100     MOVE    60.89           TO WRK-DU-2V2-2.
147200     MOVE    60.99           TO WRK-DU-2V2-3.
147300     MOVE    60.99           TO WRK-DU-2V2-4.
147400     MOVE    10.0            TO WRK-DU-2V2-5.
147500     MOVE     1.001          TO WRK-DU-1V3-2.
147600     MOVE    10.0            TO WRK-DU-2V1-1.
147700     MOVE   "0"              TO WRK-XN-00001.
147800     MOVE    1 TO REC-CT.
147900 DIV-TEST-F1-22-0.
148000     DIVIDE  WRK-DU-1V3-1
148100       INTO  WRK-DU-2V2-1
148200             WRK-DU-2V2-2 ROUNDED
148300             WRK-DU-2V2-3
148400             WRK-DU-2V2-4 ROUNDED
148500             WRK-DU-1V3-2
148600             WRK-DU-2V2-5
148700             WRK-DU-2V1-1 ROUNDED
148800      NOT ON SIZE ERROR
148900             MOVE   "1"  TO WRK-XN-00001.
149000     GO TO   DIV-TEST-F1-22-1.
149100 DIV-DELETE-F1-22.
149200     PERFORM DE-LETE.
149300     PERFORM PRINT-DETAIL.
149400     GO TO   DIV-INIT-F1-23.
149500 DIV-TEST-F1-22-1.
149600     IF      WRK-DU-2V2-1 = 15.42
149700             PERFORM PASS
149800             PERFORM PRINT-DETAIL
149900     ELSE
150000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
150100             PERFORM FAIL
150200             MOVE    WRK-DU-2V2-1 TO COMPUTED-N
150300             MOVE    15.42        TO CORRECT-N
150400             PERFORM PRINT-DETAIL.
150500     ADD 1 TO REC-CT.
150600 DIV-TEST-F1-22-2.
150700     IF      WRK-DU-2V2-2 = 60.83
150800             PERFORM PASS
150900             PERFORM PRINT-DETAIL
151000     ELSE
151100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
151200             PERFORM FAIL
151300             MOVE    WRK-DU-2V2-2 TO COMPUTED-N
151400             MOVE    60.83        TO CORRECT-N
151500             PERFORM PRINT-DETAIL.
151600     ADD 1 TO REC-CT.
151700 DIV-TEST-F1-22-3.
151800     IF      WRK-DU-2V2-3 = 60.92
151900             PERFORM PASS
152000             PERFORM PRINT-DETAIL
152100     ELSE
152200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
152300             PERFORM FAIL
152400             MOVE    WRK-DU-2V2-3 TO COMPUTED-N
152500             MOVE    60.92        TO CORRECT-N
152600             PERFORM PRINT-DETAIL.
152700     ADD 1 TO REC-CT.
152800 DIV-TEST-F1-22-4.
152900     IF      WRK-DU-2V2-4 = 60.93
153000             PERFORM PASS
153100             PERFORM PRINT-DETAIL
153200     ELSE
153300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
153400             PERFORM FAIL
153500             MOVE    WRK-DU-2V2-4 TO COMPUTED-N
153600             MOVE    60.93        TO CORRECT-N
153700             PERFORM PRINT-DETAIL.
153800     ADD 1 TO REC-CT.
153900 DIV-TEST-F1-22-5.
154000     IF      WRK-DU-1V3-2 = 1.000
154100             PERFORM PASS
154200             PERFORM PRINT-DETAIL
154300     ELSE
154400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
154500             PERFORM FAIL
154600             MOVE    WRK-DU-1V3-2 TO COMPUTED-N
154700             MOVE    1.000        TO CORRECT-N
154800             PERFORM PRINT-DETAIL.
154900     ADD 1 TO REC-CT.
155000 DIV-TEST-F1-22-6.
155100     IF      WRK-DU-2V2-5 = 09.99
155200             PERFORM PASS
155300             PERFORM PRINT-DETAIL
155400     ELSE
155500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
155600             PERFORM FAIL
155700             MOVE    WRK-DU-2V2-5 TO COMPUTED-N
155800             MOVE    09.99        TO CORRECT-N
155900             PERFORM PRINT-DETAIL.
156000     ADD 1 TO REC-CT.
156100 DIV-TEST-F1-22-7.
156200     IF      WRK-DU-2V1-1 = 10.0
156300             PERFORM PASS
156400             PERFORM PRINT-DETAIL
156500     ELSE
156600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
156700             PERFORM FAIL
156800             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
156900             MOVE    10.00        TO CORRECT-N
157000             PERFORM PRINT-DETAIL.
157100     ADD 1 TO REC-CT.
157200 DIV-TEST-F1-22-8.
157300     IF      WRK-XN-00001 = "1"
157400             PERFORM PASS
157500             PERFORM PRINT-DETAIL
157600     ELSE
157700             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
157800                  TO RE-MARK
157900             PERFORM FAIL
158000             MOVE    WRK-XN-00001 TO COMPUTED-X
158100             MOVE    "1"          TO CORRECT-X
158200             PERFORM PRINT-DETAIL.
158300*
158400*
158500 DIV-INIT-F1-23.
158600*            ==-->    SIZE ERROR CONDITION <--==
158700*            ==-->   NEW SIZE ERRROR TESTS <--==
158800     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
158900     MOVE   "DIV-TEST-F1-23" TO PAR-NAME.
159000     MOVE      .01           TO WRK-DU-0V2-1.
159100     MOVE     1.001          TO WRK-DU-1V3-1.
159200     MOVE    15.44           TO WRK-DU-2V2-1.
159300     MOVE    60.89           TO WRK-DU-2V2-2.
159400     MOVE    60.99           TO WRK-DU-2V2-3.
159500     MOVE    60.99           TO WRK-DU-2V2-4.
159600     MOVE    10.0            TO WRK-DU-2V2-5.
159700     MOVE     1.001          TO WRK-DU-1V3-2.
159800     MOVE    10.0            TO WRK-DU-2V1-1.
159900     MOVE     "0"            TO WRK-XN-00001.
160000     MOVE    1 TO REC-CT.
160100 DIV-TEST-F1-23-0.
160200     DIVIDE  WRK-DU-0V2-1
160300       INTO  WRK-DU-2V2-1
160400             WRK-DU-2V2-2
160500             WRK-DU-2V2-3
160600             WRK-DU-2V2-4
160700             WRK-DU-1V3-2
160800             WRK-DU-2V2-5
160900             WRK-DU-2V1-1
161000          ON SIZE ERROR
161100             MOVE   "1"  TO WRK-XN-00001
161200      NOT ON SIZE ERROR
161300             MOVE   "2"  TO WRK-XN-00001.
161400     GO TO   DIV-TEST-F1-23-1.
161500 DIV-DELETE-F1-23.
161600     PERFORM DE-LETE.
161700     PERFORM PRINT-DETAIL.
161800     GO TO   DIV-INIT-F1-24.
161900 DIV-TEST-F1-23-1.
162000     IF      WRK-DU-2V2-1 = 15.44
162100             PERFORM PASS
162200             PERFORM PRINT-DETAIL
162300     ELSE
162400             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
162500             PERFORM FAIL
162600             MOVE    WRK-DU-2V2-1 TO COMPUTED-N
162700             MOVE    15.44        TO CORRECT-N
162800             PERFORM PRINT-DETAIL.
162900     ADD 1 TO REC-CT.
163000 DIV-TEST-F1-23-2.
163100     IF      WRK-DU-2V2-2 = 60.89
163200             PERFORM PASS
163300             PERFORM PRINT-DETAIL
163400     ELSE
163500             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
163600             PERFORM FAIL
163700             MOVE    WRK-DU-2V2-2 TO COMPUTED-N
163800             MOVE    60.89        TO CORRECT-N
163900             PERFORM PRINT-DETAIL.
164000     ADD 1 TO REC-CT.
164100 DIV-TEST-F1-23-3.
164200     IF      WRK-DU-2V2-3 = 60.99
164300             PERFORM PASS
164400             PERFORM PRINT-DETAIL
164500     ELSE
164600             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
164700             PERFORM FAIL
164800             MOVE    WRK-DU-2V2-3 TO COMPUTED-N
164900             MOVE    60.99        TO CORRECT-N
165000             PERFORM PRINT-DETAIL.
165100     ADD 1 TO REC-CT.
165200 DIV-TEST-F1-23-4.
165300     IF      WRK-DU-2V2-4 = 60.99
165400             PERFORM PASS
165500             PERFORM PRINT-DETAIL
165600     ELSE
165700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
165800             PERFORM FAIL
165900             MOVE    WRK-DU-2V2-4 TO COMPUTED-N
166000             MOVE    60.99        TO CORRECT-N
166100             PERFORM PRINT-DETAIL.
166200     ADD 1 TO REC-CT.
166300 DIV-TEST-F1-23-5.
166400     IF      WRK-DU-1V3-2 = 1.001
166500             PERFORM PASS
166600             PERFORM PRINT-DETAIL
166700     ELSE
166800             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
166900             PERFORM FAIL
167000             MOVE    WRK-DU-1V3-2 TO COMPUTED-N
167100             MOVE    1.001        TO CORRECT-N
167200             PERFORM PRINT-DETAIL.
167300     ADD 1 TO REC-CT.
167400 DIV-TEST-F1-23-6.
167500     IF      WRK-DU-2V2-5 = 10.00
167600             PERFORM PASS
167700             PERFORM PRINT-DETAIL
167800     ELSE
167900             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
168000             PERFORM FAIL
168100             MOVE    WRK-DU-2V2-5 TO COMPUTED-N
168200             MOVE    10.00        TO CORRECT-N
168300             PERFORM PRINT-DETAIL.
168400     ADD 1 TO REC-CT.
168500 DIV-TEST-F1-23-7.
168600     IF      WRK-DU-2V1-1 = 10.0
168700             PERFORM PASS
168800             PERFORM PRINT-DETAIL
168900     ELSE
169000             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
169100             PERFORM FAIL
169200             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
169300             MOVE    10.0         TO CORRECT-N
169400             PERFORM PRINT-DETAIL.
169500     ADD 1 TO REC-CT.
169600 DIV-TEST-F1-23-8.
169700     IF      WRK-XN-00001 = "1"
169800             PERFORM PASS
169900             PERFORM PRINT-DETAIL
170000     ELSE
170100             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
170200             PERFORM FAIL
170300             MOVE    WRK-XN-00001 TO COMPUTED-X
170400             MOVE    "1"          TO CORRECT-X
170500             PERFORM PRINT-DETAIL.
170600*
170700*
170800 DIV-INIT-F1-24.
170900*            ==--> NO SIZE ERROR CONDITION <--==
171000*            ==-->   NEW SIZE ERRROR TESTS <--==
171100     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
171200     MOVE   "DIV-TEST-F1-24" TO PAR-NAME.
171300     MOVE     1.001          TO WRK-DU-1V3-1.
171400     MOVE    15.44           TO WRK-DU-2V2-1.
171500     MOVE    60.89           TO WRK-DU-2V2-2.
171600     MOVE    60.99           TO WRK-DU-2V2-3.
171700     MOVE    60.99           TO WRK-DU-2V2-4.
171800     MOVE    10.0            TO WRK-DU-2V2-5.
171900     MOVE     1.001          TO WRK-DU-1V3-2.
172000     MOVE    10.0            TO WRK-DU-2V1-1.
172100     MOVE    1 TO REC-CT.
172200 DIV-TEST-F1-24-0.
172300     DIVIDE  WRK-DU-1V3-1
172400       INTO  WRK-DU-2V2-1
172500             WRK-DU-2V2-2 ROUNDED
172600             WRK-DU-2V2-3
172700             WRK-DU-2V2-4 ROUNDED
172800             WRK-DU-1V3-2
172900             WRK-DU-2V2-5
173000             WRK-DU-2V1-1 ROUNDED
173100          ON SIZE ERROR
173200             MOVE   "1"  TO WRK-XN-00001
173300      NOT ON SIZE ERROR
173400             MOVE   "2"  TO WRK-XN-00001.
173500     GO TO   DIV-TEST-F1-24-1.
173600 DIV-DELETE-F1-24.
173700     PERFORM DE-LETE.
173800     PERFORM PRINT-DETAIL.
173900     GO TO   DIV-INIT-F1-25.
174000 DIV-TEST-F1-24-1.
174100     IF      WRK-DU-2V2-1 = 15.42
174200             PERFORM PASS
174300             PERFORM PRINT-DETAIL
174400     ELSE
174500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
174600             PERFORM FAIL
174700             MOVE    WRK-DU-2V2-1 TO COMPUTED-N
174800             MOVE    15.42        TO CORRECT-N
174900             PERFORM PRINT-DETAIL.
175000     ADD 1 TO REC-CT.
175100 DIV-TEST-F1-24-2.
175200     IF      WRK-DU-2V2-2 = 60.83
175300             PERFORM PASS
175400             PERFORM PRINT-DETAIL
175500     ELSE
175600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
175700             PERFORM FAIL
175800             MOVE    WRK-DU-2V2-2 TO COMPUTED-N
175900             MOVE    60.83        TO CORRECT-N
176000             PERFORM PRINT-DETAIL.
176100     ADD 1 TO REC-CT.
176200 DIV-TEST-F1-24-3.
176300     IF      WRK-DU-2V2-3 = 60.92
176400             PERFORM PASS
176500             PERFORM PRINT-DETAIL
176600     ELSE
176700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
176800             PERFORM FAIL
176900             MOVE    WRK-DU-2V2-3 TO COMPUTED-N
177000             MOVE    60.92        TO CORRECT-N
177100             PERFORM PRINT-DETAIL.
177200     ADD 1 TO REC-CT.
177300 DIV-TEST-F1-24-4.
177400     IF      WRK-DU-2V2-4 = 60.93
177500             PERFORM PASS
177600             PERFORM PRINT-DETAIL
177700     ELSE
177800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
177900             PERFORM FAIL
178000             MOVE    WRK-DU-2V2-4 TO COMPUTED-N
178100             MOVE    60.93        TO CORRECT-N
178200             PERFORM PRINT-DETAIL.
178300     ADD 1 TO REC-CT.
178400 DIV-TEST-F1-24-5.
178500     IF      WRK-DU-1V3-2 = 1.000
178600             PERFORM PASS
178700             PERFORM PRINT-DETAIL
178800     ELSE
178900             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
179000             PERFORM FAIL
179100             MOVE    WRK-DU-1V3-2 TO COMPUTED-N
179200             MOVE    1.000        TO CORRECT-N
179300             PERFORM PRINT-DETAIL.
179400     ADD 1 TO REC-CT.
179500 DIV-TEST-F1-24-6.
179600     IF      WRK-DU-2V2-5 = 09.99
179700             PERFORM PASS
179800             PERFORM PRINT-DETAIL
179900     ELSE
180000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
180100             PERFORM FAIL
180200             MOVE    WRK-DU-2V2-5 TO COMPUTED-N
180300             MOVE    09.99        TO CORRECT-N
180400             PERFORM PRINT-DETAIL.
180500     ADD 1 TO REC-CT.
180600 DIV-TEST-F1-24-7.
180700     IF      WRK-DU-2V1-1 = 10.0
180800             PERFORM PASS
180900             PERFORM PRINT-DETAIL
181000     ELSE
181100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
181200             PERFORM FAIL
181300             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
181400             MOVE    10.00        TO CORRECT-N
181500             PERFORM PRINT-DETAIL.
181600     ADD 1 TO REC-CT.
181700 DIV-TEST-F1-24-8.
181800     IF      WRK-XN-00001 = "2"
181900             PERFORM PASS
182000             PERFORM PRINT-DETAIL
182100     ELSE
182200             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
182300                  TO RE-MARK
182400             PERFORM FAIL
182500             MOVE    WRK-XN-00001 TO COMPUTED-X
182600             MOVE    "2"          TO CORRECT-X
182700             PERFORM PRINT-DETAIL.
182800*
182900*
183000 DIV-INIT-F1-25.
183100*            ==--> NO SIZE ERROR CONDITION <--==
183200*            ==-->EXPLICIT SCOPE TERMINATOR<--==
183300     MOVE   "1V-41 6.4.3 "   TO ANSI-REFERENCE.
183400     MOVE   "DIV-TEST-F1-25       " TO PAR-NAME.
183500     MOVE   "0" TO WRK-XN-00001.
183600     MOVE    0  TO WRK-DS-05V00.
183700     MOVE    0  TO WRK-DS-02V00.
183800     MOVE    0  TO WRK-CS-18V00.
183900     MOVE    1620.36 TO DIV1.
184000     MOVE    44.1    TO DIV2.
184100     MOVE    1 TO REC-CT.
184200 DIV-TEST-F1-25-0.
184300     DIVIDE  DIV2 INTO DIV1
184400          ON SIZE ERROR
184500             MOVE   "1" TO WRK-XN-00001
184600             MOVE   23  TO WRK-DS-05V00
184700             MOVE   -4  TO WRK-DS-02V00
184800     END-DIVIDE
184900     MOVE    99 TO WRK-CS-18V00.
185000     GO TO   DIV-TEST-F1-25-1.
185100 DIV-DELETE-F1-25-1.
185200     PERFORM DE-LETE.
185300     PERFORM PRINT-DETAIL.
185400     GO TO   DIV-INIT-F1-26.
185500 DIV-TEST-F1-25-1.
185600     IF      WRK-XN-00001  = "0"
185700             PERFORM PASS
185800             PERFORM PRINT-DETAIL
185900     ELSE
186000             MOVE    WRK-XN-00001 TO COMPUTED-X
186100             MOVE   "0"           TO CORRECT-X
186200             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
186300                 TO RE-MARK
186400             PERFORM FAIL
186500             PERFORM PRINT-DETAIL.
186600     ADD     1 TO REC-CT.
186700 DIV-TEST-F1-25-2.
186800     IF      WRK-DS-05V00  =  0
186900             PERFORM PASS
187000             PERFORM PRINT-DETAIL
187100     ELSE
187200             MOVE    WRK-DS-05V00 TO COMPUTED-N
187300             MOVE    0            TO CORRECT-N
187400             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
187500                  TO RE-MARK
187600             PERFORM FAIL
187700             PERFORM PRINT-DETAIL.
187800     ADD     1 TO REC-CT.
187900 DIV-TEST-F1-25-3.
188000     IF      WRK-DS-02V00  =  0
188100             PERFORM PASS
188200             PERFORM PRINT-DETAIL
188300     ELSE
188400             MOVE    WRK-DS-02V00 TO COMPUTED-N
188500             MOVE    0            TO CORRECT-N
188600             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
188700                  TO RE-MARK
188800             PERFORM FAIL
188900             PERFORM PRINT-DETAIL.
189000 DIV-TEST-F1-25-4.
189100     IF      WRK-CS-18V00  = 000000000000000099
189200             PERFORM PASS
189300             PERFORM PRINT-DETAIL
189400     ELSE
189500             MOVE    WRK-CS-18V00 TO COMPUTED-N
189600             MOVE    0            TO CORRECT-N
189700             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
189800             PERFORM FAIL
189900             PERFORM PRINT-DETAIL.
190000*
190100*
190200 DIV-INIT-F1-26.
190300*            ==--> NO SIZE ERROR CONDITION <--==
190400*            ==-->EXPLICIT SCOPE TERMINATOR<--==
190500     MOVE   "1V-41 6.4.3 "   TO ANSI-REFERENCE.
190600     MOVE   "DIV-TEST-F1-26       " TO PAR-NAME.
190700     MOVE    111111111.111111111 TO A18ONES-DS-09V09.
190800     MOVE    A18ONES-DS-09V09    TO WRK-DS-09V09.
190900     MOVE   "0" TO WRK-XN-00001.
191000     MOVE    0  TO WRK-DS-05V00.
191100     MOVE    0  TO WRK-DS-02V00.
191200     MOVE    0  TO WRK-CS-18V00.
191300     MOVE    1 TO REC-CT.
191400 DIV-TEST-F1-26-0.
191500     DIVIDE  A18ONES-DS-09V09
191600        INTO WRK-DS-09V09 ROUNDED
191700          ON SIZE ERROR
191800             MOVE   "1" TO WRK-XN-00001
191900             MOVE   23  TO WRK-DS-05V00
192000             MOVE   -4  TO WRK-DS-02V00
192100     END-DIVIDE
192200     MOVE    99 TO WRK-CS-18V00.
192300     GO TO   DIV-TEST-F1-26-1.
192400 DIV-DELETE-F1-26-1.
192500     PERFORM DE-LETE.
192600     PERFORM PRINT-DETAIL.
192700     GO TO   DIV-INIT-F1-27.
192800 DIV-TEST-F1-26-1.
192900     IF      WRK-DS-18V00-S = 000000001000000000
193000             PERFORM PASS
193100             PERFORM PRINT-DETAIL
193200     ELSE
193300             MOVE    000000001000000000 TO CORRECT-18V0
193400             MOVE    WRK-DS-18V00       TO COMPUTED-18V0
193500             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
193600                  TO RE-MARK
193700             PERFORM FAIL
193800             PERFORM PRINT-DETAIL.
193900     ADD     1 TO REC-CT.
194000 DIV-TEST-F1-26-2.
194100     IF      WRK-XN-00001  = "0"
194200             PERFORM PASS
194300             PERFORM PRINT-DETAIL
194400     ELSE
194500             MOVE   "0"           TO CORRECT-X
194600             MOVE    WRK-XN-00001 TO COMPUTED-X
194700             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
194800                  TO RE-MARK
194900             PERFORM FAIL
195000             PERFORM PRINT-DETAIL.
195100     ADD     1 TO REC-CT.
195200 DIV-TEST-F1-26-3.
195300     IF      WRK-DS-05V00  =  0
195400             PERFORM PASS
195500             PERFORM PRINT-DETAIL
195600     ELSE
195700             MOVE    0            TO CORRECT-18V0
195800             MOVE    WRK-DS-05V00 TO COMPUTED-18V0
195900             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
196000                  TO RE-MARK
196100             PERFORM FAIL
196200             PERFORM PRINT-DETAIL.
196300     ADD     1 TO REC-CT.
196400 DIV-TEST-F1-26-4.
196500     IF      WRK-DS-02V00  =  0
196600             PERFORM PASS
196700             PERFORM PRINT-DETAIL
196800     ELSE
196900             MOVE    0            TO CORRECT-18V0
197000             MOVE    WRK-DS-02V00 TO COMPUTED-18V0
197100             PERFORM FAIL
197200             PERFORM PRINT-DETAIL.
197300     ADD     1 TO REC-CT.
197400 DIV-TEST-F1-26-5.
197500     IF      WRK-CS-18V00  = 000000000000000099
197600             PERFORM PASS
197700             PERFORM PRINT-DETAIL
197800     ELSE
197900             MOVE    000000000000000099 TO CORRECT-18V0
198000             MOVE    WRK-CS-18V00       TO COMPUTED-18V0
198100             PERFORM FAIL
198200             PERFORM PRINT-DETAIL.
198300*
198400*
198500 DIV-INIT-F1-27.
198600*            ==--> NO SIZE ERROR CONDITION <--==
198700*            ==-->EXPLICIT SCOPE TERMINATOR<--==
198800     MOVE   "DIV-TEST-F1-27 " TO PAR-NAME.
198900     MOVE   "1V-41 6.4.3 "   TO ANSI-REFERENCE.
199000     MOVE   "0" TO WRK-XN-00001.
199100     MOVE    0  TO WRK-DS-05V00.
199200     MOVE    0  TO WRK-DS-02V00.
199300     MOVE    0  TO WRK-CS-18V00.
199400     MOVE    1620.36 TO DIV1.
199500     MOVE    44.1    TO DIV2.
199600     MOVE    1 TO REC-CT.
199700 DIV-TEST-F1-27-0.
199800     DIVIDE  DIV2 INTO DIV1
199900      NOT ON SIZE ERROR
200000             MOVE   "1" TO WRK-XN-00001
200100             MOVE   23  TO WRK-DS-05V00
200200             MOVE   -4  TO WRK-DS-02V00
200300     END-DIVIDE
200400     MOVE    99 TO WRK-CS-18V00.
200500     GO TO   DIV-TEST-F1-27-1.
200600 DIV-DELETE-F1-27-1.
200700     PERFORM DE-LETE.
200800     PERFORM PRINT-DETAIL.
200900     GO TO   DIV-INIT-F1-28.
201000 DIV-TEST-F1-27-1.
201100     IF      WRK-XN-00001  = "1"
201200             PERFORM PASS
201300             PERFORM PRINT-DETAIL
201400     ELSE
201500             MOVE    WRK-XN-00001 TO COMPUTED-X
201600             MOVE   "1"           TO CORRECT-X
201700             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
201800                  TO RE-MARK
201900             PERFORM FAIL
202000             PERFORM PRINT-DETAIL.
202100     ADD     1 TO REC-CT.
202200 DIV-TEST-F1-27-2.
202300     IF      WRK-DS-05V00 = 23
202400             PERFORM PASS
202500             PERFORM PRINT-DETAIL
202600     ELSE
202700             MOVE    23           TO CORRECT-18V0
202800             MOVE    WRK-DS-05V00 TO COMPUTED-18V0
202900             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
203000                  TO RE-MARK
203100             PERFORM FAIL
203200             PERFORM PRINT-DETAIL.
203300     ADD     1 TO REC-CT.
203400 DIV-TEST-F1-27-3.
203500     IF      WRK-DS-02V00  = -4
203600             PERFORM PASS
203700             PERFORM PRINT-DETAIL
203800     ELSE
203900             MOVE    -4           TO CORRECT-18V0
204000             MOVE    WRK-DS-02V00 TO COMPUTED-18V0
204100             PERFORM FAIL
204200             PERFORM PRINT-DETAIL.
204300     ADD     1 TO REC-CT.
204400 DIV-TEST-F1-27-4.
204500     IF      WRK-CS-18V00  = 000000000000000099
204600             PERFORM PASS
204700             PERFORM PRINT-DETAIL
204800     ELSE
204900             MOVE    000000000000000099 TO CORRECT-18V0
205000             MOVE    WRK-CS-18V00       TO COMPUTED-18V0
205100             PERFORM FAIL
205200             PERFORM PRINT-DETAIL.
205300     ADD     1 TO REC-CT.
205400 DIV-TEST-F1-27-5.
205500     IF      DIV1 = 36.74
205600             PERFORM PASS
205700             PERFORM PRINT-DETAIL
205800     ELSE
205900             MOVE    DIV1  TO COMPUTED-N
206000             MOVE    36.74 TO CORRECT-N
206100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
206200             PERFORM FAIL
206300             PERFORM PRINT-DETAIL.
206400*
206500*
206600 DIV-INIT-F1-28.
206700     MOVE   "DIV-TEST-F1-28 " TO PAR-NAME.
206800     MOVE   "1V-41 6.4.3 "   TO ANSI-REFERENCE.
206900     MOVE   A18ONES-DS-09V09 TO WRK-DS-09V09.
207000     MOVE   "0" TO WRK-XN-00001.
207100     MOVE    0  TO WRK-DS-05V00.
207200     MOVE    0  TO WRK-DS-02V00.
207300     MOVE    0  TO WRK-CS-18V00.
207400     MOVE    1 TO REC-CT.
207500 DIV-TEST-F1-28-0.
207600     DIVIDE  A18ONES-DS-09V09
207700        INTO WRK-DS-09V09 ROUNDED
207800      NOT ON SIZE ERROR
207900             MOVE   "1" TO WRK-XN-00001
208000             MOVE   23  TO WRK-DS-05V00
208100             MOVE   -4  TO WRK-DS-02V00
208200     END-DIVIDE
208300     MOVE    99 TO WRK-CS-18V00.
208400     GO TO   DIV-TEST-F1-28-1.
208500 DIV-DELETE-F1-28-1.
208600     PERFORM DE-LETE.
208700     PERFORM PRINT-DETAIL.
208800     GO TO   DIV-INIT-F1-29.
208900 DIV-TEST-F1-28-1.
209000     IF      WRK-XN-00001  = "1"
209100             PERFORM PASS
209200             PERFORM PRINT-DETAIL
209300     ELSE
209400             MOVE    WRK-XN-00001 TO COMPUTED-X
209500             MOVE   "1"           TO CORRECT-X
209600             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
209700                  TO RE-MARK
209800             PERFORM FAIL
209900             PERFORM PRINT-DETAIL.
210000     ADD     1 TO REC-CT.
210100 DIV-TEST-F1-28-2.
210200     IF      WRK-DS-05V00 = 23
210300             PERFORM PASS
210400             PERFORM PRINT-DETAIL
210500     ELSE
210600             MOVE    23           TO CORRECT-18V0
210700             MOVE    WRK-DS-05V00 TO COMPUTED-18V0
210800             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
210900                  TO RE-MARK
211000             PERFORM FAIL
211100             PERFORM PRINT-DETAIL.
211200     ADD     1 TO REC-CT.
211300 DIV-TEST-F1-28-3.
211400     IF      WRK-DS-02V00  = -4
211500             PERFORM PASS
211600             PERFORM PRINT-DETAIL
211700     ELSE
211800             MOVE    -4           TO CORRECT-18V0
211900             MOVE    WRK-DS-02V00 TO COMPUTED-18V0
212000             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
212100                  TO RE-MARK
212200             PERFORM FAIL
212300             PERFORM PRINT-DETAIL.
212400     ADD     1 TO REC-CT.
212500 DIV-TEST-F1-28-4.
212600     IF      WRK-CS-18V00  = 000000000000000099
212700             PERFORM PASS
212800             PERFORM PRINT-DETAIL
212900     ELSE
213000             MOVE    000000000000000099 TO CORRECT-18V0
213100             MOVE    WRK-CS-18V00       TO COMPUTED-18V0
213200             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
213300             PERFORM FAIL
213400             PERFORM PRINT-DETAIL.
213500     ADD     1 TO REC-CT.
213600 DIV-TEST-F1-28-5.
213700     IF      WRK-DS-09V09 = 1
213800             PERFORM PASS
213900             PERFORM PRINT-DETAIL
214000     ELSE
214100             MOVE    1            TO CORRECT-18V0
214200             MOVE    WRK-DS-09V09 TO COMPUTED-18V0
214300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
214400                  TO RE-MARK
214500             PERFORM FAIL
214600             PERFORM PRINT-DETAIL.
214700*
214800*
214900 DIV-INIT-F1-29.
215000*            ==--> NO SIZE ERROR CONDITION <--==
215100*            ==-->EXPLICIT SCOPE TERMINATOR<--==
215200     MOVE   "DIV-TEST-F1-29 " TO PAR-NAME.
215300     MOVE   "1V-41 6.4.3 "    TO ANSI-REFERENCE.
215400     MOVE   "0" TO WRK-XN-00001.
215500     MOVE    0  TO WRK-CS-18V00.
215600     MOVE    1620.36 TO DIV1.
215700     MOVE    44.1    TO DIV2.
215800     MOVE    1 TO REC-CT.
215900 DIV-TEST-F1-29-0.
216000     DIVIDE  DIV2 INTO DIV1
216100          ON SIZE ERROR
216200             MOVE   "1" TO WRK-XN-00001
216300      NOT ON SIZE ERROR
216400             MOVE   "2" TO WRK-XN-00001
216500     END-DIVIDE
216600     MOVE    99 TO WRK-CS-18V00.
216700     GO TO   DIV-TEST-F1-29-1.
216800 DIV-DELETE-F1-29-1.
216900     PERFORM DE-LETE.
217000     PERFORM PRINT-DETAIL.
217100     GO TO   DIV-INIT-F1-30.
217200 DIV-TEST-F1-29-1.
217300     IF      WRK-XN-00001  = "2"
217400             PERFORM PASS
217500             PERFORM PRINT-DETAIL
217600     ELSE
217700             MOVE    WRK-XN-00001 TO COMPUTED-X
217800             MOVE   "2"           TO CORRECT-X
217900             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
218000                  TO RE-MARK
218100             PERFORM FAIL
218200             PERFORM PRINT-DETAIL.
218300     ADD     1 TO REC-CT.
218400 DIV-TEST-F1-29-2.
218500     IF      WRK-CS-18V00  = 000000000000000099
218600             PERFORM PASS
218700             PERFORM PRINT-DETAIL
218800     ELSE
218900             MOVE    000000000000000099 TO CORRECT-18V0
219000             MOVE    WRK-CS-18V00       TO COMPUTED-18V0
219100             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
219200             PERFORM FAIL
219300             PERFORM PRINT-DETAIL.
219400     ADD     1 TO REC-CT.
219500 DIV-TEST-F1-29-3.
219600     IF      DIV1 = 36.74
219700             PERFORM PASS
219800             PERFORM PRINT-DETAIL
219900     ELSE
220000             MOVE    DIV1  TO COMPUTED-N
220100             MOVE    36.74 TO CORRECT-N
220200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
220300             PERFORM FAIL
220400             PERFORM PRINT-DETAIL.
220500*
220600*
220700 DIV-INIT-F1-30.
220800*            ==--> NO SIZE ERROR CONDITION <--==
220900*            ==-->EXPLICIT SCOPE TERMINATOR<--==
221000     MOVE   "DIV-TEST-F1-30 " TO PAR-NAME.
221100     MOVE   "1V-41 6.4.3 "    TO ANSI-REFERENCE.
221200     MOVE    111111111.111111111 TO A18ONES-DS-09V09.
221300     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
221400     MOVE   "0" TO WRK-XN-00001.
221500     MOVE    0  TO WRK-CS-18V00.
221600     MOVE    1 TO REC-CT.
221700 DIV-TEST-F1-30-0.
221800     DIVIDE  A18ONES-DS-09V09
221900       INTO  WRK-DS-09V09 ROUNDED
222000          ON SIZE ERROR
222100             MOVE   "1" TO WRK-XN-00001
222200      NOT ON SIZE ERROR
222300             MOVE   "2" TO WRK-XN-00001
222400     END-DIVIDE
222500     MOVE    99 TO WRK-CS-18V00.
222600     GO TO   DIV-TEST-F1-30-1.
222700 DIV-DELETE-F1-30-1.
222800     PERFORM DE-LETE.
222900     PERFORM PRINT-DETAIL.
223000     GO TO   CCVS-EXIT.
223100 DIV-TEST-F1-30-1.
223200     IF      WRK-XN-00001  = "2"
223300             PERFORM PASS
223400             PERFORM PRINT-DETAIL
223500     ELSE
223600             MOVE    WRK-XN-00001 TO COMPUTED-X
223700             MOVE   "2"           TO CORRECT-X
223800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
223900                  TO RE-MARK
224000             PERFORM FAIL
224100             PERFORM PRINT-DETAIL.
224200     ADD     1 TO REC-CT.
224300 DIV-TEST-F1-30-2.
224400     IF      WRK-CS-18V00  = 000000000000000099
224500             PERFORM PASS
224600             PERFORM PRINT-DETAIL
224700     ELSE
224800             MOVE    000000000000000099 TO CORRECT-18V0
224900             MOVE    WRK-CS-18V00       TO COMPUTED-18V0
225000             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
225100             PERFORM FAIL
225200             PERFORM PRINT-DETAIL.
225300     ADD     1 TO REC-CT.
225400 DIV-TEST-F1-30-3.
225500     IF      WRK-DS-18V00 = 1
225600             PERFORM PASS
225700             PERFORM PRINT-DETAIL
225800      ELSE
225900             MOVE    1            TO CORRECT-18V0
226000             MOVE    WRK-DS-18V00 TO COMPUTED-18V0
226100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
226200             PERFORM FAIL
226300             PERFORM PRINT-DETAIL.
226400*
226500*
226600 CCVS-EXIT SECTION.
226700 CCVS-999999.
226800     GO TO CLOSE-FILES.
