000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC176A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC176A TESTS FORMAT 1 OF THE ADD STATEMENT.
002300*    VARIOUS COMBINATINS OF DATA-ITEMS AND ALL
002400*    OPTIONAL PHRASES ARE TESTED.
002500*
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 01  42-DATANAMES.
004300     02  DNAME1   PICTURE 9       VALUE 1  COMPUTATIONAL.
004400     02  DNAME2   PICTURE 99      VALUE 1  COMPUTATIONAL.
004500     02  DNAME3   PICTURE 999     VALUE 1  COMPUTATIONAL.
004600     02  DNAME4   PICTURE 9(4)    VALUE 1  COMPUTATIONAL.
004700     02  DNAME5   PICTURE 9(5)    VALUE 1  COMPUTATIONAL.
004800     02  DNAME6   PICTURE 9(6)    VALUE 1  COMPUTATIONAL.
004900     02  DNAME7   PICTURE 9(7)    VALUE 1  COMPUTATIONAL.
005000     02  DNAME8   PICTURE 9(8)    VALUE 1  COMPUTATIONAL.
005100     02  DNAME9   PICTURE 9(9)    VALUE 1  COMPUTATIONAL.
005200     02  DNAME10  PICTURE 9(10)   VALUE 1.
005300     02  DNAME11  PICTURE 9(11)   VALUE 1.
005400     02  DNAME12  PICTURE 9(12)   VALUE 1.
005500     02  DNAME13  PICTURE 9(13)   VALUE 1.
005600     02  DNAME14  PICTURE 9(14)   VALUE 1.
005700     02  DNAME15  PICTURE 9(15)   VALUE 1.
005800     02  DNAME16  PICTURE 9(16)   VALUE 1.
005900     02  DNAME17  PICTURE 9(17)   VALUE 1.
006000     02  DNAME18  PICTURE 9(18)   VALUE 1.
006100     02  DNAME19  PICTURE 9       VALUE 1.
006200     02  DNAME20  PICTURE 99      VALUE 1.
006300     02  DNAME21  PICTURE 999     VALUE 1.
006400     02  DNAME22  PICTURE 9(18)  VALUE ZERO.
006500     02  DNAME23  PICTURE 9(18)  VALUE ZERO.
006600     02  DNAME24  PICTURE 9(18)  VALUE ZERO.
006700     02  DNAME25  PICTURE 9(18)  VALUE ZERO.
006800     02  DNAME26  PICTURE 9(18)  VALUE ZERO.
006900     02  DNAME27  PICTURE 9(18)  VALUE ZERO.
007000     02  DNAME28  PICTURE 9(18)  VALUE ZERO.
007100     02  DNAME29  PICTURE 9(18)  VALUE ZERO.
007200     02  DNAME30   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
007300     02  DNAME31   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
007400     02  DNAME32   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
007500     02  DNAME33   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
007600     02  DNAME34   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
007700     02  DNAME35   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
007800     02  DNAME36   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
007900     02  DNAME37   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
008000     02  DNAME38   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
008100     02  DNAME39   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
008200     02  DNAME40   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
008300     02  DNAME41   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
008400     02  DNAME42   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
008500 77  SIZE-ERR                     PICTURE X  VALUE SPACE.
008600 77  SIZE-ERR2                    PICTURE X  VALUE SPACE.
008700 77  SIZE-ERR3                    PICTURE X  VALUE SPACE.
008800 77  SIZE-ERR4                    PICTURE X  VALUE SPACE.
008900 77  A18TWOS-DS-18V00             PICTURE S9(18)
009000                                  VALUE 222222222222222222.
009100 77  A18ONES-DS-18V00             PICTURE S9(18)
009200                                  VALUE 111111111111111111.
009300 77  WRK-DS-10V00                 PICTURE S9(10).
009400 77  A17TWOS-DS-17V00             PICTURE S9(17)
009500                                  VALUE 22222222222222222.
009600 77  A10ONES-DS-10V00             PICTURE S9(10)
009700                                  VALUE 1111111111.
009800 77  A05ONES-DS-05V00             PICTURE S9(5)
009900                                  VALUE 11111.
010000 77  A02ONES-DS-02V00             PICTURE S99
010100                                  VALUE 11.
010200 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
010300 77  WRK-DS-18V00 REDEFINES WRK-DS-09V09
010400                                  PICTURE S9(18).
010500 77  A06THREES-DS-03V03           PICTURE S999V999
010600                                  VALUE 333.333.
010700 77  A12THREES-DS-06V06           PICTURE S9(6)V9(6)
010800                                  VALUE 333333.333333.
010900 77  WRK-DS-06V06                 PICTURE S9(6)V9(6).
011000 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06
011100                                  PICTURE S9(12).
011200 77  A05ONES-DS-00V05             PICTURE SV9(5)
011300                                  VALUE .11111.
011400 77  WRK-DS-05V00                 PICTURE S9(5).
011500 77  WRK-DS-02V00                 PICTURE S99.
011600 77  A12ONES-DS-12V00             PICTURE S9(12)
011700                                  VALUE 111111111111.
011800 77  WRK-DS-03V10                 PICTURE S999V9(10).
011900 77  WRK-DS-13V00-S REDEFINES WRK-DS-03V10
012000                                  PICTURE S9(13).
012100 77  A99-DS-02V00                 PICTURE S99
012200                                  VALUE 99.
012300 77  A03ONES-DS-02V01             PICTURE S99V9
012400                                  VALUE 11.1.
012500 77  A06ONES-DS-03V03             PICTURE S999V999
012600                                  VALUE 111.111.
012700 77  A08TWOS-DS-02V06             PICTURE S99V9(6)
012800                                  VALUE 22.222222.
012900 77  A01ONE-DS-P0801              PICTURE SP(8)9
013000                                  VALUE .000000001.
013100 77  WRK-CS-18V00                 PICTURE S9(18) COMPUTATIONAL.
013200 77  A18ONES-CS-18V00             PICTURE S9(18) COMPUTATIONAL
013300                                  VALUE 111111111111111111.
013400 77  WRK-CS-02V02                 PICTURE S99V99 COMPUTATIONAL.
013500 77  A99-CS-02V00                 PICTURE S99 COMPUTATIONAL
013600                                  VALUE 99.
013700 77  WRK-DS-0201P                 PICTURE S99P.
013800 77  WRK-DS-06V00                 PICTURE S9(6).
013900 77  AZERO-DS-05V05               PICTURE S9(5)V9(5)
014000                                  VALUE ZERO.
014100 77  NDATA-DS-09V09               PICTURE S9(9)V9(9)
014200                                  VALUE +012345678.876543210.
014300 77  XDATA-XN-00018               PICTURE X(18)
014400                                  VALUE "00ABCDEFGHI  4321 ".
014500 77  WRK-XN-00018                 PICTURE X(18).
014600 77  WRK-XN-00001                 PICTURE X.
014700 77  ADD-12    PICTURE PP9        VALUE .001.
014800 77  ADD-13    PICTURE 9PP        VALUE 100.
014900 77  ADD-14    PICTURE 999V999.
015000 77  WRK-CU-18V00      PICTURE 9(18) VALUE ZERO COMPUTATIONAL.
015100 01  WRK-DU-1V0-1 PIC 9 VALUE ZERO.
015200 01  WRK-DU-1V1-1 PIC 9V9 VALUE 1.1.
015300 01  WRK-DU-1V1-2 PIC 9V9 VALUE 2.4.
015400 01  WRK-DU-1V3-1 PIC 9V999 VALUE 1.001.
015500 01  WRK-DU-1V3-2 PIC 9V999 VALUE 1.001.
015600 01  WRK-DU-1V5-1 PIC 9V9(5).
015700 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
015800 01  WRK-DU-2P6-1 PIC 99P(6) VALUE 99000000.
015900 01  WRK-DU-2V0-1 PIC 99.
016000 01  WRK-DU-2V0-2 PIC 99.
016100 01  WRK-DU-2V0-3 PIC 99.
016200 01  WRK-DU-2V1-1 PIC 99V9.
016300 01  WRK-DU-2V1-2 PIC 99V9.
016400 01  WRK-DU-2V1-3 PIC 99V9.
016500 77  A18EIGHTS-CS-18V00 PICTURE S9(18) VALUE -888888888888888888
016600             COMPUTATIONAL.
016700 77  A14TWOS-CS-18V00  PICTURE S9(18) VALUE -000022222222222222
016800             COMPUTATIONAL.
016900 77  A12THREES-CU-18V00 PICTURE 9(18) VALUE 000000333333333333
017000             COMPUTATIONAL.
017100 77  A16FOURS-CS-18V00 PICTURE S9(18) VALUE 004444444444444444
017200             COMPUTATIONAL.
017300 77  A18FIVES-CS-18V00 PICTURE S9(18) VALUE -555555555555555555
017400             COMPUTATIONAL.
017500 77  A18SIXES-CS-18V00 PICTURE S9(18) VALUE 666666666666666666
017600             COMPUTATIONAL.
017700 77  A12SEVENS-CU-18V00 PICTURE 9(18) VALUE 000000777777777777
017800             COMPUTATIONAL.
017900 77  WRK-DU-18V00      PICTURE 9(18) VALUE ZERO.
018000 77  A18THREES-CS-18V00 PICTURE S9(18) VALUE -333333333333333333
018100             COMPUTATIONAL.
018200 77  WRK-CS-03V00 PICTURE S999 COMPUTATIONAL SYNCHRONIZED RIGHT.
018300 01  SUBTRACT-DATA.
018400     02  SUBTR-1    PICTURE 9         VALUE 1.
018500     02  SUBTR-2    PICTURE S99       VALUE 99.
018600     02  SUBTR-3    PICTURE S9V99     VALUE -1.
018700     02  SUBTR-4    PICTURE SPP9      VALUE .001.
018800     02  SUBTR-5    PICTURE S9PP      VALUE 100.
018900     02  SUBTR-6    PICTURE 9  VALUE 1.
019000     02  SUBTR-7    PICTURE S99  VALUE 99.
019100     02  SUBTR-8    PICTURE S9V99  VALUE -9.99.
019200     02  SUBTR-10    PICTURE S999  VALUE 100.
019300     02  SUBTR-11   PICTURE S999V999.
019400 01  N-3                                PICTURE IS 99999.
019500 01  N-4                                PICTURE IS 9(5)
019600     VALUE IS 52800.
019700 01  N-5                                PICTURE IS S9(9)V99
019800     VALUE IS 000000001.00.
019900 01  N-7                                PICTURE IS S9(7)V9(4)
020000     VALUE IS 0000001.0000.
020100 01  X-8 REDEFINES N-7                  PICTURE IS X(11).
020200 01  N-10                               PICTURE IS S99999V
020300     VALUE IS -00001.
020400 01  N-11                               PICTURE IS 9 VALUE IS 9.
020500 01  N-12                               PICTURE IS 9 VALUE IS 9.
020600 01  N-13                               PICTURE IS 9(5)
020700     VALUE IS 99999.
020800 01  N-14                               PICTURE IS 9 VALUE IS 1.
020900 01  N-15                               PICTURE IS 9(16).
021000 01  N-16                               PICTURE IS S999999V99
021100     VALUE IS 5.90.
021200 01  N-17                               PICTURE IS S9(3)V99
021300     VALUE IS +3.6.
021400 01  N-18                               PICTURE IS S9(10)
021500     VALUE IS -5.
021600 01  N-19                               PICTURE IS $9.00.
021700 01  N-20                               PICTURE IS S9(9)
021800     VALUE IS -999999999.
021900 01  N-21                               PICTURE IS 9 VALUE IS 5.
022000 01  N-22                               PICTURE IS 999V99
022100     VALUE IS 005.55.
022200 01  N-23                               PICTURE IS $$$.99CR.
022300 01  N-25                               PICTURE IS 9 VALUE IS 1.
022400 01  N-26               PICTURE 9(5).
022500 01  N-27                               PICTURE IS 9999V9
022600     VALUE IS 9999.9.
022700 01  N-28                               PICTURE IS $9999.00.
022800 01  N-40                               PICTURE IS 9(7)
022900     VALUE IS 7777777.
023000 01  N-41                               PICTURE IS 9(7)
023100     VALUE IS 1111111.
023200 01  N-42                               PICTURE IS 9(3)P(4).
023300 01  TRUNC-DATA.
023400     02 N-43  PICTURE S9V9 VALUE +1.6.
023500     02 N-44  PICTURE S9V9 VALUE -1.6.
023600     02 N-45  PICTURE S9.
023700 01  MINUS-NAMES.
023800     02  MINUS-NAME1 PICTURE S9(18) VALUE -999999999999999999.
023900     02  MINUS-NAME2 PICTURE S9(18) VALUE -999999999999999999.
024000     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
024100     02  PLUS-NAME1  PICTURE S9(18) VALUE +999999999999999999.
024200     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
024300     02  MINUS-NAME3 PICTURE SV9(18) VALUE -.999999999999999999.
024400     02  MINUS-NAME4 PICTURE SV9(18) VALUE -.999999999999999999.
024500     02  EVEN-NAME2  PICTURE SV9(18)  VALUE +.1.
024600     02  PLUS-NAME3  PICTURE SV9(18) VALUE +.999999999999999999.
024700     02  PLUS-NAME4  PICTURE SV9(18) VALUE +.999999999999999999.
024800     02  WHOLE-FIELD   PICTURE S9(18).
024900     02  DECMAL-FIELD  PICTURE SV9(18).
025000 01  TEST-RESULTS.
025100     02 FILLER                   PIC X      VALUE SPACE.
025200     02 FEATURE                  PIC X(20)  VALUE SPACE.
025300     02 FILLER                   PIC X      VALUE SPACE.
025400     02 P-OR-F                   PIC X(5)   VALUE SPACE.
025500     02 FILLER                   PIC X      VALUE SPACE.
025600     02  PAR-NAME.
025700       03 FILLER                 PIC X(19)  VALUE SPACE.
025800       03  PARDOT-X              PIC X      VALUE SPACE.
025900       03 DOTVALUE               PIC 99     VALUE ZERO.
026000     02 FILLER                   PIC X(8)   VALUE SPACE.
026100     02 RE-MARK                  PIC X(61).
026200 01  TEST-COMPUTED.
026300     02 FILLER                   PIC X(30)  VALUE SPACE.
026400     02 FILLER                   PIC X(17)  VALUE
026500            "       COMPUTED=".
026600     02 COMPUTED-X.
026700     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
026800     03 COMPUTED-N               REDEFINES COMPUTED-A
026900                                 PIC -9(9).9(9).
027000     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
027100     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
027200     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
027300     03       CM-18V0 REDEFINES COMPUTED-A.
027400         04 COMPUTED-18V0                    PIC -9(18).
027500         04 FILLER                           PIC X.
027600     03 FILLER PIC X(50) VALUE SPACE.
027700 01  TEST-CORRECT.
027800     02 FILLER PIC X(30) VALUE SPACE.
027900     02 FILLER PIC X(17) VALUE "       CORRECT =".
028000     02 CORRECT-X.
028100     03 CORRECT-A                  PIC X(20) VALUE SPACE.
028200     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
028300     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
028400     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
028500     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
028600     03      CR-18V0 REDEFINES CORRECT-A.
028700         04 CORRECT-18V0                     PIC -9(18).
028800         04 FILLER                           PIC X.
028900     03 FILLER PIC X(2) VALUE SPACE.
029000     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
029100 01  CCVS-C-1.
029200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
029300-    "SS  PARAGRAPH-NAME
029400-    "       REMARKS".
029500     02 FILLER                     PIC X(20)    VALUE SPACE.
029600 01  CCVS-C-2.
029700     02 FILLER                     PIC X        VALUE SPACE.
029800     02 FILLER                     PIC X(6)     VALUE "TESTED".
029900     02 FILLER                     PIC X(15)    VALUE SPACE.
030000     02 FILLER                     PIC X(4)     VALUE "FAIL".
030100     02 FILLER                     PIC X(94)    VALUE SPACE.
030200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
030300 01  REC-CT                        PIC 99       VALUE ZERO.
030400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
030500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
030600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
030700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
030800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
030900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
031000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
031100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
031200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
031300 01  CCVS-H-1.
031400     02  FILLER                    PIC X(39)    VALUE SPACES.
031500     02  FILLER                    PIC X(42)    VALUE
031600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
031700     02  FILLER                    PIC X(39)    VALUE SPACES.
031800 01  CCVS-H-2A.
031900   02  FILLER                        PIC X(40)  VALUE SPACE.
032000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
032100   02  FILLER                        PIC XXXX   VALUE
032200     "4.2 ".
032300   02  FILLER                        PIC X(28)  VALUE
032400            " COPY - NOT FOR DISTRIBUTION".
032500   02  FILLER                        PIC X(41)  VALUE SPACE.
032600
032700 01  CCVS-H-2B.
032800   02  FILLER                        PIC X(15)  VALUE
032900            "TEST RESULT OF ".
033000   02  TEST-ID                       PIC X(9).
033100   02  FILLER                        PIC X(4)   VALUE
033200            " IN ".
033300   02  FILLER                        PIC X(12)  VALUE
033400     " HIGH       ".
033500   02  FILLER                        PIC X(22)  VALUE
033600            " LEVEL VALIDATION FOR ".
033700   02  FILLER                        PIC X(58)  VALUE
033800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
033900 01  CCVS-H-3.
034000     02  FILLER                      PIC X(34)  VALUE
034100            " FOR OFFICIAL USE ONLY    ".
034200     02  FILLER                      PIC X(58)  VALUE
034300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
034400     02  FILLER                      PIC X(28)  VALUE
034500            "  COPYRIGHT   1985 ".
034600 01  CCVS-E-1.
034700     02 FILLER                       PIC X(52)  VALUE SPACE.
034800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
034900     02 ID-AGAIN                     PIC X(9).
035000     02 FILLER                       PIC X(45)  VALUE SPACES.
035100 01  CCVS-E-2.
035200     02  FILLER                      PIC X(31)  VALUE SPACE.
035300     02  FILLER                      PIC X(21)  VALUE SPACE.
035400     02 CCVS-E-2-2.
035500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
035600         03 FILLER                   PIC X      VALUE SPACE.
035700         03 ENDER-DESC               PIC X(44)  VALUE
035800            "ERRORS ENCOUNTERED".
035900 01  CCVS-E-3.
036000     02  FILLER                      PIC X(22)  VALUE
036100            " FOR OFFICIAL USE ONLY".
036200     02  FILLER                      PIC X(12)  VALUE SPACE.
036300     02  FILLER                      PIC X(58)  VALUE
036400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
036500     02  FILLER                      PIC X(13)  VALUE SPACE.
036600     02 FILLER                       PIC X(15)  VALUE
036700             " COPYRIGHT 1985".
036800 01  CCVS-E-4.
036900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
037000     02 FILLER                       PIC X(4)   VALUE " OF ".
037100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
037200     02 FILLER                       PIC X(40)  VALUE
037300      "  TESTS WERE EXECUTED SUCCESSFULLY".
037400 01  XXINFO.
037500     02 FILLER                       PIC X(19)  VALUE
037600            "*** INFORMATION ***".
037700     02 INFO-TEXT.
037800       04 FILLER                     PIC X(8)   VALUE SPACE.
037900       04 XXCOMPUTED                 PIC X(20).
038000       04 FILLER                     PIC X(5)   VALUE SPACE.
038100       04 XXCORRECT                  PIC X(20).
038200     02 INF-ANSI-REFERENCE           PIC X(48).
038300 01  HYPHEN-LINE.
038400     02 FILLER  PIC IS X VALUE IS SPACE.
038500     02 FILLER  PIC IS X(65)    VALUE IS "************************
038600-    "*****************************************".
038700     02 FILLER  PIC IS X(54)    VALUE IS "************************
038800-    "******************************".
038900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
039000     "NC176A".
039100 PROCEDURE DIVISION.
039200 CCVS1 SECTION.
039300 OPEN-FILES.
039400     OPEN     OUTPUT PRINT-FILE.
039500     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
039600     MOVE    SPACE TO TEST-RESULTS.
039700     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
039800     GO TO CCVS1-EXIT.
039900 CLOSE-FILES.
040000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
040100 TERMINATE-CCVS.
040200S    EXIT PROGRAM.
040300STERMINATE-CALL.
040400     STOP     RUN.
040500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
040600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
040700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
040800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
040900     MOVE "****TEST DELETED****" TO RE-MARK.
041000 PRINT-DETAIL.
041100     IF REC-CT NOT EQUAL TO ZERO
041200             MOVE "." TO PARDOT-X
041300             MOVE REC-CT TO DOTVALUE.
041400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
041500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
041600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
041700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
041800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
041900     MOVE SPACE TO CORRECT-X.
042000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
042100     MOVE     SPACE TO RE-MARK.
042200 HEAD-ROUTINE.
042300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
042600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
042700 COLUMN-NAMES-ROUTINE.
042800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
042900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
043100 END-ROUTINE.
043200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
043300 END-RTN-EXIT.
043400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043500 END-ROUTINE-1.
043600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
043700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
043800      ADD PASS-COUNTER TO ERROR-HOLD.
043900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
044000      MOVE PASS-COUNTER TO CCVS-E-4-1.
044100      MOVE ERROR-HOLD TO CCVS-E-4-2.
044200      MOVE CCVS-E-4 TO CCVS-E-2-2.
044300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
044400  END-ROUTINE-12.
044500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
044600     IF       ERROR-COUNTER IS EQUAL TO ZERO
044700         MOVE "NO " TO ERROR-TOTAL
044800         ELSE
044900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
045000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
045100     PERFORM WRITE-LINE.
045200 END-ROUTINE-13.
045300     IF DELETE-COUNTER IS EQUAL TO ZERO
045400         MOVE "NO " TO ERROR-TOTAL  ELSE
045500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
045600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
045700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
045800      IF   INSPECT-COUNTER EQUAL TO ZERO
045900          MOVE "NO " TO ERROR-TOTAL
046000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
046100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
046200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046400 WRITE-LINE.
046500     ADD 1 TO RECORD-COUNT.
046600Y    IF RECORD-COUNT GREATER 42
046700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
046800Y        MOVE SPACE TO DUMMY-RECORD
046900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
047000Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
047100Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
047200Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
047300Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
047400Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
047500Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
047600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
047700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
047800Y        MOVE ZERO TO RECORD-COUNT.
047900     PERFORM WRT-LN.
048000 WRT-LN.
048100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
048200     MOVE SPACE TO DUMMY-RECORD.
048300 BLANK-LINE-PRINT.
048400     PERFORM WRT-LN.
048500 FAIL-ROUTINE.
048600     IF     COMPUTED-X NOT EQUAL TO SPACE
048700            GO TO FAIL-ROUTINE-WRITE.
048800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
048900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
049000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
049100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049200     MOVE   SPACES TO INF-ANSI-REFERENCE.
049300     GO TO  FAIL-ROUTINE-EX.
049400 FAIL-ROUTINE-WRITE.
049500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
049600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
049700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
049800     MOVE   SPACES TO COR-ANSI-REFERENCE.
049900 FAIL-ROUTINE-EX. EXIT.
050000 BAIL-OUT.
050100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
050200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
050300 BAIL-OUT-WRITE.
050400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
050500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
050600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050700     MOVE   SPACES TO INF-ANSI-REFERENCE.
050800 BAIL-OUT-EX. EXIT.
050900 CCVS1-EXIT.
051000     EXIT.
051100 SECT-NC176A-001 SECTION.
051200 ADD-INIT-F1-1.
051300     MOVE "ADD" TO FEATURE.
051400     MOVE "VI-74 6.6.4 GR4" TO ANSI-REFERENCE.
051500 ADD-TEST-F1-1.
051600     ADD      N-5 TO N-7.
051700     IF       N-7 IS EQUAL TO 2
051800              PERFORM PASS
051900              GO TO ADD-WRITE-F1-1.
052000     GO TO    ADD-FAIL-F1-1.
052100 ADD-DELETE-F1-1.
052200     PERFORM  DE-LETE.
052300     GO TO    ADD-WRITE-F1-1.
052400 ADD-FAIL-F1-1.
052500     MOVE N-7 TO COMPUTED-N.
052600     MOVE     2 TO CORRECT-N.
052700     PERFORM  FAIL.
052800 ADD-WRITE-F1-1.
052900     MOVE "ADD-TEST-F1-1 " TO PAR-NAME.
053000     PERFORM  PRINT-DETAIL.
053100 ADD-TEST-F1-2.
053200     ADD      -.6 TO N-10 ROUNDED.
053300     IF       N-10 EQUAL TO -2
053400              PERFORM PASS
053500              GO TO ADD-WRITE-F1-2.
053600     GO TO    ADD-FAIL-F1-2.
053700 ADD-DELETE-F1-2.
053800     PERFORM  DE-LETE.
053900     GO TO    ADD-WRITE-F1-2.
054000 ADD-FAIL-F1-2.
054100     MOVE     N-10 TO COMPUTED-N.
054200     MOVE     -2 TO CORRECT-N.
054300     PERFORM  FAIL.
054400 ADD-WRITE-F1-2.
054500     MOVE "ADD-TEST-F1-2 " TO PAR-NAME.
054600     PERFORM  PRINT-DETAIL.
054700     MOVE     -2 TO N-10.
054800 ADD-TEST-F1-3-0.
054900     ADD      N-11 TO N-12 ON SIZE ERROR
055000              PERFORM PASS
055100              GO TO ADD-WRITE-F1-3.
055200     GO TO    ADD-FAIL-F1-3.
055300 ADD-DELETE-F1-3.
055400     PERFORM  DE-LETE.
055500     GO TO    ADD-WRITE-F1-3.
055600 ADD-FAIL-F1-3.
055700     MOVE     N-12 TO COMPUTED-N.
055800     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
055900     PERFORM  FAIL.
056000 ADD-WRITE-F1-3.
056100     MOVE "ADD-TEST-F1-3 " TO PAR-NAME.
056200     PERFORM  PRINT-DETAIL.
056300 ADD-TEST-F1-4-1.
056400     ADD      1.5 TO N-13 ROUNDED ON SIZE ERROR
056500              PERFORM PASS
056600              GO TO ADD-WRITE-F1-4-1.
056700*    NOTE WHEN SIZE ERROR CONDITION OCCURS, VALUE OF
056800*    N-13 SHOULD NOT BE CHANGED.
056900     GO TO    ADD-FAIL-F1-4-1.
057000 ADD-DELETE-F1-4-1.
057100     PERFORM  DE-LETE.
057200     GO TO    ADD-WRITE-F1-4-1.
057300 ADD-FAIL-F1-4-1.
057400     MOVE     N-13 TO COMPUTED-N.
057500     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
057600     PERFORM  FAIL.
057700 ADD-WRITE-F1-4-1.
057800     MOVE "ADD-TEST-F1-4-1 " TO PAR-NAME.
057900     PERFORM  PRINT-DETAIL.
058000 ADD-TEST-F1-4-2.
058100     IF       N-13 IS EQUAL TO 99999
058200              PERFORM PASS
058300              GO TO ADD-WRITE-F1-4-2.
058400     GO TO    ADD-FAIL-F1-4-2.
058500 ADD-DELETE-F1-4-2.
058600     PERFORM  DE-LETE.
058700     GO TO    ADD-WRITE-F1-4-2.
058800 ADD-FAIL-F1-4-2.
058900     MOVE     N-13 TO COMPUTED-N.
059000     MOVE     99999 TO CORRECT-N.
059100     PERFORM  FAIL.
059200 ADD-WRITE-F1-4-2.
059300     MOVE "ADD-TEST-F1-4-2 " TO PAR-NAME.
059400     PERFORM  PRINT-DETAIL.
059500 ADD-INIT-F1-5.
059600     MOVE "ADD ---" TO FEATURE.
059700     PERFORM  PRINT-DETAIL.
059800     MOVE "  TO" TO FEATURE.
059900 ADD-TEST-F1-5.
060000     MOVE     A18TWOS-DS-18V00 TO WRK-DS-18V00.
060100     ADD      A18ONES-DS-18V00 TO WRK-DS-18V00.
060200     IF       WRK-DS-18V00 EQUAL TO 333333333333333333
060300              PERFORM PASS GO TO ADD-WRITE-F1-5.
060400     GO       TO ADD-FAIL-F1-5.
060500 ADD-DELETE-F1-5.
060600     PERFORM  DE-LETE.
060700     GO       TO ADD-WRITE-F1-5.
060800 ADD-FAIL-F1-5.
060900     MOVE     WRK-DS-18V00 TO COMPUTED-18V0.
061000     MOVE     333333333333333333   TO CORRECT-18V0.
061100     PERFORM  FAIL.
061200 ADD-WRITE-F1-5.
061300     MOVE     "ADD-TEST-F1-5" TO PAR-NAME.
061400     PERFORM  PRINT-DETAIL.
061500 ADD-TEST-F1-6.
061600     MOVE     ZERO TO WRK-DS-10V00.
061700     ADD      A10ONES-DS-10V00 A05ONES-DS-05V00 TO WRK-DS-10V00.
061800     IF       WRK-DS-10V00 EQUAL TO 1111122222
061900              PERFORM PASS GO TO ADD-WRITE-F1-6.
062000     GO       TO ADD-FAIL-F1-6.
062100 ADD-DELETE-F1-6.
062200     PERFORM  DE-LETE.
062300     GO       TO ADD-WRITE-F1-6.
062400 ADD-FAIL-F1-6.
062500     MOVE     WRK-DS-10V00 TO COMPUTED-18V0.
062600     MOVE     1111122222   TO CORRECT-18V0.
062700     PERFORM  FAIL.
062800 ADD-WRITE-F1-6.
062900     MOVE     "ADD-TEST-F1-6" TO PAR-NAME.
063000     PERFORM  PRINT-DETAIL.
063100 ADD-TEST-F1-7.
063200     MOVE     ZERO TO WRK-DS-10V00.
063300     ADD      A02ONES-DS-02V00
063400              A10ONES-DS-10V00
063500              A05ONES-DS-05V00 TO WRK-DS-10V00.
063600     IF       WRK-DS-10V00 EQUAL TO 1111122233
063700              PERFORM PASS GO TO ADD-WRITE-F1-7.
063800     GO       TO ADD-FAIL-F1-7.
063900 ADD-DELETE-F1-7.
064000     PERFORM  DE-LETE.
064100     GO       TO ADD-WRITE-F1-7.
064200 ADD-FAIL-F1-7.
064300     MOVE     WRK-DS-10V00 TO COMPUTED-18V0.
064400     MOVE     1111122233   TO CORRECT-18V0.
064500     PERFORM  FAIL.
064600 ADD-WRITE-F1-7.
064700     MOVE     "ADD-TEST-F1-7" TO PAR-NAME.
064800     PERFORM  PRINT-DETAIL.
064900 ADD-INIT-F1-8.
065000     MOVE "  ROUNDED" TO FEATURE.
065100 ADD-TEST-F1-8.
065200     MOVE     ZERO TO WRK-DS-05V00.
065300     ADD      55554.5 TO WRK-DS-05V00 ROUNDED.
065400     IF       WRK-DS-05V00 EQUAL TO 55555
065500              PERFORM PASS GO TO ADD-WRITE-F1-8.
065600     GO       TO ADD-FAIL-F1-8.
065700 ADD-DELETE-F1-8.
065800     PERFORM  DE-LETE.
065900     GO       TO ADD-WRITE-F1-8.
066000 ADD-FAIL-F1-8.
066100     MOVE     WRK-DS-05V00 TO COMPUTED-N.
066200     MOVE     55555 TO CORRECT-N.
066300     PERFORM  FAIL.
066400 ADD-WRITE-F1-8.
066500     MOVE     "ADD-TEST-F1-8" TO PAR-NAME.
066600     PERFORM  PRINT-DETAIL.
066700 ADD-INIT-F1-9-1.
066800     MOVE "  SIZE ERROR" TO FEATURE.
066900     MOVE     -11 TO WRK-DS-02V00.
067000 ADD-TEST-F1-9-1.
067100     ADD      -99 TO WRK-DS-02V00 ON SIZE ERROR
067200              PERFORM PASS GO TO ADD-WRITE-F1-9-1.
067300     GO       TO ADD-FAIL-F1-9-1.
067400 ADD-DELETE-F1-9-1.
067500     PERFORM  DE-LETE.
067600     GO       TO ADD-WRITE-F1-9-1.
067700 ADD-FAIL-F1-9-1.
067800     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
067900     PERFORM  FAIL.
068000 ADD-WRITE-F1-9-1.
068100     MOVE     "ADD-TEST-F1-9-1" TO PAR-NAME.
068200     PERFORM  PRINT-DETAIL.
068300 ADD-TEST-F1-9-2.
068400     IF       WRK-DS-02V00 EQUAL TO -11
068500              PERFORM PASS GO TO ADD-WRITE-F1-9-2.
068600*    THIS TEST DEPENDS ON THE RESULTS OF TEST-F1-9-1 ABOVE.
068700     GO       TO ADD-FAIL-F1-9-2.
068800 ADD-DELETE-F1-9-2.
068900     PERFORM  DE-LETE.
069000     GO       TO ADD-WRITE-F1-9-2.
069100 ADD-FAIL-F1-9-2.
069200     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
069300     MOVE     WRK-DS-02V00 TO COMPUTED-N.
069400     MOVE     -11 TO CORRECT-N.
069500     PERFORM  FAIL.
069600 ADD-WRITE-F1-9-2.
069700     MOVE     "ADD-TEST-F1-9-2" TO PAR-NAME.
069800     PERFORM  PRINT-DETAIL.
069900 ADD-INIT-F1-10-1.
070000     MOVE "  ROUNDED,SIZE ERROR" TO FEATURE.
070100 ADD-TEST-F1-10-1.
070200     MOVE     ZERO TO WRK-DS-05V00
070300     ADD      33333
070400              A06THREES-DS-03V03
070500              A12THREES-DS-06V06
070600              TO WRK-DS-05V00 ROUNDED ON SIZE ERROR
070700              PERFORM PASS GO TO ADD-WRITE-F1-10-1.
070800     GO       TO ADD-FAIL-F1-10-1.
070900 ADD-DELETE-F1-10-1.
071000     PERFORM  DE-LETE.
071100     GO       TO ADD-WRITE-F1-10-1.
071200 ADD-FAIL-F1-10-1.
071300     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
071400     PERFORM  FAIL.
071500 ADD-WRITE-F1-10-1.
071600     MOVE     "ADD-TEST-F1-10-1" TO PAR-NAME.
071700     PERFORM  PRINT-DETAIL.
071800 ADD-TEST-F1-10-2.
071900     IF       WRK-DS-05V00 EQUAL TO ZERO
072000              PERFORM PASS GO TO ADD-WRITE-F1-10-2.
072100*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF ADD-TEST-F1-10-1
072200     GO       TO ADD-FAIL-F1-10-2.
072300 ADD-DELETE-F1-10-2.
072400     PERFORM  DE-LETE.
072500     GO       TO ADD-WRITE-F1-10-2.
072600 ADD-FAIL-F1-10-2.
072700     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
072800     MOVE     WRK-DS-05V00 TO COMPUTED-N.
072900     MOVE     ZERO TO CORRECT-N.
073000     PERFORM  FAIL.
073100 ADD-WRITE-F1-10-2.
073200     MOVE     "ADD-TEST-F1-10-2" TO PAR-NAME.
073300     PERFORM  PRINT-DETAIL.
073400 ADD-TEST-F1-11-1.
073500     MOVE     ZERO TO WRK-DS-06V06.
073600     ADD      A12THREES-DS-06V06
073700              333333
073800              A06THREES-DS-03V03
073900              TO WRK-DS-06V06 ROUNDED ON SIZE ERROR
074000              GO TO ADD-FAIL-F1-11-1.
074100     PERFORM  PASS.
074200     GO TO ADD-WRITE-F1-11-1.
074300 ADD-DELETE-F1-11-1.
074400     PERFORM  DE-LETE.
074500     GO       TO ADD-WRITE-F1-11-1.
074600 ADD-FAIL-F1-11-1.
074700     MOVE     "SIZE ERR SHOULD NOT EXECUTE" TO RE-MARK.
074800     PERFORM  FAIL.
074900 ADD-WRITE-F1-11-1.
075000     MOVE     "ADD-TEST-F1-11-1" TO PAR-NAME.
075100     PERFORM  PRINT-DETAIL.
075200 ADD-TEST-F1-11-2.
075300     IF       WRK-DS-06V06 EQUAL TO 666999.666333
075400              PERFORM PASS GO TO ADD-WRITE-F1-11-2.
075500*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF ADD-TEST-F1-11-1
075600     GO       TO ADD-FAIL-F1-11-2.
075700 ADD-DELETE-F1-11-2.
075800     PERFORM  DE-LETE.
075900     GO       TO ADD-WRITE-F1-11-2.
076000 ADD-FAIL-F1-11-2.
076100     MOVE     WRK-DS-06V06 TO COMPUTED-N.
076200     MOVE     666999.666333 TO CORRECT-N.
076300     PERFORM  FAIL.
076400 ADD-WRITE-F1-11-2.
076500     MOVE     "ADD-TEST-F1-11-2" TO PAR-NAME.
076600     PERFORM  PRINT-DETAIL.
076700 ADD-INIT-F1-12.
076800     MOVE "  COMP VS. DISPLAY"  TO FEATURE.
076900 ADD-TEST-F1-12.
077000     MOVE     A18ONES-DS-18V00 TO WRK-CS-18V00.
077100     ADD      A18ONES-DS-18V00 TO WRK-CS-18V00.
077200     IF       WRK-CS-18V00 EQUAL TO 222222222222222222
077300              PERFORM PASS GO TO ADD-WRITE-F1-12.
077400     GO       TO ADD-FAIL-F1-12.
077500 ADD-DELETE-F1-12.
077600     PERFORM  DE-LETE.
077700     GO       TO ADD-WRITE-F1-12.
077800 ADD-FAIL-F1-12.
077900     MOVE     WRK-CS-18V00 TO COMPUTED-18V0.
078000     MOVE     222222222222222222 TO CORRECT-18V0.
078100     PERFORM  FAIL.
078200 ADD-WRITE-F1-12.
078300     MOVE     "ADD-TEST-F1-12" TO PAR-NAME.
078400     PERFORM  PRINT-DETAIL.
078500 ADD-TEST-F1-13.
078600     MOVE     A18ONES-DS-18V00 TO WRK-DS-18V00.
078700     ADD      A18ONES-CS-18V00 TO WRK-DS-18V00.
078800     IF       WRK-DS-18V00 EQUAL TO 222222222222222222
078900              PERFORM PASS GO TO ADD-WRITE-F1-13.
079000     GO       TO ADD-FAIL-F1-13.
079100 ADD-DELETE-F1-13.
079200     PERFORM  DE-LETE.
079300     GO       TO ADD-WRITE-F1-13.
079400 ADD-FAIL-F1-13.
079500     MOVE     WRK-DS-18V00 TO COMPUTED-18V0.
079600     MOVE     222222222222222222 TO CORRECT-18V0.
079700     PERFORM  FAIL.
079800 ADD-WRITE-F1-13.
079900     MOVE     "ADD-TEST-F1-13" TO PAR-NAME.
080000     PERFORM  PRINT-DETAIL.
080100 ADD-TEST-F1-14.
080200     MOVE     ZERO TO WRK-CS-02V02.
080300     ADD      A99-CS-02V00 TO WRK-CS-02V02.
080400     IF       WRK-CS-02V02 EQUAL TO 99.00
080500              PERFORM PASS GO TO ADD-WRITE-F1-14.
080600     GO       TO ADD-FAIL-F1-14.
080700 ADD-DELETE-F1-14.
080800     PERFORM  DE-LETE.
080900     GO       TO ADD-WRITE-F1-14.
081000 ADD-FAIL-F1-14.
081100     MOVE     WRK-CS-02V02 TO COMPUTED-N.
081200     MOVE     99.00 TO CORRECT-N.
081300     PERFORM  FAIL.
081400 ADD-WRITE-F1-14.
081500     MOVE     "ADD-TEST-F1-14" TO PAR-NAME.
081600     PERFORM  PRINT-DETAIL.
081700 ADD-TEST-F1-15-1.
081800     MOVE     A99-CS-02V00 TO WRK-CS-02V02.
081900     ADD      A99-CS-02V00 TO WRK-CS-02V02 ON SIZE ERROR
082000              PERFORM PASS GO TO ADD-WRITE-F1-15-1.
082100     GO       TO ADD-FAIL-F1-15-1.
082200 ADD-DELETE-F1-15-1.
082300     PERFORM  DE-LETE.
082400     GO       TO ADD-WRITE-F1-15-1.
082500 ADD-FAIL-F1-15-1.
082600     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
082700     PERFORM  FAIL.
082800 ADD-WRITE-F1-15-1.
082900     MOVE     "ADD-TEST-F1-15-1" TO PAR-NAME.
083000     PERFORM  PRINT-DETAIL.
083100 ADD-TEST-F1-15-2.
083200     IF       WRK-CS-02V02 EQUAL TO 99.00
083300              PERFORM PASS GO TO ADD-WRITE-F1-15-2.
083400*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF ADD-TEST-F1-15-1
083500     GO       TO ADD-FAIL-F1-15-2.
083600 ADD-DELETE-F1-15-2.
083700     PERFORM  DE-LETE.
083800     GO       TO ADD-WRITE-F1-15-2.
083900 ADD-FAIL-F1-15-2.
084000     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
084100     MOVE     WRK-CS-02V02 TO COMPUTED-N.
084200     MOVE     99.00 TO CORRECT-N.
084300     PERFORM  FAIL.
084400 ADD-WRITE-F1-15-2.
084500     MOVE     "ADD-TEST-F1-15-2" TO PAR-NAME.
084600     PERFORM  PRINT-DETAIL.
084700 ADD-TEST-F1-16.
084800     MOVE A14TWOS-CS-18V00 TO WRK-CS-18V00.
084900     ADD A18FIVES-CS-18V00 TO WRK-CS-18V00.
085000     IF WRK-CS-18V00 EQUAL TO -555577777777777777
085100         PERFORM PASS
085200         GO TO ADD-WRITE-F1-16.
085300     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
085400     MOVE -555577777777777777 TO CORRECT-18V0.
085500     PERFORM FAIL.
085600     GO TO ADD-WRITE-F1-16.
085700 ADD-DELETE-F1-16.
085800     PERFORM DE-LETE.
085900 ADD-WRITE-F1-16.
086000     MOVE "ADD-TEST-F1-16 " TO PAR-NAME.
086100     PERFORM PRINT-DETAIL.
086200 ADD-TEST-F1-17.
086300     MOVE A12SEVENS-CU-18V00 TO WRK-CS-18V00.
086400     ADD A18SIXES-CS-18V00 TO WRK-CS-18V00.
086500     IF WRK-CS-18V00 EQUAL TO +666667444444444443
086600         PERFORM PASS
086700         GO TO ADD-WRITE-F1-17.
086800     MOVE +666667444444444443 TO CORRECT-18V0.
086900     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
087000     PERFORM FAIL.
087100     GO TO ADD-WRITE-F1-17.
087200 ADD-DELETE-F1-17.
087300     PERFORM DE-LETE.
087400 ADD-WRITE-F1-17.
087500     MOVE "ADD-TEST-F1-17 " TO PAR-NAME.
087600     PERFORM PRINT-DETAIL.
087700 ADD-TEST-F1-18.
087800     MOVE A12SEVENS-CU-18V00 TO WRK-DU-18V00.
087900     ADD A18FIVES-CS-18V00 TO WRK-DU-18V00.
088000     IF WRK-DU-18V00 EQUAL TO 555554777777777778
088100         PERFORM PASS
088200         GO TO ADD-WRITE-F1-18.
088300     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
088400     MOVE 555554777777777778 TO CORRECT-18V0.
088500     PERFORM FAIL.
088600     GO TO ADD-WRITE-F1-18.
088700 ADD-DELETE-F1-18.
088800     PERFORM DE-LETE.
088900 ADD-WRITE-F1-18.
089000     MOVE "ADD-TEST-F1-18 " TO PAR-NAME.
089100     PERFORM PRINT-DETAIL.
089200 ADD-TEST-F1-19.
089300     MOVE     +980 TO WRK-CS-03V00.
089400     MOVE     SPACE TO SIZE-ERR.
089500*        NOTE IN THIS TEST, 1 IS ADDED TO A 3-DIGIT COMP SYNC
089600*             FIELD UNTIL A SIZE ERROR OCCURS --- IF THE VALUE OF
089700*             THE FIELD REACHES 1180 WITHOUT A SIZE ERROR THE
089800*             ATTEMPTED ADDITIONS ARE TERMINATED.
089900     PERFORM  ADD-A-F1-19 THRU ADD-B-F1-19 200 TIMES.
090000     IF       SIZE-ERR EQUAL TO SPACE
090100              MOVE "SIZE ERROR NOT ENCOUNTERED" TO RE-MARK
090200              MOVE "AT LEAST 1180" TO COMPUTED-A
090300              MOVE "999 IN PIC 999 FIELD" TO CORRECT-A
090400              PERFORM FAIL
090500              GO TO ADD-WRITE-F1-19.
090600     IF       WRK-CS-03V00 EQUAL TO 999
090700              PERFORM PASS GO TO ADD-WRITE-F1-19.
090800     PERFORM  FAIL.
090900     MOVE     WRK-CS-03V00 TO COMPUTED-N.
091000     MOVE     999 TO CORRECT-N.
091100     GO       TO ADD-WRITE-F1-19.
091200 ADD-DELETE-F1-19.
091300     PERFORM  DE-LETE.
091400     GO       TO ADD-WRITE-F1-19.
091500 ADD-A-F1-19.
091600     IF       SIZE-ERR EQUAL TO "E" GO TO ADD-B-F1-19.
091700     ADD      1 TO WRK-CS-03V00 ON SIZE ERROR
091800              MOVE "E" TO SIZE-ERR.
091900 ADD-B-F1-19.
092000     EXIT.
092100 ADD-WRITE-F1-19.
092200     MOVE   "ADD, COMP, SIZE ERR" TO FEATURE.
092300     MOVE   "ADD-TEST-F1-19" TO PAR-NAME.
092400     PERFORM PRINT-DETAIL.
092500*
092600 ADD-INIT-F1-20.
092700*    ==-->  NEW SIZE ERROR TESTS  <--==
092800     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
092900     MOVE   -11 TO WRK-DS-02V00.
093000 ADD-TEST-F1-20.
093100     ADD    -99 TO WRK-DS-02V00
093200         NOT ON SIZE ERROR
093300             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
093400                  TO RE-MARK
093500             PERFORM FAIL
093600             GO TO   ADD-WRITE-F1-20.
093700     GO TO   ADD-PASS-F1-20.
093800 ADD-DELETE-F1-20.
093900     PERFORM DE-LETE.
094000     GO TO   ADD-WRITE-F1-20.
094100 ADD-PASS-F1-20.
094200     PERFORM PASS.
094300 ADD-WRITE-F1-20.
094400     MOVE   "ADD-TEST-F1-20" TO PAR-NAME.
094500     PERFORM PRINT-DETAIL.
094600*
094700 ADD-INIT-F1-21.
094800*    ==-->  NEW SIZE ERROR TESTS  <--==
094900     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
095000     MOVE    ZERO TO WRK-DS-06V06.
095100 ADD-TEST-F1-21-0.
095200     ADD     A12THREES-DS-06V06
095300             333333
095400             A06THREES-DS-03V03
095500          TO WRK-DS-06V06 ROUNDED
095600      NOT ON SIZE ERROR
095700             GO TO ADD-PASS-F1-21.
095800     MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
095900     PERFORM FAIL.
096000     GO TO   ADD-WRITE-F1-21.
096100 ADD-DELETE-F1-21.
096200     PERFORM DE-LETE.
096300     GO TO   ADD-WRITE-F1-21.
096400 ADD-PASS-F1-21.
096500     PERFORM PASS.
096600 ADD-WRITE-F1-21.
096700     MOVE   "ADD-TEST-F1-21" TO PAR-NAME.
096800     PERFORM PRINT-DETAIL.
096900*
097000 ADD-INIT-F1-22.
097100*    ==-->  NEW SIZE ERROR TESTS  <--==
097200     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
097300     MOVE   -11 TO WRK-DS-02V00.
097400 ADD-TEST-F1-22-0.
097500     ADD    -99 TO WRK-DS-02V00
097600          ON SIZE ERROR
097700             PERFORM PASS
097800             GO TO   ADD-WRITE-F1-22
097900      NOT ON SIZE ERROR
098000             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
098100                  TO RE-MARK
098200             PERFORM FAIL
098300             GO TO   ADD-WRITE-F1-22.
098400 ADD-DELETE-F1-22.
098500     PERFORM DE-LETE.
098600 ADD-WRITE-F1-22.
098700     MOVE   "ADD-TEST-F1-22" TO PAR-NAME.
098800     PERFORM PRINT-DETAIL.
098900*
099000 ADD-INIT-F1-23.
099100*    ==-->  NEW SIZE ERROR TESTS  <--==
099200     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
099300     MOVE    ZERO TO WRK-DS-06V06.
099400 ADD-TEST-F1-23-0.
099500     ADD     A12THREES-DS-06V06
099600             333333
099700             A06THREES-DS-03V03
099800          TO WRK-DS-06V06 ROUNDED
099900          ON SIZE ERROR
100000             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
100100                  TO RE-MARK
100200             PERFORM FAIL
100300             GO TO   ADD-WRITE-F1-23
100400      NOT ON SIZE ERROR
100500             GO TO   ADD-PASS-F1-23.
100600 ADD-DELETE-F1-23.
100700     PERFORM DE-LETE.
100800     GO TO   ADD-WRITE-F1-23.
100900 ADD-PASS-F1-23.
101000     PERFORM PASS.
101100 ADD-WRITE-F1-23.
101200     MOVE   "ADD-TEST-F1-23" TO PAR-NAME.
101300     PERFORM PRINT-DETAIL.
101400*
101500 ADD-INIT-F1-24.
101600*    ==-->  MULTIPLE OPERANDS  <--==
101700     MOVE   "V1-67 6.4.2"      TO ANSI-REFERENCE.
101800     MOVE   "ADD LIMIT TESTS " TO FEATURE.
101900     MOVE    1  TO DNAME1  DNAME2  DNAME3  DNAME4  DNAME5.
102000     MOVE    1  TO DNAME6  DNAME7  DNAME8  DNAME9  DNAME10.
102100     MOVE    1  TO DNAME11 DNAME12 DNAME13 DNAME14 DNAME15.
102200     MOVE    1  TO DNAME16 DNAME17 DNAME18 DNAME19 DNAME20.
102300     MOVE    1  TO DNAME21.
102400     MOVE    0  TO DNAME22.
102500*    THE FOLLOWING 22 TESTS VERIFY THE ABILITY OF THE COMPILER
102600*    TO HANDLE A MAXIMUM OF 42 OPERANDS.   A DELETION IN THIS
102700*    PARAGRAPH WILL SKIP THE LIMIT TESTS.
102800     GO TO ADD-TEST-F1-24.
102900 ADD-INIT-DELETE.
103000     PERFORM DE-LETE.
103100     MOVE "ADD-TEST-F1-24 TO F1-45" TO PAR-NAME.
103200     MOVE "ADD LIMIT TESTS " TO FEATURE.
103300     ADD 21 TO DELETE-COUNTER.
103400     PERFORM PRINT-DETAIL.
103500     GO TO   ADD-INIT-F1-46.
103600 ADD-TEST-F1-24.
103700     ADD DNAME1
103800         DNAME2
103900         DNAME3
104000         DNAME4
104100         DNAME5
104200         DNAME6
104300         DNAME7
104400         DNAME8
104500         DNAME9
104600         DNAME10
104700         DNAME11
104800         DNAME12
104900         DNAME13
105000         DNAME14
105100         DNAME15
105200         DNAME16
105300         DNAME17
105400         DNAME18
105500         DNAME19
105600         DNAME20
105700         DNAME21
105800              TO DNAME22.
105900*    THE NUMBER OF OPERANDS CAPABLE OF BEING ADDED TO ONE
106000*    DATANAME WILL BE REFLECTED BY THE COMPUTED-ANSWER.
106100     IF DNAME22 EQUAL TO 21
106200         PERFORM PASS
106300         GO TO ADD-WRITE-F1-24.
106400     MOVE 21 TO CORRECT-18V0.
106500     MOVE DNAME22 TO COMPUTED-18V0.
106600     PERFORM FAIL.
106700     GO TO ADD-WRITE-F1-24.
106800 ADD-DELETE-F1-24.
106900     PERFORM DE-LETE.
107000 ADD-WRITE-F1-24.
107100     MOVE "ADD-TEST-F1-24 " TO PAR-NAME.
107200     PERFORM PRINT-DETAIL.
107300 ADD-INIT-F1-25.
107400     MOVE ZERO TO DNAME22 DNAME23 DNAME24 DNAME25 DNAME26.
107500     MOVE ZERO TO DNAME27 DNAME28 DNAME29 DNAME30 DNAME31.
107600     MOVE ZERO TO DNAME32 DNAME33 DNAME34 DNAME35 DNAME36.
107700     MOVE ZERO TO DNAME37 DNAME38 DNAME39 DNAME40 DNAME41.
107800     MOVE ZERO TO DNAME42.
107900 ADD-TEST-F1-25.
108000     ADD DNAME1
108100         DNAME2
108200         DNAME3
108300         DNAME4
108400         DNAME5
108500         DNAME6
108600         DNAME7
108700         DNAME8
108800         DNAME9
108900         DNAME10
109000         DNAME11
109100         DNAME12
109200         DNAME13
109300         DNAME14
109400         DNAME15
109500         DNAME16
109600         DNAME17
109700         DNAME18
109800         DNAME19
109900         DNAME20
110000         DNAME21
110100              TO DNAME22
110200                 DNAME23
110300                 DNAME24
110400                 DNAME25
110500                 DNAME26
110600                 DNAME27
110700                 DNAME28
110800                 DNAME29
110900                 DNAME30
111000                 DNAME31
111100                 DNAME32
111200                 DNAME33
111300                 DNAME34
111400                 DNAME35
111500                 DNAME36
111600                 DNAME37
111700                 DNAME38
111800                 DNAME39
111900                 DNAME40
112000                 DNAME41
112100                 DNAME42.
112200     IF DNAME22 EQUAL TO 21
112300         PERFORM PASS
112400         GO TO ADD-WRITE-F1-25.
112500     MOVE 21 TO CORRECT-18V0.
112600     MOVE DNAME22 TO COMPUTED-18V0.
112700     PERFORM FAIL.
112800     GO TO ADD-WRITE-F1-25.
112900 ADD-DELETE-F1-25.
113000     PERFORM DE-LETE.
113100 ADD-WRITE-F1-25.
113200     MOVE "ADD-TEST-F1-25 " TO PAR-NAME.
113300     PERFORM PRINT-DETAIL.
113400 ADD-TEST-F1-26.
113500     IF DNAME23 EQUAL TO 21
113600         PERFORM PASS
113700         GO TO ADD-WRITE-F1-26.
113800     MOVE 21 TO CORRECT-18V0.
113900     MOVE DNAME23 TO COMPUTED-18V0.
114000     PERFORM FAIL.
114100     GO TO ADD-WRITE-F1-26.
114200 ADD-DELETE-F1-26.
114300     PERFORM DE-LETE.
114400 ADD-WRITE-F1-26.
114500     MOVE "ADD-TEST-F1-26 " TO PAR-NAME.
114600     PERFORM PRINT-DETAIL.
114700 ADD-TEST-F1-27.
114800     IF DNAME24 EQUAL TO 21
114900         PERFORM PASS
115000         GO TO ADD-WRITE-F1-27.
115100     MOVE 21 TO CORRECT-18V0.
115200     MOVE DNAME24 TO COMPUTED-18V0.
115300     PERFORM FAIL.
115400     GO TO ADD-WRITE-F1-27.
115500 ADD-DELETE-F1-27.
115600     PERFORM DE-LETE.
115700 ADD-WRITE-F1-27.
115800     MOVE "ADD-TEST-F1-27 " TO PAR-NAME.
115900     PERFORM PRINT-DETAIL.
116000 ADD-TEST-F1-28.
116100     IF DNAME25 EQUAL TO 21
116200         PERFORM PASS
116300         GO TO ADD-WRITE-F1-28.
116400     MOVE 21 TO CORRECT-18V0.
116500     MOVE DNAME25 TO COMPUTED-18V0.
116600     PERFORM FAIL.
116700     GO TO ADD-WRITE-F1-28.
116800 ADD-DELETE-F1-28.
116900     PERFORM DE-LETE.
117000 ADD-WRITE-F1-28.
117100     MOVE "ADD-TEST-F1-28 " TO PAR-NAME.
117200     PERFORM PRINT-DETAIL.
117300 ADD-TEST-F1-29.
117400     IF DNAME26 EQUAL TO 21
117500         PERFORM PASS
117600         GO TO ADD-WRITE-F1-29.
117700     MOVE 21 TO CORRECT-18V0.
117800     MOVE DNAME26 TO COMPUTED-18V0.
117900     PERFORM FAIL.
118000     GO TO ADD-WRITE-F1-29.
118100 ADD-DELETE-F1-29.
118200     PERFORM DE-LETE.
118300 ADD-WRITE-F1-29.
118400     MOVE "ADD-TEST-F1-29 " TO PAR-NAME.
118500     PERFORM PRINT-DETAIL.
118600 ADD-TEST-F1-30.
118700     IF DNAME27 EQUAL TO 21
118800         PERFORM PASS
118900         GO TO ADD-WRITE-F1-30.
119000     MOVE 21 TO CORRECT-18V0.
119100     MOVE DNAME27 TO COMPUTED-18V0.
119200     PERFORM FAIL.
119300     GO TO ADD-WRITE-F1-30.
119400 ADD-DELETE-F1-30.
119500     PERFORM DE-LETE.
119600 ADD-WRITE-F1-30.
119700     MOVE "ADD-TEST-F1-30 " TO PAR-NAME.
119800     PERFORM PRINT-DETAIL.
119900 ADD-TEST-F1-31.
120000     IF DNAME28 EQUAL TO 21
120100         PERFORM PASS
120200         GO TO ADD-WRITE-F1-31.
120300     MOVE 21 TO CORRECT-18V0.
120400     MOVE DNAME28 TO COMPUTED-18V0.
120500     PERFORM FAIL.
120600     GO TO ADD-WRITE-F1-31.
120700 ADD-DELETE-F1-31.
120800     PERFORM DE-LETE.
120900 ADD-WRITE-F1-31.
121000     MOVE "ADD-TEST-F1-31 " TO PAR-NAME.
121100     PERFORM PRINT-DETAIL.
121200 ADD-TEST-F1-32.
121300     IF DNAME29 EQUAL TO 21
121400         PERFORM PASS
121500         GO TO ADD-WRITE-F1-32.
121600     MOVE 21 TO CORRECT-18V0.
121700     MOVE DNAME29 TO COMPUTED-18V0.
121800     PERFORM FAIL.
121900     GO TO ADD-WRITE-F1-32.
122000 ADD-DELETE-F1-32.
122100     PERFORM DE-LETE.
122200 ADD-WRITE-F1-32.
122300     MOVE "ADD-TEST-F1-32 " TO PAR-NAME.
122400     PERFORM PRINT-DETAIL.
122500 ADD-TEST-F1-33.
122600     IF DNAME30 EQUAL TO 21
122700         PERFORM PASS
122800         GO TO ADD-WRITE-F1-33.
122900     MOVE 21 TO CORRECT-18V0.
123000     MOVE DNAME30 TO COMPUTED-18V0.
123100     PERFORM FAIL.
123200     GO TO ADD-WRITE-F1-33.
123300 ADD-DELETE-F1-33.
123400     PERFORM DE-LETE.
123500 ADD-WRITE-F1-33.
123600     MOVE "ADD-TEST-F1-33 " TO PAR-NAME.
123700     PERFORM PRINT-DETAIL.
123800 ADD-TEST-F1-34.
123900     IF DNAME31 EQUAL TO 21
124000         PERFORM PASS
124100         GO TO ADD-WRITE-F1-34.
124200     MOVE 21 TO CORRECT-18V0.
124300     MOVE DNAME31 TO COMPUTED-18V0.
124400     PERFORM FAIL.
124500     GO TO ADD-WRITE-F1-34.
124600 ADD-DELETE-F1-34.
124700     PERFORM DE-LETE.
124800 ADD-WRITE-F1-34.
124900     MOVE "ADD-TEST-F1-34 " TO PAR-NAME.
125000     PERFORM PRINT-DETAIL.
125100 ADD-TEST-F1-35.
125200     IF DNAME32 EQUAL TO 21
125300         PERFORM PASS
125400         GO TO ADD-WRITE-F1-35.
125500     MOVE 21 TO CORRECT-18V0.
125600     MOVE DNAME32 TO COMPUTED-18V0.
125700     PERFORM FAIL.
125800     GO TO ADD-WRITE-F1-35.
125900 ADD-DELETE-F1-35.
126000     PERFORM DE-LETE.
126100 ADD-WRITE-F1-35.
126200     MOVE "ADD-TEST-F1-35 " TO PAR-NAME.
126300     PERFORM PRINT-DETAIL.
126400 ADD-TEST-F1-36.
126500     IF DNAME33 EQUAL TO 21
126600         PERFORM PASS
126700         GO TO ADD-WRITE-F1-36.
126800     MOVE 21 TO CORRECT-18V0.
126900     MOVE DNAME33 TO COMPUTED-18V0.
127000     PERFORM FAIL.
127100     GO TO ADD-WRITE-F1-36.
127200 ADD-DELETE-F1-36.
127300     PERFORM DE-LETE.
127400 ADD-WRITE-F1-36.
127500     MOVE "ADD-TEST-F1-36 " TO PAR-NAME.
127600     PERFORM PRINT-DETAIL.
127700 ADD-TEST-F1-37.
127800     IF DNAME34 EQUAL TO 21
127900         PERFORM PASS
128000         GO TO ADD-WRITE-F1-37.
128100     MOVE 21 TO CORRECT-18V0.
128200     MOVE DNAME34 TO COMPUTED-18V0.
128300     PERFORM FAIL.
128400     GO TO ADD-WRITE-F1-37.
128500 ADD-DELETE-F1-37.
128600     PERFORM DE-LETE.
128700 ADD-WRITE-F1-37.
128800     MOVE "ADD-TEST-F1-37 " TO PAR-NAME.
128900     PERFORM PRINT-DETAIL.
129000 ADD-TEST-F1-38.
129100     IF DNAME35 EQUAL TO 21
129200         PERFORM PASS
129300         GO TO ADD-WRITE-F1-38.
129400     MOVE 21 TO CORRECT-18V0.
129500     MOVE DNAME35 TO COMPUTED-18V0.
129600     PERFORM FAIL.
129700     GO TO ADD-WRITE-F1-38.
129800 ADD-DELETE-F1-38.
129900     PERFORM DE-LETE.
130000 ADD-WRITE-F1-38.
130100     MOVE "ADD-TEST-F1-38 " TO PAR-NAME.
130200     PERFORM PRINT-DETAIL.
130300 ADD-TEST-F1-39.
130400     IF DNAME36 EQUAL TO 21
130500         PERFORM PASS
130600         GO TO ADD-WRITE-F1-39.
130700     MOVE 21 TO CORRECT-18V0.
130800     MOVE DNAME36 TO COMPUTED-18V0.
130900     PERFORM FAIL.
131000     GO TO ADD-WRITE-F1-39.
131100 ADD-DELETE-F1-39.
131200     PERFORM DE-LETE.
131300 ADD-WRITE-F1-39.
131400     MOVE "ADD-TEST-F1-39 " TO PAR-NAME.
131500     PERFORM PRINT-DETAIL.
131600 ADD-TEST-F1-40.
131700     IF DNAME37 EQUAL TO 21
131800         PERFORM PASS
131900         GO TO ADD-WRITE-F1-40.
132000     MOVE 21 TO CORRECT-18V0.
132100     MOVE DNAME37 TO COMPUTED-18V0.
132200     PERFORM FAIL.
132300     GO TO ADD-WRITE-F1-40.
132400 ADD-DELETE-F1-40.
132500     PERFORM DE-LETE.
132600 ADD-WRITE-F1-40.
132700     MOVE "ADD-TEST-F1-40 " TO PAR-NAME.
132800     PERFORM PRINT-DETAIL.
132900 ADD-TEST-F1-41.
133000     IF DNAME38 EQUAL TO 21
133100         PERFORM PASS
133200         GO TO ADD-WRITE-F1-41.
133300     MOVE 21 TO CORRECT-18V0.
133400     MOVE DNAME38 TO COMPUTED-18V0.
133500     PERFORM FAIL.
133600     GO TO ADD-WRITE-F1-41.
133700 ADD-DELETE-F1-41.
133800     PERFORM DE-LETE.
133900 ADD-WRITE-F1-41.
134000     MOVE "ADD-TEST-F1-41 " TO PAR-NAME.
134100     PERFORM PRINT-DETAIL.
134200 ADD-TEST-F1-42.
134300     IF DNAME39 EQUAL TO 21
134400         PERFORM PASS
134500         GO TO ADD-WRITE-F1-42.
134600     MOVE 21 TO CORRECT-18V0.
134700     MOVE DNAME39 TO COMPUTED-18V0.
134800     PERFORM FAIL.
134900     GO TO ADD-WRITE-F1-42.
135000 ADD-DELETE-F1-42.
135100     PERFORM DE-LETE.
135200 ADD-WRITE-F1-42.
135300     MOVE "ADD-TEST-F1-42 " TO PAR-NAME.
135400     PERFORM PRINT-DETAIL.
135500 ADD-TEST-F1-43.
135600     IF DNAME40 EQUAL TO 21
135700         PERFORM PASS
135800         GO TO ADD-WRITE-F1-43.
135900     MOVE 21 TO CORRECT-18V0.
136000     MOVE DNAME40 TO COMPUTED-18V0.
136100     PERFORM FAIL.
136200     GO TO ADD-WRITE-F1-43.
136300 ADD-DELETE-F1-43.
136400     PERFORM DE-LETE.
136500 ADD-WRITE-F1-43.
136600     MOVE "ADD-TEST-F1-43 " TO PAR-NAME.
136700     PERFORM PRINT-DETAIL.
136800 ADD-TEST-F1-44.
136900     IF DNAME41 EQUAL TO 21
137000         PERFORM PASS
137100         GO TO ADD-WRITE-F1-44.
137200     MOVE 21 TO CORRECT-18V0.
137300     MOVE DNAME41 TO COMPUTED-18V0.
137400     PERFORM FAIL.
137500     GO TO ADD-WRITE-F1-44.
137600 ADD-DELETE-F1-44.
137700     PERFORM DE-LETE.
137800 ADD-WRITE-F1-44.
137900     MOVE "ADD-TEST-F1-44 " TO PAR-NAME.
138000     PERFORM PRINT-DETAIL.
138100 ADD-TEST-F1-45.
138200     IF DNAME42 EQUAL TO 21
138300         PERFORM PASS
138400         GO TO ADD-WRITE-F1-45.
138500     MOVE 21 TO CORRECT-18V0.
138600     MOVE DNAME42 TO COMPUTED-18V0.
138700     PERFORM FAIL.
138800     GO TO ADD-WRITE-F1-45.
138900 ADD-DELETE-F1-45.
139000     PERFORM DE-LETE.
139100 ADD-WRITE-F1-45.
139200     MOVE "ADD-TEST-F1-45 " TO PAR-NAME.
139300     PERFORM PRINT-DETAIL.
139400*
139500 ADD-INIT-F1-46.
139600*    ==-->  MULTIPLE RESULT FIELDS  <--==
139700     MOVE   "VI-74 6.6.4 GR1" TO ANSI-REFERENCE.
139800     MOVE   "ADD-TEST-F1-46"  TO PAR-NAME.
139900     MOVE   "ADD-TO-SERIES"   TO FEATURE.
140000     MOVE    ZERO TO WRK-DU-2V1-1 WRK-DU-2V0-1 WRK-DU-2V1-2
140100             WRK-DU-2V0-2 WRK-DU-2V1-3 WRK-DU-2V0-3.
140200     MOVE    1.1 TO WRK-DU-1V1-1.
140300     MOVE    2.4 TO WRK-DU-1V1-2.
140400     MOVE 1 TO REC-CT.
140500 ADD-TEST-F1-46-0.
140600     ADD WRK-DU-1V1-1  WRK-DU-1V1-2  6 TO WRK-DU-2V1-1,
140700         WRK-DU-2V0-1 ROUNDED  WRK-DU-2V1-2  WRK-DU-2V0-2 ROUNDED
140800         WRK-DU-2V1-3  WRK-DU-2V0-3.
140900     GO TO   ADD-TEST-F1-46-1.
141000 ADD-DELETE-F1-46.
141100     PERFORM DE-LETE.
141200     PERFORM PRINT-DETAIL.
141300     GO TO ADD-INIT-F1-47.
141400 ADD-TEST-F1-46-1.
141500     IF WRK-DU-2V1-1 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
141600         ELSE
141700         PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 9.5
141800         TO CORRECT-N PERFORM PRINT-DETAIL.
141900     ADD 1 TO REC-CT.
142000 ADD-TEST-F1-46-2.
142100     IF WRK-DU-2V0-1 = 10 PERFORM PASS PERFORM PRINT-DETAIL
142200         ELSE
142300         PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 10 TO
142400         CORRECT-N PERFORM PRINT-DETAIL.
142500     ADD 1 TO REC-CT.
142600 ADD-TEST-F1-46-3.
142700     IF WRK-DU-2V1-2 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
142800         ELSE
142900         PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 9.5 TO
143000         CORRECT-N PERFORM PRINT-DETAIL.
143100     ADD 1 TO REC-CT.
143200 ADD-TEST-F1-46-4.
143300     IF WRK-DU-2V0-2 = 10 PERFORM PASS PERFORM PRINT-DETAIL
143400         ELSE
143500         PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 10 TO
143600         CORRECT-N PERFORM PRINT-DETAIL.
143700     ADD 1 TO REC-CT.
143800 ADD-TEST-F1-46-5.
143900     IF WRK-DU-2V1-3 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
144000         ELSE
144100         PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 9.5 TO
144200         CORRECT-N PERFORM PRINT-DETAIL.
144300     ADD 1 TO REC-CT.
144400 ADD-TEST-F1-46-6.
144500     IF WRK-DU-2V0-3 = 9 PERFORM PASS PERFORM PRINT-DETAIL
144600         ELSE
144700         PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 9 TO
144800         CORRECT-N PERFORM PRINT-DETAIL.
144900*
145000 ADD-INIT-F1-47.
145100*    ==-->  MULTIPLE RESULT FIELDS  <--==
145200*    ==-->    NEW SIZE ERROR TESTS  <--==
145300     MOVE   "VI-67 6.4.2"     TO ANSI-REFERENCE.
145400     MOVE   "ADD-TEST-F1-47"  TO PAR-NAME.
145500     MOVE    ZERO TO WRK-DU-2V1-1 WRK-DU-2V0-1 WRK-DU-2V1-2
145600             WRK-DU-2V0-2 WRK-DU-2V1-3 WRK-DU-2V0-3.
145700     MOVE    1.1 TO WRK-DU-1V1-1.
145800     MOVE    2.4 TO WRK-DU-1V1-2.
145900     MOVE   "0"  TO WRK-XN-00001.
146000     MOVE 1 TO REC-CT.
146100 ADD-TEST-F1-47-0.
146200     ADD WRK-DU-1V1-1  WRK-DU-1V1-2  6 TO WRK-DU-2V1-1,
146300         WRK-DU-2V0-1 ROUNDED  WRK-DU-2V1-2  WRK-DU-2V0-2 ROUNDED
146400         WRK-DU-2V1-3  WRK-DU-2V0-3
146500          ON SIZE ERROR
146600             MOVE   "1" TO WRK-XN-00001.
146700     GO TO   ADD-TEST-F1-47-1.
146800 ADD-DELETE-F1-47.
146900     PERFORM DE-LETE.
147000     PERFORM PRINT-DETAIL.
147100     GO TO ADD-INIT-F1-48.
147200 ADD-TEST-F1-47-1.
147300     MOVE   "ADD-TEST-F1-47-1"  TO PAR-NAME.
147400     IF WRK-DU-2V1-1 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
147500         ELSE
147600         PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 9.5
147700         TO CORRECT-N PERFORM PRINT-DETAIL.
147800     ADD 1 TO REC-CT.
147900 ADD-TEST-F1-47-2.
148000     MOVE   "ADD-TEST-F1-47-2"  TO PAR-NAME.
148100     IF WRK-DU-2V0-1 = 10 PERFORM PASS PERFORM PRINT-DETAIL
148200         ELSE
148300         PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 10 TO
148400         CORRECT-N PERFORM PRINT-DETAIL.
148500     ADD 1 TO REC-CT.
148600 ADD-TEST-F1-47-3.
148700     MOVE   "ADD-TEST-F1-47-3"  TO PAR-NAME.
148800     IF WRK-DU-2V1-2 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
148900         ELSE
149000         PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 9.5 TO
149100         CORRECT-N PERFORM PRINT-DETAIL.
149200     ADD 1 TO REC-CT.
149300 ADD-TEST-F1-47-4.
149400     MOVE   "ADD-TEST-F1-47-4"  TO PAR-NAME.
149500     IF WRK-DU-2V0-2 = 10 PERFORM PASS PERFORM PRINT-DETAIL
149600         ELSE
149700         PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 10 TO
149800         CORRECT-N PERFORM PRINT-DETAIL.
149900     ADD 1 TO REC-CT.
150000 ADD-TEST-F1-47-5.
150100     MOVE   "ADD-TEST-F1-47-5"  TO PAR-NAME.
150200     IF WRK-DU-2V1-3 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
150300         ELSE
150400         PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 9.5 TO
150500         CORRECT-N PERFORM PRINT-DETAIL.
150600     ADD 1 TO REC-CT.
150700 ADD-TEST-F1-47-6.
150800     MOVE   "ADD-TEST-F1-47-6"  TO PAR-NAME.
150900     IF WRK-DU-2V0-3 = 9 PERFORM PASS PERFORM PRINT-DETAIL
151000         ELSE
151100         PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 9 TO
151200         CORRECT-N PERFORM PRINT-DETAIL.
151300     ADD 1 TO REC-CT.
151400 ADD-TEST-F1-47-7.
151500     MOVE   "ADD-TEST-F1-47-7"  TO PAR-NAME.
151600     IF      WRK-XN-00001 = "0"
151700             PERFORM PASS
151800             PERFORM PRINT-DETAIL
151900     ELSE
152000             MOVE   "SIZE ERROR SHOULD NOT BE EXECUTED"
152100                  TO RE-MARK
152200             MOVE   "0"           TO CORRECT-X
152300             MOVE    WRK-XN-00001 TO COMPUTED-X
152400             PERFORM FAIL
152500             PERFORM PRINT-DETAIL.
152600*
152700 ADD-INIT-F1-48.
152800*    ==-->  MULTIPLE RESULT FIELDS  <--==
152900*    ==-->    NEW SIZE ERROR TESTS  <--==
153000     MOVE   "VI-67 6.4.2"     TO ANSI-REFERENCE.
153100     MOVE   "ADD-TEST-F1-48"  TO PAR-NAME.
153200     MOVE    ZERO TO WRK-DU-2V1-1 WRK-DU-2V0-1 WRK-DU-2V1-2
153300             WRK-DU-2V0-2 WRK-DU-2V1-3 WRK-DU-2V0-3.
153400     MOVE    1.1 TO WRK-DU-1V1-1.
153500     MOVE    2.4 TO WRK-DU-1V1-2.
153600     MOVE   "0"  TO WRK-XN-00001.
153700     MOVE 1 TO REC-CT.
153800 ADD-TEST-F1-48-0.
153900     ADD     A17TWOS-DS-17V00
154000             WRK-DU-1V1-2  6
154100          TO WRK-DU-2V1-1
154200             WRK-DU-2V0-1 ROUNDED
154300             WRK-DU-2V1-2
154400             WRK-DU-2V0-2 ROUNDED
154500             WRK-DU-2V1-3
154600             WRK-DU-2V0-3
154700          ON SIZE ERROR
154800             MOVE   "1" TO WRK-XN-00001.
154900     GO TO   ADD-TEST-F1-48-1.
155000 ADD-DELETE-F1-48.
155100     PERFORM DE-LETE.
155200     PERFORM PRINT-DETAIL.
155300     GO TO   ADD-INIT-F1-49.
155400 ADD-TEST-F1-48-1.
155500     MOVE   "ADD-TEST-F1-48-1"  TO PAR-NAME.
155600     IF WRK-DU-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
155700         ELSE
155800         PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 0
155900         TO CORRECT-N PERFORM PRINT-DETAIL.
156000     ADD 1 TO REC-CT.
156100 ADD-TEST-F1-48-2.
156200     MOVE   "ADD-TEST-F1-48-2"  TO PAR-NAME.
156300     IF WRK-DU-2V0-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
156400         ELSE
156500         PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 0 TO
156600         CORRECT-N PERFORM PRINT-DETAIL.
156700     ADD 1 TO REC-CT.
156800 ADD-TEST-F1-48-3.
156900     MOVE   "ADD-TEST-F1-48-3"  TO PAR-NAME.
157000     IF WRK-DU-2V1-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
157100         ELSE
157200         PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 0 TO
157300         CORRECT-N PERFORM PRINT-DETAIL.
157400     ADD 1 TO REC-CT.
157500 ADD-TEST-F1-48-4.
157600     MOVE   "ADD-TEST-F1-48-4"  TO PAR-NAME.
157700     IF WRK-DU-2V0-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
157800         ELSE
157900         PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 0 TO
158000         CORRECT-N PERFORM PRINT-DETAIL.
158100     ADD 1 TO REC-CT.
158200 ADD-TEST-F1-48-5.
158300     MOVE   "ADD-TEST-F1-48-5"  TO PAR-NAME.
158400     IF WRK-DU-2V1-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
158500         ELSE
158600         PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 0 TO
158700         CORRECT-N PERFORM PRINT-DETAIL.
158800     ADD 1 TO REC-CT.
158900 ADD-TEST-F1-48-6.
159000     MOVE   "ADD-TEST-F1-48-6"  TO PAR-NAME.
159100     IF WRK-DU-2V0-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
159200         ELSE
159300         PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 0 TO
159400         CORRECT-N PERFORM PRINT-DETAIL.
159500     ADD 1 TO REC-CT.
159600 ADD-TEST-F1-48-7.
159700     MOVE   "ADD-TEST-F1-48-7"  TO PAR-NAME.
159800     IF      WRK-XN-00001 = "1"
159900             PERFORM PASS
160000             PERFORM PRINT-DETAIL
160100     ELSE
160200             MOVE   "SIZE ERROR NOT EXECUTED" TO RE-MARK
160300             MOVE   "1"           TO CORRECT-X
160400             MOVE    WRK-XN-00001 TO COMPUTED-X
160500             PERFORM FAIL
160600             PERFORM PRINT-DETAIL.
160700*
160800 ADD-INIT-F1-49.
160900*    ==-->  MULTIPLE RESULT FIELDS  <--==
161000*    ==-->    NEW SIZE ERROR TESTS  <--==
161100     MOVE   "VI-67 6.4.2"     TO ANSI-REFERENCE.
161200     MOVE   "ADD-TEST-F1-49"  TO PAR-NAME.
161300     MOVE    ZERO TO WRK-DU-2V1-1 WRK-DU-2V0-1 WRK-DU-2V1-2
161400             WRK-DU-2V0-2 WRK-DU-2V1-3 WRK-DU-2V0-3.
161500     MOVE    1.1 TO WRK-DU-1V1-1.
161600     MOVE    2.4 TO WRK-DU-1V1-2.
161700     MOVE   "0"  TO WRK-XN-00001.
161800     MOVE 1 TO REC-CT.
161900 ADD-TEST-F1-49-0.
162000     ADD WRK-DU-1V1-1  WRK-DU-1V1-2  6 TO WRK-DU-2V1-1,
162100         WRK-DU-2V0-1 ROUNDED  WRK-DU-2V1-2  WRK-DU-2V0-2 ROUNDED
162200         WRK-DU-2V1-3  WRK-DU-2V0-3
162300      NOT ON SIZE ERROR
162400             MOVE   "1" TO WRK-XN-00001.
162500     GO TO   ADD-TEST-F1-49-1.
162600 ADD-DELETE-F1-49.
162700     PERFORM DE-LETE.
162800     PERFORM PRINT-DETAIL.
162900     GO TO ADD-INIT-F1-50.
163000 ADD-TEST-F1-49-1.
163100     MOVE   "ADD-TEST-F1-49-1"  TO PAR-NAME.
163200     IF WRK-DU-2V1-1 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
163300         ELSE
163400         PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 9.5
163500         TO CORRECT-N PERFORM PRINT-DETAIL.
163600     ADD 1 TO REC-CT.
163700 ADD-TEST-F1-49-2.
163800     MOVE   "ADD-TEST-F1-49-2"  TO PAR-NAME.
163900     IF WRK-DU-2V0-1 = 10 PERFORM PASS PERFORM PRINT-DETAIL
164000         ELSE
164100         PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 10 TO
164200         CORRECT-N PERFORM PRINT-DETAIL.
164300     ADD 1 TO REC-CT.
164400 ADD-TEST-F1-49-3.
164500     MOVE   "ADD-TEST-F1-49-3"  TO PAR-NAME.
164600     IF WRK-DU-2V1-2 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
164700         ELSE
164800         PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 9.5 TO
164900         CORRECT-N PERFORM PRINT-DETAIL.
165000     ADD 1 TO REC-CT.
165100 ADD-TEST-F1-49-4.
165200     MOVE   "ADD-TEST-F1-49-4"  TO PAR-NAME.
165300     IF WRK-DU-2V0-2 = 10 PERFORM PASS PERFORM PRINT-DETAIL
165400         ELSE
165500         PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 10 TO
165600         CORRECT-N PERFORM PRINT-DETAIL.
165700     ADD 1 TO REC-CT.
165800 ADD-TEST-F1-49-5.
165900     MOVE   "ADD-TEST-F1-49-5"  TO PAR-NAME.
166000     IF WRK-DU-2V1-3 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
166100         ELSE
166200         PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 9.5 TO
166300         CORRECT-N PERFORM PRINT-DETAIL.
166400     ADD 1 TO REC-CT.
166500 ADD-TEST-F1-49-6.
166600     MOVE   "ADD-TEST-F1-49-6"  TO PAR-NAME.
166700     IF WRK-DU-2V0-3 = 9 PERFORM PASS PERFORM PRINT-DETAIL
166800         ELSE
166900         PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 9 TO
167000         CORRECT-N PERFORM PRINT-DETAIL.
167100     ADD 1 TO REC-CT.
167200 ADD-TEST-F1-49-7.
167300     MOVE   "ADD-TEST-F1-49-7"  TO PAR-NAME.
167400     IF      WRK-XN-00001 = "1"
167500             PERFORM PASS
167600             PERFORM PRINT-DETAIL
167700     ELSE
167800             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
167900                  TO RE-MARK
168000             MOVE   "1"           TO CORRECT-X
168100             MOVE    WRK-XN-00001 TO COMPUTED-X
168200             PERFORM FAIL
168300             PERFORM PRINT-DETAIL.
168400*
168500 ADD-INIT-F1-50.
168600*    ==-->  MULTIPLE RESULT FIELDS  <--==
168700*    ==-->    NEW SIZE ERROR TESTS  <--==
168800     MOVE   "VI-67 6.4.2"     TO ANSI-REFERENCE.
168900     MOVE   "ADD-TEST-F1-50"  TO PAR-NAME.
169000     MOVE    ZERO TO WRK-DU-2V1-1 WRK-DU-2V0-1 WRK-DU-2V1-2
169100             WRK-DU-2V0-2 WRK-DU-2V1-3 WRK-DU-2V0-3.
169200     MOVE    1.1 TO WRK-DU-1V1-1.
169300     MOVE    2.4 TO WRK-DU-1V1-2.
169400     MOVE   "0"  TO WRK-XN-00001.
169500     MOVE 1 TO REC-CT.
169600 ADD-TEST-F1-50-0.
169700     ADD     A17TWOS-DS-17V00
169800             WRK-DU-1V1-2  6
169900          TO WRK-DU-2V1-1
170000             WRK-DU-2V0-1 ROUNDED
170100             WRK-DU-2V1-2
170200             WRK-DU-2V0-2 ROUNDED
170300             WRK-DU-2V1-3
170400             WRK-DU-2V0-3
170500      NOT ON SIZE ERROR
170600             MOVE   "1" TO WRK-XN-00001.
170700     GO TO   ADD-TEST-F1-50-1.
170800 ADD-DELETE-F1-50.
170900     PERFORM DE-LETE.
171000     PERFORM PRINT-DETAIL.
171100     GO TO   ADD-INIT-F1-51.
171200 ADD-TEST-F1-50-1.
171300     MOVE   "ADD-TEST-F1-50-1"  TO PAR-NAME.
171400     IF WRK-DU-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
171500         ELSE
171600         PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 0
171700         TO CORRECT-N PERFORM PRINT-DETAIL.
171800     ADD 1 TO REC-CT.
171900 ADD-TEST-F1-50-2.
172000     MOVE   "ADD-TEST-F1-50-2"  TO PAR-NAME.
172100     IF WRK-DU-2V0-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
172200         ELSE
172300         PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 0 TO
172400         CORRECT-N PERFORM PRINT-DETAIL.
172500     ADD 1 TO REC-CT.
172600 ADD-TEST-F1-50-3.
172700     MOVE   "ADD-TEST-F1-50-3"  TO PAR-NAME.
172800     IF WRK-DU-2V1-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
172900         ELSE
173000         PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 0 TO
173100         CORRECT-N PERFORM PRINT-DETAIL.
173200     ADD 1 TO REC-CT.
173300 ADD-TEST-F1-50-4.
173400     MOVE   "ADD-TEST-F1-50-4"  TO PAR-NAME.
173500     IF WRK-DU-2V0-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
173600         ELSE
173700         PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 0 TO
173800         CORRECT-N PERFORM PRINT-DETAIL.
173900     ADD 1 TO REC-CT.
174000 ADD-TEST-F1-50-5.
174100     MOVE   "ADD-TEST-F1-50-5"  TO PAR-NAME.
174200     IF WRK-DU-2V1-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
174300         ELSE
174400         PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 0 TO
174500         CORRECT-N PERFORM PRINT-DETAIL.
174600     ADD 1 TO REC-CT.
174700 ADD-TEST-F1-50-6.
174800     MOVE   "ADD-TEST-F1-50-6"  TO PAR-NAME.
174900     IF WRK-DU-2V0-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
175000         ELSE
175100         PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 0 TO
175200         CORRECT-N PERFORM PRINT-DETAIL.
175300     ADD 1 TO REC-CT.
175400 ADD-TEST-F1-50-7.
175500     MOVE   "ADD-TEST-F1-50-7"  TO PAR-NAME.
175600     IF      WRK-XN-00001 = "0"
175700             PERFORM PASS
175800             PERFORM PRINT-DETAIL
175900     ELSE
176000             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
176100                  TO RE-MARK
176200             MOVE   "0"           TO CORRECT-X
176300             MOVE    WRK-XN-00001 TO COMPUTED-X
176400             PERFORM FAIL
176500             PERFORM PRINT-DETAIL.
176600*
176700 ADD-INIT-F1-51.
176800*    ==-->  MULTIPLE RESULT FIELDS  <--==
176900*    ==-->    NEW SIZE ERROR TESTS  <--==
177000     MOVE   "VI-67 6.4.2"     TO ANSI-REFERENCE.
177100     MOVE   "ADD-TEST-F1-51"  TO PAR-NAME.
177200     MOVE    ZERO TO WRK-DU-2V1-1 WRK-DU-2V0-1 WRK-DU-2V1-2
177300             WRK-DU-2V0-2 WRK-DU-2V1-3 WRK-DU-2V0-3.
177400     MOVE    1.1 TO WRK-DU-1V1-1.
177500     MOVE    2.4 TO WRK-DU-1V1-2.
177600     MOVE   "0"  TO WRK-XN-00001.
177700     MOVE 1 TO REC-CT.
177800 ADD-TEST-F1-51-0.
177900     ADD WRK-DU-1V1-1  WRK-DU-1V1-2  6 TO WRK-DU-2V1-1,
178000         WRK-DU-2V0-1 ROUNDED  WRK-DU-2V1-2  WRK-DU-2V0-2 ROUNDED
178100         WRK-DU-2V1-3  WRK-DU-2V0-3
178200          ON SIZE ERROR
178300             MOVE   "1" TO WRK-XN-00001
178400      NOT ON SIZE ERROR
178500             MOVE   "2" TO WRK-XN-00001.
178600     GO TO   ADD-TEST-F1-51-1.
178700 ADD-DELETE-F1-51.
178800     PERFORM DE-LETE.
178900     PERFORM PRINT-DETAIL.
179000     GO TO ADD-INIT-F1-52.
179100 ADD-TEST-F1-51-1.
179200     MOVE   "ADD-TEST-F1-51-1"  TO PAR-NAME.
179300     IF WRK-DU-2V1-1 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
179400         ELSE
179500         PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 9.5
179600         TO CORRECT-N PERFORM PRINT-DETAIL.
179700     ADD 1 TO REC-CT.
179800 ADD-TEST-F1-51-2.
179900     MOVE   "ADD-TEST-F1-51-2"  TO PAR-NAME.
180000     IF WRK-DU-2V0-1 = 10 PERFORM PASS PERFORM PRINT-DETAIL
180100         ELSE
180200         PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 10 TO
180300         CORRECT-N PERFORM PRINT-DETAIL.
180400     ADD 1 TO REC-CT.
180500 ADD-TEST-F1-51-3.
180600     MOVE   "ADD-TEST-F1-51-3"  TO PAR-NAME.
180700     IF WRK-DU-2V1-2 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
180800         ELSE
180900         PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 9.5 TO
181000         CORRECT-N PERFORM PRINT-DETAIL.
181100     ADD 1 TO REC-CT.
181200 ADD-TEST-F1-51-4.
181300     MOVE   "ADD-TEST-F1-51-4"  TO PAR-NAME.
181400     IF WRK-DU-2V0-2 = 10 PERFORM PASS PERFORM PRINT-DETAIL
181500         ELSE
181600         PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 10 TO
181700         CORRECT-N PERFORM PRINT-DETAIL.
181800     ADD 1 TO REC-CT.
181900 ADD-TEST-F1-51-5.
182000     MOVE   "ADD-TEST-F1-51-5"  TO PAR-NAME.
182100     IF WRK-DU-2V1-3 = 9.5 PERFORM PASS PERFORM PRINT-DETAIL
182200         ELSE
182300         PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 9.5 TO
182400         CORRECT-N PERFORM PRINT-DETAIL.
182500     ADD 1 TO REC-CT.
182600 ADD-TEST-F1-51-6.
182700     MOVE   "ADD-TEST-F1-51-6"  TO PAR-NAME.
182800     IF WRK-DU-2V0-3 = 9 PERFORM PASS PERFORM PRINT-DETAIL
182900         ELSE
183000         PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 9 TO
183100         CORRECT-N PERFORM PRINT-DETAIL.
183200     ADD 1 TO REC-CT.
183300 ADD-TEST-F1-51-7.
183400     MOVE   "ADD-TEST-F1-51-7"  TO PAR-NAME.
183500     IF      WRK-XN-00001 = "2"
183600             PERFORM PASS
183700             PERFORM PRINT-DETAIL
183800     ELSE
183900             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
184000                  TO RE-MARK
184100             MOVE   "2"           TO CORRECT-X
184200             MOVE    WRK-XN-00001 TO COMPUTED-X
184300             PERFORM FAIL
184400             PERFORM PRINT-DETAIL.
184500*
184600 ADD-INIT-F1-52.
184700*    ==-->  MULTIPLE RESULT FIELDS  <--==
184800*    ==-->    NEW SIZE ERROR TESTS  <--==
184900     MOVE   "VI-67 6.4.2"     TO ANSI-REFERENCE.
185000     MOVE   "ADD-TEST-F1-52"  TO PAR-NAME.
185100     MOVE    ZERO TO WRK-DU-2V1-1 WRK-DU-2V0-1 WRK-DU-2V1-2
185200             WRK-DU-2V0-2 WRK-DU-2V1-3 WRK-DU-2V0-3.
185300     MOVE    1.1 TO WRK-DU-1V1-1.
185400     MOVE    2.4 TO WRK-DU-1V1-2.
185500     MOVE   "0"  TO WRK-XN-00001.
185600     MOVE 1 TO REC-CT.
185700 ADD-TEST-F1-52-0.
185800     ADD     A17TWOS-DS-17V00
185900             WRK-DU-1V1-2  6
186000          TO WRK-DU-2V1-1
186100             WRK-DU-2V0-1 ROUNDED
186200             WRK-DU-2V1-2
186300             WRK-DU-2V0-2 ROUNDED
186400             WRK-DU-2V1-3
186500             WRK-DU-2V0-3
186600          ON SIZE ERROR
186700             MOVE   "1" TO WRK-XN-00001
186800      NOT ON SIZE ERROR
186900             MOVE   "2" TO WRK-XN-00001.
187000     GO TO   ADD-TEST-F1-52-1.
187100 ADD-DELETE-F1-52.
187200     PERFORM DE-LETE.
187300     PERFORM PRINT-DETAIL.
187400     GO TO   ADD-INIT-F1-53.
187500 ADD-TEST-F1-52-1.
187600     MOVE   "ADD-TEST-F1-52-1"  TO PAR-NAME.
187700     IF WRK-DU-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
187800         ELSE
187900         PERFORM FAIL MOVE WRK-DU-2V1-1 TO COMPUTED-N MOVE 0
188000         TO CORRECT-N PERFORM PRINT-DETAIL.
188100     ADD 1 TO REC-CT.
188200 ADD-TEST-F1-52-2.
188300     MOVE   "ADD-TEST-F1-52-2"  TO PAR-NAME.
188400     IF WRK-DU-2V0-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
188500         ELSE
188600         PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 0 TO
188700         CORRECT-N PERFORM PRINT-DETAIL.
188800     ADD 1 TO REC-CT.
188900 ADD-TEST-F1-52-3.
189000     MOVE   "ADD-TEST-F1-52-3"  TO PAR-NAME.
189100     IF WRK-DU-2V1-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
189200         ELSE
189300         PERFORM FAIL MOVE WRK-DU-2V1-2 TO COMPUTED-N MOVE 0 TO
189400         CORRECT-N PERFORM PRINT-DETAIL.
189500     ADD 1 TO REC-CT.
189600 ADD-TEST-F1-52-4.
189700     MOVE   "ADD-TEST-F1-52-4"  TO PAR-NAME.
189800     IF WRK-DU-2V0-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
189900         ELSE
190000         PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 0 TO
190100         CORRECT-N PERFORM PRINT-DETAIL.
190200     ADD 1 TO REC-CT.
190300 ADD-TEST-F1-52-5.
190400     MOVE   "ADD-TEST-F1-52-5"  TO PAR-NAME.
190500     IF WRK-DU-2V1-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
190600         ELSE
190700         PERFORM FAIL MOVE WRK-DU-2V1-3 TO COMPUTED-N MOVE 0 TO
190800         CORRECT-N PERFORM PRINT-DETAIL.
190900     ADD 1 TO REC-CT.
191000 ADD-TEST-F1-52-6.
191100     MOVE   "ADD-TEST-F1-52-6"  TO PAR-NAME.
191200     IF WRK-DU-2V0-3 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
191300         ELSE
191400         PERFORM FAIL MOVE WRK-DU-2V0-3 TO COMPUTED-N MOVE 0 TO
191500         CORRECT-N PERFORM PRINT-DETAIL.
191600     ADD 1 TO REC-CT.
191700 ADD-TEST-F1-52-7.
191800     MOVE   "ADD-TEST-F1-52-7"  TO PAR-NAME.
191900     IF      WRK-XN-00001 = "1"
192000             PERFORM PASS
192100             PERFORM PRINT-DETAIL
192200     ELSE
192300             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
192400                  TO RE-MARK
192500             MOVE   "1"           TO CORRECT-X
192600             MOVE    WRK-XN-00001 TO COMPUTED-X
192700             PERFORM FAIL
192800             PERFORM PRINT-DETAIL.
192900*
193000 ADD-INIT-F1-53.
193100*    ==--> EXPLICIT SCOPE TERMINATOR<--==
193200     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
193300     MOVE   "ADD-TEST-F1-53"  TO PAR-NAME.
193400     MOVE    SPACE TO WRK-XN-00001.
193500     MOVE    SPACE TO SIZE-ERR2.
193600     MOVE    SPACE TO SIZE-ERR3.
193700     MOVE    SPACE TO SIZE-ERR4.
193800     MOVE   -11 TO WRK-DS-02V00.
193900     MOVE    1  TO REC-CT.
194000 ADD-TEST-F1-53-0.
194100     ADD    -99 TO WRK-DS-02V00
194200             ON SIZE ERROR
194300             MOVE   "1" TO WRK-XN-00001
194400             MOVE   "A" TO SIZE-ERR2
194500             MOVE   "B" TO SIZE-ERR3
194600     END-ADD
194700     MOVE   "C" TO SIZE-ERR4.
194800     GO TO   ADD-TEST-F1-53-1.
194900 ADD-DELETE-F1-53.
195000     PERFORM DE-LETE.
195100     PERFORM PRINT-DETAIL.
195200     GO TO   ADD-INIT-F1-54.
195300 ADD-TEST-F1-53-1.
195400     MOVE   "ADD-TEST-F1-53-1" TO PAR-NAME.
195500     IF      WRK-XN-00001 = "1"
195600             PERFORM PASS
195700             PERFORM PRINT-DETAIL
195800     ELSE
195900             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
196000                  TO RE-MARK
196100             MOVE   "1"           TO CORRECT-X
196200             MOVE    WRK-XN-00001 TO COMPUTED-X
196300             PERFORM FAIL
196400             PERFORM PRINT-DETAIL.
196500     ADD     1 TO REC-CT.
196600 ADD-TEST-F1-53-2.
196700     MOVE   "ADD-TEST-F1-53-2" TO PAR-NAME.
196800     IF      SIZE-ERR2 = "A"
196900             PERFORM PASS
197000             PERFORM PRINT-DETAIL
197100     ELSE
197200             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
197300                  TO RE-MARK
197400             MOVE   "A"        TO CORRECT-X
197500             MOVE    SIZE-ERR2 TO COMPUTED-X
197600             PERFORM FAIL
197700             PERFORM PRINT-DETAIL.
197800     ADD     1 TO REC-CT.
197900 ADD-TEST-F1-53-3.
198000     MOVE   "ADD-TEST-F1-53-3" TO PAR-NAME.
198100     IF      SIZE-ERR3 = "B"
198200             PERFORM PASS
198300             PERFORM PRINT-DETAIL
198400     ELSE
198500             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
198600                  TO RE-MARK
198700             MOVE   "B"        TO CORRECT-X
198800             MOVE    SIZE-ERR3 TO COMPUTED-X
198900             PERFORM FAIL
199000             PERFORM PRINT-DETAIL.
199100     ADD     1 TO REC-CT.
199200 ADD-TEST-F1-53-4.
199300     MOVE   "ADD-TEST-F1-53-4" TO PAR-NAME.
199400     IF      SIZE-ERR4 = "C"
199500             PERFORM PASS
199600             PERFORM PRINT-DETAIL
199700     ELSE
199800             MOVE   "SCOPE TERMINATOR IGNORED"
199900                  TO RE-MARK
200000             MOVE   "C"        TO CORRECT-X
200100             MOVE    SIZE-ERR4 TO COMPUTED-X
200200             PERFORM FAIL
200300             PERFORM PRINT-DETAIL.
200400     ADD     1 TO REC-CT.
200500 ADD-TEST-F1-53-5.
200600     MOVE   "ADD-TEST-F1-53-5" TO PAR-NAME.
200700     IF      WRK-DS-02V00 = -11
200800             PERFORM PASS
200900             PERFORM PRINT-DETAIL
201000     ELSE
201100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
201200                  TO RE-MARK
201300             MOVE    -11          TO CORRECT-N
201400             MOVE    WRK-DS-02V00 TO COMPUTED-N
201500             PERFORM FAIL
201600             PERFORM PRINT-DETAIL.
201700*
201800 ADD-INIT-F1-54.
201900*    ==--> EXPLICIT SCOPE TERMINATOR<--==
202000     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
202100     MOVE   "ADD-TEST-F1-54"  TO PAR-NAME.
202200     MOVE    SPACE TO WRK-XN-00001.
202300     MOVE    SPACE TO SIZE-ERR2.
202400     MOVE    SPACE TO SIZE-ERR3.
202500     MOVE    SPACE TO SIZE-ERR4.
202600     MOVE    ZERO TO WRK-DS-06V06.
202700     MOVE    1    TO REC-CT.
202800 ADD-TEST-F1-54-0.
202900     ADD     A12THREES-DS-06V06
203000             333333
203100             A06THREES-DS-03V03
203200          TO WRK-DS-06V06 ROUNDED
203300             ON SIZE ERROR
203400             MOVE   "1" TO WRK-XN-00001
203500             MOVE   "A" TO SIZE-ERR2
203600             MOVE   "B" TO SIZE-ERR3
203700     END-ADD
203800     MOVE   "C" TO SIZE-ERR4.
203900     GO TO   ADD-TEST-F1-54-1.
204000 ADD-DELETE-F1-54.
204100     PERFORM DE-LETE.
204200     PERFORM PRINT-DETAIL.
204300     GO TO   ADD-INIT-F1-55.
204400 ADD-TEST-F1-54-1.
204500     MOVE   "ADD-TEST-F1-54-1" TO PAR-NAME.
204600     IF      WRK-XN-00001 = SPACE
204700             PERFORM PASS
204800             PERFORM PRINT-DETAIL
204900     ELSE
205000             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
205100                  TO RE-MARK
205200             MOVE    SPACE        TO CORRECT-X
205300             MOVE    WRK-XN-00001 TO COMPUTED-X
205400             PERFORM FAIL
205500             PERFORM PRINT-DETAIL.
205600     ADD     1 TO REC-CT.
205700 ADD-TEST-F1-54-2.
205800     MOVE   "ADD-TEST-F1-54-2" TO PAR-NAME.
205900     IF      SIZE-ERR2 = SPACE
206000             PERFORM PASS
206100             PERFORM PRINT-DETAIL
206200     ELSE
206300             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
206400                  TO RE-MARK
206500             MOVE    SPACE     TO CORRECT-X
206600             MOVE    SIZE-ERR2 TO COMPUTED-X
206700             PERFORM FAIL
206800             PERFORM PRINT-DETAIL.
206900     ADD     1 TO REC-CT.
207000 ADD-TEST-F1-54-3.
207100     MOVE   "ADD-TEST-F1-54-3" TO PAR-NAME.
207200     IF      SIZE-ERR3 = SPACE
207300             PERFORM PASS
207400             PERFORM PRINT-DETAIL
207500     ELSE
207600             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
207700                  TO RE-MARK
207800             MOVE    SPACE     TO CORRECT-X
207900             MOVE    SIZE-ERR3 TO COMPUTED-X
208000             PERFORM FAIL
208100             PERFORM PRINT-DETAIL.
208200     ADD     1 TO REC-CT.
208300 ADD-TEST-F1-54-4.
208400     MOVE   "ADD-TEST-F1-54-4" TO PAR-NAME.
208500     IF      SIZE-ERR4 = "C"
208600             PERFORM PASS
208700             PERFORM PRINT-DETAIL
208800     ELSE
208900             MOVE   "SCOPE TERMINATOR IGNORED"
209000                  TO RE-MARK
209100             MOVE   "C"        TO CORRECT-X
209200             MOVE    SIZE-ERR4 TO COMPUTED-X
209300             PERFORM FAIL
209400             PERFORM PRINT-DETAIL
209500             ADD     1 TO REC-CT.
209600 ADD-TEST-F1-54-5.
209700     MOVE   "ADD-TEST-F1-54-5" TO PAR-NAME.
209800     IF      WRK-DS-06V06 = 666999.666333
209900             PERFORM PASS
210000             PERFORM PRINT-DETAIL
210100     ELSE
210200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
210300                  TO RE-MARK
210400             MOVE    666999.666333 TO CORRECT-N
210500             MOVE    WRK-DS-06V06  TO COMPUTED-N
210600             PERFORM FAIL
210700             PERFORM PRINT-DETAIL.
210800*
210900 ADD-INIT-F1-55.
211000*    ==--> EXPLICIT SCOPE TERMINATOR<--==
211100     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
211200     MOVE   "ADD-TEST-F1-55"  TO PAR-NAME.
211300     MOVE   SPACE TO WRK-XN-00001.
211400     MOVE   SPACE TO SIZE-ERR2.
211500     MOVE   SPACE TO SIZE-ERR3.
211600     MOVE   SPACE TO SIZE-ERR4.
211700     MOVE     -11 TO WRK-DS-02V00.
211800     MOVE       1 TO REC-CT.
211900 ADD-TEST-F1-55-0.
212000     ADD    -99 TO WRK-DS-02V00
212100             NOT ON SIZE ERROR
212200             MOVE   "1" TO WRK-XN-00001
212300             MOVE   "A" TO SIZE-ERR2
212400             MOVE   "B" TO SIZE-ERR3
212500     END-ADD
212600     MOVE   "C" TO SIZE-ERR4.
212700     GO TO   ADD-TEST-F1-55-1.
212800 ADD-DELETE-F1-55.
212900     PERFORM DE-LETE.
213000     PERFORM PRINT-DETAIL.
213100     GO      TO ADD-INIT-F1-56.
213200 ADD-TEST-F1-55-1.
213300     MOVE   "ADD-TEST-F1-55-1" TO PAR-NAME.
213400     IF      WRK-XN-00001 = SPACE
213500             PERFORM PASS
213600             PERFORM PRINT-DETAIL
213700     ELSE
213800             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
213900                  TO RE-MARK
214000             MOVE    SPACE        TO CORRECT-X
214100             MOVE    WRK-XN-00001 TO COMPUTED-X
214200             PERFORM FAIL
214300             PERFORM PRINT-DETAIL.
214400     ADD     1 TO REC-CT.
214500 ADD-TEST-F1-55-2.
214600     MOVE   "ADD-TEST-F1-55-2" TO PAR-NAME.
214700     IF      SIZE-ERR2 = SPACE
214800             PERFORM PASS
214900             PERFORM PRINT-DETAIL
215000     ELSE
215100             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
215200                  TO RE-MARK
215300             MOVE    SPACE     TO CORRECT-X
215400             MOVE    SIZE-ERR2 TO COMPUTED-X
215500             PERFORM FAIL
215600             PERFORM PRINT-DETAIL.
215700     ADD     1 TO REC-CT.
215800 ADD-TEST-F1-55-3.
215900     MOVE   "ADD-TEST-F1-55-3" TO PAR-NAME.
216000     IF      SIZE-ERR3 = SPACE
216100             PERFORM PASS
216200             PERFORM PRINT-DETAIL
216300     ELSE
216400             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
216500                  TO RE-MARK
216600             MOVE    SPACE     TO CORRECT-X
216700             MOVE    SIZE-ERR3 TO COMPUTED-X
216800             PERFORM FAIL
216900             PERFORM PRINT-DETAIL.
217000     ADD     1 TO REC-CT.
217100 ADD-TEST-F1-55-4.
217200     MOVE   "ADD-TEST-F1-55-4" TO PAR-NAME.
217300     IF      SIZE-ERR4 = "C"
217400             PERFORM PASS
217500             PERFORM PRINT-DETAIL
217600     ELSE
217700             MOVE   "SCOPE TERMINATOR IGNORED"
217800                  TO RE-MARK
217900             MOVE   "C"        TO CORRECT-X
218000             MOVE    SIZE-ERR4 TO COMPUTED-X
218100             PERFORM FAIL
218200             PERFORM PRINT-DETAIL.
218300     ADD     1 TO REC-CT.
218400 ADD-TEST-F1-55-5.
218500     MOVE   "ADD-TEST-F1-55-5" TO PAR-NAME.
218600     IF      WRK-DS-02V00 = -11
218700             PERFORM PASS
218800             PERFORM PRINT-DETAIL
218900     ELSE
219000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
219100                  TO RE-MARK
219200             MOVE    -11          TO CORRECT-N
219300             MOVE    WRK-DS-02V00 TO COMPUTED-N
219400             PERFORM FAIL
219500             PERFORM PRINT-DETAIL.
219600*
219700 ADD-INIT-F1-56.
219800*    ==--> EXPLICIT SCOPE TERMINATOR<--==
219900     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
220000     MOVE   "ADD-TEST-F1-56"  TO PAR-NAME.
220100     MOVE    SPACE TO WRK-XN-00001.
220200     MOVE    SPACE TO SIZE-ERR2.
220300     MOVE    SPACE TO SIZE-ERR3.
220400     MOVE    SPACE TO SIZE-ERR4.
220500     MOVE    ZERO  TO WRK-DS-06V06.
220600     MOVE    1     TO REC-CT.
220700 ADD-TEST-F1-56-0.
220800     ADD     A12THREES-DS-06V06
220900             333333
221000             A06THREES-DS-03V03
221100          TO WRK-DS-06V06 ROUNDED
221200         NOT ON SIZE ERROR
221300             MOVE   "1" TO WRK-XN-00001
221400             MOVE   "A" TO SIZE-ERR2
221500             MOVE   "B" TO SIZE-ERR3
221600     END-ADD
221700     MOVE   "C" TO SIZE-ERR4.
221800     GO TO   ADD-TEST-F1-56-1.
221900 ADD-DELETE-F1-56.
222000     PERFORM DE-LETE.
222100     PERFORM PRINT-DETAIL.
222200     GO TO   ADD-INIT-F1-57.
222300 ADD-TEST-F1-56-1.
222400     MOVE   "ADD-TEST-F1-56-1" TO PAR-NAME.
222500     IF      WRK-XN-00001 = "1"
222600             PERFORM PASS
222700             PERFORM PRINT-DETAIL
222800     ELSE
222900             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
223000                  TO RE-MARK
223100             MOVE   "1"           TO CORRECT-X
223200             MOVE    WRK-XN-00001 TO COMPUTED-X
223300             PERFORM FAIL
223400             PERFORM PRINT-DETAIL.
223500             ADD     1 TO REC-CT.
223600 ADD-TEST-F1-56-2.
223700     MOVE   "ADD-TEST-F1-56-2" TO PAR-NAME.
223800     IF      SIZE-ERR2 = "A"
223900             PERFORM PASS
224000             PERFORM PRINT-DETAIL
224100     ELSE
224200             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
224300                  TO RE-MARK
224400             MOVE   "A"        TO CORRECT-X
224500             MOVE    SIZE-ERR2 TO COMPUTED-X
224600             PERFORM FAIL
224700             PERFORM PRINT-DETAIL.
224800     ADD     1 TO REC-CT.
224900 ADD-TEST-F1-56-3.
225000     MOVE   "ADD-TEST-F1-56-3" TO PAR-NAME.
225100     IF      SIZE-ERR3 = "B"
225200             PERFORM PASS
225300             PERFORM PRINT-DETAIL
225400     ELSE
225500             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
225600                  TO RE-MARK
225700             MOVE   "B"        TO CORRECT-X
225800             MOVE    SIZE-ERR3 TO COMPUTED-X
225900             PERFORM FAIL
226000             PERFORM PRINT-DETAIL.
226100     ADD     1 TO REC-CT.
226200 ADD-TEST-F1-56-4.
226300     MOVE   "ADD-TEST-F1-56-4" TO PAR-NAME.
226400     IF      SIZE-ERR4 = "C"
226500             PERFORM PASS
226600             PERFORM PRINT-DETAIL
226700     ELSE
226800             MOVE   "SCOPE TERMINATOR IGNORED"
226900                  TO RE-MARK
227000             MOVE   "C"        TO CORRECT-X
227100             MOVE    SIZE-ERR4 TO COMPUTED-X
227200             PERFORM FAIL
227300             PERFORM PRINT-DETAIL.
227400     ADD     1 TO REC-CT.
227500 ADD-TEST-F1-56-5.
227600     MOVE   "ADD-TEST-F1-56-5" TO PAR-NAME.
227700     IF      WRK-DS-06V06 = 666999.666333
227800             PERFORM PASS
227900             PERFORM PRINT-DETAIL
228000     ELSE
228100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
228200                  TO RE-MARK
228300             MOVE    666999.666333 TO CORRECT-N
228400             MOVE    WRK-DS-06V06  TO COMPUTED-N
228500             PERFORM FAIL
228600             PERFORM PRINT-DETAIL.
228700*
228800 ADD-INIT-F1-57.
228900*    ==--> EXPLICIT SCOPE TERMINATOR<--==
229000     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
229100     MOVE   "ADD-TEST-F1-57"  TO PAR-NAME.
229200     MOVE   "0"   TO WRK-XN-00001.
229300     MOVE   "0"   TO SIZE-ERR2.
229400     MOVE   "0"   TO SIZE-ERR3.
229500     MOVE   "0"   TO SIZE-ERR4.
229600     MOVE   -11   TO WRK-DS-02V00.
229700     MOVE    1    TO REC-CT.
229800 ADD-TEST-F1-57-0.
229900     ADD    -99 TO WRK-DS-02V00
230000          ON SIZE ERROR
230100             MOVE   SPACE TO WRK-XN-00001
230200      NOT ON SIZE ERROR
230300             MOVE   "1" TO WRK-XN-00001
230400     END-ADD
230500     MOVE   "C" TO SIZE-ERR4.
230600     GO TO   ADD-TEST-F1-57-1.
230700 ADD-DELETE-F1-57.
230800     PERFORM DE-LETE.
230900     PERFORM PRINT-DETAIL.
231000     GO TO   ADD-INIT-F1-58.
231100 ADD-TEST-F1-57-1.
231200     MOVE   "ADD-TEST-F1-57-1" TO PAR-NAME.
231300     IF      WRK-XN-00001 = SPACE
231400             PERFORM PASS
231500             PERFORM PRINT-DETAIL
231600     ELSE
231700             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
231800                  TO RE-MARK
231900             MOVE    SPACE        TO CORRECT-X
232000             MOVE    WRK-XN-00001 TO COMPUTED-X
232100             PERFORM FAIL
232200             PERFORM PRINT-DETAIL.
232300     ADD     1 TO REC-CT.
232400 ADD-TEST-F1-57-2.
232500     MOVE   "ADD-TEST-F1-57-2" TO PAR-NAME.
232600     IF      SIZE-ERR4 = "C"
232700             PERFORM PASS
232800             PERFORM PRINT-DETAIL
232900     ELSE
233000             MOVE   "SCOPE TERMINATOR IGNORED"
233100                  TO RE-MARK
233200             MOVE   "C"        TO CORRECT-X
233300             MOVE    SIZE-ERR4 TO COMPUTED-X
233400             PERFORM FAIL
233500             PERFORM PRINT-DETAIL.
233600     ADD     1 TO REC-CT.
233700 ADD-TEST-F1-57-3.
233800     MOVE   "ADD-TEST-F1-57-3" TO PAR-NAME.
233900     IF      WRK-DS-02V00 = -11
234000             PERFORM PASS
234100             PERFORM PRINT-DETAIL
234200     ELSE
234300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
234400                  TO RE-MARK
234500             MOVE    -11          TO CORRECT-N
234600             MOVE    WRK-DS-02V00 TO COMPUTED-N
234700             PERFORM FAIL
234800             PERFORM PRINT-DETAIL.
234900*
235000 ADD-INIT-F1-58.
235100*    ==--> EXPLICIT SCOPE TERMINATOR<--==
235200     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
235300     MOVE   "ADD-TEST-F1-58"  TO PAR-NAME.
235400     MOVE    SPACE TO WRK-XN-00001.
235500     MOVE    SPACE TO SIZE-ERR2.
235600     MOVE    SPACE TO SIZE-ERR3.
235700     MOVE    SPACE TO SIZE-ERR4.
235800     MOVE    ZERO  TO WRK-DS-06V06.
235900     MOVE    1     TO REC-CT.
236000 ADD-TEST-F1-58-0.
236100     ADD     A12THREES-DS-06V06
236200             333333
236300             A06THREES-DS-03V03
236400          TO WRK-DS-06V06 ROUNDED
236500             ON SIZE ERROR
236600             MOVE   "X" TO WRK-XN-00001
236700         NOT ON SIZE ERROR
236800             MOVE   "1" TO WRK-XN-00001
236900     END-ADD
237000     MOVE   "C" TO SIZE-ERR4.
237100     GO TO   ADD-TEST-F1-58-1.
237200 ADD-DELETE-F1-58.
237300     PERFORM DE-LETE.
237400     PERFORM PRINT-DETAIL.
237500     GO TO   CCVS-EXIT.
237600 ADD-TEST-F1-58-1.
237700     MOVE   "ADD-TEST-F1-58-1" TO PAR-NAME.
237800     IF      WRK-XN-00001 = "1"
237900             PERFORM PASS
238000             PERFORM PRINT-DETAIL
238100     ELSE
238200             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
238300                  TO RE-MARK
238400             MOVE   "1"           TO CORRECT-X
238500             MOVE    WRK-XN-00001 TO COMPUTED-X
238600             PERFORM FAIL
238700             PERFORM PRINT-DETAIL.
238800     ADD     1 TO REC-CT.
238900 ADD-TEST-F1-58-2.
239000     MOVE   "ADD-TEST-F1-58-2" TO PAR-NAME.
239100     IF      SIZE-ERR4 = "C"
239200             PERFORM PASS
239300             PERFORM PRINT-DETAIL
239400     ELSE
239500             MOVE   "SCOPE TERMINATOR IGNORED"
239600                  TO RE-MARK
239700             MOVE   "C"        TO CORRECT-X
239800             MOVE    SIZE-ERR4 TO COMPUTED-X
239900             PERFORM FAIL
240000             PERFORM PRINT-DETAIL.
240100     ADD     1 TO REC-CT.
240200 ADD-TEST-F1-58-3.
240300     MOVE   "ADD-TEST-F1-58-3" TO PAR-NAME.
240400     IF      WRK-DS-06V06 = 666999.666333
240500             PERFORM PASS
240600             PERFORM PRINT-DETAIL
240700     ELSE
240800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
240900                  TO RE-MARK
241000             MOVE    666999.666333 TO CORRECT-N
241100             MOVE    WRK-DS-06V06  TO COMPUTED-N
241200             PERFORM FAIL
241300             PERFORM PRINT-DETAIL.
241400*
241500 CCVS-EXIT SECTION.
241600 CCVS-999999.
241700     GO TO CLOSE-FILES.
