000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC172A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*    THIS PROGRAM TESTS THE FORMAT 2 DIVIDE STATEMENT FOUND
002200*    IN LEVEL 1.   ALL COMBINATIONS OF THE OPTIONAL PHRASES
002300*    "SIZE ERROR", "NOT SIZE ERROR" AND "END-MULTIPLY" ARE
002400*    TESTED, AS WELL AS THE ROUNDED OPTION.
002500*
002600*    VARIOUS COMBINATIONS OF SIGNED AND UNSIGNED NUMERIC
002700*    LITERALS, DISPLAY AND COMPUTATIONAL FIELDS ARE USED
002800*    AS OPERANDS.
002900*
003000
003100
003200 ENVIRONMENT DIVISION.
003300 CONFIGURATION SECTION.
003400 SOURCE-COMPUTER.
003500     XXXXX082.
003600 OBJECT-COMPUTER.
003700     XXXXX083.
003800 INPUT-OUTPUT SECTION.
003900 FILE-CONTROL.
004000     SELECT PRINT-FILE ASSIGN TO
004100     XXXXX055.
004200 DATA DIVISION.
004300 FILE SECTION.
004400 FD  PRINT-FILE.
004500 01  PRINT-REC PICTURE X(120).
004600 01  DUMMY-RECORD PICTURE X(120).
004700 WORKING-STORAGE SECTION.
004800 77  WRK-DS-18V00                PICTURE S9(18).
004900 77  A06THREES-DS-03V03          PICTURE S999V999 VALUE 333.333.
005000 77  WRK-DS-06V06                PICTURE S9(6)V9(6).
005100 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06 PICTURE S9(12).
005200 77  A08TWOS-DS-02V06            PICTURE S99V9(6) VALUE 22.222222.
005300 77  WRK-DS-10V00                PICTURE S9(10).
005400 77  WRK-XN-00001                PICTURE X.
005500 77  A10ONES-DS-10V00            PICTURE S9(10)
005600                                 VALUE 1111111111.
005700 77  A12THREES-DS-06V06          PICTURE S9(6)V9(6)
005800                                 VALUE 333333.333333.
005900 77  WRK-DS-02V00                PICTURE S99.
006000 77  AZERO-DS-05V05              PICTURE S9(5)V9(5) VALUE ZERO.
006100 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
006200 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09 PICTURE S9(18).
006300 77  A05ONES-DS-00V05            PICTURE SV9(5) VALUE .11111.
006400 77  A12ONES-DS-12V00            PICTURE S9(12)
006500                                 VALUE 111111111111.
006600 77  A01ONE-DS-P0801             PICTURE SP(8)9 VALUE .000000001.
006700 77  WRK-DS-09V08                PICTURE S9(9)V9(8).
006800 77  WRK-DS-17V00-S REDEFINES WRK-DS-09V08 PICTURE S9(17).
006900 77  A18ONES-DS-18V00            PICTURE S9(18)
007000                                 VALUE 111111111111111111.
007100 77  WRK-DS-0201P                PICTURE S99P.
007200 77  WRK-CS-18V00                PICTURE S9(18) COMPUTATIONAL.
007300 77  WRK-DU-18V00                PICTURE 9(18).
007400 77  A99-CS-02V00                PICTURE S99 COMPUTATIONAL
007500                                 VALUE 99.
007600 77  A01ONE-CS-00V01             PICTURE SV9 COMPUTATIONAL
007700                                 VALUE .1.
007800 77  A99-DS-02V00                PICTURE S99   VALUE 99.
007900 77  WRK-DS-12V00                PICTURE S9(12).
008000 77  WRK-DS-01V00                PICTURE S9.
008100 77  WRK-DS-03V10                PICTURE S9(3)V9(10).
008200 77  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
008300                                 VALUE 111111111.111111111.
008400 77  A02TWOS-DU-02V00            PICTURE 99  VALUE 22.
008500 77  WRK-DS-05V00                PICTURE S9(5).
008600 77  A02TWOS-DS-03V02            PICTURE S999V99 VALUE +022.00.
008700 77  WRK-CS-02V02                PICTURE S99V99  COMPUTATIONAL.
008800 77  A990-DS-0201P               PICTURE S99P   VALUE +990.
008900 77  XRAY                        PICTURE X.
009000 01  WRK-XN-18-1 PIC X(18).
009100 01  WRK-AN-X-18-1, REDEFINES WRK-XN-18-1 PIC A(18).
009200 01  WRK-DU-X-18V0-1; REDEFINES WRK-XN-18-1 PIC 9(18).
009300 01  WRK-DU-0V1-1 PIC V9 VALUE .3.
009400 01  WRK-DU-0V2-1 PIC V99 VALUE .25.
009500 01  WRK-DU-0V12-1 PIC V9(12) VALUE .00001.
009600 01  WRK-DU-1V0-1 PIC 9 VALUE ZERO.
009700 01  WRK-DU-1V1-1 PIC 9V9 VALUE 1.1.
009800 01  WRK-DU-1V1-2 PIC 9V9 VALUE 2.4.
009900 01  WRK-DU-1V3-1 PIC 9V999 VALUE 1.001.
010000 01  WRK-DU-1V3-2 PIC 9V999 VALUE 1.001.
010100 01  WRK-DU-1V5-1 PIC 9V9(5).
010200 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
010300 01  WRK-DU-2P6-1 PIC 99P(6) VALUE 99000000.
010400 01  WRK-DU-2V0-1 PIC 99.
010500 01  WRK-DU-2V0-2 PIC 99.
010600 01  WRK-DU-2V0-3 PIC 99.
010700 01  WRK-DU-2V1-1 PIC 99V9.
010800 01  WRK-DU-2V1-2 PIC 99V9.
010900 01  WRK-DU-2V1-3 PIC 99V9.
011000 01  WRK-DU-2V2-1 PIC 99V99 VALUE 15.44.
011100 01  WRK-DU-2V2-2 PIC 99V99 VALUE 60.89.
011200 01  WRK-DU-2V2-3 PIC 99V99 VALUE 60.99.
011300 01  WRK-DU-2V2-4 PIC 99V99 VALUE 60.99.
011400 01  WRK-DU-2V2-5 PIC 99V99 VALUE 10.00.
011500 01  WRK-DU-2V5-1 PIC 99V9(5).
011600 01  WRK-DU-4P1-1 PIC P(4)9 VALUE .00001.
011700 01  WRK-DU-5V1-1 PIC 9(5)V9 VALUE 12345.6.
011800 01  WRK-DU-6V0-1 PIC 9(6) VALUE 99999.
011900 01  WRK-DU-6V0-2 PIC 9(6) VALUE 99999.
012000 01  WRK-DU-16V2-1 PIC 9(16)V99 VALUE 9999999999999999.99.
012100 01  WRK-NE-X-1 PIC 9(16).99.
012200 01  WRK-DS-1V0-1 PIC S9 VALUE -3.
012300 01  WRK-DS-1V0-2 PIC S9 VALUE 2.
012400 01  WRK-DS-1V2-1 PIC S9V99 VALUE ZERO.
012500 01  WRK-DS-2V0-1 PIC S99 VALUE ZERO.
012600 01  WRK-DS-2V1-1 PIC S99V9 VALUE ZERO.
012700 01  WRK-DS-2V2-1 PIC S99V99 VALUE ZERO.
012800 01  WRK-DS-2V2-2 PIC S99V99 VALUE -12.34.
012900 01  WRK-DS-16V2-1 PIC S9(16)V99 VALUE -9999999999999999.99.
013000 01  WRK-NE-X-2 PIC -9(16).99.
013100 01  WRK-NE-1 PIC .9999/99999,99999,99.
013200 01  WRK-NE-2 PIC $**.99.
013300 01  WRK-NE-3 PIC $99.99CR.
013400 01  WRK-NE-4 PIC $*9.99 VALUE ZERO.
013500 77  A01ONES-CS-18V00   PICTURE S9(18) COMPUTATIONAL
013600             VALUE +000000000000000001.
013700 77  A02THREES-CS-18V00 PICTURE S9(18) COMPUTATIONAL
013800             VALUE -000000000000000033.
013900 77  A18SIXES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014000             VALUE 666666666666666666.
014100 77  A16NINES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014200             VALUE 009999999999999999.
014300 77  A14TWOS-CU-18V00   PICTURE 9(18) COMPUTATIONAL
014400             VALUE 000022222222222222.
014500 01  MULTIPLY-DATA.
014600     02 MULT1                           PICTURE IS 999V99
014700     VALUE IS 80.12.
014800     02 MULT2                           PICTURE IS 999V999.
014900     02 MULT3                           PICTURE IS $$99.99.
015000     02 MULT4                           PICTURE IS S99
015100     VALUE IS -56.
015200     02 MULT5                           PICTURE IS 9 VALUE IS 4.
015300     02 MULT6                           PICTURE IS 99 VALUE IS
015400     20.
015500 01  DIVIDE-DATA.
015600     02 DIV1                            PICTURE IS 9(4)V99
015700     VALUE IS 1620.36.
015800     02 DIV2                            PICTURE IS 99V9
015900     VALUE IS 44.1.
016000     02 DIV3                            PICTURE IS 9(4)V9
016100     VALUE IS 1661.7.
016200     02 DIV4                            PICTURE IS S9V999
016300     VALUE IS -9.642.
016400     02 DIV-02LEVEL-1.
016500     03 DIV5                            PICTURE IS V99
016600     VALUE IS .82.
016700     03 DIV6                            PICTURE IS 9 VALUE IS 0.
016800     03 DIV7                            PICTURE IS 9V9
016900     VALUE IS 9.6.
017000 01  DIV-DATA-2.
017100     02 DIV8                            PICTURE IS 99V9.
017200     02 DIV9                            PICTURE IS ZZ,ZZZ.9.
017300     02 DIV10                           PICTURE IS V999.
017400 01  TEST-RESULTS.
017500     02 FILLER                   PIC X      VALUE SPACE.
017600     02 FEATURE                  PIC X(20)  VALUE SPACE.
017700     02 FILLER                   PIC X      VALUE SPACE.
017800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
017900     02 FILLER                   PIC X      VALUE SPACE.
018000     02  PAR-NAME.
018100       03 FILLER                 PIC X(19)  VALUE SPACE.
018200       03  PARDOT-X              PIC X      VALUE SPACE.
018300       03 DOTVALUE               PIC 99     VALUE ZERO.
018400     02 FILLER                   PIC X(8)   VALUE SPACE.
018500     02 RE-MARK                  PIC X(61).
018600 01  TEST-COMPUTED.
018700     02 FILLER                   PIC X(30)  VALUE SPACE.
018800     02 FILLER                   PIC X(17)  VALUE
018900            "       COMPUTED=".
019000     02 COMPUTED-X.
019100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
019200     03 COMPUTED-N               REDEFINES COMPUTED-A
019300                                 PIC -9(9).9(9).
019400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
019500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
019600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
019700     03       CM-18V0 REDEFINES COMPUTED-A.
019800         04 COMPUTED-18V0                    PIC -9(18).
019900         04 FILLER                           PIC X.
020000     03 FILLER PIC X(50) VALUE SPACE.
020100 01  TEST-CORRECT.
020200     02 FILLER PIC X(30) VALUE SPACE.
020300     02 FILLER PIC X(17) VALUE "       CORRECT =".
020400     02 CORRECT-X.
020500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
020700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
020900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
021000     03      CR-18V0 REDEFINES CORRECT-A.
021100         04 CORRECT-18V0                     PIC -9(18).
021200         04 FILLER                           PIC X.
021300     03 FILLER PIC X(2) VALUE SPACE.
021400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021500 01  CCVS-C-1.
021600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
021700-    "SS  PARAGRAPH-NAME
021800-    "       REMARKS".
021900     02 FILLER                     PIC X(20)    VALUE SPACE.
022000 01  CCVS-C-2.
022100     02 FILLER                     PIC X        VALUE SPACE.
022200     02 FILLER                     PIC X(6)     VALUE "TESTED".
022300     02 FILLER                     PIC X(15)    VALUE SPACE.
022400     02 FILLER                     PIC X(4)     VALUE "FAIL".
022500     02 FILLER                     PIC X(94)    VALUE SPACE.
022600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
022700 01  REC-CT                        PIC 99       VALUE ZERO.
022800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
022900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
023000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
023100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
023200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
023300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
023400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
023500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
023600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
023700 01  CCVS-H-1.
023800     02  FILLER                    PIC X(39)    VALUE SPACES.
023900     02  FILLER                    PIC X(42)    VALUE
024000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024100     02  FILLER                    PIC X(39)    VALUE SPACES.
024200 01  CCVS-H-2A.
024300   02  FILLER                        PIC X(40)  VALUE SPACE.
024400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
024500   02  FILLER                        PIC XXXX   VALUE
024600     "4.2 ".
024700   02  FILLER                        PIC X(28)  VALUE
024800            " COPY - NOT FOR DISTRIBUTION".
024900   02  FILLER                        PIC X(41)  VALUE SPACE.
025000
025100 01  CCVS-H-2B.
025200   02  FILLER                        PIC X(15)  VALUE
025300            "TEST RESULT OF ".
025400   02  TEST-ID                       PIC X(9).
025500   02  FILLER                        PIC X(4)   VALUE
025600            " IN ".
025700   02  FILLER                        PIC X(12)  VALUE
025800     " HIGH       ".
025900   02  FILLER                        PIC X(22)  VALUE
026000            " LEVEL VALIDATION FOR ".
026100   02  FILLER                        PIC X(58)  VALUE
026200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026300 01  CCVS-H-3.
026400     02  FILLER                      PIC X(34)  VALUE
026500            " FOR OFFICIAL USE ONLY    ".
026600     02  FILLER                      PIC X(58)  VALUE
026700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026800     02  FILLER                      PIC X(28)  VALUE
026900            "  COPYRIGHT   1985 ".
027000 01  CCVS-E-1.
027100     02 FILLER                       PIC X(52)  VALUE SPACE.
027200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027300     02 ID-AGAIN                     PIC X(9).
027400     02 FILLER                       PIC X(45)  VALUE SPACES.
027500 01  CCVS-E-2.
027600     02  FILLER                      PIC X(31)  VALUE SPACE.
027700     02  FILLER                      PIC X(21)  VALUE SPACE.
027800     02 CCVS-E-2-2.
027900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
028000         03 FILLER                   PIC X      VALUE SPACE.
028100         03 ENDER-DESC               PIC X(44)  VALUE
028200            "ERRORS ENCOUNTERED".
028300 01  CCVS-E-3.
028400     02  FILLER                      PIC X(22)  VALUE
028500            " FOR OFFICIAL USE ONLY".
028600     02  FILLER                      PIC X(12)  VALUE SPACE.
028700     02  FILLER                      PIC X(58)  VALUE
028800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028900     02  FILLER                      PIC X(13)  VALUE SPACE.
029000     02 FILLER                       PIC X(15)  VALUE
029100             " COPYRIGHT 1985".
029200 01  CCVS-E-4.
029300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
029400     02 FILLER                       PIC X(4)   VALUE " OF ".
029500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
029600     02 FILLER                       PIC X(40)  VALUE
029700      "  TESTS WERE EXECUTED SUCCESSFULLY".
029800 01  XXINFO.
029900     02 FILLER                       PIC X(19)  VALUE
030000            "*** INFORMATION ***".
030100     02 INFO-TEXT.
030200       04 FILLER                     PIC X(8)   VALUE SPACE.
030300       04 XXCOMPUTED                 PIC X(20).
030400       04 FILLER                     PIC X(5)   VALUE SPACE.
030500       04 XXCORRECT                  PIC X(20).
030600     02 INF-ANSI-REFERENCE           PIC X(48).
030700 01  HYPHEN-LINE.
030800     02 FILLER  PIC IS X VALUE IS SPACE.
030900     02 FILLER  PIC IS X(65)    VALUE IS "************************
031000-    "*****************************************".
031100     02 FILLER  PIC IS X(54)    VALUE IS "************************
031200-    "******************************".
031300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
031400     "NC172A".
031500 PROCEDURE DIVISION.
031600 CCVS1 SECTION.
031700 OPEN-FILES.
031800     OPEN     OUTPUT PRINT-FILE.
031900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
032000     MOVE    SPACE TO TEST-RESULTS.
032100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
032200     GO TO CCVS1-EXIT.
032300 CLOSE-FILES.
032400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
032500 TERMINATE-CCVS.
032600S    EXIT PROGRAM.
032700STERMINATE-CALL.
032800     STOP     RUN.
032900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
033000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
033100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
033200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
033300     MOVE "****TEST DELETED****" TO RE-MARK.
033400 PRINT-DETAIL.
033500     IF REC-CT NOT EQUAL TO ZERO
033600             MOVE "." TO PARDOT-X
033700             MOVE REC-CT TO DOTVALUE.
033800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
033900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
034000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
034100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
034200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
034300     MOVE SPACE TO CORRECT-X.
034400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
034500     MOVE     SPACE TO RE-MARK.
034600 HEAD-ROUTINE.
034700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035100 COLUMN-NAMES-ROUTINE.
035200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
035500 END-ROUTINE.
035600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
035700 END-RTN-EXIT.
035800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035900 END-ROUTINE-1.
036000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
036100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
036200      ADD PASS-COUNTER TO ERROR-HOLD.
036300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
036400      MOVE PASS-COUNTER TO CCVS-E-4-1.
036500      MOVE ERROR-HOLD TO CCVS-E-4-2.
036600      MOVE CCVS-E-4 TO CCVS-E-2-2.
036700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
036800  END-ROUTINE-12.
036900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
037000     IF       ERROR-COUNTER IS EQUAL TO ZERO
037100         MOVE "NO " TO ERROR-TOTAL
037200         ELSE
037300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
037400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
037500     PERFORM WRITE-LINE.
037600 END-ROUTINE-13.
037700     IF DELETE-COUNTER IS EQUAL TO ZERO
037800         MOVE "NO " TO ERROR-TOTAL  ELSE
037900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
038000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
038100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038200      IF   INSPECT-COUNTER EQUAL TO ZERO
038300          MOVE "NO " TO ERROR-TOTAL
038400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
038500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038800 WRITE-LINE.
038900     ADD 1 TO RECORD-COUNT.
039000Y    IF RECORD-COUNT GREATER 42
039100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
039200Y        MOVE SPACE TO DUMMY-RECORD
039300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039400Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039500Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039600Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039700Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039800Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
039900Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
040000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
040100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
040200Y        MOVE ZERO TO RECORD-COUNT.
040300     PERFORM WRT-LN.
040400 WRT-LN.
040500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
040600     MOVE SPACE TO DUMMY-RECORD.
040700 BLANK-LINE-PRINT.
040800     PERFORM WRT-LN.
040900 FAIL-ROUTINE.
041000     IF     COMPUTED-X NOT EQUAL TO SPACE
041100            GO TO FAIL-ROUTINE-WRITE.
041200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
041300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041600     MOVE   SPACES TO INF-ANSI-REFERENCE.
041700     GO TO  FAIL-ROUTINE-EX.
041800 FAIL-ROUTINE-WRITE.
041900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
042000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
042100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
042200     MOVE   SPACES TO COR-ANSI-REFERENCE.
042300 FAIL-ROUTINE-EX. EXIT.
042400 BAIL-OUT.
042500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
042600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
042700 BAIL-OUT-WRITE.
042800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
042900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
043000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043100     MOVE   SPACES TO INF-ANSI-REFERENCE.
043200 BAIL-OUT-EX. EXIT.
043300 CCVS1-EXIT.
043400     EXIT.
043500 SECT-NC172A-001 SECTION.
043600 DIV-INIT-F2-1.
043700     MOVE   "DIVIDE INTO GIVING" TO FEATURE.
043800     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
043900     MOVE      44.1   TO DIV2.
044000     MOVE    ZERO     TO DIV8.
044100 DIV-TEST-F2-0.
044200     DIVIDE  DIV2 INTO 864.36 GIVING DIV8.
044300 DIV-TEST-F2-1.
044400     IF      DIV8 EQUAL TO 19.6
044500             PERFORM PASS
044600     ELSE
044700             GO TO DIV-FAIL-F2-1.
044800     GO TO   DIV-WRITE-F2-1.
044900 DIV-DELETE-F2-1.
045000     PERFORM  DE-LETE.
045100     GO TO    DIV-WRITE-F2-1.
045200 DIV-FAIL-F2-1.
045300     PERFORM  FAIL.
045400     MOVE     DIV8 TO COMPUTED-N.
045500     MOVE     +19.6 TO CORRECT-N.
045600 DIV-WRITE-F2-1.
045700     MOVE "DIV-TEST-F2-1 " TO PAR-NAME.
045800     PERFORM  PRINT-DETAIL.
045900 DIV-INIT-F2-2.
046000     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
046100     MOVE    1620.36  TO DIV1.
046200     MOVE    ZERO     TO DIV9.
046300 DIV-TEST-F2-2-0.
046400     DIVIDE   0.533 INTO DIV1 GIVING DIV9 ROUNDED.
046500 DIV-TEST-F2-2-1.
046600     IF       DIV9 EQUAL TO " 3,040.1"
046700              PERFORM PASS
046800              ELSE
046900              GO TO DIV-FAIL-F2-2.
047000     GO TO    DIV-WRITE-F2-2.
047100 DIV-DELETE-F2-2.
047200     PERFORM  DE-LETE.
047300     GO TO    DIV-WRITE-F2-2.
047400 DIV-FAIL-F2-2.
047500     PERFORM  FAIL.
047600     MOVE     DIV9 TO COMPUTED-A.
047700     MOVE " 3,040.1" TO CORRECT-A.
047800 DIV-WRITE-F2-2.
047900     MOVE "DIV-TEST-F2-2" TO PAR-NAME.
048000     PERFORM  PRINT-DETAIL.
048100 DIV-INIT-F2-3.
048200     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
048300     MOVE   -9.642    TO DIV4.
048400     MOVE   44.1      TO DIV2.
048500     MOVE    ZERO     TO DIV10.
048600     MOVE   "A"       TO XRAY.
048700 DIV-TEST-F2-3-0.
048800     DIVIDE   DIV4 INTO DIV2 GIVING DIV10 ON SIZE ERROR
048900              MOVE "P" TO XRAY.
049000 DIV-TEST-F2-3-1.
049100     IF       XRAY EQUAL TO "P"
049200              PERFORM PASS
049300              ELSE
049400              GO TO DIV-FAIL-F2-3-1.
049500     GO TO    DIV-WRITE-F2-3-1.
049600 DIV-DELETE-F2-3-1.
049700     PERFORM DE-LETE.
049800     GO TO   DIV-WRITE-F2-3-1.
049900 DIV-FAIL-F2-3-1.
050000     MOVE    XRAY  TO COMPUTED-X.
050100     MOVE   "A"    TO CORRECT-X.
050200     MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
050300     PERFORM FAIL.
050400 DIV-WRITE-F2-3-1.
050500     MOVE "DIV-TEST-F2-3-1" TO PAR-NAME.
050600     PERFORM PRINT-DETAIL.
050700 DIV-TEST-F2-3-2.
050800     IF      DIV10 NOT EQUAL TO ZERO
050900             GO TO DIV-FAIL-F2-3-2.
051000     PERFORM PASS.
051100     GO TO   DIV-WRITE-F2-3-2.
051200 DIV-DELETE-F2-3-2.
051300     PERFORM DE-LETE.
051400     GO TO   DIV-WRITE-F2-3-2.
051500 DIV-FAIL-F2-3-2.
051600     PERFORM FAIL.
051700     MOVE    DIV10 TO COMPUTED-N.
051800     MOVE    ZERO TO CORRECT-N.
051900     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
052000 DIV-WRITE-F2-3-2.
052100     MOVE "DIV-TEST-F2-3-2" TO PAR-NAME.
052200     PERFORM  PRINT-DETAIL.
052300 DIV-INIT-F2-4.
052400     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
052500     MOVE    ZERO TO DIV8.
052600     MOVE   "B" TO XRAY.
052700 DIV-TEST-F2-4-0.
052800     DIVIDE  1.0051 INTO 100.50 GIVING DIV8 ROUNDED
052900          ON SIZE ERROR
053000              MOVE "Q" TO XRAY.
053100 DIV-TEST-F2-4-1.
053200     IF       XRAY EQUAL TO "Q"
053300              PERFORM PASS
053400              ELSE
053500              GO TO DIV-FAIL-F2-4-1.
053600     GO TO    DIV-WRITE-F2-4-1.
053700 DIV-DELETE-F2-4-1.
053800     PERFORM  DE-LETE.
053900     GO TO    DIV-WRITE-F2-4-1.
054000 DIV-FAIL-F2-4-1.
054100     MOVE    XRAY TO COMPUTED-X.
054200     MOVE   "B"   TO COMPUTED-X.
054300     MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
054400     PERFORM FAIL.
054500 DIV-WRITE-F2-4-1.
054600     MOVE "DIV-TEST-F2-4-1" TO PAR-NAME.
054700     PERFORM PRINT-DETAIL.
054800 DIV-TEST-F2-4-2.
054900     IF      DIV8 NOT EQUAL TO ZERO
055000             GO TO DIV-FAIL-F2-4-2.
055100     PERFORM PASS.
055200     GO TO   DIV-WRITE-F2-4-2.
055300 DIV-DELETE-F2-4-2.
055400     PERFORM DE-LETE.
055500     GO TO   DIV-WRITE-F2-4-2.
055600 DIV-FAIL-F2-4-2.
055700     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
055800     PERFORM FAIL.
055900     MOVE    DIV8 TO COMPUTED-N.
056000     MOVE     000 TO CORRECT-N.
056100 DIV-WRITE-F2-4-2.
056200     MOVE   "DIV-TEST-F2-4-2" TO PAR-NAME.
056300     PERFORM PRINT-DETAIL.
056400 DIV-INIT-F2-5.
056500     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
056600     MOVE    ZERO TO WRK-DS-01V00.
056700 DIV-TEST-F2-5-0.
056800     DIVIDE -10.9 INTO A02TWOS-DU-02V00 GIVING WRK-DS-01V00.
056900 DIV-TEST-F2-5-1.
057000     IF      WRK-DS-01V00 EQUAL TO -2
057100             PERFORM PASS
057200             GO TO DIV-WRITE-F2-5.
057300     GO TO   DIV-FAIL-F2-5.
057400 DIV-DELETE-F2-5.
057500     PERFORM DE-LETE.
057600     GO TO   DIV-WRITE-F2-5.
057700 DIV-FAIL-F2-5.
057800     MOVE  -2                 TO CORRECT-N.
057900     MOVE  WRK-DS-01V00       TO COMPUTED-N.
058000     PERFORM FAIL.
058100 DIV-WRITE-F2-5.
058200     MOVE "DIV-TEST-F2-5         " TO PAR-NAME.
058300     PERFORM PRINT-DETAIL.
058400 DIV-INIT-F2-6.
058500     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
058600     MOVE 0.0000000001 TO WRK-DS-03V10.
058700     MOVE ZERO TO WRK-DS-18V00.
058800 DIV-TEST-F2-6-0.
058900     DIVIDE WRK-DS-03V10 INTO A01ONE-DS-P0801
059000         GIVING WRK-DS-18V00 ROUNDED.
059100 DIV-TEST-F2-6-1.
059200     IF WRK-DS-18V00 EQUAL TO 000000000000000010
059300         PERFORM PASS
059400         GO TO DIV-WRITE-F2-6.
059500     GO TO DIV-FAIL-F2-6.
059600 DIV-DELETE-F2-6.
059700     PERFORM DE-LETE.
059800     GO TO DIV-WRITE-F2-6.
059900 DIV-FAIL-F2-6.
060000     MOVE  000000000000000010 TO CORRECT-18V0.
060100     MOVE  WRK-DS-18V00       TO COMPUTED-18V0.
060200     PERFORM FAIL.
060300 DIV-WRITE-F2-6.
060400     MOVE "DIV-TEST-F2-6         " TO PAR-NAME.
060500     PERFORM PRINT-DETAIL.
060600 DIV-INIT-F2-7.
060700     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
060800     MOVE ZERO TO WRK-DS-18V00  AZERO-DS-05V05.
060900     MOVE "0" TO WRK-XN-00001.
061000     MOVE  99 TO A99-DS-02V00.
061100 DIV-TEST-F2-7-0.
061200     DIVIDE AZERO-DS-05V05 INTO A99-DS-02V00
061300         GIVING WRK-DS-18V00 ON SIZE ERROR
061400         MOVE "1" TO WRK-XN-00001.
061500 DIV-TEST-F2-7-1.
061600     IF WRK-DS-18V00 EQUAL TO 000000000000000000
061700         PERFORM PASS
061800         GO TO DIV-WRITE-F2-7-1.
061900     GO TO DIV-FAIL-F2-7-1.
062000 DIV-DELETE-F2-7-1.
062100     PERFORM DE-LETE.
062200     GO TO DIV-WRITE-F2-7-1.
062300 DIV-FAIL-F2-7-1.
062400     MOVE  000000000000000000 TO CORRECT-18V0.
062500     MOVE  WRK-DS-18V00       TO COMPUTED-18V0.
062600     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
062700     PERFORM FAIL.
062800 DIV-WRITE-F2-7-1.
062900     MOVE "DIV-TEST-F2-7-1         " TO PAR-NAME.
063000     PERFORM PRINT-DETAIL.
063100 DIV-TEST-F2-7-2.
063200     IF WRK-XN-00001 EQUAL TO "1"
063300         PERFORM PASS
063400         GO TO DIV-WRITE-F2-7-2.
063500     MOVE "1" TO CORRECT-A.
063600     MOVE WRK-XN-00001 TO COMPUTED-A.
063700     MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
063800     PERFORM FAIL.
063900     GO TO DIV-WRITE-F2-7-2.
064000 DIV-DELETE-F2-7-2.
064100     PERFORM DE-LETE.
064200 DIV-WRITE-F2-7-2.
064300     MOVE "DIV-TEST-F2-7-2         " TO PAR-NAME.
064400     PERFORM PRINT-DETAIL.
064500 DIV-INIT-F2-8.
064600     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
064700     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
064800     MOVE   "1" TO WRK-XN-00001.
064900 DIV-TEST-F2-8-0.
065000     DIVIDE  A18ONES-DS-09V09 INTO WRK-DS-09V09 GIVING
065100         WRK-DS-09V09 ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
065200 DIV-TEST-F2-8-1.
065300     IF WRK-DS-18V00-S EQUAL TO 000000001000000000
065400         PERFORM PASS
065500         GO TO DIV-WRITE-F2-8-1.
065600     GO TO DIV-FAIL-F2-8-1.
065700 DIV-DELETE-F2-8-1.
065800     PERFORM DE-LETE.
065900     GO TO DIV-WRITE-F2-8-1.
066000 DIV-FAIL-F2-8-1.
066100     MOVE  000000001000000000 TO CORRECT-18V0.
066200     MOVE WRK-DS-18V00-S TO COMPUTED-18V0.
066300     PERFORM FAIL.
066400 DIV-WRITE-F2-8-1.
066500     MOVE "DIV-TEST-F2-8-1         " TO PAR-NAME.
066600     PERFORM PRINT-DETAIL.
066700 DIV-TEST-F2-8-2.
066800     IF WRK-XN-00001 EQUAL TO "0"
066900         MOVE "0" TO COMPUTED-A
067000         MOVE "1" TO CORRECT-A
067100         MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
067200         PERFORM FAIL
067300         GO TO DIV-WRITE-F2-8-2.
067400     PERFORM PASS.
067500     GO TO DIV-WRITE-F2-8-2.
067600 DIV-DELETE-F2-8-2.
067700     PERFORM DE-LETE.
067800 DIV-WRITE-F2-8-2.
067900     MOVE "DIV-TEST-F2-8-2         " TO PAR-NAME.
068000     PERFORM PRINT-DETAIL.
068100 DIV-INIT-F2-9.
068200     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
068300     MOVE ZERO TO WRK-DS-0201P.
068400     MOVE -0.005 TO WRK-DS-09V09.
068500     MOVE "0" TO WRK-XN-00001.
068600 DIV-TEST-F2-9-0.
068700     DIVIDE WRK-DS-09V09 INTO A05ONES-DS-00V05 GIVING
068800         WRK-DS-0201P ROUNDED ON SIZE ERROR
068900         MOVE "1" TO WRK-XN-00001.
069000 DIV-TEST-F2-9-1.
069100     MOVE WRK-DS-0201P TO WRK-DS-05V00.
069200     IF WRK-DS-05V00 EQUAL TO  -00020
069300         PERFORM PASS
069400         GO TO DIV-WRITE-F2-9-1.
069500     GO TO DIV-FAIL-F2-9-1.
069600 DIV-DELETE-F2-9-1.
069700     PERFORM DE-LETE.
069800     GO TO DIV-WRITE-F2-9-1.
069900 DIV-FAIL-F2-9-1.
070000     MOVE -00020 TO CORRECT-N.
070100     MOVE WRK-DS-05V00 TO COMPUTED-N.
070200     PERFORM FAIL.
070300 DIV-WRITE-F2-9-1.
070400     MOVE "DIV-TEST-F2-9-1         " TO PAR-NAME.
070500     PERFORM PRINT-DETAIL.
070600 DIV-TEST-F2-9-2.
070700     IF WRK-XN-00001 EQUAL TO "0"
070800         PERFORM PASS
070900         GO TO DIV-WRITE-F2-9-2.
071000     MOVE "0" TO CORRECT-A.
071100     MOVE WRK-XN-00001 TO COMPUTED-A.
071200     MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
071300     PERFORM FAIL.
071400     GO TO DIV-WRITE-F2-9-2.
071500 DIV-DELETE-F2-9-2.
071600     PERFORM DE-LETE.
071700 DIV-WRITE-F2-9-2.
071800     MOVE "DIV-TEST-F2-9-2         " TO PAR-NAME.
071900     PERFORM PRINT-DETAIL.
072000 DIV-INIT-F2-10.
072100     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
072200     MOVE "1" TO WRK-XN-00001.
072300     MOVE ZERO TO WRK-DS-01V00.
072400 DIV-TEST-F2-10-1.
072500     DIVIDE A02TWOS-DU-02V00 INTO A02TWOS-DS-03V02  GIVING
072600         WRK-DS-01V00 ROUNDED ON SIZE ERROR
072700         MOVE "0" TO WRK-XN-00001.
072800     IF WRK-DS-01V00 EQUAL TO +1
072900         PERFORM PASS
073000         GO TO DIV-WRITE-F2-10-1.
073100     GO TO DIV-FAIL-F2-10-1.
073200 DIV-DELETE-F2-10-1.
073300     PERFORM DE-LETE.
073400     GO TO DIV-WRITE-F2-10-1.
073500 DIV-FAIL-F2-10-1.
073600     MOVE  +1                 TO CORRECT-N.
073700     MOVE  WRK-DS-01V00       TO COMPUTED-N.
073800     PERFORM FAIL.
073900 DIV-WRITE-F2-10-1.
074000     MOVE "DIV-TEST-F2-10-1         " TO PAR-NAME.
074100     PERFORM PRINT-DETAIL.
074200 DIV-TEST-F2-10-2.
074300     IF WRK-XN-00001 EQUAL TO "1"
074400         PERFORM PASS
074500         GO TO DIV-WRITE-F2-10-2.
074600     MOVE "1" TO CORRECT-A.
074700     MOVE WRK-XN-00001 TO COMPUTED-A.
074800     MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
074900     PERFORM FAIL.
075000     GO TO DIV-WRITE-F2-10-2.
075100 DIV-DELETE-F2-10-2.
075200     PERFORM DE-LETE.
075300 DIV-WRITE-F2-10-2.
075400     MOVE "DIV-TEST-F2-10-2         " TO PAR-NAME.
075500     PERFORM PRINT-DETAIL.
075600 DIV-INIT-F2-11.
075700     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
075800     MOVE     0 TO WRK-DS-05V00.
075900 DIV-TEST-F2-11.
076000     DIVIDE A01ONE-CS-00V01 INTO A99-CS-02V00 GIVING
076100         WRK-DS-05V00.
076200     IF WRK-DS-05V00 EQUAL TO 00990
076300        PERFORM PASS
076400         GO TO DIV-WRITE-F2-11.
076500     GO TO DIV-FAIL-F2-11.
076600 DIV-DELETE-F2-11.
076700     PERFORM DE-LETE.
076800     GO TO DIV-WRITE-F2-11.
076900 DIV-FAIL-F2-11.
077000     MOVE  00990              TO CORRECT-N.
077100     MOVE  WRK-DS-05V00       TO COMPUTED-N.
077200     PERFORM FAIL.
077300 DIV-WRITE-F2-11.
077400     MOVE "DIVIDE INTO GIVING  " TO FEATURE.
077500     MOVE "DIV-TEST-F2-11         " TO PAR-NAME.
077600     PERFORM PRINT-DETAIL.
077700 DIV-INIT-F2-12.
077800     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
077900     MOVE  ZERO TO WRK-CS-18V00.
078000 DIV-TEST-F2-12-0.
078100     DIVIDE A02THREES-CS-18V00 INTO A18SIXES-CU-18V00 GIVING
078200             WRK-CS-18V00.
078300 DIV-TEST-F2-12-1.
078400     IF WRK-CS-18V00 EQUAL TO -020202020202020202
078500         PERFORM PASS
078600         GO TO DIV-WRITE-F2-12.
078700     MOVE -020202020202020202 TO CORRECT-18V0.
078800     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
078900     PERFORM FAIL.
079000     GO TO DIV-WRITE-F2-12.
079100 DIV-DELETE-F2-12.
079200     PERFORM DE-LETE.
079300 DIV-WRITE-F2-12.
079400     MOVE "DIV-TEST-F2-12 " TO PAR-NAME.
079500     PERFORM PRINT-DETAIL.
079600 DIV-INIT-F2-13.
079700     MOVE   "V1-81 6.11.4 GR2"   TO ANSI-REFERENCE.
079800     MOVE ZERO TO WRK-CS-18V00.
079900 DIV-TEST-F2-13.
080000     DIVIDE A02THREES-CS-18V00 INTO A02THREES-CS-18V00
080100             GIVING WRK-CS-18V00.
080200     IF WRK-CS-18V00 EQUAL TO 000000000000000001
080300         PERFORM PASS
080400         GO TO DIV-WRITE-F2-13.
080500     MOVE 000000000000000001 TO CORRECT-18V0.
080600     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
080700     PERFORM FAIL.
080800     GO TO DIV-WRITE-F2-13.
080900 DIV-DELETE-F2-13.
081000     PERFORM DE-LETE.
081100 DIV-WRITE-F2-13.
081200     MOVE "DIV-TEST-F2-13 " TO PAR-NAME.
081300     PERFORM PRINT-DETAIL.
081400*
081500*
081600 DIV-INIT-F2-14.
081700*            ==-->    SIZE ERROR CONDITION <--==
081800*            ==-->    NEW SIZE ERROR TESTS <--==
081900     MOVE   "V1-67 6.4.2"      TO ANSI-REFERENCE.
082000     MOVE   "DIV-TEST-F2-14-1" TO PAR-NAME.
082100     MOVE   "P"     TO XRAY.
082200     MOVE    0      TO DIV10.
082300     MOVE    1      TO REC-CT.
082400     MOVE    44.1   TO DIV2.
082500     MOVE   -9.642  TO DIV4.
082600 DIV-TEST-F2-14-0.
082700     DIVIDE  DIV4 INTO DIV2
082800      GIVING DIV10
082900      NOT ON SIZE ERROR
083000             MOVE   "N" TO XRAY.
083100     GO TO   DIV-TEST-F2-14-1.
083200 DIV-DELETE-F2-14-1.
083300     PERFORM DE-LETE.
083400     PERFORM PRINT-DETAIL.
083500     GO TO   DIV-INIT-F2-15.
083600 DIV-TEST-F2-14-1.
083700     MOVE   "DIV-TEST-F2-14-1" TO PAR-NAME.
083800     IF      DIV10 NOT = 0
083900             MOVE    DIV10 TO COMPUTED-N
084000             MOVE    0 TO CORRECT-N
084100             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
084200             PERFORM FAIL
084300             PERFORM PRINT-DETAIL
084400     ELSE
084500             PERFORM PASS
084600             PERFORM PRINT-DETAIL.
084700     ADD     1 TO REC-CT.
084800 DIV-TEST-F2-14-2.
084900     MOVE   "DIV-TEST-F2-14-2" TO PAR-NAME.
085000     IF      XRAY  NOT = "P"
085100             MOVE    XRAY  TO COMPUTED-X
085200             MOVE   "P"    TO CORRECT-X
085300             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
085400             PERFORM FAIL
085500             PERFORM PRINT-DETAIL
085600     ELSE
085700             PERFORM PASS
085800             PERFORM PRINT-DETAIL.
085900*
086000*
086100 DIV-INIT-F2-15.
086200*            ==--> NO SIZE ERROR CONDITION <--==
086300*            ==-->    NEW SIZE ERROR TESTS <--==
086400     MOVE   "DIV-TEST-F2-15-1" TO PAR-NAME.
086500     MOVE   "V1-67 6.4.2"      TO ANSI-REFERENCE.
086600     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
086700     MOVE    1  TO REC-CT.
086800     MOVE   "1" TO WRK-XN-00001.
086900 DIV-TEST-F2-15-0.
087000     DIVIDE  A18ONES-DS-09V09 INTO WRK-DS-09V09
087100      GIVING WRK-DS-09V09
087200      NOT ON SIZE ERROR
087300             MOVE   "0" TO WRK-XN-00001.
087400     GO TO   DIV-TEST-F2-15-1.
087500 DIV-DELETE-F2-15-1.
087600     PERFORM DE-LETE.
087700     PERFORM PRINT-DETAIL.
087800     GO TO   DIV-INIT-F2-16.
087900 DIV-TEST-F2-15-1.
088000     MOVE   "DIV-TEST-F2-15-1 " TO PAR-NAME.
088100     IF      WRK-DS-18V00-S NOT = 000000001000000000
088200             MOVE    000000001000000000 TO CORRECT-18V0
088300             MOVE    WRK-DS-18V00-S     TO COMPUTED-18V0
088400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
088500                  TO RE-MARK
088600             PERFORM FAIL
088700             PERFORM PRINT-DETAIL
088800     ELSE
088900             PERFORM PASS
089000             PERFORM PRINT-DETAIL.
089100     ADD     1 TO REC-CT.
089200 DIV-TEST-F2-15-2.
089300     MOVE   "DIV-TEST-F2-15-2" TO PAR-NAME.
089400     IF      WRK-XN-00001 NOT = "0"
089500             MOVE   "0"           TO CORRECT-X
089600             MOVE    WRK-XN-00001 TO COMPUTED-X
089700             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
089800                  TO RE-MARK
089900             PERFORM FAIL
090000             PERFORM PRINT-DETAIL
090100     ELSE
090200             PERFORM PASS
090300             PERFORM PRINT-DETAIL.
090400*
090500*
090600 DIV-INIT-F2-16.
090700*            ==-->    SIZE ERROR CONDITION <--==
090800*            ==-->    NEW SIZE ERROR TESTS <--==
090900     MOVE   "DIV-TEST-F2-16-1" TO PAR-NAME.
091000     MOVE   "V1-67 6.4.2"      TO ANSI-REFERENCE.
091100     MOVE   "P"     TO XRAY.
091200     MOVE    0      TO DIV10.
091300     MOVE    1      TO REC-CT.
091400     MOVE    44.1   TO DIV2.
091500     MOVE   -9.642  TO DIV4.
091600 DIV-TEST-F2-16-0.
091700     DIVIDE  DIV4 INTO DIV2
091800      GIVING DIV10
091900          ON SIZE ERROR
092000             MOVE   "E" TO XRAY
092100      NOT ON SIZE ERROR
092200             MOVE   "N" TO XRAY.
092300     GO TO   DIV-TEST-F2-16-1.
092400 DIV-DELETE-F2-16-1.
092500     PERFORM DE-LETE.
092600     PERFORM PRINT-DETAIL.
092700     GO TO   DIV-INIT-F2-17.
092800 DIV-TEST-F2-16-1.
092900     MOVE   "DIV-TEST-F2-16-1" TO PAR-NAME.
093000     IF      DIV10 NOT = 0
093100             MOVE    DIV10 TO COMPUTED-N
093200             MOVE    0 TO CORRECT-N
093300             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
093400             PERFORM FAIL
093500             PERFORM PRINT-DETAIL
093600     ELSE
093700             PERFORM PASS
093800             PERFORM PRINT-DETAIL.
093900     ADD     1 TO REC-CT.
094000 DIV-TEST-F2-16-2.
094100     MOVE   "DIV-TEST-F2-16-2" TO PAR-NAME.
094200     IF      XRAY  NOT = "E"
094300             MOVE    XRAY  TO COMPUTED-X
094400             MOVE   "E"    TO CORRECT-X
094500             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
094600             PERFORM FAIL
094700             PERFORM PRINT-DETAIL
094800     ELSE
094900             PERFORM PASS
095000             PERFORM PRINT-DETAIL.
095100*
095200*
095300 DIV-INIT-F2-17.
095400*            ==--> NO SIZE ERROR CONDITION <--==
095500*            ==-->    NEW SIZE ERROR TESTS <--==
095600     MOVE   "DIV-TEST-F2-17-1" TO PAR-NAME.
095700     MOVE   "V1-67 6.4.2"      TO ANSI-REFERENCE.
095800     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
095900     MOVE   "0" TO WRK-XN-00001.
096000     MOVE    1      TO REC-CT.
096100 DIV-TEST-F2-17-0.
096200     DIVIDE  A18ONES-DS-09V09 INTO WRK-DS-09V09
096300      GIVING WRK-DS-09V09
096400          ON SIZE ERROR
096500             MOVE   "1" TO WRK-XN-00001
096600      NOT ON SIZE ERROR
096700             MOVE   "2" TO WRK-XN-00001.
096800     GO TO   DIV-TEST-F2-17-1.
096900 DIV-DELETE-F2-17-1.
097000     PERFORM DE-LETE.
097100     PERFORM PRINT-DETAIL.
097200     GO TO   DIV-INIT-F2-18.
097300 DIV-TEST-F2-17-1.
097400     MOVE   "DIV-TEST-F2-17-1" TO PAR-NAME.
097500     IF      WRK-DS-18V00-S NOT = 000000001000000000
097600             MOVE    000000001000000000 TO CORRECT-18V0
097700             MOVE    WRK-DS-18V00-S     TO COMPUTED-18V0
097800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
097900                  TO RE-MARK
098000             PERFORM FAIL
098100             PERFORM PRINT-DETAIL
098200     ELSE
098300             PERFORM PASS
098400             PERFORM PRINT-DETAIL.
098500     ADD     1 TO REC-CT.
098600 DIV-TEST-F2-17-2.
098700     MOVE   "DIV-TEST-F2-17-2" TO PAR-NAME.
098800     IF      WRK-XN-00001 NOT = "2"
098900             MOVE   "2"           TO CORRECT-X
099000             MOVE    WRK-XN-00001 TO COMPUTED-X
099100             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
099200                  TO RE-MARK
099300             PERFORM FAIL
099400             PERFORM PRINT-DETAIL
099500     ELSE
099600             PERFORM PASS
099700             PERFORM PRINT-DETAIL.
099800*
099900*
100000 DIV-INIT-F2-18.
100100     MOVE "DIVIDE-INTO-GIVING" TO FEATURE.
100200*            ==--> NO SIZE ERROR CONDITION <--==
100300*            ==-->  MULTIPLE RESULT FIELDS <--==
100400     MOVE   "DIV-TEST-F2-18" TO PAR-NAME.
100500     MOVE   "V1-81 6.11.4 GR2" TO ANSI-REFERENCE.
100600     MOVE    1 TO REC-CT.
100700     MOVE   10 TO WRK-DU-2V0-1.
100800     MOVE  3.9 TO WRK-DU-1V1-2.
100900     MOVE    0 TO WRK-DU-2V1-1.
101000     MOVE    0 TO WRK-DU-2V1-2.
101100     MOVE    0 TO WRK-DU-2V0-2.
101200     MOVE    0 TO WRK-DU-2V1-3.
101300     MOVE    0 TO WRK-DU-2V0-3.
101400 DIV-TEST-F2-18-0.
101500     DIVIDE  WRK-DU-1V1-2 INTO WRK-DU-2V0-1
101600      GIVING WRK-DU-2V1-1
101700             WRK-DU-2V0-1 ROUNDED
101800             WRK-DU-2V1-2
101900             WRK-DU-2V0-2 ROUNDED
102000             WRK-DU-2V1-3
102100             WRK-DU-2V0-3.
102200     GO TO   DIV-TEST-F2-18-1.
102300 DIV-DELETE-F2-18.
102400     PERFORM DE-LETE.
102500     PERFORM PRINT-DETAIL.
102600     GO TO   DIV-INIT-F2-19.
102700 DIV-TEST-F2-18-1.
102800     IF      WRK-DU-2V1-1 = 2.5
102900             PERFORM PASS
103000             PERFORM PRINT-DETAIL
103100     ELSE
103200             PERFORM FAIL
103300             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
103400             MOVE    2.5          TO CORRECT-N
103500             PERFORM PRINT-DETAIL.
103600     ADD 1 TO REC-CT.
103700 DIV-TEST-F2-18-2.
103800     IF      WRK-DU-2V0-1 = 3
103900             PERFORM PASS
104000             PERFORM PRINT-DETAIL
104100     ELSE
104200             PERFORM FAIL
104300             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
104400             MOVE    3            TO CORRECT-N
104500             PERFORM PRINT-DETAIL.
104600     ADD 1 TO REC-CT.
104700 DIV-TEST-F2-18-3.
104800     IF      WRK-DU-2V1-2 = 2.5
104900             PERFORM PASS
105000             PERFORM PRINT-DETAIL
105100     ELSE
105200             PERFORM FAIL
105300             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
105400             MOVE    2.5          TO CORRECT-N
105500             PERFORM PRINT-DETAIL.
105600     ADD 1 TO REC-CT.
105700 DIV-TEST-F2-18-4.
105800     IF      WRK-DU-2V0-2 = 3
105900             PERFORM PASS
106000             PERFORM PRINT-DETAIL
106100     ELSE
106200             PERFORM FAIL
106300             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
106400             MOVE    3            TO CORRECT-N
106500             PERFORM PRINT-DETAIL.
106600     ADD 1 TO REC-CT.
106700 DIV-TEST-F2-18-5.
106800     IF      WRK-DU-2V1-3 = 2.5
106900             PERFORM PASS
107000             PERFORM PRINT-DETAIL
107100     ELSE
107200             PERFORM FAIL
107300             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
107400             MOVE    2.5          TO CORRECT-N
107500             PERFORM PRINT-DETAIL.
107600     ADD 1 TO REC-CT.
107700 DIV-TEST-F2-18-6.
107800     IF      WRK-DU-2V0-3 = 2
107900             PERFORM PASS
108000             PERFORM PRINT-DETAIL
108100     ELSE
108200             PERFORM FAIL
108300             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
108400             MOVE    2            TO CORRECT-N
108500             PERFORM PRINT-DETAIL.
108600*
108700*
108800 DIV-INIT-F2-19.
108900*            ==-->    SIZE ERROR CONDITION <--==
109000*            ==-->    NEW SIZE ERROR TESTS <--==
109100     MOVE   "DIV-TEST-F2-19" TO PAR-NAME.
109200     MOVE   "V1-67 6.4.2"      TO ANSI-REFERENCE.
109300     MOVE   "0"  TO WRK-XN-00001.
109400     MOVE    0   TO WRK-DU-2V1-1.
109500     MOVE    0   TO WRK-DU-2V0-1.
109600     MOVE    0   TO WRK-DU-2V1-2.
109700     MOVE    0   TO WRK-DU-2V0-2.
109800     MOVE    0   TO WRK-DU-2V1-3.
109900     MOVE    0   TO WRK-DU-2V0-3.
110000     MOVE    1   TO REC-CT.
110100     MOVE    99  TO WRK-DU-2V0-1.
110200     MOVE    .1  TO A01ONE-CS-00V01.
110300 DIV-TEST-F2-19-0.
110400     DIVIDE  A01ONE-CS-00V01 INTO WRK-DU-2V0-1
110500      GIVING WRK-DU-2V1-1
110600             WRK-DU-2V0-1 ROUNDED
110700             WRK-DU-2V1-2
110800             WRK-DU-2V0-2 ROUNDED
110900             WRK-DU-2V1-3
111000             WRK-DU-2V0-3
111100          ON SIZE ERROR
111200             MOVE  "1" TO WRK-XN-00001.
111300     GO TO DIV-TEST-F2-19-1.
111400 DIV-DELETE-F2-19.
111500     PERFORM DE-LETE.
111600     PERFORM PRINT-DETAIL.
111700     GO TO   DIV-INIT-F2-20.
111800 DIV-TEST-F2-19-1.
111900     IF      WRK-DU-2V1-1 = 0
112000             PERFORM PASS
112100             PERFORM PRINT-DETAIL
112200     ELSE
112300             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
112400             PERFORM FAIL
112500             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
112600             MOVE    0            TO CORRECT-N
112700             PERFORM PRINT-DETAIL.
112800     ADD 1 TO REC-CT.
112900 DIV-TEST-F2-19-2.
113000     IF      WRK-DU-2V0-1 = 99
113100             PERFORM PASS
113200             PERFORM PRINT-DETAIL
113300     ELSE
113400             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
113500             PERFORM FAIL
113600             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
113700             MOVE    99           TO CORRECT-N
113800             PERFORM PRINT-DETAIL.
113900     ADD 1 TO REC-CT.
114000 DIV-TEST-F2-19-3.
114100     IF      WRK-DU-2V1-2 = 0
114200             PERFORM PASS
114300             PERFORM PRINT-DETAIL
114400     ELSE
114500             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
114600             PERFORM FAIL
114700             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
114800             MOVE    0            TO CORRECT-N
114900             PERFORM PRINT-DETAIL.
115000     ADD 1 TO REC-CT.
115100 DIV-TEST-F2-19-4.
115200     IF      WRK-DU-2V0-2 = 0
115300             PERFORM PASS
115400             PERFORM PRINT-DETAIL
115500     ELSE
115600             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
115700             PERFORM FAIL
115800             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
115900             MOVE    0            TO CORRECT-N
116000             PERFORM PRINT-DETAIL.
116100     ADD 1 TO REC-CT.
116200 DIV-TEST-F2-19-5.
116300     IF      WRK-DU-2V1-3 = 0
116400             PERFORM PASS
116500             PERFORM PRINT-DETAIL
116600     ELSE
116700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
116800             PERFORM FAIL
116900             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
117000             MOVE    0            TO CORRECT-N
117100             PERFORM PRINT-DETAIL.
117200     ADD 1 TO REC-CT.
117300 DIV-TEST-F2-19-6.
117400     IF      WRK-DU-2V0-3 = 0
117500             PERFORM PASS
117600             PERFORM PRINT-DETAIL
117700     ELSE
117800             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
117900             PERFORM FAIL
118000             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
118100             MOVE    0            TO CORRECT-N
118200             PERFORM PRINT-DETAIL.
118300     ADD 1 TO REC-CT.
118400 DIV-TEST-F2-19-7.
118500     IF      WRK-XN-00001 = "1"
118600             PERFORM PASS
118700             PERFORM PRINT-DETAIL
118800     ELSE
118900             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
119000             PERFORM FAIL
119100             MOVE    WRK-XN-00001 TO COMPUTED-X
119200             MOVE   "1"           TO CORRECT-X
119300             PERFORM PRINT-DETAIL.
119400*
119500*
119600 DIV-INIT-F2-20.
119700*            ==--> NO SIZE ERROR CONDITION <--==
119800*            ==-->  NEW SIZE ERROR TESTS   <--==
119900     MOVE   "DIV-TEST-F2-20" TO PAR-NAME.
120000     MOVE   "V1-67 6.4.2"      TO ANSI-REFERENCE.
120100     MOVE   "0"  TO WRK-XN-00001.
120200     MOVE    0   TO WRK-DU-2V1-1.
120300     MOVE    0   TO WRK-DU-2V0-1.
120400     MOVE    0   TO WRK-DU-2V1-2.
120500     MOVE    0   TO WRK-DU-2V0-2.
120600     MOVE    0   TO WRK-DU-2V1-3.
120700     MOVE    0   TO WRK-DU-2V0-3.
120800     MOVE    10  TO WRK-DU-2V0-1.
120900     MOVE    3.9 TO WRK-DU-1V1-2.
121000     MOVE    1   TO REC-CT.
121100 DIV-TEST-F2-20-0.
121200     DIVIDE  WRK-DU-1V1-2 INTO WRK-DU-2V0-1
121300      GIVING WRK-DU-2V1-1
121400             WRK-DU-2V0-1 ROUNDED
121500             WRK-DU-2V1-2
121600             WRK-DU-2V0-2 ROUNDED
121700             WRK-DU-2V1-3
121800             WRK-DU-2V0-3
121900          ON SIZE ERROR
122000             MOVE   "1" TO WRK-XN-00001.
122100     GO TO DIV-TEST-F2-20-1.
122200 DIV-DELETE-F2-20.
122300     PERFORM DE-LETE.
122400     PERFORM PRINT-DETAIL.
122500     GO TO   DIV-INIT-F2-21.
122600 DIV-TEST-F2-20-1.
122700     IF      WRK-DU-2V1-1 = 2.5
122800             PERFORM PASS
122900             PERFORM PRINT-DETAIL
123000     ELSE
123100             PERFORM FAIL
123200             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
123300             MOVE    2.5          TO CORRECT-N
123400             PERFORM PRINT-DETAIL.
123500     ADD 1 TO REC-CT.
123600 DIV-TEST-F2-20-2.
123700     IF      WRK-DU-2V0-1 = 3
123800             PERFORM PASS
123900             PERFORM PRINT-DETAIL
124000     ELSE
124100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
124200             PERFORM FAIL
124300             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
124400             MOVE    3            TO CORRECT-N
124500             PERFORM PRINT-DETAIL.
124600     ADD 1 TO REC-CT.
124700 DIV-TEST-F2-20-3.
124800     IF      WRK-DU-2V1-2 = 2.5
124900             PERFORM PASS
125000             PERFORM PRINT-DETAIL
125100     ELSE
125200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
125300             PERFORM FAIL
125400             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
125500             MOVE    2.5          TO CORRECT-N
125600             PERFORM PRINT-DETAIL.
125700     ADD 1 TO REC-CT.
125800 DIV-TEST-F2-20-4.
125900     IF      WRK-DU-2V0-2 = 3
126000             PERFORM PASS
126100             PERFORM PRINT-DETAIL
126200     ELSE
126300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
126400             PERFORM FAIL
126500             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
126600             MOVE    3            TO CORRECT-N
126700             PERFORM PRINT-DETAIL.
126800     ADD 1 TO REC-CT.
126900 DIV-TEST-F2-20-5.
127000     IF      WRK-DU-2V1-3 = 2.5
127100             PERFORM PASS
127200             PERFORM PRINT-DETAIL
127300     ELSE
127400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
127500             PERFORM FAIL
127600             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
127700             MOVE    2.5          TO CORRECT-N
127800             PERFORM PRINT-DETAIL.
127900     ADD 1 TO REC-CT.
128000 DIV-TEST-F2-20-6.
128100     IF      WRK-DU-2V0-3 = 2
128200             PERFORM PASS
128300             PERFORM PRINT-DETAIL
128400     ELSE
128500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
128600             PERFORM FAIL
128700             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
128800             MOVE    2            TO CORRECT-N
128900             PERFORM PRINT-DETAIL.
129000     ADD 1 TO REC-CT.
129100 DIV-TEST-F2-20-7.
129200     IF      WRK-XN-00001 = "0"
129300             PERFORM PASS
129400             PERFORM PRINT-DETAIL
129500     ELSE
129600             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
129700                  TO RE-MARK
129800             PERFORM FAIL
129900             MOVE    WRK-XN-00001 TO COMPUTED-X
130000             MOVE   "0"           TO CORRECT-X
130100             PERFORM PRINT-DETAIL.
130200*
130300*
130400 DIV-INIT-F2-21.
130500*            ==-->    SIZE ERROR CONDITION <--==
130600*            ==-->    NEW SIZE ERROR TESTS <--==
130700     MOVE   "DIV-TEST-F2-21" TO PAR-NAME.
130800     MOVE   "V1-67 6.4.2"      TO ANSI-REFERENCE.
130900     MOVE   "0"  TO WRK-XN-00001.
131000     MOVE    0   TO WRK-DU-2V1-1.
131100     MOVE    0   TO WRK-DU-2V1-2.
131200     MOVE    0   TO WRK-DU-2V0-2.
131300     MOVE    0   TO WRK-DU-2V1-3.
131400     MOVE    0   TO WRK-DU-2V0-3.
131500     MOVE    99  TO WRK-DU-2V0-1.
131600     MOVE    1   TO REC-CT.
131700 DIV-TEST-F2-21-0.
131800     DIVIDE  A01ONE-CS-00V01 INTO WRK-DU-2V0-1
131900      GIVING WRK-DU-2V1-1
132000             WRK-DU-2V0-1 ROUNDED
132100             WRK-DU-2V1-2
132200             WRK-DU-2V0-2 ROUNDED
132300             WRK-DU-2V1-3
132400             WRK-DU-2V0-3
132500      NOT ON SIZE ERROR
132600             MOVE  "1" TO WRK-XN-00001.
132700     GO TO DIV-TEST-F2-21-1.
132800 DIV-DELETE-F2-21.
132900     PERFORM DE-LETE.
133000     PERFORM PRINT-DETAIL.
133100     GO TO   DIV-INIT-F2-22.
133200 DIV-TEST-F2-21-1.
133300     IF      WRK-DU-2V1-1 = 0
133400             PERFORM PASS
133500             PERFORM PRINT-DETAIL
133600     ELSE
133700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
133800             PERFORM FAIL
133900             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
134000             MOVE    0            TO CORRECT-N
134100             PERFORM PRINT-DETAIL.
134200     ADD 1 TO REC-CT.
134300 DIV-TEST-F2-21-2.
134400     IF      WRK-DU-2V0-1 = 99
134500             PERFORM PASS
134600             PERFORM PRINT-DETAIL
134700     ELSE
134800             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
134900             PERFORM FAIL
135000             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
135100             MOVE    99           TO CORRECT-N
135200             PERFORM PRINT-DETAIL.
135300     ADD 1 TO REC-CT.
135400 DIV-TEST-F2-21-3.
135500     IF      WRK-DU-2V1-2 = 0
135600             PERFORM PASS
135700             PERFORM PRINT-DETAIL
135800     ELSE
135900             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
136000             PERFORM FAIL
136100             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
136200             MOVE    0            TO CORRECT-N
136300             PERFORM PRINT-DETAIL.
136400     ADD 1 TO REC-CT.
136500 DIV-TEST-F2-21-4.
136600     IF      WRK-DU-2V0-2 = 0
136700             PERFORM PASS
136800             PERFORM PRINT-DETAIL
136900     ELSE
137000             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
137100             PERFORM FAIL
137200             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
137300             MOVE    0            TO CORRECT-N
137400             PERFORM PRINT-DETAIL.
137500     ADD 1 TO REC-CT.
137600 DIV-TEST-F2-21-5.
137700     IF      WRK-DU-2V1-3 = 0
137800             PERFORM PASS
137900             PERFORM PRINT-DETAIL
138000     ELSE
138100             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
138200             PERFORM FAIL
138300             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
138400             MOVE    0            TO CORRECT-N
138500             PERFORM PRINT-DETAIL.
138600     ADD 1 TO REC-CT.
138700 DIV-TEST-F2-21-6.
138800     IF      WRK-DU-2V0-3 = 0
138900             PERFORM PASS
139000             PERFORM PRINT-DETAIL
139100     ELSE
139200             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
139300             PERFORM FAIL
139400             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
139500             MOVE    0            TO CORRECT-N
139600             PERFORM PRINT-DETAIL.
139700     ADD 1 TO REC-CT.
139800 DIV-TEST-F2-21-7.
139900     IF      WRK-XN-00001 = "0"
140000             PERFORM PASS
140100             PERFORM PRINT-DETAIL
140200     ELSE
140300             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
140400                  TO RE-MARK
140500             PERFORM FAIL
140600             MOVE    WRK-XN-00001 TO COMPUTED-X
140700             MOVE   "0"           TO CORRECT-X
140800             PERFORM PRINT-DETAIL.
140900*
141000*
141100 DIV-INIT-F2-22.
141200*            ==--> NO SIZE ERROR CONDITION <--==
141300*            ==-->  NEW SIZE ERROR TESTS   <--==
141400     MOVE   "DIV-TEST-F2-22" TO PAR-NAME.
141500     MOVE   "V1-67 6.4.2"    TO ANSI-REFERENCE.
141600     MOVE   "0"  TO WRK-XN-00001.
141700     MOVE    0   TO WRK-DU-2V1-1.
141800     MOVE    0   TO WRK-DU-2V0-1.
141900     MOVE    0   TO WRK-DU-2V1-2.
142000     MOVE    0   TO WRK-DU-2V0-2.
142100     MOVE    0   TO WRK-DU-2V1-3.
142200     MOVE    0   TO WRK-DU-2V0-3.
142300     MOVE    1   TO REC-CT.
142400     MOVE    10  TO WRK-DU-2V0-1.
142500     MOVE    3.9 TO WRK-DU-1V1-2.
142600 DIV-TEST-F2-22-0.
142700     DIVIDE  WRK-DU-1V1-2 INTO WRK-DU-2V0-1
142800      GIVING WRK-DU-2V1-1
142900             WRK-DU-2V0-1 ROUNDED
143000             WRK-DU-2V1-2
143100             WRK-DU-2V0-2 ROUNDED
143200             WRK-DU-2V1-3
143300             WRK-DU-2V0-3
143400      NOT ON SIZE ERROR
143500             MOVE   "1" TO WRK-XN-00001.
143600     GO TO DIV-TEST-F2-22-1.
143700 DIV-DELETE-F2-22.
143800     PERFORM DE-LETE.
143900     PERFORM PRINT-DETAIL.
144000     GO TO   DIV-INIT-F2-23.
144100 DIV-TEST-F2-22-1.
144200     IF      WRK-DU-2V1-1 = 2.5
144300             PERFORM PASS
144400             PERFORM PRINT-DETAIL
144500     ELSE
144600             PERFORM FAIL
144700             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
144800             MOVE    2.5          TO CORRECT-N
144900             PERFORM PRINT-DETAIL.
145000     ADD 1 TO REC-CT.
145100 DIV-TEST-F2-22-2.
145200     IF      WRK-DU-2V0-1 = 3
145300             PERFORM PASS
145400             PERFORM PRINT-DETAIL
145500     ELSE
145600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
145700             PERFORM FAIL
145800             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
145900             MOVE    3            TO CORRECT-N
146000             PERFORM PRINT-DETAIL.
146100     ADD 1 TO REC-CT.
146200 DIV-TEST-F2-22-3.
146300     IF      WRK-DU-2V1-2 = 2.5
146400             PERFORM PASS
146500             PERFORM PRINT-DETAIL
146600     ELSE
146700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
146800             PERFORM FAIL
146900             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
147000             MOVE    2.5          TO CORRECT-N
147100             PERFORM PRINT-DETAIL.
147200     ADD 1 TO REC-CT.
147300 DIV-TEST-F2-22-4.
147400     IF      WRK-DU-2V0-2 = 3
147500             PERFORM PASS
147600             PERFORM PRINT-DETAIL
147700     ELSE
147800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
147900             PERFORM FAIL
148000             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
148100             MOVE    3            TO CORRECT-N
148200             PERFORM PRINT-DETAIL.
148300     ADD 1 TO REC-CT.
148400 DIV-TEST-F2-22-5.
148500     IF      WRK-DU-2V1-3 = 2.5
148600             PERFORM PASS
148700             PERFORM PRINT-DETAIL
148800     ELSE
148900             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
149000             PERFORM FAIL
149100             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
149200             MOVE    2.5          TO CORRECT-N
149300             PERFORM PRINT-DETAIL.
149400     ADD 1 TO REC-CT.
149500 DIV-TEST-F2-22-6.
149600     IF      WRK-DU-2V0-3 = 2
149700             PERFORM PASS
149800             PERFORM PRINT-DETAIL
149900     ELSE
150000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
150100             PERFORM FAIL
150200             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
150300             MOVE    2            TO CORRECT-N
150400             PERFORM PRINT-DETAIL.
150500     ADD 1 TO REC-CT.
150600 DIV-TEST-F2-22-7.
150700     IF      WRK-XN-00001 = "1"
150800             PERFORM PASS
150900             PERFORM PRINT-DETAIL
151000     ELSE
151100             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
151200                  TO RE-MARK
151300             PERFORM FAIL
151400             MOVE    WRK-XN-00001 TO COMPUTED-X
151500             MOVE   "0"           TO CORRECT-X
151600             PERFORM PRINT-DETAIL.
151700*
151800*
151900 DIV-INIT-F2-23.
152000*            ==-->    SIZE ERROR CONDITION <--==
152100*            ==-->    NEW SIZE ERROR TESTS <--==
152200     MOVE   "DIV-TEST-F2-23" TO PAR-NAME.
152300     MOVE   "V1-67 6.4.2"    TO ANSI-REFERENCE.
152400     MOVE   "0"  TO WRK-XN-00001.
152500     MOVE    0   TO WRK-DU-2V1-1.
152600     MOVE    0   TO WRK-DU-2V1-2.
152700     MOVE    0   TO WRK-DU-2V0-2.
152800     MOVE    0   TO WRK-DU-2V1-3.
152900     MOVE    0   TO WRK-DU-2V0-3.
153000     MOVE    1   TO REC-CT.
153100     MOVE    99  TO WRK-DU-2V0-1.
153200     MOVE    .1  TO A01ONE-CS-00V01.
153300 DIV-TEST-F2-23-0.
153400     DIVIDE  A01ONE-CS-00V01 INTO WRK-DU-2V0-1
153500      GIVING WRK-DU-2V1-1
153600             WRK-DU-2V0-1 ROUNDED
153700             WRK-DU-2V1-2
153800             WRK-DU-2V0-2 ROUNDED
153900             WRK-DU-2V1-3
154000             WRK-DU-2V0-3
154100          ON SIZE ERROR
154200             MOVE  "1" TO WRK-XN-00001
154300      NOT ON SIZE ERROR
154400             MOVE  "2" TO WRK-XN-00001.
154500     GO TO DIV-TEST-F2-23-1.
154600 DIV-DELETE-F2-23.
154700     PERFORM DE-LETE.
154800     PERFORM PRINT-DETAIL.
154900     GO TO   DIV-INIT-F2-24.
155000 DIV-TEST-F2-23-1.
155100     IF      WRK-DU-2V1-1 = 0
155200             PERFORM PASS
155300             PERFORM PRINT-DETAIL
155400     ELSE
155500             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
155600             PERFORM FAIL
155700             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
155800             MOVE    0            TO CORRECT-N
155900             PERFORM PRINT-DETAIL.
156000     ADD 1 TO REC-CT.
156100 DIV-TEST-F2-23-2.
156200     IF      WRK-DU-2V0-1 = 99
156300             PERFORM PASS
156400             PERFORM PRINT-DETAIL
156500     ELSE
156600             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
156700             PERFORM FAIL
156800             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
156900             MOVE    99           TO CORRECT-N
157000             PERFORM PRINT-DETAIL.
157100     ADD 1 TO REC-CT.
157200 DIV-TEST-F2-23-3.
157300     IF      WRK-DU-2V1-2 = 0
157400             PERFORM PASS
157500             PERFORM PRINT-DETAIL
157600     ELSE
157700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
157800             PERFORM FAIL
157900             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
158000             MOVE    0            TO CORRECT-N
158100             PERFORM PRINT-DETAIL.
158200     ADD 1 TO REC-CT.
158300 DIV-TEST-F2-23-4.
158400     IF      WRK-DU-2V0-2 = 0
158500             PERFORM PASS
158600             PERFORM PRINT-DETAIL
158700     ELSE
158800             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
158900             PERFORM FAIL
159000             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
159100             MOVE    0            TO CORRECT-N
159200             PERFORM PRINT-DETAIL.
159300     ADD 1 TO REC-CT.
159400 DIV-TEST-F2-23-5.
159500     IF      WRK-DU-2V1-3 = 0
159600             PERFORM PASS
159700             PERFORM PRINT-DETAIL
159800     ELSE
159900             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
160000             PERFORM FAIL
160100             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
160200             MOVE    0            TO CORRECT-N
160300             PERFORM PRINT-DETAIL.
160400     ADD 1 TO REC-CT.
160500 DIV-TEST-F2-23-6.
160600     IF      WRK-DU-2V0-3 = 0
160700             PERFORM PASS
160800             PERFORM PRINT-DETAIL
160900     ELSE
161000             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
161100             PERFORM FAIL
161200             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
161300             MOVE    0            TO CORRECT-N
161400             PERFORM PRINT-DETAIL.
161500     ADD 1 TO REC-CT.
161600 DIV-TEST-F2-23-7.
161700     IF      WRK-XN-00001 = "1"
161800             PERFORM PASS
161900             PERFORM PRINT-DETAIL
162000     ELSE
162100             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
162200                  TO RE-MARK
162300             PERFORM FAIL
162400             MOVE    WRK-XN-00001 TO COMPUTED-X
162500             MOVE   "0"           TO CORRECT-X
162600             PERFORM PRINT-DETAIL.
162700*
162800*
162900 DIV-INIT-F2-24.
163000*            ==--> NO SIZE ERROR CONDITION <--==
163100*            ==-->  NEW SIZE ERROR TESTS   <--==
163200     MOVE   "DIV-TEST-F2-24" TO PAR-NAME.
163300     MOVE   "V1-67 6.4.2"    TO ANSI-REFERENCE.
163400     MOVE   "0"  TO WRK-XN-00001.
163500     MOVE    0   TO WRK-DU-2V1-1.
163600     MOVE    0   TO WRK-DU-2V0-1.
163700     MOVE    0   TO WRK-DU-2V1-2.
163800     MOVE    0   TO WRK-DU-2V0-2.
163900     MOVE    0   TO WRK-DU-2V1-3.
164000     MOVE    0   TO WRK-DU-2V0-3.
164100     MOVE    1   TO REC-CT.
164200     MOVE    10  TO WRK-DU-2V0-1.
164300     MOVE    3.9 TO WRK-DU-1V1-2.
164400 DIV-TEST-F2-24-0.
164500     DIVIDE  WRK-DU-1V1-2 INTO WRK-DU-2V0-1
164600      GIVING WRK-DU-2V1-1
164700             WRK-DU-2V0-1 ROUNDED
164800             WRK-DU-2V1-2
164900             WRK-DU-2V0-2 ROUNDED
165000             WRK-DU-2V1-3
165100             WRK-DU-2V0-3
165200          ON SIZE ERROR
165300             MOVE   "1" TO WRK-XN-00001
165400      NOT ON SIZE ERROR
165500             MOVE   "2" TO WRK-XN-00001.
165600     GO TO DIV-TEST-F2-24-1.
165700 DIV-DELETE-F2-24.
165800     PERFORM DE-LETE.
165900     PERFORM PRINT-DETAIL.
166000     GO TO   DIV-INIT-F2-25.
166100 DIV-TEST-F2-24-1.
166200     IF      WRK-DU-2V1-1 = 2.5
166300             PERFORM PASS
166400             PERFORM PRINT-DETAIL
166500     ELSE
166600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
166700             PERFORM FAIL
166800             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
166900             MOVE    2.5          TO CORRECT-N
167000             PERFORM PRINT-DETAIL.
167100     ADD 1 TO REC-CT.
167200 DIV-TEST-F2-24-2.
167300     IF      WRK-DU-2V0-1 = 3
167400             PERFORM PASS
167500             PERFORM PRINT-DETAIL
167600     ELSE
167700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
167800             PERFORM FAIL
167900             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
168000             MOVE    3            TO CORRECT-N
168100             PERFORM PRINT-DETAIL.
168200     ADD 1 TO REC-CT.
168300 DIV-TEST-F2-24-3.
168400     IF      WRK-DU-2V1-2 = 2.5
168500             PERFORM PASS
168600             PERFORM PRINT-DETAIL
168700     ELSE
168800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
168900             PERFORM FAIL
169000             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
169100             MOVE    2.5          TO CORRECT-N
169200             PERFORM PRINT-DETAIL.
169300     ADD 1 TO REC-CT.
169400 DIV-TEST-F2-24-4.
169500     IF      WRK-DU-2V0-2 = 3
169600             PERFORM PASS
169700             PERFORM PRINT-DETAIL
169800     ELSE
169900             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
170000             PERFORM FAIL
170100             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
170200             MOVE    3            TO CORRECT-N
170300             PERFORM PRINT-DETAIL.
170400     ADD 1 TO REC-CT.
170500 DIV-TEST-F2-24-5.
170600     IF      WRK-DU-2V1-3 = 2.5
170700             PERFORM PASS
170800             PERFORM PRINT-DETAIL
170900     ELSE
171000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
171100             PERFORM FAIL
171200             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
171300             MOVE    2.5          TO CORRECT-N
171400             PERFORM PRINT-DETAIL.
171500     ADD 1 TO REC-CT.
171600 DIV-TEST-F2-24-6.
171700     IF      WRK-DU-2V0-3 = 2
171800             PERFORM PASS
171900             PERFORM PRINT-DETAIL
172000     ELSE
172100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
172200             PERFORM FAIL
172300             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
172400             MOVE    2            TO CORRECT-N
172500             PERFORM PRINT-DETAIL.
172600     ADD 1 TO REC-CT.
172700 DIV-TEST-F2-24-7.
172800     IF      WRK-XN-00001 = "2"
172900             PERFORM PASS
173000             PERFORM PRINT-DETAIL
173100     ELSE
173200             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
173300                  TO RE-MARK
173400             PERFORM FAIL
173500             MOVE    WRK-XN-00001 TO COMPUTED-X
173600             MOVE   "2"           TO CORRECT-X
173700             PERFORM PRINT-DETAIL.
173800*
173900*
174000 DIV-INIT-F2-25.
174100*            ==-->    SIZE ERROR CONDITION <--==
174200*            ==-->EXPLICIT SCOPE TERMINATOR<--==
174300     MOVE   "DIV-TEST-F2-25" TO PAR-NAME.
174400     MOVE   "1V-41 6.4.3"      TO ANSI-REFERENCE.
174500     MOVE   "0"     TO WRK-XN-00001.
174600     MOVE    0      TO WRK-DS-05V00.
174700     MOVE    0      TO WRK-DS-02V00.
174800     MOVE    0      TO WRK-CS-18V00.
174900     MOVE    0      TO DIV10.
175000     MOVE    1      TO REC-CT.
175100     MOVE    44.1   TO DIV2.
175200     MOVE   -9.642  TO DIV4.
175300 DIV-TEST-F2-25-0.
175400     DIVIDE  DIV4 INTO DIV2
175500      GIVING DIV10
175600          ON SIZE ERROR
175700             MOVE   "1" TO WRK-XN-00001
175800             MOVE   23  TO WRK-DS-05V00
175900             MOVE   -4  TO WRK-DS-02V00
176000     END-DIVIDE
176100     MOVE    99    TO WRK-CS-18V00.
176200     GO TO   DIV-TEST-F2-25-1.
176300 DIV-DELETE-F2-25-1.
176400     PERFORM DE-LETE.
176500     PERFORM PRINT-DETAIL.
176600     GO TO   DIV-INIT-F2-26.
176700 DIV-TEST-F2-25-1.
176800     MOVE   "DIV-TEST-F2-25-1" TO PAR-NAME.
176900     IF      WRK-XN-00001 = "1"
177000             PERFORM PASS
177100             PERFORM PRINT-DETAIL
177200     ELSE
177300             MOVE    WRK-XN-00001 TO COMPUTED-X
177400             MOVE   "1"           TO CORRECT-X
177500             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
177600             PERFORM FAIL
177700             PERFORM PRINT-DETAIL.
177800     ADD 1 TO REC-CT.
177900 DIV-TEST-F2-25-2.
178000     MOVE   "DIV-TEST-F2-25-2" TO PAR-NAME.
178100     IF      WRK-DS-02V00 = -4
178200             PERFORM PASS
178300             PERFORM PRINT-DETAIL
178400     ELSE
178500             MOVE    WRK-DS-02V00 TO COMPUTED-N
178600             MOVE   -4            TO CORRECT-N
178700             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
178800             PERFORM FAIL
178900             PERFORM PRINT-DETAIL.
179000     ADD     1 TO REC-CT.
179100 DIV-TEST-F2-25-3.
179200     MOVE   "DIV-TEST-F2-25-3" TO PAR-NAME.
179300     IF      WRK-DS-05V00 = 23
179400             PERFORM PASS
179500             PERFORM PRINT-DETAIL
179600     ELSE
179700             MOVE    WRK-DS-05V00 TO COMPUTED-N
179800             MOVE    23           TO CORRECT-N
179900             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
180000             PERFORM FAIL
180100             PERFORM PRINT-DETAIL.
180200     ADD     1 TO REC-CT.
180300 DIV-TEST-F2-25-4.
180400     MOVE   "DIV-TEST-F2-25-4" TO PAR-NAME.
180500     IF      DIV10   = 0
180600             PERFORM PASS
180700             PERFORM PRINT-DETAIL
180800     ELSE
180900             MOVE    DIV10        TO COMPUTED-N
181000             MOVE    0            TO CORRECT-N
181100             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
181200             PERFORM FAIL
181300             PERFORM PRINT-DETAIL.
181400     ADD     1 TO REC-CT.
181500 DIV-TEST-F2-25-5.
181600     MOVE   "DIV-TEST-F2-25-5" TO PAR-NAME.
181700     IF      WRK-CS-18V00 = 000000000000000099
181800             PERFORM PASS
181900             PERFORM PRINT-DETAIL
182000     ELSE
182100             MOVE    WRK-CS-18V00 TO COMPUTED-N
182200             MOVE    99           TO CORRECT-N
182300             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
182400             PERFORM FAIL
182500             PERFORM PRINT-DETAIL.
182600*
182700*
182800 DIV-INIT-F2-26.
182900*            ==--> NO SIZE ERROR CONDITION <--==
183000*            ==-->EXPLICIT SCOPE TERMINATOR<--==
183100     MOVE   "DIV-TEST-F2-26" TO PAR-NAME.
183200     MOVE   "1V-41 6.4.3"      TO ANSI-REFERENCE.
183300     MOVE    1      TO REC-CT.
183400     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
183500     MOVE    0      TO WRK-DS-05V00.
183600     MOVE    0      TO WRK-DS-02V00.
183700     MOVE   "0"     TO WRK-XN-00001.
183800     MOVE    0      TO WRK-CS-18V00.
183900 DIV-TEST-F2-26-0.
184000     DIVIDE  A18ONES-DS-09V09 INTO WRK-DS-09V09
184100      GIVING WRK-DS-09V09
184200          ON SIZE ERROR
184300             MOVE   "1" TO WRK-XN-00001
184400             MOVE   23  TO WRK-DS-05V00
184500             MOVE   -4  TO WRK-DS-02V00
184600      END-DIVIDE
184700      MOVE   99 TO WRK-CS-18V00.
184800     GO TO   DIV-TEST-F2-26-1.
184900 DIV-DELETE-F2-26-1.
185000     PERFORM DE-LETE.
185100     PERFORM PRINT-DETAIL.
185200     GO TO   DIV-INIT-F2-27.
185300 DIV-TEST-F2-26-1.
185400     MOVE   "DIV-TEST-F2-26-1" TO PAR-NAME.
185500     IF      WRK-XN-00001 = "0"
185600             PERFORM PASS
185700             PERFORM PRINT-DETAIL
185800     ELSE
185900             MOVE    WRK-XN-00001 TO COMPUTED-X
186000             MOVE   "0"           TO CORRECT-X
186100             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
186200                  TO RE-MARK
186300             PERFORM FAIL
186400             PERFORM PRINT-DETAIL.
186500     ADD     1 TO REC-CT.
186600 DIV-TEST-F2-26-2.
186700     MOVE   "DIV-TEST-F2-26-2" TO PAR-NAME.
186800     IF      WRK-DS-02V00  = 0
186900             PERFORM PASS
187000             PERFORM PRINT-DETAIL
187100     ELSE
187200             MOVE    WRK-DS-02V00 TO COMPUTED-N
187300             MOVE    0            TO CORRECT-N
187400             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
187500                  TO RE-MARK
187600             PERFORM FAIL
187700             PERFORM PRINT-DETAIL.
187800     ADD     1 TO REC-CT.
187900 DIV-TEST-F2-26-3.
188000     MOVE   "DIV-TEST-F2-26-3" TO PAR-NAME.
188100     IF      WRK-DS-05V00 = 0
188200             PERFORM PASS
188300             PERFORM PRINT-DETAIL
188400     ELSE
188500             MOVE    WRK-DS-05V00 TO COMPUTED-N
188600             MOVE    0            TO CORRECT-N
188700             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
188800                  TO RE-MARK
188900             PERFORM FAIL
189000             PERFORM PRINT-DETAIL.
189100     ADD     1 TO REC-CT.
189200 DIV-TEST-F2-26-4.
189300     MOVE   "DIV-TEST-F2-26-4" TO PAR-NAME.
189400     IF      WRK-DS-18V00-S  =   000000001000000000
189500             PERFORM PASS
189600             PERFORM PRINT-DETAIL
189700     ELSE
189800             MOVE    WRK-DS-18V00-S     TO COMPUTED-N
189900             MOVE    000000001000000000 TO CORRECT-18V0
190000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
190100             PERFORM FAIL
190200             PERFORM PRINT-DETAIL.
190300     ADD     1 TO REC-CT.
190400 DIV-TEST-F2-26-5.
190500     MOVE   "DIV-TEST-F2-26-5" TO PAR-NAME.
190600     IF      WRK-CS-18V00 = 000000000000000099
190700             PERFORM PASS
190800             PERFORM PRINT-DETAIL
190900     ELSE
191000             MOVE    WRK-CS-18V00 TO COMPUTED-N
191100             MOVE    99           TO CORRECT-N
191200             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
191300             PERFORM FAIL
191400             PERFORM PRINT-DETAIL.
191500*
191600*
191700 DIV-INIT-F2-27.
191800     MOVE   "DIVIDE INTO GIVING" TO FEATURE.
191900*            ==-->    SIZE ERROR CONDITION <--==
192000*            ==-->EXPLICIT SCOPE TERMINATOR<--==
192100     MOVE    0      TO WRK-CS-18V00.
192200     MOVE   "0"     TO WRK-XN-00001.
192300     MOVE    0      TO WRK-DS-05V00.
192400     MOVE    0      TO WRK-DS-02V00.
192500     MOVE    0      TO DIV10.
192600     MOVE    1      TO REC-CT.
192700     MOVE    44.1   TO DIV2.
192800     MOVE   -9.642  TO DIV4.
192900 DIV-TEST-F2-27-0.
193000     DIVIDE  DIV4 INTO DIV2
193100      GIVING DIV10
193200      NOT ON SIZE ERROR
193300             MOVE   "1" TO WRK-XN-00001
193400             MOVE   23  TO WRK-DS-05V00
193500             MOVE   -4  TO WRK-DS-02V00
193600     END-DIVIDE
193700     MOVE    99    TO WRK-CS-18V00.
193800     GO TO   DIV-TEST-F2-27-1.
193900 DIV-DELETE-F2-27-1.
194000     PERFORM DE-LETE.
194100     PERFORM PRINT-DETAIL.
194200     GO TO   DIV-INIT-F2-28.
194300 DIV-TEST-F2-27-1.
194400     MOVE   "DIV-TEST-F2-27-1" TO PAR-NAME.
194500     IF      WRK-XN-00001 = "0"
194600             PERFORM PASS
194700             PERFORM PRINT-DETAIL
194800     ELSE
194900             MOVE    WRK-XN-00001 TO COMPUTED-X
195000             MOVE   "0"           TO CORRECT-X
195100             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
195200                  TO RE-MARK
195300             PERFORM FAIL
195400             PERFORM PRINT-DETAIL.
195500     ADD     1 TO REC-CT.
195600 DIV-TEST-F2-27-2.
195700     MOVE   "DIV-TEST-F2-27-2" TO PAR-NAME.
195800     IF      WRK-DS-02V00 = 0
195900             PERFORM PASS
196000             PERFORM PRINT-DETAIL
196100     ELSE
196200             MOVE    WRK-DS-02V00 TO COMPUTED-N
196300             MOVE    0            TO CORRECT-N
196400             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
196500                  TO RE-MARK
196600             PERFORM FAIL
196700             PERFORM PRINT-DETAIL.
196800     ADD     1 TO REC-CT.
196900 DIV-TEST-F2-27-3.
197000     MOVE   "DIV-TEST-F2-27-3" TO PAR-NAME.
197100     IF      WRK-DS-05V00 = 0
197200             PERFORM PASS
197300             PERFORM PRINT-DETAIL
197400     ELSE
197500             MOVE    WRK-DS-05V00 TO COMPUTED-N
197600             MOVE    0            TO CORRECT-N
197700             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
197800                  TO RE-MARK
197900             PERFORM FAIL
198000             PERFORM PRINT-DETAIL.
198100     ADD     1 TO REC-CT.
198200 DIV-TEST-F2-27-4.
198300     MOVE   "DIV-TEST-F2-27-4" TO PAR-NAME.
198400     IF      DIV10    = 0
198500             PERFORM PASS
198600             PERFORM PRINT-DETAIL
198700     ELSE
198800             MOVE    DIV10 TO COMPUTED-N
198900             MOVE    0     TO CORRECT-N
199000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
199100             PERFORM FAIL
199200             PERFORM PRINT-DETAIL.
199300     ADD     1 TO REC-CT.
199400 DIV-TEST-F2-27-5.
199500     MOVE   "DIV-TEST-F2-27-5" TO PAR-NAME.
199600     IF      WRK-CS-18V00 = 000000000000000099
199700             PERFORM PASS
199800             PERFORM PRINT-DETAIL
199900     ELSE
200000             MOVE    WRK-CS-18V00 TO COMPUTED-N
200100             MOVE    99           TO CORRECT-N
200200             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
200300             PERFORM FAIL
200400             PERFORM PRINT-DETAIL.
200500*
200600*
200700 DIV-INIT-F2-28.
200800*            ==--> NO SIZE ERROR CONDITION <--==
200900*            ==-->EXPLICIT SCOPE TERMINATOR<--==
201000     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
201100     MOVE    1      TO REC-CT.
201200     MOVE    0      TO WRK-DS-05V00.
201300     MOVE    0      TO WRK-DS-02V00.
201400     MOVE   "0"     TO WRK-XN-00001.
201500     MOVE    0      TO WRK-CS-18V00.
201600 DIV-TEST-F2-28-0.
201700     DIVIDE  A18ONES-DS-09V09 INTO WRK-DS-09V09
201800      GIVING WRK-DS-09V09
201900      NOT ON SIZE ERROR
202000             MOVE   "1" TO WRK-XN-00001
202100             MOVE   23  TO WRK-DS-05V00
202200             MOVE   -4  TO WRK-DS-02V00
202300      END-DIVIDE
202400      MOVE   99 TO WRK-CS-18V00.
202500     GO TO   DIV-TEST-F2-28-1.
202600 DIV-DELETE-F2-28-1.
202700     PERFORM DE-LETE.
202800     PERFORM PRINT-DETAIL.
202900     GO TO   DIV-INIT-F2-29.
203000 DIV-TEST-F2-28-1.
203100     MOVE   "DIV-TEST-F2-28-1" TO PAR-NAME.
203200     IF      WRK-XN-00001 = "1"
203300             PERFORM PASS
203400             PERFORM PRINT-DETAIL
203500     ELSE
203600             MOVE    WRK-XN-00001 TO COMPUTED-X
203700             MOVE   "1"           TO CORRECT-X
203800             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
203900                  TO RE-MARK
204000             PERFORM FAIL
204100             PERFORM PRINT-DETAIL.
204200     ADD     1 TO REC-CT.
204300 DIV-TEST-F2-28-2.
204400     MOVE   "DIV-TEST-F2-28-2" TO PAR-NAME.
204500     IF      WRK-DS-02V00 = -4
204600             PERFORM PASS
204700             PERFORM PRINT-DETAIL
204800     ELSE
204900             MOVE    WRK-DS-02V00 TO COMPUTED-N
205000             MOVE    -4           TO CORRECT-N
205100             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
205200                  TO RE-MARK
205300             PERFORM FAIL
205400             PERFORM PRINT-DETAIL.
205500     ADD     1 TO REC-CT.
205600 DIV-TEST-F2-28-3.
205700     MOVE   "DIV-TEST-F2-28-3" TO PAR-NAME.
205800     IF      WRK-DS-05V00 = 23
205900             PERFORM PASS
206000             PERFORM PRINT-DETAIL
206100     ELSE
206200             MOVE    WRK-DS-05V00 TO COMPUTED-N
206300             MOVE    23           TO CORRECT-N
206400             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
206500                  TO RE-MARK
206600             PERFORM FAIL
206700             PERFORM PRINT-DETAIL.
206800     ADD     1 TO REC-CT.
206900 DIV-TEST-F2-28-4.
207000     MOVE   "DIV-TEST-F2-28-4" TO PAR-NAME.
207100     IF      WRK-DS-18V00-S  =   000000001000000000
207200             PERFORM PASS
207300             PERFORM PRINT-DETAIL
207400     ELSE
207500             MOVE    WRK-DS-18V00-S     TO COMPUTED-N
207600             MOVE    000000001000000000 TO CORRECT-18V0
207700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
207800             PERFORM FAIL
207900             PERFORM PRINT-DETAIL.
208000     ADD     1 TO REC-CT.
208100 DIV-TEST-F2-28-5.
208200     MOVE   "DIV-TEST-F2-28-5" TO PAR-NAME.
208300     IF      WRK-CS-18V00 = 000000000000000099
208400             PERFORM PASS
208500             PERFORM PRINT-DETAIL
208600     ELSE
208700             MOVE    WRK-CS-18V00 TO COMPUTED-N
208800             MOVE    99           TO CORRECT-N
208900             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
209000             PERFORM FAIL
209100             PERFORM PRINT-DETAIL.
209200*
209300*
209400 DIV-INIT-F2-29.
209500*            ==-->    SIZE ERROR CONDITION <--==
209600*            ==-->EXPLICIT SCOPE TERMINATOR<--==
209700     MOVE    1      TO REC-CT.
209800     MOVE    0      TO WRK-CS-18V00.
209900     MOVE   "0"     TO WRK-XN-00001.
210000     MOVE    0      TO DIV10.
210100     MOVE    44.1   TO DIV2.
210200     MOVE   -9.642  TO DIV4.
210300 DIV-TEST-F2-29-0.
210400     DIVIDE  DIV4 INTO DIV2
210500      GIVING DIV10
210600          ON SIZE ERROR
210700             MOVE   "1" TO WRK-XN-00001
210800      NOT ON SIZE ERROR
210900             MOVE   "2" TO WRK-XN-00001
211000     END-DIVIDE
211100     MOVE    99    TO WRK-CS-18V00.
211200     GO TO   DIV-TEST-F2-29-1.
211300 DIV-DELETE-F2-29-1.
211400     PERFORM DE-LETE.
211500     PERFORM PRINT-DETAIL.
211600     GO TO   DIV-INIT-F2-30.
211700 DIV-TEST-F2-29-1.
211800     MOVE   "DIV-TEST-F2-29-1" TO PAR-NAME.
211900     IF      WRK-XN-00001 = "1"
212000             PERFORM PASS
212100             PERFORM PRINT-DETAIL
212200     ELSE
212300             MOVE    WRK-XN-00001 TO COMPUTED-X
212400             MOVE   "1"           TO CORRECT-X
212500             MOVE   "ON SIZE ERROR NOT EXECUTED"
212600                  TO RE-MARK
212700             PERFORM FAIL
212800             PERFORM PRINT-DETAIL.
212900     ADD     1 TO REC-CT.
213000 DIV-TEST-F2-29-2.
213100     MOVE   "DIV-TEST-F2-29-2" TO PAR-NAME.
213200     IF      DIV10   =   0
213300             PERFORM PASS
213400             PERFORM PRINT-DETAIL
213500     ELSE
213600             MOVE    DIV10 TO COMPUTED-N
213700             MOVE    0     TO CORRECT-N
213800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
213900             PERFORM FAIL
214000             PERFORM PRINT-DETAIL.
214100     ADD     1 TO REC-CT.
214200 DIV-TEST-F2-29-3.
214300     MOVE   "DIV-TEST-F2-29-3" TO PAR-NAME.
214400     IF      WRK-CS-18V00 = 000000000000000099
214500             PERFORM PASS
214600             PERFORM PRINT-DETAIL
214700     ELSE
214800             MOVE    WRK-CS-18V00 TO COMPUTED-N
214900             MOVE    99           TO CORRECT-N
215000             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
215100             PERFORM FAIL
215200             PERFORM PRINT-DETAIL.
215300*
215400*
215500 DIV-INIT-F2-30.
215600*            ==--> NO SIZE ERROR CONDITION <--==
215700*            ==-->EXPLICIT SCOPE TERMINATOR<--==
215800     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
215900     MOVE   "0"     TO WRK-XN-00001.
216000     MOVE    0      TO WRK-CS-18V00.
216100 DIV-TEST-F2-30-0.
216200     DIVIDE  A18ONES-DS-09V09 INTO WRK-DS-09V09
216300      GIVING WRK-DS-09V09
216400          ON SIZE ERROR
216500             MOVE   "1" TO WRK-XN-00001
216600      NOT ON SIZE ERROR
216700             MOVE   "2" TO WRK-XN-00001
216800     END-DIVIDE
216900     MOVE   99 TO WRK-CS-18V00.
217000     GO TO   DIV-TEST-F2-30-1.
217100 DIV-DELETE-F2-30-1.
217200     PERFORM DE-LETE.
217300     PERFORM PRINT-DETAIL.
217400     GO TO   CCVS-EXIT.
217500 DIV-TEST-F2-30-1.
217600     MOVE   "DIV-TEST-F2-30-1" TO PAR-NAME.
217700     IF      WRK-XN-00001 = "2"
217800             PERFORM PASS
217900             PERFORM PRINT-DETAIL
218000     ELSE
218100             MOVE    WRK-XN-00001 TO COMPUTED-X
218200             MOVE   "2"           TO CORRECT-X
218300             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
218400                  TO RE-MARK
218500             PERFORM FAIL
218600             PERFORM PRINT-DETAIL.
218700     ADD     1 TO REC-CT.
218800 DIV-TEST-F2-30-2.
218900     MOVE   "DIV-TEST-F2-30-2" TO PAR-NAME.
219000     IF      WRK-DS-18V00-S  =   000000001000000000
219100             PERFORM PASS
219200             PERFORM PRINT-DETAIL
219300     ELSE
219400             MOVE    WRK-DS-18V00-S     TO COMPUTED-N
219500             MOVE    000000001000000000 TO CORRECT-18V0
219600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
219700             PERFORM FAIL
219800             PERFORM PRINT-DETAIL.
219900     ADD     1 TO REC-CT.
220000 DIV-TEST-F2-30-3.
220100     MOVE   "DIV-TEST-F2-30-3" TO PAR-NAME.
220200     IF      WRK-CS-18V00 = 000000000000000099
220300             PERFORM PASS
220400             PERFORM PRINT-DETAIL
220500     ELSE
220600             MOVE    WRK-CS-18V00 TO COMPUTED-N
220700             MOVE    99           TO CORRECT-N
220800             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
220900             PERFORM FAIL
221000             PERFORM PRINT-DETAIL.
221100*
221200*
221300 CCVS-EXIT SECTION.
221400 CCVS-999999.
221500     GO TO CLOSE-FILES.
