000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC175A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC175A TESTS FORMAT 2 OF THE SUBTRACT
002300*    STATEMENT.  VARIOUS COMBINATINS OF DATA-ITEMS AND ALL
002400*    OPTIONAL PHRASES ARE TESTED.
002500*
002600
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 01  WRK-XN-00001 PIC X.
004400 01  WRK-DU-0V1-1 PIC V9.
004500 01  WRK-DU-2V0-1 PIC 99.
004600 01  WRK-DU-2V0-2 PIC 99.
004700 01  WRK-DU-2V0-3 PIC 99.
004800 01  WRK-DU-2V1-1 PIC 99V9.
004900 01  WRK-DU-2V1-2 PIC 99V9.
005000 01  WRK-DU-2V1-3 PIC 99V9.
005100 01  WRK-DU-2V2-1 PIC 99V99 VALUE 15.44.
005200 01  WRK-DU-2V2-2 PIC 99V99 VALUE 60.89.
005300 01  WRK-DU-2V2-3 PIC 99V99 VALUE 60.99.
005400 01  WRK-DU-2V2-4 PIC 99V99 VALUE 60.99.
005500 01  WRK-DU-2V2-5 PIC 99V99 VALUE 10.00.
005600 01  WRK-DU-2V5-1 PIC 99V9(5).
005700 01  WRK-DU-4P1-1 PIC P(4)9 VALUE .00001.
005800 01  WRK-DU-5V1-1 PIC 9(5)V9 VALUE 12345.6.
005900 01  WRK-DU-6V0-1 PIC 9(6) VALUE 99999.
006000 01  WRK-DU-6V0-2 PIC 9(6) VALUE 99999.
006100 01  WRK-DU-16V2-1 PIC 9(16)V99 VALUE 9999999999999999.99.
006200 01  WRK-NE-X-1 PIC 9(16).99.
006300 01  WRK-DS-1V0-1 PIC S9 VALUE -3.
006400 01  WRK-DS-1V0-2 PIC S9 VALUE 2.
006500 01  WRK-DS-1V2-1 PIC S9V99 VALUE ZERO.
006600 01  WRK-DS-2V0-1 PIC S99 VALUE ZERO.
006700 01  WRK-DS-2V1-1 PIC S99V9 VALUE ZERO.
006800 01  WRK-DS-2V2-1 PIC S99V99 VALUE ZERO.
006900 01  WRK-DS-2V2-2 PIC S99V99 VALUE -12.34.
007000 01  WRK-DS-16V2-1 PIC S9(16)V99 VALUE -9999999999999999.99.
007100 01  WRK-NE-X-2 PIC -9(16).99.
007200 01  WRK-NE-1 PIC .9999/99999,99999,99.
007300 01  WRK-NE-2 PIC $**.99.
007400 01  WRK-NE-3 PIC $99.99CR.
007500 01  WRK-NE-4 PIC $*9.99 VALUE ZERO.
007600 01  WRK-NE-5 PIC $.** VALUE ZERO.
007700 01  WRK-NE-6 PIC $**.**CR VALUE ZERO.
007800 01  WRK-NE-7 PIC $*9.99DB VALUE ZERO.
007900 77  SIZE-ERR                     PICTURE X  VALUE SPACE.
008000 77  SIZE-ERR2                    PICTURE X  VALUE SPACE.
008100 77  SIZE-ERR3                    PICTURE X  VALUE SPACE.
008200 77  SIZE-ERR4                    PICTURE X  VALUE SPACE.
008300 77  A16TWOS-DS-16V00             PICTURE S9(16)
008400                                  VALUE 2222222222222222.
008500 77  A18ONES-DS-18V00             PICTURE S9(18)
008600                                  VALUE 111111111111111111.
008700 77  WRK-DS-10V00                 PICTURE S9(10).
008800 77  A10ONES-DS-10V00             PICTURE S9(10)
008900                                  VALUE 1111111111.
009000 77  A05ONES-DS-05V00             PICTURE S9(5)
009100                                  VALUE 11111.
009200 77  A02ONES-DS-02V00             PICTURE S99
009300                                  VALUE 11.
009400 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
009500 77  WRK-DS-18V00 REDEFINES WRK-DS-09V09
009600                                  PICTURE S9(18).
009700 77  A06THREES-DS-03V03           PICTURE S999V999
009800                                  VALUE 333.333.
009900 77  A12THREES-DS-06V06           PICTURE S9(6)V9(6)
010000                                  VALUE 333333.333333.
010100 77  WRK-DS-06V06                 PICTURE S9(6)V9(6).
010200 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06
010300                                  PICTURE S9(12).
010400 77  A05ONES-DS-00V05             PICTURE SV9(5)
010500                                  VALUE .11111.
010600 77  WRK-DS-05V00                 PICTURE S9(5).
010700 77  WRK-DS-02V00                 PICTURE S99.
010800 77  A12ONES-DS-12V00             PICTURE S9(12)
010900                                  VALUE 111111111111.
011000 77  WRK-DS-03V10                 PICTURE S999V9(10).
011100 77  WRK-DS-13V00-S REDEFINES WRK-DS-03V10
011200                                  PICTURE S9(13).
011300 77  A99-DS-02V00                 PICTURE S99
011400                                  VALUE 99.
011500 77  A03ONES-DS-02V01             PICTURE S99V9
011600                                  VALUE 11.1.
011700 77  A06ONES-DS-03V03             PICTURE S999V999
011800                                  VALUE 111.111.
011900 77  A08TWOS-DS-02V06             PICTURE S99V9(6)
012000                                  VALUE 22.222222.
012100 77  A01ONE-DS-P0801              PICTURE SP(8)9
012200                                  VALUE .000000001.
012300 77  WRK-CS-18V00                 PICTURE S9(18) COMPUTATIONAL.
012400 77  A18ONES-CS-18V00             PICTURE S9(18) COMPUTATIONAL
012500                                  VALUE 111111111111111111.
012600 77  WRK-CS-02V02                 PICTURE S99V99 COMPUTATIONAL.
012700 77  A99-CS-02V00                 PICTURE S99 COMPUTATIONAL
012800                                  VALUE 99.
012900 77  WRK-DS-0201P                 PICTURE S99P.
013000 77  WRK-DS-06V00                 PICTURE S9(6).
013100 77  AZERO-DS-05V05               PICTURE S9(5)V9(5)
013200                                  VALUE ZERO.
013300 77  NDATA-DS-09V09               PICTURE S9(9)V9(9)
013400                                  VALUE +012345678.876543210.
013500 77  XDATA-XN-00018               PICTURE X(18)
013600                                  VALUE "00ABCDEFGHI  4321 ".
013700 77  WRK-XN-00018                 PICTURE X(18).
013800 77  ADD-12    PICTURE PP9        VALUE .001.
013900 77  ADD-13    PICTURE 9PP        VALUE 100.
014000 77  ADD-14    PICTURE 999V999.
014100 77  WRK-CU-18V00      PICTURE 9(18) VALUE ZERO COMPUTATIONAL.
014200 77  A18EIGHTS-CS-18V00 PICTURE S9(18) VALUE -888888888888888888
014300             COMPUTATIONAL.
014400 77  A14TWOS-CS-18V00  PICTURE S9(18) VALUE -000022222222222222
014500             COMPUTATIONAL.
014600 77  A12THREES-CU-18V00 PICTURE 9(18) VALUE 000000333333333333
014700             COMPUTATIONAL.
014800 77  A16FOURS-CS-18V00 PICTURE S9(18) VALUE 004444444444444444
014900             COMPUTATIONAL.
015000 77  A18FIVES-CS-18V00 PICTURE S9(18) VALUE -555555555555555555
015100             COMPUTATIONAL.
015200 77  A18SIXES-CS-18V00 PICTURE S9(18) VALUE 666666666666666666
015300             COMPUTATIONAL.
015400 77  A12SEVENS-CU-18V00 PICTURE 9(18) VALUE 000000777777777777
015500             COMPUTATIONAL.
015600 77  WRK-DU-18V00      PICTURE 9(18) VALUE ZERO.
015700 77  A18THREES-CS-18V00 PICTURE S9(18) VALUE -333333333333333333
015800             COMPUTATIONAL.
015900 77  WRK-CS-03V00 PICTURE S999 COMPUTATIONAL SYNCHRONIZED RIGHT.
016000 01  SUBTRACT-DATA.
016100     02  SUBTR-1    PICTURE 9         VALUE 1.
016200     02  SUBTR-2    PICTURE S99       VALUE 99.
016300     02  SUBTR-3    PICTURE S9V99     VALUE -1.
016400     02  SUBTR-4    PICTURE SPP9      VALUE .001.
016500     02  SUBTR-5    PICTURE S9PP      VALUE 100.
016600     02  SUBTR-6    PICTURE 9  VALUE 1.
016700     02  SUBTR-7    PICTURE S99  VALUE 99.
016800     02  SUBTR-8    PICTURE S9V99  VALUE -9.99.
016900     02  SUBTR-10    PICTURE S999  VALUE 100.
017000     02  SUBTR-11   PICTURE S999V999.
017100 01  N-3                                PICTURE IS 99999.
017200 01  N-4                                PICTURE IS 9(5)
017300     VALUE IS 52800.
017400 01  N-5                                PICTURE IS S9(9)V99
017500     VALUE IS 000000001.00.
017600 01  N-7                                PICTURE IS S9(7)V9(4)
017700     VALUE IS 0000001.0000.
017800 01  X-8 REDEFINES N-7                  PICTURE IS X(11).
017900 01  N-10                               PICTURE IS S99999V
018000     VALUE IS -00001.
018100 01  N-11                               PICTURE IS 9 VALUE IS 9.
018200 01  N-12                               PICTURE IS 9 VALUE IS 9.
018300 01  N-13                               PICTURE IS 9(5)
018400     VALUE IS 99999.
018500 01  N-14                               PICTURE IS 9 VALUE IS 1.
018600 01  N-15                               PICTURE IS 9(16).
018700 01  N-16                               PICTURE IS S999999V99
018800     VALUE IS 5.90.
018900 01  N-17                               PICTURE IS S9(3)V99
019000     VALUE IS +3.6.
019100 01  N-18                               PICTURE IS S9(10)
019200     VALUE IS -5.
019300 01  N-19                               PICTURE IS $9.00.
019400 01  N-20                               PICTURE IS S9(9)
019500     VALUE IS -999999999.
019600 01  N-21                               PICTURE IS 9 VALUE IS 5.
019700 01  N-22                               PICTURE IS 999V99
019800     VALUE IS 005.55.
019900 01  N-23                               PICTURE IS $$$.99CR.
020000 01  N-25                               PICTURE IS 9 VALUE IS 1.
020100 01  N-26               PICTURE 9(5).
020200 01  N-27                               PICTURE IS 9999V9
020300     VALUE IS 9999.9.
020400 01  N-28                               PICTURE IS $9999.00.
020500 01  N-40                               PICTURE IS 9(7)
020600     VALUE IS 7777777.
020700 01  N-41                               PICTURE IS 9(7)
020800     VALUE IS 1111111.
020900 01  N-42                               PICTURE IS 9(3)P(4).
021000 01  TRUNC-DATA.
021100     02 N-43  PICTURE S9V9 VALUE +1.6.
021200     02 N-44  PICTURE S9V9 VALUE -1.6.
021300     02 N-45  PICTURE S9.
021400 01  MINUS-NAMES.
021500     02  MINUS-NAME1 PICTURE S9(18) VALUE -999999999999999999.
021600     02  MINUS-NAME2 PICTURE S9(18) VALUE -999999999999999999.
021700     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
021800     02  PLUS-NAME1  PICTURE S9(18) VALUE +999999999999999999.
021900     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
022000     02  MINUS-NAME3 PICTURE SV9(18) VALUE -.999999999999999999.
022100     02  MINUS-NAME4 PICTURE SV9(18) VALUE -.999999999999999999.
022200     02  EVEN-NAME2  PICTURE SV9(18)  VALUE +.1.
022300     02  PLUS-NAME3  PICTURE SV9(18) VALUE +.999999999999999999.
022400     02  PLUS-NAME4  PICTURE SV9(18) VALUE +.999999999999999999.
022500     02  WHOLE-FIELD   PICTURE S9(18).
022600     02  DECMAL-FIELD  PICTURE SV9(18).
022700 01  TEST-RESULTS.
022800     02 FILLER                   PIC X      VALUE SPACE.
022900     02 FEATURE                  PIC X(20)  VALUE SPACE.
023000     02 FILLER                   PIC X      VALUE SPACE.
023100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
023200     02 FILLER                   PIC X      VALUE SPACE.
023300     02  PAR-NAME.
023400       03 FILLER                 PIC X(19)  VALUE SPACE.
023500       03  PARDOT-X              PIC X      VALUE SPACE.
023600       03 DOTVALUE               PIC 99     VALUE ZERO.
023700     02 FILLER                   PIC X(8)   VALUE SPACE.
023800     02 RE-MARK                  PIC X(61).
023900 01  TEST-COMPUTED.
024000     02 FILLER                   PIC X(30)  VALUE SPACE.
024100     02 FILLER                   PIC X(17)  VALUE
024200            "       COMPUTED=".
024300     02 COMPUTED-X.
024400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
024500     03 COMPUTED-N               REDEFINES COMPUTED-A
024600                                 PIC -9(9).9(9).
024700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
024800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
024900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
025000     03       CM-18V0 REDEFINES COMPUTED-A.
025100         04 COMPUTED-18V0                    PIC -9(18).
025200         04 FILLER                           PIC X.
025300     03 FILLER PIC X(50) VALUE SPACE.
025400 01  TEST-CORRECT.
025500     02 FILLER PIC X(30) VALUE SPACE.
025600     02 FILLER PIC X(17) VALUE "       CORRECT =".
025700     02 CORRECT-X.
025800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
025900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
026000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
026100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
026200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
026300     03      CR-18V0 REDEFINES CORRECT-A.
026400         04 CORRECT-18V0                     PIC -9(18).
026500         04 FILLER                           PIC X.
026600     03 FILLER PIC X(2) VALUE SPACE.
026700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
026800 01  CCVS-C-1.
026900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
027000-    "SS  PARAGRAPH-NAME
027100-    "       REMARKS".
027200     02 FILLER                     PIC X(20)    VALUE SPACE.
027300 01  CCVS-C-2.
027400     02 FILLER                     PIC X        VALUE SPACE.
027500     02 FILLER                     PIC X(6)     VALUE "TESTED".
027600     02 FILLER                     PIC X(15)    VALUE SPACE.
027700     02 FILLER                     PIC X(4)     VALUE "FAIL".
027800     02 FILLER                     PIC X(94)    VALUE SPACE.
027900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
028000 01  REC-CT                        PIC 99       VALUE ZERO.
028100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
028200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
028300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
028400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
028500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
028600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
028700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
028800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
028900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
029000 01  CCVS-H-1.
029100     02  FILLER                    PIC X(39)    VALUE SPACES.
029200     02  FILLER                    PIC X(42)    VALUE
029300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
029400     02  FILLER                    PIC X(39)    VALUE SPACES.
029500 01  CCVS-H-2A.
029600   02  FILLER                        PIC X(40)  VALUE SPACE.
029700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
029800   02  FILLER                        PIC XXXX   VALUE
029900     "4.2 ".
030000   02  FILLER                        PIC X(28)  VALUE
030100            " COPY - NOT FOR DISTRIBUTION".
030200   02  FILLER                        PIC X(41)  VALUE SPACE.
030300
030400 01  CCVS-H-2B.
030500   02  FILLER                        PIC X(15)  VALUE
030600            "TEST RESULT OF ".
030700   02  TEST-ID                       PIC X(9).
030800   02  FILLER                        PIC X(4)   VALUE
030900            " IN ".
031000   02  FILLER                        PIC X(12)  VALUE
031100     " HIGH       ".
031200   02  FILLER                        PIC X(22)  VALUE
031300            " LEVEL VALIDATION FOR ".
031400   02  FILLER                        PIC X(58)  VALUE
031500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
031600 01  CCVS-H-3.
031700     02  FILLER                      PIC X(34)  VALUE
031800            " FOR OFFICIAL USE ONLY    ".
031900     02  FILLER                      PIC X(58)  VALUE
032000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
032100     02  FILLER                      PIC X(28)  VALUE
032200            "  COPYRIGHT   1985 ".
032300 01  CCVS-E-1.
032400     02 FILLER                       PIC X(52)  VALUE SPACE.
032500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
032600     02 ID-AGAIN                     PIC X(9).
032700     02 FILLER                       PIC X(45)  VALUE SPACES.
032800 01  CCVS-E-2.
032900     02  FILLER                      PIC X(31)  VALUE SPACE.
033000     02  FILLER                      PIC X(21)  VALUE SPACE.
033100     02 CCVS-E-2-2.
033200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
033300         03 FILLER                   PIC X      VALUE SPACE.
033400         03 ENDER-DESC               PIC X(44)  VALUE
033500            "ERRORS ENCOUNTERED".
033600 01  CCVS-E-3.
033700     02  FILLER                      PIC X(22)  VALUE
033800            " FOR OFFICIAL USE ONLY".
033900     02  FILLER                      PIC X(12)  VALUE SPACE.
034000     02  FILLER                      PIC X(58)  VALUE
034100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
034200     02  FILLER                      PIC X(13)  VALUE SPACE.
034300     02 FILLER                       PIC X(15)  VALUE
034400             " COPYRIGHT 1985".
034500 01  CCVS-E-4.
034600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
034700     02 FILLER                       PIC X(4)   VALUE " OF ".
034800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
034900     02 FILLER                       PIC X(40)  VALUE
035000      "  TESTS WERE EXECUTED SUCCESSFULLY".
035100 01  XXINFO.
035200     02 FILLER                       PIC X(19)  VALUE
035300            "*** INFORMATION ***".
035400     02 INFO-TEXT.
035500       04 FILLER                     PIC X(8)   VALUE SPACE.
035600       04 XXCOMPUTED                 PIC X(20).
035700       04 FILLER                     PIC X(5)   VALUE SPACE.
035800       04 XXCORRECT                  PIC X(20).
035900     02 INF-ANSI-REFERENCE           PIC X(48).
036000 01  HYPHEN-LINE.
036100     02 FILLER  PIC IS X VALUE IS SPACE.
036200     02 FILLER  PIC IS X(65)    VALUE IS "************************
036300-    "*****************************************".
036400     02 FILLER  PIC IS X(54)    VALUE IS "************************
036500-    "******************************".
036600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
036700     "NC175A".
036800 PROCEDURE DIVISION.
036900 CCVS1 SECTION.
037000 OPEN-FILES.
037100     OPEN     OUTPUT PRINT-FILE.
037200     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
037300     MOVE    SPACE TO TEST-RESULTS.
037400     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
037500     GO TO CCVS1-EXIT.
037600 CLOSE-FILES.
037700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
037800 TERMINATE-CCVS.
037900S    EXIT PROGRAM.
038000STERMINATE-CALL.
038100     STOP     RUN.
038200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
038300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
038400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
038500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
038600     MOVE "****TEST DELETED****" TO RE-MARK.
038700 PRINT-DETAIL.
038800     IF REC-CT NOT EQUAL TO ZERO
038900             MOVE "." TO PARDOT-X
039000             MOVE REC-CT TO DOTVALUE.
039100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
039200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
039300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
039400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
039500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
039600     MOVE SPACE TO CORRECT-X.
039700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
039800     MOVE     SPACE TO RE-MARK.
039900 HEAD-ROUTINE.
040000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
040300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
040400 COLUMN-NAMES-ROUTINE.
040500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
040600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
040800 END-ROUTINE.
040900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
041000 END-RTN-EXIT.
041100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041200 END-ROUTINE-1.
041300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
041400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
041500      ADD PASS-COUNTER TO ERROR-HOLD.
041600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
041700      MOVE PASS-COUNTER TO CCVS-E-4-1.
041800      MOVE ERROR-HOLD TO CCVS-E-4-2.
041900      MOVE CCVS-E-4 TO CCVS-E-2-2.
042000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
042100  END-ROUTINE-12.
042200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
042300     IF       ERROR-COUNTER IS EQUAL TO ZERO
042400         MOVE "NO " TO ERROR-TOTAL
042500         ELSE
042600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
042700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
042800     PERFORM WRITE-LINE.
042900 END-ROUTINE-13.
043000     IF DELETE-COUNTER IS EQUAL TO ZERO
043100         MOVE "NO " TO ERROR-TOTAL  ELSE
043200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
043300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
043400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
043500      IF   INSPECT-COUNTER EQUAL TO ZERO
043600          MOVE "NO " TO ERROR-TOTAL
043700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
043800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
043900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
044000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
044100 WRITE-LINE.
044200     ADD 1 TO RECORD-COUNT.
044300Y    IF RECORD-COUNT GREATER 42
044400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
044500Y        MOVE SPACE TO DUMMY-RECORD
044600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
044700Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
044800Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
044900Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
045000Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
045100Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
045200Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
045300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
045400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
045500Y        MOVE ZERO TO RECORD-COUNT.
045600     PERFORM WRT-LN.
045700 WRT-LN.
045800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
045900     MOVE SPACE TO DUMMY-RECORD.
046000 BLANK-LINE-PRINT.
046100     PERFORM WRT-LN.
046200 FAIL-ROUTINE.
046300     IF     COMPUTED-X NOT EQUAL TO SPACE
046400            GO TO FAIL-ROUTINE-WRITE.
046500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
046600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
046700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
046800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046900     MOVE   SPACES TO INF-ANSI-REFERENCE.
047000     GO TO  FAIL-ROUTINE-EX.
047100 FAIL-ROUTINE-WRITE.
047200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
047300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
047400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
047500     MOVE   SPACES TO COR-ANSI-REFERENCE.
047600 FAIL-ROUTINE-EX. EXIT.
047700 BAIL-OUT.
047800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
047900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
048000 BAIL-OUT-WRITE.
048100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
048200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
048300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
048400     MOVE   SPACES TO INF-ANSI-REFERENCE.
048500 BAIL-OUT-EX. EXIT.
048600 CCVS1-EXIT.
048700     EXIT.
048800 SECT-NC175A-001 SECTION.
048900 SUB-INIT-F2-1.
049000     MOVE   "VI-134 6.25.4 GR2" TO ANSI-REFERENCE.
049100     MOVE   "SUBTRACT FROM GIVING" TO FEATURE.
049200 SUB-TEST-F2-1.
049300     MOVE     -2 TO N-10.
049400     SUBTRACT N-10 FROM 0 GIVING N-19.
049500     IF       N-19 EQUAL TO "$2.00"
049600              PERFORM PASS
049700              GO TO SUB-WRITE-F2-1.
049800     GO TO    SUB-FAIL-F2-1.
049900 SUB-DELETE-F2-1.
050000     PERFORM  DE-LETE.
050100     GO TO    SUB-WRITE-F2-1.
050200 SUB-FAIL-F2-1.
050300     MOVE     N-19 TO COMPUTED-A.
050400     MOVE "     $2.00" TO CORRECT-A.
050500     PERFORM  FAIL.
050600 SUB-WRITE-F2-1.
050700     MOVE "SUB-TEST-F2-1 " TO PAR-NAME.
050800     PERFORM  PRINT-DETAIL.
050900 SUB-TEST-F2-2.
051000     SUBTRACT N-21 FROM N-22 GIVING N-23 ROUNDED.
051100     IF       N-23 EQUAL TO "  $.55  "
051200              PERFORM PASS
051300              GO TO SUB-WRITE-F2-2.
051400     GO TO    SUB-FAIL-F2-2.
051500 SUB-DELETE-F2-2.
051600     PERFORM  DE-LETE.
051700     GO TO    SUB-WRITE-F2-2.
051800 SUB-FAIL-F2-2.
051900     MOVE     N-23 TO COMPUTED-A.
052000     MOVE "      $.55" TO CORRECT-A.
052100     PERFORM  FAIL.
052200 SUB-WRITE-F2-2.
052300     MOVE "SUB-TEST-F2-2 " TO PAR-NAME.
052400     PERFORM  PRINT-DETAIL.
052500 SUB-INIT-F2-3-1.
052600     MOVE    1    TO N-25.
052700     MOVE    ZERO TO N-26.
052800 SUB-TEST-F2-3-1.
052900     SUBTRACT N-25 FROM -99999 GIVING N-26 ON SIZE ERROR
053000              PERFORM PASS
053100              GO TO SUB-WRITE-F2-3-1.
053200     GO TO    SUB-FAIL-F2-3-1.
053300 SUB-DELETE-F2-3-1.
053400     PERFORM  DE-LETE.
053500     GO TO    SUB-WRITE-F2-3-1.
053600 SUB-FAIL-F2-3-1.
053700     MOVE     N-26 TO COMPUTED-N.
053800     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
053900     PERFORM  FAIL.
054000 SUB-WRITE-F2-3-1.
054100     MOVE "SUB-TEST-F2-3-1 " TO PAR-NAME.
054200     PERFORM  PRINT-DETAIL.
054300 SUB-TEST-F2-3-2.
054400     IF       N-26 = ZERO
054500              PERFORM PASS
054600              GO TO SUB-WRITE-F2-3-2.
054700     GO TO    SUB-FAIL-F2-3-2.
054800 SUB-DELETE-F2-3-2.
054900     PERFORM  DE-LETE.
055000     GO TO    SUB-WRITE-F2-3-2.
055100 SUB-FAIL-F2-3-2.
055200     MOVE     N-26 TO COMPUTED-N.
055300     MOVE     ZERO TO CORRECT-N.
055400     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
055500     PERFORM  FAIL.
055600 SUB-WRITE-F2-3-2.
055700     MOVE "SUB-TEST-F2-3-2 " TO PAR-NAME.
055800     PERFORM  PRINT-DETAIL.
055900 SUB-INIT-F2-4-1.
056000     MOVE    9999.9 TO N-27.
056100     MOVE    ZERO   TO N-28.
056200 SUB-TEST-F2-4-1.
056300     SUBTRACT -9 FROM N-27 GIVING N-28 ROUNDED ON SIZE ERROR
056400              PERFORM PASS
056500              GO TO SUB-WRITE-F2-4-1.
056600     GO TO    SUB-FAIL-F2-4-1.
056700 SUB-DELETE-F2-4-1.
056800     PERFORM  DE-LETE.
056900     GO TO    SUB-WRITE-F2-4-1.
057000 SUB-FAIL-F2-4-1.
057100     MOVE     N-28 TO COMPUTED-A.
057200     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
057300     PERFORM  FAIL.
057400 SUB-WRITE-F2-4-1.
057500     MOVE "SUB-TEST-F2-4-1 " TO PAR-NAME.
057600     PERFORM  PRINT-DETAIL.
057700 SUB-TEST-F2-4-2.
057800     IF      N-28 = "$0000.00"
057900             PERFORM PASS
058000             GO TO   SUB-WRITE-F2-4-2.
058100     GO TO   SUB-FAIL-F2-4-2.
058200 SUB-DELETE-F2-4-2.
058300     PERFORM DE-LETE.
058400     GO TO   SUB-WRITE-F2-4-2.
058500 SUB-FAIL-F2-4-2.
058600     MOVE    N-28 TO COMPUTED-X.
058700     MOVE   "$0000.00"  TO CORRECT-X.
058800     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
058900     PERFORM FAIL.
059000 SUB-WRITE-F2-4-2.
059100     MOVE "SUB-TEST-F2-4-2 " TO PAR-NAME.
059200     PERFORM PRINT-DETAIL.
059300 SUB-INIT-F2-5.
059400     MOVE     "  GIVING" TO FEATURE.
059500 SUB-TEST-F2-5.
059600     MOVE     ZERO TO WRK-DS-09V09.
059700     SUBTRACT A06THREES-DS-03V03 FROM A12THREES-DS-06V06
059800              GIVING WRK-DS-06V06.
059900     IF       WRK-DS-06V06 EQUAL TO 333000.000333
060000              PERFORM PASS GO TO SUB-WRITE-F2-5.
060100     GO       TO SUB-FAIL-F2-5.
060200 SUB-DELETE-F2-5.
060300     PERFORM  DE-LETE.
060400     GO       TO SUB-WRITE-F2-5.
060500 SUB-FAIL-F2-5.
060600     MOVE     WRK-DS-06V06 TO COMPUTED-N.
060700     MOVE     333000.000333 TO CORRECT-N.
060800     PERFORM  FAIL.
060900 SUB-WRITE-F2-5.
061000     MOVE     "SUB-TEST-F2-5" TO PAR-NAME.
061100     PERFORM  PRINT-DETAIL.
061200 SUB-TEST-F2-6.
061300     MOVE     ZERO TO WRK-DS-06V06.
061400     SUBTRACT A05ONES-DS-05V00
061500              A05ONES-DS-00V05
061600              A12THREES-DS-06V06
061700              A06THREES-DS-03V03 FROM ZERO GIVING WRK-DS-06V06.
061800     IF       WRK-DS-06V06 EQUAL TO -344777.777443
061900              PERFORM PASS GO TO SUB-WRITE-F2-6.
062000     GO       TO SUB-FAIL-F2-6.
062100 SUB-DELETE-F2-6.
062200     PERFORM  DE-LETE.
062300     GO       TO SUB-WRITE-F2-6.
062400 SUB-FAIL-F2-6.
062500     MOVE     WRK-DS-06V06 TO COMPUTED-N.
062600     MOVE     -344777.777443 TO CORRECT-N.
062700     PERFORM  FAIL.
062800 SUB-WRITE-F2-6.
062900     MOVE     "SUB-TEST-F2-6" TO PAR-NAME.
063000     PERFORM  PRINT-DETAIL.
063100 SUB-TEST-F2-7.
063200     MOVE     -099999.999999 TO WRK-DS-06V06.
063300     SUBTRACT A05ONES-DS-05V00
063400              -11111
063500              AZERO-DS-05V05 FROM WRK-DS-06V06
063600              GIVING WRK-DS-06V00 ROUNDED.
063700     IF       WRK-DS-06V00 EQUAL TO -100000
063800              PERFORM PASS GO TO SUB-WRITE-F2-7.
063900     GO       TO SUB-FAIL-F2-7.
064000 SUB-DELETE-F2-7.
064100     PERFORM  DE-LETE.
064200     GO       TO SUB-WRITE-F2-7.
064300 SUB-FAIL-F2-7.
064400     MOVE     WRK-DS-06V00 TO COMPUTED-N.
064500     MOVE    -100000 TO CORRECT-N.
064600     PERFORM  FAIL.
064700 SUB-WRITE-F2-7.
064800     MOVE     "SUB-TEST-F2-7" TO PAR-NAME.
064900     PERFORM  PRINT-DETAIL.
065000 SUB-TEST-F2-8-1.
065100     MOVE     ZERO TO WRK-DS-10V00.
065200     SUBTRACT A12ONES-DS-12V00
065300              FROM ZERO GIVING WRK-DS-10V00 ON SIZE ERROR
065400              PERFORM PASS GO TO SUB-WRITE-F2-8-1.
065500     GO       TO SUB-FAIL-F2-8-1.
065600 SUB-DELETE-F2-8-1.
065700     PERFORM  DE-LETE.
065800     GO       TO SUB-WRITE-F2-8-1.
065900 SUB-FAIL-F2-8-1.
066000     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
066100     PERFORM  FAIL.
066200 SUB-WRITE-F2-8-1.
066300     MOVE     "SUB-TEST-F2-8-1" TO PAR-NAME.
066400     PERFORM  PRINT-DETAIL.
066500 SUB-TEST-F2-8-2.
066600     IF       WRK-DS-10V00 EQUAL TO ZERO
066700              PERFORM PASS GO TO SUB-WRITE-F2-8-2.
066800*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF ADD-TEST-F2-8-1
066900     GO       TO SUB-FAIL-F2-8-2.
067000 SUB-DELETE-F2-8-2.
067100     PERFORM  DE-LETE.
067200     GO       TO SUB-WRITE-F2-8-2.
067300 SUB-FAIL-F2-8-2.
067400     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
067500     MOVE     WRK-DS-10V00 TO COMPUTED-14V4.
067600     MOVE     ZERO TO CORRECT-14V4.
067700     PERFORM  FAIL.
067800 SUB-WRITE-F2-8-2.
067900     MOVE     "SUB-TEST-F2-8-2" TO PAR-NAME.
068000     PERFORM  PRINT-DETAIL.
068100 SUB-TEST-F2-9-1.
068200     MOVE ZERO TO WRK-DS-05V00.
068300     SUBTRACT 33333
068400              A06THREES-DS-03V03
068500              A12THREES-DS-06V06
068600              FROM -1000000 GIVING WRK-DS-05V00
068700              ROUNDED ON SIZE ERROR
068800              PERFORM PASS GO TO SUB-WRITE-F2-9-1.
068900     GO       TO SUB-FAIL-F2-9-1.
069000 SUB-DELETE-F2-9-1.
069100     PERFORM  DE-LETE.
069200     GO       TO SUB-WRITE-F2-9-1.
069300 SUB-FAIL-F2-9-1.
069400     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
069500     PERFORM  FAIL.
069600 SUB-WRITE-F2-9-1.
069700     MOVE     "SUB-TEST-F2-9-1" TO PAR-NAME.
069800     PERFORM  PRINT-DETAIL.
069900 SUB-TEST-F2-9-2.
070000     IF       WRK-DS-05V00 EQUAL TO ZERO
070100              PERFORM PASS GO TO SUB-WRITE-F2-9-2.
070200*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-F2-9-1
070300     GO       TO SUB-FAIL-F2-9-2.
070400 SUB-DELETE-F2-9-2.
070500     PERFORM  DE-LETE.
070600     GO       TO SUB-WRITE-F2-9-2.
070700 SUB-FAIL-F2-9-2.
070800     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
070900     MOVE     WRK-DS-05V00 TO COMPUTED-N.
071000     MOVE     ZERO TO CORRECT-N.
071100     PERFORM  FAIL.
071200 SUB-WRITE-F2-9-2.
071300     MOVE     "SUB-TEST-F2-9-2" TO PAR-NAME.
071400     PERFORM  PRINT-DETAIL.
071500 SUB-TEST-F2-10-1.
071600     MOVE     ZERO TO WRK-DS-06V06.
071700     SUBTRACT A12THREES-DS-06V06
071800              333333
071900              A06THREES-DS-03V03
072000              -.0000009 FROM 0000000
072100              GIVING WRK-DS-06V06 ROUNDED ON SIZE ERROR
072200              GO TO SUB-FAIL-F2-10-1.
072300     PERFORM  PASS.
072400     GO       TO SUB-WRITE-F2-10-1.
072500 SUB-DELETE-F2-10-1.
072600     PERFORM  DE-LETE.
072700     GO       TO SUB-WRITE-F2-10-1.
072800 SUB-FAIL-F2-10-1.
072900     MOVE     "SIZE ERR SHOULD NOT EXECUTE" TO RE-MARK.
073000     PERFORM  FAIL.
073100 SUB-WRITE-F2-10-1.
073200     MOVE     "SUB-TEST-F2-10-1" TO PAR-NAME.
073300     PERFORM  PRINT-DETAIL.
073400 SUB-TEST-F2-10-2.
073500     IF       WRK-DS-06V06 EQUAL TO -666999.666332
073600              PERFORM PASS GO TO SUB-WRITE-F2-10-2.
073700*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-F2-10-1
073800     GO       TO SUB-FAIL-F2-10-2.
073900 SUB-DELETE-F2-10-2.
074000     PERFORM  DE-LETE.
074100     GO       TO SUB-WRITE-F2-10-2.
074200 SUB-FAIL-F2-10-2.
074300     MOVE     WRK-DS-06V06 TO COMPUTED-N.
074400     MOVE     -666999.666332 TO CORRECT-N.
074500     PERFORM  FAIL.
074600 SUB-WRITE-F2-10-2.
074700     MOVE     "SUB-TEST-F2-10-2" TO PAR-NAME.
074800     PERFORM  PRINT-DETAIL.
074900 SUB-INIT-F2-11.
075000     MOVE     "  SERIES" TO FEATURE.
075100 SUB-TEST-F2-11.
075200     MOVE     ZERO TO WRK-DS-03V10.
075300     SUBTRACT A99-DS-02V00
075400              A03ONES-DS-02V01
075500              A06ONES-DS-03V03
075600              A08TWOS-DS-02V06
075700              -1.1111111
075800              +.11111111
075900              A01ONE-DS-P0801 FROM 0000.000000
076000              GIVING WRK-DS-03V10.
076100     IF       WRK-DS-03V10 EQUAL TO -242.4332220110
076200              PERFORM PASS GO TO SUB-WRITE-F2-11.
076300     GO       TO SUB-FAIL-F2-11.
076400 SUB-DELETE-F2-11.
076500     PERFORM  DE-LETE.
076600     GO       TO SUB-WRITE-F2-11.
076700 SUB-FAIL-F2-11.
076800     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
076900     MOVE     -242.4332220110 TO CORRECT-4V14.
077000     PERFORM  FAIL.
077100 SUB-WRITE-F2-11.
077200     MOVE     "SUB-TEST-F2-11" TO PAR-NAME.
077300     PERFORM  PRINT-DETAIL.
077400 SUB-TEST-F2-12.
077500     MOVE     ZERO TO WRK-DS-03V10.
077600     SUBTRACT A01ONE-DS-P0801
077700              +.11111111
077800              -1.1111111
077900              A08TWOS-DS-02V06
078000              A06ONES-DS-03V03
078100              A03ONES-DS-02V01
078200              A99-DS-02V00 FROM 0000.000000 GIVING WRK-DS-03V10.
078300     IF       WRK-DS-03V10 EQUAL TO -242.4332220110
078400              PERFORM PASS GO TO SUB-WRITE-F2-12.
078500     GO       TO SUB-FAIL-F2-12.
078600 SUB-DELETE-F2-12.
078700     PERFORM  DE-LETE.
078800     GO       TO SUB-WRITE-F2-12.
078900 SUB-FAIL-F2-12.
079000     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
079100     MOVE     -242.4332220110 TO CORRECT-4V14.
079200     PERFORM  FAIL.
079300 SUB-WRITE-F2-12.
079400     MOVE     "SUB-TEST-F2-12" TO PAR-NAME.
079500     PERFORM  PRINT-DETAIL.
079600 SUB-TEST-F2-13.
079700     MOVE     ZERO TO WRK-DS-03V10.
079800     SUBTRACT A08TWOS-DS-02V06
079900              A99-DS-02V00
080000              -1.1111111
080100              A03ONES-DS-02V01
080200              A01ONE-DS-P0801
080300              +.11111111
080400              A06ONES-DS-03V03 FROM 0000.000000
080500              GIVING WRK-DS-03V10.
080600     IF       WRK-DS-03V10 EQUAL TO -242.4332220110
080700              PERFORM PASS GO TO SUB-WRITE-F2-13.
080800     GO       TO SUB-FAIL-F2-13.
080900 SUB-DELETE-F2-13.
081000     PERFORM  DE-LETE.
081100     GO       TO SUB-WRITE-F2-13.
081200 SUB-FAIL-F2-13.
081300     MOVE     WRK-DS-03V10 TO COMPUTED-4V14.
081400     MOVE     -242.4332220110 TO CORRECT-4V14.
081500     PERFORM  FAIL.
081600 SUB-WRITE-F2-13.
081700     MOVE     "SUB-TEST-F2-13" TO PAR-NAME.
081800     PERFORM  PRINT-DETAIL.
081900 SUB-TEST-F2-14.
082000     SUBTRACT SUBTR-4 SUBTR-5 .499 FROM SUBTR-2 GIVING SUBTR-11.
082100     IF       SUBTR-11 EQUAL TO -1.5
082200              PERFORM PASS GO TO SUB-WRITE-F2-14.
082300     GO       TO SUB-FAIL-F2-14.
082400 SUB-DELETE-F2-14.
082500     PERFORM DE-LETE.
082600     GO       TO SUB-WRITE-F2-14.
082700 SUB-FAIL-F2-14.
082800     MOVE     SUBTR-11  TO COMPUTED-N.
082900     MOVE     -1.5      TO CORRECT-N.
083000     PERFORM FAIL.
083100 SUB-WRITE-F2-14.
083200     MOVE     "SUB-TEST-F2-14" TO PAR-NAME.
083300     PERFORM PRINT-DETAIL.
083400 SUB-TEST-F2-15-1.
083500     SUBTRACT SUBTR-1 SUBTR-3 FROM SUBTR-5 GIVING SUBTR-7 ON
083600              SIZE ERROR
083700              PERFORM PASS GO TO SUB-WRITE-F2-15-1.
083800     GO       TO SUB-FAIL-F2-15-1.
083900 SUB-DELETE-F2-15-1.
084000     PERFORM DE-LETE.
084100     GO       TO SUB-WRITE-F2-15-1.
084200 SUB-FAIL-F2-15-1.
084300     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
084400     PERFORM FAIL.
084500 SUB-WRITE-F2-15-1.
084600     MOVE     "SUB-TEST-F2-15-1" TO PAR-NAME.
084700     PERFORM PRINT-DETAIL.
084800 SUB-TEST-F2-15-2.
084900     IF       SUBTR-7 EQUAL  TO 99
085000              PERFORM PASS GO TO SUB-WRITE-F2-15-2.
085100*    NOTE: THIS TEST DEPENDS UPON THE RESULT OF SUB-TEST-F2-15-2
085200     GO       TO SUB-FAIL-F2-15-2.
085300 SUB-DELETE-F2-15-2.
085400     PERFORM DE-LETE.
085500     GO       TO SUB-WRITE-F2-15-2.
085600 SUB-FAIL-F2-15-2.
085700     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
085800     MOVE     SUBTR-7   TO COMPUTED-N.
085900     MOVE     ZERO      TO CORRECT-N.
086000     PERFORM FAIL.
086100 SUB-WRITE-F2-15-2.
086200     MOVE     "SUB-TEST-F2-15-2" TO PAR-NAME.
086300     PERFORM PRINT-DETAIL.
086400 SUB-TEST-F2-16-1.
086500     MOVE SPACE TO SIZE-ERR.
086600     SUBTRACT MINUS-NAME1 MINUS-NAME2 -34 -1 PLUS-NAME1
086700         PLUS-NAME2 EVEN-NAME1 35 FROM EVEN-NAME1 GIVING
086800         WHOLE-FIELD
086900         ON SIZE ERROR  MOVE "1" TO SIZE-ERR.
087000     IF WHOLE-FIELD EQUAL TO 0
087100         PERFORM PASS
087200         GO TO SUB-WRITE-F2-16-1.
087300     MOVE WHOLE-FIELD TO COMPUTED-18V0.
087400     MOVE 0 TO CORRECT-18V0.
087500     PERFORM FAIL.
087600     GO TO SUB-WRITE-F2-16-1.
087700 SUB-DELETE-F2-16-1.
087800     PERFORM DE-LETE.
087900 SUB-WRITE-F2-16-1.
088000     MOVE "SUB-TEST-F2-16-1" TO PAR-NAME.
088100     PERFORM PRINT-DETAIL.
088200 SUB-TEST-F2-16-2.
088300     IF SIZE-ERR EQUAL TO "1"
088400         PERFORM FAIL
088500         MOVE SPACE TO CORRECT-A
088600         MOVE 1 TO COMPUTED-A
088700         MOVE "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
088800         GO TO SUB-WRITE-F2-16-2.
088900     PERFORM PASS.
089000     GO TO SUB-WRITE-F2-16-2.
089100 SUB-DELETE-F2-16-2.
089200     PERFORM DE-LETE.
089300 SUB-WRITE-F2-16-2.
089400     MOVE "SUB-TEST-F2-16-2" TO PAR-NAME.
089500     PERFORM PRINT-DETAIL.
089600 SUB-TEST-F2-17-1.
089700     MOVE SPACE TO SIZE-ERR.
089800     SUBTRACT MINUS-NAME3 MINUS-NAME4 -.34 -.01 PLUS-NAME3
089900         PLUS-NAME4 EVEN-NAME2 .35 FROM EVEN-NAME2
090000         GIVING DECMAL-FIELD
090100         ON SIZE ERROR  MOVE "1" TO SIZE-ERR.
090200     IF DECMAL-FIELD EQUAL TO .0
090300         PERFORM PASS
090400         GO TO SUB-WRITE-F2-17-1.
090500     MOVE DECMAL-FIELD TO COMPUTED-0V18.
090600     MOVE .0 TO CORRECT-0V18.
090700     PERFORM FAIL.
090800     GO TO SUB-WRITE-F2-17-1.
090900 SUB-DELETE-F2-17-1.
091000     PERFORM DE-LETE.
091100 SUB-WRITE-F2-17-1.
091200     MOVE "SUB-TEST-F2-17-1" TO PAR-NAME.
091300     PERFORM PRINT-DETAIL.
091400 SUB-TEST-F2-17-2.
091500     IF SIZE-ERR EQUAL TO "1"
091600         PERFORM FAIL
091700         MOVE SPACE TO CORRECT-A
091800         MOVE 1 TO COMPUTED-A
091900         MOVE "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
092000         GO TO SUB-WRITE-F2-17-2.
092100     PERFORM PASS.
092200     GO TO SUB-WRITE-F2-17-2.
092300 SUB-DELETE-F2-17-2.
092400     PERFORM DE-LETE.
092500 SUB-WRITE-F2-17-2.
092600     MOVE "SUB-TEST-F2-17-2" TO PAR-NAME.
092700     PERFORM PRINT-DETAIL.
092800 SUB-TEST-F2-18.
092900     MOVE ZERO TO WRK-CS-18V00.
093000     SUBTRACT A12THREES-CU-18V00 FROM A14TWOS-CS-18V00
093100             GIVING WRK-CS-18V00.
093200     IF WRK-CS-18V00 EQUAL TO -000022555555555555
093300         PERFORM PASS
093400         GO TO SUB-WRITE-F2-18.
093500     MOVE -000022555555555555 TO CORRECT-18V0.
093600     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
093700     PERFORM FAIL.
093800     GO TO SUB-WRITE-F2-18.
093900 SUB-DELETE-F2-18.
094000     PERFORM DE-LETE.
094100 SUB-WRITE-F2-18.
094200     MOVE "SUB-TEST-F2-18 " TO PAR-NAME.
094300     PERFORM PRINT-DETAIL.
094400 SUB-TEST-F2-19.
094500     MOVE ZERO TO WRK-DU-18V00.
094600     SUBTRACT A18SIXES-CS-18V00 FROM A18THREES-CS-18V00
094700             GIVING WRK-DU-18V00.
094800     IF WRK-DU-18V00 EQUAL TO 999999999999999999
094900         PERFORM PASS
095000         GO TO SUB-WRITE-F2-19.
095100     MOVE 999999999999999999 TO CORRECT-18V0.
095200     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
095300     PERFORM FAIL.
095400     GO TO SUB-WRITE-F2-19.
095500 SUB-DELETE-F2-19.
095600     PERFORM DE-LETE.
095700 SUB-WRITE-F2-19.
095800     MOVE "SUB-TEST-F2-19 " TO PAR-NAME.
095900     PERFORM PRINT-DETAIL.
096000 SUB-TEST-F2-20.
096100     MOVE ZERO TO WRK-CS-18V00.
096200     SUBTRACT A16FOURS-CS-18V00 FROM A12THREES-CU-18V00
096300             GIVING WRK-CS-18V00.
096400     IF WRK-CS-18V00 EQUAL TO -004444111111111111
096500         PERFORM PASS
096600         GO TO SUB-WRITE-F2-20.
096700     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
096800     MOVE -004444111111111111 TO CORRECT-18V0.
096900     PERFORM FAIL.
097000     GO TO SUB-WRITE-F2-20.
097100 SUB-DELETE-F2-20.
097200     PERFORM DE-LETE.
097300 SUB-WRITE-F2-20.
097400     MOVE "SUB-TEST-F2-20 " TO PAR-NAME.
097500     PERFORM PRINT-DETAIL.
097600 SUB-TEST-F2-21.
097700     MOVE ZERO TO WRK-DU-18V00.
097800     SUBTRACT A18THREES-CS-18V00 FROM A18ONES-CS-18V00
097900             GIVING WRK-DU-18V00.
098000     IF WRK-DU-18V00 EQUAL TO 444444444444444444
098100         PERFORM PASS
098200         GO TO SUB-WRITE-F2-21.
098300     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
098400     MOVE 444444444444444444 TO CORRECT-18V0.
098500     PERFORM FAIL.
098600     GO TO SUB-WRITE-F2-21.
098700 SUB-DELETE-F2-21.
098800     PERFORM DE-LETE.
098900 SUB-WRITE-F2-21.
099000     MOVE "SUB-TEST-F2-21 " TO PAR-NAME.
099100     PERFORM PRINT-DETAIL.
099200 SUB-TEST-F2-22.
099300     MOVE ZERO TO WRK-CS-18V00.
099400     SUBTRACT A18SIXES-CS-18V00 FROM A18THREES-CS-18V00
099500             GIVING WRK-CS-18V00.
099600     IF WRK-CS-18V00 EQUAL TO -999999999999999999
099700         PERFORM PASS
099800         GO TO SUB-WRITE-F2-22.
099900     MOVE -999999999999999999 TO CORRECT-18V0.
100000     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
100100     PERFORM FAIL.
100200     GO TO SUB-WRITE-F2-22.
100300 SUB-DELETE-F2-22.
100400     PERFORM DE-LETE.
100500 SUB-WRITE-F2-22.
100600     MOVE "SUB-TEST-F2-22 " TO PAR-NAME.
100700     PERFORM PRINT-DETAIL.
100800*
100900 SUB-INIT-F2-23.
101000*    ===-->  NEW SIZE ERROR TESTS  <--===
101100     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
101200     MOVE     ZERO TO WRK-DS-10V00.
101300 SUB-TEST-F2-23.
101400     SUBTRACT A12ONES-DS-12V00
101500              FROM ZERO GIVING WRK-DS-10V00
101600          NOT ON SIZE ERROR
101700              MOVE   "NOT ON SIZE ERROR SHOULD NOT EXECUTED"
101800                 TO RE-MARK
101900              PERFORM FAIL GO TO SUB-WRITE-F2-23.
102000     GO       TO SUB-PASS-F2-23.
102100 SUB-DELETE-F2-23.
102200     PERFORM  DE-LETE.
102300     GO       TO SUB-WRITE-F2-23.
102400 SUB-PASS-F2-23.
102500     PERFORM  PASS.
102600 SUB-WRITE-F2-23.
102700     MOVE     "SUB-TEST-F2-23" TO PAR-NAME.
102800     PERFORM  PRINT-DETAIL.
102900*
103000 SUB-INIT-F2-24.
103100*    ===-->  NEW SIZE ERROR TESTS  <--===
103200     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
103300     MOVE     ZERO TO WRK-DS-06V06.
103400 SUB-TEST-F2-24.
103500     SUBTRACT A12THREES-DS-06V06
103600              333333
103700              A06THREES-DS-03V03
103800              -.0000009 FROM 0000000
103900              GIVING WRK-DS-06V06 ROUNDED
104000          NOT ON SIZE ERROR
104100              PERFORM  PASS
104200              GO TO SUB-WRITE-F2-24.
104300     GO TO    SUB-FAIL-F2-24.
104400 SUB-DELETE-F2-24.
104500     PERFORM  DE-LETE.
104600     GO       TO SUB-WRITE-F2-24.
104700 SUB-FAIL-F2-24.
104800     MOVE    "NOT ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
104900     PERFORM  FAIL.
105000 SUB-WRITE-F2-24.
105100     MOVE     "SUB-TEST-F2-24" TO PAR-NAME.
105200     PERFORM  PRINT-DETAIL.
105300*
105400 SUB-INIT-F2-25.
105500*    ===-->  NEW SIZE ERROR TESTS  <--===
105600     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
105700     MOVE     ZERO TO WRK-DS-10V00.
105800 SUB-TEST-F2-25.
105900     SUBTRACT A12ONES-DS-12V00
106000              FROM ZERO GIVING WRK-DS-10V00
106100           ON SIZE ERROR
106200              GO TO   SUB-PASS-F2-25
106300       NOT ON SIZE ERROR
106400              MOVE   "NOT ON SIZE ERROR SHOULD NOT EXECUTED"
106500                 TO RE-MARK
106600              PERFORM FAIL GO TO SUB-WRITE-F2-25.
106700 SUB-DELETE-F2-25.
106800     PERFORM  DE-LETE.
106900     GO       TO SUB-WRITE-F2-25.
107000 SUB-PASS-F2-25.
107100     PERFORM  PASS.
107200 SUB-WRITE-F2-25.
107300     MOVE     "SUB-TEST-F2-25" TO PAR-NAME.
107400     PERFORM  PRINT-DETAIL.
107500*
107600 SUB-INIT-F2-26.
107700*    ===-->  NEW SIZE ERROR TESTS  <--===
107800     MOVE   "VI-67 6.4.2" TO ANSI-REFERENCE.
107900     MOVE     ZERO TO WRK-DS-06V06.
108000 SUB-TEST-F2-26.
108100     SUBTRACT A12THREES-DS-06V06
108200              333333
108300              A06THREES-DS-03V03
108400            -.0000009 FROM 0000000
108500       GIVING WRK-DS-06V06 ROUNDED
108600           ON SIZE ERROR
108700              GO TO    SUB-FAIL-F2-26
108800       NOT ON SIZE ERROR
108900              PERFORM PASS
109000              GO TO   SUB-WRITE-F2-26.
109100 SUB-DELETE-F2-26.
109200     PERFORM  DE-LETE.
109300     GO       TO SUB-WRITE-F2-26.
109400 SUB-FAIL-F2-26.
109500     MOVE    "NOT ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
109600     PERFORM  FAIL.
109700 SUB-WRITE-F2-26.
109800     MOVE     "SUB-TEST-F2-26" TO PAR-NAME.
109900     PERFORM  PRINT-DETAIL.
110000*
110100 SUB-INIT-F2-27.
110200*    ==-->   MULTIPLE RESULT FIELDS   <--==
110300     MOVE   "VI-134 6.25.4 GR2" TO ANSI-REFERENCE.
110400     MOVE   "SUB-TEST-F2-27"    TO PAR-NAME.
110500     MOVE    10    TO WRK-DU-2V0-1.
110600     MOVE    22.33 TO WRK-DS-2V2-1.
110700     MOVE    .3    TO WRK-DU-0V1-1.
110800     MOVE    ZERO  TO WRK-DS-2V2-2.
110900     MOVE    ZERO  TO WRK-DS-2V1-1.
111000     MOVE    ZERO  TO WRK-NE-4.
111100     MOVE    ZERO  TO WRK-NE-6.
111200     MOVE    ZERO  TO REC-CT.
111300 SUB-TEST-F2-27-0.
111400     SUBTRACT WRK-DU-2V0-1  2 WRK-DU-0V1-1 .04 FROM WRK-DS-2V2-1
111500         GIVING WRK-DS-2V2-2 WRK-DS-2V1-1 ROUNDED WRK-NE-4
111600                WRK-NE-6 ROUNDED
111700     GO TO   SUB-TEST-F2-27-1.
111800 SUB-DELETE-F2-27.
111900     PERFORM DE-LETE.
112000     PERFORM PRINT-DETAIL.
112100     GO TO   SUB-INIT-F2-28.
112200 SUB-TEST-F2-27-1.
112300     MOVE    "SUB-TEST-F2-27-1" TO PAR-NAME.
112400     MOVE 1 TO REC-CT.
112500     IF WRK-DS-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
112600     ELSE
112700     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE 09.99
112800     TO CORRECT-N PERFORM PRINT-DETAIL.
112900     ADD 1 TO REC-CT.
113000 SUB-TEST-F2-27-2.
113100     MOVE    "SUB-TEST-F2-27-2" TO PAR-NAME.
113200     IF WRK-DS-2V1-1 = 10.0 PERFORM PASS PERFORM PRINT-DETAIL
113300     ELSE
113400     PERFORM FAIL MOVE WRK-DS-2V1-1 TO COMPUTED-N MOVE 10.0
113500     TO CORRECT-N PERFORM PRINT-DETAIL.
113600     ADD 1 TO REC-CT.
113700 SUB-TEST-F2-27-3.
113800     MOVE    "SUB-TEST-F2-27-3" TO PAR-NAME.
113900     IF WRK-NE-4 = "$*9.99" PERFORM PASS PERFORM PRINT-DETAIL
114000     ELSE
114100     PERFORM FAIL MOVE WRK-NE-4 TO COMPUTED-A MOVE "$*0.00" TO
114200     CORRECT-A PERFORM PRINT-DETAIL.
114300     ADD 1 TO REC-CT.
114400 SUB-TEST-F2-27-4.
114500     MOVE    "SUB-TEST-F2-27-4" TO PAR-NAME.
114600     IF WRK-NE-6 = "$*9.99  " PERFORM PASS PERFORM PRINT-DETAIL
114700     ELSE
114800     PERFORM FAIL MOVE WRK-NE-6 TO COMPUTED-A MOVE "$*9.99  " TO
114900     CORRECT-A PERFORM PRINT-DETAIL.
115000*
115100 SUB-INIT-F2-28.
115200*    ==-->   MULTIPLE RESULT FIELDS   <--==
115300*    ==-->          SIZE ERROR        <--==
115400     MOVE   "VI-67 6.4.2"       TO ANSI-REFERENCE.
115500     MOVE   "SUB-TEST-F2-28"    TO PAR-NAME.
115600     MOVE    10    TO WRK-DU-2V0-1.
115700     MOVE    22.33 TO WRK-DS-2V2-1.
115800     MOVE    .3    TO WRK-DU-0V1-1.
115900     MOVE    ZERO  TO WRK-DS-2V2-2.
116000     MOVE    ZERO  TO WRK-DS-2V1-1.
116100     MOVE    ZERO  TO WRK-NE-4.
116200     MOVE    ZERO  TO WRK-NE-5
116300     MOVE    ZERO  TO WRK-NE-6.
116400     MOVE    ZERO  TO REC-CT.
116500     MOVE    SPACE TO SIZE-ERR2.
116600 SUB-TEST-F2-28-0.
116700     SUBTRACT A16TWOS-DS-16V00
116800              2 WRK-DU-0V1-1 .04
116900         FROM WRK-DS-2V2-1
117000       GIVING WRK-DS-2V2-2 WRK-DS-2V1-1 ROUNDED WRK-NE-4
117100              WRK-NE-5 WRK-NE-6 ROUNDED
117200           ON SIZE ERROR
117300              MOVE   "A" TO SIZE-ERR2.
117400     GO TO   SUB-TEST-F2-28-1.
117500 SUB-DELETE-F2-28.
117600     PERFORM DE-LETE.
117700     PERFORM PRINT-DETAIL.
117800     GO TO   SUB-INIT-F2-29.
117900 SUB-TEST-F2-28-1.
118000     MOVE    "SUB-TEST-F2-28-1" TO PAR-NAME.
118100     MOVE 1 TO REC-CT.
118200     IF WRK-DS-2V2-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
118300     ELSE
118400     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE ZERO
118500     TO CORRECT-N PERFORM PRINT-DETAIL.
118600     ADD 1 TO REC-CT.
118700 SUB-TEST-F2-28-2.
118800     MOVE    "SUB-TEST-F2-28-2" TO PAR-NAME.
118900     IF WRK-DS-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
119000     ELSE
119100     PERFORM FAIL MOVE WRK-DS-2V1-1 TO COMPUTED-N MOVE ZERO
119200     TO CORRECT-N PERFORM PRINT-DETAIL.
119300     ADD 1 TO REC-CT.
119400 SUB-TEST-F2-28-3.
119500     MOVE    "SUB-TEST-F2-28-3" TO PAR-NAME.
119600     IF WRK-NE-4 = "$*0.00" PERFORM PASS PERFORM PRINT-DETAIL
119700     ELSE
119800     PERFORM FAIL MOVE WRK-NE-4 TO COMPUTED-A MOVE "$*0.00" TO
119900     CORRECT-X PERFORM PRINT-DETAIL.
120000     ADD 1 TO REC-CT.
120100 SUB-TEST-F2-28-4.
120200     MOVE    "SUB-TEST-F2-28-4" TO PAR-NAME.
120300     IF WRK-NE-5 = "*.**" PERFORM PASS PERFORM PRINT-DETAIL
120400     ELSE
120500     PERFORM FAIL MOVE WRK-NE-5 TO COMPUTED-A MOVE "*.**"
120600     TO CORRECT-X PERFORM PRINT-DETAIL.
120700     ADD 1 TO REC-CT.
120800 SUB-TEST-F2-28-5.
120900     MOVE   "SUB-TEST-F2-28-5" TO PAR-NAME.
121000     IF WRK-NE-6 = "***.****"
121100           PERFORM PASS  PERFORM PRINT-DETAIL
121200     ELSE
121300     PERFORM FAIL MOVE WRK-NE-6 TO COMPUTED-A MOVE "***.****"
121400     TO CORRECT-X PERFORM PRINT-DETAIL.
121500     ADD 1 TO REC-CT.
121600 SUB-TEST-F2-28-6.
121700     MOVE   "SUB-TEST-F2-28-6" TO PAR-NAME.
121800     IF      SIZE-ERR2 = "A"
121900             PERFORM PASS
122000             PERFORM PRINT-DETAIL
122100     ELSE
122200             MOVE   "A"        TO CORRECT-X
122300             MOVE    SIZE-ERR2 TO COMPUTED-X
122400             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
122500                  TO RE-MARK
122600             PERFORM FAIL
122700             PERFORM PRINT-DETAIL.
122800*
122900 SUB-INIT-F2-29.
123000*    ==-->   MULTIPLE RESULT FIELDS   <--==
123100*    ==-->       NO SIZE ERROR        <--==
123200     MOVE   "VI-67 6.4.2"       TO ANSI-REFERENCE.
123300     MOVE   "SUB-TEST-F2-29"    TO PAR-NAME.
123400     MOVE    10    TO WRK-DU-2V0-1.
123500     MOVE    22.33 TO WRK-DS-2V2-1.
123600     MOVE    .3    TO WRK-DU-0V1-1.
123700     MOVE    ZERO  TO WRK-DS-2V2-2.
123800     MOVE    ZERO  TO WRK-DS-2V1-1.
123900     MOVE    ZERO  TO WRK-NE-4.
124000     MOVE    ZERO  TO WRK-NE-6.
124100     MOVE    ZERO  TO REC-CT.
124200     MOVE    SPACE TO SIZE-ERR2.
124300 SUB-TEST-F2-29-0.
124400     SUBTRACT WRK-DU-2V0-1  2 WRK-DU-0V1-1 .04 FROM WRK-DS-2V2-1
124500         GIVING WRK-DS-2V2-2 WRK-DS-2V1-1 ROUNDED WRK-NE-4
124600                WRK-NE-6 ROUNDED
124700          ON SIZE ERROR
124800             MOVE   "A" TO SIZE-ERR2.
124900     GO TO   SUB-TEST-F2-29-1.
125000 SUB-DELETE-F2-29.
125100     PERFORM DE-LETE.
125200     PERFORM PRINT-DETAIL.
125300     GO TO   SUB-INIT-F2-30.
125400 SUB-TEST-F2-29-1.
125500     MOVE    "SUB-TEST-F2-29-1" TO PAR-NAME.
125600     MOVE 1 TO REC-CT.
125700     IF WRK-DS-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
125800     ELSE
125900     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE 09.99
126000     TO CORRECT-N PERFORM PRINT-DETAIL.
126100     ADD 1 TO REC-CT.
126200 SUB-TEST-F2-29-2.
126300     MOVE    "SUB-TEST-F2-29-2" TO PAR-NAME.
126400     IF WRK-DS-2V1-1 = 10.0 PERFORM PASS PERFORM PRINT-DETAIL
126500     ELSE
126600     PERFORM FAIL MOVE WRK-DS-2V1-1 TO COMPUTED-N MOVE 10.0
126700     TO CORRECT-N PERFORM PRINT-DETAIL.
126800     ADD 1 TO REC-CT.
126900 SUB-TEST-F2-29-3.
127000     MOVE    "SUB-TEST-F2-29-3" TO PAR-NAME.
127100     IF WRK-NE-4 = "$*9.99" PERFORM PASS PERFORM PRINT-DETAIL
127200     ELSE
127300     PERFORM FAIL MOVE WRK-NE-4 TO COMPUTED-A MOVE "$*9.99" TO
127400     CORRECT-A PERFORM PRINT-DETAIL.
127500     ADD 1 TO REC-CT.
127600 SUB-TEST-F2-29-4.
127700     MOVE    "SUB-TEST-F2-29-4" TO PAR-NAME.
127800     IF WRK-NE-6 = "$*9.99  " PERFORM PASS PERFORM PRINT-DETAIL
127900     ELSE
128000     PERFORM FAIL MOVE WRK-NE-6 TO COMPUTED-A MOVE "$*9.99  " TO
128100     CORRECT-A PERFORM PRINT-DETAIL.
128200     ADD 1 TO REC-CT.
128300 SUB-TEST-F2-29-5.
128400     MOVE    "SUB-TEST-F2-29-5" TO PAR-NAME.
128500     IF      SIZE-ERR2  = SPACE
128600             PERFORM PASS
128700             PERFORM PRINT-DETAIL
128800     ELSE
128900             MOVE    SPACE     TO CORRECT-X
129000             MOVE    SIZE-ERR2 TO COMPUTED-X
129100             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
129200                  TO RE-MARK
129300             PERFORM FAIL
129400             PERFORM PRINT-DETAIL.
129500*
129600 SUB-INIT-F2-30.
129700*    ==-->   MULTIPLE RESULT FIELDS   <--==
129800*    ==-->          SIZE ERROR        <--==
129900     MOVE   "VI-67 6.4.2"       TO ANSI-REFERENCE.
130000     MOVE   "SUB-TEST-F2-30"    TO PAR-NAME.
130100     MOVE    10    TO WRK-DU-2V0-1.
130200     MOVE    22.33 TO WRK-DS-2V2-1.
130300     MOVE    .3    TO WRK-DU-0V1-1.
130400     MOVE    ZERO  TO WRK-DS-2V2-2.
130500     MOVE    ZERO  TO WRK-DS-2V1-1.
130600     MOVE    ZERO  TO WRK-NE-4.
130700     MOVE    ZERO  TO WRK-NE-5
130800     MOVE    ZERO  TO WRK-NE-6.
130900     MOVE    ZERO  TO REC-CT.
131000     MOVE    SPACE TO SIZE-ERR2.
131100 SUB-TEST-F2-30-0.
131200     SUBTRACT A16TWOS-DS-16V00
131300              2 WRK-DU-0V1-1 .04
131400         FROM WRK-DS-2V2-1
131500       GIVING WRK-DS-2V2-2 WRK-DS-2V1-1 ROUNDED WRK-NE-4
131600              WRK-NE-5 WRK-NE-6 ROUNDED
131700       NOT ON SIZE ERROR
131800              MOVE   "A" TO SIZE-ERR2.
131900     GO TO   SUB-TEST-F2-30-1.
132000 SUB-DELETE-F2-30.
132100     PERFORM DE-LETE.
132200     PERFORM PRINT-DETAIL.
132300     GO TO   SUB-INIT-F2-31.
132400 SUB-TEST-F2-30-1.
132500     MOVE    "SUB-TEST-F2-30-1" TO PAR-NAME.
132600     MOVE 1 TO REC-CT.
132700     IF WRK-DS-2V2-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
132800     ELSE
132900     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE ZERO
133000     TO CORRECT-N PERFORM PRINT-DETAIL.
133100     ADD 1 TO REC-CT.
133200 SUB-TEST-F2-30-2.
133300     MOVE    "SUB-TEST-F2-30-2" TO PAR-NAME.
133400     IF WRK-DS-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
133500     ELSE
133600     PERFORM FAIL MOVE WRK-DS-2V1-1 TO COMPUTED-N MOVE ZERO
133700     TO CORRECT-N PERFORM PRINT-DETAIL.
133800     ADD 1 TO REC-CT.
133900 SUB-TEST-F2-30-3.
134000     MOVE    "SUB-TEST-F2-30-3" TO PAR-NAME.
134100     IF WRK-NE-4 = "$*0.00" PERFORM PASS PERFORM PRINT-DETAIL
134200     ELSE
134300     PERFORM FAIL MOVE WRK-NE-4 TO COMPUTED-A MOVE "$*0.00" to
134400     CORRECT-X PERFORM PRINT-DETAIL.
134500     ADD 1 TO REC-CT.
134600 SUB-TEST-F2-30-4.
134700     MOVE    "SUB-TEST-F2-30-4" TO PAR-NAME.
134800     IF WRK-NE-5 = "*.**" PERFORM PASS PERFORM PRINT-DETAIL
134900     ELSE
135000     PERFORM FAIL MOVE WRK-NE-5 TO COMPUTED-A MOVE "*.**"
135100     TO CORRECT-X PERFORM PRINT-DETAIL.
135200     ADD 1 TO REC-CT.
135300 SUB-TEST-F2-30-5.
135400     MOVE   "SUB-TEST-F2-30-5" TO PAR-NAME.
135500     IF WRK-NE-6 = "***.****"
135600        PERFORM PASS PERFORM PRINT-DETAIL
135700     ELSE
135800     PERFORM FAIL MOVE WRK-NE-6 TO COMPUTED-A MOVE "***.****"
135900     TO CORRECT-X PERFORM PRINT-DETAIL.
136000     ADD 1 TO REC-CT.
136100 SUB-TEST-F2-30-6.
136200     MOVE   "SUB-TEST-F2-30-6" TO PAR-NAME.
136300     IF      SIZE-ERR2 = SPACE
136400             PERFORM PASS
136500             PERFORM PRINT-DETAIL
136600     ELSE
136700             MOVE    SPACE     TO CORRECT-X
136800             MOVE    SIZE-ERR2 TO COMPUTED-X
136900             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
137000                  TO RE-MARK
137100             PERFORM FAIL
137200             PERFORM PRINT-DETAIL.
137300*
137400 SUB-INIT-F2-31.
137500*    ==-->   MULTIPLE RESULT FIELDS   <--==
137600*    ==-->       NO SIZE ERROR        <--==
137700     MOVE   "VI-67 6.4.2"       TO ANSI-REFERENCE.
137800     MOVE   "SUB-TEST-F2-31"    TO PAR-NAME.
137900     MOVE    10    TO WRK-DU-2V0-1.
138000     MOVE    22.33 TO WRK-DS-2V2-1.
138100     MOVE    .3    TO WRK-DU-0V1-1.
138200     MOVE    ZERO  TO WRK-DS-2V2-2.
138300     MOVE    ZERO  TO WRK-DS-2V1-1.
138400     MOVE    ZERO  TO WRK-NE-4.
138500     MOVE    ZERO  TO WRK-NE-6.
138600     MOVE    ZERO  TO REC-CT.
138700     MOVE    SPACE TO SIZE-ERR2.
138800 SUB-TEST-F2-31-0.
138900     SUBTRACT WRK-DU-2V0-1  2 WRK-DU-0V1-1 .04 FROM WRK-DS-2V2-1
139000         GIVING WRK-DS-2V2-2 WRK-DS-2V1-1 ROUNDED WRK-NE-4
139100                WRK-NE-6 ROUNDED
139200      NOT ON SIZE ERROR
139300             MOVE   "A" TO SIZE-ERR2.
139400     GO TO   SUB-TEST-F2-31-1.
139500 SUB-DELETE-F2-31.
139600     PERFORM DE-LETE.
139700     PERFORM PRINT-DETAIL.
139800     GO TO   SUB-INIT-F2-32.
139900 SUB-TEST-F2-31-1.
140000     MOVE    "SUB-TEST-F2-31-1" TO PAR-NAME.
140100     MOVE 1 TO REC-CT.
140200     IF WRK-DS-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
140300     ELSE
140400     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE 09.99
140500     TO CORRECT-N PERFORM PRINT-DETAIL.
140600     ADD 1 TO REC-CT.
140700 SUB-TEST-F2-31-2.
140800     MOVE    "SUB-TEST-F2-31-2" TO PAR-NAME.
140900     IF WRK-DS-2V1-1 = 10.0 PERFORM PASS PERFORM PRINT-DETAIL
141000     ELSE
141100     PERFORM FAIL MOVE WRK-DS-2V1-1 TO COMPUTED-N MOVE 10.0
141200     TO CORRECT-N PERFORM PRINT-DETAIL.
141300     ADD 1 TO REC-CT.
141400 SUB-TEST-F2-31-3.
141500     MOVE    "SUB-TEST-F2-31-3" TO PAR-NAME.
141600     IF WRK-NE-4 = "$*9.99" PERFORM PASS PERFORM PRINT-DETAIL
141700     ELSE
141800     PERFORM FAIL MOVE WRK-NE-4 TO COMPUTED-A MOVE "$*9.99" TO
141900     CORRECT-A PERFORM PRINT-DETAIL.
142000     ADD 1 TO REC-CT.
142100 SUB-TEST-F2-31-4.
142200     MOVE    "SUB-TEST-F2-31-4" TO PAR-NAME.
142300     IF WRK-NE-6 = "$*9.99  " PERFORM PASS PERFORM PRINT-DETAIL
142400     ELSE
142500     PERFORM FAIL MOVE WRK-NE-6 TO COMPUTED-A MOVE "$*9.99  " TO
142600     CORRECT-A PERFORM PRINT-DETAIL.
142700     ADD 1 TO REC-CT.
142800 SUB-TEST-F2-31-5.
142900     MOVE    "SUB-TEST-F2-31-5" TO PAR-NAME.
143000     IF      SIZE-ERR2  = "A"
143100             PERFORM PASS
143200             PERFORM PRINT-DETAIL
143300     ELSE
143400             MOVE   "A"        TO CORRECT-X
143500             MOVE    SIZE-ERR2 TO COMPUTED-X
143600             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
143700                  TO RE-MARK
143800             PERFORM FAIL
143900             PERFORM PRINT-DETAIL.
144000*
144100 SUB-INIT-F2-32.
144200*    ==-->   MULTIPLE RESULT FIELDS   <--==
144300*    ==-->          SIZE ERROR        <--==
144400     MOVE   "VI-67 6.4.2"       TO ANSI-REFERENCE.
144500     MOVE   "SUB-TEST-F2-32"    TO PAR-NAME.
144600     MOVE    10    TO WRK-DU-2V0-1.
144700     MOVE    22.33 TO WRK-DS-2V2-1.
144800     MOVE    .3    TO WRK-DU-0V1-1.
144900     MOVE    ZERO  TO WRK-DS-2V2-2.
145000     MOVE    ZERO  TO WRK-DS-2V1-1.
145100     MOVE    ZERO  TO WRK-NE-4.
145200     MOVE    ZERO  TO WRK-NE-5
145300     MOVE    ZERO  TO WRK-NE-6.
145400     MOVE    ZERO  TO REC-CT.
145500     MOVE    SPACE TO SIZE-ERR2.
145600 SUB-TEST-F2-32-0.
145700     SUBTRACT A16TWOS-DS-16V00
145800              2 WRK-DU-0V1-1 .04
145900         FROM WRK-DS-2V2-1
146000       GIVING WRK-DS-2V2-2 WRK-DS-2V1-1 ROUNDED WRK-NE-4
146100              WRK-NE-5 WRK-NE-6 ROUNDED
146200           ON SIZE ERROR
146300              MOVE   "A" TO SIZE-ERR2
146400       NOT ON SIZE ERROR
146500              MOVE   "B" TO SIZE-ERR2.
146600     GO TO   SUB-TEST-F2-32-1.
146700 SUB-DELETE-F2-32.
146800     PERFORM DE-LETE.
146900     PERFORM PRINT-DETAIL.
147000     GO TO   SUB-INIT-F2-33.
147100 SUB-TEST-F2-32-1.
147200     MOVE    "SUB-TEST-F2-32-1" TO PAR-NAME.
147300     MOVE 1 TO REC-CT.
147400     IF WRK-DS-2V2-2 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
147500     ELSE
147600     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE ZERO
147700     TO CORRECT-N PERFORM PRINT-DETAIL.
147800     ADD 1 TO REC-CT.
147900 SUB-TEST-F2-32-2.
148000     MOVE    "SUB-TEST-F2-32-2" TO PAR-NAME.
148100     IF WRK-DS-2V1-1 = ZERO PERFORM PASS PERFORM PRINT-DETAIL
148200     ELSE
148300     PERFORM FAIL MOVE WRK-DS-2V1-1 TO COMPUTED-N MOVE ZERO
148400     TO CORRECT-N PERFORM PRINT-DETAIL.
148500     ADD 1 TO REC-CT.
148600 SUB-TEST-F2-32-3.
148700     MOVE    "SUB-TEST-F2-32-3" TO PAR-NAME.
148800     IF WRK-NE-4 = "$*0.00" PERFORM PASS PERFORM PRINT-DETAIL
148900     ELSE
149000     PERFORM FAIL MOVE WRK-NE-4 TO COMPUTED-A MOVE "$*0.00"
149100     TO CORRECT-X PERFORM PRINT-DETAIL.
149200     ADD 1 TO REC-CT.
149300 SUB-TEST-F2-32-4.
149400     MOVE    "SUB-TEST-F2-32-4" TO PAR-NAME.
149500     IF WRK-NE-5 = "*.**" PERFORM PASS PERFORM PRINT-DETAIL
149600     ELSE
149700     PERFORM FAIL MOVE WRK-NE-5 TO COMPUTED-A MOVE "*.**"
149800     TO CORRECT-X PERFORM PRINT-DETAIL.
149900     ADD 1 TO REC-CT.
150000 SUB-TEST-F2-32-5.
150100     MOVE   "SUB-TEST-F2-32-5" TO PAR-NAME.
150200     IF WRK-NE-6 = "***.****"
150300        PERFORM PASS  PERFORM PRINT-DETAIL
150400     ELSE
150500     PERFORM FAIL MOVE WRK-NE-6 TO COMPUTED-A MOVE "***.****"
150600     TO CORRECT-X PERFORM PRINT-DETAIL.
150700     ADD 1 TO REC-CT.
150800 SUB-TEST-F2-32-6.
150900     MOVE   "SUB-TEST-F2-32-6" TO PAR-NAME.
151000     IF      SIZE-ERR2 = "A"
151100             PERFORM PASS
151200             PERFORM PRINT-DETAIL
151300     ELSE
151400             MOVE   "A"        TO CORRECT-X
151500             MOVE    SIZE-ERR2 TO COMPUTED-X
151600             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
151700                  TO RE-MARK
151800             PERFORM FAIL
151900             PERFORM PRINT-DETAIL.
152000*
152100 SUB-INIT-F2-33.
152200*    ==-->   MULTIPLE RESULT FIELDS   <--==
152300*    ==-->       NO SIZE ERROR        <--==
152400     MOVE   "VI-67 6.4.2"       TO ANSI-REFERENCE.
152500     MOVE   "SUB-TEST-F2-33"    TO PAR-NAME.
152600     MOVE    10    TO WRK-DU-2V0-1.
152700     MOVE    22.33 TO WRK-DS-2V2-1.
152800     MOVE    .3    TO WRK-DU-0V1-1.
152900     MOVE    ZERO  TO WRK-DS-2V2-2.
153000     MOVE    ZERO  TO WRK-DS-2V1-1.
153100     MOVE    ZERO  TO WRK-NE-4.
153200     MOVE    ZERO  TO WRK-NE-6.
153300     MOVE    ZERO  TO REC-CT.
153400     MOVE    SPACE TO SIZE-ERR2.
153500 SUB-TEST-F2-33-0.
153600     SUBTRACT WRK-DU-2V0-1  2 WRK-DU-0V1-1 .04 FROM WRK-DS-2V2-1
153700         GIVING WRK-DS-2V2-2 WRK-DS-2V1-1 ROUNDED WRK-NE-4
153800                WRK-NE-6 ROUNDED
153900          ON SIZE ERROR
154000             MOVE   "A" TO SIZE-ERR2
154100      NOT ON SIZE ERROR
154200             MOVE   "B" TO SIZE-ERR2.
154300     GO TO   SUB-TEST-F2-33-1.
154400 SUB-DELETE-F2-33.
154500     PERFORM DE-LETE.
154600     PERFORM PRINT-DETAIL.
154700     GO TO   SUB-INIT-F2-34.
154800 SUB-TEST-F2-33-1.
154900     MOVE    "SUB-TEST-F2-33-1" TO PAR-NAME.
155000     MOVE 1 TO REC-CT.
155100     IF WRK-DS-2V2-2 = 09.99 PERFORM PASS PERFORM PRINT-DETAIL
155200     ELSE
155300     PERFORM FAIL MOVE WRK-DS-2V2-2 TO COMPUTED-N MOVE 09.99
155400     TO CORRECT-N PERFORM PRINT-DETAIL.
155500     ADD 1 TO REC-CT.
155600 SUB-TEST-F2-33-2.
155700     MOVE    "SUB-TEST-F2-33-2" TO PAR-NAME.
155800     IF WRK-DS-2V1-1 = 10.0 PERFORM PASS PERFORM PRINT-DETAIL
155900     ELSE
156000     PERFORM FAIL MOVE WRK-DS-2V1-1 TO COMPUTED-N MOVE 10.0
156100     TO CORRECT-N PERFORM PRINT-DETAIL.
156200     ADD 1 TO REC-CT.
156300 SUB-TEST-F2-33-3.
156400     MOVE    "SUB-TEST-F2-33-3" TO PAR-NAME.
156500     IF WRK-NE-4 = "$*9.99" PERFORM PASS PERFORM PRINT-DETAIL
156600     ELSE
156700     PERFORM FAIL MOVE WRK-NE-4 TO COMPUTED-A MOVE "$*9.99" TO
156800     CORRECT-A PERFORM PRINT-DETAIL.
156900     ADD 1 TO REC-CT.
157000 SUB-TEST-F2-33-4.
157100     MOVE    "SUB-TEST-F2-33-4" TO PAR-NAME.
157200     IF WRK-NE-6 = "$*9.99  " PERFORM PASS PERFORM PRINT-DETAIL
157300     ELSE
157400     PERFORM FAIL MOVE WRK-NE-6 TO COMPUTED-A MOVE "$*9.99  " TO
157500     CORRECT-A PERFORM PRINT-DETAIL.
157600     ADD 1 TO REC-CT.
157700 SUB-TEST-F2-33-5.
157800     MOVE    "SUB-TEST-F2-33-5" TO PAR-NAME.
157900     IF      SIZE-ERR2  = "B"
158000             PERFORM PASS
158100             PERFORM PRINT-DETAIL
158200     ELSE
158300             MOVE   "B"        TO CORRECT-X
158400             MOVE    SIZE-ERR2 TO COMPUTED-X
158500             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
158600                  TO RE-MARK
158700             PERFORM FAIL
158800             PERFORM PRINT-DETAIL.
158900*
159000 SUB-INIT-F2-34.
159100*    ==-->  EXPLICIT SCOPE TERMINATOR <--==
159200*    ==-->          SIZE ERROR        <--==
159300     MOVE   "IV-41 6.4.3"       TO ANSI-REFERENCE.
159400     MOVE     ZERO TO WRK-DS-10V00.
159500     MOVE    SPACE TO WRK-XN-00001.
159600     MOVE    SPACE TO SIZE-ERR2.
159700     MOVE    SPACE TO SIZE-ERR3.
159800     MOVE    SPACE TO SIZE-ERR4.
159900     MOVE    1  TO REC-CT.
160000 SUB-TEST-F2-34-0.
160100     SUBTRACT A12ONES-DS-12V00
160200        FROM ZERO GIVING WRK-DS-10V00
160300          ON SIZE ERROR
160400             MOVE   "1" TO WRK-XN-00001
160500             MOVE   "A" TO SIZE-ERR2
160600             MOVE   "B" TO SIZE-ERR3
160700     END-SUBTRACT
160800     MOVE   "C" TO SIZE-ERR4.
160900     GO TO   SUB-TEST-F2-34-1.
161000 SUB-DELETE-F2-34.
161100     PERFORM DE-LETE.
161200     PERFORM PRINT-DETAIL.
161300     GO TO   SUB-INIT-F2-35.
161400 SUB-TEST-F2-34-1.
161500     MOVE   "SUB-TEST-F2-34-1" TO PAR-NAME.
161600     IF      WRK-XN-00001 = "1"
161700             PERFORM PASS
161800             PERFORM PRINT-DETAIL
161900     ELSE
162000             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
162100                  TO RE-MARK
162200             MOVE   "1"           TO CORRECT-X
162300             MOVE    WRK-XN-00001 TO COMPUTED-X
162400             PERFORM FAIL
162500             PERFORM PRINT-DETAIL.
162600     ADD     1 TO REC-CT.
162700 SUB-TEST-F2-34-2.
162800     MOVE   "SUB-TEST-F2-34-2" TO PAR-NAME.
162900     IF      SIZE-ERR2 = "A"
163000             PERFORM PASS
163100             PERFORM PRINT-DETAIL
163200     ELSE
163300             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
163400                  TO RE-MARK
163500             MOVE   "A"        TO CORRECT-X
163600             MOVE    SIZE-ERR2 TO COMPUTED-X
163700             PERFORM FAIL
163800             PERFORM PRINT-DETAIL.
163900     ADD     1 TO REC-CT.
164000 SUB-TEST-F2-34-3.
164100     MOVE   "SUB-TEST-F2-34-3" TO PAR-NAME.
164200     IF      SIZE-ERR3 = "B"
164300             PERFORM PASS
164400             PERFORM PRINT-DETAIL
164500     ELSE
164600             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
164700                  TO RE-MARK
164800             MOVE   "B"        TO CORRECT-X
164900             MOVE    SIZE-ERR3 TO COMPUTED-X
165000             PERFORM FAIL
165100             PERFORM PRINT-DETAIL.
165200     ADD     1 TO REC-CT.
165300 SUB-TEST-F2-34-4.
165400     MOVE   "SUB-TEST-F2-34-4" TO PAR-NAME.
165500     IF      SIZE-ERR4 = "C"
165600             PERFORM PASS
165700             PERFORM PRINT-DETAIL
165800     ELSE
165900             MOVE   "SCOPE TERMINATOR IGNORED"
166000                  TO RE-MARK
166100             MOVE   "C"        TO CORRECT-X
166200             MOVE    SIZE-ERR4 TO COMPUTED-X
166300             PERFORM FAIL
166400             PERFORM PRINT-DETAIL
166500             ADD     1 TO REC-CT.
166600 SUB-TEST-F2-34-5.
166700     MOVE   "SUB-TEST-F2-34-5" TO PAR-NAME.
166800     IF      WRK-DS-10V00 = ZERO
166900             PERFORM PASS
167000             PERFORM PRINT-DETAIL
167100     ELSE
167200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
167300                  TO RE-MARK
167400             MOVE    ZERO         TO CORRECT-N
167500             MOVE    WRK-DS-10V00 TO COMPUTED-N
167600             PERFORM FAIL
167700             PERFORM PRINT-DETAIL.
167800*
167900 SUB-INIT-F2-35.
168000*    ==--> EXPLICIT SCOPE TERMINATOR<--==
168100     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
168200     MOVE   "SUB-TEST-F2-35"  TO PAR-NAME.
168300     MOVE    SPACE TO WRK-XN-00001.
168400     MOVE    SPACE TO SIZE-ERR2.
168500     MOVE    SPACE TO SIZE-ERR3.
168600     MOVE    SPACE TO SIZE-ERR4.
168700     MOVE    ZERO  TO WRK-DS-06V06.
168800     MOVE    1     TO REC-CT.
168900 SUB-TEST-F2-35-0.
169000     SUBTRACT A12THREES-DS-06V06
169100              333333
169200              A06THREES-DS-03V03
169300              -.0000009 FROM 0000000
169400      GIVING WRK-DS-06V06 ROUNDED
169500          ON SIZE ERROR
169600             MOVE   "1" TO WRK-XN-00001
169700             MOVE   "A" TO SIZE-ERR2
169800             MOVE   "B" TO SIZE-ERR3
169900     END-SUBTRACT
170000     MOVE   "C" TO SIZE-ERR4.
170100     GO TO   SUB-TEST-F2-35-1.
170200 SUB-DELETE-F2-35.
170300     PERFORM DE-LETE.
170400     PERFORM PRINT-DETAIL.
170500     GO TO   SUB-INIT-F2-36.
170600 SUB-TEST-F2-35-1.
170700     MOVE   "SUB-TEST-F2-35-1" TO PAR-NAME.
170800     IF      WRK-XN-00001 = SPACE
170900             PERFORM PASS
171000             PERFORM PRINT-DETAIL
171100     ELSE
171200             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
171300                  TO RE-MARK
171400             MOVE    SPACE        TO CORRECT-X
171500             MOVE    WRK-XN-00001 TO COMPUTED-X
171600             PERFORM FAIL
171700             PERFORM PRINT-DETAIL.
171800     ADD     1 TO REC-CT.
171900 SUB-TEST-F2-35-2.
172000     MOVE   "SUB-TEST-F2-35-2" TO PAR-NAME.
172100     IF      SIZE-ERR2 = SPACE
172200             PERFORM PASS
172300             PERFORM PRINT-DETAIL
172400     ELSE
172500             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
172600                  TO RE-MARK
172700             MOVE    SPACE     TO CORRECT-X
172800             MOVE    SIZE-ERR2 TO COMPUTED-X
172900             PERFORM FAIL
173000             PERFORM PRINT-DETAIL.
173100     ADD     1 TO REC-CT.
173200 SUB-TEST-F2-35-3.
173300     MOVE   "SUB-TEST-F2-35-3" TO PAR-NAME.
173400     IF      SIZE-ERR3 = SPACE
173500             PERFORM PASS
173600             PERFORM PRINT-DETAIL
173700     ELSE
173800             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
173900                  TO RE-MARK
174000             MOVE    SPACE     TO CORRECT-X
174100             MOVE    SIZE-ERR3 TO COMPUTED-X
174200             PERFORM FAIL
174300             PERFORM PRINT-DETAIL.
174400     ADD     1 TO REC-CT.
174500 SUB-TEST-F2-35-4.
174600     MOVE   "SUB-TEST-F2-35-4" TO PAR-NAME.
174700     IF      SIZE-ERR4 = "C"
174800             PERFORM PASS
174900             PERFORM PRINT-DETAIL
175000     ELSE
175100             MOVE   "SCOPE TERMINATOR IGNORED"
175200                  TO RE-MARK
175300             MOVE   "C"        TO CORRECT-X
175400             MOVE    SIZE-ERR4 TO COMPUTED-X
175500             PERFORM FAIL
175600             PERFORM PRINT-DETAIL.
175700     ADD     1 TO REC-CT.
175800 SUB-TEST-F2-35-5.
175900     MOVE   "SUB-TEST-F1-35-5" TO PAR-NAME.
176000     IF      WRK-DS-06V06 = -666999.666332
176100             PERFORM PASS
176200             PERFORM PRINT-DETAIL
176300     ELSE
176400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
176500                  TO RE-MARK
176600             MOVE   -666999.666332 TO CORRECT-N
176700             MOVE    WRK-DS-06V06  TO COMPUTED-N
176800             PERFORM FAIL
176900             PERFORM PRINT-DETAIL.
177000*
177100 SUB-INIT-F2-36.
177200*    ==--> EXPLICIT SCOPE TERMINATOR<--==
177300     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
177400     MOVE   "SUB-TEST-F2-36"  TO PAR-NAME.
177500     MOVE   SPACE TO WRK-XN-00001.
177600     MOVE   SPACE TO SIZE-ERR2.
177700     MOVE   SPACE TO SIZE-ERR3.
177800     MOVE   SPACE TO SIZE-ERR4.
177900     MOVE   ZERO  TO WRK-DS-10V00.
178000     MOVE       1 TO REC-CT.
178100 SUB-TEST-F2-36-0.
178200     SUBTRACT A12ONES-DS-12V00
178300        FROM ZERO GIVING WRK-DS-10V00
178400         NOT ON SIZE ERROR
178500             MOVE   "1" TO WRK-XN-00001
178600             MOVE   "A" TO SIZE-ERR2
178700             MOVE   "B" TO SIZE-ERR3
178800     END-SUBTRACT
178900     MOVE   "C" TO SIZE-ERR4.
179000     GO TO   SUB-TEST-F2-36-1.
179100 SUB-DELETE-F2-36.
179200     PERFORM DE-LETE.
179300     PERFORM PRINT-DETAIL.
179400     GO      TO SUB-INIT-F2-37.
179500 SUB-TEST-F2-36-1.
179600     MOVE   "SUB-TEST-F2-36-1" TO PAR-NAME.
179700     IF      WRK-XN-00001 = SPACE
179800             PERFORM PASS
179900             PERFORM PRINT-DETAIL
180000     ELSE
180100             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
180200                  TO RE-MARK
180300             MOVE    SPACE        TO CORRECT-X
180400             MOVE    WRK-XN-00001 TO COMPUTED-X
180500             PERFORM FAIL
180600             PERFORM PRINT-DETAIL.
180700     ADD     1 TO REC-CT.
180800 SUB-TEST-F2-36-2.
180900     MOVE   "SUB-TEST-F2-36-2" TO PAR-NAME.
181000     IF      SIZE-ERR2 = SPACE
181100             PERFORM PASS
181200             PERFORM PRINT-DETAIL
181300     ELSE
181400             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
181500                  TO RE-MARK
181600             MOVE    SPACE     TO CORRECT-X
181700             MOVE    SIZE-ERR2 TO COMPUTED-X
181800             PERFORM FAIL
181900             PERFORM PRINT-DETAIL.
182000     ADD     1 TO REC-CT.
182100 SUB-TEST-F2-36-3.
182200     MOVE   "SUB-TEST-F2-36-3" TO PAR-NAME.
182300     IF      SIZE-ERR3 = SPACE
182400             PERFORM PASS
182500             PERFORM PRINT-DETAIL
182600     ELSE
182700             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
182800                  TO RE-MARK
182900             MOVE    SPACE     TO CORRECT-X
183000             MOVE    SIZE-ERR3 TO COMPUTED-X
183100             PERFORM FAIL
183200             PERFORM PRINT-DETAIL.
183300     ADD     1 TO REC-CT.
183400 SUB-TEST-F2-36-4.
183500     MOVE   "SUB-TEST-F2-36-4" TO PAR-NAME.
183600     IF      SIZE-ERR4 = "C"
183700             PERFORM PASS
183800             PERFORM PRINT-DETAIL
183900     ELSE
184000             MOVE   "SCOPE TERMINATOR IGNORED"
184100                  TO RE-MARK
184200             MOVE   "C"        TO CORRECT-X
184300             MOVE    SIZE-ERR4 TO COMPUTED-X
184400             PERFORM FAIL
184500             PERFORM PRINT-DETAIL
184600             ADD     1 TO REC-CT.
184700 SUB-TEST-F2-36-5.
184800     MOVE   "SUB-TEST-F2-36-5" TO PAR-NAME.
184900     IF      WRK-DS-10V00 = ZERO
185000             PERFORM PASS
185100             PERFORM PRINT-DETAIL
185200     ELSE
185300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
185400                  TO RE-MARK
185500             MOVE    ZERO         TO CORRECT-N
185600             MOVE    WRK-DS-10V00 TO COMPUTED-N
185700             PERFORM FAIL
185800             PERFORM PRINT-DETAIL.
185900*
186000 SUB-INIT-F2-37.
186100*    ==--> EXPLICIT SCOPE TERMINATOR<--==
186200     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
186300     MOVE   "SUB-TEST-F2-37"  TO PAR-NAME.
186400     MOVE    SPACE TO WRK-XN-00001.
186500     MOVE    SPACE TO SIZE-ERR2.
186600     MOVE    SPACE TO SIZE-ERR3.
186700     MOVE    SPACE TO SIZE-ERR4.
186800     MOVE    ZERO  TO WRK-DS-06V06.
186900     MOVE    1     TO REC-CT.
187000 SUB-TEST-F2-37-0.
187100     SUBTRACT A12THREES-DS-06V06
187200              333333
187300              A06THREES-DS-03V03
187400              -.0000009 FROM 0000000
187500      GIVING WRK-DS-06V06 ROUNDED
187600         NOT ON SIZE ERROR
187700             MOVE   "1" TO WRK-XN-00001
187800             MOVE   "A" TO SIZE-ERR2
187900             MOVE   "B" TO SIZE-ERR3
188000     END-SUBTRACT
188100     MOVE   "C" TO SIZE-ERR4.
188200     GO TO   SUB-TEST-F2-37-1.
188300 SUB-DELETE-F2-37.
188400     PERFORM DE-LETE.
188500     PERFORM PRINT-DETAIL.
188600     GO TO   SUB-INIT-F2-38.
188700 SUB-TEST-F2-37-1.
188800     MOVE   "SUB-TEST-F2-37-1" TO PAR-NAME.
188900     IF      WRK-XN-00001 = "1"
189000             PERFORM PASS
189100             PERFORM PRINT-DETAIL
189200     ELSE
189300             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
189400                  TO RE-MARK
189500             MOVE   "1"           TO CORRECT-X
189600             MOVE    WRK-XN-00001 TO COMPUTED-X
189700             PERFORM FAIL
189800             PERFORM PRINT-DETAIL.
189900     ADD     1 TO REC-CT.
190000 SUB-TEST-F2-37-2.
190100     MOVE   "SUB-TEST-F2-37-2" TO PAR-NAME.
190200     IF      SIZE-ERR2 = "A"
190300             PERFORM PASS
190400             PERFORM PRINT-DETAIL
190500     ELSE
190600             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
190700                  TO RE-MARK
190800             MOVE   "A"        TO CORRECT-X
190900             MOVE    SIZE-ERR2 TO COMPUTED-X
191000             PERFORM FAIL
191100             PERFORM PRINT-DETAIL.
191200     ADD     1 TO REC-CT.
191300 SUB-TEST-F2-37-3.
191400     MOVE   "SUB-TEST-F2-37-3" TO PAR-NAME.
191500     IF      SIZE-ERR3 = "B"
191600             PERFORM PASS
191700             PERFORM PRINT-DETAIL
191800     ELSE
191900             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
192000                  TO RE-MARK
192100             MOVE   "B"        TO CORRECT-X
192200             MOVE    SIZE-ERR3 TO COMPUTED-X
192300             PERFORM FAIL
192400             PERFORM PRINT-DETAIL.
192500     ADD     1 TO REC-CT.
192600 SUB-TEST-F2-37-4.
192700     MOVE   "SUB-TEST-F2-37-4" TO PAR-NAME.
192800     IF      SIZE-ERR4 = "C"
192900             PERFORM PASS
193000             PERFORM PRINT-DETAIL
193100     ELSE
193200             MOVE   "SCOPE TERMINATOR IGNORED"
193300                  TO RE-MARK
193400             MOVE   "C"        TO CORRECT-X
193500             MOVE    SIZE-ERR4 TO COMPUTED-X
193600             PERFORM FAIL
193700             PERFORM PRINT-DETAIL.
193800     ADD     1 TO REC-CT.
193900 SUB-TEST-F2-37-5.
194000     MOVE   "SUB-TEST-F2-37-5" TO PAR-NAME.
194100     IF      WRK-DS-06V06 = -666999.666332
194200             PERFORM PASS
194300             PERFORM PRINT-DETAIL
194400     ELSE
194500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
194600                  TO RE-MARK
194700             MOVE   -666999.666332 TO CORRECT-N
194800             MOVE    WRK-DS-06V06  TO COMPUTED-N
194900             PERFORM FAIL
195000             PERFORM PRINT-DETAIL.
195100*
195200 SUB-INIT-F2-38.
195300*    ==--> EXPLICIT SCOPE TERMINATOR<--==
195400     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
195500     MOVE   "SUB-TEST-F2-38"  TO PAR-NAME.
195600     MOVE   "0"   TO WRK-XN-00001.
195700     MOVE   "0"   TO SIZE-ERR4.
195800     MOVE    ZERO TO WRK-DS-10V00.
195900     MOVE    1    TO REC-CT.
196000 SUB-TEST-F2-38-0.
196100     SUBTRACT A12ONES-DS-12V00
196200        FROM ZERO GIVING WRK-DS-10V00
196300          ON SIZE ERROR
196400             MOVE   SPACE TO WRK-XN-00001
196500      NOT ON SIZE ERROR
196600             MOVE   "1" TO WRK-XN-00001
196700     END-SUBTRACT
196800     MOVE   "C" TO SIZE-ERR4.
196900     GO TO   SUB-TEST-F2-38-1.
197000 SUB-DELETE-F2-38.
197100     PERFORM DE-LETE.
197200     PERFORM PRINT-DETAIL.
197300     GO TO   SUB-INIT-F2-39.
197400 SUB-TEST-F2-38-1.
197500     MOVE   "SUB-TEST-F2-38-1" TO PAR-NAME.
197600     IF      WRK-XN-00001 = SPACE
197700             PERFORM PASS
197800             PERFORM PRINT-DETAIL
197900     ELSE
198000             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
198100                  TO RE-MARK
198200             MOVE    SPACE        TO CORRECT-X
198300             MOVE    WRK-XN-00001 TO COMPUTED-X
198400             PERFORM FAIL
198500             PERFORM PRINT-DETAIL.
198600     ADD     1 TO REC-CT.
198700 SUB-TEST-F2-38-2.
198800     MOVE   "SUB-TEST-F2-38-2" TO PAR-NAME.
198900     IF      SIZE-ERR4 = "C"
199000             PERFORM PASS
199100             PERFORM PRINT-DETAIL
199200     ELSE
199300             MOVE   "SCOPE TERMINATOR IGNORED"
199400                  TO RE-MARK
199500             MOVE   "C"        TO CORRECT-X
199600             MOVE    SIZE-ERR4 TO COMPUTED-X
199700             PERFORM FAIL
199800             PERFORM PRINT-DETAIL.
199900     ADD     1 TO REC-CT.
200000 SUB-TEST-F2-38-3.
200100     MOVE   "SUB-TEST-F2-38-3" TO PAR-NAME.
200200     IF      WRK-DS-10V00 = ZERO
200300             PERFORM PASS
200400             PERFORM PRINT-DETAIL
200500     ELSE
200600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
200700                  TO RE-MARK
200800             MOVE    ZERO         TO CORRECT-N
200900             MOVE    WRK-DS-02V00 TO COMPUTED-N
201000             PERFORM FAIL
201100             PERFORM PRINT-DETAIL.
201200*
201300 SUB-INIT-F2-39.
201400*    ==--> EXPLICIT SCOPE TERMINATOR<--==
201500     MOVE   "IV-41 6.4.3"     TO ANSI-REFERENCE.
201600     MOVE   "SUB-TEST-F2-39"  TO PAR-NAME.
201700     MOVE    SPACE TO WRK-XN-00001.
201800     MOVE    SPACE TO SIZE-ERR4.
201900     MOVE    ZERO  TO WRK-DS-06V06.
202000     MOVE    1     TO REC-CT.
202100 SUB-TEST-F2-39-0.
202200     SUBTRACT A12THREES-DS-06V06
202300              333333
202400              A06THREES-DS-03V03
202500              -.0000009 FROM 0000000
202600      GIVING WRK-DS-06V06 ROUNDED
202700             ON SIZE ERROR
202800             MOVE   "X" TO WRK-XN-00001
202900         NOT ON SIZE ERROR
203000             MOVE   "1" TO WRK-XN-00001
203100     END-SUBTRACT
203200     MOVE   "C" TO SIZE-ERR4.
203300     GO TO   SUB-TEST-F2-39-1.
203400 SUB-DELETE-F2-39.
203500     PERFORM DE-LETE.
203600     PERFORM PRINT-DETAIL.
203700     GO TO   CCVS-EXIT.
203800 SUB-TEST-F2-39-1.
203900     MOVE   "SUB-TEST-F2-39-1" TO PAR-NAME.
204000     IF      WRK-XN-00001 = "1"
204100             PERFORM PASS
204200             PERFORM PRINT-DETAIL
204300     ELSE
204400             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
204500                  TO RE-MARK
204600             MOVE   "1"           TO CORRECT-X
204700             MOVE    WRK-XN-00001 TO COMPUTED-X
204800             PERFORM FAIL
204900             PERFORM PRINT-DETAIL.
205000     ADD     1 TO REC-CT.
205100 SUB-TEST-F2-39-2.
205200     MOVE   "SUB-TEST-F2-39-2" TO PAR-NAME.
205300     IF      SIZE-ERR4 = "C"
205400             PERFORM PASS
205500             PERFORM PRINT-DETAIL
205600     ELSE
205700             MOVE   "SCOPE TERMINATOR IGNORED"
205800                  TO RE-MARK
205900             MOVE   "C"        TO CORRECT-X
206000             MOVE    SIZE-ERR4 TO COMPUTED-X
206100             PERFORM FAIL
206200             PERFORM PRINT-DETAIL.
206300     ADD     1 TO REC-CT.
206400 SUB-TEST-F2-39-3.
206500     MOVE   "SUB-TEST-F2-39-3" TO PAR-NAME.
206600     IF      WRK-DS-06V06 = -666999.666332
206700             PERFORM PASS
206800             PERFORM PRINT-DETAIL
206900     ELSE
207000             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
207100                  TO RE-MARK
207200             MOVE   -666999.666332 TO CORRECT-N
207300             MOVE    WRK-DS-06V06  TO COMPUTED-N
207400             PERFORM FAIL
207500             PERFORM PRINT-DETAIL.
207600*
207700 CCVS-EXIT SECTION.
207800 CCVS-999999.
207900     GO TO CLOSE-FILES.
