000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC173A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*    THIS PROGRAM TESTS THE FORMAT 3 DIVIDE STATEMENT FOUND
002200*    IN LEVEL 1.   ALL COMBINATIONS OF THE OPTIONAL PHRASES
002300*    "SIZE ERROR", "NOT SIZE ERROR" AND "END-MULTIPLY" ARE
002400*    TESTED, AS WELL AS THE ROUNDED OPTION.
002500*
002600*    VARIOUS COMBINATIONS OF SIGNED AND UNSIGNED NUMERIC
002700*    LITERALS, DISPLAY AND COMPUTATIONAL FIELDS ARE USED
002800*    AS OPERANDS.
002900*
003000*
003100 ENVIRONMENT DIVISION.
003200 CONFIGURATION SECTION.
003300 SOURCE-COMPUTER.
003400     XXXXX082.
003500 OBJECT-COMPUTER.
003600     XXXXX083.
003700 INPUT-OUTPUT SECTION.
003800 FILE-CONTROL.
003900     SELECT PRINT-FILE ASSIGN TO
004000     XXXXX055.
004100 DATA DIVISION.
004200 FILE SECTION.
004300 FD  PRINT-FILE.
004400 01  PRINT-REC PICTURE X(120).
004500 01  DUMMY-RECORD PICTURE X(120).
004600 WORKING-STORAGE SECTION.
004700 77  WRK-DS-18V00                PICTURE S9(18).
004800 77  A06THREES-DS-03V03          PICTURE S999V999 VALUE 333.333.
004900 77  WRK-DS-06V06                PICTURE S9(6)V9(6).
005000 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06 PICTURE S9(12).
005100 77  A08TWOS-DS-02V06            PICTURE S99V9(6) VALUE 22.222222.
005200 77  WRK-DS-10V00                PICTURE S9(10).
005300 77  WRK-XN-00001                PICTURE X.
005400 77  A10ONES-DS-10V00            PICTURE S9(10)
005500                                 VALUE 1111111111.
005600 77  A12THREES-DS-06V06          PICTURE S9(6)V9(6)
005700                                 VALUE 333333.333333.
005800 77  WRK-DS-02V00                PICTURE S99.
005900 77  AZERO-DS-05V05              PICTURE S9(5)V9(5) VALUE ZERO.
006000 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
006100 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09 PICTURE S9(18).
006200 77  A05ONES-DS-00V05            PICTURE SV9(5) VALUE .11111.
006300 77  A12ONES-DS-12V00            PICTURE S9(12)
006400                                 VALUE 111111111111.
006500 77  A01ONE-DS-P0801             PICTURE SP(8)9 VALUE .000000001.
006600 77  WRK-DS-09V08                PICTURE S9(9)V9(8).
006700 77  WRK-DS-17V00-S REDEFINES WRK-DS-09V08 PICTURE S9(17).
006800 77  A18ONES-DS-18V00            PICTURE S9(18)
006900                                 VALUE 111111111111111111.
007000 77  WRK-DS-0201P                PICTURE S99P.
007100 77  WRK-CS-18V00                PICTURE S9(18) COMPUTATIONAL.
007200 77  WRK-DU-18V00                PICTURE 9(18).
007300 77  A99-CS-02V00                PICTURE S99 COMPUTATIONAL
007400                                 VALUE 99.
007500 77  A01ONE-CS-00V01             PICTURE SV9 COMPUTATIONAL
007600                                 VALUE .1.
007700 77  A99-DS-02V00                PICTURE S99   VALUE 99.
007800 77  WRK-DS-12V00                PICTURE S9(12).
007900 77  WRK-DS-01V00                PICTURE S9.
008000 77  WRK-DS-03V10                PICTURE S9(3)V9(10).
008100 77  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
008200                                 VALUE 111111111.111111111.
008300 77  A02TWOS-DU-02V00            PICTURE 99  VALUE 22.
008400 77  WRK-DS-05V00                PICTURE S9(5).
008500 77  A02TWOS-DS-03V02            PICTURE S999V99 VALUE +022.00.
008600 77  WRK-CS-02V02                PICTURE S99V99  COMPUTATIONAL.
008700 77  A990-DS-0201P               PICTURE S99P   VALUE +990.
008800 77  XRAY                        PICTURE X.
008900 01  WRK-XN-18-1 PIC X(18).
009000 01  WRK-AN-X-18-1, REDEFINES WRK-XN-18-1 PIC A(18).
009100 01  WRK-DU-X-18V0-1; REDEFINES WRK-XN-18-1 PIC 9(18).
009200 01  WRK-DU-0V1-1 PIC V9 VALUE .3.
009300 01  WRK-DU-0V2-1 PIC V99 VALUE .25.
009400 01  WRK-DU-0V12-1 PIC V9(12) VALUE .00001.
009500 01  WRK-DU-1V0-1 PIC 9 VALUE ZERO.
009600 01  WRK-DU-1V1-1 PIC 9V9 VALUE 1.1.
009700 01  WRK-DU-1V1-2 PIC 9V9 VALUE 2.4.
009800 01  WRK-DU-1V3-1 PIC 9V999 VALUE 1.001.
009900 01  WRK-DU-1V3-2 PIC 9V999 VALUE 1.001.
010000 01  WRK-DU-1V5-1 PIC 9V9(5).
010100 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
010200 01  WRK-DU-2P6-1 PIC 99P(6) VALUE 99000000.
010300 01  WRK-DU-2V0-1 PIC 99.
010400 01  WRK-DU-2V0-2 PIC 99.
010500 01  WRK-DU-2V0-3 PIC 99.
010600 01  WRK-DU-2V1-1 PIC 99V9.
010700 01  WRK-DU-2V1-2 PIC 99V9.
010800 01  WRK-DU-2V1-3 PIC 99V9.
010900 01  WRK-DU-2V2-1 PIC 99V99 VALUE 15.44.
011000 01  WRK-DU-2V2-2 PIC 99V99 VALUE 60.89.
011100 01  WRK-DU-2V2-3 PIC 99V99 VALUE 60.99.
011200 01  WRK-DU-2V2-4 PIC 99V99 VALUE 60.99.
011300 01  WRK-DU-2V2-5 PIC 99V99 VALUE 10.00.
011400 01  WRK-DU-2V5-1 PIC 99V9(5).
011500 01  WRK-DU-4P1-1 PIC P(4)9 VALUE .00001.
011600 01  WRK-DU-5V1-1 PIC 9(5)V9 VALUE 12345.6.
011700 01  WRK-DU-6V0-1 PIC 9(6) VALUE 99999.
011800 01  WRK-DU-6V0-2 PIC 9(6) VALUE 99999.
011900 01  WRK-DU-16V2-1 PIC 9(16)V99 VALUE 9999999999999999.99.
012000 01  WRK-NE-X-1 PIC 9(16).99.
012100 01  WRK-DS-1V0-1 PIC S9 VALUE -3.
012200 01  WRK-DS-1V0-2 PIC S9 VALUE 2.
012300 01  WRK-DS-1V2-1 PIC S9V99 VALUE ZERO.
012400 01  WRK-DS-2V0-1 PIC S99 VALUE ZERO.
012500 01  WRK-DS-2V1-1 PIC S99V9 VALUE ZERO.
012600 01  WRK-DS-2V2-1 PIC S99V99 VALUE ZERO.
012700 01  WRK-DS-2V2-2 PIC S99V99 VALUE -12.34.
012800 01  WRK-DS-16V2-1 PIC S9(16)V99 VALUE -9999999999999999.99.
012900 01  WRK-NE-X-2 PIC -9(16).99.
013000 01  WRK-NE-1 PIC .9999/99999,99999,99.
013100 01  WRK-NE-2 PIC $**.99.
013200 01  WRK-NE-3 PIC $99.99CR.
013300 01  WRK-NE-4 PIC $*9.99 VALUE ZERO.
013400 77  A01ONES-CS-18V00   PICTURE S9(18) COMPUTATIONAL
013500             VALUE +000000000000000001.
013600 77  A02THREES-CS-18V00 PICTURE S9(18) COMPUTATIONAL
013700             VALUE -000000000000000033.
013800 77  A18SIXES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
013900             VALUE 666666666666666666.
014000 77  A16NINES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014100             VALUE 009999999999999999.
014200 77  A14TWOS-CU-18V00   PICTURE 9(18) COMPUTATIONAL
014300             VALUE 000022222222222222.
014400 01  MULTIPLY-DATA.
014500     02 MULT1                           PICTURE IS 999V99
014600     VALUE IS 80.12.
014700     02 MULT2                           PICTURE IS 999V999.
014800     02 MULT3                           PICTURE IS $$99.99.
014900     02 MULT4                           PICTURE IS S99
015000     VALUE IS -56.
015100     02 MULT5                           PICTURE IS 9 VALUE IS 4.
015200     02 MULT6                           PICTURE IS 99 VALUE IS
015300     20.
015400 01  DIVIDE-DATA.
015500     02 DIV1                            PICTURE IS 9(4)V99
015600     VALUE IS 1620.36.
015700     02 DIV2                            PICTURE IS 99V9
015800     VALUE IS 44.1.
015900     02 DIV3                            PICTURE IS 9(4)V9
016000     VALUE IS 1661.7.
016100     02 DIV4                            PICTURE IS S9V999
016200     VALUE IS -9.642.
016300     02 DIV-02LEVEL-1.
016400     03 DIV5                            PICTURE IS V99
016500     VALUE IS .82.
016600     03 DIV6                            PICTURE IS 9 VALUE IS 0.
016700     03 DIV7                            PICTURE IS 9V9
016800     VALUE IS 9.6.
016900 01  DIV-DATA-2.
017000     02 DIV8                            PICTURE IS 99V9.
017100     02 DIV9                            PICTURE IS ZZ,ZZZ.9.
017200     02 DIV10                           PICTURE IS V999.
017300 01  TEST-RESULTS.
017400     02 FILLER                   PIC X      VALUE SPACE.
017500     02 FEATURE                  PIC X(20)  VALUE SPACE.
017600     02 FILLER                   PIC X      VALUE SPACE.
017700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
017800     02 FILLER                   PIC X      VALUE SPACE.
017900     02  PAR-NAME.
018000       03 FILLER                 PIC X(19)  VALUE SPACE.
018100       03  PARDOT-X              PIC X      VALUE SPACE.
018200       03 DOTVALUE               PIC 99     VALUE ZERO.
018300     02 FILLER                   PIC X(8)   VALUE SPACE.
018400     02 RE-MARK                  PIC X(61).
018500 01  TEST-COMPUTED.
018600     02 FILLER                   PIC X(30)  VALUE SPACE.
018700     02 FILLER                   PIC X(17)  VALUE
018800            "       COMPUTED=".
018900     02 COMPUTED-X.
019000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
019100     03 COMPUTED-N               REDEFINES COMPUTED-A
019200                                 PIC -9(9).9(9).
019300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
019400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
019500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
019600     03       CM-18V0 REDEFINES COMPUTED-A.
019700         04 COMPUTED-18V0                    PIC -9(18).
019800         04 FILLER                           PIC X.
019900     03 FILLER PIC X(50) VALUE SPACE.
020000 01  TEST-CORRECT.
020100     02 FILLER PIC X(30) VALUE SPACE.
020200     02 FILLER PIC X(17) VALUE "       CORRECT =".
020300     02 CORRECT-X.
020400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
020600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
020800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
020900     03      CR-18V0 REDEFINES CORRECT-A.
021000         04 CORRECT-18V0                     PIC -9(18).
021100         04 FILLER                           PIC X.
021200     03 FILLER PIC X(2) VALUE SPACE.
021300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021400 01  CCVS-C-1.
021500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
021600-    "SS  PARAGRAPH-NAME
021700-    "       REMARKS".
021800     02 FILLER                     PIC X(20)    VALUE SPACE.
021900 01  CCVS-C-2.
022000     02 FILLER                     PIC X        VALUE SPACE.
022100     02 FILLER                     PIC X(6)     VALUE "TESTED".
022200     02 FILLER                     PIC X(15)    VALUE SPACE.
022300     02 FILLER                     PIC X(4)     VALUE "FAIL".
022400     02 FILLER                     PIC X(94)    VALUE SPACE.
022500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
022600 01  REC-CT                        PIC 99       VALUE ZERO.
022700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
022800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
022900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
023000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
023100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
023200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
023300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
023400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
023500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
023600 01  CCVS-H-1.
023700     02  FILLER                    PIC X(39)    VALUE SPACES.
023800     02  FILLER                    PIC X(42)    VALUE
023900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024000     02  FILLER                    PIC X(39)    VALUE SPACES.
024100 01  CCVS-H-2A.
024200   02  FILLER                        PIC X(40)  VALUE SPACE.
024300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
024400   02  FILLER                        PIC XXXX   VALUE
024500     "4.2 ".
024600   02  FILLER                        PIC X(28)  VALUE
024700            " COPY - NOT FOR DISTRIBUTION".
024800   02  FILLER                        PIC X(41)  VALUE SPACE.
024900
025000 01  CCVS-H-2B.
025100   02  FILLER                        PIC X(15)  VALUE
025200            "TEST RESULT OF ".
025300   02  TEST-ID                       PIC X(9).
025400   02  FILLER                        PIC X(4)   VALUE
025500            " IN ".
025600   02  FILLER                        PIC X(12)  VALUE
025700     " HIGH       ".
025800   02  FILLER                        PIC X(22)  VALUE
025900            " LEVEL VALIDATION FOR ".
026000   02  FILLER                        PIC X(58)  VALUE
026100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026200 01  CCVS-H-3.
026300     02  FILLER                      PIC X(34)  VALUE
026400            " FOR OFFICIAL USE ONLY    ".
026500     02  FILLER                      PIC X(58)  VALUE
026600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026700     02  FILLER                      PIC X(28)  VALUE
026800            "  COPYRIGHT   1985 ".
026900 01  CCVS-E-1.
027000     02 FILLER                       PIC X(52)  VALUE SPACE.
027100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027200     02 ID-AGAIN                     PIC X(9).
027300     02 FILLER                       PIC X(45)  VALUE SPACES.
027400 01  CCVS-E-2.
027500     02  FILLER                      PIC X(31)  VALUE SPACE.
027600     02  FILLER                      PIC X(21)  VALUE SPACE.
027700     02 CCVS-E-2-2.
027800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
027900         03 FILLER                   PIC X      VALUE SPACE.
028000         03 ENDER-DESC               PIC X(44)  VALUE
028100            "ERRORS ENCOUNTERED".
028200 01  CCVS-E-3.
028300     02  FILLER                      PIC X(22)  VALUE
028400            " FOR OFFICIAL USE ONLY".
028500     02  FILLER                      PIC X(12)  VALUE SPACE.
028600     02  FILLER                      PIC X(58)  VALUE
028700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028800     02  FILLER                      PIC X(13)  VALUE SPACE.
028900     02 FILLER                       PIC X(15)  VALUE
029000             " COPYRIGHT 1985".
029100 01  CCVS-E-4.
029200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
029300     02 FILLER                       PIC X(4)   VALUE " OF ".
029400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
029500     02 FILLER                       PIC X(40)  VALUE
029600      "  TESTS WERE EXECUTED SUCCESSFULLY".
029700 01  XXINFO.
029800     02 FILLER                       PIC X(19)  VALUE
029900            "*** INFORMATION ***".
030000     02 INFO-TEXT.
030100       04 FILLER                     PIC X(8)   VALUE SPACE.
030200       04 XXCOMPUTED                 PIC X(20).
030300       04 FILLER                     PIC X(5)   VALUE SPACE.
030400       04 XXCORRECT                  PIC X(20).
030500     02 INF-ANSI-REFERENCE           PIC X(48).
030600 01  HYPHEN-LINE.
030700     02 FILLER  PIC IS X VALUE IS SPACE.
030800     02 FILLER  PIC IS X(65)    VALUE IS "************************
030900-    "*****************************************".
031000     02 FILLER  PIC IS X(54)    VALUE IS "************************
031100-    "******************************".
031200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
031300     "NC173A".
031400 PROCEDURE DIVISION.
031500 CCVS1 SECTION.
031600 OPEN-FILES.
031700     OPEN     OUTPUT PRINT-FILE.
031800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
031900     MOVE    SPACE TO TEST-RESULTS.
032000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
032100     GO TO CCVS1-EXIT.
032200 CLOSE-FILES.
032300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
032400 TERMINATE-CCVS.
032500S    EXIT PROGRAM.
032600STERMINATE-CALL.
032700     STOP     RUN.
032800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
032900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
033000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
033100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
033200     MOVE "****TEST DELETED****" TO RE-MARK.
033300 PRINT-DETAIL.
033400     IF REC-CT NOT EQUAL TO ZERO
033500             MOVE "." TO PARDOT-X
033600             MOVE REC-CT TO DOTVALUE.
033700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
033800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
033900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
034000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
034100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
034200     MOVE SPACE TO CORRECT-X.
034300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
034400     MOVE     SPACE TO RE-MARK.
034500 HEAD-ROUTINE.
034600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
034900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035000 COLUMN-NAMES-ROUTINE.
035100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
035400 END-ROUTINE.
035500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
035600 END-RTN-EXIT.
035700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035800 END-ROUTINE-1.
035900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
036000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
036100      ADD PASS-COUNTER TO ERROR-HOLD.
036200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
036300      MOVE PASS-COUNTER TO CCVS-E-4-1.
036400      MOVE ERROR-HOLD TO CCVS-E-4-2.
036500      MOVE CCVS-E-4 TO CCVS-E-2-2.
036600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
036700  END-ROUTINE-12.
036800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
036900     IF       ERROR-COUNTER IS EQUAL TO ZERO
037000         MOVE "NO " TO ERROR-TOTAL
037100         ELSE
037200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
037300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
037400     PERFORM WRITE-LINE.
037500 END-ROUTINE-13.
037600     IF DELETE-COUNTER IS EQUAL TO ZERO
037700         MOVE "NO " TO ERROR-TOTAL  ELSE
037800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
037900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
038000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038100      IF   INSPECT-COUNTER EQUAL TO ZERO
038200          MOVE "NO " TO ERROR-TOTAL
038300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
038400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038700 WRITE-LINE.
038800     ADD 1 TO RECORD-COUNT.
038900Y    IF RECORD-COUNT GREATER 42
039000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
039100Y        MOVE SPACE TO DUMMY-RECORD
039200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039300Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039400Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039500Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039600Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039700Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
039800Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
039900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
040000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
040100Y        MOVE ZERO TO RECORD-COUNT.
040200     PERFORM WRT-LN.
040300 WRT-LN.
040400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
040500     MOVE SPACE TO DUMMY-RECORD.
040600 BLANK-LINE-PRINT.
040700     PERFORM WRT-LN.
040800 FAIL-ROUTINE.
040900     IF     COMPUTED-X NOT EQUAL TO SPACE
041000            GO TO FAIL-ROUTINE-WRITE.
041100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
041200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041500     MOVE   SPACES TO INF-ANSI-REFERENCE.
041600     GO TO  FAIL-ROUTINE-EX.
041700 FAIL-ROUTINE-WRITE.
041800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
041900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
042000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
042100     MOVE   SPACES TO COR-ANSI-REFERENCE.
042200 FAIL-ROUTINE-EX. EXIT.
042300 BAIL-OUT.
042400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
042500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
042600 BAIL-OUT-WRITE.
042700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
042800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
042900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043000     MOVE   SPACES TO INF-ANSI-REFERENCE.
043100 BAIL-OUT-EX. EXIT.
043200 CCVS1-EXIT.
043300     EXIT.
043400 SECT-NC173A-001 SECTION.
043500 DIV-INIT-F3-1.
043600     MOVE    "DIVIDE BY GIVING" TO FEATURE.
043700     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
043800     MOVE     44.1 TO DIV2.
043900     MOVE     0    TO DIV8.
044000 DIV-TEST-F3-1-0.
044100     DIVIDE   864.36 BY DIV2 GIVING DIV8.
044200 DIV-TEST-F3-1.
044300     IF       DIV8 EQUAL TO 19.6
044400              PERFORM PASS
044500              ELSE
044600              GO TO DIV-FAIL-F3-1.
044700     GO TO    DIV-WRITE-F3-1.
044800 DIV-DELETE-F3-1.
044900     PERFORM  DE-LETE.
045000     GO TO    DIV-WRITE-F3-1.
045100 DIV-FAIL-F3-1.
045200     PERFORM  FAIL.
045300     MOVE     DIV8 TO COMPUTED-N.
045400     MOVE     19.6 TO CORRECT-N.
045500 DIV-WRITE-F3-1.
045600     MOVE "DIV-TEST-F3-1" TO PAR-NAME.
045700     PERFORM  PRINT-DETAIL.
045800 DIV-INIT-F3-2.
045900     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
046000     MOVE     0    TO DIV9.
046100 DIV-TEST-F3-2.
046200     DIVIDE   DIV1 BY 0.533 GIVING DIV9 ROUNDED.
046300     IF       DIV9 EQUAL TO " 3,040.1"
046400              PERFORM PASS
046500              ELSE
046600              GO TO DIV-FAIL-F3-2.
046700     GO TO    DIV-WRITE-F3-2.
046800 DIV-DELETE-F3-2.
046900     PERFORM  DE-LETE.
047000     GO TO    DIV-WRITE-F3-2.
047100 DIV-FAIL-F3-2.
047200     PERFORM  FAIL.
047300     MOVE     DIV9 TO COMPUTED-A.
047400     MOVE    " 3,040.1" TO CORRECT-A.
047500 DIV-WRITE-F3-2.
047600     MOVE    "DIV-TEST-F3-2" TO PAR-NAME.
047700     PERFORM  PRINT-DETAIL.
047800 DIV-INIT-F3-3.
047900     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
048000     MOVE     44.1 TO DIV2.
048100     MOVE   -9.642 TO DIV4.
048200     MOVE     0    TO DIV10.
048300     MOVE     1    TO REC-CT.
048400 DIV-TEST-F3-3-0.
048500     DIVIDE  DIV2 BY DIV4 GIVING DIV10 ON SIZE ERROR
048600             MOVE "P" TO XRAY.
048700     GO TO DIV-TEST-F3-3-1.
048800 DIV-DELETE-F3-3-1.
048900     PERFORM DE-LETE.
049000     PERFORM PRINT-DETAIL.
049100     GO TO   DIV-INIT-F3-4.
049200 DIV-TEST-F3-3-1.
049300     MOVE   "DIV-TEST-F3-3-1" TO PAR-NAME.
049400     IF      XRAY   = "P"
049500             PERFORM PASS
049600             PERFORM PRINT-DETAIL
049700     ELSE
049800             MOVE    XRAY  TO COMPUTED-X
049900             MOVE   "P"    TO CORRECT-X
050000             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
050100             PERFORM FAIL
050200             PERFORM PRINT-DETAIL.
050300     ADD     1 TO REC-CT.
050400 DIV-TEST-F3-3-2.
050500     MOVE   "DIV-TEST-F3-3-2" TO PAR-NAME.
050600     IF      DIV10   = 0
050700             PERFORM PASS
050800             PERFORM PRINT-DETAIL
050900     ELSE
051000             MOVE    DIV10 TO COMPUTED-N
051100             MOVE    0     TO CORRECT-N
051200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
051300             PERFORM FAIL
051400             PERFORM PRINT-DETAIL.
051500 DIV-INIT-F3-4.
051600     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
051700     MOVE     0    TO DIV8.
051800     MOVE     1    TO REC-CT.
051900 DIV-TEST-F3-4-0.
052000     DIVIDE  100.50 BY 1.0051 GIVING DIV8 ROUNDED ON SIZE ERROR
052100             MOVE "Q" TO XRAY.
052200     GO TO DIV-TEST-F3-4-1.
052300 DIV-DELETE-F3-4.
052400     PERFORM DE-LETE.
052500     PERFORM PRINT-DETAIL.
052600     GO TO   DIV-INIT-F3-5.
052700 DIV-TEST-F3-4-1.
052800     MOVE   "DIV-TEST-F3-4-1" TO PAR-NAME.
052900     IF      XRAY    = "Q"
053000             PERFORM PASS
053100             PERFORM PRINT-DETAIL
053200     ELSE
053300             MOVE    XRAY TO COMPUTED-X
053400             MOVE   "Q"   TO CORRECT-X
053500             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
053600             PERFORM FAIL
053700             PERFORM PRINT-DETAIL.
053800     ADD     1 TO REC-CT.
053900 DIV-TEST-F3-4-2.
054000     MOVE   "DIV-TEST-F3-4-2" TO PAR-NAME.
054100     IF      DIV8    =  0
054200             PERFORM PASS
054300             PERFORM PRINT-DETAIL
054400     ELSE
054500             MOVE    DIV8 TO COMPUTED-N
054600             MOVE    0    TO CORRECT-N
054700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
054800             PERFORM FAIL
054900             PERFORM PRINT-DETAIL.
055000 DIV-INIT-F3-5.
055100     MOVE   "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
055200     MOVE    ZERO TO REC-CT.
055300     MOVE    ZERO TO WRK-DS-01V00.
055400 DIV-TEST-F3-5-0.
055500     DIVIDE A02TWOS-DU-02V00 BY -10.9 GIVING WRK-DS-01V00.
055600 DIV-TEST-F3-5-1.
055700     IF WRK-DS-01V00 EQUAL TO -2
055800         PERFORM PASS
055900         GO TO DIV-WRITE-F3-5.
056000     GO TO DIV-FAIL-F3-5.
056100 DIV-DELETE-F3-5.
056200     PERFORM DE-LETE.
056300     GO TO DIV-WRITE-F3-5.
056400 DIV-FAIL-F3-5.
056500     MOVE  -2                 TO CORRECT-N.
056600     MOVE  WRK-DS-01V00       TO COMPUTED-N.
056700     PERFORM FAIL.
056800 DIV-WRITE-F3-5.
056900     MOVE "DIV-TEST-F3-5         " TO PAR-NAME.
057000     PERFORM PRINT-DETAIL.
057100 DIV-INIT-F3-6.
057200     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
057300     MOVE 0.0000000001 TO WRK-DS-03V10.
057400     MOVE ZERO TO WRK-DS-18V00.
057500 DIV-TEST-F3-6-0.
057600     DIVIDE A01ONE-DS-P0801 BY WRK-DS-03V10 GIVING
057700         WRK-DS-18V00 ROUNDED.
057800 DIV-TEST-F3-6-1.
057900     IF WRK-DS-18V00 EQUAL TO 000000000000000010
058000         PERFORM PASS
058100         GO TO DIV-WRITE-F3-6.
058200     GO TO DIV-FAIL-F3-6.
058300 DIV-DELETE-F3-6.
058400     PERFORM DE-LETE.
058500     GO TO DIV-WRITE-F3-6.
058600 DIV-FAIL-F3-6.
058700     MOVE  000000000000000010 TO CORRECT-18V0.
058800     MOVE  WRK-DS-18V00       TO COMPUTED-18V0.
058900     PERFORM FAIL.
059000 DIV-WRITE-F3-6.
059100     MOVE "DIV-TEST-F3-6         " TO PAR-NAME.
059200     PERFORM PRINT-DETAIL.
059300 DIV-INIT-F3-7.
059400     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
059500     MOVE ZERO TO WRK-DS-18V00.
059600     MOVE "0" TO WRK-XN-00001.
059700     MOVE    1    TO REC-CT.
059800 DIV-TEST-F3-7-0.
059900     DIVIDE A99-DS-02V00 BY AZERO-DS-05V05 GIVING
060000         WRK-DS-18V00 ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
060100 DIV-TEST-F3-7-1.
060200     IF WRK-DS-18V00 EQUAL TO 000000000000000000
060300         PERFORM PASS
060400         GO TO DIV-WRITE-F3-7-1.
060500     MOVE  000000000000000000 TO CORRECT-18V0.
060600     MOVE  WRK-DS-18V00       TO COMPUTED-18V0.
060700     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
060800     PERFORM FAIL.
060900     GO TO DIV-WRITE-F3-7-1.
061000 DIV-DELETE-F3-7-1.
061100     PERFORM DE-LETE.
061200 DIV-WRITE-F3-7-1.
061300     MOVE "DIV-TEST-F3-7-1" TO PAR-NAME.
061400     PERFORM PRINT-DETAIL.
061500     ADD 1 TO REC-CT.
061600 DIV-TEST-F3-7-2.
061700     IF WRK-XN-00001 EQUAL TO "1"
061800         PERFORM PASS
061900         GO TO DIV-WRITE-F3-7-2.
062000     MOVE "1" TO CORRECT-A.
062100     MOVE WRK-XN-00001 TO COMPUTED-A.
062200     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
062300     PERFORM FAIL.
062400     GO TO DIV-WRITE-F3-7-2.
062500 DIV-DELETE-F3-7-2.
062600     PERFORM DE-LETE.
062700 DIV-WRITE-F3-7-2.
062800     MOVE "DIV-TEST-F3-7-2         " TO PAR-NAME.
062900     PERFORM PRINT-DETAIL.
063000 DIV-INIT-F3-8.
063100     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
063200     MOVE A18ONES-DS-09V09 TO WRK-DS-09V09.
063300     MOVE "1" TO WRK-XN-00001.
063400     MOVE  1  TO REC-CT.
063500 DIV-TEST-F3-8-1.
063600     DIVIDE WRK-DS-09V09 BY A18ONES-DS-09V09 GIVING
063700         WRK-DS-09V09 ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
063800     IF WRK-DS-18V00-S EQUAL TO 000000001000000000
063900         PERFORM PASS
064000         GO TO DIV-WRITE-F3-8-1.
064100 DIV-FAIL-F3-8-1.
064200     MOVE  000000001000000000 TO CORRECT-18V0.
064300     MOVE  WRK-DS-18V00-S     TO COMPUTED-18V0.
064400     PERFORM FAIL.
064500     GO TO DIV-WRITE-F3-8-1.
064600 DIV-DELETE-F3-8-1.
064700     PERFORM DE-LETE.
064800 DIV-WRITE-F3-8-1.
064900     MOVE "DIV-TEST-F3-8-1         " TO PAR-NAME.
065000     PERFORM PRINT-DETAIL.
065100     ADD 1 TO REC-CT.
065200 DIV-TEST-F3-8-2.
065300     IF WRK-XN-00001 EQUAL TO "0"
065400         MOVE WRK-XN-00001 TO COMPUTED-A
065500         MOVE "1" TO CORRECT-A
065600         MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
065700         PERFORM FAIL
065800         GO TO DIV-WRITE-F3-8-2.
065900     PERFORM PASS.
066000     GO TO DIV-WRITE-F3-8-2.
066100 DIV-DELETE-F3-8-2.
066200     PERFORM DE-LETE.
066300 DIV-WRITE-F3-8-2.
066400     MOVE "DIV-TEST-F3-8-2         " TO PAR-NAME.
066500     PERFORM PRINT-DETAIL.
066600 DIV-INIT-F3-9.
066700     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
066800     MOVE ZERO TO WRK-DS-0201P.
066900     MOVE -0.005 TO WRK-DS-09V09.
067000     MOVE "0" TO WRK-XN-00001.
067100     MOVE  1 TO REC-CT.
067200 DIV-TEST-F3-9-1-0.
067300     DIVIDE A05ONES-DS-00V05 BY WRK-DS-09V09 GIVING
067400         WRK-DS-0201P ROUNDED ON SIZE ERROR
067500         MOVE "1" TO WRK-XN-00001.
067600 DIV-TEST-F3-9-1-1.
067700     MOVE WRK-DS-0201P TO WRK-DS-05V00.
067800     IF  WRK-DS-05V00 EQUAL TO -00020
067900         PERFORM PASS
068000         GO TO DIV-WRITE-F3-9-1.
068100     MOVE  -00020             TO CORRECT-N.
068200     MOVE  WRK-DS-05V00       TO COMPUTED-N.
068300     PERFORM FAIL.
068400     GO TO DIV-WRITE-F3-9-1.
068500 DIV-DELETE-F3-9-1.
068600     PERFORM DE-LETE.
068700 DIV-WRITE-F3-9-1.
068800     MOVE "DIV-TEST-F3-9-1         " TO PAR-NAME.
068900     PERFORM PRINT-DETAIL.
069000     ADD 1 TO REC-CT.
069100 DIV-TEST-F3-9-2-1.
069200     IF WRK-XN-00001 EQUAL TO "0"
069300         PERFORM PASS
069400         GO TO DIV-WRITE-F3-9-2.
069500     MOVE "0" TO CORRECT-A.
069600     MOVE WRK-XN-00001 TO COMPUTED-A.
069700     MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
069800     PERFORM FAIL.
069900     GO TO DIV-WRITE-F3-9-2.
070000 DIV-DELETE-F3-9-2.
070100     PERFORM DE-LETE.
070200 DIV-WRITE-F3-9-2.
070300     MOVE "DIV-TEST-F3-9-2         " TO PAR-NAME.
070400     PERFORM PRINT-DETAIL.
070500 DIV-INIT-F3-10.
070600     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
070700     MOVE "1" TO WRK-XN-00001.
070800     MOVE ZERO TO WRK-DS-01V00.
070900     MOVE  1 TO REC-CT.
071000 DIV-TEST-F3-10-0.
071100     DIVIDE A02TWOS-DS-03V02 BY A02TWOS-DU-02V00 GIVING
071200         WRK-DS-01V00 ROUNDED ON SIZE ERROR
071300         MOVE "0" TO WRK-XN-00001.
071400 DIV-TEST-F3-10-1.
071500     IF WRK-DS-01V00 EQUAL TO +1
071600         PERFORM PASS
071700         GO TO DIV-WRITE-F3-10-1.
071800     MOVE  +1                 TO CORRECT-N.
071900     MOVE  WRK-DS-01V00       TO COMPUTED-N.
072000     PERFORM FAIL.
072100     GO TO DIV-WRITE-F3-10-1.
072200 DIV-DELETE-F3-10-1.
072300     PERFORM DE-LETE.
072400 DIV-WRITE-F3-10-1.
072500     MOVE "DIV-TEST-F3-10-1" TO PAR-NAME.
072600     PERFORM PRINT-DETAIL.
072700     ADD 1 TO REC-CT.
072800 DIV-TEST-F3-10-2.
072900     IF WRK-XN-00001 EQUAL TO "0"
073000         MOVE "0" TO COMPUTED-A
073100         MOVE "1" TO CORRECT-A
073200         MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK
073300         PERFORM FAIL
073400        GO TO DIV-WRITE-F3-10-2.
073500     PERFORM PASS.
073600     GO TO DIV-WRITE-F3-10-2.
073700 DIV-DELETE-F3-10-2.
073800     PERFORM DE-LETE.
073900 DIV-WRITE-F3-10-2.
074000     MOVE "DIV-TEST-F3-10-2         " TO PAR-NAME.
074100     PERFORM PRINT-DETAIL.
074200 DIV-INIT-F3-11.
074300     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
074400     MOVE    0 TO WRK-DS-05V00.
074500 DIV-TEST-F3-11-0.
074600     DIVIDE A99-CS-02V00 BY A01ONE-CS-00V01 GIVING
074700         WRK-DS-05V00.
074800 DIV-TEST-F3-11-1.
074900     IF WRK-DS-05V00 EQUAL TO 00990
075000         PERFORM PASS
075100         GO TO DIV-WRITE-F3-11.
075200     GO TO DIV-FAIL-F3-11.
075300 DIV-DELETE-F3-11.
075400     PERFORM DE-LETE.
075500     GO TO DIV-WRITE-F3-11.
075600 DIV-FAIL-F3-11.
075700     MOVE  00990              TO CORRECT-N.
075800     MOVE  WRK-DS-05V00       TO COMPUTED-N.
075900     PERFORM FAIL.
076000 DIV-WRITE-F3-11.
076100     MOVE "DIV-TEST-F3-11         " TO PAR-NAME.
076200     PERFORM PRINT-DETAIL.
076300 DIV-INIT-F3-12.
076400     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
076500     MOVE ZERO TO WRK-CS-18V00.
076600 DIV-TEST-F3-12-0.
076700     DIVIDE A16NINES-CU-18V00 BY A02THREES-CS-18V00
076800             GIVING WRK-CS-18V00.
076900 DIV-TEST-F3-12-1.
077000     IF WRK-CS-18V00 EQUAL TO -000303030303030303
077100         PERFORM PASS
077200         GO TO DIV-WRITE-F3-12.
077300     MOVE -00303030303030303 TO CORRECT-18V0.
077400     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
077500     PERFORM FAIL.
077600     GO TO DIV-WRITE-F3-12.
077700 DIV-DELETE-F3-12.
077800     PERFORM DE-LETE.
077900 DIV-WRITE-F3-12.
078000     MOVE "DIV-TEST-F3-12 " TO PAR-NAME.
078100     PERFORM PRINT-DETAIL.
078200 DIV-INIT-F3-13.
078300     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
078400     MOVE ZERO TO WRK-DU-18V00.
078500 DIV-TEST-F3-13-0.
078600     DIVIDE A18SIXES-CU-18V00 BY A14TWOS-CU-18V00 GIVING
078700             WRK-DU-18V00.
078800 DIV-TEST-F3-13-1.
078900     IF WRK-DU-18V00 EQUAL TO 000000000000030000
079000         PERFORM PASS
079100         GO TO DIV-WRITE-F3-13.
079200     MOVE 000000000000030000 TO CORRECT-18V0.
079300     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
079400     PERFORM FAIL.
079500     GO TO DIV-WRITE-F3-13.
079600 DIV-DELETE-F3-13.
079700     PERFORM DE-LETE.
079800 DIV-WRITE-F3-13.
079900     MOVE "DIV-TEST-F3-13 " TO PAR-NAME.
080000     PERFORM PRINT-DETAIL.
080100 DIV-INIT-F3-14.
080200     MOVE    "V1-82 6.11.4 GR3"   TO ANSI-REFERENCE.
080300     MOVE ZERO TO WRK-CS-18V00.
080400 DIV-TEST-F3-14-0.
080500     DIVIDE A02THREES-CS-18V00 BY A01ONES-CS-18V00 GIVING
080600             WRK-CS-18V00 ROUNDED.
080700 DIV-TEST-F3-14-1.
080800     IF WRK-CS-18V00 EQUAL TO -000000000000000033
080900         PERFORM PASS
081000         GO TO DIV-WRITE-F3-14.
081100     MOVE -000000000000000033 TO CORRECT-18V0.
081200     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
081300     PERFORM FAIL.
081400     GO TO DIV-WRITE-F3-14.
081500 DIV-DELETE-F3-14.
081600     PERFORM DE-LETE.
081700 DIV-WRITE-F3-14.
081800     MOVE "DIV-TEST-F3-14 " TO PAR-NAME.
081900     PERFORM PRINT-DETAIL.
082000*
082100*
082200 DIV-INIT-F3-15.
082300*            ==-->    SIZE ERROR CONDITION <--==
082400*            ==-->    NEW SIZE ERROR TESTS <--==
082500     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
082600     MOVE   "DIV-TEST-F3-15" TO PAR-NAME.
082700     MOVE    44.1  TO DIV2.
082800     MOVE   -9.642 TO DIV4.
082900     MOVE    0     TO DIV10.
083000     MOVE    1     TO REC-CT.
083100     MOVE   "A"    TO XRAY.
083200 DIV-TEST-F3-15-0.
083300     DIVIDE  DIV2 BY DIV4
083400      GIVING DIV10
083500      NOT ON SIZE ERROR
083600             MOVE "P" TO XRAY.
083700     GO TO   DIV-TEST-F3-15-1.
083800 DIV-DELETE-F3-15-1.
083900     PERFORM DE-LETE.
084000     PERFORM PRINT-DETAIL.
084100     GO TO   DIV-INIT-F3-16.
084200 DIV-TEST-F3-15-1.
084300     MOVE   "DIV-TEST-F3-15-1" TO PAR-NAME.
084400     IF      XRAY    = "A"
084500             PERFORM PASS
084600             PERFORM PRINT-DETAIL
084700     ELSE
084800             MOVE    XRAY  TO COMPUTED-X
084900             MOVE   "A"    TO CORRECT-X
085000             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
085100             PERFORM FAIL
085200             PERFORM PRINT-DETAIL.
085300     ADD     1     TO REC-CT.
085400 DIV-TEST-F3-15-2.
085500     MOVE   "DIV-TEST-F3-15-2" TO PAR-NAME.
085600     IF      DIV10   = 0
085700             PERFORM PASS
085800             PERFORM PRINT-DETAIL
085900     ELSE
086000             MOVE    DIV10 TO COMPUTED-N
086100             MOVE    0     TO CORRECT-N
086200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
086300             PERFORM FAIL
086400             PERFORM PRINT-DETAIL.
086500*
086600*
086700 DIV-INIT-F3-16.
086800     MOVE   "DIV-TEST-F3-16" TO PAR-NAME.
086900     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
087000*            ==--> NO SIZE ERROR CONDITION <--==
087100*            ==-->    NEW SIZE ERROR TESTS <--==
087200     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
087300     MOVE    1     TO REC-CT.
087400     MOVE   "1" TO WRK-XN-00001.
087500 DIV-TEST-F3-16-0.
087600     DIVIDE  WRK-DS-09V09 BY A18ONES-DS-09V09
087700      GIVING WRK-DS-09V09
087800      NOT ON SIZE ERROR MOVE "0" TO WRK-XN-00001.
087900     GO TO   DIV-TEST-F3-16-1.
088000 DIV-DELETE-F3-16-1.
088100     PERFORM DE-LETE.
088200     PERFORM PRINT-DETAIL.
088300     GO TO   DIV-INIT-F3-17.
088400 DIV-TEST-F3-16-1.
088500     MOVE   "DIV-TEST-F3-16-1" TO PAR-NAME.
088600     IF      WRK-DS-18V00-S EQUAL TO 000000001000000000
088700             PERFORM PASS
088800             PERFORM PRINT-DETAIL
088900     ELSE
089000             MOVE    000000001000000000 TO CORRECT-18V0
089100             MOVE    WRK-DS-18V00-S     TO COMPUTED-18V0
089200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
089300             PERFORM FAIL
089400             PERFORM PRINT-DETAIL.
089500     ADD     1     TO REC-CT.
089600 DIV-TEST-F3-16-2.
089700     MOVE   "DIV-TEST-F3-16-2" TO PAR-NAME.
089800     IF      WRK-XN-00001 = "0"
089900             PERFORM PASS
090000             PERFORM PRINT-DETAIL
090100     ELSE
090200             MOVE    WRK-XN-00001 TO COMPUTED-X
090300             MOVE   "0"           TO CORRECT-X
090400             MOVE   "NOT ON SIZE ERROR NOT EXECUTED" TO RE-MARK
090500             PERFORM FAIL
090600             PERFORM PRINT-DETAIL.
090700*
090800*
090900 DIV-INIT-F3-17.
091000*            ==-->    SIZE ERROR CONDITION <--==
091100*            ==-->    NEW SIZE ERROR TESTS <--==
091200     MOVE   "DIV-TEST-F3-17" TO PAR-NAME.
091300     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
091400     MOVE    44.1  TO DIV2.
091500     MOVE   -9.642 TO DIV4.
091600     MOVE    0     TO DIV10.
091700     MOVE    1     TO REC-CT.
091800     MOVE   "A"    TO XRAY.
091900 DIV-TEST-F3-17-0.
092000     DIVIDE  DIV2 BY DIV4
092100      GIVING DIV10
092200          ON SIZE ERROR
092300             MOVE "E" TO XRAY
092400      NOT ON SIZE ERROR
092500             MOVE "N" TO XRAY.
092600     GO TO DIV-TEST-F3-17-1.
092700 DIV-DELETE-F3-17-1.
092800     PERFORM DE-LETE.
092900     PERFORM PRINT-DETAIL.
093000     GO TO   DIV-INIT-F3-18.
093100 DIV-TEST-F3-17-1.
093200     MOVE   "DIV-TEST-F3-17-1" TO PAR-NAME.
093300     IF      XRAY    = "E"
093400             PERFORM PASS
093500             PERFORM PRINT-DETAIL
093600     ELSE
093700             MOVE    XRAY  TO COMPUTED-X
093800             MOVE   "E"    TO CORRECT-X
093900             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
094000             PERFORM FAIL
094100             PERFORM PRINT-DETAIL.
094200     ADD     1     TO REC-CT.
094300 DIV-TEST-F3-17-2.
094400     MOVE   "DIV-TEST-F3-17-2" TO PAR-NAME.
094500     IF      DIV10   = 0
094600             PERFORM PASS
094700             PERFORM PRINT-DETAIL
094800     ELSE
094900             MOVE    DIV10 TO COMPUTED-N
095000             MOVE    0     TO CORRECT-N
095100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
095200             PERFORM FAIL
095300             PERFORM PRINT-DETAIL.
095400*
095500*
095600 DIV-INIT-F3-18.
095700*            ==--> NO SIZE ERROR CONDITION <--==
095800*            ==-->    NEW SIZE ERROR TESTS <--==
095900     MOVE   "V1-67 6.4.2 "   TO ANSI-REFERENCE.
096000     MOVE    1     TO REC-CT.
096100     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
096200     MOVE   "1" TO WRK-XN-00001.
096300 DIV-TEST-F3-18-0.
096400     DIVIDE  WRK-DS-09V09 BY A18ONES-DS-09V09
096500      GIVING WRK-DS-09V09
096600          ON SIZE ERROR
096700             MOVE "1" TO WRK-XN-00001
096800      NOT ON SIZE ERROR
096900             MOVE "2" TO WRK-XN-00001.
097000     GO TO   DIV-TEST-F3-18-1.
097100 DIV-DELETE-F3-18-1.
097200     PERFORM DE-LETE.
097300     PERFORM PRINT-DETAIL.
097400     GO TO   DIV-INIT-F3-19.
097500 DIV-TEST-F3-18-1.
097600     MOVE   "DIV-TEST-F3-18-1" TO PAR-NAME.
097700     IF      WRK-DS-09V09   EQUAL TO 1
097800             PERFORM PASS
097900             PERFORM PRINT-DETAIL
098000     ELSE
098100             MOVE    000000001000000000 TO CORRECT-18V0
098200             MOVE    WRK-DS-18V00-S     TO COMPUTED-18V0
098300             MOVE   "DIV-TEST-F3-18-2" TO PAR-NAME
098400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
098500             PERFORM FAIL
098600             PERFORM PRINT-DETAIL.
098700     MOVE    1     TO REC-CT.
098800 DIV-TEST-F3-18-2.
098900     MOVE   "DIV-TEST-F3-18-2" TO PAR-NAME.
099000     IF      WRK-XN-00001 = "2"
099100             PERFORM PASS
099200             PERFORM PRINT-DETAIL
099300     ELSE
099400             MOVE    WRK-XN-00001 TO COMPUTED-X
099500             MOVE   "2"           TO CORRECT-X
099600             MOVE   "NOT ON SIZE ERROR NOT EXECUTED" TO RE-MARK
099700             PERFORM FAIL
099800             PERFORM PRINT-DETAIL.
099900*
100000*
100100 DIV-INIT-F3-19.
100200     MOVE   "DIV-TEST-F3-19"     TO PAR-NAME.
100300*            ==--> NO SIZE ERROR CONDITION <--==
100400*            ==-->  MULTIPLE RESULT FIELDS <--==
100500     MOVE   "V1-82 6.11.4 GR3" TO ANSI-REFERENCE.
100600     MOVE    0 TO WRK-DU-2V1-1.
100700     MOVE    0 TO WRK-DU-2V1-2.
100800     MOVE    0 TO WRK-DU-2V0-2.
100900     MOVE    0 TO WRK-DU-2V1-3.
101000     MOVE    0 TO WRK-DU-2V0-3.
101100     MOVE    1 TO REC-CT.
101200     MOVE   10 TO WRK-DU-2V0-1.
101300     MOVE  3.9 TO WRK-DU-1V1-2.
101400 DIV-TEST-F3-19-0.
101500     DIVIDE  WRK-DU-2V0-1 BY WRK-DU-1V1-2
101600      GIVING WRK-DU-2V1-1
101700             WRK-DU-2V0-1 ROUNDED
101800             WRK-DU-2V1-2
101900             WRK-DU-2V0-2 ROUNDED
102000             WRK-DU-2V1-3
102100             WRK-DU-2V0-3.
102200     GO TO DIV-TEST-F3-19-1.
102300 DIV-DELETE-F3-19.
102400     PERFORM DE-LETE.
102500     PERFORM PRINT-DETAIL.
102600     GO TO   DIV-INIT-F3-20.
102700 DIV-TEST-F3-19-1.
102800     IF      WRK-DU-2V1-1 = 2.5
102900             PERFORM PASS
103000             PERFORM PRINT-DETAIL
103100     ELSE
103200             PERFORM FAIL
103300             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
103400             MOVE    2.5          TO CORRECT-N
103500             PERFORM PRINT-DETAIL.
103600     ADD 1 TO REC-CT.
103700 DIV-TEST-F3-19-2.
103800     IF      WRK-DU-2V0-1 = 3
103900             PERFORM PASS
104000             PERFORM PRINT-DETAIL
104100     ELSE
104200             PERFORM FAIL
104300             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
104400             MOVE    3            TO CORRECT-N
104500             PERFORM PRINT-DETAIL.
104600     ADD 1 TO REC-CT.
104700 DIV-TEST-F3-19-3.
104800     IF      WRK-DU-2V1-2 = 2.5
104900             PERFORM PASS
105000             PERFORM PRINT-DETAIL
105100     ELSE
105200             PERFORM FAIL
105300             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
105400             MOVE    2.5          TO CORRECT-N
105500             PERFORM PRINT-DETAIL.
105600     ADD 1 TO REC-CT.
105700 DIV-TEST-F3-19-4.
105800     IF      WRK-DU-2V0-2 = 3
105900             PERFORM PASS
106000             PERFORM PRINT-DETAIL
106100     ELSE
106200             PERFORM FAIL
106300             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
106400             MOVE    3            TO CORRECT-N
106500             PERFORM PRINT-DETAIL.
106600     ADD 1 TO REC-CT.
106700 DIV-TEST-F3-19-5.
106800     IF      WRK-DU-2V1-3 = 2.5
106900             PERFORM PASS
107000             PERFORM PRINT-DETAIL
107100     ELSE
107200             PERFORM FAIL
107300             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
107400             MOVE    2.5          TO CORRECT-N
107500             PERFORM PRINT-DETAIL.
107600     ADD 1 TO REC-CT.
107700 DIV-TEST-F3-19-6.
107800     IF      WRK-DU-2V0-3 = 2
107900             PERFORM PASS
108000             PERFORM PRINT-DETAIL
108100     ELSE
108200             PERFORM FAIL
108300             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
108400             MOVE    2            TO CORRECT-N
108500             PERFORM PRINT-DETAIL.
108600*
108700*
108800 DIV-INIT-F3-20.
108900*            ==-->    SIZE ERROR CONDITION <--==
109000*            ==-->    NEW SIZE ERROR TESTS <--==
109100     MOVE   "DIV-TEST-F3-20" TO PAR-NAME.
109200     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
109300     MOVE   "0"  TO WRK-XN-00001.
109400     MOVE    0   TO WRK-DU-2V1-1.
109500     MOVE    0   TO WRK-DU-2V0-1.
109600     MOVE    0   TO WRK-DU-2V1-2.
109700     MOVE    0   TO WRK-DU-2V0-2.
109800     MOVE    0   TO WRK-DU-2V1-3.
109900     MOVE    0   TO WRK-DU-2V0-3.
110000     MOVE    1   TO REC-CT.
110100     MOVE    99  TO WRK-DU-2V0-1.
110200 DIV-TEST-F3-20-0.
110300     DIVIDE  WRK-DU-2V0-1 BY A01ONE-CS-00V01
110400      GIVING WRK-DU-2V1-1
110500             WRK-DU-2V0-1 ROUNDED
110600             WRK-DU-2V1-2
110700             WRK-DU-2V0-2 ROUNDED
110800             WRK-DU-2V1-3
110900             WRK-DU-2V0-3
111000          ON SIZE ERROR
111100             MOVE  "1" TO WRK-XN-00001.
111200     GO TO DIV-TEST-F3-20-1.
111300 DIV-DELETE-F3-20.
111400     PERFORM DE-LETE.
111500     PERFORM PRINT-DETAIL.
111600     GO TO   DIV-INIT-F3-21.
111700 DIV-TEST-F3-20-1.
111800     IF      WRK-DU-2V1-1 = 0
111900             PERFORM PASS
112000             PERFORM PRINT-DETAIL
112100     ELSE
112200             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
112300             PERFORM FAIL
112400             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
112500             MOVE    0            TO CORRECT-N
112600             PERFORM PRINT-DETAIL.
112700     ADD 1 TO REC-CT.
112800 DIV-TEST-F3-20-2.
112900     IF      WRK-DU-2V0-1 = 99
113000             PERFORM PASS
113100             PERFORM PRINT-DETAIL
113200     ELSE
113300             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
113400             PERFORM FAIL
113500             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
113600             MOVE    99           TO CORRECT-N
113700             PERFORM PRINT-DETAIL.
113800     ADD 1 TO REC-CT.
113900 DIV-TEST-F3-20-3.
114000     IF      WRK-DU-2V1-2 = 0
114100             PERFORM PASS
114200             PERFORM PRINT-DETAIL
114300     ELSE
114400             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
114500             PERFORM FAIL
114600             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
114700             MOVE    0            TO CORRECT-N
114800             PERFORM PRINT-DETAIL.
114900     ADD 1 TO REC-CT.
115000 DIV-TEST-F3-20-4.
115100     IF      WRK-DU-2V0-2 = 0
115200             PERFORM PASS
115300             PERFORM PRINT-DETAIL
115400     ELSE
115500             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
115600             PERFORM FAIL
115700             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
115800             MOVE    0            TO CORRECT-N
115900             PERFORM PRINT-DETAIL.
116000     ADD 1 TO REC-CT.
116100 DIV-TEST-F3-20-5.
116200     IF      WRK-DU-2V1-3 = 0
116300             PERFORM PASS
116400             PERFORM PRINT-DETAIL
116500     ELSE
116600             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
116700             PERFORM FAIL
116800             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
116900             MOVE    0            TO CORRECT-N
117000             PERFORM PRINT-DETAIL.
117100     ADD 1 TO REC-CT.
117200 DIV-TEST-F3-20-6.
117300     IF      WRK-DU-2V0-3 = 0
117400             PERFORM PASS
117500             PERFORM PRINT-DETAIL
117600     ELSE
117700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
117800             PERFORM FAIL
117900             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
118000             MOVE    0            TO CORRECT-N
118100             PERFORM PRINT-DETAIL.
118200     ADD 1 TO REC-CT.
118300 DIV-TEST-F3-20-7.
118400     IF      WRK-XN-00001  = "1"
118500             PERFORM PASS
118600             PERFORM PRINT-DETAIL
118700     ELSE
118800             MOVE    WRK-XN-00001 TO COMPUTED-X
118900             MOVE   "1"           TO CORRECT-X
119000             MOVE   "DIV-TEST-F3-20-7" TO PAR-NAME
119100             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
119200             PERFORM FAIL
119300             PERFORM PRINT-DETAIL.
119400*
119500*
119600 DIV-INIT-F3-21.
119700*            ==--> NO SIZE ERROR CONDITION <--==
119800*            ==-->  MULTIPLE RESULT FIELDS <--==
119900     MOVE   "DIV-TEST-F3-21"     TO PAR-NAME.
120000     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
120100     MOVE   "0"  TO WRK-XN-00001.
120200     MOVE    0   TO WRK-DU-2V1-1.
120300     MOVE    0   TO WRK-DU-2V0-1.
120400     MOVE    0   TO WRK-DU-2V1-2.
120500     MOVE    0   TO WRK-DU-2V0-2.
120600     MOVE    0   TO WRK-DU-2V1-3.
120700     MOVE    0   TO WRK-DU-2V0-3.
120800     MOVE    1   TO REC-CT.
120900     MOVE   10   TO WRK-DU-2V0-1.
121000     MOVE  3.9   TO WRK-DU-1V1-2.
121100 DIV-TEST-F3-21-0.
121200     DIVIDE  WRK-DU-2V0-1 BY WRK-DU-1V1-2
121300      GIVING WRK-DU-2V1-1
121400             WRK-DU-2V0-1 ROUNDED
121500             WRK-DU-2V1-2
121600             WRK-DU-2V0-2 ROUNDED
121700             WRK-DU-2V1-3
121800             WRK-DU-2V0-3
121900          ON SIZE ERROR
122000             MOVE   "1" TO WRK-XN-00001.
122100     GO TO DIV-TEST-F3-21-1.
122200 DIV-DELETE-F3-21.
122300     PERFORM DE-LETE.
122400     PERFORM PRINT-DETAIL.
122500     GO TO   DIV-INIT-F3-22.
122600 DIV-TEST-F3-21-1.
122700     IF      WRK-DU-2V1-1 = 2.5
122800             PERFORM PASS
122900             PERFORM PRINT-DETAIL
123000     ELSE
123100             PERFORM FAIL
123200             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
123300             MOVE    2.5          TO CORRECT-N
123400             PERFORM PRINT-DETAIL.
123500     ADD 1 TO REC-CT.
123600 DIV-TEST-F3-21-2.
123700     IF      WRK-DU-2V0-1 = 3
123800             PERFORM PASS
123900             PERFORM PRINT-DETAIL
124000     ELSE
124100             PERFORM FAIL
124200             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
124300             MOVE    3            TO CORRECT-N
124400             PERFORM PRINT-DETAIL.
124500     ADD 1 TO REC-CT.
124600 DIV-TEST-F3-21-3.
124700     IF      WRK-DU-2V1-2 = 2.5
124800             PERFORM PASS
124900             PERFORM PRINT-DETAIL
125000     ELSE
125100             PERFORM FAIL
125200             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
125300             MOVE    2.5          TO CORRECT-N
125400             PERFORM PRINT-DETAIL.
125500     ADD 1 TO REC-CT.
125600 DIV-TEST-F3-21-4.
125700     IF      WRK-DU-2V0-2 = 3
125800             PERFORM PASS
125900             PERFORM PRINT-DETAIL
126000     ELSE
126100             PERFORM FAIL
126200             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
126300             MOVE    3            TO CORRECT-N
126400             PERFORM PRINT-DETAIL.
126500     ADD 1 TO REC-CT.
126600 DIV-TEST-F3-21-5.
126700     IF      WRK-DU-2V1-3 = 2.5
126800             PERFORM PASS
126900             PERFORM PRINT-DETAIL
127000     ELSE
127100             PERFORM FAIL
127200             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
127300             MOVE    2.5          TO CORRECT-N
127400             PERFORM PRINT-DETAIL.
127500     ADD 1 TO REC-CT.
127600 DIV-TEST-F3-21-6.
127700     IF      WRK-DU-2V0-3 = 2
127800             PERFORM PASS
127900             PERFORM PRINT-DETAIL
128000     ELSE
128100             PERFORM FAIL
128200             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
128300             MOVE    2            TO CORRECT-N
128400             PERFORM PRINT-DETAIL.
128500     ADD 1 TO REC-CT.
128600 DIV-TEST-F3-21-7.
128700     IF      WRK-XN-00001  = "0"
128800             PERFORM PASS
128900             PERFORM PRINT-DETAIL
129000     ELSE
129100             MOVE    WRK-XN-00001 TO COMPUTED-X
129200             MOVE   "0"           TO CORRECT-X
129300             MOVE   "DIV-TEST-F3-21-7" TO PAR-NAME
129400             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
129500                  TO RE-MARK
129600             PERFORM FAIL
129700             PERFORM PRINT-DETAIL.
129800*
129900*
130000 DIV-INIT-F3-22.
130100*            ==-->    SIZE ERROR CONDITION <--==
130200*            ==-->    NEW SIZE ERROR TESTS <--==
130300     MOVE   "DIV-TEST-F3-22" TO PAR-NAME.
130400     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
130500     MOVE   "0"  TO WRK-XN-00001.
130600     MOVE    0   TO WRK-DU-2V1-1.
130700     MOVE    0   TO WRK-DU-2V0-1.
130800     MOVE    0   TO WRK-DU-2V1-2.
130900     MOVE    0   TO WRK-DU-2V0-2.
131000     MOVE    0   TO WRK-DU-2V1-3.
131100     MOVE    0   TO WRK-DU-2V0-3.
131200     MOVE    1   TO REC-CT.
131300     MOVE    99  TO WRK-DU-2V0-1.
131400 DIV-TEST-F3-22-0.
131500     DIVIDE  WRK-DU-2V0-1 BY A01ONE-CS-00V01
131600      GIVING WRK-DU-2V1-1
131700             WRK-DU-2V0-1 ROUNDED
131800             WRK-DU-2V1-2
131900             WRK-DU-2V0-2 ROUNDED
132000             WRK-DU-2V1-3
132100             WRK-DU-2V0-3
132200      NOT ON SIZE ERROR
132300             MOVE  "1" TO WRK-XN-00001.
132400     GO TO   DIV-TEST-F3-22-1.
132500 DIV-DELETE-F3-22.
132600     PERFORM DE-LETE.
132700     PERFORM PRINT-DETAIL.
132800     GO TO   DIV-INIT-F3-23.
132900 DIV-TEST-F3-22-1.
133000     IF      WRK-DU-2V1-1 = 0
133100             PERFORM PASS
133200             PERFORM PRINT-DETAIL
133300     ELSE
133400             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
133500             PERFORM FAIL
133600             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
133700             MOVE    0            TO CORRECT-N
133800             PERFORM PRINT-DETAIL.
133900     ADD 1 TO REC-CT.
134000 DIV-TEST-F3-22-2.
134100     IF      WRK-DU-2V0-1 = 99
134200             PERFORM PASS
134300             PERFORM PRINT-DETAIL
134400     ELSE
134500             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
134600             PERFORM FAIL
134700             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
134800             MOVE    99           TO CORRECT-N
134900             PERFORM PRINT-DETAIL.
135000     ADD 1 TO REC-CT.
135100 DIV-TEST-F3-22-3.
135200     IF      WRK-DU-2V1-2 = 0
135300             PERFORM PASS
135400             PERFORM PRINT-DETAIL
135500     ELSE
135600             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
135700             PERFORM FAIL
135800             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
135900             MOVE    0            TO CORRECT-N
136000             PERFORM PRINT-DETAIL.
136100     ADD 1 TO REC-CT.
136200 DIV-TEST-F3-22-4.
136300     IF      WRK-DU-2V0-2 = 0
136400             PERFORM PASS
136500             PERFORM PRINT-DETAIL
136600     ELSE
136700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
136800             PERFORM FAIL
136900             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
137000             MOVE    0            TO CORRECT-N
137100             PERFORM PRINT-DETAIL.
137200     ADD 1 TO REC-CT.
137300 DIV-TEST-F3-22-5.
137400     IF      WRK-DU-2V1-3 = 0
137500             PERFORM PASS
137600             PERFORM PRINT-DETAIL
137700     ELSE
137800             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
137900             PERFORM FAIL
138000             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
138100             MOVE    0            TO CORRECT-N
138200             PERFORM PRINT-DETAIL.
138300     ADD 1 TO REC-CT.
138400 DIV-TEST-F3-22-6.
138500     IF      WRK-DU-2V0-3 = 0
138600             PERFORM PASS
138700             PERFORM PRINT-DETAIL
138800     ELSE
138900             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
139000             PERFORM FAIL
139100             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
139200             MOVE    0            TO CORRECT-N
139300             PERFORM PRINT-DETAIL.
139400     ADD 1 TO REC-CT.
139500 DIV-TEST-F3-22-7.
139600     IF      WRK-XN-00001  = "0"
139700             PERFORM PASS
139800             PERFORM PRINT-DETAIL
139900     ELSE
140000             MOVE    WRK-XN-00001 TO COMPUTED-X
140100             MOVE   "0"           TO CORRECT-X
140200             MOVE   "DIV-TEST-F3-22-7" TO PAR-NAME
140300             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
140400                  TO RE-MARK
140500             PERFORM FAIL
140600             PERFORM PRINT-DETAIL.
140700*
140800*
140900 DIV-INIT-F3-23.
141000*            ==--> NO SIZE ERROR CONDITION <--==
141100*            ==-->  NEW SIZE ERROR TESTS   <--==
141200     MOVE   "DIV-TEST-F3-23" TO PAR-NAME.
141300     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
141400     MOVE   "0"  TO WRK-XN-00001.
141500     MOVE    0   TO WRK-DU-2V1-1.
141600     MOVE    0   TO WRK-DU-2V1-2.
141700     MOVE    0   TO WRK-DU-2V0-2.
141800     MOVE    0   TO WRK-DU-2V1-3.
141900     MOVE    0   TO WRK-DU-2V0-3.
142000     MOVE    1   TO REC-CT.
142100     MOVE    10  TO WRK-DU-2V0-1.
142200     MOVE    3.9 TO WRK-DU-1V1-2.
142300 DIV-TEST-F3-23-0.
142400     DIVIDE  WRK-DU-2V0-1 BY WRK-DU-1V1-2
142500      GIVING WRK-DU-2V1-1
142600             WRK-DU-2V0-1 ROUNDED
142700             WRK-DU-2V1-2
142800             WRK-DU-2V0-2 ROUNDED
142900             WRK-DU-2V1-3
143000             WRK-DU-2V0-3
143100      NOT ON SIZE ERROR
143200             MOVE   "1" TO WRK-XN-00001.
143300     GO TO DIV-TEST-F3-23-1.
143400 DIV-DELETE-F3-23.
143500     PERFORM DE-LETE.
143600     PERFORM PRINT-DETAIL.
143700     GO TO   DIV-INIT-F3-24.
143800 DIV-TEST-F3-23-1.
143900     IF      WRK-DU-2V1-1 = 2.5
144000             PERFORM PASS
144100             PERFORM PRINT-DETAIL
144200     ELSE
144300             PERFORM FAIL
144400             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
144500             MOVE    2.5          TO CORRECT-N
144600             PERFORM PRINT-DETAIL.
144700     ADD 1 TO REC-CT.
144800 DIV-TEST-F3-23-2.
144900     IF      WRK-DU-2V0-1 = 3
145000             PERFORM PASS
145100             PERFORM PRINT-DETAIL
145200     ELSE
145300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
145400             PERFORM FAIL
145500             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
145600             MOVE    3            TO CORRECT-N
145700             PERFORM PRINT-DETAIL.
145800     ADD 1 TO REC-CT.
145900 DIV-TEST-F3-23-3.
146000     IF      WRK-DU-2V1-2 = 2.5
146100             PERFORM PASS
146200             PERFORM PRINT-DETAIL
146300     ELSE
146400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
146500             PERFORM FAIL
146600             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
146700             MOVE    2.5          TO CORRECT-N
146800             PERFORM PRINT-DETAIL.
146900     ADD 1 TO REC-CT.
147000 DIV-TEST-F3-23-4.
147100     IF      WRK-DU-2V0-2 = 3
147200             PERFORM PASS
147300             PERFORM PRINT-DETAIL
147400     ELSE
147500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
147600             PERFORM FAIL
147700             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
147800             MOVE    3            TO CORRECT-N
147900             PERFORM PRINT-DETAIL.
148000     ADD 1 TO REC-CT.
148100 DIV-TEST-F3-23-5.
148200     IF      WRK-DU-2V1-3 = 2.5
148300             PERFORM PASS
148400             PERFORM PRINT-DETAIL
148500     ELSE
148600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
148700             PERFORM FAIL
148800             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
148900             MOVE    2.5          TO CORRECT-N
149000             PERFORM PRINT-DETAIL.
149100     ADD 1 TO REC-CT.
149200 DIV-TEST-F3-23-6.
149300     IF      WRK-DU-2V0-3 = 2
149400             PERFORM PASS
149500             PERFORM PRINT-DETAIL
149600     ELSE
149700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
149800             PERFORM FAIL
149900             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
150000             MOVE    2            TO CORRECT-N
150100             PERFORM PRINT-DETAIL.
150200     ADD 1 TO REC-CT.
150300 DIV-TEST-F3-23-7.
150400     IF      WRK-XN-00001  = "1"
150500             PERFORM PASS
150600             PERFORM PRINT-DETAIL
150700     ELSE
150800             MOVE    WRK-XN-00001 TO COMPUTED-X
150900             MOVE   "1"           TO CORRECT-X
151000             MOVE   "DIV-TEST-F3-23-7" TO PAR-NAME
151100             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
151200                  TO RE-MARK
151300             PERFORM FAIL
151400             PERFORM PRINT-DETAIL.
151500*
151600*
151700 DIV-INIT-F3-24.
151800*            ==-->    SIZE ERROR CONDITION <--==
151900*            ==-->    NEW SIZE ERROR TESTS <--==
152000     MOVE   "DIV-TEST-F3-24" TO PAR-NAME.
152100     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
152200     MOVE   "0"  TO WRK-XN-00001.
152300     MOVE    0   TO WRK-DU-2V1-1.
152400     MOVE    0   TO WRK-DU-2V0-1.
152500     MOVE    0   TO WRK-DU-2V1-2.
152600     MOVE    0   TO WRK-DU-2V0-2.
152700     MOVE    0   TO WRK-DU-2V1-3.
152800     MOVE    0   TO WRK-DU-2V0-3.
152900     MOVE    1   TO REC-CT.
153000     MOVE    99  TO WRK-DU-2V0-1.
153100 DIV-TEST-F3-24-0.
153200     DIVIDE  WRK-DU-2V0-1 BY A01ONE-CS-00V01
153300      GIVING WRK-DU-2V1-1
153400             WRK-DU-2V0-1 ROUNDED
153500             WRK-DU-2V1-2
153600             WRK-DU-2V0-2 ROUNDED
153700             WRK-DU-2V1-3
153800             WRK-DU-2V0-3
153900          ON SIZE ERROR
154000             MOVE  "1" TO WRK-XN-00001
154100      NOT ON SIZE ERROR
154200             MOVE  "2" TO WRK-XN-00001.
154300     GO TO   DIV-TEST-F3-24-1.
154400 DIV-DELETE-F3-24.
154500     PERFORM DE-LETE.
154600     PERFORM PRINT-DETAIL.
154700     GO TO   DIV-INIT-F3-25.
154800 DIV-TEST-F3-24-1.
154900     IF      WRK-DU-2V1-1 = 0
155000             PERFORM PASS
155100             PERFORM PRINT-DETAIL
155200     ELSE
155300             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
155400             PERFORM FAIL
155500             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
155600             MOVE    0            TO CORRECT-N
155700             PERFORM PRINT-DETAIL.
155800     ADD 1 TO REC-CT.
155900 DIV-TEST-F3-24-2.
156000     IF      WRK-DU-2V0-1 = 99
156100             PERFORM PASS
156200             PERFORM PRINT-DETAIL
156300     ELSE
156400             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
156500             PERFORM FAIL
156600             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
156700             MOVE    99           TO CORRECT-N
156800             PERFORM PRINT-DETAIL.
156900     ADD 1 TO REC-CT.
157000 DIV-TEST-F3-24-3.
157100     IF      WRK-DU-2V1-2 = 0
157200             PERFORM PASS
157300             PERFORM PRINT-DETAIL
157400     ELSE
157500             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
157600             PERFORM FAIL
157700             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
157800             MOVE    0            TO CORRECT-N
157900             PERFORM PRINT-DETAIL.
158000     ADD 1 TO REC-CT.
158100 DIV-TEST-F3-24-4.
158200     IF      WRK-DU-2V0-2 = 0
158300             PERFORM PASS
158400             PERFORM PRINT-DETAIL
158500     ELSE
158600             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
158700             PERFORM FAIL
158800             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
158900             MOVE    0            TO CORRECT-N
159000             PERFORM PRINT-DETAIL.
159100     ADD 1 TO REC-CT.
159200 DIV-TEST-F3-24-5.
159300     IF      WRK-DU-2V1-3 = 0
159400             PERFORM PASS
159500             PERFORM PRINT-DETAIL
159600     ELSE
159700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
159800             PERFORM FAIL
159900             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
160000             MOVE    0            TO CORRECT-N
160100             PERFORM PRINT-DETAIL.
160200     ADD 1 TO REC-CT.
160300 DIV-TEST-F3-24-6.
160400     IF      WRK-DU-2V0-3 = 0
160500             PERFORM PASS
160600             PERFORM PRINT-DETAIL
160700     ELSE
160800             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
160900             PERFORM FAIL
161000             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
161100             MOVE    0            TO CORRECT-N
161200             PERFORM PRINT-DETAIL.
161300     ADD 1 TO REC-CT.
161400 DIV-TEST-F3-24-7.
161500     IF      WRK-XN-00001  = "1"
161600             PERFORM PASS
161700             PERFORM PRINT-DETAIL
161800     ELSE
161900             MOVE    WRK-XN-00001 TO COMPUTED-X
162000             MOVE   "1"           TO CORRECT-X
162100             MOVE   "DIV-TEST-F3-24-7" TO PAR-NAME
162200             MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
162300                  TO RE-MARK
162400             PERFORM FAIL
162500             PERFORM PRINT-DETAIL.
162600*
162700*
162800 DIV-INIT-F3-25.
162900*            ==--> NO SIZE ERROR CONDITION <--==
163000*            ==-->  NEW SIZE ERROR TESTS   <--==
163100     MOVE   "DIV-TEST-F3-25" TO PAR-NAME.
163200     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
163300     MOVE   "0"  TO WRK-XN-00001.
163400     MOVE    0   TO WRK-DU-2V1-1.
163500     MOVE    0   TO WRK-DU-2V1-2.
163600     MOVE    0   TO WRK-DU-2V0-2.
163700     MOVE    0   TO WRK-DU-2V1-3.
163800     MOVE    0   TO WRK-DU-2V0-3.
163900     MOVE    1   TO REC-CT.
164000     MOVE    10  TO WRK-DU-2V0-1.
164100     MOVE    3.9 TO WRK-DU-1V1-2.
164200 DIV-TEST-F3-25-0.
164300     DIVIDE  WRK-DU-2V0-1 BY WRK-DU-1V1-2
164400      GIVING WRK-DU-2V1-1
164500             WRK-DU-2V0-1 ROUNDED
164600             WRK-DU-2V1-2
164700             WRK-DU-2V0-2 ROUNDED
164800             WRK-DU-2V1-3
164900             WRK-DU-2V0-3
165000          ON SIZE ERROR
165100             MOVE   "1" TO WRK-XN-00001
165200      NOT ON SIZE ERROR
165300             MOVE   "2" TO WRK-XN-00001.
165400     GO TO DIV-TEST-F3-25-1.
165500 DIV-DELETE-F3-25.
165600     PERFORM DE-LETE.
165700     PERFORM PRINT-DETAIL.
165800     GO TO   DIV-INIT-F3-26.
165900 DIV-TEST-F3-25-1.
166000     IF      WRK-DU-2V1-1 = 2.5
166100             PERFORM PASS
166200             PERFORM PRINT-DETAIL
166300     ELSE
166400             PERFORM FAIL
166500             MOVE    WRK-DU-2V1-1 TO COMPUTED-N
166600             MOVE    2.5          TO CORRECT-N
166700             PERFORM PRINT-DETAIL.
166800     ADD 1 TO REC-CT.
166900 DIV-TEST-F3-25-2.
167000     IF      WRK-DU-2V0-1 = 3
167100             PERFORM PASS
167200             PERFORM PRINT-DETAIL
167300     ELSE
167400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
167500             PERFORM FAIL
167600             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
167700             MOVE    3            TO CORRECT-N
167800             PERFORM PRINT-DETAIL.
167900     ADD 1 TO REC-CT.
168000 DIV-TEST-F3-25-3.
168100     IF      WRK-DU-2V1-2 = 2.5
168200             PERFORM PASS
168300             PERFORM PRINT-DETAIL
168400     ELSE
168500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
168600             PERFORM FAIL
168700             MOVE    WRK-DU-2V1-2 TO COMPUTED-N
168800             MOVE    2.5          TO CORRECT-N
168900             PERFORM PRINT-DETAIL.
169000     ADD 1 TO REC-CT.
169100 DIV-TEST-F3-25-4.
169200     IF      WRK-DU-2V0-2 = 3
169300             PERFORM PASS
169400             PERFORM PRINT-DETAIL
169500     ELSE
169600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
169700             PERFORM FAIL
169800             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
169900             MOVE    3            TO CORRECT-N
170000             PERFORM PRINT-DETAIL.
170100     ADD 1 TO REC-CT.
170200 DIV-TEST-F3-25-5.
170300     IF      WRK-DU-2V1-3 = 2.5
170400             PERFORM PASS
170500             PERFORM PRINT-DETAIL
170600     ELSE
170700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
170800             PERFORM FAIL
170900             MOVE    WRK-DU-2V1-3 TO COMPUTED-N
171000             MOVE    2.5          TO CORRECT-N
171100             PERFORM PRINT-DETAIL.
171200     ADD 1 TO REC-CT.
171300 DIV-TEST-F3-25-6.
171400     IF      WRK-DU-2V0-3 = 2
171500             PERFORM PASS
171600             PERFORM PRINT-DETAIL
171700     ELSE
171800             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
171900             PERFORM FAIL
172000             MOVE    WRK-DU-2V0-3 TO COMPUTED-N
172100             MOVE    2            TO CORRECT-N
172200             PERFORM PRINT-DETAIL.
172300     ADD 1 TO REC-CT.
172400 DIV-TEST-F3-25-7.
172500     IF      WRK-XN-00001  = "2"
172600             PERFORM PASS
172700             PERFORM PRINT-DETAIL
172800     ELSE
172900             MOVE    WRK-XN-00001 TO COMPUTED-X
173000             MOVE   "2"           TO CORRECT-X
173100             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
173200                  TO RE-MARK
173300             PERFORM FAIL
173400             PERFORM PRINT-DETAIL.
173500*
173600*
173700 DIV-INIT-F3-26.
173800*            ==-->    SIZE ERROR CONDITION <--==
173900*            ==-->EXPLICIT SCOPE TERMINATOR<--==
174000     MOVE   "DIV-TEST-F3-26" TO PAR-NAME.
174100     MOVE   "1V-41 6.4.3" TO ANSI-REFERENCE.
174200     MOVE    44.1  TO DIV2.
174300     MOVE   -9.642 TO DIV4.
174400     MOVE    0     TO DIV10.
174500     MOVE    0     TO WRK-XN-00001.
174600     MOVE    0     TO WRK-DS-05V00.
174700     MOVE   "A"    TO XRAY.
174800     MOVE    1     TO REC-CT.
174900 DIV-TEST-F3-26-0.
175000     DIVIDE  DIV2 BY DIV4
175100      GIVING DIV10
175200          ON SIZE ERROR
175300             MOVE "P" TO XRAY
175400             MOVE "1" TO WRK-XN-00001
175500             MOVE  23 TO WRK-DS-05V00
175600     END-DIVIDE
175700     MOVE    99 TO WRK-CS-18V00.
175800     GO TO DIV-TEST-F3-26-1.
175900 DIV-DELETE-F3-26.
176000     PERFORM DE-LETE.
176100     PERFORM PRINT-DETAIL.
176200     GO TO   DIV-INIT-F3-27.
176300 DIV-TEST-F3-26-1.
176400     MOVE   "DIV-TEST-F3-26-1" TO PAR-NAME.
176500     IF      DIV10  = 0
176600             PERFORM PASS
176700             PERFORM PRINT-DETAIL
176800     ELSE
176900             MOVE    DIV10 TO COMPUTED-N
177000             MOVE    0     TO CORRECT-N
177100             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
177200             PERFORM FAIL
177300             PERFORM PRINT-DETAIL.
177400     ADD     1 TO REC-CT.
177500 DIV-TEST-F3-26-2.
177600     MOVE   "DIV-TEST-F3-26-2" TO PAR-NAME.
177700     IF      XRAY    = "P"
177800             PERFORM PASS
177900             PERFORM PRINT-DETAIL
178000     ELSE
178100             MOVE    XRAY  TO COMPUTED-X
178200             MOVE   "P"    TO CORRECT-X
178300             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
178400             PERFORM FAIL
178500             PERFORM PRINT-DETAIL.
178600     ADD     1 TO REC-CT.
178700 DIV-TEST-F3-26-3.
178800     MOVE   "DIV-TEST-F3-26-3" TO PAR-NAME.
178900     IF      WRK-XN-00001 = "1"
179000             PERFORM PASS
179100             PERFORM PRINT-DETAIL
179200     ELSE
179300             MOVE    WRK-XN-00001  TO COMPUTED-X
179400             MOVE   "1"            TO CORRECT-X
179500             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
179600             PERFORM FAIL
179700             PERFORM PRINT-DETAIL.
179800     ADD     1 TO REC-CT.
179900 DIV-TEST-F3-26-4.
180000     MOVE   "DIV-TEST-F3-26-4" TO PAR-NAME.
180100     IF      WRK-DS-05V00 = 23
180200             PERFORM PASS
180300             PERFORM PRINT-DETAIL
180400     ELSE
180500             MOVE    WRK-DS-05V00  TO COMPUTED-N
180600             MOVE    23            TO CORRECT-N
180700             MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK
180800             PERFORM FAIL
180900             PERFORM PRINT-DETAIL.
181000     ADD     1 TO REC-CT.
181100 DIV-TEST-F3-26-5.
181200     MOVE   "DIV-TEST-F3-26-5" TO PAR-NAME.
181300     IF      WRK-CS-18V00 = 000000000000000099
181400             PERFORM PASS
181500             PERFORM PRINT-DETAIL
181600     ELSE
181700             MOVE    WRK-CS-18V00  TO COMPUTED-N
181800             MOVE    000000000000000099  TO CORRECT-N
181900             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
182000             PERFORM FAIL
182100             PERFORM PRINT-DETAIL.
182200*
182300*
182400 DIV-INIT-F3-27.
182500*            ==--> NO SIZE ERROR CONDITION <--==
182600*            ==-->EXPLICIT SCOPE TERMINATOR<--==
182700     MOVE   "DIV-TEST-F3-27" TO PAR-NAME.
182800     MOVE   "1V-41 6.4.3" TO ANSI-REFERENCE.
182900     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
183000     MOVE   "0" TO WRK-XN-00001.
183100     MOVE    0  TO WRK-DS-05V00.
183200     MOVE    0  TO WRK-DS-02V00.
183300     MOVE    0  TO WRK-CS-18V00.
183400     MOVE    1  TO REC-CT.
183500 DIV-TEST-F3-27-0.
183600     DIVIDE  WRK-DS-09V09 BY A18ONES-DS-09V09
183700      GIVING WRK-DS-09V09
183800          ON SIZE ERROR
183900             MOVE "1" TO WRK-XN-00001
184000             MOVE  23 TO WRK-DS-05V00
184100             MOVE  -4 TO WRK-DS-02V00
184200     END-DIVIDE
184300     MOVE    99 TO WRK-CS-18V00.
184400     GO TO   DIV-TEST-F3-27-1.
184500 DIV-DELETE-F3-27-1.
184600     PERFORM DE-LETE.
184700     PERFORM PRINT-DETAIL.
184800     GO TO   DIV-INIT-F3-28.
184900 DIV-TEST-F3-27-1.
185000     MOVE   "DIV-TEST-F3-27-1" TO PAR-NAME.
185100     IF      WRK-DS-18V00-S = 000000001000000000
185200             PERFORM PASS
185300             PERFORM PRINT-DETAIL
185400     ELSE
185500             MOVE    000000001000000000 TO CORRECT-18V0
185600             MOVE    WRK-DS-18V00-S     TO COMPUTED-18V0
185700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
185800             PERFORM FAIL
185900             PERFORM PRINT-DETAIL.
186000     ADD     1 TO REC-CT.
186100 DIV-TEST-F3-27-2.
186200     MOVE   "DIV-TEST-F3-27-2" TO PAR-NAME.
186300     IF      WRK-DS-02V00 = 00
186400             PERFORM PASS
186500             PERFORM PRINT-DETAIL
186600     ELSE
186700             MOVE    WRK-DS-02V00  TO COMPUTED-N
186800             MOVE    00            TO CORRECT-N
186900             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
187000                  TO RE-MARK
187100             PERFORM FAIL
187200             PERFORM PRINT-DETAIL.
187300     ADD     1 TO REC-CT.
187400 DIV-TEST-F3-27-3.
187500     MOVE   "DIV-TEST-F3-27-3" TO PAR-NAME.
187600     IF      WRK-XN-00001 = "0"
187700             PERFORM PASS
187800             PERFORM PRINT-DETAIL
187900     ELSE
188000             MOVE    WRK-XN-00001  TO COMPUTED-X
188100             MOVE   "0"            TO CORRECT-X
188200             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
188300                  TO RE-MARK
188400             PERFORM FAIL
188500             PERFORM PRINT-DETAIL.
188600     ADD     1 TO REC-CT.
188700 DIV-TEST-F3-27-4.
188800     MOVE   "DIV-TEST-F3-27-4" TO PAR-NAME.
188900     IF      WRK-DS-05V00 = 0
189000             PERFORM PASS
189100             PERFORM PRINT-DETAIL
189200     ELSE
189300             MOVE    WRK-DS-05V00  TO COMPUTED-N
189400             MOVE    0             TO CORRECT-N
189500             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
189600                  TO RE-MARK
189700             PERFORM FAIL
189800             PERFORM PRINT-DETAIL.
189900     ADD     1 TO REC-CT.
190000 DIV-TEST-F3-27-5.
190100     MOVE   "DIV-TEST-F3-27-5" TO PAR-NAME.
190200     IF      WRK-CS-18V00 = 000000000000000099
190300             PERFORM PASS
190400             PERFORM PRINT-DETAIL
190500     ELSE
190600             MOVE    WRK-DS-18V00  TO COMPUTED-N
190700             MOVE    000000000000000099  TO CORRECT-N
190800             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
190900             PERFORM FAIL
191000             PERFORM PRINT-DETAIL.
191100*
191200 DIV-INIT-F3-28.
191300*            ==-->    SIZE ERROR CONDITION <--==
191400*            ==-->EXPLICIT SCOPE TERMINATOR<--==
191500     MOVE   "DIV-TEST-F3-28" TO PAR-NAME.
191600     MOVE   "1V-41 6.4.3" TO ANSI-REFERENCE.
191700     MOVE    44.1  TO DIV2.
191800     MOVE   -9.642 TO DIV4.
191900     MOVE    0     TO DIV10.
192000     MOVE   "0"    TO WRK-XN-00001.
192100     MOVE    0     TO WRK-DS-05V00.
192200     MOVE   "A"    TO XRAY.
192300     MOVE    1 TO REC-CT.
192400 DIV-TEST-F3-28-0.
192500     DIVIDE  DIV2 BY DIV4
192600      GIVING DIV10
192700      NOT ON SIZE ERROR
192800             MOVE "P" TO XRAY
192900             MOVE "1" TO WRK-XN-00001
193000             MOVE  23 TO WRK-DS-05V00
193100     END-DIVIDE
193200     MOVE    99 TO WRK-CS-18V00.
193300     GO TO DIV-TEST-F3-28-1.
193400 DIV-DELETE-F3-28-1.
193500     PERFORM DE-LETE.
193600     PERFORM PRINT-DETAIL.
193700     GO TO   DIV-INIT-F3-29.
193800 DIV-TEST-F3-28-1.
193900     MOVE   "DIV-TEST-F3-28-1" TO PAR-NAME.
194000     IF      DIV10   = 0
194100             PERFORM PASS
194200             PERFORM PRINT-DETAIL
194300     ELSE
194400             MOVE    DIV10 TO COMPUTED-N
194500             MOVE    0     TO CORRECT-N
194600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
194700                  TO RE-MARK
194800             PERFORM FAIL
194900             PERFORM PRINT-DETAIL.
195000     ADD     1 TO REC-CT.
195100 DIV-TEST-F3-28-2.
195200     MOVE   "DIV-TEST-F3-28-2" TO PAR-NAME.
195300     IF      XRAY    = "A"
195400             PERFORM PASS
195500             PERFORM PRINT-DETAIL
195600     ELSE
195700             MOVE    XRAY  TO COMPUTED-X
195800             MOVE   "A"    TO CORRECT-X
195900             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
196000                  TO RE-MARK
196100             PERFORM FAIL
196200             PERFORM PRINT-DETAIL.
196300     ADD     1 TO REC-CT.
196400 DIV-TEST-F3-28-3.
196500     MOVE   "DIV-TEST-F3-28-3" TO PAR-NAME.
196600     IF      WRK-XN-00001 = "0"
196700             PERFORM PASS
196800             PERFORM PRINT-DETAIL
196900     ELSE
197000             MOVE    WRK-XN-00001  TO COMPUTED-X
197100             MOVE   "0"            TO CORRECT-X
197200             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
197300                  TO RE-MARK
197400             PERFORM FAIL
197500             PERFORM PRINT-DETAIL.
197600     ADD     1 TO REC-CT.
197700 DIV-TEST-F3-28-4.
197800     MOVE   "DIV-TEST-F3-28-4" TO PAR-NAME.
197900     IF      WRK-DS-05V00 = 00000
198000             PERFORM PASS
198100             PERFORM PRINT-DETAIL
198200     ELSE
198300             MOVE    WRK-DS-05V00  TO COMPUTED-N
198400             MOVE    00000         TO CORRECT-N
198500             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
198600                  TO RE-MARK
198700             PERFORM FAIL
198800             PERFORM PRINT-DETAIL.
198900     ADD     1 TO REC-CT.
199000 DIV-TEST-F3-28-5.
199100     MOVE   "DIV-TEST-F3-28-5" TO PAR-NAME.
199200     IF      WRK-CS-18V00 = 000000000000000099
199300             PERFORM PASS
199400             PERFORM PRINT-DETAIL
199500     ELSE
199600             MOVE    WRK-DS-18V00  TO COMPUTED-N
199700             MOVE    000000000000000099  TO CORRECT-N
199800             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
199900             PERFORM FAIL
200000             PERFORM PRINT-DETAIL.
200100*
200200*
200300 DIV-INIT-F3-29.
200400*            ==--> NO SIZE ERROR CONDITION <--==
200500*            ==-->EXPLICIT SCOPE TERMINATOR<--==
200600     MOVE   "DIV-TEST-F3-29" TO PAR-NAME.
200700     MOVE   "1V-41 6.4.3" TO ANSI-REFERENCE.
200800     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
200900     MOVE   "0" TO WRK-XN-00001.
201000     MOVE    0  TO WRK-DS-05V00.
201100     MOVE    0  TO WRK-DS-02V00.
201200     MOVE    0  TO WRK-CS-18V00.
201300     MOVE    1 TO REC-CT.
201400 DIV-TEST-F3-29-0.
201500     DIVIDE  WRK-DS-09V09 BY A18ONES-DS-09V09
201600      GIVING WRK-DS-09V09
201700      NOT ON SIZE ERROR
201800             MOVE "1" TO WRK-XN-00001
201900             MOVE  23 TO WRK-DS-05V00
202000             MOVE  -4 TO WRK-DS-02V00
202100     END-DIVIDE
202200     MOVE    99 TO WRK-CS-18V00.
202300     GO TO   DIV-TEST-F3-29-1.
202400 DIV-DELETE-F3-29-1.
202500     PERFORM DE-LETE.
202600     PERFORM PRINT-DETAIL.
202700     GO TO   DIV-INIT-F3-30.
202800 DIV-TEST-F3-29-1.
202900     MOVE   "DIV-TEST-F3-29-1" TO PAR-NAME.
203000     IF      WRK-DS-18V00-S = 000000001000000000
203100             PERFORM PASS
203200             PERFORM PRINT-DETAIL
203300     ELSE
203400             MOVE    000000001000000000 TO CORRECT-18V0
203500             MOVE    WRK-DS-18V00-S     TO COMPUTED-18V0
203600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
203700             PERFORM FAIL
203800             PERFORM PRINT-DETAIL.
203900     ADD     1 TO REC-CT.
204000 DIV-TEST-F3-29-2.
204100     MOVE   "DIV-TEST-F3-29-2" TO PAR-NAME.
204200     IF      WRK-DS-02V00 = -4
204300             PERFORM PASS
204400             PERFORM PRINT-DETAIL
204500     ELSE
204600             MOVE    WRK-DS-02V00  TO COMPUTED-N
204700             MOVE   -4             TO CORRECT-N
204800             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
204900                  TO RE-MARK
205000             PERFORM FAIL
205100             PERFORM PRINT-DETAIL.
205200     ADD     1 TO REC-CT.
205300 DIV-TEST-F3-29-3.
205400     MOVE   "DIV-TEST-F3-29-3" TO PAR-NAME.
205500     IF      WRK-XN-00001 = "1"
205600             PERFORM PASS
205700             PERFORM PRINT-DETAIL
205800     ELSE
205900             MOVE    WRK-XN-00001  TO COMPUTED-X
206000             MOVE   "1"            TO CORRECT-X
206100             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
206200                  TO RE-MARK
206300             PERFORM FAIL
206400             PERFORM PRINT-DETAIL.
206500     ADD     1 TO REC-CT.
206600 DIV-TEST-F3-29-4.
206700     MOVE   "DIV-TEST-F3-29-4" TO PAR-NAME.
206800     IF      WRK-DS-05V00 = 23
206900             PERFORM PASS
207000             PERFORM PRINT-DETAIL
207100     ELSE
207200             MOVE    WRK-DS-05V00  TO COMPUTED-N
207300             MOVE    23            TO CORRECT-N
207400             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
207500                  TO RE-MARK
207600             PERFORM FAIL
207700             PERFORM PRINT-DETAIL.
207800     ADD     1 TO REC-CT.
207900 DIV-TEST-F3-29-5.
208000     MOVE   "DIV-TEST-F3-29-5" TO PAR-NAME.
208100     IF      WRK-CS-18V00 = 000000000000000099
208200             PERFORM PASS
208300             PERFORM PRINT-DETAIL
208400     ELSE
208500             MOVE    WRK-DS-18V00  TO COMPUTED-N
208600             MOVE    000000000000000099  TO CORRECT-N
208700             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
208800             PERFORM FAIL
208900             PERFORM PRINT-DETAIL.
209000*
209100 DIV-INIT-F3-30.
209200*            ==-->    SIZE ERROR CONDITION <--==
209300*            ==-->EXPLICIT SCOPE TERMINATOR<--==
209400     MOVE   "DIV-TEST-F3-30" TO PAR-NAME.
209500     MOVE   "1V-41 6.4.3" TO ANSI-REFERENCE.
209600     MOVE    44.1  TO DIV2.
209700     MOVE   -9.642 TO DIV4.
209800     MOVE    0     TO DIV10.
209900     MOVE    0     TO WRK-CS-18V00.
210000     MOVE   "A"    TO XRAY.
210100     MOVE    1     TO REC-CT.
210200 DIV-TEST-F3-30-0.
210300     DIVIDE  DIV2 BY DIV4
210400      GIVING DIV10
210500          ON SIZE ERROR
210600             MOVE "E" TO XRAY
210700      NOT ON SIZE ERROR
210800             MOVE "N" TO XRAY
210900     END-DIVIDE
211000     MOVE    99 TO WRK-CS-18V00.
211100     GO TO DIV-TEST-F3-30-1.
211200 DIV-DELETE-F3-30.
211300     PERFORM DE-LETE.
211400     PERFORM PRINT-DETAIL.
211500     GO TO   DIV-INIT-F3-31.
211600 DIV-TEST-F3-30-1.
211700     MOVE   "DIV-TEST-F3-30-1" TO PAR-NAME.
211800     IF      DIV10   = 0
211900             PERFORM PASS
212000             PERFORM PRINT-DETAIL
212100     ELSE
212200             MOVE    DIV10 TO COMPUTED-N
212300             MOVE    0     TO CORRECT-N
212400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
212500                  TO RE-MARK
212600             PERFORM FAIL
212700             PERFORM PRINT-DETAIL.
212800     ADD     1 TO REC-CT.
212900 DIV-TEST-F3-30-2.
213000     MOVE   "DIV-TEST-F3-30-2" TO PAR-NAME.
213100     IF      XRAY    = "E"
213200             PERFORM PASS
213300             PERFORM PRINT-DETAIL
213400     ELSE
213500             MOVE    XRAY  TO COMPUTED-X
213600             MOVE   "E"    TO CORRECT-X
213700             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
213800                  TO RE-MARK
213900             PERFORM FAIL
214000             PERFORM PRINT-DETAIL.
214100     ADD     1 TO REC-CT.
214200 DIV-TEST-F3-30-3.
214300     MOVE   "DIV-TEST-F3-30-3" TO PAR-NAME.
214400     IF      WRK-CS-18V00 = 000000000000000099
214500             PERFORM PASS
214600             PERFORM PRINT-DETAIL
214700     ELSE
214800             MOVE    WRK-DS-18V00  TO COMPUTED-N
214900             MOVE    000000000000000099  TO CORRECT-N
215000             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
215100             PERFORM FAIL
215200             PERFORM PRINT-DETAIL.
215300*
215400 DIV-INIT-F3-31.
215500*            ==--> NO SIZE ERROR CONDITION <--==
215600*            ==-->EXPLICIT SCOPE TERMINATOR<--==
215700     MOVE   "DIV-TEST-F3-31" TO PAR-NAME.
215800     MOVE   "1V-41 6.4.3" TO ANSI-REFERENCE.
215900     MOVE    0 TO WRK-CS-18V00.
216000     MOVE   "A" TO XRAY.
216100     MOVE    1  TO REC-CT.
216200     MOVE    A18ONES-DS-09V09 TO WRK-DS-09V09.
216300 DIV-TEST-F3-31-0.
216400     DIVIDE  WRK-DS-09V09 BY A18ONES-DS-09V09
216500      GIVING WRK-DS-09V09
216600          ON SIZE ERROR
216700             MOVE "E" TO XRAY
216800      NOT ON SIZE ERROR
216900             MOVE "N" TO XRAY
217000     END-DIVIDE
217100     MOVE    99 TO WRK-CS-18V00.
217200     GO TO   DIV-TEST-F3-31-1.
217300 DIV-DELETE-F3-31.
217400     PERFORM DE-LETE.
217500     PERFORM PRINT-DETAIL.
217600     GO TO   CCVS-EXIT.
217700 DIV-TEST-F3-31-1.
217800     MOVE   "DIV-TEST-F3-31-1" TO PAR-NAME.
217900     IF      WRK-DS-18V00-S = 000000001000000000
218000             PERFORM PASS
218100             PERFORM PRINT-DETAIL
218200     ELSE
218300             MOVE    000000001000000000 TO CORRECT-18V0
218400             MOVE    WRK-DS-18V00-S     TO COMPUTED-18V0
218500             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
218600             PERFORM FAIL
218700             PERFORM PRINT-DETAIL.
218800     ADD     1 TO REC-CT.
218900 DIV-TEST-F3-31-2.
219000     MOVE   "DIV-TEST-F3-31-2" TO PAR-NAME.
219100     IF      XRAY    = "N"
219200             PERFORM PASS
219300             PERFORM PRINT-DETAIL
219400     ELSE
219500             MOVE    XRAY  TO COMPUTED-X
219600             MOVE   "N"    TO CORRECT-X
219700             MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
219800                  TO RE-MARK
219900             PERFORM FAIL
220000             PERFORM PRINT-DETAIL.
220100     ADD     1 TO REC-CT.
220200 DIV-TEST-F3-31-3.
220300     MOVE   "DIV-TEST-F3-31-3" TO PAR-NAME.
220400     IF      WRK-CS-18V00 = 000000000000000099
220500             PERFORM PASS
220600             PERFORM PRINT-DETAIL
220700     ELSE
220800             MOVE    WRK-DS-18V00  TO COMPUTED-N
220900             MOVE    000000000000000099  TO CORRECT-N
221000             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
221100             PERFORM FAIL
221200             PERFORM PRINT-DETAIL.
221300*
221400*
221500*
221600 CCVS-EXIT SECTION.
221700 CCVS-999999.
221800     GO TO CLOSE-FILES.
