000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC170A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    THIS PROGRAM TESTS THE FORMAT 2 MULTIPLY STATEMENT FOUND
002300*    IN LEVEL 1.   ALL COMBINATIONS OF THE OPTIONAL PHRASES
002400*    "SIZE ERROR", "NOT SIZE ERROR" AND "END-MULTIPLY" ARE
002500*    TESTED, AS WELL AS THE ROUNDED OPTION.
002600*
002700*    VARIOUS COMBINATIONS OF SIGNED AND UNSIGNED NUMERIC
002800*    LITERALS, DISPLAY AND COMPUTATIONAL FIELDS ARE USED
002900*    AS OPERANDS.
003000*
003100
003200 ENVIRONMENT DIVISION.
003300 CONFIGURATION SECTION.
003400 SOURCE-COMPUTER.
003500     XXXXX082.
003600 OBJECT-COMPUTER.
003700     XXXXX083.
003800 INPUT-OUTPUT SECTION.
003900 FILE-CONTROL.
004000     SELECT PRINT-FILE ASSIGN TO
004100     XXXXX055.
004200 DATA DIVISION.
004300 FILE SECTION.
004400 FD  PRINT-FILE.
004500 01  PRINT-REC PICTURE X(120).
004600 01  DUMMY-RECORD PICTURE X(120).
004700 WORKING-STORAGE SECTION.
004800 77  WRK-DS-18V00                PICTURE S9(18).
004900 77  A06THREES-DS-03V03          PICTURE S999V999 VALUE 333.333.
005000 77  WRK-DS-06V06                PICTURE S9(6)V9(6).
005100 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06 PICTURE S9(12).
005200 77  A08TWOS-DS-02V06            PICTURE S99V9(6) VALUE 22.222222.
005300 77  WRK-DS-10V00                PICTURE S9(10).
005400 77  WRK-XN-00001                PICTURE X.
005500 77  A10ONES-DS-10V00            PICTURE S9(10)
005600                                 VALUE 1111111111.
005700 77  A12THREES-DS-06V06          PICTURE S9(6)V9(6)
005800                                 VALUE 333333.333333.
005900 77  WRK-DS-02V00                PICTURE S99.
006000 77  AZERO-DS-05V05              PICTURE S9(5)V9(5) VALUE ZERO.
006100 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
006200 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09 PICTURE S9(18).
006300 77  A05ONES-DS-00V05            PICTURE SV9(5) VALUE .11111.
006400 77  A12ONES-DS-12V00            PICTURE S9(12)
006500                                 VALUE 111111111111.
006600 77  A01ONE-DS-P0801             PICTURE SP(8)9 VALUE .000000001.
006700 77  WRK-DS-09V08                PICTURE S9(9)V9(8).
006800 77  WRK-DS-17V00-S REDEFINES WRK-DS-09V08 PICTURE S9(17).
006900 77  A18ONES-DS-18V00            PICTURE S9(18)
007000                                 VALUE 111111111111111111.
007100 77  WRK-DS-0201P                PICTURE S99P.
007200 77  WRK-CS-18V00                PICTURE S9(18) COMPUTATIONAL.
007300 77  WRK-DU-18V00                PICTURE 9(18).
007400 77  A99-CS-02V00                PICTURE S99 COMPUTATIONAL
007500                                 VALUE 99.
007600 77  A01ONE-CS-00V01             PICTURE SV9 COMPUTATIONAL
007700                                 VALUE .1.
007800 77  A99-DS-02V00                PICTURE S99   VALUE 99.
007900 77  WRK-DS-12V00                PICTURE S9(12).
008000 77  WRK-DS-01V00                PICTURE S9.
008100 77  WRK-DS-03V10                PICTURE S9(3)V9(10).
008200 77  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
008300                                 VALUE 111111111.111111111.
008400 77  A02TWOS-DU-02V00            PICTURE 99  VALUE 22.
008500 77  WRK-DS-05V00                PICTURE S9(5).
008600 77  A02TWOS-DS-03V02            PICTURE S999V99 VALUE +022.00.
008700 77  WRK-CS-02V02                PICTURE S99V99  COMPUTATIONAL.
008800 77  A990-DS-0201P               PICTURE S99P   VALUE +990.
008900 77  XRAY                        PICTURE X.
009000 01  WRK-XN-18-1 PIC X(18).
009100 01  WRK-AN-X-18-1, REDEFINES WRK-XN-18-1 PIC A(18).
009200 01  WRK-DU-X-18V0-1; REDEFINES WRK-XN-18-1 PIC 9(18).
009300 01  WRK-DU-0V1-1 PIC V9 VALUE .3.
009400 01  WRK-DU-0V2-1 PIC V99 VALUE .25.
009500 01  WRK-DU-0V12-1 PIC V9(12) VALUE .00001.
009600 01  WRK-DU-1V0-1 PIC 9 VALUE ZERO.
009700 01  WRK-DU-1V1-1 PIC 9V9 VALUE 1.1.
009800 01  WRK-DU-1V1-2 PIC 9V9 VALUE 2.4.
009900 01  WRK-DU-1V3-1 PIC 9V999 VALUE 1.001.
010000 01  WRK-DU-1V3-2 PIC 9V999 VALUE 1.001.
010100 01  WRK-DU-1V5-1 PIC 9V9(5).
010200 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
010300 01  WRK-DU-2P6-1 PIC 99P(6) VALUE 99000000.
010400 01  WRK-DU-2V0-1 PIC 99.
010500 01  WRK-DU-2V0-2 PIC 99.
010600 01  WRK-DU-2V0-3 PIC 99.
010700 01  WRK-DU-2V1-1 PIC 99V9.
010800 01  WRK-DU-2V1-2 PIC 99V9.
010900 01  WRK-DU-2V1-3 PIC 99V9.
011000 01  WRK-DU-2V2-1 PIC 99V99 VALUE 15.44.
011100 01  WRK-DU-2V2-2 PIC 99V99 VALUE 60.89.
011200 01  WRK-DU-2V2-3 PIC 99V99 VALUE 60.99.
011300 01  WRK-DU-2V2-4 PIC 99V99 VALUE 60.99.
011400 01  WRK-DU-2V2-5 PIC 99V99 VALUE 10.00.
011500 01  WRK-DU-2V5-1 PIC 99V9(5).
011600 01  WRK-DU-4P1-1 PIC P(4)9 VALUE .00001.
011700 01  WRK-DU-5V1-1 PIC 9(5)V9 VALUE 12345.6.
011800 01  WRK-DU-6V0-1 PIC 9(6) VALUE 99999.
011900 01  WRK-DU-6V0-2 PIC 9(6) VALUE 99999.
012000 01  WRK-DU-16V2-1 PIC 9(16)V99 VALUE 9999999999999999.99.
012100 01  WRK-NE-X-1 PIC 9(16).99.
012200 01  WRK-DS-1V0-1 PIC S9 VALUE -3.
012300 01  WRK-DS-1V0-2 PIC S9 VALUE 2.
012400 01  WRK-DS-1V2-1 PIC S9V99 VALUE ZERO.
012500 01  WRK-DS-2V0-1 PIC S99 VALUE ZERO.
012600 01  WRK-DS-2V1-1 PIC S99V9 VALUE ZERO.
012700 01  WRK-DS-2V2-1 PIC S99V99 VALUE ZERO.
012800 01  WRK-DS-2V2-2 PIC S99V99 VALUE -12.34.
012900 01  WRK-DS-16V2-1 PIC S9(16)V99 VALUE -9999999999999999.99.
013000 01  WRK-NE-X-2 PIC -9(16).99.
013100 01  WRK-NE-1 PIC .9999/99999,99999,99.
013200 01  WRK-NE-2 PIC $**.99.
013300 01  WRK-NE-3 PIC $99.99CR.
013400 01  WRK-NE-4 PIC $*9.99 VALUE ZERO.
013500 77  A01ONES-CS-18V00   PICTURE S9(18) COMPUTATIONAL
013600             VALUE +000000000000000001.
013700 77  A02THREES-CS-18V00 PICTURE S9(18) COMPUTATIONAL
013800             VALUE -000000000000000033.
013900 77  A18SIXES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014000             VALUE 666666666666666666.
014100 77  A16NINES-CU-18V00  PICTURE 9(18) COMPUTATIONAL
014200             VALUE 009999999999999999.
014300 77  A14TWOS-CU-18V00   PICTURE 9(18) COMPUTATIONAL
014400             VALUE 000022222222222222.
014500 01  MULTIPLY-DATA.
014600     02 MULT1                           PICTURE IS 999V99
014700     VALUE IS 80.12.
014800     02 MULT2                           PICTURE IS 999V999.
014900     02 MULT3                           PICTURE IS $$99.99.
015000     02 MULT4                           PICTURE IS S99
015100     VALUE IS -56.
015200     02 MULT5                           PICTURE IS 9 VALUE IS 4.
015300     02 MULT6                           PICTURE IS 99 VALUE IS
015400     20.
015500 01  DIVIDE-DATA.
015600     02 DIV1                            PICTURE IS 9(4)V99
015700     VALUE IS 1620.36.
015800     02 DIV2                            PICTURE IS 99V9
015900     VALUE IS 44.1.
016000     02 DIV3                            PICTURE IS 9(4)V9
016100     VALUE IS 1661.7.
016200     02 DIV4                            PICTURE IS S9V999
016300     VALUE IS -9.642.
016400     02 DIV-02LEVEL-1.
016500     03 DIV5                            PICTURE IS V99
016600     VALUE IS .82.
016700     03 DIV6                            PICTURE IS 9 VALUE IS 0.
016800     03 DIV7                            PICTURE IS 9V9
016900     VALUE IS 9.6.
017000 01  DIV-DATA-2.
017100     02 DIV8                            PICTURE IS 99V9.
017200     02 DIV9                            PICTURE IS ZZ,ZZZ.9.
017300     02 DIV10                           PICTURE IS V999.
017400 01  TEST-RESULTS.
017500     02 FILLER                   PIC X      VALUE SPACE.
017600     02 FEATURE                  PIC X(20)  VALUE SPACE.
017700     02 FILLER                   PIC X      VALUE SPACE.
017800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
017900     02 FILLER                   PIC X      VALUE SPACE.
018000     02  PAR-NAME.
018100       03 FILLER                 PIC X(19)  VALUE SPACE.
018200       03  PARDOT-X              PIC X      VALUE SPACE.
018300       03 DOTVALUE               PIC 99     VALUE ZERO.
018400     02 FILLER                   PIC X(8)   VALUE SPACE.
018500     02 RE-MARK                  PIC X(61).
018600 01  TEST-COMPUTED.
018700     02 FILLER                   PIC X(30)  VALUE SPACE.
018800     02 FILLER                   PIC X(17)  VALUE
018900            "       COMPUTED=".
019000     02 COMPUTED-X.
019100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
019200     03 COMPUTED-N               REDEFINES COMPUTED-A
019300                                 PIC -9(9).9(9).
019400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
019500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
019600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
019700     03       CM-18V0 REDEFINES COMPUTED-A.
019800         04 COMPUTED-18V0                    PIC -9(18).
019900         04 FILLER                           PIC X.
020000     03 FILLER PIC X(50) VALUE SPACE.
020100 01  TEST-CORRECT.
020200     02 FILLER PIC X(30) VALUE SPACE.
020300     02 FILLER PIC X(17) VALUE "       CORRECT =".
020400     02 CORRECT-X.
020500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
020700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
020900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
021000     03      CR-18V0 REDEFINES CORRECT-A.
021100         04 CORRECT-18V0                     PIC -9(18).
021200         04 FILLER                           PIC X.
021300     03 FILLER PIC X(2) VALUE SPACE.
021400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021500 01  CCVS-C-1.
021600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
021700-    "SS  PARAGRAPH-NAME
021800-    "       REMARKS".
021900     02 FILLER                     PIC X(20)    VALUE SPACE.
022000 01  CCVS-C-2.
022100     02 FILLER                     PIC X        VALUE SPACE.
022200     02 FILLER                     PIC X(6)     VALUE "TESTED".
022300     02 FILLER                     PIC X(15)    VALUE SPACE.
022400     02 FILLER                     PIC X(4)     VALUE "FAIL".
022500     02 FILLER                     PIC X(94)    VALUE SPACE.
022600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
022700 01  REC-CT                        PIC 99       VALUE ZERO.
022800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
022900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
023000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
023100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
023200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
023300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
023400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
023500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
023600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
023700 01  CCVS-H-1.
023800     02  FILLER                    PIC X(39)    VALUE SPACES.
023900     02  FILLER                    PIC X(42)    VALUE
024000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024100     02  FILLER                    PIC X(39)    VALUE SPACES.
024200 01  CCVS-H-2A.
024300   02  FILLER                        PIC X(40)  VALUE SPACE.
024400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
024500   02  FILLER                        PIC XXXX   VALUE
024600     "4.2 ".
024700   02  FILLER                        PIC X(28)  VALUE
024800            " COPY - NOT FOR DISTRIBUTION".
024900   02  FILLER                        PIC X(41)  VALUE SPACE.
025000
025100 01  CCVS-H-2B.
025200   02  FILLER                        PIC X(15)  VALUE
025300            "TEST RESULT OF ".
025400   02  TEST-ID                       PIC X(9).
025500   02  FILLER                        PIC X(4)   VALUE
025600            " IN ".
025700   02  FILLER                        PIC X(12)  VALUE
025800     " HIGH       ".
025900   02  FILLER                        PIC X(22)  VALUE
026000            " LEVEL VALIDATION FOR ".
026100   02  FILLER                        PIC X(58)  VALUE
026200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026300 01  CCVS-H-3.
026400     02  FILLER                      PIC X(34)  VALUE
026500            " FOR OFFICIAL USE ONLY    ".
026600     02  FILLER                      PIC X(58)  VALUE
026700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026800     02  FILLER                      PIC X(28)  VALUE
026900            "  COPYRIGHT   1985 ".
027000 01  CCVS-E-1.
027100     02 FILLER                       PIC X(52)  VALUE SPACE.
027200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027300     02 ID-AGAIN                     PIC X(9).
027400     02 FILLER                       PIC X(45)  VALUE SPACES.
027500 01  CCVS-E-2.
027600     02  FILLER                      PIC X(31)  VALUE SPACE.
027700     02  FILLER                      PIC X(21)  VALUE SPACE.
027800     02 CCVS-E-2-2.
027900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
028000         03 FILLER                   PIC X      VALUE SPACE.
028100         03 ENDER-DESC               PIC X(44)  VALUE
028200            "ERRORS ENCOUNTERED".
028300 01  CCVS-E-3.
028400     02  FILLER                      PIC X(22)  VALUE
028500            " FOR OFFICIAL USE ONLY".
028600     02  FILLER                      PIC X(12)  VALUE SPACE.
028700     02  FILLER                      PIC X(58)  VALUE
028800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028900     02  FILLER                      PIC X(13)  VALUE SPACE.
029000     02 FILLER                       PIC X(15)  VALUE
029100             " COPYRIGHT 1985".
029200 01  CCVS-E-4.
029300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
029400     02 FILLER                       PIC X(4)   VALUE " OF ".
029500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
029600     02 FILLER                       PIC X(40)  VALUE
029700      "  TESTS WERE EXECUTED SUCCESSFULLY".
029800 01  XXINFO.
029900     02 FILLER                       PIC X(19)  VALUE
030000            "*** INFORMATION ***".
030100     02 INFO-TEXT.
030200       04 FILLER                     PIC X(8)   VALUE SPACE.
030300       04 XXCOMPUTED                 PIC X(20).
030400       04 FILLER                     PIC X(5)   VALUE SPACE.
030500       04 XXCORRECT                  PIC X(20).
030600     02 INF-ANSI-REFERENCE           PIC X(48).
030700 01  HYPHEN-LINE.
030800     02 FILLER  PIC IS X VALUE IS SPACE.
030900     02 FILLER  PIC IS X(65)    VALUE IS "************************
031000-    "*****************************************".
031100     02 FILLER  PIC IS X(54)    VALUE IS "************************
031200-    "******************************".
031300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
031400     "NC170A".
031500 PROCEDURE DIVISION.
031600 CCVS1 SECTION.
031700 OPEN-FILES.
031800     OPEN     OUTPUT PRINT-FILE.
031900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
032000     MOVE    SPACE TO TEST-RESULTS.
032100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
032200     GO TO CCVS1-EXIT.
032300 CLOSE-FILES.
032400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
032500 TERMINATE-CCVS.
032600S    EXIT PROGRAM.
032700STERMINATE-CALL.
032800     STOP     RUN.
032900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
033000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
033100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
033200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
033300     MOVE "****TEST DELETED****" TO RE-MARK.
033400 PRINT-DETAIL.
033500     IF REC-CT NOT EQUAL TO ZERO
033600             MOVE "." TO PARDOT-X
033700             MOVE REC-CT TO DOTVALUE.
033800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
033900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
034000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
034100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
034200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
034300     MOVE SPACE TO CORRECT-X.
034400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
034500     MOVE     SPACE TO RE-MARK.
034600 HEAD-ROUTINE.
034700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035100 COLUMN-NAMES-ROUTINE.
035200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
035500 END-ROUTINE.
035600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
035700 END-RTN-EXIT.
035800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035900 END-ROUTINE-1.
036000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
036100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
036200      ADD PASS-COUNTER TO ERROR-HOLD.
036300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
036400      MOVE PASS-COUNTER TO CCVS-E-4-1.
036500      MOVE ERROR-HOLD TO CCVS-E-4-2.
036600      MOVE CCVS-E-4 TO CCVS-E-2-2.
036700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
036800  END-ROUTINE-12.
036900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
037000     IF       ERROR-COUNTER IS EQUAL TO ZERO
037100         MOVE "NO " TO ERROR-TOTAL
037200         ELSE
037300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
037400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
037500     PERFORM WRITE-LINE.
037600 END-ROUTINE-13.
037700     IF DELETE-COUNTER IS EQUAL TO ZERO
037800         MOVE "NO " TO ERROR-TOTAL  ELSE
037900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
038000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
038100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038200      IF   INSPECT-COUNTER EQUAL TO ZERO
038300          MOVE "NO " TO ERROR-TOTAL
038400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
038500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038800 WRITE-LINE.
038900     ADD 1 TO RECORD-COUNT.
039000Y    IF RECORD-COUNT GREATER 42
039100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
039200Y        MOVE SPACE TO DUMMY-RECORD
039300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039400Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039500Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
039600Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039700Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
039800Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
039900Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
040000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
040100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
040200Y        MOVE ZERO TO RECORD-COUNT.
040300     PERFORM WRT-LN.
040400 WRT-LN.
040500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
040600     MOVE SPACE TO DUMMY-RECORD.
040700 BLANK-LINE-PRINT.
040800     PERFORM WRT-LN.
040900 FAIL-ROUTINE.
041000     IF     COMPUTED-X NOT EQUAL TO SPACE
041100            GO TO FAIL-ROUTINE-WRITE.
041200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
041300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041600     MOVE   SPACES TO INF-ANSI-REFERENCE.
041700     GO TO  FAIL-ROUTINE-EX.
041800 FAIL-ROUTINE-WRITE.
041900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
042000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
042100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
042200     MOVE   SPACES TO COR-ANSI-REFERENCE.
042300 FAIL-ROUTINE-EX. EXIT.
042400 BAIL-OUT.
042500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
042600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
042700 BAIL-OUT-WRITE.
042800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
042900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
043000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043100     MOVE   SPACES TO INF-ANSI-REFERENCE.
043200 BAIL-OUT-EX. EXIT.
043300 CCVS1-EXIT.
043400     EXIT.
043500 SECT-NC170A-001 SECTION.
043600
043700 MPY-INIT-F2-1.
043800     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
043900     MOVE   "MULTIPLY BY GIVING" TO FEATURE.
044000     MOVE    80.12 TO MULT1.
044100     MOVE    ZERO  TO MULT2.
044200 MPY-TEST-F2-1-0.
044300     MULTIPLY MULT1 BY 4.3 GIVING MULT2.
044400 MPY-TEST-F2-1-1.
044500     IF      MULT2 NOT EQUAL TO 344.516
044600             GO TO MPY-FAIL-F2-1-1.
044700     PERFORM PASS
044800              GO TO MPY-WRITE-F2-1-1.
044900 MPY-DELETE-F2-1-1.
045000     PERFORM  DE-LETE.
045100     GO TO    MPY-WRITE-F2-1-1.
045200 MPY-FAIL-F2-1-1.
045300     PERFORM  FAIL.
045400     MOVE     MULT2  TO COMPUTED-N.
045500     MOVE    +344.516 TO CORRECT-N.
045600 MPY-WRITE-F2-1-1.
045700     MOVE "MPY-TEST-F2-1-1" TO PAR-NAME.
045800     PERFORM  PRINT-DETAIL.
045900
046000 MPY-INIT-F2-2.
046100     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
046200     MOVE    80.12 TO MULT1.
046300     MOVE    ZERO  TO MULT3.
046400 MPY-TEST-F2-2-0.
046500     MULTIPLY .9 BY MULT1 GIVING MULT3 ROUNDED.
046600 MPY-TEST-F2-2-1.
046700     IF       MULT3 NOT EQUAL TO " $72.11"
046800              GO TO MPY-FAIL-F2-2-1.
046900     PERFORM  PASS.
047000     GO TO    MPY-WRITE-F2-2-1.
047100 MPY-DELETE-F2-2-1.
047200     PERFORM  DE-LETE.
047300     GO TO    MPY-WRITE-F2-2-1.
047400 MPY-FAIL-F2-2-1.
047500     PERFORM  FAIL.
047600     MOVE     MULT3 TO COMPUTED-A.
047700     MOVE " $72.11" TO CORRECT-A.
047800 MPY-WRITE-F2-2-1.
047900     MOVE "MPY-TEST-F2-2-1" TO PAR-NAME.
048000     PERFORM  PRINT-DETAIL.
048100
048200 MPY-INIT-F2-3.
048300     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
048400     MOVE    80.12 TO MULT1.
048500     MOVE   -56    TO MULT4.
048600     MOVE    4     TO MULT5.
048700     MOVE   "A"    TO XRAY.
048800 MPY-TEST-F2-3-0.
048900     MULTIPLY MULT4 BY MULT1 GIVING MULT5 ON SIZE ERROR
049000              MOVE "H" TO XRAY.
049100 MPY-TEST-F2-3-1.
049200     IF       XRAY EQUAL TO "H"
049300              PERFORM PASS
049400     ELSE
049500              GO TO MPY-FAIL-F2-3-1.
049600     GO TO    MPY-WRITE-F2-3-1.
049700 MPY-DELETE-F2-3-1.
049800     PERFORM  DE-LETE.
049900     GO TO    MPY-WRITE-F2-3-1.
050000 MPY-FAIL-F2-3-1.
050100     MOVE     XRAY  TO COMPUTED-X.
050200     MOVE    "H"    TO CORRECT-X.
050300     MOVE    "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
050400     PERFORM  FAIL.
050500 MPY-WRITE-F2-3-1.
050600     MOVE "MPY-TEST-F2-3-1 " TO PAR-NAME.
050700     PERFORM  PRINT-DETAIL.
050800 MPY-TEST-F2-3-2.
050900     IF       MULT5 NOT EQUAL TO 4
051000              GO TO MPY-FAIL-F2-3-2.
051100     PERFORM  PASS.
051200     GO TO    MPY-WRITE-F2-3-2.
051300 MPY-DELETE-F2-3-2.
051400     PERFORM  DE-LETE.
051500     GO TO    MPY-WRITE-F2-3-2.
051600 MPY-FAIL-F2-3-2.
051700     PERFORM  FAIL.
051800     MOVE     MULT5 TO COMPUTED-N.
051900     MOVE    +4 TO CORRECT-N.
052000     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
052100 MPY-WRITE-F2-3-2.
052200     MOVE "MPY-TEST-F2-3-2 " TO PAR-NAME.
052300     PERFORM  PRINT-DETAIL.
052400
052500 MPY-INIT-F2-4.
052600     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
052700     MOVE    80.12 TO MULT1.
052800     MOVE   "A"    TO XRAY.
052900     MOVE    4     TO MULT5.
053000 MPY-TEST-F2-4-0.
053100     MULTIPLY 3.3 BY -3 GIVING MULT5 ROUNDED ON SIZE ERROR
053200              MOVE "J" TO XRAY.
053300 MPY-TEST-F2-4-1.
053400     IF       XRAY NOT EQUAL TO "J"
053500              GO TO MPY-FAIL-F2-4-1
053600     ELSE
053700              PERFORM PASS.
053800     GO TO    MPY-WRITE-F2-4-1.
053900 MPY-DELETE-F2-4-1.
054000     PERFORM  DE-LETE.
054100     GO TO    MPY-WRITE-F2-4-1.
054200 MPY-FAIL-F2-4-1.
054300     MOVE     XRAY  TO COMPUTED-X.
054400     MOVE    "J"    TO CORRECT-X.
054500     MOVE "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
054600     PERFORM  FAIL.
054700 MPY-WRITE-F2-4-1.
054800     MOVE "MPY-TEST-F2-4-1 " TO PAR-NAME.
054900     PERFORM  PRINT-DETAIL.
055000 MPY-TEST-F2-4-2.
055100     IF       MULT5 EQUAL TO 4
055200              PERFORM PASS
055300     ELSE
055400              GO TO MPY-FAIL-F2-4-2.
055500     GO TO    MPY-WRITE-F2-4-2.
055600 MPY-DELETE-F2-4-2.
055700     PERFORM  DE-LETE.
055800     GO TO    MPY-WRITE-F2-4-2.
055900 MPY-FAIL-F2-4-2.
056000     PERFORM  FAIL.
056100     MOVE     MULT5 TO COMPUTED-N.
056200     MOVE     +4 TO CORRECT-N.
056300     MOVE     4 TO MULT5.
056400     MOVE    "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
056500 MPY-WRITE-F2-4-2.
056600     MOVE    "MPY-TEST-F2-4-2 " TO PAR-NAME.
056700     PERFORM  PRINT-DETAIL.
056800
056900 MPY-INIT-F2-5.
057000     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
057100     MOVE    ZERO TO WRK-DS-09V09.
057200 MPY-TEST-F2-5-0.
057300     MULTIPLY A06THREES-DS-03V03 BY A12THREES-DS-06V06
057400         GIVING WRK-DS-09V09.
057500 MPY-TEST-F2-5-1.
057600     IF WRK-DS-18V00-S EQUAL TO 111110999999888889
057700         PERFORM PASS
057800         GO TO MPY-WRITE-F2-5.
057900     GO TO MPY-FAIL-F2-5.
058000 MPY-DELETE-F2-5.
058100     PERFORM DE-LETE.
058200     GO TO MPY-WRITE-F2-5.
058300 MPY-FAIL-F2-5.
058400     MOVE  111110999999888889 TO CORRECT-18V0.
058500     MOVE  WRK-DS-18V00-S     TO COMPUTED-18V0.
058600     PERFORM FAIL.
058700 MPY-WRITE-F2-5.
058800     MOVE "MPY-TEST-F2-5         " TO PAR-NAME.
058900     PERFORM PRINT-DETAIL.
059000
059100 MPY-INIT-F2-6.
059200     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
059300     MOVE    ZERO TO WRK-DS-10V00.
059400 MPY-TEST-F2-6-0.
059500     MULTIPLY A06THREES-DS-03V03 BY A06THREES-DS-03V03
059600         GIVING WRK-DS-10V00 ROUNDED.
059700 MPY-TEST-F2-6.
059800     IF WRK-DS-10V00 EQUAL TO 0000111111
059900         PERFORM PASS
060000         GO TO MPY-WRITE-F2-6.
060100     GO TO MPY-FAIL-F2-6.
060200 MPY-DELETE-F2-6.
060300     PERFORM DE-LETE.
060400     GO TO MPY-WRITE-F2-6.
060500 MPY-FAIL-F2-6.
060600     MOVE  0000111111         TO CORRECT-18V0.
060700     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
060800     PERFORM FAIL.
060900 MPY-WRITE-F2-6.
061000     MOVE "MPY-TEST-F2-6         " TO PAR-NAME.
061100     PERFORM PRINT-DETAIL.
061200
061300 MPY-INIT-F2-7.
061400     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
061500     MOVE   "0"   TO WRK-XN-00001.
061600     MOVE    ZERO TO WRK-DS-10V00.
061700 MPY-TEST-F2-7-0.
061800     MULTIPLY A05ONES-DS-00V05 BY A12ONES-DS-12V00
061900       GIVING WRK-DS-10V00
062000           ON SIZE ERROR
062100              MOVE "1" TO WRK-XN-00001.
062200 MPY-TEST-F2-7-1.
062300     IF WRK-DS-10V00 EQUAL TO 0000000000
062400         PERFORM PASS
062500         GO TO MPY-WRITE-F2-7-1.
062600     GO TO MPY-FAIL-F2-7-1.
062700 MPY-DELETE-F2-7-1.
062800     PERFORM DE-LETE.
062900     GO TO MPY-WRITE-F2-7-1.
063000 MPY-FAIL-F2-7-1.
063100     MOVE  0000000000         TO CORRECT-18V0.
063200     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
063300     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
063400     PERFORM FAIL.
063500 MPY-WRITE-F2-7-1.
063600     MOVE "MPY-TEST-F2-7-1         " TO PAR-NAME.
063700     PERFORM PRINT-DETAIL.
063800 MPY-TEST-F2-7-2.
063900     IF      WRK-XN-00001 EQUAL TO "1"
064000             PERFORM PASS
064100             GO TO MPY-WRITE-F2-7-2.
064200     MOVE "1" TO CORRECT-A.
064300     MOVE WRK-XN-00001 TO COMPUTED-A.
064400     MOVE    "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
064500     PERFORM FAIL.
064600     GO TO MPY-WRITE-F2-7-2.
064700 MPY-DELETE-F2-7-2.
064800     PERFORM DE-LETE.
064900 MPY-WRITE-F2-7-2.
065000     MOVE "MPY-TEST-F2-7-2         " TO PAR-NAME.
065100     PERFORM PRINT-DETAIL.
065200
065300 MPY-INIT-F2-8.
065400     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
065500     MOVE   "1"   TO WRK-XN-00001.
065600     MOVE    ZERO TO WRK-DS-10V00.
065700 MPY-TEST-F2-8-0.
065800     MULTIPLY A01ONE-DS-P0801 BY A12ONES-DS-12V00
065900         GIVING WRK-DS-10V00 ON SIZE ERROR
066000         MOVE "0" TO WRK-XN-00001.
066100 MPY-TEST-F2-8-1.
066200     IF WRK-DS-10V00 EQUAL TO 0000000111
066300         PERFORM PASS
066400         GO TO MPY-WRITE-F2-8-1.
066500     GO TO MPY-FAIL-F2-8-1.
066600 MPY-DELETE-F2-8-1.
066700     PERFORM DE-LETE.
066800     GO TO MPY-WRITE-F2-8-1.
066900 MPY-FAIL-F2-8-1.
067000     MOVE  0000000111         TO CORRECT-18V0.
067100     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
067200     PERFORM FAIL.
067300 MPY-WRITE-F2-8-1.
067400     MOVE "MPY-TEST-F2-8-1         " TO PAR-NAME.
067500     PERFORM PRINT-DETAIL.
067600 MPY-TEST-F2-8-2.
067700     IF WRK-XN-00001 EQUAL TO "1"
067800         PERFORM PASS
067900         GO TO MPY-WRITE-F2-8-2.
068000     MOVE    "1"           TO CORRECT-A.
068100     MOVE     WRK-XN-00001 TO COMPUTED-A.
068200     MOVE    "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
068300     PERFORM FAIL.
068400     GO TO MPY-WRITE-F2-8-2.
068500 MPY-DELETE-F2-8-2.
068600     PERFORM DE-LETE.
068700 MPY-WRITE-F2-8-2.
068800     MOVE "MPY-TEST-F2-8-2         " TO PAR-NAME.
068900     PERFORM PRINT-DETAIL.
069000
069100 MPY-INIT-F2-9.
069200     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
069300     MOVE   "0"   TO WRK-XN-00001.
069400     MOVE    ZERO TO WRK-DS-10V00.
069500 MPY-TEST-F2-9-0.
069600     MULTIPLY 9.5 BY A10ONES-DS-10V00
069700         GIVING WRK-DS-10V00 ROUNDED ON SIZE ERROR
069800         MOVE "1" TO WRK-XN-00001.
069900 MPY-TEST-F2-9-1.
070000     IF WRK-DS-10V00 EQUAL TO 0000000000
070100         PERFORM PASS
070200         GO TO MPY-WRITE-F2-9-1.
070300     MOVE  0000000000         TO CORRECT-18V0.
070400     MOVE  WRK-DS-10V00       TO COMPUTED-18V0.
070500     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
070600     PERFORM FAIL.
070700     GO TO MPY-WRITE-F2-9-1.
070800 MPY-DELETE-F2-9-1.
070900     PERFORM DE-LETE.
071000 MPY-WRITE-F2-9-1.
071100     MOVE   "MPY-TEST-F2-9-1       " TO PAR-NAME.
071200     PERFORM PRINT-DETAIL.
071300 MPY-TEST-F2-9-2.
071400     IF      WRK-XN-00001 EQUAL TO "1"
071500             PERFORM PASS
071600             GO TO MPY-WRITE-F2-9-2.
071700 MPY-FAIL-F2-9-2.
071800     MOVE   "1" TO CORRECT-A.
071900     MOVE    WRK-XN-00001 TO COMPUTED-A.
072000     MOVE   "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
072100     PERFORM FAIL.
072200     GO TO   MPY-WRITE-F2-9-2.
072300 MPY-DELETE-F2-9-2.
072400     PERFORM DE-LETE.
072500 MPY-WRITE-F2-9-2.
072600     MOVE   "MPY-TEST-F2-9-2       " TO PAR-NAME.
072700     PERFORM PRINT-DETAIL.
072800
072900 MPY-INIT-F2-10-1.
073000     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
073100     MOVE   "1"  TO WRK-XN-00001.
073200     MOVE   ZERO TO WRK-DS-09V08.
073300 MPY-TEST-F2-10-0.
073400     MULTIPLY A01ONE-DS-P0801 BY A18ONES-DS-18V00
073500         GIVING WRK-DS-09V08 ROUNDED ON SIZE ERROR
073600         MOVE "0" TO WRK-XN-00001.
073700 MPY-TEST-F2-10-1.
073800     IF WRK-DS-17V00-S EQUAL TO 11111111111111111
073900         PERFORM PASS
074000         GO TO MPY-WRITE-F2-10-1.
074100     MOVE  11111111111111111  TO CORRECT-18V0.
074200     MOVE  WRK-DS-17V00-S     TO COMPUTED-18V0.
074300     PERFORM FAIL.
074400     GO TO MPY-WRITE-F2-10-1.
074500 MPY-DELETE-F2-10-1.
074600     PERFORM DE-LETE.
074700 MPY-WRITE-F2-10-1.
074800     MOVE   "MPY-TEST-F2-10-1       " TO PAR-NAME.
074900     PERFORM PRINT-DETAIL.
075000 MPY-TEST-F2-10-2.
075100     IF      WRK-XN-00001 EQUAL TO "1"
075200             PERFORM PASS
075300             GO TO MPY-WRITE-F2-10-2.
075400     MOVE   "1" TO CORRECT-A.
075500     MOVE    WRK-XN-00001 TO COMPUTED-A.
075600     MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
075700     PERFORM FAIL.
075800     GO TO   MPY-WRITE-F2-10-2.
075900 MPY-DELETE-F2-10-2.
076000     PERFORM DE-LETE.
076100 MPY-WRITE-F2-10-2.
076200     MOVE   "MPY-TEST-F2-10-2       " TO PAR-NAME.
076300     PERFORM PRINT-DETAIL.
076400
076500 MPY-INIT-F2-11.
076600     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
076700     MOVE    ZERO TO WRK-CS-02V02.
076800 MPY-TEST-F2-11-0.
076900     MULTIPLY A99-CS-02V00 BY A01ONE-CS-00V01 GIVING WRK-CS-02V02.
077000 MPY-TEST-F2-11-1.
077100     MOVE    WRK-CS-02V02 TO WRK-DS-06V06.
077200     IF      WRK-DS-12V00-S EQUAL TO 000009900000
077300             PERFORM PASS
077400             GO TO   MPY-WRITE-F2-11.
077500     MOVE    000009900000     TO CORRECT-18V0.
077600     MOVE    WRK-DS-12V00-S   TO COMPUTED-18V0.
077700     PERFORM FAIL.
077800     GO TO   MPY-WRITE-F2-11.
077900 MPY-DELETE-F2-11.
078000     PERFORM DE-LETE.
078100 MPY-WRITE-F2-11.
078200     MOVE   "MPY-TEST-F2-11       " TO PAR-NAME.
078300     PERFORM PRINT-DETAIL.
078400
078500 MPY-INIT-F2-12.
078600     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
078700     MOVE    ZERO TO WRK-CS-18V00.
078800 MPY-TEST-F2-12-0.
078900     MULTIPLY A01ONES-CS-18V00 BY A02THREES-CS-18V00
079000             GIVING WRK-CS-18V00.
079100 MPY-TEST-F2-12-1.
079200     IF WRK-CS-18V00 EQUAL TO -000000000000000033
079300         PERFORM PASS
079400         GO TO MPY-WRITE-F2-12.
079500     MOVE -000000000000000033 TO CORRECT-18V0.
079600     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
079700     PERFORM FAIL.
079800     GO TO MPY-WRITE-F2-12.
079900 MPY-DELETE-F2-12.
080000     PERFORM DE-LETE.
080100 MPY-WRITE-F2-12.
080200     MOVE "MPY-TEST-F2-12 " TO PAR-NAME.
080300     PERFORM PRINT-DETAIL.
080400
080500 MPY-INIT-F2-13.
080600     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
080700     MOVE    ZERO TO WRK-DU-18V00.
080800 MPY-TEST-F2-13-0.
080900     MULTIPLY A02THREES-CS-18V00 BY A14TWOS-CU-18V00
081000             GIVING WRK-DU-18V00.
081100 MPY-TEST-F2-13.
081200     IF WRK-DU-18V00 EQUAL TO 000733333333333326
081300         PERFORM PASS
081400         GO TO MPY-WRITE-F2-13.
081500     MOVE 000733333333333326 TO CORRECT-18V0.
081600     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
081700     PERFORM FAIL.
081800     GO TO MPY-WRITE-F2-13.
081900 MPY-DELETE-F2-13.
082000     PERFORM DE-LETE.
082100 MPY-WRITE-F2-13.
082200     MOVE "MPY-TEST-F2-13 " TO PAR-NAME.
082300     PERFORM PRINT-DETAIL.
082400
082500 MPY-INIT-F2-14.
082600     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
082700     MOVE    ZERO TO WRK-CS-18V00.
082800 MPY-TEST-F2-14-0.
082900     MULTIPLY A02THREES-CS-18V00 BY A16NINES-CU-18V00
083000             GIVING WRK-CS-18V00.
083100 MPY-TEST-F2-14.
083200     IF WRK-CS-18V00 EQUAL TO -329999999999999967
083300         PERFORM PASS
083400         GO TO MPY-WRITE-F2-14.
083500     MOVE -329999999999999967 TO CORRECT-18V0.
083600     MOVE WRK-CS-18V00 TO COMPUTED-18V0.
083700     PERFORM FAIL.
083800     GO TO MPY-WRITE-F2-14.
083900 MPY-DELETE-F2-14.
084000     PERFORM DE-LETE.
084100 MPY-WRITE-F2-14.
084200     MOVE "MPY-TEST-F2-14 " TO PAR-NAME.
084300     PERFORM PRINT-DETAIL.
084400
084500 MPY-INIT-F2-15.
084600     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
084700     MOVE    ZERO TO WRK-DU-18V00.
084800 MPY-TEST-F2-15-0.
084900     MULTIPLY A01ONES-CS-18V00 BY A18SIXES-CU-18V00
085000         GIVING WRK-DU-18V00.
085100 MPY-TEST-F2-15.
085200     IF WRK-DU-18V00 EQUAL TO 666666666666666666
085300         PERFORM PASS
085400         GO TO MPY-WRITE-F2-15.
085500     MOVE 666666666666666666 TO CORRECT-18V0.
085600     MOVE WRK-DU-18V00 TO COMPUTED-18V0.
085700     PERFORM FAIL.
085800     GO TO MPY-WRITE-F2-15.
085900 MPY-DELETE-F2-15.
086000     PERFORM DE-LETE.
086100 MPY-WRITE-F2-15.
086200     MOVE "MPY-TEST-F2-15 " TO PAR-NAME.
086300     PERFORM PRINT-DETAIL.
086400*
086500*
086600 MPY-INIT-F2-16.
086700*    ==-->  NEW SIZE ERROR TESTS    <--==
086800     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
086900     MOVE   "H"  TO XRAY.
087000     MOVE  80.12 TO MULT1.
087100     MOVE   -56  TO MULT4.
087200     MOVE    0   TO MULT5.
087300     MOVE    1   TO REC-CT.
087400 MPY-TEST-F2-16-0.
087500     MULTIPLY MULT4 BY MULT1 GIVING MULT5
087600          NOT ON SIZE ERROR  MOVE "X" TO XRAY.
087700 MPY-TEST-F2-16-1.
087800     GO TO MPY-TEST-F2-16-2.
087900 MPY-DELETE-F2-16-1.
088000     PERFORM DE-LETE.
088100     PERFORM PRINT-DETAIL.
088200     GO TO   MPY-INIT-F2-17.
088300 MPY-TEST-F2-16-2.
088400     MOVE   "MPY-TEST-F2-16-2 " TO PAR-NAME.
088500     IF      XRAY    = "H"
088600             PERFORM PASS
088700             PERFORM PRINT-DETAIL
088800     ELSE
088900             MOVE    XRAY  TO COMPUTED-X
089000             MOVE   "H"    TO CORRECT-X
089100             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
089200             PERFORM FAIL
089300             PERFORM PRINT-DETAIL.
089400     ADD     1 TO REC-CT.
089500 MPY-TEST-F2-16-3.
089600     MOVE   "MPY-TEST-F2-16-3 " TO PAR-NAME.
089700     IF      MULT5 = 0
089800             PERFORM PASS
089900             PERFORM PRINT-DETAIL
090000     ELSE
090100             MOVE    MULT5 TO COMPUTED-N
090200             MOVE    0     TO CORRECT-N
090300             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
090400             PERFORM FAIL
090500             PERFORM PRINT-DETAIL.
090600*
090700*
090800 MPY-INIT-F2-17.
090900*    ==-->  NEW SIZE ERROR TESTS    <--==
091000     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
091100     MOVE   "1" TO WRK-XN-00001.
091200     MOVE    ZERO TO WRK-DS-10V00.
091300     MOVE    1   TO REC-CT.
091400 MPY-TEST-F2-17-0.
091500     MULTIPLY A01ONE-DS-P0801 BY A12ONES-DS-12V00
091600             GIVING WRK-DS-10V00
091700             NOT ON SIZE ERROR
091800               MOVE "0" TO WRK-XN-00001.
091900 MPY-TEST-F2-17-1.
092000     GO TO   MPY-TEST-F2-17-2.
092100 MPY-DELETE-F2-17.
092200     PERFORM DE-LETE.
092300     PERFORM PRINT-DETAIL.
092400     GO TO   MPY-INIT-F2-18.
092500 MPY-TEST-F2-17-2.
092600     MOVE   "MPY-TEST-F2-17-2 " TO PAR-NAME.
092700     IF      WRK-XN-00001 = "0"
092800             PERFORM PASS
092900             PERFORM PRINT-DETAIL
093000     ELSE
093100             MOVE    WRK-XN-00001 TO COMPUTED-X
093200             MOVE   "0"           TO CORRECT-X
093300             MOVE   "NOT ON SIZE ERROR SHOULD HAVE BEEN EXECUTED"
093400                  TO RE-MARK
093500             PERFORM FAIL
093600             PERFORM PRINT-DETAIL.
093700     ADD     1   TO REC-CT.
093800 MPY-TEST-F2-17-3.
093900     MOVE   "MPY-TEST-F2-17-3 " TO PAR-NAME.
094000     IF      WRK-DS-10V00 = 0000000111
094100             PERFORM PASS
094200             PERFORM PRINT-DETAIL
094300     ELSE
094400             MOVE    0000000111       TO CORRECT-18V0
094500             MOVE    WRK-DS-10V00     TO COMPUTED-18V0
094600             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
094700             PERFORM FAIL
094800             PERFORM PRINT-DETAIL.
094900*
095000*
095100 MPY-INIT-F2-18.
095200*    ==-->  NEW SIZE ERROR TESTS    <--==
095300     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
095400     MOVE    1   TO REC-CT.
095500     MOVE  80.12 TO MULT1.
095600     MOVE   -56  TO MULT4.
095700     MOVE    0   TO MULT5.
095800     MOVE   "H" TO XRAY.
095900 MPY-TEST-F2-18-0.
096000     MULTIPLY MULT4 BY MULT1 GIVING MULT5
096100              ON SIZE ERROR  MOVE "A" TO XRAY
096200          NOT ON SIZE ERROR  MOVE "B" TO XRAY.
096300 MPY-TEST-F2-18-1.
096400     GO TO MPY-TEST-F2-18-2.
096500 MPY-DELETE-F2-18.
096600     PERFORM DE-LETE.
096700     PERFORM PRINT-DETAIL.
096800     GO TO   MPY-INIT-F2-19.
096900 MPY-TEST-F2-18-2.
097000     MOVE   "MPY-TEST-F2-18-2 " TO PAR-NAME.
097100     IF      XRAY    = "A"
097200             PERFORM PASS
097300             PERFORM PRINT-DETAIL
097400     ELSE
097500             MOVE    XRAY  TO COMPUTED-X
097600             MOVE   "A"    TO CORRECT-X
097700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
097800             PERFORM FAIL
097900             PERFORM PRINT-DETAIL.
098000     ADD     1   TO REC-CT.
098100 MPY-TEST-F2-18-3.
098200     MOVE   "MPY-TEST-F2-18-3 " TO PAR-NAME.
098300     IF      MULT5   = 0
098400             PERFORM PASS
098500             PERFORM PRINT-DETAIL
098600     ELSE
098700             MOVE    MULT5 TO COMPUTED-N
098800             MOVE    0     TO CORRECT-N
098900             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
099000             PERFORM FAIL
099100             PERFORM PRINT-DETAIL.
099200*
099300*
099400 MPY-INIT-F2-19.
099500*    ==-->  NEW SIZE ERROR TESTS    <--==
099600     MOVE    1   TO REC-CT.
099700     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
099800     MOVE   "0" TO WRK-XN-00001.
099900     MOVE    ZERO TO WRK-DS-10V00.
100000 MPY-TEST-F2-19-0.
100100     MULTIPLY A01ONE-DS-P0801 BY A12ONES-DS-12V00
100200             GIVING WRK-DS-10V00
100300                 ON SIZE ERROR MOVE "1" TO WRK-XN-00001
100400             NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001.
100500 MPY-TEST-F2-19-1.
100600     GO TO   MPY-TEST-F2-19-2.
100700 MPY-DELETE-F2-19.
100800     PERFORM DE-LETE.
100900     PERFORM PRINT-DETAIL.
101000     GO TO   MPY-INIT-F2-20.
101100 MPY-TEST-F2-19-2.
101200     MOVE   "MPY-TEST-F2-19-2" TO PAR-NAME.
101300     IF      WRK-XN-00001 = "2"
101400             PERFORM PASS
101500             PERFORM PRINT-DETAIL
101600     ELSE
101700             MOVE    WRK-XN-00001 TO COMPUTED-X
101800             MOVE   "2"          TO CORRECT-X
101900             MOVE   "NOT ON SIZE ERROR SHOULD HAVE BEEN EXECUTED"
102000                  TO RE-MARK
102100             PERFORM FAIL
102200             PERFORM PRINT-DETAIL.
102300     ADD     1   TO REC-CT.
102400 MPY-TEST-F2-19-3.
102500     MOVE   "MPY-TEST-F2-19-3 " TO PAR-NAME.
102600     IF      WRK-DS-10V00 = 0000000111
102700             PERFORM PASS
102800             PERFORM PRINT-DETAIL
102900     ELSE
103000             MOVE    0000000111       TO CORRECT-18V0
103100             MOVE    WRK-DS-10V00     TO COMPUTED-18V0
103200             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
103300             PERFORM FAIL
103400             PERFORM PRINT-DETAIL.
103500*
103600*
103700 MPY-INIT-F2-20.
103800*    ==-->  MULTIPLE RESULT FIELDS  <--==
103900     MOVE   "V1-107 6.19.4 GR2" TO ANSI-REFERENCE.
104000     MOVE   "MPY-TEST-F2-20" TO PAR-NAME.
104100     MOVE    999999 TO WRK-DU-6V0-1.
104200     MOVE    .00001 TO WRK-DU-4P1-1.
104300     MOVE    0      TO WRK-DU-2V0-1.
104400     MOVE    0      TO WRK-DU-2V0-2.
104500     MOVE    0      TO WRK-DU-2V5-1.
104600     MOVE    0      TO WRK-NE-2.
104700     MOVE    0      TO WRK-NE-3.
104800     MOVE    1 TO REC-CT.
104900 MPY-TEST-F2-20-0.
105000     MULTIPLY WRK-DU-4P1-1 BY WRK-DU-6V0-1 GIVING WRK-DU-2V0-1
105100         WRK-DU-2V0-2 ROUNDED WRK-DU-2V5-1 WRK-NE-2 ROUNDED
105200         WRK-NE-3.
105300     GO TO MPY-TEST-F2-20-1.
105400 MPY-DELETE-F2-20.
105500     PERFORM DE-LETE.
105600     GO TO MPY-INIT-F2-21.
105700 MPY-TEST-F2-20-1.
105800     IF WRK-DU-2V0-1  = 9 PERFORM PASS PERFORM PRINT-DETAIL
105900     ELSE
106000     PERFORM FAIL MOVE WRK-DU-2V0-1 TO COMPUTED-N MOVE 9 TO
106100     CORRECT-N PERFORM PRINT-DETAIL.
106200     ADD 1 TO REC-CT.
106300 MPY-TEST-F2-20-2.
106400     IF WRK-DU-2V0-2 = 10 PERFORM PASS PERFORM PRINT-DETAIL
106500     ELSE
106600     PERFORM FAIL MOVE WRK-DU-2V0-2 TO COMPUTED-N MOVE 10
106700     TO CORRECT-N PERFORM PRINT-DETAIL.
106800     ADD 1 TO REC-CT.
106900 MPY-TEST-F2-20-3.
107000     IF WRK-DU-2V5-1 = 9.99999 PERFORM PASS PERFORM PRINT-DETAIL
107100     ELSE
107200     PERFORM FAIL MOVE WRK-DU-2V5-1 TO COMPUTED-N MOVE 9.99999 TO
107300     CORRECT-N PERFORM PRINT-DETAIL.
107400     ADD 1 TO REC-CT.
107500 MPY-TEST-F2-20-4.
107600     IF WRK-NE-2 = "$10.00" PERFORM PASS PERFORM PRINT-DETAIL
107700     ELSE
107800     PERFORM FAIL MOVE WRK-NE-2 TO COMPUTED-A MOVE "$10.00"
107900     TO CORRECT-A PERFORM PRINT-DETAIL.
108000     ADD 1 TO REC-CT.
108100 MPY-TEST-F2-20-5.
108200     IF WRK-NE-3 = "$09.99  " PERFORM PASS PERFORM PRINT-DETAIL
108300     ELSE
108400     PERFORM FAIL MOVE WRK-NE-3 TO COMPUTED-A MOVE "$09.99  "
108500     TO CORRECT-A PERFORM PRINT-DETAIL.
108600*
108700*
108800 MPY-INIT-F2-21.
108900*    ==-->    SIZE ERROR CONDITION  <--==
109000*    ==-->  MULTIPLE RESULT FIELDS  <--==
109100     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
109200     MOVE   "MPY-TEST-F2-21" TO PAR-NAME.
109300     MOVE    999999 TO WRK-DU-6V0-1.
109400     MOVE    .00001 TO WRK-DU-4P1-1.
109500     MOVE    0      TO WRK-DU-2V0-1.
109600     MOVE    0      TO WRK-DU-2V0-2.
109700     MOVE    0      TO WRK-DU-2V5-1.
109800     MOVE    0      TO WRK-NE-2.
109900     MOVE    0      TO WRK-NE-3.
110000     MOVE    1      TO REC-CT.
110100     MOVE   "0"     TO WRK-XN-00001.
110200 MPY-TEST-F2-21-0.
110300     MULTIPLY WRK-DU-6V0-1 BY WRK-DU-6V0-1
110400       GIVING WRK-DU-2V0-1
110500              WRK-DU-2V0-2 ROUNDED
110600              WRK-DU-2V5-1
110700              WRK-NE-2 ROUNDED
110800              WRK-NE-3
110900           ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
111000     GO TO   MPY-TEST-F2-21-1.
111100 MPY-DELETE-F2-21.
111200     PERFORM DE-LETE.
111300     GO TO   MPY-INIT-F2-22.
111400 MPY-TEST-F2-21-1.
111500     IF      WRK-DU-2V0-1  = 0
111600             PERFORM PASS
111700             PERFORM PRINT-DETAIL
111800     ELSE
111900             PERFORM FAIL
112000             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
112100             MOVE    0 TO CORRECT-N
112200             PERFORM PRINT-DETAIL.
112300     ADD 1 TO REC-CT.
112400 MPY-TEST-F2-21-2.
112500     IF      WRK-DU-2V0-2 = 0
112600             PERFORM PASS
112700             PERFORM PRINT-DETAIL
112800     ELSE
112900             PERFORM FAIL
113000             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
113100             MOVE    0   TO CORRECT-N
113200             PERFORM PRINT-DETAIL.
113300     ADD 1 TO REC-CT.
113400 MPY-TEST-F2-21-3.
113500     IF WRK-DU-2V5-1 = 0.00000 PERFORM PASS PERFORM PRINT-DETAIL
113600     ELSE
113700     PERFORM FAIL MOVE WRK-DU-2V5-1 TO COMPUTED-N MOVE 0.00000 TO
113800     CORRECT-N PERFORM PRINT-DETAIL.
113900     ADD 1 TO REC-CT.
114000 MPY-TEST-F2-21-4.
114100     IF WRK-NE-2 = "$**.00" PERFORM PASS PERFORM PRINT-DETAIL
114200     ELSE
114300     PERFORM FAIL MOVE WRK-NE-2 TO COMPUTED-A MOVE "$**.00"
114400     TO CORRECT-A PERFORM PRINT-DETAIL.
114500     ADD 1 TO REC-CT.
114600 MPY-TEST-F2-21-5.
114700     IF WRK-NE-3 = "$00.00  " PERFORM PASS PERFORM PRINT-DETAIL
114800     ELSE
114900     PERFORM FAIL MOVE WRK-NE-3 TO COMPUTED-A MOVE "$00.00  "
115000     TO CORRECT-A PERFORM PRINT-DETAIL.
115100     ADD 1 TO REC-CT.
115200 MPY-TEST-F2-21-6.
115300     IF      WRK-XN-00001 = "1"
115400             PERFORM PASS
115500             PERFORM PRINT-DETAIL
115600     ELSE
115700             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
115800             MOVE    WRK-XN-00001  TO COMPUTED-X
115900             MOVE   "1"            TO CORRECT-X
116000             PERFORM FAIL
116100             PERFORM PRINT-DETAIL.
116200*
116300 MPY-INIT-F2-22.
116400*    ==--> NO SIZE ERROR CONDITION  <--==
116500*    ==-->  MULTIPLE RESULT FIELDS  <--==
116600     MOVE   "MPY-TEST-F2-22" TO PAR-NAME.
116700     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
116800     MOVE    999999 TO WRK-DU-6V0-1.
116900     MOVE    .00001 TO WRK-DU-4P1-1.
117000     MOVE    0      TO WRK-DU-2V0-1.
117100     MOVE    0      TO WRK-DU-2V0-2.
117200     MOVE    0      TO WRK-DU-2V5-1.
117300     MOVE    0      TO WRK-NE-2.
117400     MOVE    0      TO WRK-NE-3.
117500     MOVE    1      TO REC-CT.
117600     MOVE   "0"     TO WRK-XN-00001.
117700 MPY-TEST-F2-22-0.
117800     MULTIPLY WRK-DU-4P1-1 BY WRK-DU-6V0-1
117900       GIVING WRK-DU-2V0-1
118000              WRK-DU-2V0-2 ROUNDED
118100              WRK-DU-2V5-1
118200              WRK-NE-2 ROUNDED
118300              WRK-NE-3
118400              ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
118500     GO TO   MPY-TEST-F2-22-1.
118600 MPY-DELETE-F2-22.
118700     PERFORM DE-LETE.
118800     PERFORM PRINT-DETAIL.
118900     GO TO   MPY-INIT-F2-23.
119000 MPY-TEST-F2-22-1.
119100     IF      WRK-DU-2V0-1  = 9
119200             PERFORM PASS
119300             PERFORM PRINT-DETAIL
119400     ELSE
119500             PERFORM FAIL
119600             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
119700             MOVE    9 TO CORRECT-N
119800             PERFORM PRINT-DETAIL.
119900     ADD 1 TO REC-CT.
120000 MPY-TEST-F2-22-2.
120100     IF      WRK-DU-2V0-2 = 10
120200             PERFORM PASS
120300             PERFORM PRINT-DETAIL
120400     ELSE
120500             PERFORM FAIL
120600             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
120700             MOVE    10  TO CORRECT-N
120800             PERFORM PRINT-DETAIL.
120900     ADD 1 TO REC-CT.
121000 MPY-TEST-F2-22-3.
121100     IF WRK-DU-2V5-1 = 9.99999 PERFORM PASS PERFORM PRINT-DETAIL
121200     ELSE
121300     PERFORM FAIL MOVE WRK-DU-2V5-1 TO COMPUTED-N MOVE 9.99999 TO
121400     CORRECT-N PERFORM PRINT-DETAIL.
121500     ADD 1 TO REC-CT.
121600 MPY-TEST-F2-22-4.
121700     IF WRK-NE-2 = "$10.00" PERFORM PASS PERFORM PRINT-DETAIL
121800     ELSE
121900     PERFORM FAIL MOVE WRK-NE-2 TO COMPUTED-A MOVE "$10.00"
122000     TO CORRECT-A PERFORM PRINT-DETAIL.
122100     ADD 1 TO REC-CT.
122200 MPY-TEST-F2-22-5.
122300     IF WRK-NE-3 = "$09.99  " PERFORM PASS PERFORM PRINT-DETAIL
122400     ELSE
122500     PERFORM FAIL MOVE WRK-NE-3 TO COMPUTED-A MOVE "$09.99  "
122600     TO CORRECT-A PERFORM PRINT-DETAIL.
122700     ADD 1 TO REC-CT.
122800 MPY-TEST-F2-22-6.
122900     IF      WRK-XN-00001 = "0"
123000             PERFORM PASS
123100             PERFORM PRINT-DETAIL
123200     ELSE
123300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
123400             MOVE    WRK-XN-00001  TO COMPUTED-X
123500             MOVE   "0"            TO CORRECT-X
123600             PERFORM FAIL
123700             PERFORM PRINT-DETAIL.
123800*
123900 MPY-INIT-F2-23.
124000*    ==-->    SIZE ERROR CONDITION  <--==
124100*    ==-->  MULTIPLE RESULT FIELDS  <--==
124200     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
124300     MOVE   "MPY-TEST-F2-23" TO PAR-NAME.
124400     MOVE    999999 TO WRK-DU-6V0-1.
124500     MOVE    1 TO REC-CT.
124600     MOVE    0 TO WRK-DU-2V0-1.
124700     MOVE    0 TO WRK-DU-2V0-2.
124800     MOVE    0 TO WRK-DU-2V5-1.
124900     MOVE    0 TO WRK-NE-2.
125000     MOVE    0 TO WRK-NE-3.
125100     MOVE   "0" TO WRK-XN-00001.
125200 MPY-TEST-F2-23-0.
125300     MULTIPLY WRK-DU-6V0-1 BY WRK-DU-6V0-1
125400       GIVING WRK-DU-2V0-1
125500              WRK-DU-2V0-2 ROUNDED
125600              WRK-DU-2V5-1
125700              WRK-NE-2 ROUNDED
125800              WRK-NE-3
125900          NOT ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
126000     GO TO   MPY-TEST-F2-23-1.
126100 MPY-DELETE-F2-23.
126200     PERFORM DE-LETE.
126300     PERFORM PRINT-DETAIL.
126400     GO TO   MPY-INIT-F2-24.
126500 MPY-TEST-F2-23-1.
126600     IF      WRK-DU-2V0-1  = 0
126700             PERFORM PASS
126800             PERFORM PRINT-DETAIL
126900     ELSE
127000             PERFORM FAIL
127100             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
127200             MOVE    0 TO CORRECT-N
127300             PERFORM PRINT-DETAIL.
127400     ADD 1 TO REC-CT.
127500 MPY-TEST-F2-23-2.
127600     IF      WRK-DU-2V0-2 = 0
127700             PERFORM PASS
127800             PERFORM PRINT-DETAIL
127900     ELSE
128000             PERFORM FAIL
128100             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
128200             MOVE    0   TO CORRECT-N
128300             PERFORM PRINT-DETAIL.
128400     ADD 1 TO REC-CT.
128500 MPY-TEST-F2-23-3.
128600     IF WRK-DU-2V5-1 = 0.00000 PERFORM PASS PERFORM PRINT-DETAIL
128700     ELSE
128800     PERFORM FAIL MOVE WRK-DU-2V5-1 TO COMPUTED-N MOVE 0.00000 TO
128900     CORRECT-N PERFORM PRINT-DETAIL.
129000     ADD 1 TO REC-CT.
129100 MPY-TEST-F2-23-4.
129200     IF WRK-NE-2 = "$**.00" PERFORM PASS PERFORM PRINT-DETAIL
129300     ELSE
129400     PERFORM FAIL MOVE WRK-NE-2 TO COMPUTED-A MOVE "$**.00"
129500     TO CORRECT-A PERFORM PRINT-DETAIL.
129600     ADD 1 TO REC-CT.
129700 MPY-TEST-F2-23-5.
129800     IF WRK-NE-3 = "$00.00  " PERFORM PASS PERFORM PRINT-DETAIL
129900     ELSE
130000     PERFORM FAIL MOVE WRK-NE-3 TO COMPUTED-A MOVE "$00.00  "
130100     TO CORRECT-A PERFORM PRINT-DETAIL.
130200     ADD 1 TO REC-CT.
130300 MPY-TEST-F2-23-6.
130400     IF      WRK-XN-00001 = "0"
130500             PERFORM PASS
130600             PERFORM PRINT-DETAIL
130700     ELSE
130800             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
130900             MOVE    WRK-XN-00001  TO COMPUTED-X
131000             MOVE   "0"            TO CORRECT-X
131100             PERFORM FAIL
131200             PERFORM PRINT-DETAIL.
131300*
131400 MPY-INIT-F2-24.
131500*    ==--> NO SIZE ERROR CONDITION  <--==
131600*    ==-->  MULTIPLE RESULT FIELDS  <--==
131700     MOVE   "V1-67 6.4.2" TO ANSI-REFERENCE.
131800     MOVE   "MPY-TEST-F2-24" TO PAR-NAME.
131900     MOVE    999999 TO WRK-DU-6V0-1.
132000     MOVE    .00001 TO WRK-DU-4P1-1.
132100     MOVE    0      TO WRK-DU-2V0-1.
132200     MOVE    0      TO WRK-DU-2V0-2.
132300     MOVE    0      TO WRK-DU-2V5-1.
132400     MOVE    0      TO WRK-NE-2.
132500     MOVE    0      TO WRK-NE-3.
132600     MOVE    1      TO REC-CT.
132700     MOVE   "0"     TO WRK-XN-00001.
132800 MPY-TEST-F2-24-0.
132900     MULTIPLY WRK-DU-4P1-1 BY WRK-DU-6V0-1
133000       GIVING WRK-DU-2V0-1
133100              WRK-DU-2V0-2 ROUNDED
133200              WRK-DU-2V5-1
133300              WRK-NE-2 ROUNDED
133400              WRK-NE-3
133500          NOT ON SIZE ERROR MOVE "1" TO WRK-XN-00001.
133600     GO TO   MPY-TEST-F2-24-1.
133700 MPY-DELETE-F2-24.
133800     PERFORM DE-LETE.
133900     PERFORM PRINT-DETAIL.
134000     GO TO   MPY-INIT-F2-25.
134100 MPY-TEST-F2-24-1.
134200     IF      WRK-DU-2V0-1  = 9
134300             PERFORM PASS
134400             PERFORM PRINT-DETAIL
134500     ELSE
134600             PERFORM FAIL
134700             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
134800             MOVE    9 TO CORRECT-N
134900             PERFORM PRINT-DETAIL.
135000     ADD 1 TO REC-CT.
135100 MPY-TEST-F2-24-2.
135200     IF      WRK-DU-2V0-2 = 10
135300             PERFORM PASS
135400             PERFORM PRINT-DETAIL
135500     ELSE
135600             PERFORM FAIL
135700             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
135800             MOVE    10  TO CORRECT-N
135900             PERFORM PRINT-DETAIL.
136000     ADD 1 TO REC-CT.
136100 MPY-TEST-F2-24-3.
136200     IF WRK-DU-2V5-1 = 9.99999 PERFORM PASS PERFORM PRINT-DETAIL
136300     ELSE
136400     PERFORM FAIL MOVE WRK-DU-2V5-1 TO COMPUTED-N MOVE 9.99999 TO
136500     CORRECT-N PERFORM PRINT-DETAIL.
136600     ADD 1 TO REC-CT.
136700 MPY-TEST-F2-24-4.
136800     IF WRK-NE-2 = "$10.00" PERFORM PASS PERFORM PRINT-DETAIL
136900     ELSE
137000     PERFORM FAIL MOVE WRK-NE-2 TO COMPUTED-A MOVE "$10.00"
137100     TO CORRECT-A PERFORM PRINT-DETAIL.
137200     ADD 1 TO REC-CT.
137300 MPY-TEST-F2-24-5.
137400     IF WRK-NE-3 = "$09.99  " PERFORM PASS PERFORM PRINT-DETAIL
137500     ELSE
137600     PERFORM FAIL MOVE WRK-NE-3 TO COMPUTED-A MOVE "$09.99  "
137700     TO CORRECT-A PERFORM PRINT-DETAIL.
137800     ADD 1 TO REC-CT.
137900 MPY-TEST-F2-24-6.
138000     IF      WRK-XN-00001 = "1"
138100             PERFORM PASS
138200             PERFORM PRINT-DETAIL
138300     ELSE
138400             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
138500             MOVE    WRK-DU-6V0-2  TO COMPUTED-X
138600             MOVE   "1"            TO CORRECT-X
138700             PERFORM FAIL
138800             PERFORM PRINT-DETAIL.
138900*
139000 MPY-INIT-F2-25.
139100*    ==-->   SIZE ERROR CONDITION   <--==
139200*    ==-->  MULTIPLE RESULT FIELDS  <--==
139300     MOVE   "V1-67 6.4.2"    TO ANSI-REFERENCE.
139400     MOVE   "MPY-TEST-F2-25" TO PAR-NAME.
139500     MOVE    999999 TO WRK-DU-6V0-1.
139600     MOVE    1 TO REC-CT.
139700     MOVE    0 TO WRK-DU-2V0-1.
139800     MOVE    0 TO WRK-DU-2V0-2.
139900     MOVE    0 TO WRK-DU-2V5-1.
140000     MOVE    0 TO WRK-NE-2.
140100     MOVE    0 TO WRK-NE-3.
140200     MOVE   "0" TO WRK-XN-00001.
140300 MPY-TEST-F2-25-0.
140400     MULTIPLY WRK-DU-6V0-1 BY WRK-DU-6V0-1
140500       GIVING WRK-DU-2V0-1
140600              WRK-DU-2V0-2 ROUNDED
140700              WRK-DU-2V5-1
140800              WRK-NE-2 ROUNDED
140900              WRK-NE-3
141000              ON SIZE ERROR MOVE "1" TO WRK-XN-00001
141100          NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001.
141200     GO TO   MPY-TEST-F2-25-1.
141300 MPY-DELETE-F2-25.
141400     PERFORM DE-LETE.
141500     PERFORM PRINT-DETAIL.
141600     GO TO   MPY-INIT-F2-26.
141700 MPY-TEST-F2-25-1.
141800     IF      WRK-DU-2V0-1  = 0
141900             PERFORM PASS
142000             PERFORM PRINT-DETAIL
142100     ELSE
142200             PERFORM FAIL
142300             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
142400             MOVE    0 TO CORRECT-N
142500             PERFORM PRINT-DETAIL.
142600     ADD 1 TO REC-CT.
142700 MPY-TEST-F2-25-2.
142800     IF      WRK-DU-2V0-2 = 00
142900             PERFORM PASS
143000             PERFORM PRINT-DETAIL
143100     ELSE
143200             PERFORM FAIL
143300             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
143400             MOVE    00  TO CORRECT-N
143500             PERFORM PRINT-DETAIL.
143600     ADD 1 TO REC-CT.
143700 MPY-TEST-F2-25-3.
143800     IF WRK-DU-2V5-1 = 0.00000 PERFORM PASS PERFORM PRINT-DETAIL
143900     ELSE
144000     PERFORM FAIL MOVE WRK-DU-2V5-1 TO COMPUTED-N MOVE 0.00000 TO
144100     CORRECT-N PERFORM PRINT-DETAIL.
144200     ADD 1 TO REC-CT.
144300 MPY-TEST-F2-25-4.
144400     IF WRK-NE-2 = "$**.00" PERFORM PASS PERFORM PRINT-DETAIL
144500     ELSE
144600     PERFORM FAIL MOVE WRK-NE-2 TO COMPUTED-A MOVE "$**.00"
144700     TO CORRECT-A PERFORM PRINT-DETAIL.
144800     ADD 1 TO REC-CT.
144900 MPY-TEST-F2-25-5.
145000     IF WRK-NE-3 = "$00.00  " PERFORM PASS PERFORM PRINT-DETAIL
145100     ELSE
145200     PERFORM FAIL MOVE WRK-NE-3 TO COMPUTED-A MOVE "$00.00  "
145300     TO CORRECT-A PERFORM PRINT-DETAIL.
145400     ADD 1 TO REC-CT.
145500 MPY-TEST-F2-25-6.
145600     IF      WRK-XN-00001 = "1"
145700             PERFORM PASS
145800             PERFORM PRINT-DETAIL
145900     ELSE
146000             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
146100             MOVE    WRK-DU-6V0-2  TO COMPUTED-X
146200             MOVE   "1"            TO CORRECT-X
146300             PERFORM FAIL
146400             PERFORM PRINT-DETAIL.
146500*
146600*
146700 MPY-INIT-F2-26.
146800*    ==-->  NO SIZE ERROR CONDITION <--==
146900*    ==-->  MULTIPLE RESULT FIELDS  <--==
147000     MOVE   "MPY-TEST-F2-26" TO PAR-NAME.
147100     MOVE   "V1-67 6.4.2"    TO ANSI-REFERENCE.
147200     MOVE    999999 TO WRK-DU-6V0-1.
147300     MOVE    .00001 TO WRK-DU-4P1-1.
147400     MOVE    1 TO REC-CT.
147500     MOVE    0 TO WRK-DU-2V0-1.
147600     MOVE    0 TO WRK-DU-2V5-1.
147700     MOVE    0 TO WRK-NE-2.
147800     MOVE    0 TO WRK-NE-3.
147900     MOVE   "0" TO WRK-XN-00001.
148000 MPY-TEST-F2-26-0.
148100     MULTIPLY WRK-DU-4P1-1 BY WRK-DU-6V0-1
148200       GIVING WRK-DU-2V0-1
148300              WRK-DU-2V0-2 ROUNDED
148400              WRK-DU-2V5-1
148500              WRK-NE-2 ROUNDED
148600              WRK-NE-3
148700              ON SIZE ERROR MOVE "1" TO WRK-XN-00001
148800          NOT ON SIZE ERROR MOVE "2" TO WRK-XN-00001.
148900     GO TO   MPY-TEST-F2-26-1.
149000 MPY-DELETE-F2-26.
149100     PERFORM DE-LETE.
149200     PERFORM PRINT-DETAIL.
149300     GO TO   MPY-INIT-F2-27.
149400 MPY-TEST-F2-26-1.
149500     IF      WRK-DU-2V0-1  = 9
149600             PERFORM PASS
149700             PERFORM PRINT-DETAIL
149800     ELSE
149900             PERFORM FAIL
150000             MOVE    WRK-DU-2V0-1 TO COMPUTED-N
150100             MOVE    9 TO CORRECT-N
150200             PERFORM PRINT-DETAIL.
150300     ADD 1 TO REC-CT.
150400 MPY-TEST-F2-26-2.
150500     IF      WRK-DU-2V0-2 = 10
150600             PERFORM PASS
150700             PERFORM PRINT-DETAIL
150800     ELSE
150900             PERFORM FAIL
151000             MOVE    WRK-DU-2V0-2 TO COMPUTED-N
151100             MOVE    10  TO CORRECT-N
151200             PERFORM PRINT-DETAIL.
151300     ADD 1 TO REC-CT.
151400 MPY-TEST-F2-26-3.
151500     IF WRK-DU-2V5-1 = 9.99999 PERFORM PASS PERFORM PRINT-DETAIL
151600     ELSE
151700     PERFORM FAIL MOVE WRK-DU-2V5-1 TO COMPUTED-N MOVE 9.99999 TO
151800     CORRECT-N PERFORM PRINT-DETAIL.
151900     ADD 1 TO REC-CT.
152000 MPY-TEST-F2-26-4.
152100     IF WRK-NE-2 = "$10.00" PERFORM PASS PERFORM PRINT-DETAIL
152200     ELSE
152300     PERFORM FAIL MOVE WRK-NE-2 TO COMPUTED-A MOVE "$10.00"
152400     TO CORRECT-A PERFORM PRINT-DETAIL.
152500     ADD 1 TO REC-CT.
152600 MPY-TEST-F2-26-5.
152700     IF WRK-NE-3 = "$09.99  " PERFORM PASS PERFORM PRINT-DETAIL
152800     ELSE
152900     PERFORM FAIL MOVE WRK-NE-3 TO COMPUTED-A MOVE "$09.99  "
153000     TO CORRECT-A PERFORM PRINT-DETAIL.
153100     ADD 1 TO REC-CT.
153200 MPY-TEST-F2-26-6.
153300     IF      WRK-XN-00001 = "2"
153400             PERFORM PASS
153500             PERFORM PRINT-DETAIL
153600     ELSE
153700             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
153800             MOVE    WRK-DU-6V0-2  TO COMPUTED-X
153900             MOVE   "2"            TO CORRECT-X
154000             PERFORM FAIL
154100             PERFORM PRINT-DETAIL.
154200*
154300 MPY-INIT-F2-27.
154400*    ==--> EXPLICIT SCOPE TERMINATOR <--==
154500     MOVE   "1V-41 6.4.3"    TO ANSI-REFERENCE.
154600     MOVE    "MPY-TEST-F2-27" TO PAR-NAME.
154700     MOVE    "A" TO XRAY.
154800     MOVE 80.12  TO MULT1.
154900     MOVE   -56  TO MULT4.
155000     MOVE     4  TO MULT5.
155100     MOVE     0  TO WRK-DS-10V00.
155200     MOVE     0  TO WRK-DS-02V00.
155300     MOVE     1  TO REC-CT.
155400 MPY-TEST-F2-27-0.
155500     MULTIPLY MULT4 BY MULT1
155600       GIVING MULT5
155700              ON SIZE ERROR
155800              MOVE    "H" TO XRAY
155900              MOVE    28  TO WRK-DS-10V00
156000              MOVE   -19  TO WRK-DS-02V00
156100     END-MULTIPLY
156200     MOVE    99 TO WRK-CS-18V00.
156300     GO TO MPY-TEST-F2-27-1.
156400 MPY-DELETE-F2-27-1.
156500     PERFORM DE-LETE.
156600     PERFORM PRINT-DETAIL.
156700     GO TO   MPY-INIT-F2-28.
156800 MPY-TEST-F2-27-1.
156900     MOVE "MPY-TEST-F2-27-1" TO PAR-NAME.
157000     IF      XRAY    = "H"
157100             PERFORM PASS
157200             PERFORM PRINT-DETAIL
157300     ELSE
157400             MOVE  XRAY   TO COMPUTED-X
157500             MOVE "H"     TO CORRECT-X
157600             MOVE "SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK
157700             PERFORM FAIL
157800             PERFORM PRINT-DETAIL.
157900     ADD     1 TO REC-CT.
158000 MPY-TEST-F2-27-2.
158100     MOVE "MPY-TEST-F2-27-2" TO PAR-NAME.
158200     IF      WRK-DS-10V00 = 0000000028
158300             PERFORM PASS
158400             PERFORM PRINT-DETAIL
158500     ELSE
158600             MOVE  WRK-DS-10V00 TO COMPUTED-N
158700             MOVE  28           TO CORRECT-N
158800             MOVE "SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK
158900             PERFORM FAIL
159000             PERFORM PRINT-DETAIL.
159100     ADD     1 TO REC-CT.
159200 MPY-TEST-F2-27-3.
159300     MOVE  "MPY-TEST-F2-27-3" TO PAR-NAME.
159400     IF      WRK-DS-02V00 = -19
159500             PERFORM PASS
159600             PERFORM PRINT-DETAIL
159700     ELSE
159800             MOVE  WRK-DS-02V00 TO COMPUTED-N
159900             MOVE  -19          TO CORRECT-N
160000             MOVE "SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK
160100             PERFORM FAIL
160200             PERFORM PRINT-DETAIL.
160300     ADD     1 TO REC-CT.
160400 MPY-TEST-F2-27-4.
160500     MOVE "MPY-TEST-F2-27-4" TO PAR-NAME.
160600     IF      WRK-CS-18V00 = 000000000000000099
160700             PERFORM PASS
160800             PERFORM PRINT-DETAIL
160900     ELSE
161000             MOVE  WRK-CS-18V00 TO COMPUTED-N
161100             MOVE  99           TO CORRECT-N
161200             MOVE "SCOPE TERMINATOR IGNORED" TO RE-MARK
161300             PERFORM FAIL
161400             PERFORM PRINT-DETAIL.
161500     ADD     1 TO REC-CT.
161600 MPY-TEST-F2-27-5.
161700     MOVE "MPY-TEST-F2-27-5" TO PAR-NAME.
161800     IF      MULT5 = 4
161900             PERFORM PASS
162000             PERFORM PRINT-DETAIL
162100     ELSE
162200             MOVE  MULT5 TO COMPUTED-N
162300             MOVE  4     TO CORRECT-N
162400             MOVE "SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK
162500             PERFORM FAIL
162600             PERFORM PRINT-DETAIL.
162700*
162800 MPY-INIT-F2-28.
162900*    ==-->  EXPLICIT SCOPE TERMINATOR  <--==
163000     MOVE   "1V-41 6.4.3"    TO ANSI-REFERENCE.
163100     MOVE    "MPY-TEST-F2-28" TO PAR-NAME.
163200     MOVE   "1"   TO WRK-XN-00001.
163300     MOVE    0    TO WRK-DS-05V00.
163400     MOVE    0    TO WRK-DS-02V00.
163500     MOVE    0    TO WRK-DS-10V00.
163600     MOVE    1    TO REC-CT.
163700 MPY-TEST-F2-28-0.
163800     MULTIPLY A01ONE-DS-P0801 BY A12ONES-DS-12V00
163900       GIVING WRK-DS-10V00
164000           ON SIZE ERROR
164100              MOVE "0" TO WRK-XN-00001
164200              MOVE  38 TO WRK-DS-05V00
164300              MOVE -19 TO WRK-DS-02V00
164400     END-MULTIPLY
164500     MOVE    99 TO WRK-CS-18V00.
164600     GO TO   MPY-TEST-F2-28-1.
164700 MPY-DELETE-F2-28-1.
164800     PERFORM DE-LETE.
164900     PERFORM PRINT-DETAIL.
165000     GO TO   MPY-INIT-F2-29.
165100 MPY-TEST-F2-28-1.
165200     MOVE    "MPY-TEST-F2-28-1" TO PAR-NAME.
165300     IF      WRK-XN-00001 = "1"
165400             PERFORM PASS
165500             PERFORM PRINT-DETAIL
165600     ELSE
165700             MOVE    WRK-XN-00001 TO COMPUTED-X
165800             MOVE   "1"           TO CORRECT-X
165900             MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
166000                  TO RE-MARK
166100             PERFORM FAIL
166200             PERFORM PRINT-DETAIL.
166300     ADD     1 TO REC-CT.
166400 MPY-TEST-F2-28-2.
166500     MOVE   "MPY-TEST-F2-28-2" TO PAR-NAME.
166600     IF      WRK-DS-10V00 = 0000000111
166700             PERFORM PASS
166800             PERFORM PRINT-DETAIL
166900     ELSE
167000             MOVE  WRK-DS-10V00 TO COMPUTED-N
167100             MOVE  0000000111   TO CORRECT-N
167200             MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
167300             PERFORM FAIL
167400             PERFORM PRINT-DETAIL.
167500     ADD     1 TO REC-CT.
167600 MPY-TEST-F2-28-3.
167700     MOVE    "MPY-TEST-F2-28-3" TO PAR-NAME.
167800     IF      WRK-DS-05V00 = 0
167900             PERFORM PASS
168000             PERFORM PRINT-DETAIL
168100     ELSE
168200             MOVE  WRK-DS-05V00 TO COMPUTED-N
168300             MOVE  0            TO CORRECT-N
168400             MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED"
168500                TO RE-MARK
168600             PERFORM FAIL
168700             PERFORM PRINT-DETAIL.
168800     ADD     1 TO REC-CT.
168900 MPY-TEST-F2-28-4.
169000     MOVE   "MPY-TEST-F2-28-4" TO PAR-NAME.
169100     IF      WRK-DS-02V00 = 0
169200             PERFORM PASS
169300             PERFORM PRINT-DETAIL
169400     ELSE
169500             MOVE  WRK-DS-02V00 TO COMPUTED-N
169600             MOVE  0            TO CORRECT-N
169700             MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED"
169800                TO RE-MARK
169900             PERFORM FAIL
170000             PERFORM PRINT-DETAIL.
170100     ADD     1 TO REC-CT.
170200 MPY-TEST-F2-28-5.
170300     MOVE   "MPY-TEST-F2-28-5" TO PAR-NAME.
170400     IF      WRK-CS-18V00 = 000000000000000099
170500             PERFORM PASS
170600             PERFORM PRINT-DETAIL
170700     ELSE
170800             MOVE  WRK-CS-18V00 TO COMPUTED-N
170900             MOVE  99           TO CORRECT-N
171000             MOVE "SCOPE TERMINATOR IGNORED"
171100                TO RE-MARK
171200             PERFORM FAIL
171300             PERFORM PRINT-DETAIL.
171400*
171500 MPY-INIT-F2-29.
171600*    ==--> EXPLICIT SCOPE TERMINATOR <--==
171700*    ==-->    SIZE ERROR CONDITION   <--==
171800     MOVE   "1V-41 6.4.3"    TO ANSI-REFERENCE.
171900     MOVE    "MPY-TEST-F2-29" TO PAR-NAME.
172000     MOVE    "A" TO XRAY.
172100     MOVE 80.12  TO MULT1.
172200     MOVE   -56  TO MULT4.
172300     MOVE     4  TO MULT5.
172400     MOVE     1  TO REC-CT.
172500     MOVE     0  TO WRK-DS-10V00.
172600     MOVE     0  TO WRK-DS-02V00.
172700 MPY-TEST-F2-29-0.
172800     MULTIPLY MULT4 BY MULT1
172900       GIVING MULT5
173000       NOT ON SIZE ERROR
173100              MOVE    "H" TO XRAY
173200              MOVE    38  TO WRK-DS-10V00
173300              MOVE   -19  TO WRK-DS-02V00
173400     END-MULTIPLY
173500     MOVE    99 TO WRK-CS-18V00.
173600      GO TO MPY-TEST-F2-29-1.
173700 MPY-DELETE-F2-29-1.
173800     PERFORM DE-LETE.
173900     PERFORM PRINT-DETAIL.
174000     GO TO   MPY-INIT-F2-30.
174100 MPY-TEST-F2-29-1.
174200     MOVE    "MPY-TEST-F2-29-1" TO PAR-NAME.
174300     IF      XRAY    = "A"
174400             PERFORM PASS
174500             PERFORM PRINT-DETAIL
174600     ELSE
174700             MOVE    XRAY   TO COMPUTED-X
174800             MOVE   "A"     TO CORRECT-X
174900             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
175000                  TO RE-MARK
175100             PERFORM FAIL
175200             PERFORM PRINT-DETAIL.
175300     ADD     1 TO REC-CT.
175400 MPY-TEST-F2-29-2.
175500     MOVE   "MPY-TEST-F2-29-2" TO PAR-NAME.
175600     IF      WRK-DS-10V00 = 0
175700             PERFORM PASS
175800             PERFORM PRINT-DETAIL
175900     ELSE
176000             MOVE   WRK-DS-10V00 TO COMPUTED-N
176100             MOVE   0            TO CORRECT-N
176200             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
176300                  TO RE-MARK
176400             PERFORM FAIL
176500             PERFORM PRINT-DETAIL.
176600     ADD     1 TO REC-CT.
176700 MPY-TEST-F2-29-3.
176800     MOVE   "MPY-TEST-F2-29-3" TO PAR-NAME.
176900     IF      WRK-DS-02V00 = 0
177000             PERFORM PASS
177100             PERFORM PRINT-DETAIL
177200     ELSE
177300             MOVE   WRK-DS-02V00 TO COMPUTED-N
177400             MOVE   0            TO CORRECT-N
177500             MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
177600                  TO RE-MARK
177700             PERFORM FAIL
177800             PERFORM PRINT-DETAIL.
177900     ADD     1 TO REC-CT.
178000 MPY-TEST-F2-29-4.
178100     MOVE   "MPY-TEST-F2-29-4" TO PAR-NAME.
178200     IF      WRK-CS-18V00 = 000000000000000099
178300             PERFORM PASS
178400             PERFORM PRINT-DETAIL
178500     ELSE
178600             MOVE    WRK-CS-18V00 TO COMPUTED-N
178700             MOVE    99           TO CORRECT-N
178800             MOVE   "SCOPE TERMINATOR IGNORED"
178900                  TO RE-MARK
179000             PERFORM FAIL
179100             PERFORM PRINT-DETAIL.
179200     ADD     1 TO REC-CT.
179300 MPY-TEST-F2-29-5.
179400     MOVE   "MPY-TEST-F2-29-5" TO PAR-NAME.
179500     IF      MULT5   = 4
179600             PERFORM PASS
179700             PERFORM PRINT-DETAIL
179800     ELSE
179900             MOVE   MULT5  TO COMPUTED-N
180000             MOVE   4      TO CORRECT-N
180100             MOVE   "WRONGLY AFFECTED BY SIZE ERROR"
180200                  TO RE-MARK
180300             PERFORM FAIL
180400             PERFORM PRINT-DETAIL.
180500*
180600 MPY-INIT-F2-30.
180700*    ==--> EXPLICIT SCOPE TERMINATOR <--==
180800*    ==-->  NO SIZE ERROR CONDITION  <--==
180900     MOVE   "MPY-TEST-F2-30" TO PAR-NAME
181000     MOVE   "1V-41 6.4.3"    TO ANSI-REFERENCE.
181100     MOVE   "1"   TO WRK-XN-00001.
181200     MOVE    0    TO WRK-DS-05V00.
181300     MOVE    0    TO WRK-DS-02V00.
181400     MOVE    0    TO WRK-DS-10V00.
181500     MOVE    1    TO REC-CT.
181600 MPY-TEST-F2-30-0.
181700     MULTIPLY A01ONE-DS-P0801 BY A12ONES-DS-12V00
181800       GIVING WRK-DS-10V00
181900       NOT ON SIZE ERROR
182000              MOVE "0" TO WRK-XN-00001
182100              MOVE  38 TO WRK-DS-05V00
182200              MOVE -19 TO WRK-DS-02V00
182300     END-MULTIPLY
182400     MOVE    99 TO WRK-CS-18V00.
182500     GO TO   MPY-TEST-F2-30-1.
182600 MPY-DELETE-F2-30-1.
182700     PERFORM DE-LETE.
182800     PERFORM PRINT-DETAIL.
182900     GO TO   MPY-INIT-F2-31.
183000 MPY-TEST-F2-30-1.
183100     MOVE   "MPY-TEST-F2-30-1" TO PAR-NAME.
183200     IF      WRK-XN-00001 = "0"
183300             PERFORM PASS
183400             PERFORM PRINT-DETAIL
183500     ELSE
183600             MOVE  WRK-XN-00001 TO COMPUTED-X
183700             MOVE "0"           TO CORRECT-X
183800             MOVE "ON SIZE ERROR SHOULD NOT BE EXECUTED"
183900                TO RE-MARK
184000             PERFORM FAIL
184100             PERFORM PRINT-DETAIL.
184200     ADD     1 TO REC-CT.
184300 MPY-TEST-F2-30-2.
184400     MOVE   "MPY-TEST-F2-30-2" TO PAR-NAME.
184500     IF      WRK-DS-10V00 = 0000000111
184600             PERFORM PASS
184700             PERFORM PRINT-DETAIL
184800     ELSE
184900             MOVE  WRK-DS-10V00 TO COMPUTED-N
185000             MOVE  28           TO CORRECT-N
185100             MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
185200             PERFORM FAIL
185300             PERFORM PRINT-DETAIL.
185400     ADD     1 TO REC-CT.
185500 MPY-TEST-F2-30-3.
185600     MOVE   "MPY-TEST-F2-30-3" TO PAR-NAME.
185700     IF      WRK-DS-05V00 = 38
185800             PERFORM PASS
185900             PERFORM PRINT-DETAIL
186000     ELSE
186100             MOVE  WRK-DS-05V00 TO COMPUTED-N
186200             MOVE  38           TO CORRECT-N
186300             MOVE "SIZE ERROR SHOULD HAVE OCCURRED"
186400                TO RE-MARK
186500             PERFORM FAIL
186600             PERFORM PRINT-DETAIL.
186700     ADD     1 TO REC-CT.
186800 MPY-TEST-F2-30-4.
186900     MOVE   "MPY-TEST-F2-30-4" TO PAR-NAME.
187000     IF      WRK-DS-02V00 = -19
187100             PERFORM PASS
187200             PERFORM PRINT-DETAIL
187300     ELSE
187400             MOVE  WRK-DS-02V00 TO COMPUTED-N
187500             MOVE  -19          TO CORRECT-N
187600             MOVE "SIZE ERROR SHOULD HAVE OCCURRED"
187700                TO RE-MARK
187800             PERFORM FAIL
187900             PERFORM PRINT-DETAIL.
188000     ADD     1 TO REC-CT.
188100 MPY-TEST-F2-30-5.
188200     MOVE   "MPY-TEST-F2-30-5" TO PAR-NAME.
188300     IF      WRK-CS-18V00 = 000000000000000099
188400             PERFORM PASS
188500             PERFORM PRINT-DETAIL
188600     ELSE
188700             MOVE  WRK-CS-18V00 TO COMPUTED-N
188800             MOVE  99           TO CORRECT-N
188900             MOVE "SCOPE TERMINATOR IGNORED"
189000                TO RE-MARK
189100             PERFORM FAIL
189200             PERFORM PRINT-DETAIL.
189300*
189400 MPY-INIT-F2-31.
189500*    ==--> EXPLICIT SCOPE TERMINATOR <--==
189600*    ==-->  NO SIZE ERROR CONDITION  <--==
189700     MOVE   "1V-41 6.4.3"    TO ANSI-REFERENCE.
189800     MOVE   "MPY-TEST-F2-31" TO PAR-NAME
189900     MOVE 80.12  TO MULT1.
190000     MOVE   -56  TO MULT4.
190100     MOVE     4  TO MULT5.
190200     MOVE     1  TO REC-CT.
190300     MOVE    "A" TO XRAY.
190400 MPY-TEST-F2-31-0.
190500     MULTIPLY MULT4 BY MULT1
190600       GIVING MULT5
190700           ON SIZE ERROR
190800              MOVE    "B" TO XRAY
190900       NOT ON SIZE ERROR
191000              MOVE    "C" TO XRAY
191100     END-MULTIPLY
191200     MOVE    99 TO WRK-CS-18V00.
191300      GO TO MPY-TEST-F2-31-1.
191400 MPY-DELETE-F2-31-1.
191500     PERFORM DE-LETE.
191600     PERFORM PRINT-DETAIL.
191700     GO TO    MPY-INIT-F2-32.
191800 MPY-TEST-F2-31-1.
191900     MOVE   "MPY-TEST-F2-31-1" TO PAR-NAME.
192000     IF      XRAY    = "B"
192100             PERFORM PASS
192200             PERFORM PRINT-DETAIL
192300     ELSE
192400             MOVE    XRAY  TO COMPUTED-X
192500             MOVE   "B"    TO CORRECT-X
192600             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
192700             PERFORM FAIL
192800             PERFORM PRINT-DETAIL.
192900     ADD     1 TO REC-CT.
193000 MPY-TEST-F2-31-2.
193100     MOVE   "MPY-TEST-F2-31-2" TO PAR-NAME.
193200     IF      MULT5   = 4
193300             PERFORM PASS
193400             PERFORM PRINT-DETAIL
193500     ELSE
193600             MOVE    MULT5 TO COMPUTED-N
193700             MOVE    4     TO CORRECT-N
193800             MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
193900             PERFORM FAIL
194000             PERFORM PRINT-DETAIL.
194100     ADD     1 TO REC-CT.
194200 MPY-TEST-F2-31-3.
194300     MOVE   "MPY-TEST-F2-31-3" TO PAR-NAME.
194400     IF      WRK-CS-18V00 = 000000000000000099
194500             PERFORM PASS
194600             PERFORM PRINT-DETAIL
194700     ELSE
194800             MOVE    WRK-CS-18V00 TO COMPUTED-N
194900             MOVE    99           TO CORRECT-N
195000             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
195100             PERFORM FAIL
195200             PERFORM PRINT-DETAIL.
195300*
195400 MPY-INIT-F2-32.
195500*    ==--> EXPLICIT SCOPE TERMINATOR <--==
195600     MOVE   "1V-41 6.4.3"    TO ANSI-REFERENCE.
195700     MOVE   "MPY-TEST-F2-32" TO PAR-NAME
195800     MOVE   "0"   TO WRK-XN-00001.
195900     MOVE    0    TO WRK-DS-10V00.
196000     MOVE    1    TO REC-CT.
196100 MPY-TEST-F2-32-0.
196200     MULTIPLY A01ONE-DS-P0801 BY A12ONES-DS-12V00
196300       GIVING WRK-DS-10V00
196400           ON SIZE ERROR
196500              MOVE "1" TO WRK-XN-00001
196600       NOT ON SIZE ERROR
196700              MOVE "2" TO WRK-XN-00001
196800     END-MULTIPLY
196900     MOVE    99 TO WRK-CS-18V00.
197000     GO TO   MPY-TEST-F2-32-1.
197100 MPY-DELETE-F2-32-1.
197200     PERFORM DE-LETE.
197300     PERFORM PRINT-DETAIL.
197400     GO TO   CCVS-EXIT.
197500 MPY-TEST-F2-32-1.
197600     MOVE   "MPY-TEST-F2-32-1" TO PAR-NAME.
197700     IF      WRK-DS-10V00 = 0000000111
197800             PERFORM PASS
197900             PERFORM PRINT-DETAIL
198000     ELSE
198100             MOVE    0000000111       TO CORRECT-18V0
198200             MOVE    WRK-DS-10V00     TO COMPUTED-18V0
198300             MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
198400             PERFORM FAIL
198500             PERFORM PRINT-DETAIL.
198600     ADD     1 TO REC-CT.
198700 MPY-TEST-F2-32-2.
198800     MOVE   "MPY-TEST-F2-32-2" TO PAR-NAME.
198900     IF      WRK-XN-00001 = "2"
199000             PERFORM PASS
199100             PERFORM PRINT-DETAIL
199200     ELSE
199300             MOVE    WRK-XN-00001 TO COMPUTED-X
199400             MOVE   "2"           TO CORRECT-X
199500             MOVE   "SIZE ERROR SHOULD NOT BE EXECUTED"
199600                  TO RE-MARK
199700             PERFORM FAIL
199800             PERFORM PRINT-DETAIL.
199900     ADD     1 TO REC-CT.
200000 MPY-TEST-F2-32-3.
200100     MOVE   "MPY-TEST-F2-32-3" TO PAR-NAME.
200200     IF      WRK-CS-18V00 = 000000000000000099
200300             PERFORM PASS
200400             PERFORM PRINT-DETAIL
200500     ELSE
200600             MOVE    WRK-CS-18V00 TO COMPUTED-N
200700             MOVE    99           TO CORRECT-N
200800             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
200900             PERFORM FAIL
201000             PERFORM PRINT-DETAIL.
201100*
201200*
201300 CCVS-EXIT SECTION.
201400 CCVS-999999.
201500     GO TO CLOSE-FILES.
