000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC209A.
000400*                                                              *
000500****************************************************************
000600*                                                              *
000700*    VALIDATION FOR:-                                          *
000800*                                                              *
000900*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
001000*                                                              *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-82  - SOURCE COMPUTER NAME.                         *
001900*        X-83  - OBJECT COMPUTER NAME.                         *
002000*                                                              *
002100****************************************************************
002200*    PROGRAM NC209A TESTS FORMAT 2 OF THE "MOVE" STATEMENT,    *
002300*    USING QUALIFIED AND SUBSCRIPTED IDENTIFIERS.              *
002400*                                                              *
002500****************************************************************
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 01  A-LEVEL.
004300     02 B-LEVEL.
004400         03 C-LEVEL.
004500             04 D-LEVEL.
004600                 05 TOM           PICTURE XXX  VALUE "TOM".
004700                 05 DICK          PICTURE XXXX VALUE "DICK".
004800             04 DD-LEVEL.
004900                 05 HARRY         PICTURE X(5) VALUE "HARRY".
005000             04 DDD-LEVEL.
005100                 05 JOE           PICTURE XXX  VALUE "JOE".
005200     02 AL                        PICTURE XX   VALUE "AL".
005300     02 BB-LEVEL.
005400             04 BOB               PICTURE XXX  VALUE "BOB".
005500 01  A-GROUP.
005600     02 B-GROUP.
005700         10 C-LEVEL.
005800             12 D-LEVEL.
005900                 13 TOM           PICTURE XXX  VALUE "ZZZ".
006000                 13 DICK          PICTURE XXXX VALUE "ZZZZ".
006100             12 DD-LEVEL-FALSE.
006200                 13 HARRY         PICTURE X(5) VALUE "ZZZZZ".
006300             12 DDD-LEVEL.
006400                 13 JOE           PICTURE XXX  VALUE "ZZZ".
006500 01  A-BUNCH.
006600     49 TOM   PICTURE XXX  VALUE "YYY".
006700     49 DICK  PICTURE XXXX VALUE "YYYY".
006800     49 HARRY PICTURE X(5) VALUE "YYYYY".
006900     49 JOE   PICTURE XXX  VALUE "YYY".
007000     49 AL    PICTURE XX   VALUE "YY".
007100     49 BOB   PICTURE XXX  VALUE "YYY".
007200 01  A-SET.
007300     02 B-SET.
007400             04 D-LEVEL.
007500                 05 TOM           PICTURE XXX  VALUE "WWW".
007600                 05 DICK          PICTURE XXXX VALUE "WWWW".
007700             04 HARRY             PICTURE X(5) VALUE "WWWWW".
007800             04 BOB               PICTURE XXX  VALUE "WWW".
007900 01  C-STACK.
008000     04 D-LEVEL.
008100         05 TOM         PICTURE XXX  VALUE "VVV".
008200     04 DD-LEVEL.
008300         05 DICK        PICTURE XXXX VALUE "VVVV".
008400         05 HARRY       PICTURE X(5) VALUE "VVVVV".
008500 01  A-GLOB.
008600     02 B-LEVEL.
008700         03 C-LEVEL.
008800             04 D-LEVEL.
008900                 05 TOM           PICTURE XXX  VALUE "UUU".
009000                 05 DICK          PICTURE XXXX VALUE "UUUU".
009100             04  DD-LEVEL.
009200                 05 HARRY-A       PICTURE XX   VALUE "UU".
009300                 05 HARRY-B       PICTURE XXX  VALUE "UUU".
009400             04 DDD-LEVEL.
009500                 05 JOE           PICTURE XXX  VALUE "UUU".
009600     02 AL                        PICTURE XX   VALUE "UU".
009700     02 BB-LEVEL-FALSE.
009800             04 BOB               PICTURE XXX  VALUE "UUU".
009900      66         AL-BOB RENAMES AL OF A-GLOB THRU BOB OF A-GLOB.
010000     66 HARRY RENAMES HARRY-A THRU HARRY-B.
010100 01  A-COLLECTION.
010200     02 B-COLLECTION.
010300         03 C-COLLECTION.
010400             04 D-LEVEL.
010500                 05 TOM OCCURS 3 TIMES      PICTURE X.
010600                 05 DICK.
010700                     06 RICHARD OCCURS 2    PICTURE XX.
010800             04 DD-LEVEL-FALSE              PICTURE 9(5).
010900             04 DD-LEVEL REDEFINES DD-LEVEL-FALSE.
011000                 05 HARRY                   PICTURE X(5).
011100             04 DDD-LEVEL.
011200                 05 JOE                     PICTURE XXX.
011300                 05 JOSEPH REDEFINES JOE    PICTURE 999.
011400 01  WORK-AREA.
011500     02 WORK-TOM PICTURE XXX.
011600     02 FILLER PICTURE XXXX.
011700 01  A-COVEY.
011800     02 FILLER                    PICTURE X(45).
011900     02 B-COVEY.
012000         03 TOMMY                 PICTURE XXX  VALUE "SSS".
012100         03 DICKY                 PICTURE XXXX VALUE "SSSS".
012200         03 JOEY                  PICTURE XXX  VALUE "SSS".
012300         03 HAROLD                PICTURE X(5) VALUE "SSSSS".
012400 01  A-FLOCK REDEFINES A-COVEY.
012500     02 B-FLOCK OCCURS 4 TIMES.
012600         03 C-FLOCK.
012700             04 D-LEVEL.
012800                 05 TOM           PICTURE XXX.
012900                 05 DICK          PICTURE XXXX.
013000             04 DDD-LEVEL.
013100                 05 JOE           PICTURE XXX.
013200             04 DD-LEVEL.
013300                 05 HARRY         PICTURE X(5).
013400 01  A-CROWD.
013500     02 BB-CROWD.
013600         03 BOBBY       PICTURE XXX VALUE "RRR".
013700         03 FILLER      PICTURE X(15).
013800     02 BB-MOB REDEFINES BB-CROWD OCCURS 6 TIMES.
013900         03 BOB         PICTURE XXX.
014000 01  TEST-RESULTS.
014100     02 FILLER                   PIC X      VALUE SPACE.
014200     02 FEATURE                  PIC X(20)  VALUE SPACE.
014300     02 FILLER                   PIC X      VALUE SPACE.
014400     02 P-OR-F                   PIC X(5)   VALUE SPACE.
014500     02 FILLER                   PIC X      VALUE SPACE.
014600     02  PAR-NAME.
014700       03 FILLER                 PIC X(19)  VALUE SPACE.
014800       03  PARDOT-X              PIC X      VALUE SPACE.
014900       03 DOTVALUE               PIC 99     VALUE ZERO.
015000     02 FILLER                   PIC X(8)   VALUE SPACE.
015100     02 RE-MARK                  PIC X(61).
015200 01  TEST-COMPUTED.
015300     02 FILLER                   PIC X(30)  VALUE SPACE.
015400     02 FILLER                   PIC X(17)  VALUE
015500            "       COMPUTED=".
015600     02 COMPUTED-X.
015700     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
015800     03 COMPUTED-N               REDEFINES COMPUTED-A
015900                                 PIC -9(9).9(9).
016000     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
016100     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
016200     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
016300     03       CM-18V0 REDEFINES COMPUTED-A.
016400         04 COMPUTED-18V0                    PIC -9(18).
016500         04 FILLER                           PIC X.
016600     03 FILLER PIC X(50) VALUE SPACE.
016700 01  TEST-CORRECT.
016800     02 FILLER PIC X(30) VALUE SPACE.
016900     02 FILLER PIC X(17) VALUE "       CORRECT =".
017000     02 CORRECT-X.
017100     03 CORRECT-A                  PIC X(20) VALUE SPACE.
017200     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
017300     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
017400     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
017500     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
017600     03      CR-18V0 REDEFINES CORRECT-A.
017700         04 CORRECT-18V0                     PIC -9(18).
017800         04 FILLER                           PIC X.
017900     03 FILLER PIC X(2) VALUE SPACE.
018000     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
018100 01  CCVS-C-1.
018200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
018300-    "SS  PARAGRAPH-NAME
018400-    "       REMARKS".
018500     02 FILLER                     PIC X(20)    VALUE SPACE.
018600 01  CCVS-C-2.
018700     02 FILLER                     PIC X        VALUE SPACE.
018800     02 FILLER                     PIC X(6)     VALUE "TESTED".
018900     02 FILLER                     PIC X(15)    VALUE SPACE.
019000     02 FILLER                     PIC X(4)     VALUE "FAIL".
019100     02 FILLER                     PIC X(94)    VALUE SPACE.
019200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
019300 01  REC-CT                        PIC 99       VALUE ZERO.
019400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
019500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
019600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
019700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
019800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
019900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
020000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
020100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
020200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
020300 01  CCVS-H-1.
020400     02  FILLER                    PIC X(39)    VALUE SPACES.
020500     02  FILLER                    PIC X(42)    VALUE
020600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
020700     02  FILLER                    PIC X(39)    VALUE SPACES.
020800 01  CCVS-H-2A.
020900   02  FILLER                        PIC X(40)  VALUE SPACE.
021000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
021100   02  FILLER                        PIC XXXX   VALUE
021200     "4.2 ".
021300   02  FILLER                        PIC X(28)  VALUE
021400            " COPY - NOT FOR DISTRIBUTION".
021500   02  FILLER                        PIC X(41)  VALUE SPACE.
021600
021700 01  CCVS-H-2B.
021800   02  FILLER                        PIC X(15)  VALUE
021900            "TEST RESULT OF ".
022000   02  TEST-ID                       PIC X(9).
022100   02  FILLER                        PIC X(4)   VALUE
022200            " IN ".
022300   02  FILLER                        PIC X(12)  VALUE
022400     " HIGH       ".
022500   02  FILLER                        PIC X(22)  VALUE
022600            " LEVEL VALIDATION FOR ".
022700   02  FILLER                        PIC X(58)  VALUE
022800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
022900 01  CCVS-H-3.
023000     02  FILLER                      PIC X(34)  VALUE
023100            " FOR OFFICIAL USE ONLY    ".
023200     02  FILLER                      PIC X(58)  VALUE
023300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
023400     02  FILLER                      PIC X(28)  VALUE
023500            "  COPYRIGHT   1985 ".
023600 01  CCVS-E-1.
023700     02 FILLER                       PIC X(52)  VALUE SPACE.
023800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
023900     02 ID-AGAIN                     PIC X(9).
024000     02 FILLER                       PIC X(45)  VALUE SPACES.
024100 01  CCVS-E-2.
024200     02  FILLER                      PIC X(31)  VALUE SPACE.
024300     02  FILLER                      PIC X(21)  VALUE SPACE.
024400     02 CCVS-E-2-2.
024500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
024600         03 FILLER                   PIC X      VALUE SPACE.
024700         03 ENDER-DESC               PIC X(44)  VALUE
024800            "ERRORS ENCOUNTERED".
024900 01  CCVS-E-3.
025000     02  FILLER                      PIC X(22)  VALUE
025100            " FOR OFFICIAL USE ONLY".
025200     02  FILLER                      PIC X(12)  VALUE SPACE.
025300     02  FILLER                      PIC X(58)  VALUE
025400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025500     02  FILLER                      PIC X(13)  VALUE SPACE.
025600     02 FILLER                       PIC X(15)  VALUE
025700             " COPYRIGHT 1985".
025800 01  CCVS-E-4.
025900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
026000     02 FILLER                       PIC X(4)   VALUE " OF ".
026100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
026200     02 FILLER                       PIC X(40)  VALUE
026300      "  TESTS WERE EXECUTED SUCCESSFULLY".
026400 01  XXINFO.
026500     02 FILLER                       PIC X(19)  VALUE
026600            "*** INFORMATION ***".
026700     02 INFO-TEXT.
026800       04 FILLER                     PIC X(8)   VALUE SPACE.
026900       04 XXCOMPUTED                 PIC X(20).
027000       04 FILLER                     PIC X(5)   VALUE SPACE.
027100       04 XXCORRECT                  PIC X(20).
027200     02 INF-ANSI-REFERENCE           PIC X(48).
027300 01  HYPHEN-LINE.
027400     02 FILLER  PIC IS X VALUE IS SPACE.
027500     02 FILLER  PIC IS X(65)    VALUE IS "************************
027600-    "*****************************************".
027700     02 FILLER  PIC IS X(54)    VALUE IS "************************
027800-    "******************************".
027900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
028000     "NC209A".
028100 PROCEDURE DIVISION.
028200 CCVS1 SECTION.
028300 OPEN-FILES.
028400     OPEN     OUTPUT PRINT-FILE.
028500     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
028600     MOVE    SPACE TO TEST-RESULTS.
028700     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028800     GO TO CCVS1-EXIT.
028900 CLOSE-FILES.
029000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029100 TERMINATE-CCVS.
029200S    EXIT PROGRAM.
029300STERMINATE-CALL.
029400     STOP     RUN.
029500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029900     MOVE "****TEST DELETED****" TO RE-MARK.
030000 PRINT-DETAIL.
030100     IF REC-CT NOT EQUAL TO ZERO
030200             MOVE "." TO PARDOT-X
030300             MOVE REC-CT TO DOTVALUE.
030400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030900     MOVE SPACE TO CORRECT-X.
031000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
031100     MOVE     SPACE TO RE-MARK.
031200 HEAD-ROUTINE.
031300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031700 COLUMN-NAMES-ROUTINE.
031800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
032100 END-ROUTINE.
032200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
032300 END-RTN-EXIT.
032400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032500 END-ROUTINE-1.
032600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032800      ADD PASS-COUNTER TO ERROR-HOLD.
032900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
033000      MOVE PASS-COUNTER TO CCVS-E-4-1.
033100      MOVE ERROR-HOLD TO CCVS-E-4-2.
033200      MOVE CCVS-E-4 TO CCVS-E-2-2.
033300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033400  END-ROUTINE-12.
033500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033600     IF       ERROR-COUNTER IS EQUAL TO ZERO
033700         MOVE "NO " TO ERROR-TOTAL
033800         ELSE
033900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
034000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
034100     PERFORM WRITE-LINE.
034200 END-ROUTINE-13.
034300     IF DELETE-COUNTER IS EQUAL TO ZERO
034400         MOVE "NO " TO ERROR-TOTAL  ELSE
034500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034800      IF   INSPECT-COUNTER EQUAL TO ZERO
034900          MOVE "NO " TO ERROR-TOTAL
035000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
035100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
035200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035400 WRITE-LINE.
035500     ADD 1 TO RECORD-COUNT.
035600Y    IF RECORD-COUNT GREATER 50
035700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035800Y        MOVE SPACE TO DUMMY-RECORD
035900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
036000Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
036100Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
036200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
036300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036400Y        MOVE ZERO TO RECORD-COUNT.
036500     PERFORM WRT-LN.
036600 WRT-LN.
036700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036800     MOVE SPACE TO DUMMY-RECORD.
036900 BLANK-LINE-PRINT.
037000     PERFORM WRT-LN.
037100 FAIL-ROUTINE.
037200     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037700     MOVE   SPACES TO INF-ANSI-REFERENCE.
037800     GO TO  FAIL-ROUTINE-EX.
037900 FAIL-ROUTINE-WRITE.
038000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
038100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
038200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038300     MOVE   SPACES TO COR-ANSI-REFERENCE.
038400 FAIL-ROUTINE-EX. EXIT.
038500 BAIL-OUT.
038600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038800 BAIL-OUT-WRITE.
038900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
039000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
039100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039200     MOVE   SPACES TO INF-ANSI-REFERENCE.
039300 BAIL-OUT-EX. EXIT.
039400 CCVS1-EXIT.
039500     EXIT.
039600 SECT-NC209A-001 SECTION.
039700 NC-209A-001.
039800 MOV-INIT-F2-1.
039900     MOVE     "MOV-TEST-F2-1" TO PAR-NAME.
040000     MOVE     "VI-102 6.18.4 GR1" TO ANSI-REFERENCE.
040100     MOVE     "MOVE CORRESPONDING -" TO FEATURE.
040200     PERFORM  PRINT-DETAIL.
040300     MOVE     "  DIFFERENT LEVELS  " TO FEATURE.
040400     MOVE     CORRESPONDING B-LEVEL OF A-LEVEL TO B-GROUP.
040500     MOVE     1 TO REC-CT.
040600*    TOM DICK AND JOE SHOULD BE MOVED.
040700*
040800 MOV-TEST-F2-1-1.
040900     IF       TOM       OF A-GROUP          EQUAL TO "TOM"
041000              PERFORM PASS
041100              GO TO MOV-WRITE-F2-1-1.
041200     GO TO MOV-FAIL-F2-1-1.
041300 MOV-DELETE-F2-1-1.
041400     PERFORM  DE-LETE.
041500     GO TO MOV-WRITE-F2-1-1.
041600 MOV-FAIL-F2-1-1.
041700     PERFORM  FAIL.
041800     MOVE     TOM     OF A-GROUP      TO COMPUTED-A.
041900     MOVE     "TOM"   TO CORRECT-A.
042000 MOV-WRITE-F2-1-1.
042100     PERFORM  PRINT-DETAIL.
042200*
042300 MOV-TEST-F2-1-2.
042400     ADD      1 TO REC-CT.
042500     IF       DICK      OF A-GROUP          EQUAL TO "DICK"
042600              PERFORM PASS
042700              GO TO MOV-WRITE-F2-1-2.
042800     GO       TO MOV-FAIL-F2-1-2.
042900 MOV-DELETE-F2-1-2.
043000     PERFORM  DE-LETE.
043100     GO       TO MOV-WRITE-F2-1-2.
043200 MOV-FAIL-F2-1-2.
043300     PERFORM  FAIL.
043400     MOVE     DICK    OF A-GROUP      TO COMPUTED-A.
043500     MOVE     "DICK"  TO CORRECT-A.
043600 MOV-WRITE-F2-1-2.
043700     PERFORM  PRINT-DETAIL.
043800*
043900 MOV-TEST-F2-1-3.
044000     ADD      1 TO REC-CT.
044100     IF       HARRY     OF A-GROUP          EQUAL TO "ZZZZZ"
044200              PERFORM PASS
044300              GO TO MOV-WRITE-F2-1-3.
044400     GO       TO MOV-FAIL-F2-1-3.
044500 MOV-DELETE-F2-1-3.
044600     PERFORM  DE-LETE.
044700     GO       TO MOV-WRITE-F2-1-3.
044800 MOV-FAIL-F2-1-3.
044900     PERFORM  FAIL.
045000     MOVE     HARRY   OF A-GROUP      TO COMPUTED-A.
045100     MOVE     "ZZZZZ" TO CORRECT-A.
045200 MOV-WRITE-F2-1-3.
045300     PERFORM  PRINT-DETAIL.
045400*
045500 MOV-TEST-F2-1-4.
045600     ADD 1 TO REC-CT.
045700     IF       JOE       OF A-GROUP          EQUAL TO "JOE"
045800              PERFORM PASS
045900              GO TO MOV-WRITE-F2-1-4.
046000     GO       TO MOV-FAIL-F2-1-4.
046100 MOV-DELETE-F2-1-4.
046200     PERFORM  DE-LETE.
046300     GO       TO MOV-WRITE-F2-1-4.
046400 MOV-FAIL-F2-1-4.
046500     PERFORM  FAIL.
046600     MOVE     JOE     OF A-GROUP      TO COMPUTED-A.
046700     MOVE     "JOE"   TO CORRECT-A.
046800 MOV-WRITE-F2-1-4.
046900     PERFORM  PRINT-DETAIL.
047000*
047100 MOV-INIT-F2-2.
047200     MOVE     "MOV-TEST-F2-2" TO PAR-NAME.
047300     MOVE     "VI-102 6.18.4 GR1" TO ANSI-REFERENCE.
047400     MOVE     CORRESPONDING A-LEVEL TO A-BUNCH.
047500     MOVE     1 TO REC-CT.
047600*        NOTE AL SHOULD BE MOVED.
047700 MOV-TEST-F2-2-1.
047800     IF       TOM       OF A-BUNCH          EQUAL TO "YYY"
047900              PERFORM PASS
048000              GO TO MOV-WRITE-F2-2-1.
048100     GO       TO MOV-FAIL-F2-2-1.
048200 MOV-DELETE-F2-2-1.
048300     PERFORM  DE-LETE.
048400     GO       TO MOV-WRITE-F2-2-1.
048500 MOV-FAIL-F2-2-1.
048600     PERFORM  FAIL.
048700     MOVE     TOM     OF A-BUNCH      TO COMPUTED-A.
048800     MOVE     "YYY"   TO CORRECT-A.
048900 MOV-WRITE-F2-2-1.
049000     PERFORM  PRINT-DETAIL.
049100*
049200 MOV-TEST-F2-2-2.
049300     ADD 1 TO REC-CT.
049400     IF       DICK      OF A-BUNCH          EQUAL TO "YYYY"
049500              PERFORM PASS
049600              GO TO MOV-WRITE-F2-2-2.
049700     GO       TO MOV-FAIL-F2-2-2.
049800 MOV-DELETE-F2-2-2.
049900     PERFORM  DE-LETE.
050000     GO       TO MOV-WRITE-F2-2-2.
050100 MOV-FAIL-F2-2-2.
050200     PERFORM  FAIL.
050300     MOVE     DICK    OF A-BUNCH      TO COMPUTED-A.
050400     MOVE     "YYYY"  TO CORRECT-A.
050500 MOV-WRITE-F2-2-2.
050600     PERFORM  PRINT-DETAIL.
050700*
050800 MOV-TEST-F2-2-3.
050900     ADD 1 TO REC-CT.
051000     IF       HARRY     OF A-BUNCH          EQUAL TO "YYYYY"
051100              PERFORM PASS
051200              GO TO MOV-WRITE-F2-2-3.
051300     GO       TO MOV-FAIL-F2-2-3.
051400 MOV-DELETE-F2-2-3.
051500     PERFORM  DE-LETE.
051600     GO       TO MOV-WRITE-F2-2-3.
051700 MOV-FAIL-F2-2-3.
051800     PERFORM  FAIL.
051900     MOVE     HARRY   OF A-BUNCH      TO COMPUTED-A.
052000     MOVE     "YYYYY" TO CORRECT-A.
052100 MOV-WRITE-F2-2-3.
052200     PERFORM  PRINT-DETAIL.
052300*
052400 MOV-TEST-F2-2-4.
052500     ADD 1 TO REC-CT.
052600     IF       JOE       OF A-BUNCH          EQUAL TO "YYY"
052700              PERFORM PASS
052800              GO TO MOV-WRITE-F2-2-4.
052900     GO       TO MOV-FAIL-F2-2-4.
053000 MOV-DELETE-F2-2-4.
053100     PERFORM  DE-LETE.
053200     GO       TO MOV-WRITE-F2-2-4.
053300 MOV-FAIL-F2-2-4.
053400     PERFORM  FAIL.
053500     MOVE     JOE     OF A-BUNCH      TO COMPUTED-A.
053600     MOVE     "YYY"   TO CORRECT-A.
053700 MOV-WRITE-F2-2-4.
053800     PERFORM  PRINT-DETAIL.
053900*
054000 MOV-TEST-F2-2-5.
054100     ADD 1 TO REC-CT.
054200     IF       AL        OF A-BUNCH          EQUAL TO "AL"
054300              PERFORM PASS
054400              GO TO MOV-WRITE-F2-2-5.
054500     GO       TO MOV-FAIL-F2-2-5.
054600 MOV-DELETE-F2-2-5.
054700     PERFORM  DE-LETE.
054800     GO       TO MOV-WRITE-F2-2-5.
054900 MOV-FAIL-F2-2-5.
055000     PERFORM  FAIL.
055100     MOVE     AL      OF A-BUNCH      TO COMPUTED-A.
055200     MOVE     "AL"    TO CORRECT-A.
055300 MOV-WRITE-F2-2-5.
055400     PERFORM  PRINT-DETAIL.
055500*
055600 MOV-TEST-F2-2-6.
055700     ADD 1 TO REC-CT.
055800     IF       BOB       OF A-BUNCH          EQUAL TO "YYY"
055900              PERFORM PASS
056000              GO TO MOV-WRITE-F2-2-6.
056100     GO       TO MOV-FAIL-F2-2-6.
056200 MOV-DELETE-F2-2-6.
056300     PERFORM  DE-LETE.
056400     GO       TO MOV-WRITE-F2-2-6.
056500 MOV-FAIL-F2-2-6.
056600     PERFORM  FAIL.
056700     MOVE     BOB     OF A-BUNCH      TO COMPUTED-A.
056800     MOVE     "YYY"   TO CORRECT-A.
056900 MOV-WRITE-F2-2-6.
057000     PERFORM  PRINT-DETAIL.
057100*
057200 MOV-INIT-F2-3.
057300     MOVE     "MOV-TEST-F2-3" TO PAR-NAME.
057400     MOVE     "VI-102 6.18.4 GR1" TO ANSI-REFERENCE.
057500     MOVE     CORR B-LEVEL OF A-LEVEL TO B-SET.
057600     MOVE     1 TO REC-CT.
057700*        NOTE CORR IS A LEGAL ABBREVIATION.
057800*        NOTE NO MOVES SHOULD TAKE PLACE.
057900*
058000 MOV-TEST-F2-3-1.
058100     ADD 1 TO REC-CT.
058200     IF       TOM       OF A-SET            EQUAL TO "WWW"
058300              PERFORM PASS
058400              GO TO MOV-WRITE-F2-3-1.
058500     GO       TO MOV-FAIL-F2-3-1.
058600 MOV-DELETE-F2-3-1.
058700     PERFORM  DE-LETE.
058800     GO       TO MOV-WRITE-F2-3-1.
058900 MOV-FAIL-F2-3-1.
059000     PERFORM  FAIL.
059100     MOVE     TOM     OF A-SET        TO COMPUTED-A.
059200     MOVE     "WWW"   TO CORRECT-A.
059300 MOV-WRITE-F2-3-1.
059400     PERFORM  PRINT-DETAIL.
059500*
059600 MOV-TEST-F2-3-2.
059700     ADD 1 TO REC-CT.
059800     IF       DICK      OF A-SET            EQUAL TO "WWWW"
059900              PERFORM PASS
060000              GO TO MOV-WRITE-F2-3-2.
060100     GO       TO MOV-FAIL-F2-3-2.
060200 MOV-DELETE-F2-3-2.
060300     PERFORM  DE-LETE.
060400     GO       TO MOV-WRITE-F2-3-2.
060500 MOV-FAIL-F2-3-2.
060600     PERFORM  FAIL.
060700     MOVE     DICK    OF A-SET        TO COMPUTED-A.
060800     MOVE     "WWWW"  TO CORRECT-A.
060900 MOV-WRITE-F2-3-2.
061000     PERFORM  PRINT-DETAIL.
061100*
061200 MOV-TEST-F2-3-3.
061300     ADD 1 TO REC-CT.
061400     IF       HARRY     OF A-SET            EQUAL TO "WWWWW"
061500              PERFORM PASS
061600              GO TO MOV-WRITE-F2-3-3.
061700     GO       TO MOV-FAIL-F2-3-3.
061800 MOV-DELETE-F2-3-3.
061900     PERFORM  DE-LETE.
062000     GO       TO MOV-WRITE-F2-3-3.
062100 MOV-FAIL-F2-3-3.
062200     PERFORM  FAIL.
062300     MOVE     HARRY   OF A-SET        TO COMPUTED-A.
062400     MOVE     "WWWWW" TO CORRECT-A.
062500 MOV-WRITE-F2-3-3.
062600     PERFORM  PRINT-DETAIL.
062700*
062800 MOV-TEST-F2-3-4.
062900     ADD 1 TO REC-CT.
063000     IF       BOB       OF A-SET            EQUAL TO "WWW"
063100              PERFORM PASS
063200              GO TO MOV-WRITE-F2-3-4.
063300     GO       TO MOV-FAIL-F2-3-4.
063400 MOV-DELETE-F2-3-4.
063500     PERFORM  DE-LETE.
063600     GO       TO MOV-WRITE-F2-3-4.
063700 MOV-FAIL-F2-3-4.
063800     PERFORM  FAIL.
063900     MOVE     BOB     OF A-SET        TO COMPUTED-A.
064000     MOVE     "WWW"   TO CORRECT-A.
064100 MOV-WRITE-F2-3-4.
064200     PERFORM  PRINT-DETAIL.
064300*
064400 MOV-INIT-F2-4.
064500     MOVE     "MOV-TEST-F2-4" TO PAR-NAME.
064600     MOVE     "VI-102 6.18.4 GR1" TO ANSI-REFERENCE.
064700     MOVE     CORRESPONDING C-LEVEL OF A-LEVEL TO C-STACK.
064800     MOVE     1 TO REC-CT.
064900*        NOTE TOM AND HARRY SHOULD BE MOVED.
065000 MOV-TEST-F2-4-1.
065100     IF       TOM       OF C-STACK          EQUAL TO "TOM"
065200              PERFORM PASS
065300              GO TO MOV-WRITE-F2-4-1.
065400     GO       TO MOV-FAIL-F2-4-1.
065500 MOV-DELETE-F2-4-1.
065600     PERFORM  DE-LETE.
065700     GO       TO MOV-WRITE-F2-4-1.
065800 MOV-FAIL-F2-4-1.
065900     PERFORM  FAIL.
066000     MOVE     TOM     OF C-STACK      TO COMPUTED-A.
066100     MOVE     "TOM"   TO CORRECT-A.
066200 MOV-WRITE-F2-4-1.
066300     PERFORM  PRINT-DETAIL.
066400*
066500 MOV-TEST-F2-4-2.
066600     ADD 1 TO REC-CT.
066700     IF       DICK      OF C-STACK          EQUAL TO "VVVV"
066800              PERFORM PASS
066900              GO TO MOV-WRITE-F2-4-2.
067000     GO       TO MOV-FAIL-F2-4-2.
067100 MOV-DELETE-F2-4-2.
067200     PERFORM  DE-LETE.
067300     GO       TO MOV-WRITE-F2-4-2.
067400 MOV-FAIL-F2-4-2.
067500     PERFORM  FAIL.
067600     MOVE     DICK    OF C-STACK      TO COMPUTED-A.
067700     MOVE     "VVVV"  TO CORRECT-A.
067800 MOV-WRITE-F2-4-2.
067900     PERFORM  PRINT-DETAIL.
068000*
068100 MOV-TEST-F2-4-3.
068200     ADD 1 TO REC-CT.
068300     IF       HARRY     OF C-STACK          EQUAL TO "HARRY"
068400              PERFORM PASS
068500              GO TO MOV-WRITE-F2-4-3.
068600     GO       TO MOV-FAIL-F2-4-3.
068700 MOV-DELETE-F2-4-3.
068800     PERFORM  DE-LETE.
068900     GO       TO MOV-WRITE-F2-4-3.
069000 MOV-FAIL-F2-4-3.
069100     PERFORM  FAIL.
069200     MOVE     HARRY   OF C-STACK      TO COMPUTED-A.
069300     MOVE     "HARRY" TO CORRECT-A.
069400 MOV-WRITE-F2-4-3.
069500     PERFORM  PRINT-DETAIL.
069600*
069700 MOV-INIT-F2-5.
069800     MOVE     "MOV-TEST-F2-5" TO PAR-NAME.
069900     MOVE     "VI-102 6.18.4 GR1" TO ANSI-REFERENCE.
070000     MOVE     "  WITH RENAMES      " TO FEATURE.
070100     MOVE     CORRESPONDING A-LEVEL TO A-GLOB.
070200     MOVE     1 TO REC-CT.
070300*        NOTE TOM, DICK, JOE, AND AL SHOULD BE MOVED.
070400*
070500 MOV-TEST-F2-5-1.
070600     IF       TOM       OF A-GLOB           EQUAL TO "TOM"
070700              PERFORM PASS
070800              GO TO MOV-WRITE-F2-5-1.
070900     GO       TO MOV-FAIL-F2-5-1.
071000 MOV-DELETE-F2-5-1.
071100     PERFORM  DE-LETE.
071200     GO       TO MOV-WRITE-F2-5-1.
071300 MOV-FAIL-F2-5-1.
071400     PERFORM  FAIL.
071500     MOVE     TOM     OF A-GLOB       TO COMPUTED-A.
071600     MOVE     "TOM"   TO CORRECT-A.
071700 MOV-WRITE-F2-5-1.
071800     PERFORM  PRINT-DETAIL.
071900*
072000 MOV-TEST-F2-5-2.
072100     ADD 1 TO REC-CT.
072200     IF       DICK      OF A-GLOB           EQUAL TO "DICK"
072300              PERFORM PASS
072400              GO TO MOV-WRITE-F2-5-2.
072500     GO       TO MOV-FAIL-F2-5-2.
072600 MOV-DELETE-F2-5-2.
072700     PERFORM  DE-LETE.
072800     GO       TO MOV-WRITE-F2-5-2.
072900 MOV-FAIL-F2-5-2.
073000     PERFORM  FAIL.
073100     MOVE     DICK    OF A-GLOB       TO COMPUTED-A.
073200     MOVE     "DICK"  TO CORRECT-A.
073300 MOV-WRITE-F2-5-2.
073400     PERFORM  PRINT-DETAIL.
073500*
073600 MOV-TEST-F2-5-3.
073700     ADD 1 TO REC-CT.
073800     IF       HARRY     OF A-GLOB           EQUAL TO "UUUUU"
073900              PERFORM PASS
074000              GO TO MOV-WRITE-F2-5-3.
074100     GO       TO MOV-FAIL-F2-5-3.
074200 MOV-DELETE-F2-5-3.
074300     PERFORM  DE-LETE.
074400     GO       TO MOV-WRITE-F2-5-3.
074500 MOV-FAIL-F2-5-3.
074600     PERFORM  FAIL.
074700     MOVE     HARRY   OF A-GLOB       TO COMPUTED-A.
074800     MOVE     "UUUUU" TO CORRECT-A.
074900 MOV-WRITE-F2-5-3.
075000     PERFORM  PRINT-DETAIL.
075100*
075200 MOV-TEST-F2-5-4.
075300     ADD 1 TO REC-CT.
075400     IF       JOE       OF A-GLOB           EQUAL TO "JOE"
075500              PERFORM PASS
075600              GO TO MOV-WRITE-F2-5-4.
075700     GO       TO MOV-FAIL-F2-5-4.
075800 MOV-DELETE-F2-5-4.
075900     PERFORM  DE-LETE.
076000     GO       TO MOV-WRITE-F2-5-4.
076100 MOV-FAIL-F2-5-4.
076200     PERFORM  FAIL.
076300     MOVE     JOE     OF A-GLOB       TO COMPUTED-A.
076400     MOVE     "JOE"   TO CORRECT-A.
076500 MOV-WRITE-F2-5-4.
076600     PERFORM  PRINT-DETAIL.
076700*
076800 MOV-TEST-F2-5-5.
076900     ADD 1 TO REC-CT.
077000     IF       AL        OF A-GLOB           EQUAL TO "AL"
077100              PERFORM PASS
077200              GO TO MOV-WRITE-F2-5-5.
077300     GO       TO MOV-FAIL-F2-5-5.
077400 MOV-DELETE-F2-5-5.
077500     PERFORM  DE-LETE.
077600     GO       TO MOV-WRITE-F2-5-5.
077700 MOV-FAIL-F2-5-5.
077800     PERFORM  FAIL.
077900     MOVE     AL      OF A-GLOB       TO COMPUTED-A.
078000     MOVE     "AL"    TO CORRECT-A.
078100 MOV-WRITE-F2-5-5.
078200     PERFORM  PRINT-DETAIL.
078300*
078400 MOV-TEST-F2-5-6.
078500     ADD 1 TO REC-CT.
078600     IF       BOB       OF A-GLOB           EQUAL TO "UUU"
078700              PERFORM PASS
078800              GO TO MOV-WRITE-F2-5-6.
078900     GO       TO MOV-FAIL-F2-5-6.
079000 MOV-DELETE-F2-5-6.
079100     PERFORM  DE-LETE.
079200     GO       TO MOV-WRITE-F2-5-6.
079300 MOV-FAIL-F2-5-6.
079400     PERFORM  FAIL.
079500     MOVE     BOB     OF A-GLOB       TO COMPUTED-A.
079600     MOVE     "UUU"   TO CORRECT-A.
079700 MOV-WRITE-F2-5-6.
079800     PERFORM  PRINT-DETAIL.
079900*
080000 MOV-INIT-F2-6.
080100     MOVE     "MOV-TEST-F2-6" TO PAR-NAME.
080200     MOVE     "VI-102 6.18.4 GR1" TO ANSI-REFERENCE.
080300     MOVE     "  WITH REDEF, OCCURS" TO FEATURE.
080400     MOVE     D-LEVEL IN C-COLLECTION TO WORK-AREA.
080500     MOVE     "TTTTTTTTTTTTTTT" TO C-COLLECTION
080600     MOVE     1 TO REC-CT.
080700     MOVE     CORRESPONDING C-LEVEL IN A-LEVEL TO C-COLLECTION.
080800*        NOTE DICK AND JOE SHOULD BE MOVED.
080900*
081000 MOV-TEST-F2-6-1.
081100     MOVE     D-LEVEL IN C-COLLECTION TO WORK-AREA.
081200     IF       WORK-TOM EQUAL TO "TTT"
081300              PERFORM PASS
081400              GO TO MOV-WRITE-F2-6-1.
081500     GO       TO MOV-FAIL-F2-6-1.
081600 MOV-DELETE-F2-6-1.
081700     PERFORM  DE-LETE.
081800     GO       TO MOV-WRITE-F2-6-1.
081900 MOV-FAIL-F2-6-1.
082000     PERFORM  FAIL.
082100     MOVE     D-LEVEL OF A-COLLECTION TO COMPUTED-A.
082200     MOVE     "TTT"   TO CORRECT-A.
082300 MOV-WRITE-F2-6-1.
082400     PERFORM  PRINT-DETAIL.
082500*
082600 MOV-TEST-F2-6-2.
082700     ADD 1 TO REC-CT.
082800     IF       DICK OF A-COLLECTION EQUAL TO "DICK"
082900              PERFORM PASS
083000              GO TO MOV-WRITE-F2-6-2.
083100     GO       TO MOV-FAIL-F2-6-2.
083200 MOV-DELETE-F2-6-2.
083300     PERFORM  DE-LETE.
083400     GO       TO MOV-WRITE-F2-6-2.
083500 MOV-FAIL-F2-6-2.
083600     PERFORM  FAIL.
083700     MOVE     DICK    OF A-COLLECTION TO COMPUTED-A.
083800     MOVE     "DICK"  TO CORRECT-A.
083900 MOV-WRITE-F2-6-2.
084000     PERFORM  PRINT-DETAIL.
084100*
084200 MOV-TEST-F2-6-3.
084300     ADD 1 TO REC-CT.
084400     IF       HARRY OF A-COLLECTION EQUAL TO "TTTTT"
084500              PERFORM PASS
084600              GO TO MOV-WRITE-F2-6-3.
084700     GO       TO MOV-FAIL-F2-6-3.
084800 MOV-DELETE-F2-6-3.
084900     PERFORM  DE-LETE.
085000     GO       TO MOV-WRITE-F2-6-3.
085100 MOV-FAIL-F2-6-3.
085200     PERFORM  FAIL.
085300     MOVE     HARRY   OF A-COLLECTION TO COMPUTED-A.
085400     MOVE     "TTTTT" TO CORRECT-A.
085500 MOV-WRITE-F2-6-3.
085600     PERFORM  PRINT-DETAIL.
085700*
085800 MOV-TEST-F2-6-4.
085900     ADD 1 TO REC-CT.
086000     IF       JOE       OF A-COLLECTION     EQUAL TO "JOE"
086100              PERFORM PASS
086200              GO TO MOV-WRITE-F2-6-4.
086300     GO       TO MOV-FAIL-F2-6-4.
086400 MOV-DELETE-F2-6-4.
086500     PERFORM  DE-LETE.
086600     GO       TO MOV-WRITE-F2-6-4.
086700 MOV-FAIL-F2-6-4.
086800     PERFORM  FAIL.
086900     MOVE     JOE     OF A-COLLECTION TO COMPUTED-A.
087000     MOVE     "JOE"   TO CORRECT-A.
087100 MOV-WRITE-F2-6-4.
087200     PERFORM  PRINT-DETAIL.
087300*
087400 MOV-INIT-F2-7.
087500     MOVE     "MOV-TEST-F2-7" TO PAR-NAME.
087600     MOVE     "VI-102 6.18.4 GR1" TO ANSI-REFERENCE.
087700     MOVE     CORRESPONDING C-LEVEL IN A-LEVEL TO C-FLOCK (4).
087800     MOVE     1 TO REC-CT.
087900*        NOTE TOM, DICK, HARRY, AND JOE SHOULD BE MOVED.
088000 MOV-TEST-F2-7-1.
088100     IF       TOMMY     OF A-COVEY          EQUAL TO "TOM"
088200              PERFORM PASS
088300              GO TO MOV-WRITE-F2-7-1.
088400     GO       TO MOV-FAIL-F2-7-1.
088500 MOV-DELETE-F2-7-1.
088600     PERFORM  DE-LETE.
088700     GO       TO MOV-WRITE-F2-7-1.
088800 MOV-FAIL-F2-7-1.
088900     PERFORM  FAIL.
089000     MOVE     TOMMY   OF A-COVEY      TO COMPUTED-A.
089100     MOVE     "TOM"   TO CORRECT-A.
089200 MOV-WRITE-F2-7-1.
089300     PERFORM  PRINT-DETAIL.
089400*
089500 MOV-TEST-F2-7-2.
089600     ADD 1 TO REC-CT.
089700     IF       DICKY     OF A-COVEY          EQUAL TO "DICK"
089800              PERFORM PASS
089900              GO TO MOV-WRITE-F2-7-2.
090000     GO       TO MOV-FAIL-F2-7-2.
090100 MOV-DELETE-F2-7-2.
090200     PERFORM  DE-LETE.
090300     GO       TO MOV-WRITE-F2-7-2.
090400 MOV-FAIL-F2-7-2.
090500     PERFORM  FAIL.
090600     MOVE     DICKY   OF A-COVEY      TO COMPUTED-A.
090700     MOVE     "DICK"  TO CORRECT-A.
090800 MOV-WRITE-F2-7-2.
090900     PERFORM  PRINT-DETAIL.
091000*
091100 MOV-TEST-F2-7-3.
091200     ADD 1 TO REC-CT.
091300     IF       JOEY      OF A-COVEY          EQUAL TO "JOE"
091400              PERFORM PASS
091500              GO TO MOV-WRITE-F2-7-3.
091600     GO       TO MOV-FAIL-F2-7-3.
091700 MOV-DELETE-F2-7-3.
091800     PERFORM  DE-LETE.
091900     GO       TO MOV-WRITE-F2-7-3.
092000 MOV-FAIL-F2-7-3.
092100     PERFORM  FAIL.
092200     MOVE     JOEY    OF A-COVEY      TO COMPUTED-A.
092300     MOVE     "JOE"   TO CORRECT-A.
092400 MOV-WRITE-F2-7-3.
092500     PERFORM  PRINT-DETAIL.
092600*
092700 MOV-TEST-F2-7-4.
092800     ADD 1 TO REC-CT.
092900     IF       HAROLD    OF A-COVEY          EQUAL TO "HARRY"
093000              PERFORM PASS
093100              GO TO MOV-WRITE-F2-7-4.
093200     GO       TO MOV-FAIL-F2-7-4.
093300 MOV-DELETE-F2-7-4.
093400     PERFORM  DE-LETE.
093500     GO       TO MOV-WRITE-F2-7-4.
093600 MOV-FAIL-F2-7-4.
093700     PERFORM  FAIL.
093800     MOVE     HAROLD  OF A-COVEY      TO COMPUTED-A.
093900     MOVE     "HARRY" TO CORRECT-A.
094000 MOV-WRITE-F2-7-4.
094100     PERFORM  PRINT-DETAIL.
094200*
094300 MOV-INIT-F2-8.
094400     MOVE     "MOV-TEST-F2-8" TO PAR-NAME.
094500     MOVE     CORRESPONDING BB-LEVEL TO BB-MOB (1).
094600     MOVE     "VI-102 6.18.4 GR1" TO ANSI-REFERENCE.
094700     MOVE     0 TO REC-CT.
094800*        NOTE BOB SHOULD BE MOVED.
094900 MOV-TEST-F2-8.
095000     IF       BOBBY     OF A-CROWD          EQUAL TO "BOB"
095100              PERFORM PASS
095200              GO TO MOV-WRITE-F2-8.
095300     GO       TO MOV-FAIL-F2-8.
095400 MOV-DELETE-F2-8.
095500     PERFORM  DE-LETE.
095600     GO       TO MOV-WRITE-F2-8.
095700 MOV-FAIL-F2-8.
095800     PERFORM  FAIL.
095900     MOVE     BOBBY   OF A-CROWD      TO COMPUTED-A.
096000     MOVE     "BOB"   TO CORRECT-A.
096100 MOV-WRITE-F2-8.
096200     PERFORM  PRINT-DETAIL.
096300*
096400 CCVS-EXIT SECTION.
096500 CCVS-999999.
096600     GO TO CLOSE-FILES.
