000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC201A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*    PROGRAM NC201A TESTS FORMAT 3 AND 4 OF THE "PERFORM"
002200*    STATEMENT.
002300*    A VARIETY OF QUALIFIED DATA-NAMES AND CONDITION-NAMES
002400*    ARE USED.
002500*
002600*
002700
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 01  WRK-DU-2V1-1 PIC 99V9 VALUE ZERO.
004500 01  WRK-DU-0V1-1 PIC V9 VALUE .1.
004600 01  WRK-DU-2V1-2 PIC 99V9 VALUE 0.1.
004700 01  WRK-DU-2V1-3  PIC 99V9  VALUE  11.1.
004800 01  WRK-DU-1V0-1 PIC 9 VALUE 1.
004900 01  WRK-DU-1V0-2 PIC 9 VALUE 2.
005000 01  WRK-DU-1V0-3 PIC 9 VALUE 3.
005100 01  WRK-DU-1V0-4 PIC 9 VALUE ZERO.
005200 01  WRK-DU-2V0-1 PIC 99 VALUE 10.
005300 01  WRK-DU-2V0-2 PIC 99 VALUE 11.
005400 01  WRK-DU-2V0-3 PIC 99 VALUE 12.
005500 01  COUNT-DU-6V0  PIC 9(6).
005600 77  SMALL-VALU   PICTURE 99 VALUE 7.
005700 77  SMALLER-VALU PICTURE 99 VALUE 6.
005800 77  SMALLEST-VALU   PICTURE 99 VALUE 5.
005900 77  EVEN-SMALLER PICTURE 99 VALUE 1.
006000 77  WRK-DS-02V00                 PICTURE S99.
006100     88 TEST-2NUC-COND-99         VALUE 99.
006200 77  WRK-DS-06V06     PICTURE S9(6)V9(6).
006300 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06
006400                                  PICTURE S9(12).
006500 77  A02TWOS-DS-02V00             PICTURE S99    VALUE 22.
006600 77  WRK-DS-01V00                 PICTURE S9.
006700 77  A02TWOS-DS-03V02             PICTURE S999V99 VALUE +022.00.
006800 77  A990-DS-0201P                PICTURE S99P   VALUE 990.
006900 77  A02ONES-DS-02V00             PICTURE S99    VALUE 11.
007000 77  A01ONE-DS-P0801              PICTURE SP(8)9 VALUE .000000001.
007100 77  ATWO-DS-01V00                PICTURE S9     VALUE 2.
007200 77  WRK-XN-00001                 PICTURE X.
007300 77  WRK-XN-00005                 PICTURE X(5).
007400 77  TWO  PICTURE 9 VALUE 2.
007500 77  THREE PICTURE 9 VALUE 3.
007600 77  SEVEN PICTURE 9 VALUE 7.
007700 77  NINE  PICTURE 9 VALUE 9.
007800 77  TEN  PICTURE 99 VALUE 10.
007900 77  ALTERCOUNT PICTURE 999 VALUE ZERO.
008000 77  XRAY PICTURE IS X.
008100 77  IF-D1 PICTURE S9(4)V9(2) VALUE 0.
008200 77  IF-D2 PICTURE S9(4)V9(2) VALUE ZERO.
008300 77  IF-D3 PICTURE X(10) VALUE "0000000000".
008400 77  IF-D4 PICTURE X(15) VALUE "               ".
008500 77  IF-D5 PICTURE X(10) VALUE ALL QUOTE.
008600 77  IF-D6 PICTURE A(10) VALUE "BABABABABA".
008700 77  IF-D7 PICTURE S9(6)V9(4) VALUE +123.45.
008800 77  IF-D8 PICTURE 9(6)V9(4) VALUE 12300.
008900 77  IF-D9 PICTURE X(3) VALUE "123".
009000 77  IF-D11 PICTURE X(6) VALUE "ABCDEF".
009100 77  IF-D13 PICTURE 9(6)V9(4) VALUE 12300.
009200 77  IF-D14 PICTURE S9(4)V9(2) VALUE +123.45.
009300 77  IF-D15 PICTURE S999PP VALUE 12300.
009400 77  IF-D16 PICTURE PP99 VALUE .0012.
009500 77  IF-D17 PICTURE SV9(4) VALUE .0012.
009600 77  IF-D18 PICTURE X(10) VALUE "BABABABABA".
009700 77  IF-D19 PICTURE X(10) VALUE "ABCDEF    ".
009800 77  IF-D23 PICTURE $9,9B9.90+.
009900 77  IF-D24 PICTURE X(10) VALUE "$1,2 3.40+".
010000 77  IF-D25 PICTURE ABABX0A.
010100 77  IF-D26 PICTURE X(8) VALUE "A C D0E".
010200 77  IF-D27 PICTURE IS 9(6)V9(4) VALUE IS 2137.45
010300     USAGE IS COMPUTATIONAL.
010400 77  IF-D28 PICTURE IS 999999V9999 VALUE IS 2137.45.
010500 77  IF-D31 PICTURE S9(6) VALUE -123.
010600 77  IF-D32 PICTURE S9(4)V99.
010700     88  A  VALUE 1.
010800     88  B VALUES ARE 2 THRU 4.
010900     88  C VALUE IS ZERO.
011000     88  D VALUE IS +12.34.
011100     88  E  VALUE IS .01, .11, .21 .81.
011200     88  F  VALUE IS 100 THRU 128 1000 THRU 1280 -9 THRU -2.
011300     88  G  VALUE IS 8765.43 1234 THRU 5678 5 -9999 THRU 10.
011400 77  IF-D33 PICTURE X(4).
011500     88  B   VALUE QUOTE.
011600     88  C   VALUE SPACE.
011700     88 D VALUE ALL "BAC".
011800 77  IF-D34 PICTURE A(4).
011900     88  B VALUE "A A ".
012000 77  IF-D37 PICTURE 9(5) VALUE 12345.
012100 77  IF-D38 PICTURE X(9) VALUE "12345    ".
012200 77  CCON-1 PICTURE 99 VALUE 11.
012300 77  CCON-2 PICTURE 99 VALUE 12.
012400 77  CCON-3 PICTURE 99 VALUE 13.
012500 77  COMP-SGN1  PICTURE S9(1) VALUE +9 COMPUTATIONAL.
012600 77  COMP-SGN2  PICTURE S9(18) VALUE +3 COMPUTATIONAL.
012700 77  COMP-SGN3  PICTURE S9(1) VALUE -5 COMPUTATIONAL.
012800 77  COMP-SGN4  PICTURE S9(18) VALUE -3167598765431 COMPUTATIONAL.
012900 77  START-POINT        PICTURE 9(6) COMPUTATIONAL.
013000 77  INC-VALUE          PICTURE 9(6) COMPUTATIONAL.
013100 77  SWITCH-PFM-1 PICTURE 9 VALUE ZERO.
013200 77  SWITCH-PFM-2 PICTURE 9 VALUE ZERO.
013300 77  PFM-11-COUNTER PICTURE 999 VALUE ZERO.
013400 77  PFM-12-COUNTER  PICTURE 999 VALUE 100.
013500 77  PFM-12-ANS1  PICTURE 999 VALUE ZERO.
013600 77  PFM-12-ANS2  PICTURE 999 VALUE ZERO.
013700 01  SUBSCRIPT-6 PICTURE 99999 VALUE ZERO.
013800 01  IF-TABLE.
013900     02 IF-ELEM PICTURE X OCCURS 12 TIMES.
014000 01  QUOTE-DATA.
014100     02 QU-1 PICTURE X(3) VALUE "123".
014200     02 QU-2 PICTURE X VALUE QUOTE.
014300     02 QU-3 PICTURE X(6) VALUE "ABC456".
014400 01  IF-D10.
014500     02  D1 PICTURE X(2) VALUE "01".
014600     02  D2 PICTURE X(2) VALUE "23".
014700     02  D3.
014800     03  D4 PICTURE X(4) VALUE "4567".
014900     03 D5 PICTURE X(4) VALUE "8912".
015000 01  IF-D12.
015100     02  D1 PICTURE X(3) VALUE "ABC".
015200     02  D2.
015300     03  D3.
015400     04  D4      PICTURE XX     VALUE "DE".
015500     04  D5 PICTURE X VALUE "F".
015600 01  IF-D20.
015700     02  FILLER    PICTURE 9(5)   VALUE ZERO.
015800     02  D1 PICTURE 9(2) VALUE 12.
015900     02  D2 PICTURE 9 VALUE 3.
016000     02  D3 PICTURE 9(2) VALUE 45.
016100 01  IF-D21.
016200     02  D1 PICTURE 9(5) VALUE ZEROS.
016300     02  D2 PICTURE 9(5) VALUE 12345.
016400 01  IF-D22.
016500     02  D1 PICTURE A(2) VALUE "AB".
016600     02  D2 PICTURE A(4) VALUE "CDEF".
016700 01  IF-D35.
016800     02  AA PICTURE X(2).
016900     88  A1 VALUE "AA".
017000     88  A2 VALUE "AB".
017100     02  BB PICTURE IS X(2).
017200     88  B1 VALUE "CC".
017300     88  B2 VALUE "CD".
017400     02 BB-2 REDEFINES BB.
017500     03  AAA PICTURE X.
017600     88  AA1 VALUE "A".
017700     88  AA2 VALUE "C".
017800     03  BBB PICTURE X.
017900     88  BB1    VALUE "B".
018000     88  BB2 VALUE "D".
018100 01  IF-D36  PICTURE X(120) VALUE IS    "ABCDEFGHIJKLMNOPQRSTUVWXY
018200-    "Z1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLM
018300-    "NOPQRSTUVWXYZ1234567890ABCDEFGHIJKL".
018400 01  IF-D40 PICTURE 9(5) VALUE 12345
018500              COMPUTATIONAL SYNCHRONIZED RIGHT.
018600     88 IF-D40A VALUE ZERO THRU 10000.
018700     88 IF-D40B VALUE 10001 THRU 99999.
018800     88 IF-D40C VALUE 99999.
018900 01  PERFORM1  PICTURE XXX  VALUE SPACES.
019000 01  PERFORM2  PICTURE S999 VALUE 20.
019100 01  PERFORM3  PICTURE  9  VALUE  5.
019200 01  PERFORM4  PICTURE S99V9.
019300 01  PERFORM5  PICTURE S99V9  VALUE 10.0.
019400 01  PERFORM6  PICTURE  99V9.
019500 01  PERFORM7.
019600     02  PERFORM8  OCCURS 7 TIMES  PICTURE  99V9.
019700 01  PERFORM9  PICTURE 9   VALUE 3.
019800 01  PERFORM10  PICTURE  S9  VALUE -1.
019900 01  PERFORM11  PICTURE  99  VALUE 6.
020000 01  PERFORM12.
020100     02 PERFORM13  OCCURS 4 TIMES.
020200         03 PERFORM14  OCCURS 20 TIMES  PICTURE  99V9.
020300         03 PERFORM15  OCCURS 10 TIMES.
020400             04 PERFORM16  OCCURS 5 TIMES  PICTURE 99V9.
020500 01  PERFORM17          PICTURE 9(6) COMPUTATIONAL.
020600 01  PERFORM18          PICTURE 9(6) COMPUTATIONAL.
020700 01  PERFORM-KEY  PICTURE 9.
020800 01  PERFORM-SEVEN-LEVEL-TABLE.
020900   03   PFM71                OCCURS 2.
021000     05  PFM72               OCCURS 2.
021100       07  PFM73             OCCURS 2.
021200         09  PFM74           OCCURS 2.
021300           11  PFM75         OCCURS 2.
021400             13  PFM76       OCCURS 2.
021500               15  PFM77     OCCURS 2.
021600                 17  PFM77-1 PIC X.
021700 01  S1                      PIC S9(5) COMP.
021800 01  S2                      PIC S9(5) COMP.
021900 01  S3                      PIC S9(5) COMP.
022000 01  S4                      PIC S9(5) COMP.
022100 01  S5                      PIC S9(5) COMP.
022200 01  S6                      PIC S9(5) COMP.
022300 01  S7                      PIC S9(5) COMP.
022400 01  PFM-7-TOT               PIC S9(5) COMP.
022500 01  PFM-F4-23-TOT           PIC S9(5) COMP.
022600 01  PFM-A1                  PIC S9(5) COMP.
022700 01  PFM-B1                  PIC S9(5) COMP.
022800 01  FILLER-A.
022900   03  PFM-F4-24-A           PIC S9(3) COMP OCCURS 10.
023000 01  FILLER-B.
023100   03  PFM-F4-24-B           PIC S9(3) COMP OCCURS 10.
023200 01  FILLER-C.
023300   03  PFM-F4-24-C           PIC S9(3) COMP OCCURS 10.
023400 01  RECEIVING-TABLE.
023500     03 TBL-ELEMEN-A.
023600         05 TBL-ELEMEN-B          PICTURE X(18).
023700         05 TBL-ELEMEN-C          PICTURE X(18).
023800     03  TBL-ELEMEN-D.
023900         05 TBL-ELEMEN-E          PICTURE X OCCURS 36 TIMES.
024000 01  LITERAL-SPLITTER.
024100     02 PART1                     PICTURE X(20).
024200     02 PART2                     PICTURE X(20).
024300     02 PART3                     PICTURE X(20).
024400     02 PART4                     PICTURE X(20).
024500 01  LITERAL-TABLE REDEFINES LITERAL-SPLITTER.
024600     02 80PARTS                   PICTURE X      OCCURS 80 TIMES.
024700 01  GRP-FOR-88-LEVELS.
024800     03 WRK-DS-02V00-COND         PICTURE 99.
024900         88 COND-1                VALUE IS 01 THRU 05.
025000         88 COND-2                VALUES ARE 06 THRU 10
025100                                           16 THRU 20  00.
025200         88 COND-3                VALUES 11 THRU 15.
025300 01  GRP-MOVE-CONSTANTS.
025400     03 GRP-GROUP-MOVE-FROM.
025500         04 GRP-ALPHABETIC.
025600             05 ALPHABET-AN-00026 PICTURE A(26)
025700                        VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
025800         04 GRP-NUMERIC.
025900             05 DIGITS-DV-10V00   PICTURE 9(10) VALUE 0123456789.
026000         05 DIGITS-DU-06V04-S REDEFINES DIGITS-DV-10V00
026100                                  PICTURE 9(6)V9999.
026200         04 GRP-ALPHANUMERIC.
026300             05 ALPHANUMERIC-XN-00049 PICTURE X(50)
026400     VALUE  "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-><=$,;.()/* 0123456789".
026500             05 FILLER                PICTURE X  VALUE QUOTE.
026600 01  GRP-FOR-2N058.
026700     02 SUB-GRP-FOR-2N058-A.
026800         03 ELEM-FOR-2N058-A PICTURE 999  VALUE ZEROES.
026900         03 ELEM-FOR-2N058-B PICTURE XXX  VALUE ZEROS.
027000         03 ELEM-FOR-2N058-C PICTURE XXX  VALUE SPACES.
027100         03 ELEM-FOR-2N058-D PICTURE X(6) VALUE ALL "ABC".
027200         03 ELEM-FOR-2N058-E PICTURE XXX  VALUE ALL "Z".
027300         03 ELEM-FOR-2N058-F PICTURE XXX  VALUE ALL SPACES.
027400         03 ELEM-FOR-2N058-G PICTURE XXX  VALUE ALL ZEROES.
027500         03 ELEM-FOR-2N058-H PICTURE 999  VALUE ALL ZEROS.
027600         03 ELEM-FOR-2N058-I PICTURE XXX  VALUE QUOTES.
027700         03 ELEM-FOR-2N058-J PICTURE XXX  VALUE ALL QUOTES.
027800         03 ELEM-FOR-2N058-K PICTURE XXX  VALUE ALL HIGH-VALUES.
027900         03 ELEM-FOR-2N058-L PICTURE XXX  VALUE ALL LOW-VALUES.
028000         03 ELEM-FOR-2N058-M PICTURE XXX  VALUE HIGH-VALUES.
028100         03 ELEM-FOR-2N058-N PICTURE XXX  VALUE LOW-VALUES.
028200     02 SUB-GRP-FOR-2N058-B.
028300         03 SUB-SUB-BA.
028400             04 ELEM-FOR-2N058-A  PICTURE 999.
028500             04 ELEM-FOR-2N058-B  PICTURE XXX.
028600             04 ELEM-FOR-2N058-C  PICTURE XXX.
028700             04 ELEM-FOR-2N058-D  PICTURE X(6).
028800         03 SUB-SUB-BB.
028900             04 ELEM-FOR-2N058-E  PICTURE XXX.
029000             04 ELEM-FOR-2N058-F  PICTURE XXX.
029100             04 ELEM-FOR-2N058-G  PICTURE XXX.
029200             04 ELEM-FOR-2N058-H  PICTURE 999.
029300         03 SUB-SUB-BC.
029400             04 ELEM-FOR-2N058-I  PICTURE XXX.
029500             04 ELEM-FOR-2N058-J  PICTURE XXX.
029600             04 ELEM-FOR-2N058-K  PICTURE XXX.
029700             04 ELEM-FOR-2N058-L  PICTURE XXX.
029800             04 ELEM-FOR-2N058-M  PICTURE XXX.
029900             04 ELEM-FOR-2N058-N  PICTURE XXX.
030000 01  CHARACTER-BREAKDOWN-S.
030100     02   FIRST-20S PICTURE X(20).
030200     02  SECOND-20S PICTURE X(20).
030300     02   THIRD-20S PICTURE X(20).
030400     02  FOURTH-20S PICTURE X(20).
030500     02   FIFTH-20S PICTURE X(20).
030600     02   SIXTH-20S PICTURE X(20).
030700     02 SEVENTH-20S PICTURE X(20).
030800     02  EIGHTH-20S PICTURE X(20).
030900     02   NINTH-20S PICTURE X(20).
031000     02   TENTH-20S PICTURE X(20).
031100 01  CHARACTER-BREAKDOWN-R.
031200     02   FIRST-20R PICTURE X(20).
031300     02  SECOND-20R PICTURE X(20).
031400     02   THIRD-20R PICTURE X(20).
031500     02  FOURTH-20R PICTURE X(20).
031600     02   FIFTH-20R PICTURE X(20).
031700     02   SIXTH-20R PICTURE X(20).
031800     02 SEVENTH-20R PICTURE X(20).
031900     02  EIGHTH-20R PICTURE X(20).
032000     02   NINTH-20R PICTURE X(20).
032100     02   TENTH-20R PICTURE X(20).
032200 01  TABLE-80.
032300     02  ELMT OCCURS 3 TIMES PIC 9.
032400     88  A80  VALUES ARE ZERO THRU 7.
032500     88  B80  VALUE 8.
032600     88  C80  VALUES ARE 7, 8 THROUGH 9.
032700
032800 01  TABLE-86.
032900     88  A86  VALUE "ABC".
033000     88  B86  VALUE "ABCABC".
033100     88  C86  VALUE "   ABC".
033200     02  DATANAME-86  PIC XXX  VALUE "ABC".
033300     02  DNAME-86.
033400         03  FILLER  PIC X  VALUE "A".
033500         03  FILLER  PIC X  VALUE "B".
033600         03  FILLER  PIC X   VALUE "C".
033700 01  FIGCON-DATA.
033800     02 SPACE-X         PICTURE X(10) VALUE "          ".
033900     02 QUOTE-X         PICTURE X(5)  VALUE QUOTE.
034000     02 LOW-VAL         PICTURE X(5)  VALUE LOW-VALUE.
034100     02 ABC PICTURE XXX VALUE "ABC".
034200     02 ONE23           PICTURE 9999  VALUE 123.
034300     02 ZERO-C          PICTURE 9(10) VALUE 0 COMPUTATIONAL.
034400     02 ZERO-D          PICTURE 9     VALUE ZERO USAGE DISPLAY.
034500 01  TEST-RESULTS.
034600     02 FILLER                   PIC X      VALUE SPACE.
034700     02 FEATURE                  PIC X(20)  VALUE SPACE.
034800     02 FILLER                   PIC X      VALUE SPACE.
034900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
035000     02 FILLER                   PIC X      VALUE SPACE.
035100     02  PAR-NAME.
035200       03 FILLER                 PIC X(19)  VALUE SPACE.
035300       03  PARDOT-X              PIC X      VALUE SPACE.
035400       03 DOTVALUE               PIC 99     VALUE ZERO.
035500     02 FILLER                   PIC X(8)   VALUE SPACE.
035600     02 RE-MARK                  PIC X(61).
035700 01  TEST-COMPUTED.
035800     02 FILLER                   PIC X(30)  VALUE SPACE.
035900     02 FILLER                   PIC X(17)  VALUE
036000            "       COMPUTED=".
036100     02 COMPUTED-X.
036200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
036300     03 COMPUTED-N               REDEFINES COMPUTED-A
036400                                 PIC -9(9).9(9).
036500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
036600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
036700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
036800     03       CM-18V0 REDEFINES COMPUTED-A.
036900         04 COMPUTED-18V0                    PIC -9(18).
037000         04 FILLER                           PIC X.
037100     03 FILLER PIC X(50) VALUE SPACE.
037200 01  TEST-CORRECT.
037300     02 FILLER PIC X(30) VALUE SPACE.
037400     02 FILLER PIC X(17) VALUE "       CORRECT =".
037500     02 CORRECT-X.
037600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
037700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
037800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
037900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
038000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
038100     03      CR-18V0 REDEFINES CORRECT-A.
038200         04 CORRECT-18V0                     PIC -9(18).
038300         04 FILLER                           PIC X.
038400     03 FILLER PIC X(2) VALUE SPACE.
038500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
038600 01  CCVS-C-1.
038700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
038800-    "SS  PARAGRAPH-NAME
038900-    "       REMARKS".
039000     02 FILLER                     PIC X(20)    VALUE SPACE.
039100 01  CCVS-C-2.
039200     02 FILLER                     PIC X        VALUE SPACE.
039300     02 FILLER                     PIC X(6)     VALUE "TESTED".
039400     02 FILLER                     PIC X(15)    VALUE SPACE.
039500     02 FILLER                     PIC X(4)     VALUE "FAIL".
039600     02 FILLER                     PIC X(94)    VALUE SPACE.
039700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
039800 01  REC-CT                        PIC 99       VALUE ZERO.
039900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
040000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
040100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
040200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
040300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
040400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
040500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
040600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
040700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
040800 01  CCVS-H-1.
040900     02  FILLER                    PIC X(39)    VALUE SPACES.
041000     02  FILLER                    PIC X(42)    VALUE
041100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
041200     02  FILLER                    PIC X(39)    VALUE SPACES.
041300 01  CCVS-H-2A.
041400   02  FILLER                        PIC X(40)  VALUE SPACE.
041500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
041600   02  FILLER                        PIC XXXX   VALUE
041700     "4.2 ".
041800   02  FILLER                        PIC X(28)  VALUE
041900            " COPY - NOT FOR DISTRIBUTION".
042000   02  FILLER                        PIC X(41)  VALUE SPACE.
042100
042200 01  CCVS-H-2B.
042300   02  FILLER                        PIC X(15)  VALUE
042400            "TEST RESULT OF ".
042500   02  TEST-ID                       PIC X(9).
042600   02  FILLER                        PIC X(4)   VALUE
042700            " IN ".
042800   02  FILLER                        PIC X(12)  VALUE
042900     " HIGH       ".
043000   02  FILLER                        PIC X(22)  VALUE
043100            " LEVEL VALIDATION FOR ".
043200   02  FILLER                        PIC X(58)  VALUE
043300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
043400 01  CCVS-H-3.
043500     02  FILLER                      PIC X(34)  VALUE
043600            " FOR OFFICIAL USE ONLY    ".
043700     02  FILLER                      PIC X(58)  VALUE
043800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
043900     02  FILLER                      PIC X(28)  VALUE
044000            "  COPYRIGHT   1985 ".
044100 01  CCVS-E-1.
044200     02 FILLER                       PIC X(52)  VALUE SPACE.
044300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
044400     02 ID-AGAIN                     PIC X(9).
044500     02 FILLER                       PIC X(45)  VALUE SPACES.
044600 01  CCVS-E-2.
044700     02  FILLER                      PIC X(31)  VALUE SPACE.
044800     02  FILLER                      PIC X(21)  VALUE SPACE.
044900     02 CCVS-E-2-2.
045000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
045100         03 FILLER                   PIC X      VALUE SPACE.
045200         03 ENDER-DESC               PIC X(44)  VALUE
045300            "ERRORS ENCOUNTERED".
045400 01  CCVS-E-3.
045500     02  FILLER                      PIC X(22)  VALUE
045600            " FOR OFFICIAL USE ONLY".
045700     02  FILLER                      PIC X(12)  VALUE SPACE.
045800     02  FILLER                      PIC X(58)  VALUE
045900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
046000     02  FILLER                      PIC X(13)  VALUE SPACE.
046100     02 FILLER                       PIC X(15)  VALUE
046200             " COPYRIGHT 1985".
046300 01  CCVS-E-4.
046400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
046500     02 FILLER                       PIC X(4)   VALUE " OF ".
046600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
046700     02 FILLER                       PIC X(40)  VALUE
046800      "  TESTS WERE EXECUTED SUCCESSFULLY".
046900 01  XXINFO.
047000     02 FILLER                       PIC X(19)  VALUE
047100            "*** INFORMATION ***".
047200     02 INFO-TEXT.
047300       04 FILLER                     PIC X(8)   VALUE SPACE.
047400       04 XXCOMPUTED                 PIC X(20).
047500       04 FILLER                     PIC X(5)   VALUE SPACE.
047600       04 XXCORRECT                  PIC X(20).
047700     02 INF-ANSI-REFERENCE           PIC X(48).
047800 01  HYPHEN-LINE.
047900     02 FILLER  PIC IS X VALUE IS SPACE.
048000     02 FILLER  PIC IS X(65)    VALUE IS "************************
048100-    "*****************************************".
048200     02 FILLER  PIC IS X(54)    VALUE IS "************************
048300-    "******************************".
048400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
048500     "NC201A".
048600 PROCEDURE DIVISION.
048700 CCVS1 SECTION.
048800 OPEN-FILES.
048900     OPEN     OUTPUT PRINT-FILE.
049000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
049100     MOVE    SPACE TO TEST-RESULTS.
049200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
049300     GO TO CCVS1-EXIT.
049400 CLOSE-FILES.
049500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
049600 TERMINATE-CCVS.
049700S    EXIT PROGRAM.
049800STERMINATE-CALL.
049900     STOP     RUN.
050000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
050100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
050200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
050300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
050400     MOVE "****TEST DELETED****" TO RE-MARK.
050500 PRINT-DETAIL.
050600     IF REC-CT NOT EQUAL TO ZERO
050700             MOVE "." TO PARDOT-X
050800             MOVE REC-CT TO DOTVALUE.
050900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
051000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
051100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
051200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
051300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
051400     MOVE SPACE TO CORRECT-X.
051500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
051600     MOVE     SPACE TO RE-MARK.
051700 HEAD-ROUTINE.
051800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
052100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
052200 COLUMN-NAMES-ROUTINE.
052300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
052400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
052600 END-ROUTINE.
052700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
052800 END-RTN-EXIT.
052900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053000 END-ROUTINE-1.
053100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
053200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
053300      ADD PASS-COUNTER TO ERROR-HOLD.
053400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
053500      MOVE PASS-COUNTER TO CCVS-E-4-1.
053600      MOVE ERROR-HOLD TO CCVS-E-4-2.
053700      MOVE CCVS-E-4 TO CCVS-E-2-2.
053800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
053900  END-ROUTINE-12.
054000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
054100     IF       ERROR-COUNTER IS EQUAL TO ZERO
054200         MOVE "NO " TO ERROR-TOTAL
054300         ELSE
054400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
054500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
054600     PERFORM WRITE-LINE.
054700 END-ROUTINE-13.
054800     IF DELETE-COUNTER IS EQUAL TO ZERO
054900         MOVE "NO " TO ERROR-TOTAL  ELSE
055000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
055100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
055200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055300      IF   INSPECT-COUNTER EQUAL TO ZERO
055400          MOVE "NO " TO ERROR-TOTAL
055500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
055600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
055700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055900 WRITE-LINE.
056000     ADD 1 TO RECORD-COUNT.
056100Y    IF RECORD-COUNT GREATER 50
056200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
056300Y        MOVE SPACE TO DUMMY-RECORD
056400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
056500Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
056600Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
056700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
056800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
056900Y        MOVE ZERO TO RECORD-COUNT.
057000     PERFORM WRT-LN.
057100 WRT-LN.
057200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
057300     MOVE SPACE TO DUMMY-RECORD.
057400 BLANK-LINE-PRINT.
057500     PERFORM WRT-LN.
057600 FAIL-ROUTINE.
057700     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
058000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
058100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
058200     MOVE   SPACES TO INF-ANSI-REFERENCE.
058300     GO TO  FAIL-ROUTINE-EX.
058400 FAIL-ROUTINE-WRITE.
058500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
058600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
058700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
058800     MOVE   SPACES TO COR-ANSI-REFERENCE.
058900 FAIL-ROUTINE-EX. EXIT.
059000 BAIL-OUT.
059100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
059200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
059300 BAIL-OUT-WRITE.
059400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
059500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
059600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
059700     MOVE   SPACES TO INF-ANSI-REFERENCE.
059800 BAIL-OUT-EX. EXIT.
059900 CCVS1-EXIT.
060000     EXIT.
060100 SECT-NC201A-001 SECTION.
060200 PFM-INIT-F3-1.
060300     MOVE "PFM-TEST-F3-1" TO PAR-NAME.
060400     MOVE   "VI-112 6.20.4 GR10(d)" TO ANSI-REFERENCE.
060500     MOVE "PERFORM UNTIL" TO FEATURE.
060600     MOVE 1 TO PERFORM2.
060700 PFM-TEST-F3-0.
060800     PERFORM  PFM-A THRU PFM-AA UNTIL PERFORM2 EQUAL TO 48.
060900*    NOTE IN THIS TEST THE CONDITION IS NOT SATISFIED
061000*    ORIGINALLY WHEN THE PERFORM IS ENTERED.
061100 PFM-TEST-F3-1.
061200     IF PERFORM2 EQUAL TO 48 PERFORM PASS
061300                             GO TO PFM-WRITE-F3-1.
061400     GO TO PFM-FAIL-F3-1.
061500 PFM-DELETE-F3-1.
061600     PERFORM DE-LETE.
061700     GO TO PFM-WRITE-F3-1.
061800 PFM-FAIL-F3-1.
061900     MOVE PERFORM2 TO COMPUTED-N.
062000     MOVE 48 TO CORRECT-N.
062100     PERFORM FAIL.
062200 PFM-WRITE-F3-1.
062300     PERFORM PRINT-DETAIL.
062400*
062500 PFM-INIT-F3-2.
062600     MOVE "PFM-TEST-F3-2" TO PAR-NAME.
062700     MOVE 50 TO PERFORM2.
062800*    NOTE IN THIS TEST CONDITION IS SATISFIED WHEN PERFORM IS
062900*    ENTERED AND CONTROL SHOULD NOT BE PASSED TO PFM-C.
063000 PFM-TEST-F3-2.
063100     PERFORM PFM-C UNTIL PERFORM2 GREATER THAN 25.
063200     IF PERFORM2 EQUAL TO 50 PERFORM PASS
063300                             GO TO PFM-WRITE-F3-2.
063400     GO TO PFM-FAIL-F3-2.
063500 PFM-DELETE-F3-2.
063600     PERFORM DE-LETE.
063700     GO TO PFM-WRITE-F3-2.
063800 PFM-FAIL-F3-2.
063900     MOVE PERFORM2 TO COMPUTED-N.
064000     MOVE 50 TO CORRECT-N.
064100     PERFORM FAIL.
064200 PFM-WRITE-F3-2.
064300     PERFORM PRINT-DETAIL.
064400*
064500 PFM-INIT-F4-1.
064600     MOVE "PFM-TEST-F4-1" TO PAR-NAME.
064700     MOVE "PERFORM VARYING" TO FEATURE.
064800 PFM-TEST-F4-1.
064900     PERFORM PFM-E VARYING PERFORM4 FROM PERFORM5 BY -0.2
065000         UNTIL PERFORM4 LESS THAN 9.0.
065100     IF PERFORM4 EQUAL TO 8.8 AND PERFORM6 EQUAL TO 12.5
065200               PERFORM PASS
065300               GO TO PFM-WRITE-F4-1.
065400     GO TO PFM-FAIL-F4-1.
065500 PFM-DELETE-F4-1.
065600     PERFORM PRINT-DETAIL.
065700     GO TO PFM-WRITE-F4-1.
065800 PFM-FAIL-F4-1.
065900     MOVE PERFORM4 TO COMPUTED-N.
066000     MOVE 8.8 TO CORRECT-N.
066100     PERFORM FAIL.
066200     PERFORM PRINT-DETAIL.
066300     MOVE SPACE TO P-OR-F.
066400     MOVE PERFORM6 TO COMPUTED-N.
066500     MOVE 12.5 TO CORRECT-N.
066600 PFM-WRITE-F4-1.
066700     PERFORM PRINT-DETAIL.
066800*
066900 PFM-INIT-F4-2.
067000     MOVE "PFM-TEST-F4-2" TO PAR-NAME.
067100     MOVE 5.5 TO PERFORM4.
067200     MOVE 5.5 TO PERFORM8 (7).
067300 PFM-TEST-F4-2.
067400*    NOTE IN THIS TEST ONE SUBSCRIPT IS VARIED.
067500*    NOTE  THIS ALSO TESTS THAT WHEN THE CONDITION IS TRUE,
067600*    CONTROL FALLS THRU AND THE PROCEDURE IS NOT EXECUTED.
067700     PERFORM PFM-G VARYING PERFORM3 FROM 1 BY 2 UNTIL
067800     PERFORM3 GREATER THAN 5.
067900     IF PERFORM8 (1) EQUAL TO 13.5 AND PERFORM8 (3) EQUAL TO 13.8
068000     AND PERFORM8 (5) EQUAL TO 14.1 AND PERFORM8 (7) EQUAL TO
068100     5.5 AND PERFORM3 EQUAL TO 7
068200               PERFORM PASS
068300               GO TO PFM-WRITE-F4-2.
068400*    NOTE THE OCCURS CLAUSE IS NEEDED IN THE DATA DESCRIPTION
068500*        FOR THESE PERFORM TESTS --- MORE EXHAUSTIVE TESTS OF THE
068600*        OCCURS CLAUSE CAN BE FOUND IN THE TABLE HANDLING TESTS.
068700     GO TO PFM-FAIL-F4-2.
068800 PFM-DELETE-F4-2.
068900     PERFORM DE-LETE.
069000     GO TO PFM-WRITE-F4-2.
069100 PFM-FAIL-F4-2.
069200     MOVE PERFORM8 (1) TO COMPUTED-N.
069300     MOVE 13.5 TO CORRECT-N.
069400     PERFORM FAIL.
069500     PERFORM PRINT-DETAIL.
069600     MOVE SPACE TO P-OR-F.
069700     MOVE PERFORM8 (3) TO COMPUTED-N.
069800     MOVE 13.8 TO CORRECT-N.
069900     MOVE "PFM-TEST-F4-2" TO PAR-NAME.
070000     PERFORM PRINT-DETAIL.
070100     MOVE PERFORM8 (5) TO COMPUTED-N.
070200     MOVE 14.1 TO CORRECT-N.
070300     MOVE "PFM-TEST-F4-2" TO PAR-NAME.
070400     PERFORM PRINT-DETAIL.
070500     MOVE PERFORM8 (7) TO COMPUTED-N.
070600     MOVE  5.5 TO CORRECT-N.
070700     MOVE "PFM-TEST-F4-2" TO PAR-NAME.
070800     PERFORM PRINT-DETAIL.
070900     MOVE PERFORM3 TO COMPUTED-N.
071000     MOVE 7 TO CORRECT-N.
071100     MOVE "PFM-TEST-F4-2" TO PAR-NAME.
071200 PFM-WRITE-F4-2.
071300     PERFORM PRINT-DETAIL.
071400*
071500 PFM-INIT-F4-3.
071600     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
071700     MOVE 1.5 TO PERFORM4.
071800 PFM-TEST-F4-3.
071900*    NOTE IN THIS TEST TWO SUBSCRIPTS ARE VARIED.
072000     PERFORM PFM-I THRU PFM-J VARYING PERFORM3
072100     FROM PERFORM9 BY PERFORM10 UNTIL PERFORM3 EQUAL TO 1
072200     AFTER PERFORM2 FROM 2 BY PERFORM11 UNTIL PERFORM2
072300     GREATER THAN 20.
072400     IF PERFORM14 (3, 2) EQUAL TO 15.0 AND PERFORM14 (3, 8)
072500     EQUAL TO 20.0 AND PERFORM14 (3, 14) EQUAL TO 25.0
072600     AND PERFORM14 (3, 20) EQUAL TO 30.0 AND PERFORM14 (2, 2)
072700     EQUAL TO 35.0 MOVE "A" TO XRAY.
072800     IF PERFORM14 (2, 8) EQUAL TO 40.0 AND
072900     PERFORM14 (2, 14) EQUAL TO 45.0 AND PERFORM14 (2, 20)
073000     EQUAL TO 50.0 AND PERFORM2 EQUAL TO 2 AND PERFORM3
073100     EQUAL TO 1 AND XRAY EQUAL TO "A" PERFORM PASS
073200         GO TO PFM-WRITE-F4-3.
073300     GO TO PFM-FAIL-F4-3.
073400 PFM-DELETE-F4-3.
073500     PERFORM DE-LETE.
073600     GO TO PFM-WRITE-F4-3.
073700 PFM-FAIL-F4-3.
073800     MOVE PERFORM14 (3,  2) TO COMPUTED-N.
073900     MOVE 15.0 TO CORRECT-N.
074000     PERFORM FAIL.
074100     PERFORM PRINT-DETAIL.
074200     MOVE SPACE TO P-OR-F.
074300     MOVE PERFORM14 (3,  8) TO COMPUTED-N.
074400     MOVE 20.0 TO CORRECT-N.
074500     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
074600     PERFORM PRINT-DETAIL.
074700     MOVE PERFORM14 (3, 14) TO COMPUTED-N.
074800     MOVE 25.0 TO CORRECT-N.
074900     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
075000     PERFORM PRINT-DETAIL.
075100     MOVE PERFORM14 (3, 20) TO COMPUTED-N.
075200     MOVE 30.0 TO CORRECT-N.
075300     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
075400     PERFORM PRINT-DETAIL.
075500     MOVE PERFORM14 (2,  2) TO COMPUTED-N.
075600     MOVE 35.0 TO CORRECT-N.
075700     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
075800     PERFORM PRINT-DETAIL.
075900     MOVE PERFORM14 (2,  8) TO COMPUTED-N.
076000     MOVE 40.0 TO CORRECT-N.
076100     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
076200     PERFORM PRINT-DETAIL.
076300     MOVE PERFORM14 (2, 14) TO COMPUTED-N.
076400     MOVE 45.0 TO CORRECT-N.
076500     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
076600     PERFORM PRINT-DETAIL.
076700     MOVE PERFORM14 (2, 20) TO COMPUTED-N.
076800     MOVE 50.0 TO CORRECT-N.
076900     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
077000     PERFORM PRINT-DETAIL.
077100     MOVE PERFORM2 TO COMPUTED-N.
077200     MOVE    2 TO CORRECT-N.
077300     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
077400     PERFORM PRINT-DETAIL.
077500     MOVE PERFORM3 TO COMPUTED-N.
077600     MOVE    1 TO CORRECT-N.
077700     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
077800     PERFORM PRINT-DETAIL.
077900     MOVE XRAY TO COMPUTED-A.
078000     MOVE "A" TO CORRECT-A.
078100     MOVE "PFM-TEST-F4-3" TO PAR-NAME.
078200 PFM-WRITE-F4-3.
078300     PERFORM PRINT-DETAIL.
078400*
078500 PFM-INIT-F4-4.
078600     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
078700     MOVE 2 TO PERFORM9.
078800     MOVE 2 TO PERFORM10.
078900 PFM-TEST-F4-4.
079000*    NOTE IN THIS TEST THREE SUBSCRIPTS ARE VARIED.
079100     PERFORM PFM-L VARYING PERFORM3 FROM PERFORM9 BY 2
079200     UNTIL PERFORM3 GREATER THAN 4 AFTER PERFORM2 FROM 10
079300     BY -5 UNTIL PERFORM2 EQUAL TO 0  AFTER PERFORM11
079400     FROM 3 BY PERFORM10 UNTIL PERFORM11 GREATER THAN 5.
079500     IF PERFORM16 (2, 10, 3) EQUAL TO 5.0 AND PERFORM16 (2, 10, 5)
079600     EQUAL TO 5.7 AND PERFORM16 (2, 5, 3) EQUAL TO 6.4 AND
079700     PERFORM16 (2, 5, 5) EQUAL TO 7.1 AND PERFORM16 (4, 10, 3)
079800     EQUAL TO 7.8 AND PERFORM16 (4, 10, 5) EQUAL TO 8.5
079900     MOVE "B" TO XRAY. IF
080000     PERFORM16 (4, 5, 3) EQUAL TO 9.2 AND PERFORM16 (4, 5, 5)
080100     EQUAL TO 9.9 AND PERFORM11 EQUAL TO 3 AND PERFORM2 EQUAL
080200     TO 10 AND PERFORM3 EQUAL TO 6 AND XRAY EQUAL TO "B"
080300     PERFORM PASS GO TO PFM-WRITE-F4-4.
080400     GO TO PFM-FAIL-F4-4.
080500 PFM-DELETE-F4-4.
080600     PERFORM DE-LETE.
080700     GO TO PFM-WRITE-F4-4.
080800 PFM-FAIL-F4-4.
080900     MOVE PERFORM16 (2, 10, 3) TO COMPUTED-N.
081000     MOVE 5.0 TO CORRECT-N.
081100     PERFORM FAIL.
081200     PERFORM PRINT-DETAIL.
081300     MOVE SPACE TO P-OR-F.
081400     MOVE PERFORM16 (2, 10, 3) TO COMPUTED-N.
081500     MOVE 5.0 TO CORRECT-N.
081600     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
081700     PERFORM PRINT-DETAIL.
081800     MOVE PERFORM16 (2, 10, 5) TO COMPUTED-N.
081900     MOVE 5.7 TO CORRECT-N.
082000     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
082100     PERFORM PRINT-DETAIL.
082200     MOVE PERFORM16 (2,  5, 3) TO COMPUTED-N.
082300     MOVE 6.4 TO CORRECT-N.
082400     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
082500     PERFORM PRINT-DETAIL.
082600     MOVE PERFORM16 (2,  5, 5) TO COMPUTED-N.
082700     MOVE 7.1 TO CORRECT-N.
082800     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
082900     PERFORM PRINT-DETAIL.
083000     MOVE PERFORM16 (4, 10, 3) TO COMPUTED-N.
083100     MOVE 7.8 TO CORRECT-N.
083200     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
083300     PERFORM PRINT-DETAIL.
083400     MOVE PERFORM16 (4, 10, 5) TO COMPUTED-N.
083500     MOVE 8.5 TO CORRECT-N.
083600     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
083700     PERFORM PRINT-DETAIL.
083800     MOVE PERFORM16 (4,  5, 3) TO COMPUTED-N.
083900     MOVE 9.2 TO CORRECT-N.
084000     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
084100     PERFORM PRINT-DETAIL.
084200     MOVE PERFORM16 (4,  5, 5) TO COMPUTED-N.
084300     MOVE 9.9 TO CORRECT-N.
084400     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
084500     PERFORM PRINT-DETAIL.
084600     MOVE PERFORM11            TO COMPUTED-N.
084700     MOVE 3   TO CORRECT-N.
084800     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
084900     PERFORM PRINT-DETAIL.
085000     MOVE PERFORM2             TO COMPUTED-N.
085100     MOVE 10  TO CORRECT-N.
085200     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
085300     PERFORM PRINT-DETAIL.
085400     MOVE PERFORM3             TO COMPUTED-N.
085500     MOVE 6   TO CORRECT-N.
085600     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
085700     PERFORM PRINT-DETAIL.
085800     MOVE XRAY TO COMPUTED-A.
085900     MOVE "B" TO CORRECT-A.
086000     MOVE "PFM-TEST-F4-4" TO PAR-NAME.
086100 PFM-WRITE-F4-4.
086200     PERFORM PRINT-DETAIL.
086300     GO TO PFM-CONTINUE.
086400 PFM-A.
086500     MULTIPLY PERFORM3 BY 6 GIVING PERFORM2.
086600 PFM-AA.
086700     ADD 1 TO PERFORM3.
086800 PFM-B.
086900     PERFORM FAIL.
087000     MOVE "PFM-B ERRONIOUSLY ENTERED" TO RE-MARK.
087100*    NOTE CONTROL SHOULD NEVER FALL THRU TO THIS PARAGRAPH FROM
087200*        THE PREVIOUS ONE.
087300     GO TO PFM-WRITE-F3-1.
087400 PFM-C.
087500     ADD 1 TO PERFORM2.
087600 PFM-D.
087700     PERFORM FAIL.
087800     MOVE "PFM-D ERRONIOUSLY ENTERED" TO RE-MARK.
087900*    NOTE CONTROL SHOULD NEVER FALL THRU TO THIS PARAGRAPH FROM
088000*        THE PREVIOUS ONE.
088100     GO TO PFM-WRITE-F3-2.
088200 PFM-E.
088300     ADD PERFORM4 3.5 GIVING PERFORM6.
088400 PFM-F.
088500     PERFORM FAIL.
088600     MOVE "PFM-F ERRONIOUSLY ENTERED" TO RE-MARK.
088700*    NOTE CONTROL SHOULD NEVER FALL THRU TO THIS PARAGRAPH FROM
088800*        THE PREVIOUS ONE.
088900     GO TO PFM-WRITE-F4-1.
089000 PFM-G.
089100     ADD PERFORM4 8 GIVING PERFORM8 (PERFORM3).
089200     ADD .3 TO PERFORM4.
089300 PFM-H.
089400     PERFORM FAIL.
089500     MOVE "PFM-H ERRONIOUSLY ENTERED" TO RE-MARK.
089600*    NOTE CONTROL SHOULD NEVER FALL THRU TO THIS PARAGRAPH FROM
089700*        THE PREVIOUS ONE.
089800     GO TO PFM-WRITE-F4-2.
089900 PFM-I.
090000     MULTIPLY PERFORM4 BY 10 GIVING PERFORM14
090100         (PERFORM3, PERFORM2).
090200 PFM-J.
090300     ADD .5 TO PERFORM4.
090400 PFM-K.
090500     PERFORM FAIL.
090600     MOVE "PFM-K ERRONIOUSLY ENTERED" TO RE-MARK.
090700*    NOTE CONTROL SHOULD NEVER FALL THRU TO THIS PARAGRAPH FROM
090800*        THE PREVIOUS ONE.
090900     GO TO PFM-WRITE-F4-3.
091000 PFM-L.
091100     SUBTRACT 5.0 FROM PERFORM5 GIVING PERFORM16
091200         (PERFORM3, PERFORM2, PERFORM11).
091300     ADD .7 TO PERFORM5.
091400 PFM-M.
091500     PERFORM FAIL.
091600     MOVE "PFM-M ERRONIOUSLY ENTERED" TO RE-MARK.
091700*    NOTE CONTROL SHOULD NEVER FALL THRU TO THIS PARAGRAPH FROM
091800*        THE PREVIOUS ONE.
091900     GO TO PFM-WRITE-F4-4.
092000 PFM-CONTINUE.
092100     EXIT.
092200*
092300 PFM-INIT-F3-3.
092400     MOVE "PFM-TEST-F3-3  " TO PAR-NAME.
092500     MOVE "VI-122 6.20.4 GR10(C)" TO ANSI-REFERENCE.
092600     MOVE ZERO TO WRK-DS-02V00.
092700     GO TO PFM-TEST-F3-3.
092800 PFM-A-3-3.
092900     EXIT.
093000 PFM-B-3-3.
093100     ADD      1 TO WRK-DS-02V00.
093200 PFM-TEST-F3-3.
093300     PERFORM PFM-A-3-3 THROUGH PFM-B-3-3 UNTIL TEST-2NUC-COND-99.
093400     IF WRK-DS-02V00 EQUAL TO 99
093500              PERFORM PASS GO TO PFM-WRITE-F3-3.
093600     GO TO PFM-FAIL-F3-3.
093700 PFM-DELETE-F3-3.
093800     PERFORM  DE-LETE.
093900     GO TO PFM-WRITE-F3-3.
094000 PFM-FAIL-F3-3.
094100     MOVE     WRK-DS-02V00 TO COMPUTED-N.
094200     MOVE     99 TO CORRECT-N.
094300     PERFORM  FAIL.
094400 PFM-WRITE-F3-3.
094500     PERFORM  PRINT-DETAIL.
094600*
094700 PFM-INIT-F4-5.
094800     MOVE     "PFM-TEST-F4-5" TO PAR-NAME.
094900     MOVE     ZERO TO WRK-DS-02V00.
095000     MOVE     ZERO TO WRK-DS-06V06.
095100     PERFORM  PFM-A-4-5 THROUGH PFM-C-4-5 VARYING WRK-DS-02V00
095200              FROM 1 BY 1 UNTIL TEST-2NUC-COND-99.
095300     GO TO PFM-TEST-F4-5.
095400 PFM-A-4-5.
095500     ADD      0.000001 TO WRK-DS-06V06.
095600 PFM-B-4-5.
095700     ADD      1 TO WRK-DS-06V06.
095800 PFM-C-4-5.
095900     SUBTRACT 1 FROM WRK-DS-06V06.
096000 PFM-TEST-F4-5.
096100     ADD      WRK-DS-02V00 TO WRK-DS-06V06.
096200     IF   WRK-DS-06V06 EQUAL TO 99.000098
096300              PERFORM PASS GO TO PFM-WRITE-F4-5.
096400     GO       TO PFM-FAIL-F4-5.
096500 PFM-DELETE-F4-5.
096600     PERFORM  DE-LETE.
096700     GO TO    PFM-WRITE-F4-5.
096800 PFM-FAIL-F4-5.
096900     MOVE     WRK-DS-06V06 TO COMPUTED-N.
097000     MOVE 99.000098 TO CORRECT-N.
097100     PERFORM  FAIL.
097200 PFM-WRITE-F4-5.
097300     PERFORM  PRINT-DETAIL.
097400*
097500 PFM-INIT-F4-6.
097600     MOVE     "PFM-TEST-F4-6" TO PAR-NAME.
097700     MOVE     ZERO TO WRK-DS-02V00.
097800     MOVE     ZERO TO WRK-DS-06V06.
097900     PERFORM  PFM-A-4-6 VARYING WRK-DS-02V00 FROM A02TWOS-DS-02V00
098000              BY A02TWOS-DS-02V00 UNTIL (WRK-DS-02V00 + 12) = 100.
098100 PFM-A-4-6.
098200     ADD      0.000001 TO WRK-DS-06V06.
098300 PFM-TEST-F4-6.
098400     ADD      WRK-DS-02V00 TO WRK-DS-06V06.
098500     IF       WRK-DS-06V06 EQUAL TO 88.000004
098600              PERFORM PASS GO TO PFM-WRITE-F4-6.
098700     GO       TO PFM-FAIL-F4-6.
098800 PFM-DELETE-F4-6.
098900     PERFORM  DE-LETE.
099000     GO       TO PFM-WRITE-F4-6.
099100 PFM-FAIL-F4-6.
099200     MOVE     WRK-DS-06V06 TO COMPUTED-N.
099300     MOVE     88.000004 TO CORRECT-N.
099400     PERFORM  FAIL.
099500 PFM-WRITE-F4-6.
099600     PERFORM  PRINT-DETAIL.
099700*
099800 PFM-INIT-F4-7.
099900     MOVE     "PFM-TEST-F4-7" TO PAR-NAME.
100000     GO TO PFM-TEST-F4-7.
100100 PFM-A-10.
100200     EXIT.
100300 PFM-TEST-F4-7.
100400     PERFORM  PFM-A-10
100500              VARYING PERFORM4
100600              FROM -5.5
100700              BY 0.1
100800              UNTIL PERFORM4 > 90.
100900     IF       PERFORM4 EQUAL TO 90.1
101000              PERFORM PASS GO TO PFM-WRITE-F4-7.
101100     GO       TO PFM-FAIL-F4-7.
101200*        NOTE PFM-A-10 SHOULD BE "EXECUTED" UNTIL PERFORM4 IS 90.1
101300*             EVEN THOUGH PFM-A-10 IS NOTHING BUT AN EXIT.
101400 PFM-DELETE-F4-7.
101500     PERFORM  DE-LETE.
101600     GO       TO PFM-WRITE-F4-7.
101700 PFM-FAIL-F4-7.
101800     PERFORM  FAIL.
101900     MOVE PERFORM4 TO COMPUTED-N.
102000     MOVE 90.1 TO CORRECT-N.
102100 PFM-WRITE-F4-7.
102200     PERFORM  PRINT-DETAIL.
102300*
102400 PFM-INIT-F4-8.
102500     MOVE "PFM-TEST-F4-8" TO PAR-NAME.
102600     MOVE ZERO TO PFM-11-COUNTER.
102700     MOVE ZERO TO SWITCH-PFM-1.
102800*    NOTE  THIS AUDIT ROUTINE TESTS NESTED PERFORMS
102900*        IF THE PROGRAM CANNOT SET RETURNS AT THE PROPER PLACE
103000*             OR  EXECUTE THEM IN PROPER SEQUENCE A FAIL WILL
103100*                 RESULT.
103200 PFM-TEST-F4-8.
103300     GO TO PFM-PART-A.
103400 PFM-DELETE-F4-8.
103500     PERFORM DE-LETE.
103600     GO TO PFM-WRITE-F4-8.
103700 PFM-PART-A SECTION.
103800 PARA-PART-A.
103900     IF SWITCH-PFM-1 = 1
104000         GO TO PFM-SEC-A3.
104100 PFM-SEC-A2.
104200     PERFORM PFM-SEC-B1 THRU PFM-SEC-B6.
104300     GO TO PFM-SEC-A4.
104400 PFM-SEC-A3.
104500     ADD 2 TO PFM-11-COUNTER.
104600     MOVE 1 TO SWITCH-PFM-2.
104700          PERFORM PFM-SEC-B1 THRU PFM-SEC-B5.
104800 PFM-SEC-A4.
104900     EXIT.
105000 PFM-PART-B SECTION.
105100 PFM-SEC-B1.
105200     MULTIPLY  PFM-11-COUNTER BY 10 GIVING PFM-11-COUNTER.
105300     IF SWITCH-PFM-2 EQUAL TO 1
105400              GO TO PFM-SEC-B5.
105500 PFM-SEC-B2.
105600     MOVE 1 TO SWITCH-PFM-1.
105700 PFM-SEC-B3.
105800     PERFORM PFM-PART-A.
105900 PFM-SEC-B4.
106000     EXIT.
106100 PFM-SEC-B5.
106200     EXIT.
106300 PFM-SEC-B6.
106400     EXIT.
106500 PFM-SEC-B7.
106600     EXIT.
106700 PFM-SEC-STOP.
106800     IF PFM-11-COUNTER EQUAL TO 200
106900              PERFORM PASS
107000              GO TO PFM-WRITE-F4-8.
107100     PERFORM FAIL.
107200     MOVE "200" TO CORRECT-A.
107300     MOVE PFM-11-COUNTER TO COMPUTED-A.
107400 PFM-WRITE-F4-8.
107500     PERFORM PRINT-DETAIL.
107600*
107700 PFM-INIT-F4-9.
107800     MOVE "PFM-TEST-F4-9" TO PAR-NAME.
107900     ADD 44 TO PFM-12-ANS1.
108000     ADD 46 TO PFM-12-ANS2.
108100*    NOTE  THIS PROGRAM TESTS THE ABILITY OF THE COMPILER TO
108200*        PERFORM A STATEMENT WITH A VARYING CLAUSE INCLUDED.
108300     GO TO PFM-TEST-F4-9.
108400 PFM-F4-9-A.
108500     ADD 1 TO PFM-12-ANS2.
108600     SUBTRACT 2 FROM PFM-12-ANS1.
108700     IF PFM-12-ANS2 LESS THAN PFM-12-ANS1
108800         GO TO PFM-F4-9-B ELSE
108900     DIVIDE PFM-12-COUNTER BY 2 GIVING PFM-12-COUNTER.
109000     IF PFM-12-COUNTER LESS THAN 36 SUBTRACT 4 FROM
109100     PFM-12-COUNTER.
109200 PFM-F4-9-B.
109300     EXIT.
109400 PFM-TEST-F4-9.
109500     PERFORM PFM-F4-9-A VARYING PFM-12-COUNTER FROM 100 BY 4
109600       UNTIL PFM-12-COUNTER NOT GREATER THAN 15
109700             AND PFM-12-ANS1 LESS THAN PFM-12-ANS2
109800             OR PFM-12-ANS2 GREATER THAN 50.
109900     IF PFM-12-COUNTER EQUAL TO 13
110000         PERFORM PASS
110100         GO TO PFM-WRITE-F4-9.
110200     GO TO PFM-FAIL-F4-9.
110300 PFM-DELETE-F4-9.
110400     PERFORM DE-LETE.
110500     GO TO PFM-WRITE-F4-9.
110600 PFM-FAIL-F4-9.
110700     PERFORM FAIL.
110800     MOVE PFM-12-COUNTER TO COMPUTED-A.
110900     MOVE "13" TO CORRECT-A.
111000 PFM-WRITE-F4-9.
111100     PERFORM PRINT-DETAIL.
111200*
111300 PFM-INIT-F4-10.
111400     MOVE     "PFM-TEST-F4-10" TO PAR-NAME.
111500     MOVE     0 TO PERFORM18.
111600     MOVE     1 TO START-POINT.
111700     MOVE     3 TO INC-VALUE.
111800     GO TO PFM-TEST-F4-10.
111900 PFM-F4-10-A.
112000     ADD      1 TO PERFORM18.
112100     ADD      3 TO PERFORM17.
112200*        NOTE MANIPULATING PERFORM17 IS SUPPOSED TO AFFECT THE
112300*             NUMBER OF TIMES THIS PARAGRAPH IS PERFORMED --- IN
112400*             PARTICULAR PFM-F4-10-A WOULD HAVE BEEN EXECUTED 15
112500*             TIMES WITHOUT THE ABOVE ADDITION TO PERFORM17, BUT
112600*             IN FACT IT SHOULD NOW BE EXECUTED ONLY 8 TIMES.
112700 PFM-TEST-F4-10.
112800     PERFORM  PFM-F4-10-A
112900              VARYING PERFORM17
113000              FROM START-POINT
113100              BY INC-VALUE
113200              UNTIL PERFORM17 GREATER THAN 45
113300     IF       PERFORM18 EQUAL TO 8 PERFORM PASS
113400                                   GO TO PFM-WRITE-F4-10.
113500     GO TO PFM-FAIL-F4-10.
113600 PFM-DELETE-F4-10.
113700     PERFORM  DE-LETE.
113800     GO       TO PFM-WRITE-F4-10.
113900 PFM-FAIL-F4-10.
114000     PERFORM  FAIL.
114100     MOVE     PERFORM18 TO COMPUTED-N.
114200     MOVE     8 TO CORRECT-N.
114300 PFM-WRITE-F4-10.
114400     PERFORM  PRINT-DETAIL.
114500*
114600 PFM-INIT-F4-11.
114700     MOVE     "PFM-TEST-F4-11" TO PAR-NAME.
114800     MOVE     0 TO PERFORM18.
114900     MOVE     1 TO START-POINT.
115000     MOVE     3 TO INC-VALUE.
115100     GO TO PFM-TEST-F4-11.
115200 PFM-F4-11-A.
115300     ADD      1 TO PERFORM18.
115400     MOVE     46 TO START-POINT.
115500*        NOTE THE ABOVE MOVE HAS NO EFFECT ON THE NUMBER OF TIMES
115600*             PFM-F4-11-A IS EXECUTED (15).
115700 PFM-TEST-F4-11.
115800     PERFORM  PFM-F4-11-A
115900              VARYING PERFORM17
116000              FROM START-POINT
116100              BY INC-VALUE
116200              UNTIL PERFORM17 GREATER THAN 45
116300     IF       PERFORM18 EQUAL TO 15 PERFORM PASS
116400                                    GO TO PFM-WRITE-F4-11.
116500     GO TO PFM-FAIL-F4-11.
116600 PFM-DELETE-F4-11.
116700     PERFORM  DE-LETE.
116800     GO       TO PFM-WRITE-F4-11.
116900 PFM-FAIL-F4-11.
117000     PERFORM  FAIL.
117100     MOVE     PERFORM18 TO COMPUTED-N.
117200     MOVE     15 TO CORRECT-N.
117300 PFM-WRITE-F4-11.
117400     PERFORM  PRINT-DETAIL.
117500*
117600 PFM-INIT-F4-12.
117700     MOVE     "PFM-TEST-F4-12" TO PAR-NAME.
117800     MOVE     0 TO PERFORM18.
117900     MOVE     1 TO START-POINT.
118000     MOVE     3 TO INC-VALUE.
118100     GO TO PFM-TEST-F4-12.
118200 PFM-F4-12-A.
118300     ADD      1 TO PERFORM18.
118400     ADD      1 TO INC-VALUE.
118500*        NOTE THE ABOVE ADD TO INC-VALUE SHOULD ACCELERATE THE
118600*             SPEED AT WHICH PERFORM17 APPROACHES 46 --- THEREFORE
118700*             PFM-F4-12-A IS EXECUTED ONLY 7 TIMES INSTEAD OF 15.
118800 PFM-TEST-F4-12.
118900     PERFORM  PFM-F4-12-A
119000              VARYING PERFORM17
119100              FROM START-POINT
119200              BY INC-VALUE
119300              UNTIL PERFORM17 GREATER THAN 45
119400     IF       PERFORM18 EQUAL TO 7 PERFORM PASS
119500                                   GO TO PFM-WRITE-F4-12.
119600     GO TO PFM-FAIL-F4-12.
119700 PFM-DELETE-F4-12.
119800     PERFORM  DE-LETE.
119900     GO       TO PFM-WRITE-F4-12.
120000 PFM-FAIL-F4-12.
120100     PERFORM  FAIL.
120200     MOVE     PERFORM18 TO COMPUTED-N.
120300     MOVE     7 TO CORRECT-N.
120400 PFM-WRITE-F4-12.
120500     PERFORM  PRINT-DETAIL.
120600 PFM-INIT-F3-4.
120700*    ===--> "TEST BEFORE" PHRASE <--===
120800     MOVE   "VI-112 6.20.2 GR10" TO ANSI-REFERENCE.
120900     MOVE 1 TO PERFORM2.
121000*    NOTE IN THIS TEST THE CONDITION IS NOT SATISFIED
121100*    ORIGINALLY WHEN THE PERFORM IS ENTERED.
121200 PFM-TEST-F3-4-0.
121300     PERFORM PFM-A THRU PFM-AA TEST BEFORE
121400             UNTIL PERFORM2 EQUAL TO 48.
121500 PFM-TEST-F3-4-1.
121600     IF PERFORM2 EQUAL TO 48 PERFORM PASS GO TO PFM-WRITE-F3-4.
121700     GO TO PFM-FAIL-F3-4.
121800 PFM-DELETE-F3-4.
121900     PERFORM DE-LETE.
122000     GO TO PFM-WRITE-F3-4.
122100 PFM-FAIL-F3-4.
122200     MOVE PERFORM2 TO COMPUTED-N.
122300     MOVE 48 TO CORRECT-N.
122400     PERFORM FAIL.
122500 PFM-WRITE-F3-4.
122600     MOVE "PFM-TEST-F3-4" TO PAR-NAME.
122700     PERFORM PRINT-DETAIL.
122800 PFM-INIT-F3-5.
122900*    ===--> "TEST BEFORE" PHRASE <--===
123000     MOVE   "VI-112 6.20.2 GR10" TO ANSI-REFERENCE.
123100     MOVE 50 TO PERFORM2.
123200*    NOTE IN THIS TEST CONDITION IS SATISFIED WHEN PERFORM IS
123300*    ENTERED AND CONTROL SHOULD NOT BE PASSED TO PFM-C.
123400 PFM-TEST-F3-5-0.
123500     PERFORM PFM-F3-5-C TEST BEFORE
123600             UNTIL PERFORM2 GREATER THAN 25.
123700 PFM-TEST-F3-5-1.
123800     IF PERFORM2 EQUAL TO 50 PERFORM PASS GO TO PFM-WRITE-F3-5.
123900     GO TO PFM-FAIL-F3-5.
124000 PFM-DELETE-F3-5.
124100     PERFORM DE-LETE.
124200     GO TO PFM-WRITE-F3-5.
124300 PFM-F3-5-C.
124400     ADD 1 TO PERFORM2.
124500 PFM-FAIL-F3-5.
124600     MOVE PERFORM2 TO COMPUTED-N.
124700     MOVE 50 TO CORRECT-N.
124800     PERFORM FAIL.
124900 PFM-WRITE-F3-5.
125000     MOVE "PFM-TEST-F3-5" TO PAR-NAME.
125100     PERFORM PRINT-DETAIL.
125200 PFM-INIT-F3-6.
125300*    ===--> "TEST BEFORE" PHRASE <--===
125400     MOVE   "VI-112 6.20.2 GR10" TO ANSI-REFERENCE.
125500     MOVE    ZERO TO WRK-DS-02V00.
125600 PFM-TEST-F3-6-0.
125700     PERFORM PFM-A-F3-6 THROUGH PFM-B-F3-6
125800             WITH TEST BEFORE
125900             UNTIL TEST-2NUC-COND-99.
126000 PFM-TEST-F3-6.
126100     GO TO   PFM-TESTT-F3-6.
126200 PFM-A-F3-6.
126300     EXIT.
126400 PFM-B-F3-6.
126500     ADD     1 TO WRK-DS-02V00.
126600 PFM-TESTT-F3-6.
126700     IF      WRK-DS-02V00 EQUAL TO 99
126800             PERFORM PASS GO TO PFM-WRITE-F3-6.
126900     GO TO   PFM-FAIL-F3-6.
127000 PFM-DELETE-F3-6.
127100     PERFORM DE-LETE.
127200     GO      TO PFM-WRITE-F3-6.
127300 PFM-FAIL-F3-6.
127400     MOVE    WRK-DS-02V00 TO COMPUTED-N.
127500     MOVE    99 TO CORRECT-N.
127600     PERFORM  FAIL.
127700 PFM-WRITE-F3-6.
127800     MOVE     "PFM-TEST-F3-6  " TO PAR-NAME.
127900     PERFORM  PRINT-DETAIL.
128000 PFM-INIT-F3-7.
128100*    ===--> "TEST AFTER"  PHRASE <--===
128200     MOVE   "VI-112 6.20.4 GR10(C)" TO ANSI-REFERENCE.
128300     MOVE 1 TO PERFORM2.
128400     MOVE 5 TO PERFORM3.
128500*    NOTE IN THIS TEST THE CONDITION IS NOT SATISFIED
128600*    ORIGINALLY WHEN THE PERFORM IS ENTERED.
128700 PFM-TEST-F3-7-0.
128800     PERFORM PFM-A THRU PFM-AA TEST AFTER
128900             UNTIL PERFORM2 EQUAL TO 48.
129000 PFM-TEST-F3-7-1.
129100     IF PERFORM2 EQUAL TO 48 PERFORM PASS GO TO PFM-WRITE-F3-7.
129200     GO TO PFM-FAIL-F3-7.
129300 PFM-DELETE-F3-7.
129400     PERFORM DE-LETE.
129500     GO TO PFM-WRITE-F3-7.
129600 PFM-FAIL-F3-7.
129700     MOVE PERFORM2 TO COMPUTED-N.
129800     MOVE 48 TO CORRECT-N.
129900     PERFORM FAIL.
130000 PFM-WRITE-F3-7.
130100     MOVE "PFM-TEST-F3-7" TO PAR-NAME.
130200     PERFORM PRINT-DETAIL.
130300 PFM-INIT-F3-8.
130400*    ===--> "TEST AFTER"  PHRASE <--===
130500     MOVE   "VI-112 6.20.2 GR10" TO ANSI-REFERENCE.
130600     MOVE 50 TO PERFORM2.
130700*    NOTE IN THIS TEST CONDITION IS SATISFIED AFTER PERFORM IS
130800*    ENTERED AND CONTROL SHOULD BE PASSED TO PFM-C ONCE.
130900 PFM-TEST-F3-8-0.
131000     PERFORM PFM-F3-8-C TEST AFTER
131100             UNTIL PERFORM2 GREATER THAN 25.
131200 PFM-TEST-F3-8-1.
131300     IF PERFORM2 EQUAL TO 51 PERFORM PASS GO TO PFM-WRITE-F3-8.
131400     GO TO PFM-FAIL-F3-8.
131500 PFM-DELETE-F3-8.
131600     PERFORM DE-LETE.
131700     GO TO PFM-WRITE-F3-8.
131800 PFM-F3-8-C.
131900     ADD 1 TO PERFORM2.
132000 PFM-FAIL-F3-8.
132100     MOVE PERFORM2 TO COMPUTED-N.
132200     MOVE 51 TO CORRECT-N.
132300     PERFORM FAIL.
132400 PFM-WRITE-F3-8.
132500     MOVE "PFM-TEST-F3-8" TO PAR-NAME.
132600     PERFORM PRINT-DETAIL.
132700 PFM-INIT-F3-9.
132800*    ===--> "TEST AFTER " PHRASE <--===
132900     MOVE   "VI-112 6.20.2 GR10" TO ANSI-REFERENCE.
133000     MOVE    ZERO TO WRK-DS-02V00.
133100 PFM-TEST-F3-9-0.
133200     PERFORM PFM-A-F3-9 THROUGH PFM-B-F3-9
133300             WITH TEST AFTER
133400             UNTIL TEST-2NUC-COND-99.
133500 PFM-TEST-F3-9.
133600     GO TO   PFM-TESTT-F3-9.
133700 PFM-A-F3-9.
133800     EXIT.
133900 PFM-B-F3-9.
134000     ADD     1 TO WRK-DS-02V00.
134100 PFM-TESTT-F3-9.
134200     IF      WRK-DS-02V00 EQUAL TO 99
134300             PERFORM PASS GO TO PFM-WRITE-F3-9.
134400     GO TO   PFM-FAIL-F3-9.
134500 PFM-DELETE-F3-9.
134600     PERFORM DE-LETE.
134700     GO      TO PFM-WRITE-F3-9.
134800 PFM-FAIL-F3-9.
134900     MOVE    WRK-DS-02V00 TO COMPUTED-N.
135000     MOVE    99 TO CORRECT-N.
135100     PERFORM  FAIL.
135200 PFM-WRITE-F3-9.
135300     MOVE     "PFM-TEST-F3-9" TO PAR-NAME.
135400     PERFORM  PRINT-DETAIL.
135500*
135600 PFM-INIT-F4-13.
135700*    ===--> "WITH TEST BEFORE" PHRASE <--===
135800     MOVE   "VI-114 6.20.4 GR10(d)1" TO ANSI-REFERENCE.
135900     MOVE    20  TO PERFORM2.
136000     MOVE     9  TO PERFORM3.
136100     MOVE    1.5 TO PERFORM4.
136200     MOVE     3  TO PERFORM9.
136300     MOVE    -1  TO PERFORM10.
136400     MOVE     6  TO PERFORM11.
136500     MOVE  ZEROS TO PERFORM12.
136600     MOVE    SPACE TO XRAY.
136700*    NOTE IN THIS TEST TWO SUBSCRIPTS ARE VARIED.
136800 PFM-TEST-F4-13-0.
136900     PERFORM PFM-I-F4-13 THRU PFM-J-F4-13 WITH TEST BEFORE
137000             VARYING PERFORM3 FROM PERFORM9 BY PERFORM10
137100               UNTIL PERFORM3 EQUAL TO 1
137200               AFTER PERFORM2 FROM 2 BY PERFORM11
137300               UNTIL PERFORM2 GREATER THAN 20.
137400     GO TO     PFM-TEST-F4-13-1.
137500 PFM-I-F4-13.
137600     MULTIPLY PERFORM4 BY 10 GIVING PERFORM14
137700         (PERFORM3, PERFORM2).
137800 PFM-J-F4-13.
137900     ADD .5 TO PERFORM4.
138000 PFM-TEST-F4-13-1.
138100     IF PERFORM14 (3, 2) EQUAL TO 15.0 AND PERFORM14 (3, 8)
138200     EQUAL TO 20.0 AND PERFORM14 (3, 14) EQUAL TO 25.0
138300     AND PERFORM14 (3, 20) EQUAL TO 30.0 AND PERFORM14 (2, 2)
138400     EQUAL TO 35.0 MOVE "A" TO XRAY.
138500     IF PERFORM14 (2, 8) EQUAL TO 40.0 AND
138600     PERFORM14 (2, 14) EQUAL TO 45.0 AND PERFORM14 (2, 20)
138700     EQUAL TO 50.0 AND PERFORM2 EQUAL TO 2 AND PERFORM3
138800     EQUAL TO 1 AND XRAY EQUAL TO "A" PERFORM PASS
138900         GO TO PFM-WRITE-F4-13.
139000     GO TO PFM-FAIL-F4-13.
139100 PFM-DELETE-F4-13.
139200     PERFORM DE-LETE.
139300     GO TO PFM-WRITE-F4-13.
139400 PFM-FAIL-F4-13.
139500     MOVE PERFORM14 (3,  2) TO COMPUTED-N.
139600     MOVE 15.0 TO CORRECT-N.
139700     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
139800     PERFORM FAIL.
139900     PERFORM PRINT-DETAIL.
140000     MOVE SPACE TO P-OR-F.
140100     MOVE PERFORM14 (3,  8) TO COMPUTED-N.
140200     MOVE 20.0 TO CORRECT-N.
140300     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
140400     PERFORM PRINT-DETAIL.
140500     MOVE PERFORM14 (3, 14) TO COMPUTED-N.
140600     MOVE 25.0 TO CORRECT-N.
140700     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
140800     PERFORM PRINT-DETAIL.
140900     MOVE PERFORM14 (3, 20) TO COMPUTED-N.
141000     MOVE 30.0 TO CORRECT-N.
141100     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
141200     PERFORM PRINT-DETAIL.
141300     MOVE PERFORM14 (2,  2) TO COMPUTED-N.
141400     MOVE 35.0 TO CORRECT-N.
141500     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
141600     PERFORM PRINT-DETAIL.
141700     MOVE PERFORM14 (2,  8) TO COMPUTED-N.
141800     MOVE 40.0 TO CORRECT-N.
141900     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
142000     PERFORM PRINT-DETAIL.
142100     MOVE PERFORM14 (2, 14) TO COMPUTED-N.
142200     MOVE 45.0 TO CORRECT-N.
142300     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
142400     PERFORM PRINT-DETAIL.
142500     MOVE PERFORM14 (2, 20) TO COMPUTED-N.
142600     MOVE 50.0 TO CORRECT-N.
142700     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
142800     PERFORM PRINT-DETAIL.
142900     MOVE PERFORM2 TO COMPUTED-N.
143000     MOVE    2 TO CORRECT-N.
143100     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
143200     PERFORM PRINT-DETAIL.
143300     MOVE PERFORM3 TO COMPUTED-N.
143400     MOVE    1 TO CORRECT-N.
143500     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
143600     PERFORM PRINT-DETAIL.
143700     MOVE XRAY TO COMPUTED-A.
143800     MOVE "A" TO CORRECT-A.
143900 PFM-WRITE-F4-13.
144000     MOVE "PFM-TEST-F4-13" TO PAR-NAME.
144100     PERFORM PRINT-DETAIL.
144200*
144300 PFM-INIT-F4-14.
144400*    ===--> "WITH TEST AFTER" PHRASE <--===
144500     MOVE   "VI-117/8 6.20.4 GR10(d)2" TO ANSI-REFERENCE.
144600     MOVE   "PFM-TEST-F4-14" TO PAR-NAME.
144700     MOVE    ZEROS TO PERFORM12.
144800     MOVE    SPACE TO XRAY.
144900     MOVE    6  TO PERFORM11.
145000     MOVE   -1  TO PERFORM10.
145100     MOVE    2  TO PERFORM9.
145200     MOVE    1  TO PERFORM4.
145300     MOVE    2  TO PERFORM3.
145400     MOVE    20 TO PERFORM2.
145500     MOVE    1  TO REC-CT.
145600*    NOTE:   IN THIS TEST TWO SUBSCRIPTS ARE VARIED.
145700 PFM-TEST-F4-14-0.
145800     PERFORM PFM-I-F4-14 THRU PFM-J-F4-14 WITH TEST AFTER
145900             VARYING PERFORM3 FROM PERFORM9 BY PERFORM10
146000               UNTIL PERFORM3 EQUAL TO 1
146100               AFTER PERFORM2 FROM 2 BY PERFORM11
146200               UNTIL PERFORM2 GREATER THAN 19.
146300     GO TO   PFM-TEST-F4-14-1.
146400 PFM-I-F4-14.
146500     MULTIPLY PERFORM4 BY 10 GIVING PERFORM14
146600         (PERFORM3, PERFORM2).
146700 PFM-J-F4-14.
146800     ADD .5 TO PERFORM4.
146900     MOVE    1 TO PERFORM3.
147000     MOVE    99 TO PERFORM2.
147100 PFM-DELETE-F4-14.
147200     PERFORM DE-LETE.
147300     PERFORM PRINT-DETAIL.
147400     GO TO   PFM-INIT-F4-15.
147500 PFM-TEST-F4-14-1.
147600     MOVE   "PFM-TEST-F4-14-1" TO PAR-NAME.
147700     IF      PERFORM14 (2, 2) NOT EQUAL TO 10.0
147800             MOVE PERFORM14 (2, 2) TO COMPUTED-N
147900             MOVE 10.0 TO CORRECT-N
148000             PERFORM FAIL
148100             PERFORM PRINT-DETAIL
148200     ELSE
148300             PERFORM PASS
148400             PERFORM PRINT-DETAIL.
148500     MOVE    SPACE TO P-OR-F.
148600     ADD     1 TO REC-CT.
148700 PFM-TEST-F4-14-2.
148800     MOVE   "PFM-TEST-F4-14-2" TO PAR-NAME.
148900     IF      PERFORM4  NOT = 1.5
149000             MOVE PERFORM4  TO COMPUTED-N
149100             MOVE 1.5  TO CORRECT-N
149200             PERFORM FAIL
149300             PERFORM PRINT-DETAIL
149400     ELSE
149500             PERFORM PASS
149600             PERFORM PRINT-DETAIL.
149700*
149800 PFM-INIT-F4-15.
149900*    ===--> "     TEST AFTER " PHRASE <--===
150000     MOVE   "VI-117/8 6.20.4 GR10(d)2" TO ANSI-REFERENCE.
150100     MOVE   "PFM-TEST-F4-15"           TO PAR-NAME.
150200     MOVE    ZEROS TO PERFORM12.
150300     MOVE     1 TO REC-CT.
150400     MOVE    20 TO PERFORM2.
150500     MOVE     5 TO PERFORM3.
150600     MOVE     1 TO PERFORM4.
150700     MOVE     3 TO PERFORM9.
150800     MOVE    -1 TO PERFORM10.
150900     MOVE     6 TO PERFORM11.
151000*    NOTE IN THIS TEST TWO SUBSCRIPTS ARE VARIED.
151100 PFM-TEST-F4-15-0.
151200     PERFORM PFM-I-F4-15 THRU PFM-J-F4-15 TEST AFTER
151300             VARYING PERFORM3 FROM PERFORM9 BY PERFORM10
151400               UNTIL PERFORM3 EQUAL TO 2
151500               AFTER PERFORM2 FROM 2 BY PERFORM11
151600               UNTIL PERFORM2 GREATER THAN 19.
151700     GO TO   PFM-TEST-F4-15-1.
151800 PFM-I-F4-15.
151900     MULTIPLY PERFORM4 BY 10 GIVING PERFORM14
152000         (PERFORM3, PERFORM2).
152100 PFM-J-F4-15.
152200     ADD .5 TO PERFORM4.
152300     MOVE 20 TO PERFORM2.
152400 PFM-DELETE-F4-15.
152500     PERFORM DE-LETE.
152600     PERFORM PRINT-DETAIL.
152700     GO TO   PFM-INIT-F4-16.
152800 PFM-TEST-F4-15-1.
152900     IF      PERFORM14 (2, 2) NOT = 15.0
153000             MOVE    PERFORM14 (2, 2) TO COMPUTED-N
153100             MOVE    15.0 TO CORRECT-N
153200             PERFORM FAIL
153300             PERFORM PRINT-DETAIL
153400     ELSE
153500             PERFORM PASS
153600             PERFORM PRINT-DETAIL.
153700     ADD     1 TO REC-CT.
153800 PFM-TEST-F4-15-2.
153900     IF      PERFORM14 (3, 2) NOT = 10.0
154000             MOVE    PERFORM14 (3, 2) TO COMPUTED-N
154100             MOVE    10.0 TO CORRECT-N
154200             PERFORM FAIL
154300             PERFORM PRINT-DETAIL
154400     ELSE
154500             PERFORM PASS
154600             PERFORM PRINT-DETAIL.
154700*
154800 PFM-INIT-F4-16.
154900*    ===-->  6 AFTER PHRASES          <--===
155000     MOVE   "VI-110 6.20.3 SR12" TO ANSI-REFERENCE.
155100     MOVE   "PFM-TEST-F4-16"           TO PAR-NAME.
155200     MOVE    SPACES TO PERFORM-SEVEN-LEVEL-TABLE.
155300     MOVE    0 TO PFM-7-TOT.
155400     MOVE     1 TO REC-CT.
155500     MOVE     1 TO S1 S2 S3 S4 S5 S6 S7.
155600*    NOTE IN THIS TEST SEVEN SUBSCRIPTS ARE VARIED.
155700 PFM-TEST-F4-16-0.
155800     PERFORM PFM-I-F4-16 THRU PFM-J-F4-16
155900             VARYING S1 FROM 1 BY 1
156000               UNTIL S1 = 3
156100               AFTER S2 FROM 1 BY 1
156200               UNTIL S2 = 3
156300               AFTER S3 FROM 1 BY 1
156400               UNTIL S3 = 3
156500               AFTER S4 FROM 1 BY 1
156600               UNTIL S4 = 3
156700               AFTER S5 FROM 1 BY 1
156800               UNTIL S5 = 3
156900               AFTER S6 FROM 1 BY 1
157000               UNTIL S6 = 3
157100               AFTER S7 FROM 1 BY 1
157200               UNTIL S7 = 3.
157300     GO TO   PFM-TEST-F4-16-1.
157400 PFM-I-F4-16.
157500     MOVE   "*" TO PFM77-1 (S1 S2 S3 S4 S5 S6 S7).
157600 PFM-J-F4-16.
157700     ADD     1  TO PFM-7-TOT.
157800 PFM-DELETE-F4-16.
157900     PERFORM DE-LETE.
158000     PERFORM PRINT-DETAIL.
158100     GO TO   PFM-INIT-F4-17.
158200 PFM-TEST-F4-16-1.
158300     IF      PFM77-1 (1 1 1 1 1 1 1) NOT = "*"
158400             MOVE    PFM77-1 (1 1 1 1 1 1 1) TO COMPUTED-A
158500             MOVE   "*" TO CORRECT-A
158600             PERFORM FAIL
158700             PERFORM PRINT-DETAIL
158800     ELSE
158900             PERFORM PASS
159000             PERFORM PRINT-DETAIL.
159100     ADD     1 TO REC-CT.
159200 PFM-TEST-F4-16-2.
159300     IF      PFM77-1 (1 1 1 1 1 1 2) NOT = "*"
159400             MOVE    PFM77-1 (1 1 1 1 1 1 2) TO COMPUTED-A
159500             MOVE   "*" TO CORRECT-A
159600             PERFORM FAIL
159700             PERFORM PRINT-DETAIL
159800     ELSE
159900             PERFORM PASS
160000             PERFORM PRINT-DETAIL.
160100     ADD     1 TO REC-CT.
160200 PFM-TEST-F4-16-3.
160300     IF      PFM77-1 (1 1 1 1 1 2 1) NOT = "*"
160400             MOVE    PFM77-1 (1 1 1 1 1 2 1) TO COMPUTED-A
160500             MOVE   "*" TO CORRECT-A
160600             PERFORM FAIL
160700             PERFORM PRINT-DETAIL
160800     ELSE
160900             PERFORM PASS
161000             PERFORM PRINT-DETAIL.
161100     ADD     1 TO REC-CT.
161200 PFM-TEST-F4-16-4.
161300     IF      PFM77-1 (1 1 1 1 1 2 2) NOT = "*"
161400             MOVE    PFM77-1 (1 1 1 1 1 2 2) TO COMPUTED-A
161500             MOVE   "*" TO CORRECT-A
161600             PERFORM FAIL
161700             PERFORM PRINT-DETAIL
161800     ELSE
161900             PERFORM PASS
162000             PERFORM PRINT-DETAIL.
162100     ADD     1 TO REC-CT.
162200 PFM-TEST-F4-16-5.
162300     IF      PFM77-1 (1 1 1 1 2 1 1) NOT = "*"
162400             MOVE    PFM77-1 (1 1 1 1 2 1 1) TO COMPUTED-A
162500             MOVE   "*" TO CORRECT-A
162600             PERFORM FAIL
162700             PERFORM PRINT-DETAIL
162800     ELSE
162900             PERFORM PASS
163000             PERFORM PRINT-DETAIL.
163100     ADD     1 TO REC-CT.
163200 PFM-TEST-F4-16-6.
163300     IF      PFM77-1 (1 1 1 1 2 1 2) NOT = "*"
163400             MOVE    PFM77-1 (1 1 1 1 2 1 2) TO COMPUTED-A
163500             MOVE   "*" TO CORRECT-A
163600             PERFORM FAIL
163700             PERFORM PRINT-DETAIL
163800     ELSE
163900             PERFORM PASS
164000             PERFORM PRINT-DETAIL.
164100     ADD     1 TO REC-CT.
164200 PFM-TEST-F4-16-7.
164300     IF      PFM77-1 (1 1 1 2 1 1 1) NOT = "*"
164400             MOVE    PFM77-1 (1 1 1 2 1 1 1) TO COMPUTED-A
164500             MOVE   "*" TO CORRECT-A
164600             PERFORM FAIL
164700             PERFORM PRINT-DETAIL
164800     ELSE
164900             PERFORM PASS
165000             PERFORM PRINT-DETAIL.
165100     ADD     1 TO REC-CT.
165200 PFM-TEST-F4-16-9.
165300     IF      PFM77-1 (1 1 1 2 1 1 2) NOT = "*"
165400             MOVE    PFM77-1 (1 1 1 2 1 1 2) TO COMPUTED-A
165500             MOVE   "*" TO CORRECT-A
165600             PERFORM FAIL
165700             PERFORM PRINT-DETAIL
165800     ELSE
165900             PERFORM PASS
166000             PERFORM PRINT-DETAIL.
166100     ADD     1 TO REC-CT.
166200 PFM-TEST-F4-16-10.
166300     IF      PFM-7-TOT NOT = 128
166400             MOVE    PFM-7-TOT TO COMPUTED-18V0
166500             MOVE    128 TO CORRECT-18V0
166600             PERFORM FAIL
166700             PERFORM PRINT-DETAIL
166800     ELSE
166900             PERFORM PASS
167000             PERFORM PRINT-DETAIL.
167100*
167200 PFM-INIT-F4-17.
167300*    ===-->  6 AFTER PHRASES          <--===
167400*    ===--> "WITH TEST BEFORE" PHRASE <--===
167500     MOVE   "PFM-TEST-F4-17"           TO PAR-NAME.
167600     MOVE   "VI-114 6.20.4 GR10(d)2" TO ANSI-REFERENCE.
167700     MOVE    SPACES TO PERFORM-SEVEN-LEVEL-TABLE.
167800     MOVE    101 TO COUNT-DU-6V0.
167900     MOVE    0   TO PFM-7-TOT.
168000     MOVE    1 TO REC-CT.
168100*    NOTE IN THIS TEST SEVEN SUBSCRIPTS ARE VARIED.
168200 PFM-TEST-F4-17-0.
168300     PERFORM PFM-I-F4-17 THRU PFM-J-F4-17 WITH TEST BEFORE
168400             VARYING S1 FROM 1 BY 1
168500               UNTIL COUNT-DU-6V0 > 100
168600               AFTER S2 FROM 1 BY 1
168700               UNTIL COUNT-DU-6V0 > 100
168800               AFTER S3 FROM 1 BY 1
168900               UNTIL COUNT-DU-6V0 > 100
169000               AFTER S4 FROM 1 BY 1
169100               UNTIL COUNT-DU-6V0 > 100
169200               AFTER S5 FROM 1 BY 1
169300               UNTIL COUNT-DU-6V0 > 100
169400               AFTER S6 FROM 1 BY 1
169500               UNTIL COUNT-DU-6V0 > 100
169600               AFTER S7 FROM 1 BY 1
169700               UNTIL COUNT-DU-6V0 > 100.
169800     GO TO   PFM-TEST-F4-17-1.
169900 PFM-I-F4-17.
170000     MOVE   "*" TO PFM77-1 (S1 S2 S3 S4 S5 S6 S7).
170100 PFM-J-F4-17.
170200     ADD     1  TO PFM-7-TOT.
170300 PFM-DELETE-F4-17.
170400     PERFORM DE-LETE.
170500     PERFORM PRINT-DETAIL.
170600     GO TO   PFM-INIT-F4-18.
170700 PFM-TEST-F4-17-1.
170800     IF      PFM77-1 (1 1 1 1 1 1 1) NOT = SPACE
170900             MOVE    PFM77-1 (1 1 1 1 1 1 1) TO COMPUTED-A
171000             MOVE    SPACE TO CORRECT-A
171100             PERFORM FAIL
171200             PERFORM PRINT-DETAIL
171300     ELSE
171400             PERFORM PASS
171500             PERFORM PRINT-DETAIL.
171600     ADD     1 TO REC-CT.
171700 PFM-TEST-F4-17-2.
171800     IF      PFM77-1 (1 1 1 1 1 1 2) NOT = SPACE
171900             MOVE    PFM77-1 (1 1 1 1 1 1 2) TO COMPUTED-A
172000             MOVE    SPACE TO CORRECT-A
172100             PERFORM FAIL
172200             PERFORM PRINT-DETAIL
172300     ELSE
172400             PERFORM PASS
172500             PERFORM PRINT-DETAIL.
172600     ADD     1 TO REC-CT.
172700 PFM-TEST-F4-17-3.
172800     IF      PFM77-1 (1 1 1 1 1 2 1) NOT = SPACE
172900             MOVE    PFM77-1 (1 1 1 1 1 2 1) TO COMPUTED-A
173000             MOVE    SPACE TO CORRECT-A
173100             PERFORM FAIL
173200             PERFORM PRINT-DETAIL
173300     ELSE
173400             PERFORM PASS
173500             PERFORM PRINT-DETAIL.
173600     ADD     1 TO REC-CT.
173700 PFM-TEST-F4-17-4.
173800     IF      PFM77-1 (1 1 1 1 1 2 2) NOT = SPACE
173900             MOVE    PFM77-1 (1 1 1 1 1 2 2) TO COMPUTED-A
174000             MOVE    SPACE TO CORRECT-A
174100             PERFORM FAIL
174200             PERFORM PRINT-DETAIL
174300     ELSE
174400             PERFORM PASS
174500             PERFORM PRINT-DETAIL.
174600     ADD     1 TO REC-CT.
174700 PFM-TEST-F4-17-5.
174800     IF      PFM77-1 (1 1 1 1 2 1 1) NOT = SPACE
174900             MOVE    PFM77-1 (1 1 1 1 2 1 1) TO COMPUTED-A
175000             MOVE    SPACE TO CORRECT-A
175100             PERFORM FAIL
175200             PERFORM PRINT-DETAIL
175300     ELSE
175400             PERFORM PASS
175500             PERFORM PRINT-DETAIL.
175600     ADD     1 TO REC-CT.
175700 PFM-TEST-F4-17-6.
175800     IF      PFM77-1 (1 1 1 1 2 1 2) NOT = SPACE
175900             MOVE    PFM77-1 (1 1 1 1 2 1 2) TO COMPUTED-A
176000             MOVE    SPACE TO CORRECT-A
176100             PERFORM FAIL
176200             PERFORM PRINT-DETAIL
176300     ELSE
176400             PERFORM PASS
176500             PERFORM PRINT-DETAIL.
176600     ADD     1 TO REC-CT.
176700 PFM-TEST-F4-17-7.
176800     IF      PFM77-1 (1 1 1 2 1 1 1) NOT = SPACE
176900             MOVE    PFM77-1 (1 1 1 2 1 1 1) TO COMPUTED-A
177000             MOVE    SPACE TO CORRECT-A
177100             PERFORM FAIL
177200             PERFORM PRINT-DETAIL
177300     ELSE
177400             PERFORM PASS
177500             PERFORM PRINT-DETAIL.
177600     ADD     1 TO REC-CT.
177700 PFM-TEST-F4-17-8.
177800     IF      PFM77-1 (1 1 1 2 1 1 2) NOT = SPACE
177900             MOVE    PFM77-1 (1 1 1 2 1 1 2) TO COMPUTED-A
178000             MOVE    SPACE TO CORRECT-A
178100             PERFORM FAIL
178200             PERFORM PRINT-DETAIL
178300     ELSE
178400             PERFORM PASS
178500             PERFORM PRINT-DETAIL.
178600     ADD     1 TO REC-CT.
178700 PFM-TEST-F4-17-9.
178800     IF      PFM-7-TOT NOT = ZERO
178900             MOVE    PFM-7-TOT TO COMPUTED-18V0
179000             MOVE    ZERO TO CORRECT-18V0
179100             PERFORM FAIL
179200             PERFORM PRINT-DETAIL
179300     ELSE
179400             PERFORM PASS
179500             PERFORM PRINT-DETAIL.
179600*
179700 PFM-INIT-F4-18.
179800*    ===-->  6 AFTER PHRASES          <--===
179900*    ===-->  TEST AFTER" PHRASE       <--===
180000     MOVE   "PFM-TEST-F4-18"           TO PAR-NAME.
180100     MOVE   "VI-119 6.20.4 GR10(d)2" TO ANSI-REFERENCE.
180200     MOVE    SPACES TO PERFORM-SEVEN-LEVEL-TABLE.
180300     MOVE    0 TO COUNT-DU-6V0.
180400     MOVE    0 TO PFM-7-TOT.
180500     MOVE    1 TO REC-CT.
180600*    NOTE IN THIS TEST SEVEN SUBSCRIPTS ARE VARIED.
180700 PFM-TEST-F4-18-0.
180800     PERFORM PFM-I-F4-18 THRU PFM-J-F4-18 TEST AFTER
180900             VARYING S1 FROM 1 BY 1
181000               UNTIL COUNT-DU-6V0 > 100
181100               AFTER S2 FROM 1 BY 1
181200               UNTIL COUNT-DU-6V0 > 100
181300               AFTER S3 FROM 1 BY 1
181400               UNTIL COUNT-DU-6V0 > 100
181500               AFTER S4 FROM 1 BY 1
181600               UNTIL COUNT-DU-6V0 > 100
181700               AFTER S5 FROM 1 BY 1
181800               UNTIL COUNT-DU-6V0 > 100
181900               AFTER S6 FROM 1 BY 1
182000               UNTIL COUNT-DU-6V0 > 100
182100               AFTER S7 FROM 1 BY 1
182200               UNTIL COUNT-DU-6V0 > 100.
182300     GO TO   PFM-TEST-F4-18-1.
182400 PFM-I-F4-18.
182500     MOVE   "*" TO PFM77-1 (S1 S2 S3 S4 S5 S6 S7).
182600     MOVE    101 TO COUNT-DU-6V0.
182700 PFM-J-F4-18.
182800     ADD     1  TO PFM-7-TOT.
182900 PFM-DELETE-F4-18.
183000     PERFORM DE-LETE.
183100     PERFORM PRINT-DETAIL.
183200     GO TO   PFM-INIT-F4-20.
183300 PFM-TEST-F4-18-1.
183400     IF      PFM77-1 (1 1 1 1 1 1 1) NOT = "*"
183500             MOVE    PFM77-1 (1 1 1 1 1 1 1) TO COMPUTED-A
183600             MOVE   "*"  TO CORRECT-A
183700             PERFORM FAIL
183800             PERFORM PRINT-DETAIL
183900     ELSE
184000             PERFORM PASS
184100             PERFORM PRINT-DETAIL.
184200     ADD     1 TO REC-CT.
184300 PFM-TEST-F4-18-2.
184400     IF      PFM77-1 (1 1 1 1 1 1 2) NOT = SPACE
184500             MOVE    PFM77-1 (1 1 1 1 1 1 2) TO COMPUTED-A
184600             MOVE    SPACE TO CORRECT-A
184700             PERFORM FAIL
184800             PERFORM PRINT-DETAIL
184900     ELSE
185000             PERFORM PASS
185100             PERFORM PRINT-DETAIL.
185200     ADD     1 TO REC-CT.
185300 PFM-TEST-F4-18-3.
185400     IF      PFM77-1 (1 1 1 1 1 2 1) NOT = SPACE
185500             MOVE    PFM77-1 (1 1 1 1 1 2 1) TO COMPUTED-A
185600             MOVE    SPACE TO CORRECT-A
185700             PERFORM FAIL
185800             PERFORM PRINT-DETAIL
185900     ELSE
186000             PERFORM PASS
186100             PERFORM PRINT-DETAIL.
186200     ADD     1 TO REC-CT.
186300 PFM-TEST-F4-18-4.
186400     IF      PFM77-1 (1 1 1 1 1 2 2) NOT = SPACE
186500             MOVE    PFM77-1 (1 1 1 1 1 2 2) TO COMPUTED-A
186600             MOVE    SPACE TO CORRECT-A
186700             PERFORM FAIL
186800             PERFORM PRINT-DETAIL
186900     ELSE
187000             PERFORM PASS
187100             PERFORM PRINT-DETAIL.
187200     ADD     1 TO REC-CT.
187300 PFM-TEST-F4-18-5.
187400     IF      PFM77-1 (1 1 1 1 2 1 1) NOT = SPACE
187500             MOVE    PFM77-1 (1 1 1 1 2 1 1) TO COMPUTED-A
187600             MOVE    SPACE TO CORRECT-A
187700             PERFORM FAIL
187800             PERFORM PRINT-DETAIL
187900     ELSE
188000             PERFORM PASS
188100             PERFORM PRINT-DETAIL.
188200     ADD     1 TO REC-CT.
188300 PFM-TEST-F4-18-6.
188400     IF      PFM77-1 (1 1 1 1 2 1 2) NOT = SPACE
188500             MOVE    PFM77-1 (1 1 1 1 2 1 2) TO COMPUTED-A
188600             MOVE    SPACE TO CORRECT-A
188700             PERFORM FAIL
188800             PERFORM PRINT-DETAIL
188900     ELSE
189000             PERFORM PASS
189100             PERFORM PRINT-DETAIL.
189200     ADD     1 TO REC-CT.
189300 PFM-TEST-F4-18-7.
189400     IF      PFM77-1 (1 1 1 2 1 1 1) NOT = SPACE
189500             MOVE    PFM77-1 (1 1 1 2 1 1 1) TO COMPUTED-A
189600             MOVE    SPACE TO CORRECT-A
189700             MOVE   "PFM-TEST-F4-18-8" TO PAR-NAME
189800             PERFORM FAIL
189900             PERFORM PRINT-DETAIL
190000     ELSE
190100             PERFORM PASS
190200             PERFORM PRINT-DETAIL.
190300     ADD     1 TO REC-CT.
190400 PFM-TEST-F4-18-8.
190500     IF      PFM77-1 (1 1 1 2 1 1 2) NOT = SPACE
190600             MOVE    PFM77-1 (1 1 1 2 1 1 2) TO COMPUTED-A
190700             MOVE    SPACE TO CORRECT-A
190800             PERFORM FAIL
190900             PERFORM PRINT-DETAIL
191000     ELSE
191100             PERFORM PASS
191200             PERFORM PRINT-DETAIL.
191300     ADD     1 TO REC-CT.
191400 PFM-TEST-F4-18-9.
191500     IF      PFM-7-TOT NOT = 1
191600             MOVE    PFM-7-TOT TO COMPUTED-18V0
191700             MOVE    1  TO CORRECT-18V0
191800             PERFORM FAIL
191900             PERFORM PRINT-DETAIL
192000     ELSE
192100             PERFORM PASS
192200             PERFORM PRINT-DETAIL.
192300*
192400*
192500 PFM-INIT-F4-20.
192600     MOVE   "VI-112 6.20.4 GR10(d)" TO ANSI-REFERENCE
192700     MOVE   "PFM-TEST-F4-20"        TO PAR-NAME.
192800     MOVE    SPACES TO PERFORM-SEVEN-LEVEL-TABLE.
192900     MOVE   "VARYING BY FRAC." TO FEATURE.
193000     MOVE   "PERFORM VARYING"  TO RE-MARK.
193100     MOVE    ZERO TO COUNT-DU-6V0.
193200     MOVE    ZERO TO REC-CT.
193300 PFM-TEST-F4-20-0.
193400     PERFORM PFM-LOOP-F4-20 THROUGH PFM-LOOP-F4-20-EXIT
193500     VARYING WRK-DU-2V1-1
193600        FROM WRK-DU-0V1-1 BY .1
193700       UNTIL WRK-DU-2V1-1 + WRK-DU-2V1-3 > 12.1.
193800     GO TO   PFM-TEST-F4-20-1.
193900 PFM-DELETE-F4-20.
194000     PERFORM DE-LETE.
194100     PERFORM PRINT-DETAIL.
194200     GO      TO PFM-INIT-F4-21.
194300 PFM-LOOP-F4-20.
194400     ADD     1 TO COUNT-DU-6V0.
194500 PFM-LOOP-F4-20-EXIT.
194600     EXIT.
194700 PFM-TEST-F4-20-1.
194800     IF      COUNT-DU-6V0 = 10
194900             PERFORM PASS
195000             PERFORM PRINT-DETAIL
195100     ELSE
195200             PERFORM FAIL
195300             MOVE    COUNT-DU-6V0 TO COMPUTED-N
195400             MOVE    10 TO CORRECT-N
195500             PERFORM PRINT-DETAIL.
195600*
195700 PFM-INIT-F4-21.
195800     MOVE   "VI-112 6.20.4 GR10(d)" TO ANSI-REFERENCE
195900     MOVE   "PFM-TEST-F4-21"        TO PAR-NAME.
196000     MOVE   "CHANGE BY INCR." TO FEATURE.
196100     MOVE   "PERFORM VARYING" TO RE-MARK.
196200     MOVE    ZERO TO COUNT-DU-6V0.
196300 PFM-TEST-F4-21-0.
196400     PERFORM LOOP-FOR-F4-21 THRU LOOP-F4-21-EXIT
196500     VARYING WRK-DU-2V1-1 FROM WRK-DU-0V1-1 BY WRK-DU-2V1-2
196600       UNTIL WRK-DU-2V1-1 + 11.1 > 12.1.
196700     GO TO   PFM-TEST-F4-21-1.
196800 PFM-DELETE-F4-21.
196900     PERFORM DE-LETE.
197000     PERFORM PRINT-DETAIL.
197100     GO TO   PFM-INIT-F4-22.
197200 LOOP-FOR-F4-21.
197300     ADD    1 TO COUNT-DU-6V0.
197400     ADD   .1 TO WRK-DU-2V1-2.
197500 LOOP-F4-21-EXIT.
197600     EXIT.
197700 PFM-TEST-F4-21-1.
197800     IF      COUNT-DU-6V0 = 4
197900             PERFORM PASS
198000             PERFORM PRINT-DETAIL
198100     ELSE
198200             PERFORM FAIL
198300             MOVE    COUNT-DU-6V0 TO COMPUTED-N
198400             MOVE    4 TO CORRECT-N
198500             PERFORM PRINT-DETAIL.
198600*
198700 PFM-INIT-F4-22.
198800*    ===-->  EXPLICIT SCOPE TERMINATOR <--===
198900     MOVE   "VI-110 6.20.4 GR5" TO ANSI-REFERENCE.
199000     MOVE   "PFM-TEST-F4-22"    TO PAR-NAME.
199100     MOVE   "CHANGE BY INCR."   TO FEATURE.
199200     MOVE   "PERFORM VARYING"   TO RE-MARK.
199300     MOVE    44 TO PFM-12-ANS1.
199400     MOVE    46 TO PFM-12-ANS2.
199500*    NOTE  THIS PROGRAM TESTS THE ABILITY OF THE COMPILER TO
199600*        PERFORM A STATEMENT WITH A VARYING CLAUSE INCLUDED.
199700 PFM-TEST-F4-22-0.
199800     PERFORM VARYING PFM-12-COUNTER FROM 100 BY 4
199900       UNTIL PFM-12-COUNTER NOT GREATER THAN 15
200000         AND PFM-12-ANS1 LESS THAN PFM-12-ANS2
200100          OR PFM-12-ANS2 GREATER THAN 50
200200             ADD      1   TO PFM-12-ANS2
200300             SUBTRACT 2 FROM PFM-12-ANS1
200400             IF       PFM-12-ANS2 GREATER THAN OR EQUAL TO
200500                      PFM-12-ANS1
200600                      DIVIDE PFM-12-COUNTER BY 2
200700                      GIVING PFM-12-COUNTER
200800                      IF       PFM-12-COUNTER LESS THAN 36
200900                               SUBTRACT 4 FROM PFM-12-COUNTER
201000                      END-IF
201100             END-IF
201200     END-PERFORM.
201300     GO TO   PFM-TEST-F4-22-1.
201400 PFM-DELETE-F4-22.
201500     PERFORM DE-LETE.
201600     GO TO   PFM-WRITE-F4-22.
201700 PFM-TEST-F4-22-1.
201800     IF      PFM-12-COUNTER EQUAL TO 13
201900             PERFORM PASS
202000             GO TO   PFM-WRITE-F4-22.
202100     PERFORM FAIL.
202200     MOVE    PFM-12-COUNTER TO COMPUTED-A.
202300     MOVE   "13" TO CORRECT-A.
202400 PFM-WRITE-F4-22.
202500     MOVE   "PFM-TEST-F4-22" TO PAR-NAME.
202600     PERFORM PRINT-DETAIL.
202700*
202800*
202900 PFM-INIT-F4-23.
203000*    ===-->  ORDER OF INITIALISATION   <--===
203100*    ===-->  OF VARYING IDENTIFIERS.   <--===
203200     MOVE   "VI-114 6.20.4 GR10(d)1" TO ANSI-REFERENCE.
203300     MOVE   "PFM-TEST-F4-23"         TO PAR-NAME.
203400     MOVE    SPACES TO PERFORM-SEVEN-LEVEL-TABLE.
203500     MOVE    0 TO PFM-F4-23-TOT.
203600 PFM-TEST-F4-23-0.
203700     PERFORM PFM-F4-23-PROC
203800             VARYING PFM-A1 FROM 1 BY 1
203900               UNTIL PFM-A1 > 3
204000               AFTER PFM-B1 FROM PFM-A1 BY 1
204100               UNTIL PFM-B1 > 3.
204200     GO TO   PFM-TEST-F4-23-1.
204300 PFM-DELETE-F4-23.
204400     PERFORM DE-LETE.
204500     PERFORM PRINT-DETAIL.
204600     GO TO   PFM-INIT-F4-24.
204700 PFM-F4-23-PROC.
204800     ADD     1 TO PFM-F4-23-TOT.
204900 PFM-TEST-F4-23-1.
205000     IF      PFM-F4-23-TOT = 6
205100             PERFORM PASS
205200             PERFORM PRINT-DETAIL
205300     ELSE
205400             MOVE    6      TO CORRECT-18V0
205500             MOVE    PFM-F4-23-TOT TO COMPUTED-18V0
205600             PERFORM FAIL
205700             PERFORM PRINT-DETAIL.
205800     MOVE 2 TO PERFORM9.
205900     MOVE 2 TO PERFORM10.
206000*
206100 PFM-INIT-F4-24.
206200*    ===-->  MANIPULATING SUBSCRIPTS   <--===
206300     MOVE   "VI-112 6.20.4 GR10(d)" TO ANSI-REFERENCE.
206400     MOVE   "PFM-TEST-F4-24"        TO PAR-NAME.
206500     INITIALIZE FILLER-A.
206600     MOVE    1  TO S1 S2 S3.
206700     MOVE    10 TO PFM-F4-24-B (1) MOVE 20  TO PFM-F4-24-B (2).
206800     MOVE    30 TO PFM-F4-24-B (3) MOVE 40  TO PFM-F4-24-B (4).
206900     MOVE    50 TO PFM-F4-24-B (5) MOVE 60  TO PFM-F4-24-B (6).
207000     MOVE    70 TO PFM-F4-24-B (7) MOVE 80  TO PFM-F4-24-B (8).
207100     MOVE    90 TO PFM-F4-24-B (9) MOVE 100 TO PFM-F4-24-B (10).
207200     MOVE    10 TO PFM-F4-24-C (1) MOVE 20  TO PFM-F4-24-C (2).
207300     MOVE    30 TO PFM-F4-24-C (3) MOVE 40  TO PFM-F4-24-C (4).
207400     MOVE    50 TO PFM-F4-24-C (5) MOVE 60  TO PFM-F4-24-C (6).
207500     MOVE    70 TO PFM-F4-24-C (7) MOVE 80  TO PFM-F4-24-C (8).
207600     MOVE    90 TO PFM-F4-24-C (9) MOVE 100 TO PFM-F4-24-C (10).
207700     MOVE    0 TO PERFORM18.
207800 PFM-TEST-F4-24-0.
207900     PERFORM PFM-A-F4-24
208000             VARYING PFM-F4-24-A (S1)
208100                FROM 10
208200                  BY PFM-F4-24-C (S2)
208300               UNTIL PFM-F4-24-A (S1) > 70.
208400 PFM-TEST-F4-24-1.
208500     IF      PFM-F4-24-A (S1) EQUAL TO 80
208600             PERFORM PASS GO TO PFM-WRITE-F4-24-1.
208700     PERFORM FAIL.
208800     MOVE    PFM-F4-24-A (S1) TO COMPUTED-N.
208900     MOVE    80  TO CORRECT-N.
209000     GO TO   PFM-WRITE-F4-24-1.
209100 PFM-DELETE-F4-24-1.
209200     PERFORM DE-LETE.
209300     GO      TO PFM-WRITE-F4-24-1.
209400 PFM-A-F4-24.
209500     ADD     1 TO PERFORM18.
209600     MULTIPLY 2 BY S2.
209700     ADD     1 TO S1 S3.
209800 PFM-WRITE-F4-24-1.
209900     MOVE   "PFM-TEST-F4-24" TO PAR-NAME.
210000     PERFORM PRINT-DETAIL.
210100 PFM-TEST-F4-24-2.
210200     IF      S1 EQUAL TO 4
210300             PERFORM PASS GO TO PFM-WRITE-F4-24-2.
210400     PERFORM FAIL.
210500     MOVE    S1  TO COMPUTED-N.
210600     MOVE    4   TO CORRECT-N.
210700     GO TO   PFM-WRITE-F4-24-2.
210800 PFM-DELETE-F4-24-2.
210900     PERFORM DE-LETE.
211000     GO      TO PFM-WRITE-F4-24-2.
211100 PFM-A-F4-24-2.
211200     ADD     1 TO PERFORM18.
211300     MULTIPLY 2 BY S2.
211400     ADD     1 TO S1 S3.
211500 PFM-WRITE-F4-24-2.
211600     MOVE   "PFM-TEST-F4-24" TO PAR-NAME.
211700     PERFORM PRINT-DETAIL.
211800 CCVS-EXIT SECTION.
211900 CCVS-999999.
212000     GO TO CLOSE-FILES.
