000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC203A.
000400*
000500****************************************************************
000600*                                                              *
000700*    VALIDATION FOR:-                                          *
000800*                                                              *
000900*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
001000*                                                              *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-82  - SOURCE COMPUTER NAME.                         *
001900*        X-83  - OBJECT COMPUTER NAME.                         *
002000*                                                              *
002100****************************************************************
002200*    THIS PROGRAM TESTS FORMAT 4 OF THE DIVIDE STATEMENT.      *
002300*
002400****************************************************************
002500*    THIS COMMENT ENTRY SHOULD APPEAR AS THE LAST LINE BEFORE
002600*    THE ENVIRONMENT DIVISION.
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 01  WS-REMAINDERS.
004400   03  WS-REM                    PIC 99 OCCURS 20.
004500 01  WRK-XN-00001-1              PIC X.
004600 01  WRK-XN-00001-2              PIC X.
004700 01  WS-46.
004800   03  WS-1-20                   PIC X(20).
004900   03  WS-21-40                  PIC X(20).
005000   03  WS-41-46                  PIC X(6).
005100 77  11A                PICTURE 9999  VALUE 9.
005200 77  11B   PICTURE 99; VALUE 8.
005300 77  1111C PICTURE 99 VALUE 9.
005400 77  WRK-DS-02V00                 PICTURE S99.
005500     88 TEST-2NUC-COND-99         VALUE 99.
005600 77  A99-DS-02V00                 PICTURE S99    VALUE 99.
005700 77  WRK-DS-18V00                 PICTURE S9(18).
005800 77  A18ONES-DS-18V00             PICTURE S9(18)
005900                                  VALUE 111111111111111111.
006000 77  A18TWOS-DS-18V00             PICTURE S9(18)
006100                                  VALUE 222222222222222222.
006200 77  WRK-DS-05V00                 PICTURE S9(5).
006300 77  A02TWOS-DU-02V00             PICTURE 99     VALUE 22.
006400 77  A02TWOS-DS-03V02             PICTURE S999V99 VALUE +022.00.
006500 77  ATWO-DS-01V00                PICTURE S9     VALUE 2.
006600 77  AZERO-DS-05V05               PICTURE S9(5)V9(5) VALUE ZERO.
006700 77  WRK-DS-06V06                 PICTURE S9(6)V9(6).
006800 77  WRK-DS-0201P                 PICTURE S99P.
006900 77  A05ONES-DS-05V00             PICTURE S9(5)  VALUE 11111.
007000 77  WRK-DS-09V00                 PICTURE S9(9).
007100 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
007200 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09
007300                                  PICTURE S9(18).
007400 77  XRAY                    PICTURE IS X.
007500 77  W-1                     PICTURE IS 9.
007600 77  W-2                     PICTURE IS 99.
007700 77  W-3                     PICTURE IS 999.
007800 77  W-5                PICTURE 99  VALUE ZERO.
007900 77  W-9                     PICTURE 999.
008000 77  W-11               PICTURE S99V9.
008100 77  D-1                PICTURE S9V99  VALUE 1.06.
008200 77  D-7                PICTURE S99V99  VALUE 1.09.
008300 77  ONE                     PICTURE IS 9      VALUE IS 1.
008400 77  TWO                     PICTURE IS S9     VALUE IS 2.
008500 77  THREE                   PICTURE IS S9     VALUE IS 3.
008600 77  FOUR                    PICTURE IS S9     VALUE IS 4.
008700 77  FIVE                    PICTURE IS S9     VALUE IS 5.
008800 77  SIX                     PICTURE IS S9     VALUE IS 6.
008900 77  SEVEN                   PICTURE IS S9     VALUE IS 7.
009000 77  EIGHT                   PICTURE IS 9      VALUE IS 8.
009100 77  NINE                    PICTURE IS S9     VALUE IS 9.
009200 77  TEN                     PICTURE IS S99    VALUE IS 10.
009300 77  FIFTEEN                 PICTURE IS S99    VALUE IS 15.
009400 77  TWENTY                  PICTURE IS S99    VALUE IS 20.
009500 77  TWENTY-5                PICTURE IS S99    VALUE IS 25.
009600 77  25COUNT PICTURE 999 VALUE ZERO.
009700 77  25ANS PICTURE  99 VALUE ZERO.
009800 77  25REM PICTURE 99 VALUE ZERO.
009900 77  DIV-30-Y1 PICTURE 999 USAGE COMP SYNC RIGHT VALUE 31.
010000 77  DIV-30-Y2 PICTURE 999 USAGE COMP VALUE 54.
010100 77  DIV-30-Y3 PICTURE 999 VALUE 151.
010200 77  DIV-30-Y4         PICTURE 9(4) SYNC RIGHT VALUE 1010.
010300 77  DIV-Z1-30 PICTURE 999 USAGE COMP VALUE ZERO.
010400 77  DIV-Z2-30 PICTURE 999 SYNC RIGHT VALUE ZERO.
010500 77  DIV-Z3-30 PICTURE 999 USAGE COMP SYNC RIGHT VALUE ZERO.
010600 77  DIV-Z4-30 PICTURE 999 VALUE ZERO.
010700 77  DIV-30-A1 PICTURE 999 SYNC RIGHT VALUE ZERO.
010800 77  DIV-30-A2 PICTURE 999 VALUE ZERO.
010900 77  DIV-30-A3 PICTURE 999 USAGE COMP SYNC RIGHT VALUE ZERO.
011000 77  DIV-30-A4 PICTURE 999 USAGE COMP VALUE ZERO.
011100 01  DIV-ENTRIES.
011200     02 DIV11                PICTURE 999       VALUE 105.
011300     02 DIV12                PICTURE 9999      VALUE 1000.
011400     02 DIV13                PICTURE 999.
011500     02 DIV14                PICTURE 99.
011600     02 DIV15                PICTURE 9V9       VALUE 1.1.
011700     02 DIV16                PICTURE 99V99     VALUE 89.10.
011800     02 DIV17                PICTURE 99V99.
011900     02 DIV18                PICTURE 9999.
012000     02 DIV19                PICTURE 99        VALUE 14.
012100     02 DIV20                PICTURE 9999      VALUE 2147.
012200     02 DIV21                PICTURE 999.
012300     02 DIV22                     PICTURE 99.
012400 01  WRK-DU-1V17-1                PIC 9V9(17).
012500 01  WRK-DU-1V5-1                 PIC 9V9(5).
012600 01  WRK-DU-2V1-1                 PIC 99V9.
012700 01  WRK-DU-05V00-0001            PIC 9(5).
012800 01  WRK-DS-05V00-0002            PIC S9(5).
012900 01  WRK-CS-05V00-0003            PIC S9(5) COMP.
013000 01  WRK-DU-04V02-0004            PIC 9(4)V9(2).
013100 01  WRK-DS-04V01-0005            PIC S9(4)V9.
013200 01  WRK-NE-1                     PIC .9999/99999,99999,99.
013300 01  NE-0008                      PIC $9(4).99-.
013400 01  NE-0009                      PIC ***99.
013500 01  NE-04V01-0006     PIC ****.9.
013600 01  GRP-0010.
013700     02 WRK-DU-03V00-L-0011       PIC 9(03) SYNC LEFT.
013800     02 WRK-O005F-0012        OCCURS   5  TIMES.
013900        03 WRK-O003F-0013     OCCURS   3  TIMES.
014000           05 WRK-DS-03V04-O003F-0014 PIC S9(3)V9999
014100                                            OCCURS 3 TIMES.
014200 01  DS-02V00-0001                PIC S99  VALUE  16.
014300 01  DS-03V00-0002                PIC S999 VALUE  174.
014400 01  CS-05V00-0003                PIC S9(5) COMP  VALUE 10.
014500 01    TA--X           PIC 9(5)  COMP VALUE ZERO.
014600 01  MINUS-NAMES.
014700     02  WHOLE-FIELD              PICTURE S9(18).
014800     02  PLUS-NAME1  PICTURE S9(18) VALUE +333333333333333333.
014900     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
015000     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
015100     02  ALPHA-LIT                PICTURE X(5)  VALUE SPACE.
015200     02  SNEG-LIT2                PICTURE S9(5)  VALUE -70718.
015300 01  TEST-RESULTS.
015400     02 FILLER                   PIC X      VALUE SPACE.
015500     02 FEATURE                  PIC X(20)  VALUE SPACE.
015600     02 FILLER                   PIC X      VALUE SPACE.
015700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
015800     02 FILLER                   PIC X      VALUE SPACE.
015900     02  PAR-NAME.
016000       03 FILLER                 PIC X(19)  VALUE SPACE.
016100       03  PARDOT-X              PIC X      VALUE SPACE.
016200       03 DOTVALUE               PIC 99     VALUE ZERO.
016300     02 FILLER                   PIC X(8)   VALUE SPACE.
016400     02 RE-MARK                  PIC X(61).
016500 01  TEST-COMPUTED.
016600     02 FILLER                   PIC X(30)  VALUE SPACE.
016700     02 FILLER                   PIC X(17)  VALUE
016800            "       COMPUTED=".
016900     02 COMPUTED-X.
017000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
017100     03 COMPUTED-N               REDEFINES COMPUTED-A
017200                                 PIC -9(9).9(9).
017300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
017400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
017500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
017600     03       CM-18V0 REDEFINES COMPUTED-A.
017700         04 COMPUTED-18V0                    PIC -9(18).
017800         04 FILLER                           PIC X.
017900     03 FILLER PIC X(50) VALUE SPACE.
018000 01  TEST-CORRECT.
018100     02 FILLER PIC X(30) VALUE SPACE.
018200     02 FILLER PIC X(17) VALUE "       CORRECT =".
018300     02 CORRECT-X.
018400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
018500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
018600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
018700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
018800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
018900     03      CR-18V0 REDEFINES CORRECT-A.
019000         04 CORRECT-18V0                     PIC -9(18).
019100         04 FILLER                           PIC X.
019200     03 FILLER PIC X(2) VALUE SPACE.
019300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
019400 01  CCVS-C-1.
019500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
019600-    "SS  PARAGRAPH-NAME
019700-    "       REMARKS".
019800     02 FILLER                     PIC X(20)    VALUE SPACE.
019900 01  CCVS-C-2.
020000     02 FILLER                     PIC X        VALUE SPACE.
020100     02 FILLER                     PIC X(6)     VALUE "TESTED".
020200     02 FILLER                     PIC X(15)    VALUE SPACE.
020300     02 FILLER                     PIC X(4)     VALUE "FAIL".
020400     02 FILLER                     PIC X(94)    VALUE SPACE.
020500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
020600 01  REC-CT                        PIC 99       VALUE ZERO.
020700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
020800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
020900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
021000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
021100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
021200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
021300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
021400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
021500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
021600 01  CCVS-H-1.
021700     02  FILLER                    PIC X(39)    VALUE SPACES.
021800     02  FILLER                    PIC X(42)    VALUE
021900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
022000     02  FILLER                    PIC X(39)    VALUE SPACES.
022100 01  CCVS-H-2A.
022200   02  FILLER                        PIC X(40)  VALUE SPACE.
022300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
022400   02  FILLER                        PIC XXXX   VALUE
022500     "4.2 ".
022600   02  FILLER                        PIC X(28)  VALUE
022700            " COPY - NOT FOR DISTRIBUTION".
022800   02  FILLER                        PIC X(41)  VALUE SPACE.
022900
023000 01  CCVS-H-2B.
023100   02  FILLER                        PIC X(15)  VALUE
023200            "TEST RESULT OF ".
023300   02  TEST-ID                       PIC X(9).
023400   02  FILLER                        PIC X(4)   VALUE
023500            " IN ".
023600   02  FILLER                        PIC X(12)  VALUE
023700     " HIGH       ".
023800   02  FILLER                        PIC X(22)  VALUE
023900            " LEVEL VALIDATION FOR ".
024000   02  FILLER                        PIC X(58)  VALUE
024100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024200 01  CCVS-H-3.
024300     02  FILLER                      PIC X(34)  VALUE
024400            " FOR OFFICIAL USE ONLY    ".
024500     02  FILLER                      PIC X(58)  VALUE
024600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
024700     02  FILLER                      PIC X(28)  VALUE
024800            "  COPYRIGHT   1985 ".
024900 01  CCVS-E-1.
025000     02 FILLER                       PIC X(52)  VALUE SPACE.
025100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
025200     02 ID-AGAIN                     PIC X(9).
025300     02 FILLER                       PIC X(45)  VALUE SPACES.
025400 01  CCVS-E-2.
025500     02  FILLER                      PIC X(31)  VALUE SPACE.
025600     02  FILLER                      PIC X(21)  VALUE SPACE.
025700     02 CCVS-E-2-2.
025800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
025900         03 FILLER                   PIC X      VALUE SPACE.
026000         03 ENDER-DESC               PIC X(44)  VALUE
026100            "ERRORS ENCOUNTERED".
026200 01  CCVS-E-3.
026300     02  FILLER                      PIC X(22)  VALUE
026400            " FOR OFFICIAL USE ONLY".
026500     02  FILLER                      PIC X(12)  VALUE SPACE.
026600     02  FILLER                      PIC X(58)  VALUE
026700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026800     02  FILLER                      PIC X(13)  VALUE SPACE.
026900     02 FILLER                       PIC X(15)  VALUE
027000             " COPYRIGHT 1985".
027100 01  CCVS-E-4.
027200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
027300     02 FILLER                       PIC X(4)   VALUE " OF ".
027400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
027500     02 FILLER                       PIC X(40)  VALUE
027600      "  TESTS WERE EXECUTED SUCCESSFULLY".
027700 01  XXINFO.
027800     02 FILLER                       PIC X(19)  VALUE
027900            "*** INFORMATION ***".
028000     02 INFO-TEXT.
028100       04 FILLER                     PIC X(8)   VALUE SPACE.
028200       04 XXCOMPUTED                 PIC X(20).
028300       04 FILLER                     PIC X(5)   VALUE SPACE.
028400       04 XXCORRECT                  PIC X(20).
028500     02 INF-ANSI-REFERENCE           PIC X(48).
028600 01  HYPHEN-LINE.
028700     02 FILLER  PIC IS X VALUE IS SPACE.
028800     02 FILLER  PIC IS X(65)    VALUE IS "************************
028900-    "*****************************************".
029000     02 FILLER  PIC IS X(54)    VALUE IS "************************
029100-    "******************************".
029200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
029300     "NC203A".
029400 PROCEDURE DIVISION.
029500 CCVS1 SECTION.
029600 OPEN-FILES.
029700     OPEN     OUTPUT PRINT-FILE.
029800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
029900     MOVE    SPACE TO TEST-RESULTS.
030000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
030100     GO TO CCVS1-EXIT.
030200 CLOSE-FILES.
030300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
030400 TERMINATE-CCVS.
030500S    EXIT PROGRAM.
030600STERMINATE-CALL.
030700     STOP     RUN.
030800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
030900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
031000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
031100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
031200     MOVE "****TEST DELETED****" TO RE-MARK.
031300 PRINT-DETAIL.
031400     IF REC-CT NOT EQUAL TO ZERO
031500             MOVE "." TO PARDOT-X
031600             MOVE REC-CT TO DOTVALUE.
031700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
031800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
031900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
032000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
032100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
032200     MOVE SPACE TO CORRECT-X.
032300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
032400     MOVE     SPACE TO RE-MARK.
032500 HEAD-ROUTINE.
032600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
032900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
033000 COLUMN-NAMES-ROUTINE.
033100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
033400 END-ROUTINE.
033500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
033600 END-RTN-EXIT.
033700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033800 END-ROUTINE-1.
033900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
034000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
034100      ADD PASS-COUNTER TO ERROR-HOLD.
034200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
034300      MOVE PASS-COUNTER TO CCVS-E-4-1.
034400      MOVE ERROR-HOLD TO CCVS-E-4-2.
034500      MOVE CCVS-E-4 TO CCVS-E-2-2.
034600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
034700  END-ROUTINE-12.
034800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
034900     IF       ERROR-COUNTER IS EQUAL TO ZERO
035000         MOVE "NO " TO ERROR-TOTAL
035100         ELSE
035200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
035300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
035400     PERFORM WRITE-LINE.
035500 END-ROUTINE-13.
035600     IF DELETE-COUNTER IS EQUAL TO ZERO
035700         MOVE "NO " TO ERROR-TOTAL  ELSE
035800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
035900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
036000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036100      IF   INSPECT-COUNTER EQUAL TO ZERO
036200          MOVE "NO " TO ERROR-TOTAL
036300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
036400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
036500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036700 WRITE-LINE.
036800     ADD 1 TO RECORD-COUNT.
036900Y    IF RECORD-COUNT GREATER 50
037000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
037100Y        MOVE SPACE TO DUMMY-RECORD
037200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
037300Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
037400Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
037500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
037600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
037700Y        MOVE ZERO TO RECORD-COUNT.
037800     PERFORM WRT-LN.
037900 WRT-LN.
038000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
038100     MOVE SPACE TO DUMMY-RECORD.
038200 BLANK-LINE-PRINT.
038300     PERFORM WRT-LN.
038400 FAIL-ROUTINE.
038500     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038600     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038800     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
038900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039000     MOVE   SPACES TO INF-ANSI-REFERENCE.
039100     GO TO  FAIL-ROUTINE-EX.
039200 FAIL-ROUTINE-WRITE.
039300     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
039400     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
039500     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
039600     MOVE   SPACES TO COR-ANSI-REFERENCE.
039700 FAIL-ROUTINE-EX. EXIT.
039800 BAIL-OUT.
039900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
040000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
040100 BAIL-OUT-WRITE.
040200     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
040300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
040400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040500     MOVE   SPACES TO INF-ANSI-REFERENCE.
040600 BAIL-OUT-EX. EXIT.
040700 CCVS1-EXIT.
040800     EXIT.
040900 SECT-NC203A-001 SECTION.
041000 DIV-INIT-F4-1.
041100     MOVE   "DIV-TEST-F4-1" TO PAR-NAME.
041200     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
041300     MOVE   "DIVIDE" TO FEATURE.
041400     MOVE    111111.0 TO WRK-DS-06V06.
041500 DIV-TEST-F4-1.
041600     DIVIDE  22 INTO WRK-DS-06V06 GIVING WRK-DS-05V00
041700             REMAINDER WRK-DS-02V00.
041800     ADD     WRK-DS-02V00 TO WRK-DS-05V00.
041900     IF      WRK-DS-05V00 EQUAL TO 5061
042000              PERFORM PASS
042100              GO TO DIV-WRITE-F4-1.
042200     GO TO DIV-FAIL-F4-1.
042300 DIV-DELETE-F4-1.
042400     PERFORM DE-LETE.
042500     GO TO DIV-WRITE-F4-1.
042600 DIV-FAIL-F4-1.
042700     MOVE     WRK-DS-05V00 TO COMPUTED-N.
042800     MOVE     5061 TO CORRECT-N.
042900     PERFORM  FAIL.
043000 DIV-WRITE-F4-1.
043100     PERFORM  PRINT-DETAIL.
043200*
043300 DIV-INIT-F4-2.
043400     MOVE "DIV-TEST-F4-2" TO PAR-NAME.
043500     MOVE 105  TO DIV11.
043600     MOVE 1000 TO DIV12.
043700 DIV-TEST-F4-2.
043800     DIVIDE DIV11 INTO DIV12 GIVING DIV13 REMAINDER DIV14.
043900     IF DIV14 IS EQUAL TO 55
044000              PERFORM PASS
044100              GO TO DIV-WRITE-F4-2.
044200     GO TO DIV-FAIL-F4-2.
044300 DIV-DELETE-F4-2.
044400     PERFORM DE-LETE.
044500     GO TO DIV-WRITE-F4-2.
044600 DIV-FAIL-F4-2.
044700     PERFORM FAIL.
044800     MOVE DIV14 TO COMPUTED-N.
044900     MOVE "+55" TO CORRECT-A.
045000 DIV-WRITE-F4-2.
045100     PERFORM PRINT-DETAIL.
045200*
045300 DIV-INIT-F4-3.
045400     MOVE "DIV-TEST-F4-3" TO PAR-NAME.
045500     MOVE   14 TO DIV19.
045600     MOVE 2147 TO DIV20.
045700 DIV-TEST-F4-3.
045800     DIVIDE DIV19 INTO DIV20 GIVING DIV21 ROUNDED REMAINDER
045900     DIV22.
046000     IF DIV22 IS EQUAL TO 05
046100              PERFORM PASS
046200              GO TO DIV-WRITE-F4-3.
046300     GO TO DIV-FAIL-F4-3.
046400 DIV-DELETE-F4-3.
046500     PERFORM DE-LETE.
046600     GO TO DIV-WRITE-F4-3.
046700 DIV-FAIL-F4-3.
046800     PERFORM FAIL.
046900     MOVE DIV22 TO COMPUTED-N.
047000     MOVE "+05" TO CORRECT-A.
047100 DIV-WRITE-F4-3.
047200     PERFORM PRINT-DETAIL.
047300*
047400 DIV-INIT-F4-4.
047500     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
047600     MOVE    ZERO TO 25COUNT.
047700     MOVE    ZERO TO 25ANS.
047800     MOVE    ZERO TO 25REM.
047900     MOVE    1    TO REC-CT.
048000 DIV-INIT-F4-4-0.
048100     MOVE   "DIV-TEST-F4-4-0"  TO PAR-NAME.
048200 DIV-TEST-F4-4-0.
048300     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
048400             ON SIZE ERROR
048500             PERFORM PASS
048600             GO TO DIV-WRITE-F4-4-0.
048700     GO TO DIV-FAIL-F4-4-0.
048800 DIV-FAIL-F4-4-0.
048900     MOVE   "SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK.
049000     PERFORM FAIL.
049100 DIV-WRITE-F4-4-0.
049200     PERFORM PRINT-DETAIL.
049300*
049400 DIV-INIT-F4-4-1.
049500     MOVE   "DIV-TEST-F4-4-1" TO PAR-NAME.
049600     ADD     1 TO REC-CT.
049700 DIV-TEST-F4-4-1.
049800     IF      25ANS NOT = ZERO
049900             GO TO DIV-FAIL-F4-4-1.
050000     PERFORM PASS
050100     GO TO DIV-WRITE-F4-4-1.
050200 DIV-DELETE-F4-4-1.
050300     PERFORM DE-LETE.
050400     GO TO DIV-WRITE-F4-4-1.
050500 DIV-FAIL-F4-4-1.
050600     MOVE    25ANS TO COMPUTED-N
050700     MOVE    ZERO TO CORRECT-N
050800     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
050900     PERFORM FAIL.
051000 DIV-WRITE-F4-4-1.
051100     PERFORM PRINT-DETAIL.
051200*
051300 DIV-INIT-F4-4-2.
051400     MOVE   "DIV-TEST-F4-4-2" TO PAR-NAME.
051500     ADD     1 TO REC-CT.
051600 DIV-TEST-F4-4-2.
051700     IF      25REM NOT = ZERO
051800             GO TO DIV-FAIL-F4-4-2.
051900     PERFORM PASS
052000     GO TO DIV-WRITE-F4-4-2.
052100 DIV-DELETE-F4-4-2.
052200     PERFORM DE-LETE.
052300     GO TO DIV-WRITE-F4-4-2.
052400 DIV-FAIL-F4-4-2.
052500     MOVE    25REM TO COMPUTED-N
052600     MOVE    ZERO TO CORRECT-N
052700     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
052800     PERFORM FAIL.
052900 DIV-WRITE-F4-4-2.
053000     PERFORM PRINT-DETAIL.
053100*
053200 DIV-INIT-F4-5.
053300     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
053400     MOVE ZERO TO 25ANS.
053500     MOVE ZERO TO 25REM.
053600     MOVE 3    TO 25COUNT.
053700     MOVE 1    TO REC-CT.
053800 DIV-INIT-F4-5-0.
053900     MOVE   "DIV-TEST-F4-5-0"  TO PAR-NAME.
054000 DIV-TEST-F4-5-0.
054100     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
054200             ON SIZE ERROR
054300             GO TO DIV-FAIL-F4-5-0.
054400     PERFORM PASS.
054500     GO TO DIV-WRITE-F4-5-0.
054600 DIV-DELETE-F4-5-0.
054700     PERFORM DE-LETE.
054800     GO TO DIV-WRITE-F4-5-0.
054900 DIV-FAIL-F4-5-0.
055000     MOVE   "SIZE ERROR SHOULD NOT HAVE OCCURED"
055100          TO RE-MARK
055200     PERFORM FAIL.
055300 DIV-WRITE-F4-5-0.
055400     PERFORM PRINT-DETAIL.
055500*
055600 DIV-INIT-F4-5-1.
055700     MOVE   "DIV-TEST-F4-5-1" TO PAR-NAME.
055800     ADD     1 TO REC-CT.
055900 DIV-TEST-F4-5-1.
056000     IF      25ANS NOT = 33
056100             GO TO DIV-FAIL-F4-5-1.
056200     PERFORM PASS
056300     GO TO DIV-WRITE-F4-5-1.
056400 DIV-DELETE-F4-5-1.
056500     PERFORM DE-LETE.
056600     GO TO DIV-WRITE-F4-5-1.
056700 DIV-FAIL-F4-5-1.
056800     MOVE    33 TO CORRECT-N
056900     MOVE    25ANS TO COMPUTED-N
057000     MOVE   "INVALID QUOTIENT" TO RE-MARK
057100     PERFORM FAIL.
057200 DIV-WRITE-F4-5-1.
057300     PERFORM PRINT-DETAIL.
057400*
057500 DIV-INIT-F4-5-2.
057600     MOVE   "DIV-TEST-F4-5-2" TO PAR-NAME.
057700     ADD     1 TO REC-CT.
057800 DIV-TEST-F4-5-2.
057900     IF      25REM NOT = 1
058000             GO TO DIV-FAIL-F4-5-2.
058100     PERFORM PASS
058200     GO TO DIV-WRITE-F4-5-2.
058300 DIV-DELETE-F4-5-2.
058400     PERFORM DE-LETE.
058500     GO TO DIV-WRITE-F4-5-2.
058600 DIV-FAIL-F4-5-2.
058700     MOVE    25REM TO COMPUTED-N
058800     MOVE    1     TO CORRECT-N
058900     MOVE   "INVALID REMAINDER" TO RE-MARK
059000     PERFORM FAIL.
059100 DIV-WRITE-F4-5-2.
059200     PERFORM PRINT-DETAIL.
059300*
059400 DIV-INIT-F4-6.
059500     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
059600     MOVE    40   TO 25COUNT.
059700     MOVE    ZERO TO 25ANS.
059800     MOVE    ZERO TO 25REM.
059900     MOVE    1    TO REC-CT.
060000 DIV-INIT-F4-6-0.
060100     MOVE   "DIV-TEST-F4-6-0"  TO PAR-NAME.
060200 DIV-TEST-F4-6-0.
060300     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
060400             ON SIZE ERROR
060500             GO TO DIV-FAIL-F4-6-0.
060600     PERFORM PASS.
060700     GO TO DIV-WRITE-F4-6-0.
060800 DIV-DELETE-F4-6-0.
060900     PERFORM DE-LETE.
061000     GO TO DIV-WRITE-F4-6-0.
061100 DIV-FAIL-F4-6-0.
061200     MOVE   "SIZE ERROR SHOULD NOT HAVE OCCURED"
061300          TO RE-MARK
061400     PERFORM FAIL.
061500 DIV-WRITE-F4-6-0.
061600     PERFORM PRINT-DETAIL.
061700*
061800 DIV-INIT-F4-6-1.
061900     MOVE   "DIV-TEST-F4-6-1" TO PAR-NAME.
062000     ADD     1 TO REC-CT.
062100 DIV-TEST-F4-6-1.
062200     IF      25ANS NOT = 2
062300             GO TO DIV-FAIL-F4-6-1.
062400     PERFORM PASS
062500     GO TO DIV-WRITE-F4-6-1.
062600 DIV-DELETE-F4-6-1.
062700     PERFORM DE-LETE.
062800     GO TO DIV-WRITE-F4-6-1.
062900 DIV-FAIL-F4-6-1.
063000     MOVE    2 TO CORRECT-N
063100     MOVE    25ANS TO COMPUTED-N
063200     MOVE   "INVALID QUOTIENT" TO RE-MARK
063300     PERFORM FAIL.
063400 DIV-WRITE-F4-6-1.
063500     PERFORM PRINT-DETAIL.
063600*
063700 DIV-INIT-F4-6-2.
063800     MOVE   "DIV-TEST-F4-6-2" TO PAR-NAME.
063900 DIV-TEST-F4-6-2.
064000     ADD     1 TO REC-CT.
064100     IF      25REM NOT = 20
064200             GO TO DIV-FAIL-F4-6-2.
064300     PERFORM PASS
064400     GO TO DIV-WRITE-F4-6-2.
064500 DIV-DELETE-F4-6-2.
064600     PERFORM DE-LETE.
064700     GO TO DIV-WRITE-F4-6-2.
064800 DIV-FAIL-F4-6-2.
064900     MOVE    25REM TO COMPUTED-N
065000     MOVE    20    TO CORRECT-N
065100     MOVE   "INVALID REMAINDER" TO RE-MARK
065200     PERFORM FAIL.
065300 DIV-WRITE-F4-6-2.
065400     PERFORM PRINT-DETAIL.
065500*
065600 DIV-INIT-F4-7.
065700     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
065800     MOVE   "DIV-TEST-F4-7-0"  TO PAR-NAME.
065900     MOVE    16   TO DS-02V00-0001.
066000     MOVE    174  TO DS-03V00-0002.
066100     MOVE    ZERO TO WRK-DS-04V01-0005.
066200     MOVE    ZERO TO NE-0009.
066300     MOVE    1    TO REC-CT.
066400 DIV-TEST-F4-7-0.
066500     DIVIDE   DS-02V00-0001  INTO  DS-03V00-0002
066600              GIVING  WRK-DS-04V01-0005  REMAINDER  NE-0009.
066700*
066800*    REMAINDER RECEIVING FIELD DESCRIBED AS NUMERIC EDITED.
066900*                 I1 = 16
067000*                 I2 = 174
067100*
067200 DIV-INIT-F4-7-1.
067300     MOVE     "DIV-TEST-F4-7-1" TO  PAR-NAME.
067400 DIV-TEST-F4-7-1.
067500     IF      NE-0009  EQUAL TO "***01"
067600             PERFORM   PASS
067700             GO TO DIV-WRITE-F4-7-1.
067800     GO TO DIV-FAIL-F4-7-1.
067900 DIV-FAIL-F4-7-1.
068000     PERFORM  FAIL.
068100     MOVE    "***01"  TO CORRECT-A.
068200     MOVE     NE-0009 TO COMPUTED-A.
068300 DIV-DELETE-F4-7-1.
068400     PERFORM   DE-LETE.
068500     GO TO    DIV-WRITE-F4-7-1.
068600 DIV-WRITE-F4-7-1.
068700     PERFORM  PRINT-DETAIL.
068800*
068900 DIV-INIT-F4-7-2.
069000     MOVE   "DIV-TEST-F4-7-2" TO PAR-NAME.
069100     ADD     1 TO REC-CT.
069200 DIV-TEST-F4-7-2.
069300     IF      WRK-DS-04V01-0005 NOT = 10.8
069400             GO TO DIV-FAIL-F4-7-2.
069500     PERFORM PASS
069600     GO TO DIV-WRITE-F4-7-2.
069700 DIV-DELETE-F4-7-2.
069800     PERFORM   DE-LETE.
069900     GO TO    DIV-WRITE-F4-7-2.
070000 DIV-FAIL-F4-7-2.
070100     MOVE    WRK-DS-04V01-0005 TO COMPUTED-N
070200     MOVE    10.8  TO CORRECT-N
070300     MOVE   "INVALID REMAINDER" TO RE-MARK
070400     PERFORM FAIL.
070500 DIV-WRITE-F4-7-2.
070600     PERFORM PRINT-DETAIL.
070700*
070800 DIV-INIT-F4-8.
070900     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
071000     MOVE    16   TO DS-02V00-0001.
071100     MOVE    174  TO DS-03V00-0002.
071200     MOVE    ZERO TO WRK-DS-04V01-0005.
071300     MOVE    ZERO TO NE-04V01-0006.
071400     MOVE    1    TO REC-CT.
071500     MOVE   "DIV-TEST-F4-8-0"  TO PAR-NAME.
071600     MOVE   "DIVIDE"  TO FEATURE.
071700*
071800 DIV-TEST-F4-8-0.
071900     DIVIDE  DS-02V00-0001  INTO  DS-03V00-0002
072000             GIVING NE-04V01-0006    REMAINDER WRK-DS-05V00-0002.
072100*
072200*    GIVING    RECEIVING FIELD DESCRIBED AS NUMERIC EDITED.
072300*    INTERMEDIATE STORAGE SHOULD BE USED TO CALCULATE THE
072400*    REMAINDER
072500*                 I1 = 16
072600*                 I2 = 174
072700*
072800 DIV-INIT-F4-8-1.
072900     MOVE     "DIV-TEST-F4-8-1" TO  PAR-NAME.
073000 DIV-TEST-F4-8-1.
073100     IF      WRK-DS-05V00-0002  EQUAL TO 00001
073200             PERFORM   PASS
073300             GO TO DIV-WRITE-F4-8-1.
073400     GO TO DIV-FAIL-F4-8-1.
073500 DIV-DELETE-F4-8-1.
073600     PERFORM   DE-LETE.
073700     GO TO    DIV-WRITE-F4-8-1.
073800 DIV-FAIL-F4-8-1.
073900     PERFORM  FAIL.
074000     MOVE     00001     TO  CORRECT-A.
074100     MOVE   WRK-DS-05V00-0002  TO COMPUTED-A.
074200 DIV-WRITE-F4-8-1.
074300     PERFORM  PRINT-DETAIL.
074400*
074500 DIV-INIT-F4-8-2.
074600     MOVE   "DIV-TEST-F4-8-2" TO PAR-NAME.
074700     ADD     1 TO REC-CT.
074800 DIV-TEST-F4-8-2.
074900     IF      NE-04V01-0006 NOT = "**10.8"
075000             GO TO DIV-FAIL-F4-8-2.
075100     PERFORM PASS
075200     GO TO DIV-WRITE-F4-8-2.
075300 DIV-DELETE-F4-8-2.
075400     PERFORM   DE-LETE.
075500     GO TO    DIV-WRITE-F4-8-2.
075600 DIV-FAIL-F4-8-2.
075700     MOVE    NE-04V01-0006 TO COMPUTED-A
075800     MOVE   "**10.8" TO CORRECT-A
075900     MOVE   "INVALID REMAINDER" TO RE-MARK
076000     PERFORM FAIL.
076100 DIV-WRITE-F4-8-2.
076200     PERFORM PRINT-DETAIL.
076300*
076400 DIV-INIT-F4-9.
076500     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
076600     MOVE    ZERO TO 25COUNT.
076700     MOVE    ZERO TO 25ANS.
076800     MOVE    ZERO TO 25REM.
076900     MOVE    1    TO REC-CT.
077000 DIV-INIT-F4-9-0.
077100     MOVE   "DIV-TEST-F4-9-0"  TO PAR-NAME.
077200 DIV-TEST-F4-9-0.
077300     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
077400         NOT ON SIZE ERROR
077500         GO TO DIV-FAIL-F4-9-0.
077600     PERFORM PASS.
077700     GO TO DIV-WRITE-F4-9-0.
077800 DIV-DELETE-F4-9-0.
077900     PERFORM   DE-LETE.
078000     GO TO    DIV-WRITE-F4-9-0.
078100 DIV-FAIL-F4-9-0.
078200     MOVE   "NOT ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
078300           TO RE-MARK
078400     PERFORM FAIL.
078500 DIV-WRITE-F4-9-0.
078600     PERFORM PRINT-DETAIL.
078700*
078800 DIV-INIT-F4-9-1.
078900     MOVE   "DIV-TEST-F4-9-1" TO PAR-NAME.
079000     ADD     1 TO REC-CT.
079100 DIV-TEST-F4-9-1.
079200     IF      25ANS NOT = ZERO
079300             GO TO DIV-FAIL-F4-9-1.
079400     PERFORM PASS
079500     GO TO DIV-WRITE-F4-9-1.
079600 DIV-DELETE-F4-9-1.
079700     PERFORM   DE-LETE.
079800     GO TO    DIV-WRITE-F4-9-1.
079900 DIV-FAIL-F4-9-1.
080000     MOVE    25ANS TO COMPUTED-N
080100     MOVE    ZERO TO CORRECT-N
080200     MOVE   "INVALID QUOTIENT" TO RE-MARK
080300     PERFORM FAIL.
080400 DIV-WRITE-F4-9-1.
080500     PERFORM PRINT-DETAIL.
080600*
080700 DIV-INIT-F4-9-2.
080800     MOVE   "DIV-TEST-F4-9-2" TO PAR-NAME.
080900     ADD     1 TO REC-CT.
081000 DIV-TEST-F4-9-2.
081100     IF      25REM NOT = ZERO
081200             GO TO DIV-FAIL-F4-9-2.
081300     PERFORM PASS
081400     GO TO DIV-WRITE-F4-9-2.
081500 DIV-DELETE-F4-9-2.
081600     PERFORM   DE-LETE.
081700     GO TO    DIV-WRITE-F4-9-2.
081800 DIV-FAIL-F4-9-2.
081900     MOVE    25REM TO COMPUTED-N
082000     MOVE    ZERO TO CORRECT-N
082100     MOVE   "INVALID REMAINDER" TO RE-MARK
082200     PERFORM FAIL.
082300 DIV-WRITE-F4-9-2.
082400     PERFORM PRINT-DETAIL.
082500*
082600 DIV-INIT-F4-10.
082700     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
082800     MOVE ZERO TO 25ANS.
082900     MOVE ZERO TO 25REM.
083000     MOVE 3    TO 25COUNT.
083100     MOVE 1    TO REC-CT.
083200 DIV-INIT-F4-10-0.
083300     MOVE   "DIV-TEST-F4-10-0"  TO PAR-NAME.
083400 DIV-TEST-F4-10-0.
083500     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
083600         NOT ON SIZE ERROR
083700             PERFORM PASS
083800             GO TO DIV-WRITE-F4-10-0.
083900     GO TO   DIV-FAIL-F4-10-0.
084000 DIV-DELETE-F4-10-0.
084100     PERFORM DE-LETE.
084200     GO TO DIV-WRITE-F4-10-0.
084300 DIV-FAIL-F4-10-0.
084400     MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED" TO RE-MARK.
084500     PERFORM FAIL.
084600 DIV-WRITE-F4-10-0.
084700     PERFORM PRINT-DETAIL.
084800*
084900 DIV-INIT-F4-10-1.
085000     MOVE   "DIV-TEST-F4-10-1" TO PAR-NAME.
085100     ADD     1 TO REC-CT.
085200 DIV-TEST-F4-10-1.
085300     IF      25ANS NOT = 33
085400             GO TO DIV-FAIL-F4-10-1.
085500     PERFORM PASS
085600     GO TO DIV-WRITE-F4-10-1.
085700 DIV-DELETE-F4-10-1.
085800     PERFORM DE-LETE.
085900     GO TO DIV-WRITE-F4-10-1.
086000 DIV-FAIL-F4-10-1.
086100     MOVE    33 TO CORRECT-N
086200     MOVE    25ANS TO COMPUTED-N
086300     MOVE   "INVALID QUOTIENT" TO RE-MARK
086400     PERFORM FAIL.
086500 DIV-WRITE-F4-10-1.
086600     PERFORM PRINT-DETAIL.
086700*
086800 DIV-INIT-F4-10-2.
086900     MOVE   "DIV-TEST-F4-10-2" TO PAR-NAME.
087000     ADD     1 TO REC-CT.
087100 DIV-TEST-F4-10-2.
087200     IF      25REM NOT = 1
087300             GO TO DIV-FAIL-F4-10-2.
087400     PERFORM PASS
087500     GO TO DIV-WRITE-F4-10-2.
087600 DIV-DELETE-F4-10-2.
087700     PERFORM DE-LETE.
087800     GO TO DIV-WRITE-F4-10-2.
087900 DIV-FAIL-F4-10-2.
088000     MOVE    25REM TO COMPUTED-N
088100     MOVE    1     TO CORRECT-N
088200     MOVE   "INVALID REMAINDER" TO RE-MARK
088300     PERFORM FAIL.
088400 DIV-WRITE-F4-10-2.
088500     PERFORM PRINT-DETAIL.
088600*
088700 DIV-INIT-F4-11.
088800     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
088900     MOVE    ZERO TO 25COUNT.
089000     MOVE    ZERO TO 25ANS.
089100     MOVE    ZERO TO 25REM.
089200     MOVE    1    TO REC-CT.
089300 DIV-INIT-F4-11-0.
089400     MOVE   "DIV-TEST-F4-11-0"  TO PAR-NAME.
089500 DIV-TEST-F4-11-0.
089600     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
089700             ON SIZE ERROR
089800             PERFORM PASS
089900             GO TO   DIV-WRITE-F4-11-0
090000         NOT ON SIZE ERROR
090100             GO TO DIV-FAIL-F4-11-0.
090200 DIV-DELETE-F4-11-0.
090300     PERFORM DE-LETE.
090400     GO TO DIV-WRITE-F4-11-0.
090500 DIV-FAIL-F4-11-0.
090600     MOVE   "NOT ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
090700          TO RE-MARK
090800     PERFORM FAIL.
090900 DIV-WRITE-F4-11-0.
091000     PERFORM PRINT-DETAIL.
091100*
091200 DIV-INIT-F4-11-1.
091300     MOVE   "DIV-TEST-F4-11-1" TO PAR-NAME.
091400     ADD     1 TO REC-CT.
091500 DIV-TEST-F4-11-1.
091600     IF      25ANS NOT = ZERO
091700             GO TO DIV-FAIL-F4-11-1.
091800     PERFORM PASS
091900     GO TO DIV-WRITE-F4-11-1.
092000 DIV-DELETE-F4-11-1.
092100     PERFORM DE-LETE.
092200     GO TO DIV-WRITE-F4-11-1.
092300 DIV-FAIL-F4-11-1.
092400     MOVE    25ANS TO COMPUTED-N
092500     MOVE    ZERO TO CORRECT-N
092600     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
092700     PERFORM FAIL.
092800 DIV-WRITE-F4-11-1.
092900     PERFORM PRINT-DETAIL.
093000*
093100 DIV-INIT-F4-11-2.
093200     MOVE   "DIV-TEST-F4-11-2" TO PAR-NAME.
093300     ADD     1 TO REC-CT.
093400 DIV-TEST-F4-11-2.
093500     IF      25REM NOT = ZERO
093600             GO TO DIV-FAIL-F4-11-2.
093700     PERFORM PASS
093800     GO TO DIV-WRITE-F4-11-2.
093900 DIV-DELETE-F4-11-2.
094000     PERFORM DE-LETE.
094100     GO TO DIV-WRITE-F4-11-2.
094200 DIV-FAIL-F4-11-2.
094300     MOVE    25REM TO COMPUTED-N
094400     MOVE    ZERO TO CORRECT-N
094500     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
094600     PERFORM FAIL.
094700 DIV-WRITE-F4-11-2.
094800     PERFORM PRINT-DETAIL.
094900*
095000 DIV-INIT-F4-12.
095100     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
095200     MOVE ZERO TO 25ANS.
095300     MOVE ZERO TO 25REM.
095400     MOVE 3    TO 25COUNT.
095500     MOVE 1    TO REC-CT.
095600 DIV-INIT-F4-12-0.
095700     MOVE   "DIV-TEST-F4-12-0"  TO PAR-NAME.
095800 DIV-TEST-F4-12-0.
095900     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
096000             ON SIZE ERROR
096100             GO TO DIV-FAIL-F4-12-0
096200         NOT ON SIZE ERROR
096300             PERFORM PASS
096400             GO TO DIV-WRITE-F4-12-0.
096500 DIV-DELETE-F4-12-0.
096600     PERFORM DE-LETE.
096700     GO TO DIV-WRITE-F4-12-0.
096800 DIV-FAIL-F4-12-0.
096900     MOVE   "ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
097000          TO RE-MARK
097100     PERFORM FAIL.
097200 DIV-WRITE-F4-12-0.
097300     PERFORM PRINT-DETAIL.
097400*
097500 DIV-INIT-F4-12-1.
097600     MOVE   "DIV-TEST-F4-12-1" TO PAR-NAME.
097700     ADD     1 TO REC-CT.
097800 DIV-TEST-F4-12-1.
097900     IF      25ANS NOT = 33
098000             GO TO DIV-FAIL-F4-12-1.
098100     PERFORM PASS
098200     GO TO DIV-WRITE-F4-12-1.
098300 DIV-DELETE-F4-12-1.
098400     PERFORM DE-LETE.
098500     GO TO DIV-WRITE-F4-12-1.
098600 DIV-FAIL-F4-12-1.
098700     MOVE    33 TO CORRECT-N
098800     MOVE    25ANS TO COMPUTED-N
098900     MOVE   "INVALID QUOTIENT" TO RE-MARK
099000     PERFORM FAIL.
099100 DIV-WRITE-F4-12-1.
099200     PERFORM PRINT-DETAIL.
099300*
099400 DIV-INIT-F4-12-2.
099500     MOVE   "DIV-TEST-F4-12-2" TO PAR-NAME.
099600     ADD     1 TO REC-CT.
099700 DIV-TEST-F4-12-2.
099800     IF      25REM NOT = 1
099900             GO TO DIV-FAIL-F4-12-2.
100000     PERFORM PASS
100100     GO TO DIV-WRITE-F4-12-2.
100200 DIV-DELETE-F4-12-2.
100300     PERFORM DE-LETE.
100400     GO TO DIV-WRITE-F4-12-2.
100500 DIV-FAIL-F4-12-2.
100600     MOVE    25REM TO COMPUTED-N
100700     MOVE    1     TO CORRECT-N
100800     MOVE   "INVALID REMAINDER" TO RE-MARK
100900     PERFORM FAIL.
101000 DIV-WRITE-F4-12-2.
101100     PERFORM PRINT-DETAIL.
101200*
101300 DIV-INIT-F4-13.
101400     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
101500     MOVE    ZERO TO 25COUNT.
101600     MOVE    ZERO TO 25ANS.
101700     MOVE    ZERO TO 25REM.
101800     MOVE    1    TO REC-CT.
101900     MOVE   "DIV-TEST-F4-13-0"  TO PAR-NAME.
102000 DIV-TEST-F4-13-0.
102100     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
102200             ON SIZE ERROR
102300             MOVE    "A" TO WRK-XN-00001-1
102400     END-DIVIDE
102500     MOVE   "B" TO WRK-XN-00001-2.
102600*
102700 DIV-INIT-F4-13-1.
102800     MOVE   "DIV-TEST-F4-13-1" TO PAR-NAME.
102900 DIV-TEST-F4-13-1.
103000     IF      25ANS NOT = ZERO
103100             GO TO DIV-FAIL-F4-13-1.
103200     PERFORM PASS
103300     GO TO DIV-WRITE-F4-13-1.
103400 DIV-DELETE-F4-13-1.
103500     PERFORM DE-LETE.
103600     GO TO DIV-WRITE-F4-13-1.
103700 DIV-FAIL-F4-13-1.
103800     MOVE    25ANS TO COMPUTED-N
103900     MOVE    ZERO TO CORRECT-N
104000     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
104100     PERFORM FAIL.
104200 DIV-WRITE-F4-13-1.
104300     PERFORM PRINT-DETAIL.
104400*
104500 DIV-INIT-F4-13-2.
104600     MOVE   "DIV-TEST-F4-13-2" TO PAR-NAME.
104700     ADD     1 TO REC-CT.
104800 DIV-TEST-F4-13-2.
104900     IF      25REM NOT = ZERO
105000             GO TO DIV-FAIL-F4-13-2.
105100     PERFORM PASS
105200     GO TO DIV-WRITE-F4-13-2.
105300 DIV-DELETE-F4-13-2.
105400     PERFORM DE-LETE.
105500     GO TO DIV-WRITE-F4-13-2.
105600 DIV-FAIL-F4-13-2.
105700     MOVE    25REM TO COMPUTED-N
105800     MOVE    ZERO TO CORRECT-N
105900     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
106000     PERFORM FAIL.
106100 DIV-WRITE-F4-13-2.
106200     PERFORM PRINT-DETAIL.
106300*
106400 DIV-INIT-F4-13-3.
106500     MOVE   "DIV-TEST-F4-13-3" TO PAR-NAME.
106600     ADD     1 TO REC-CT.
106700 DIV-TEST-F4-13-3.
106800     IF      WRK-XN-00001-1 NOT = "A"
106900             GO TO DIV-FAIL-F4-13-3.
107000     PERFORM PASS
107100     GO TO DIV-WRITE-F4-13-3.
107200 DIV-DELETE-F4-13-3.
107300     PERFORM DE-LETE.
107400     GO TO DIV-WRITE-F4-13-3.
107500 DIV-FAIL-F4-13-3.
107600     MOVE   "ON SIZE ERROR SHOULD HAVE EXECUTED"
107700          TO RE-MARK
107800     MOVE   "A"    TO CORRECT-A
107900     MOVE    WRK-XN-00001-1 TO COMPUTED-A
108000     PERFORM FAIL.
108100 DIV-WRITE-F4-13-3.
108200     PERFORM PRINT-DETAIL.
108300*
108400 DIV-INIT-F4-13-4.
108500     MOVE   "DIV-TEST-F4-13-4" TO PAR-NAME.
108600     ADD     1 TO REC-CT.
108700 DIV-TEST-F4-13-4.
108800     IF      WRK-XN-00001-2 NOT = "B"
108900             GO TO DIV-FAIL-F4-13-4.
109000     PERFORM PASS
109100     GO TO DIV-WRITE-F4-13-4.
109200 DIV-DELETE-F4-13-4.
109300     PERFORM DE-LETE.
109400     GO TO DIV-WRITE-F4-13-4.
109500 DIV-FAIL-F4-13-4.
109600     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
109700     MOVE   "B" TO CORRECT-A
109800     MOVE    WRK-XN-00001-2 TO COMPUTED-A
109900     PERFORM FAIL.
110000 DIV-WRITE-F4-13-4.
110100     PERFORM PRINT-DETAIL.
110200*
110300 DIV-INIT-F4-14.
110400     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
110500     MOVE   "DIV-TEST-F4-14-0"  TO PAR-NAME.
110600     MOVE ZERO TO 25ANS.
110700     MOVE ZERO TO 25REM.
110800     MOVE SPACE TO WRK-XN-00001-1.
110900     MOVE SPACE TO WRK-XN-00001-2.
111000     MOVE 3    TO 25COUNT.
111100     MOVE 1    TO REC-CT.
111200 DIV-TEST-F4-14-0.
111300     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
111400             ON SIZE ERROR
111500             MOVE    "A" TO WRK-XN-00001-1
111600     END-DIVIDE
111700     MOVE   "B" TO WRK-XN-00001-2.
111800*
111900 DIV-INIT-F4-14-1.
112000     MOVE   "DIV-TEST-F4-14-1" TO PAR-NAME.
112100 DIV-TEST-F4-14-1.
112200     IF      25ANS NOT = 33
112300             GO TO DIV-FAIL-F4-14-1.
112400     PERFORM PASS
112500     GO TO DIV-WRITE-F4-14-1.
112600 DIV-DELETE-F4-14-1.
112700     PERFORM DE-LETE.
112800     GO TO DIV-WRITE-F4-14-1.
112900 DIV-FAIL-F4-14-1.
113000     MOVE    33 TO CORRECT-N
113100     MOVE    25ANS TO COMPUTED-N
113200     MOVE   "INVALID QUOTIENT" TO RE-MARK
113300     PERFORM FAIL.
113400 DIV-WRITE-F4-14-1.
113500     PERFORM PRINT-DETAIL.
113600*
113700 DIV-INIT-F4-14-2.
113800     MOVE   "DIV-TEST-F4-14-2" TO PAR-NAME.
113900     ADD     1 TO REC-CT.
114000 DIV-TEST-F4-14-2.
114100     IF      25REM NOT = 1
114200             GO TO DIV-FAIL-F4-14-2.
114300     PERFORM PASS
114400     GO TO DIV-WRITE-F4-14-2.
114500 DIV-DELETE-F4-14-2.
114600     PERFORM DE-LETE.
114700     GO TO DIV-WRITE-F4-14-2.
114800 DIV-FAIL-F4-14-2.
114900     MOVE    25REM TO COMPUTED-N
115000     MOVE    1     TO CORRECT-N
115100     MOVE   "INVALID REMAINDER" TO RE-MARK
115200     PERFORM FAIL.
115300 DIV-WRITE-F4-14-2.
115400     PERFORM PRINT-DETAIL.
115500*
115600 DIV-INIT-F4-14-3.
115700     MOVE   "DIV-TEST-F4-14-3" TO PAR-NAME.
115800     ADD     1 TO REC-CT.
115900 DIV-TEST-F4-14-3.
116000     IF      WRK-XN-00001-1 NOT = SPACE
116100             GO TO DIV-FAIL-F4-14-3.
116200     PERFORM PASS
116300     GO TO DIV-WRITE-F4-14-3.
116400 DIV-DELETE-F4-14-3.
116500     PERFORM DE-LETE.
116600     GO TO DIV-WRITE-F4-14-3.
116700 DIV-FAIL-F4-14-3.
116800     MOVE   "ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
116900          TO RE-MARK.
117000     MOVE    SPACE TO CORRECT-A
117100     MOVE    WRK-XN-00001-1 TO COMPUTED-A
117200     PERFORM FAIL.
117300 DIV-WRITE-F4-14-3.
117400     PERFORM PRINT-DETAIL.
117500*
117600 DIV-INIT-F4-14-4.
117700     MOVE   "DIV-TEST-F4-14-4" TO PAR-NAME.
117800     ADD     1 TO REC-CT.
117900 DIV-TEST-F4-14-4.
118000     IF      WRK-XN-00001-2 NOT = "B"
118100             GO TO DIV-FAIL-F4-14-4.
118200     PERFORM PASS
118300     GO TO DIV-WRITE-F4-14-4.
118400 DIV-DELETE-F4-14-4.
118500     PERFORM DE-LETE.
118600     GO TO DIV-WRITE-F4-14-4.
118700 DIV-FAIL-F4-14-4.
118800     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
118900     MOVE   "B" TO CORRECT-A
119000     MOVE    WRK-XN-00001-2 TO COMPUTED-A
119100     PERFORM FAIL.
119200 DIV-WRITE-F4-14-4.
119300     PERFORM PRINT-DETAIL.
119400*
119500 DIV-INIT-F4-15.
119600     MOVE   "VI-82 6.11.4 GR9" TO ANSI-REFERENCE.
119700     MOVE    ZERO  TO 25COUNT.
119800     MOVE    ZERO  TO 25ANS.
119900     MOVE    ZERO  TO 25REM.
120000     MOVE    1     TO REC-CT.
120100     MOVE    SPACE TO WRK-XN-00001-1.
120200     MOVE    SPACE TO WRK-XN-00001-2.
120300     MOVE   "DIV-TEST-F4-15-0"  TO PAR-NAME.
120400 DIV-TEST-F4-15-0.
120500     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
120600         NOT ON SIZE ERROR
120700             MOVE    "A" TO WRK-XN-00001-1
120800     END-DIVIDE
120900     MOVE   "B" TO WRK-XN-00001-2.
121000*
121100 DIV-INIT-F4-15-1.
121200     MOVE   "DIV-TEST-F4-15-1" TO PAR-NAME.
121300     ADD     1 TO REC-CT.
121400 DIV-TEST-F4-15-1.
121500     IF      25ANS NOT = ZERO
121600             GO TO DIV-FAIL-F4-15-1.
121700     PERFORM PASS
121800     GO TO DIV-WRITE-F4-15-1.
121900 DIV-DELETE-F4-15-1.
122000     PERFORM DE-LETE.
122100     GO TO DIV-WRITE-F4-15-1.
122200 DIV-FAIL-F4-15-1.
122300     MOVE    25ANS TO COMPUTED-N
122400     MOVE    ZERO TO CORRECT-N
122500     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
122600     PERFORM FAIL.
122700 DIV-WRITE-F4-15-1.
122800     PERFORM PRINT-DETAIL.
122900*
123000 DIV-INIT-F4-15-2.
123100     MOVE   "DIV-TEST-F4-15-2" TO PAR-NAME.
123200     ADD     1 TO REC-CT.
123300 DIV-TEST-F4-15-2.
123400     IF      25REM NOT = ZERO
123500             GO TO DIV-FAIL-F4-15-2.
123600     PERFORM PASS
123700     GO TO DIV-WRITE-F4-15-2.
123800 DIV-DELETE-F4-15-2.
123900     PERFORM DE-LETE.
124000     GO TO DIV-WRITE-F4-15-2.
124100 DIV-FAIL-F4-15-2.
124200     MOVE    25REM TO COMPUTED-N
124300     MOVE    ZERO TO CORRECT-N
124400     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
124500     PERFORM FAIL.
124600 DIV-WRITE-F4-15-2.
124700     PERFORM PRINT-DETAIL.
124800*
124900 DIV-INIT-F4-15-3.
125000     MOVE   "DIV-TEST-F4-15-3" TO PAR-NAME.
125100     ADD     1 TO REC-CT.
125200 DIV-TEST-F4-15-3.
125300     IF      WRK-XN-00001-1 = "A"
125400             GO TO DIV-FAIL-F4-15-3.
125500     PERFORM PASS
125600     GO TO DIV-WRITE-F4-15-3.
125700 DIV-DELETE-F4-15-3.
125800     PERFORM DE-LETE.
125900     GO TO DIV-WRITE-F4-15-3.
126000 DIV-FAIL-F4-15-3.
126100     MOVE   "NOT ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
126200          TO RE-MARK
126300     MOVE    SPACE TO CORRECT-A
126400     MOVE    WRK-XN-00001-1 TO COMPUTED-A
126500     PERFORM FAIL.
126600 DIV-WRITE-F4-15-3.
126700     PERFORM PRINT-DETAIL.
126800*
126900 DIV-INIT-F4-15-4.
127000     MOVE   "DIV-TEST-F4-15-4" TO PAR-NAME.
127100     ADD     1 TO REC-CT.
127200 DIV-TEST-F4-15-4.
127300     IF      WRK-XN-00001-2 NOT = "B"
127400             GO TO DIV-FAIL-F4-15-4.
127500     PERFORM PASS
127600     GO TO DIV-WRITE-F4-15-4.
127700 DIV-DELETE-F4-15-4.
127800     PERFORM DE-LETE.
127900     GO TO DIV-WRITE-F4-15-4.
128000 DIV-FAIL-F4-15-4.
128100     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
128200     MOVE   "B" TO CORRECT-A
128300     MOVE    WRK-XN-00001-2 TO COMPUTED-A
128400     PERFORM FAIL.
128500 DIV-WRITE-F4-15-4.
128600     PERFORM PRINT-DETAIL.
128700*
128800 DIV-INIT-F4-16.
128900     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
129000     MOVE ZERO TO 25ANS.
129100     MOVE ZERO TO 25REM.
129200     MOVE 3    TO 25COUNT.
129300     MOVE 1    TO REC-CT.
129400     MOVE   "DIV-TEST-F4-16-0"  TO PAR-NAME.
129500 DIV-TEST-F4-16-0.
129600     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
129700         NOT ON SIZE ERROR
129800             MOVE    "A" TO WRK-XN-00001-1
129900     END-DIVIDE
130000     MOVE   "B" TO WRK-XN-00001-2.
130100*
130200 DIV-INIT-F4-16-1.
130300     MOVE   "DIV-TEST-F4-16-1" TO PAR-NAME.
130400 DIV-TEST-F4-16-1.
130500     IF      25ANS NOT = 33
130600             GO TO DIV-FAIL-F4-16-1.
130700     PERFORM PASS
130800     GO TO DIV-WRITE-F4-16-1.
130900 DIV-DELETE-F4-16-1.
131000     PERFORM DE-LETE.
131100     GO TO DIV-WRITE-F4-16-1.
131200 DIV-FAIL-F4-16-1.
131300     MOVE    33 TO CORRECT-N
131400     MOVE    25ANS TO COMPUTED-N
131500     MOVE   "INVALID QUOTIENT" TO RE-MARK
131600     PERFORM FAIL.
131700 DIV-WRITE-F4-16-1.
131800     PERFORM PRINT-DETAIL.
131900*
132000 DIV-INIT-F4-16-2.
132100     MOVE   "DIV-TEST-F4-16-2" TO PAR-NAME.
132200     ADD     1 TO REC-CT.
132300 DIV-TEST-F4-16-2.
132400     IF      25REM NOT = 1
132500             GO TO DIV-FAIL-F4-16-2.
132600     PERFORM PASS
132700     GO TO DIV-WRITE-F4-16-2.
132800 DIV-DELETE-F4-16-2.
132900     PERFORM DE-LETE.
133000     GO TO DIV-WRITE-F4-16-2.
133100 DIV-FAIL-F4-16-2.
133200     MOVE    25REM TO COMPUTED-N
133300     MOVE    1     TO CORRECT-N
133400     MOVE   "INVALID REMAINDER" TO RE-MARK
133500     PERFORM FAIL.
133600 DIV-WRITE-F4-16-2.
133700     PERFORM PRINT-DETAIL.
133800*
133900 DIV-INIT-F4-16-3.
134000     MOVE   "DIV-TEST-F4-16-3" TO PAR-NAME.
134100     ADD     1 TO REC-CT.
134200 DIV-TEST-F4-16-3.
134300     IF      WRK-XN-00001-1 NOT = "A"
134400             GO TO DIV-FAIL-F4-16-3.
134500     PERFORM PASS
134600     GO TO DIV-WRITE-F4-16-3.
134700 DIV-DELETE-F4-16-3.
134800     PERFORM DE-LETE.
134900     GO TO DIV-WRITE-F4-16-3.
135000 DIV-FAIL-F4-16-3.
135100     MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
135200          TO RE-MARK
135300     MOVE   "A" TO CORRECT-A
135400     MOVE    WRK-XN-00001-1 TO COMPUTED-A
135500     PERFORM FAIL.
135600 DIV-WRITE-F4-16-3.
135700     PERFORM PRINT-DETAIL.
135800*
135900 DIV-INIT-F4-16-4.
136000     MOVE   "DIV-TEST-F4-16-4" TO PAR-NAME.
136100     ADD     1 TO REC-CT.
136200 DIV-TEST-F4-16-4.
136300     IF      WRK-XN-00001-2 NOT = "B"
136400             GO TO DIV-FAIL-F4-16-4.
136500     PERFORM PASS
136600     GO TO DIV-WRITE-F4-16-4.
136700 DIV-DELETE-F4-16-4.
136800     PERFORM DE-LETE.
136900     GO TO DIV-WRITE-F4-16-4.
137000 DIV-FAIL-F4-16-4.
137100     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
137200     MOVE   "B" TO CORRECT-A
137300     MOVE    WRK-XN-00001-2 TO COMPUTED-A
137400     PERFORM FAIL.
137500 DIV-WRITE-F4-16-4.
137600     PERFORM PRINT-DETAIL.
137700*
137800 DIV-INIT-F4-17.
137900     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
138000     MOVE    ZERO TO 25COUNT.
138100     MOVE    ZERO TO 25ANS.
138200     MOVE    ZERO TO 25REM.
138300     MOVE    1    TO REC-CT.
138400     MOVE    SPACE TO WRK-XN-00001-1.
138500     MOVE    SPACE TO WRK-XN-00001-2.
138600     MOVE   "DIV-TEST-F4-17-0"  TO PAR-NAME.
138700 DIV-TEST-F4-17-0.
138800     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
138900             ON SIZE ERROR
139000             MOVE   "A" TO WRK-XN-00001-1
139100         NOT ON SIZE ERROR
139200             MOVE   "B" TO WRK-XN-00001-1
139300     END-DIVIDE
139400     MOVE   "C" TO WRK-XN-00001-2.
139500*
139600 DIV-INIT-F4-17-1.
139700     MOVE   "DIV-TEST-F4-17-1" TO PAR-NAME.
139800     ADD     1 TO REC-CT.
139900 DIV-TEST-F4-17-1.
140000     IF      25ANS NOT = ZERO
140100             GO TO DIV-FAIL-F4-17-1.
140200     PERFORM PASS
140300     GO TO DIV-WRITE-F4-17-1.
140400 DIV-DELETE-F4-17-1.
140500     PERFORM DE-LETE.
140600     GO TO DIV-WRITE-F4-17-1.
140700 DIV-FAIL-F4-17-1.
140800     MOVE    25ANS TO COMPUTED-N
140900     MOVE    ZERO TO CORRECT-N
141000     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
141100     PERFORM FAIL.
141200 DIV-WRITE-F4-17-1.
141300     PERFORM PRINT-DETAIL.
141400*
141500 DIV-INIT-F4-17-2.
141600     MOVE   "DIV-TEST-F4-17-2" TO PAR-NAME.
141700     ADD     1 TO REC-CT.
141800 DIV-TEST-F4-17-2.
141900     IF      25REM NOT = ZERO
142000             GO TO DIV-FAIL-F4-17-2.
142100     PERFORM PASS
142200     GO TO DIV-WRITE-F4-17-2.
142300 DIV-DELETE-F4-17-2.
142400     PERFORM DE-LETE.
142500     GO TO DIV-WRITE-F4-17-2.
142600 DIV-FAIL-F4-17-2.
142700     MOVE    25REM TO COMPUTED-N
142800     MOVE    ZERO TO CORRECT-N
142900     MOVE   "SIZE ERROR SHOULD HAVE OCCURED" TO RE-MARK
143000     PERFORM FAIL.
143100 DIV-WRITE-F4-17-2.
143200     PERFORM PRINT-DETAIL.
143300*
143400 DIV-INIT-F4-17-3.
143500     MOVE   "DIV-TEST-F4-17-3" TO PAR-NAME.
143600     ADD     1 TO REC-CT.
143700 DIV-TEST-F4-17-3.
143800     IF      WRK-XN-00001-1 NOT = "A"
143900             GO TO DIV-FAIL-F4-17-3.
144000     PERFORM PASS
144100     GO TO DIV-WRITE-F4-17-3.
144200 DIV-DELETE-F4-17-3.
144300     PERFORM DE-LETE.
144400     GO TO DIV-WRITE-F4-17-3.
144500 DIV-FAIL-F4-17-3.
144600     MOVE   "ON SIZE ERROR SHOULD HAVE BEEN EXECUTED"
144700          TO RE-MARK
144800     MOVE   "A" TO CORRECT-A
144900     MOVE    WRK-XN-00001-1 TO COMPUTED-A
145000     PERFORM FAIL.
145100 DIV-WRITE-F4-17-3.
145200     PERFORM PRINT-DETAIL.
145300*
145400 DIV-INIT-F4-17-4.
145500     MOVE   "DIV-TEST-F4-17-4" TO PAR-NAME.
145600     ADD     1 TO REC-CT.
145700 DIV-TEST-F4-17-4.
145800     IF      WRK-XN-00001-2 NOT = "C"
145900             GO TO DIV-FAIL-F4-17-4.
146000     PERFORM PASS
146100     GO TO DIV-WRITE-F4-17-4.
146200 DIV-DELETE-F4-17-4.
146300     PERFORM DE-LETE.
146400     GO TO DIV-WRITE-F4-17-4.
146500 DIV-FAIL-F4-17-4.
146600     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
146700     MOVE   "C" TO CORRECT-A
146800     MOVE    WRK-XN-00001-2 TO COMPUTED-A
146900     PERFORM FAIL.
147000 DIV-WRITE-F4-17-4.
147100     PERFORM PRINT-DETAIL.
147200*
147300 DIV-INIT-F4-18.
147400     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
147500     MOVE    SPACE TO WRK-XN-00001-1.
147600     MOVE    SPACE TO WRK-XN-00001-2.
147700     MOVE     ZERO TO 25ANS.
147800     MOVE     ZERO TO 25REM.
147900     MOVE     3    TO 25COUNT.
148000     MOVE 1    TO REC-CT.
148100     MOVE   "DIV-TEST-F4-18-0"  TO PAR-NAME.
148200 DIV-TEST-F4-18-0.
148300     DIVIDE  25COUNT INTO 100 GIVING 25ANS REMAINDER 25REM
148400             ON SIZE ERROR
148500             MOVE   "A" TO WRK-XN-00001-1
148600         NOT ON SIZE ERROR
148700             MOVE   "B" TO WRK-XN-00001-1
148800     END-DIVIDE
148900     MOVE   "B" TO WRK-XN-00001-2.
149000*
149100 DIV-INIT-F4-18-1.
149200     MOVE   "DIV-TEST-F4-18-1" TO PAR-NAME.
149300 DIV-TEST-F4-18-1.
149400     IF      25ANS NOT = 33
149500             GO TO DIV-FAIL-F4-18-1.
149600     PERFORM PASS
149700     GO TO DIV-WRITE-F4-18-1.
149800 DIV-DELETE-F4-18-1.
149900     PERFORM DE-LETE.
150000     GO TO DIV-WRITE-F4-18-1.
150100 DIV-FAIL-F4-18-1.
150200     MOVE    33 TO CORRECT-N
150300     MOVE    25ANS TO COMPUTED-N
150400     MOVE   "INVALID QUOTIENT" TO RE-MARK
150500     PERFORM FAIL.
150600 DIV-WRITE-F4-18-1.
150700     PERFORM PRINT-DETAIL.
150800*
150900 DIV-INIT-F4-18-2.
151000     MOVE   "DIV-TEST-F4-18-2" TO PAR-NAME.
151100     ADD     1 TO REC-CT.
151200 DIV-TEST-F4-18-2.
151300     IF      25REM NOT = 1
151400             GO TO DIV-FAIL-F4-18-2.
151500     PERFORM PASS
151600     GO TO DIV-WRITE-F4-18-2.
151700 DIV-DELETE-F4-18-2.
151800     PERFORM DE-LETE.
151900     GO TO DIV-WRITE-F4-18-2.
152000 DIV-FAIL-F4-18-2.
152100     MOVE    25REM TO COMPUTED-N
152200     MOVE    1     TO CORRECT-N
152300     MOVE   "INVALID REMAINDER" TO RE-MARK
152400     PERFORM FAIL.
152500 DIV-WRITE-F4-18-2.
152600     PERFORM PRINT-DETAIL.
152700*
152800 DIV-INIT-F4-18-3.
152900     MOVE   "DIV-TEST-F4-18-3" TO PAR-NAME.
153000     ADD     1 TO REC-CT.
153100 DIV-TEST-F4-18-3.
153200     IF      WRK-XN-00001-1 NOT = "B"
153300             GO TO DIV-FAIL-F4-18-3.
153400     PERFORM PASS
153500     GO TO DIV-WRITE-F4-18-3.
153600 DIV-DELETE-F4-18-3.
153700     PERFORM DE-LETE.
153800     GO TO DIV-WRITE-F4-18-3.
153900 DIV-FAIL-F4-18-3.
154000     MOVE   "ON SIZE ERROR SHOULD HAVE BEEN EXECUTED"
154100          TO RE-MARK
154200     MOVE   "B" TO CORRECT-A
154300     MOVE    WRK-XN-00001-1 TO COMPUTED-A
154400     PERFORM FAIL.
154500 DIV-WRITE-F4-18-3.
154600     PERFORM PRINT-DETAIL.
154700*
154800 DIV-INIT-F4-18-4.
154900     MOVE   "DIV-TEST-F4-18-4" TO PAR-NAME.
155000     ADD     1 TO REC-CT.
155100 DIV-TEST-F4-18-4.
155200     IF      WRK-XN-00001-2 NOT = "B"
155300             GO TO DIV-FAIL-F4-18-4.
155400     PERFORM PASS
155500     GO TO DIV-WRITE-F4-18-4.
155600 DIV-DELETE-F4-18-4.
155700     PERFORM DE-LETE.
155800     GO TO DIV-WRITE-F4-18-4.
155900 DIV-FAIL-F4-18-4.
156000     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
156100     MOVE   "B" TO CORRECT-A
156200     MOVE    WRK-XN-00001-2 TO COMPUTED-A
156300     PERFORM FAIL.
156400 DIV-WRITE-F4-18-4.
156500     PERFORM PRINT-DETAIL.
156600*
156700 DIV-INIT-F4-19.
156800     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
156900     MOVE ZERO TO 25ANS.
157000     MOVE ZERO TO 25REM.
157100     MOVE ZERO TO WS-REMAINDERS.
157200     MOVE 6    TO 25COUNT.
157300     MOVE 1    TO REC-CT.
157400     MOVE   "DIV-TEST-F4-19-0"  TO PAR-NAME.
157500 DIV-TEST-F4-19-0.
157600     DIVIDE  25COUNT INTO 100 GIVING 25ANS
157700             REMAINDER WS-REM (25ANS)
157800             ON SIZE ERROR
157900             GO TO DIV-FAIL-F4-19-0.
158000     PERFORM PASS.
158100     GO TO DIV-WRITE-F4-19-0.
158200 DIV-DELETE-F4-19-0.
158300     PERFORM DE-LETE.
158400     GO TO DIV-WRITE-F4-19-0.
158500 DIV-FAIL-F4-19-0.
158600     MOVE   "SIZE ERROR SHOULD NOT HAVE OCCURED"
158700           TO RE-MARK
158800     PERFORM FAIL.
158900 DIV-WRITE-F4-19-0.
159000     PERFORM PRINT-DETAIL.
159100*
159200 DIV-INIT-F4-19-1.
159300     MOVE   "DIV-TEST-F4-19-1" TO PAR-NAME.
159400     ADD     1 TO REC-CT.
159500 DIV-TEST-F4-19-1.
159600     IF      25ANS NOT = 16
159700             GO TO DIV-FAIL-F4-19-1.
159800     PERFORM PASS
159900     GO TO DIV-WRITE-F4-19-1.
160000 DIV-DELETE-F4-19-1.
160100     PERFORM DE-LETE.
160200     GO TO DIV-WRITE-F4-19-1.
160300 DIV-FAIL-F4-19-1.
160400     MOVE    16 TO CORRECT-N
160500     MOVE    25ANS TO COMPUTED-N
160600     MOVE   "INVALID QUOTIENT" TO RE-MARK
160700     PERFORM FAIL.
160800 DIV-WRITE-F4-19-1.
160900     PERFORM PRINT-DETAIL.
161000*
161100 DIV-INIT-F4-19-2.
161200     MOVE   "DIV-TEST-F4-19-2" TO PAR-NAME.
161300     ADD     1 TO REC-CT.
161400 DIV-TEST-F4-19-2.
161500     IF      WS-REM (25ANS) NOT = 4
161600             GO TO DIV-FAIL-F4-19-2.
161700     PERFORM PASS
161800     GO TO DIV-WRITE-F4-19-2.
161900 DIV-DELETE-F4-19-2.
162000     PERFORM DE-LETE.
162100     GO TO DIV-WRITE-F4-19-2.
162200 DIV-FAIL-F4-19-2.
162300     MOVE    WS-REM (25ANS) TO COMPUTED-N
162400     MOVE    4     TO CORRECT-N
162500     MOVE   "INVALID REMAINDER" TO RE-MARK
162600     PERFORM FAIL
162700     PERFORM PRINT-DETAIL
162800     ADD     1 TO REC-CT
162900     MOVE    25ANS TO COMPUTED-N
163000     MOVE    16    TO CORRECT-N
163100     MOVE   "INVALID SUBSCRIPT FOR REMAINDER" TO RE-MARK
163200     PERFORM FAIL.
163300 DIV-WRITE-F4-19-2.
163400     PERFORM PRINT-DETAIL.
163500*
163600 DIV-INIT-F4-20.
163700     MOVE "DIV-TEST-F4-20" TO PAR-NAME.
163800     MOVE 10.0 TO WRK-DU-2V1-1.
163900     MOVE 3.14159265358979323 TO WRK-DU-1V17-1.
164000     MOVE    ZERO TO REC-CT.
164100 DIV-TEST-F4-20.
164200     DIVIDE WRK-DU-2V1-1 INTO WRK-DU-1V17-1 GIVING WRK-DU-1V5-1
164300         ROUNDED REMAINDER WRK-NE-1
164400          ON SIZE ERROR GO TO DIV-FAIL-F4-20.
164500     GO TO  DIV-TEST-F4-20-1.
164600 DIV-DELETE-F4-20.
164700     PERFORM DE-LETE.
164800     PERFORM PRINT-DETAIL.
164900     GO TO CCVS-EXIT.
165000 DIV-FAIL-F4-20.
165100     PERFORM FAIL.
165200     MOVE "SIZE ERROR SHOULD NOT BE EXECUTED" TO RE-MARK.
165300     PERFORM PRINT-DETAIL.
165400*
165500 DIV-TEST-F4-20-1.
165600     MOVE   "DIV-TEST-F4-20-1" TO PAR-NAME.
165700     MOVE 1 TO REC-CT.
165800     IF WRK-DU-1V5-1 = 0.31416
165900          PERFORM PASS
166000          GO TO DIV-WRITE-F4-20-1
166100     ELSE
166200          GO TO DIV-FAIL-F4-20-1.
166300 DIV-DELETE-F4-20-1.
166400     PERFORM DE-LETE.
166500     GO TO DIV-WRITE-F4-20-1.
166600 DIV-FAIL-F4-20-1.
166700     PERFORM FAIL
166800     MOVE WRK-DU-1V5-1 TO COMPUTED-N
166900     MOVE 0.31416 TO CORRECT-N.
167000 DIV-WRITE-F4-20-1.
167100     PERFORM PRINT-DETAIL.
167200*
167300 DIV-TEST-F4-20-2.
167400     ADD 1 TO REC-CT.
167500     MOVE   "DIV-TEST-F4-20-2" TO PAR-NAME.
167600     IF WRK-NE-1 = ".0000/92653,58979,32"
167700            PERFORM PASS
167800            GO TO DIV-WRITE-F4-20-2
167900     ELSE
168000            GO TO DIV-FAIL-F4-20-2.
168100 DIV-DELETE-F4-20-2.
168200     PERFORM DE-LETE.
168300     GO TO DIV-WRITE-F4-20-2.
168400 DIV-FAIL-F4-20-2.
168500     PERFORM FAIL
168600     MOVE WRK-NE-1 TO COMPUTED-A
168700     MOVE ".0000/92653,58979,32"  TO CORRECT-A.
168800 DIV-WRITE-F4-20-2.
168900     PERFORM PRINT-DETAIL.
169000*
169100 CCVS-EXIT SECTION.
169200 CCVS-999999.
169300     GO TO CLOSE-FILES.
