000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC205A.
000400*                                                              *
000500****************************************************************
000600*                                                              *
000700*    VALIDATION FOR:-                                          *
000800*                                                              *
000900*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
001000*                                                              *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-82  - SOURCE COMPUTER NAME.                         *
001900*        X-83  - OBJECT COMPUTER NAME.                         *
002000*                                                              *
002100****************************************************************
002200*                                                              *
002300*    PROGRAM NC205A TESTS THE CONTINUATION OF COBOL WORDS,     *
002400*    NUMERIC AND NON-NUMERIC LITERALS AND PICTURE STRINGS USING*
002500*    A HYPHEN IN THE INDICATOR AREA OF CONTINUATION LINES.     *
002600*                                                              *
002700****************************************************************
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 77  WS-TEST-12-DATA
004500                        PIC S9(
004600-                              6)V9(6).
004700 77  PROCEDURE
004800-    DIVISION PICTURE X.
004900 77  CONT-
005000-         A             PIC
005100-                          TURE X(10) VAL
005200-                                        UE               "GOVERNM
005300-    "ENT".
005400 77  CONT-B                       PICTURE S9(5)V9(5) VALUE ZERO.
005500 77  CONT-C                       PICTURE 9(8).
005600 77  CONT-D                       PICTURE 9(5).
005700 77  CONT-E                       PICTURE 9999.
005800 77  CONT-F                       PICTURE 9(5).
005900 77  CONT-88              PICTURE S99.
006000     88 GREATERZERO          VALUE -10.
006100     88 NEGATIVEZERO       VALUE +10.
006200 77
006300
006400     SPACING-77
006500      PICTURE
006600
006700     X(10)                                                   VALUE
006800
006900     "ABCDE12345".
007000 77  SPACING-SEND       PICTURE 9(10) VALUE 1234567890.
007100 77  SPACING-RECEIVE    PICTURE
007200
007300
007400
007500
007600
007700
007800
007900
008000
008100
008200
008300
008400
008500
008600
008700
008800
008900
009000
009100
009200
009300
009400
009500
009600
009700
009800
009900
010000
010100
010200
010300
010400
010500
010600
010700
010800
010900
011000
011100
011200
011300
011400
011500
011600
011700
011800
011900
012000
012100
012200
012300
012400
012500
012600
012700
012800
012900
013000
013100
013200     9999999999.
013300 01  SPACING-01. 02 SPACING-02. 03 SPACING-03 PICTURE XX. 02
013400     SPACING-2. 03 SPACING-3. 04 SPACING-4 PICTURE X(8).
013500 01  CONT-G
013600-           RP.
013700                                  02 LEVEL-02.
013800                                                      03 LEVEL-03.
013900     04
014000       LEVEL-
014100-            04         PICTURE XXXXXXXXXX.
014200 01  TEST-RESULTS.
014300     02 FILLER                   PIC X      VALUE SPACE.
014400     02 FEATURE                  PIC X(20)  VALUE SPACE.
014500     02 FILLER                   PIC X      VALUE SPACE.
014600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
014700     02 FILLER                   PIC X      VALUE SPACE.
014800     02  PAR-NAME.
014900       03 FILLER                 PIC X(19)  VALUE SPACE.
015000       03  PARDOT-X              PIC X      VALUE SPACE.
015100       03 DOTVALUE               PIC 99     VALUE ZERO.
015200     02 FILLER                   PIC X(8)   VALUE SPACE.
015300     02 RE-MARK                  PIC X(61).
015400 01  TEST-COMPUTED.
015500     02 FILLER                   PIC X(30)  VALUE SPACE.
015600     02 FILLER                   PIC X(17)  VALUE
015700            "       COMPUTED=".
015800     02 COMPUTED-X.
015900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
016000     03 COMPUTED-N               REDEFINES COMPUTED-A
016100                                 PIC -9(9).9(9).
016200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
016300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
016400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
016500     03       CM-18V0 REDEFINES COMPUTED-A.
016600         04 COMPUTED-18V0                    PIC -9(18).
016700         04 FILLER                           PIC X.
016800     03 FILLER PIC X(50) VALUE SPACE.
016900 01  TEST-CORRECT.
017000     02 FILLER PIC X(30) VALUE SPACE.
017100     02 FILLER PIC X(17) VALUE "       CORRECT =".
017200     02 CORRECT-X.
017300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
017400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
017500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
017600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
017700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
017800     03      CR-18V0 REDEFINES CORRECT-A.
017900         04 CORRECT-18V0                     PIC -9(18).
018000         04 FILLER                           PIC X.
018100     03 FILLER PIC X(2) VALUE SPACE.
018200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
018300 01  CCVS-C-1.
018400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
018500-    "SS  PARAGRAPH-NAME
018600-    "       REMARKS".
018700     02 FILLER                     PIC X(20)    VALUE SPACE.
018800 01  CCVS-C-2.
018900     02 FILLER                     PIC X        VALUE SPACE.
019000     02 FILLER                     PIC X(6)     VALUE "TESTED".
019100     02 FILLER                     PIC X(15)    VALUE SPACE.
019200     02 FILLER                     PIC X(4)     VALUE "FAIL".
019300     02 FILLER                     PIC X(94)    VALUE SPACE.
019400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
019500 01  REC-CT                        PIC 99       VALUE ZERO.
019600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
019700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
019800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
019900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
020000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
020100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
020200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
020300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
020400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
020500 01  CCVS-H-1.
020600     02  FILLER                    PIC X(39)    VALUE SPACES.
020700     02  FILLER                    PIC X(42)    VALUE
020800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
020900     02  FILLER                    PIC X(39)    VALUE SPACES.
021000 01  CCVS-H-2A.
021100   02  FILLER                        PIC X(40)  VALUE SPACE.
021200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
021300   02  FILLER                        PIC XXXX   VALUE
021400     "4.2 ".
021500   02  FILLER                        PIC X(28)  VALUE
021600            " COPY - NOT FOR DISTRIBUTION".
021700   02  FILLER                        PIC X(41)  VALUE SPACE.
021800
021900 01  CCVS-H-2B.
022000   02  FILLER                        PIC X(15)  VALUE
022100            "TEST RESULT OF ".
022200   02  TEST-ID                       PIC X(9).
022300   02  FILLER                        PIC X(4)   VALUE
022400            " IN ".
022500   02  FILLER                        PIC X(12)  VALUE
022600     " HIGH       ".
022700   02  FILLER                        PIC X(22)  VALUE
022800            " LEVEL VALIDATION FOR ".
022900   02  FILLER                        PIC X(58)  VALUE
023000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
023100 01  CCVS-H-3.
023200     02  FILLER                      PIC X(34)  VALUE
023300            " FOR OFFICIAL USE ONLY    ".
023400     02  FILLER                      PIC X(58)  VALUE
023500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
023600     02  FILLER                      PIC X(28)  VALUE
023700            "  COPYRIGHT   1985 ".
023800 01  CCVS-E-1.
023900     02 FILLER                       PIC X(52)  VALUE SPACE.
024000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
024100     02 ID-AGAIN                     PIC X(9).
024200     02 FILLER                       PIC X(45)  VALUE SPACES.
024300 01  CCVS-E-2.
024400     02  FILLER                      PIC X(31)  VALUE SPACE.
024500     02  FILLER                      PIC X(21)  VALUE SPACE.
024600     02 CCVS-E-2-2.
024700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
024800         03 FILLER                   PIC X      VALUE SPACE.
024900         03 ENDER-DESC               PIC X(44)  VALUE
025000            "ERRORS ENCOUNTERED".
025100 01  CCVS-E-3.
025200     02  FILLER                      PIC X(22)  VALUE
025300            " FOR OFFICIAL USE ONLY".
025400     02  FILLER                      PIC X(12)  VALUE SPACE.
025500     02  FILLER                      PIC X(58)  VALUE
025600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025700     02  FILLER                      PIC X(13)  VALUE SPACE.
025800     02 FILLER                       PIC X(15)  VALUE
025900             " COPYRIGHT 1985".
026000 01  CCVS-E-4.
026100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
026200     02 FILLER                       PIC X(4)   VALUE " OF ".
026300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
026400     02 FILLER                       PIC X(40)  VALUE
026500      "  TESTS WERE EXECUTED SUCCESSFULLY".
026600 01  XXINFO.
026700     02 FILLER                       PIC X(19)  VALUE
026800            "*** INFORMATION ***".
026900     02 INFO-TEXT.
027000       04 FILLER                     PIC X(8)   VALUE SPACE.
027100       04 XXCOMPUTED                 PIC X(20).
027200       04 FILLER                     PIC X(5)   VALUE SPACE.
027300       04 XXCORRECT                  PIC X(20).
027400     02 INF-ANSI-REFERENCE           PIC X(48).
027500 01  HYPHEN-LINE.
027600     02 FILLER  PIC IS X VALUE IS SPACE.
027700     02 FILLER  PIC IS X(65)    VALUE IS "************************
027800-    "*****************************************".
027900     02 FILLER  PIC IS X(54)    VALUE IS "************************
028000-    "******************************".
028100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
028200     "NC205A".
028300 PROCEDURE DIVISION.
028400 CCVS1 SECTION.
028500 OPEN-FILES.
028600     OPEN     OUTPUT PRINT-FILE.
028700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
028800     MOVE    SPACE TO TEST-RESULTS.
028900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
029000     GO TO CCVS1-EXIT.
029100 CLOSE-FILES.
029200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029300 TERMINATE-CCVS.
029400S    EXIT PROGRAM.
029500STERMINATE-CALL.
029600     STOP     RUN.
029700 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029800 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029900 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
030000 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
030100     MOVE "****TEST DELETED****" TO RE-MARK.
030200 PRINT-DETAIL.
030300     IF REC-CT NOT EQUAL TO ZERO
030400             MOVE "." TO PARDOT-X
030500             MOVE REC-CT TO DOTVALUE.
030600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030800        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030900          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
031000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
031100     MOVE SPACE TO CORRECT-X.
031200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
031300     MOVE     SPACE TO RE-MARK.
031400 HEAD-ROUTINE.
031500     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031600     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031700     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031800     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031900 COLUMN-NAMES-ROUTINE.
032000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
032300 END-ROUTINE.
032400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
032500 END-RTN-EXIT.
032600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032700 END-ROUTINE-1.
032800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032900      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
033000      ADD PASS-COUNTER TO ERROR-HOLD.
033100*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
033200      MOVE PASS-COUNTER TO CCVS-E-4-1.
033300      MOVE ERROR-HOLD TO CCVS-E-4-2.
033400      MOVE CCVS-E-4 TO CCVS-E-2-2.
033500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033600  END-ROUTINE-12.
033700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033800     IF       ERROR-COUNTER IS EQUAL TO ZERO
033900         MOVE "NO " TO ERROR-TOTAL
034000         ELSE
034100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
034200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
034300     PERFORM WRITE-LINE.
034400 END-ROUTINE-13.
034500     IF DELETE-COUNTER IS EQUAL TO ZERO
034600         MOVE "NO " TO ERROR-TOTAL  ELSE
034700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035000      IF   INSPECT-COUNTER EQUAL TO ZERO
035100          MOVE "NO " TO ERROR-TOTAL
035200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
035300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
035400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035600 WRITE-LINE.
035700     ADD 1 TO RECORD-COUNT.
035800Y    IF RECORD-COUNT GREATER 50
035900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
036000Y        MOVE SPACE TO DUMMY-RECORD
036100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
036200Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
036300Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
036400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
036500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036600Y        MOVE ZERO TO RECORD-COUNT.
036700     PERFORM WRT-LN.
036800 WRT-LN.
036900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
037000     MOVE SPACE TO DUMMY-RECORD.
037100 BLANK-LINE-PRINT.
037200     PERFORM WRT-LN.
037300 FAIL-ROUTINE.
037400     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037900     MOVE   SPACES TO INF-ANSI-REFERENCE.
038000     GO TO  FAIL-ROUTINE-EX.
038100 FAIL-ROUTINE-WRITE.
038200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
038300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
038400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038500     MOVE   SPACES TO COR-ANSI-REFERENCE.
038600 FAIL-ROUTINE-EX. EXIT.
038700 BAIL-OUT.
038800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
039000 BAIL-OUT-WRITE.
039100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
039200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
039300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039400     MOVE   SPACES TO INF-ANSI-REFERENCE.
039500 BAIL-OUT-EX. EXIT.
039600 CCVS1-EXIT.
039700     EXIT.
039800 SECT-NC205A-001 SECTION.
039900 CON-INIT-GF.
040000     MOVE   "CONTINUATION ---" TO FEATURE.
040100     MOVE   "IV-44 7.2.2" TO ANSI-REFERENCE.
040200     PERFORM  PRINT-DETAIL.
040300 CON-INIT-GF-1.
040400     MOVE     "CON-TEST-GF-1" TO PAR-NAME
040500     MOVE     "  NUMERIC INTEGER" TO FEATURE.
040600 CON-TEST-GF-1.
040700     MOVE     4
040800-             5
040900-             6
041000-             7
041100-             8 TO CONT-B.
041200     IF CONT-B EQUAL TO 45678
041300              PERFORM PASS
041400              GO TO CON-WRITE-GF-1.
041500     GO TO CON-FAIL-GF-1.
041600 CON-DELETE-GF-1.
041700     PERFORM DE-LETE.
041800     GO TO CON-WRITE-GF-1.
041900 CON-FAIL-GF-1.
042000     PERFORM  FAIL.
042100     MOVE     CONT-B TO COMPUTED-N.
042200     MOVE     45678 TO CORRECT-N.
042300 CON-WRITE-GF-1.
042400     PERFORM  PRINT-DETAIL.
042500*
042600 CON-INIT-GF-2.
042700     MOVE     "CON-TEST-GF-2" TO PAR-NAME.
042800     MOVE     "  NUM NON-INTEGER" TO FEATURE.
042900 CON-TEST-GF-2.
043000     MOVE     -
043100-             9
043200-             9
043300-             9
043400-             .
043500-             7
043600-             7
043700-             7 TO CONT-B.
043800     IF CONT-B EQUAL TO -999.777
043900           PERFORM PASS
044000           GO TO CON-WRITE-GF-2.
044100     GO TO CON-FAIL-GF-2.
044200 CON-DELETE-GF-2.
044300     PERFORM  DE-LETE.
044400     GO TO CON-WRITE-GF-2.
044500 CON-FAIL-GF-2.
044600     PERFORM  FAIL.
044700     MOVE CONT-B   TO COMPUTED-N.
044800     MOVE -999.777 TO CORRECT-N.
044900 CON-WRITE-GF-2.
045000     PERFORM  PRINT-DETAIL.
045100*
045200*    N.B. CONTIN-TEST-3 HAS BEEN REMOVED, AND SUBSEQUENT
045300*    TESTS HAVE BEEN RE-NUMBERED.
045400 CON-INIT-GF-3.
045500     MOVE     "  COMP CONDITIONAL" TO FEATURE.
045600     MOVE     "CON-TEST-GF-3" TO PAR-NAME.
045700 CON-TEST-GF-3.
045800     MOVE     -10 TO CONT-B.
045900     MOVE     10 TO CONT-C.
046000     MOVE     1 TO CONT-D.
046100     MOVE     0 TO CONT-E.
046200     MOVE     10 TO CONT-F.
046300     MOVE     -10 TO CONT-88.
046400     IF       CONT-E EQUA
046500-                        L TO ZERO
046600-                                 S AN
046700-                                     D GREATER
046800-                                              ZERO AND CONT-B
046900              EQUAL TO CONT-C OR ((((((0
047000
047100
047200
047300
047400
047500
047600
047700
047800
047900
048000
048100
048200
048300
048400
048500
048600
048700
048800
048900
049000
049100
049200
049300
049400
049500
049600
049700
049800
049900
050000
050100
050200
050300
050400
050500
050600
050700
050800
050900
051000
051100
051200
051300
051400
051500
051600
051700
051800
051900
052000
052100
052200
052300
052400
052500
052600
052700
052800
052900
053000
053100
053200
053300
053400
053500
053600
053700
053800
053900
054000
054100
054200
054300
054400
054500
054600
054700
054800
054900
055000              - CONT-D EQUAL TO CONT-D O
055100-                                             R -11 + CONT-F))))))
055200              AND N
055300-                            OT NEGATIVE
055400-                                       ZERO
055500              PERFORM PASS
055600         EL
055700-          SE
055800              GO TO CON-FAIL-GF-3.
055900     GO       TO CON-WRITE-GF-3.
056000 CON-DELETE-GF-3.
056100     PERFORM  DE-LETE.
056200     GO TO CON-WRITE-GF-3.
056300
056400
056500
056600
056700 CON-FAIL-GF-3.
056800     PERFORM FAIL.
056900 CON-WRITE-GF-3.
057000     PERFORM  PRINT-DETAIL.
057100*
057200 CON-INIT-GF-4.
057300     MOVE     "  RESERVED WORDS" TO FEATURE
057400     MOVE     "CON-TEST-GF-4" TO PAR-NAME.
057500     MOVE     54321 TO CONT-D.
057600     MOVE     12 TO CONT-E.
057700     MOVE     1199997 TO CONT-C.
057800 CON-TEST-GF-4.
057900     DIV
058000-       ID
058100-         E   CONT-E IN
058200-                      TO CONT-C GIV
058300-                                   IN
058400-                                     G CONT-D ROUN
058500-                                                  DE
058600-                                                    D O
058700-                                                       N SIZE ERR
058800-    OR       PERFOR
058900-                   M PASS G
059000-                           O T
059100-                              O CON-WRITE-GF-4.
059200     GO       TO CON-FAIL-GF-4.
059300 CON-DELETE-GF-4.
059400     PERFORM  DE-LETE.
059500     GO       TO CON-WRITE-GF-4.
059600 CON-FAIL-GF-4.
059700     PERFORM  FAIL.
059800     MOVE     CONT-D TO COMPUTED-N.
059900     MOVE     54321 TO CORRECT-N.
060000     MOVE     "SIZE ERROR EXPECTED" TO RE-MARK.
060100 CON-WRITE-GF-4.
060200     PERFORM  PRINT-DETAIL.
060300*
060400 CON-INIT-GF-5.
060500     MOVE     "  DATA-NAMES" TO FEATURE.
060600     MOVE     "CON-TEST-GF-5" TO PAR-NAME.
060700     MOVE     10000 TO CONT-D.
060800     MOVE     1000 TO CONT-F.
060900     MOVE     ZERO TO CONT-C.
061000 CON-TEST-GF-5.
061100     IF       CONT
061200-                 -D EQUAL TO 10000 ADD CONT
061300-                                           -D CONT
061400-                                                  -F GIVING CONT-
061500-    C.
061600     IF       CONT-C EQUAL TO 11000
061700              PERFORM PASS GO TO CON-WRITE-GF-5.
061800     GO       TO CON-FAIL-GF-5.
061900 CON-DELETE-GF-5.
062000     PERFORM  DE-LETE.
062100     GO       TO CON-WRITE-GF-5.
062200 CON-FAIL-GF-5.
062300     PERFORM  FAIL.
062400     MOVE     CONT-C TO COMPUTED-A.
062500     MOVE     11000 TO CORRECT-A.
062600 CON-WRITE-GF-5.
062700     PERFORM  PRINT-DETAIL.
062800*
062900 CON-TEST-GF-6.
063000     MOVE     "CON-TEST-GF-6" TO PAR-NAME.
063100     MOVE     "  PARAGRAPH-NAMES" TO FEATURE.
063200     PERFORM  PA
063300-               SS.
063400     IF       P-OR-F NOT EQUAL TO "PASS" GO TO CON-FAIL-GF-6.
063500     GO       TO CON
063600-                   -WRITE-GF-6.
063700 CON-TEST-GF-6-1.
063800     GO       TO CON-FAIL-GF-6.
063900 CON-DELETE-GF-6.
064000     PERFORM  DE-LETE.
064100     GO       TO CON-WRITE-GF-6.
064200 CON-FAIL-GF-6.
064300     PERFORM  FAIL.
064400     MOVE     "CNTD PARA-NAME NOT FOUND" TO RE-MARK.
064500 CON-WRITE-GF-6.
064600     PERFORM  PRINT-DETAIL.
064700*
064800*    N.B. THE REFERENCE TO THE OLD TEST CALLED
064900*        CONTIN-TEST-8 HAS BEEN REMOVED.
065000*        NOTE TEST MOVED TO SQ215.
065100*
065200 CON-INIT-GF-7.
065300     MOVE     "  RECORD, ITEM DESCR" TO FEATURE.
065400     MOVE     "CON-TEST-GF-7" TO PAR-NAME.
065500*     N.B.  CONT-A IS NOT EXPLICITLY INITIALISED HERE
065600*           BECAUSE THE -VALUE IS- CLAUSE OF THE
065700*           DEFINITION IS UNDER TEST IN THE NEXT PARAGRAPH.
065800 CON-TEST-GF-7.
065900     MOVE     CONT-A TO CONT-GRP.
066000     IF LEVEL-04 EQUAL TO "GOVERNMENT"
066100              PERFORM PASS
066200              GO TO CON-WRITE-GF-7.
066300     GO TO CON-FAIL-GF-7.
066400 CON-DELETE-GF-7.
066500     PERFORM  DE-LETE.
066600     GO       TO CON-WRITE-GF-7.
066700 CON-FAIL-GF-7.
066800     PERFORM  FAIL.
066900     MOVE     LEVEL-04 TO COMPUTED-A.
067000     MOVE     "GOVERNMENT"  TO CORRECT-A.
067100 CON-WRITE-GF-7.
067200     PERFORM  PRINT-DETAIL.
067300 CON-INIT-GF-8.
067400     MOVE     "SPACES BETWEEN WORDS" TO FEATURE.
067500     MOVE     "CON-TEST-GF-10" TO PAR-NAME.
067600     MOVE     "ABCDE12345"     TO SPACING-77.
067700 CON-TEST-GF-8.
067800     MOVE     SPACING-77 TO SPACING-01.
067900     IF       SPACING-4 EQUAL TO "CDE12345"
068000              PERFORM PASS GO TO CON-WRITE-GF-8.
068100     GO       TO CON-FAIL-GF-8.
068200 CON-DELETE-GF-8.
068300     PERFORM  DE-LETE.
068400     GO       TO CON-WRITE-GF-8.
068500 CON-FAIL-GF-8.
068600     PERFORM  FAIL.
068700     MOVE     SPACING-4 TO COMPUTED-A.
068800     MOVE     "CDE12345" TO CORRECT-A.
068900 CON-WRITE-GF-8.
069000     PERFORM  PRINT-DETAIL.
069100*
069200 CON-INIT-GF-9.
069300     MOVE   "CON-WRITE-GF-9" TO PAR-NAME.
069400     MOVE     1234567890   TO SPACING-SEND.
069500     MOVE     SPACING-SEND TO SPACING-RECEIVE.
069600 CON-TEST-GF-9.
069700     IF       SPACING-RECEIVE EQUAL TO 1234567890
069800              PERFORM
069900
070000
070100
070200
070300
070400
070500
070600
070700
070800
070900
071000
071100
071200
071300
071400
071500
071600
071700
071800
071900
072000
072100
072200
072300
072400
072500
072600
072700
072800
072900
073000
073100
073200
073300
073400
073500
073600
073700
073800
073900
074000
074100
074200
074300
074400
074500
074600
074700
074800
074900
075000
075100
075200
075300
075400
075500
075600
075700
075800
075900
076000
076100
076200
076300
076400
076500
076600
076700
076800
076900                      PA
077000-                       SS GO TO CON-WRITE-GF-9.
077100     GO                 TO CON-FAIL-GF-9.
077200 CON-DELETE-GF-9.
077300     PERFORM  DE-LETE.
077400     GO       TO CON-WRITE-GF-9.
077500 CON-FAIL-GF-9.
077600     PERFORM  FAIL.
077700     MOVE     SPACING-RECEIVE TO COMPUTED-18V0.
077800     MOVE     1234567890 TO CORRECT-18V0.
077900 CON-WRITE-GF-9.
078000     PERFORM PRINT-DETAIL.
078100*
078200 CON-INIT-GF-10.
078300*    ===-->  PICTURE CHARACTER STRING CONTINUED  <--===
078400     MOVE   "IV-44 7.2.2"              TO ANSI-REFERENCE.
078500     MOVE   "PICTURE STRING CONTINUED" TO FEATURE
078600     MOVE   "CON-TEST-GF-10"           TO PAR-NAME.
078700 CON-TEST-GF-10-1.
078800     MOVE    654321.987654 TO WS-TEST-12-DATA.
078900     IF WS-TEST-12-DATA = 654321.987654
079000             PERFORM PASS
079100             GO TO CON-WRITE-GF-10.
079200     GO TO CON-FAIL-GF-10.
079300 CON-DELETE-GF-10.
079400     PERFORM DE-LETE.
079500     GO TO   CON-WRITE-GF-10.
079600 CON-FAIL-GF-10.
079700     PERFORM  FAIL.
079800     MOVE     WS-TEST-12-DATA TO COMPUTED-N.
079900     MOVE     654321.987654   TO CORRECT-N.
080000 CON-WRITE-GF-10.
080100     PERFORM  PRINT-DETAIL.
080200 CCVS-EXIT SECTION.
080300 CCVS-999999.
080400     GO TO CLOSE-FILES.
