000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC207A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM NC207A TESTS THE USE OF FORMAT 1 QUALIFICATION    *
002300*    USING FORMATS 1, 2 AND 3 OF THE "ADD" STATEMENT, FORMATS  *
002400*    2 AND 3 OF THE "SUBTRACT" STATEMENT, FORMAT 2 OF THE      *
002500*    "MULTIPLY" STATEMENT AND FORMAT 3 OF THE "DIVIDE"*
002600*    STATEMENT.                                                *
002700*    THE MAJORITY OF TESTST USE UP TO FIVE LEVELS OF           *
002800*    QUALIFICATION BUT THE MINIMUM REQUIREMENT OF 49 LEVELS IN *
002900*    THE NUCLEUS IS ALSO TESTED.                               *
003000*                                                              *
003100****************************************************************
003200 ENVIRONMENT DIVISION.
003300 CONFIGURATION SECTION.
003400 SOURCE-COMPUTER.
003500     XXXXX082.
003600 OBJECT-COMPUTER.
003700     XXXXX083.
003800 INPUT-OUTPUT SECTION.
003900 FILE-CONTROL.
004000     SELECT PRINT-FILE ASSIGN TO
004100     XXXXX055.
004200 DATA DIVISION.
004300 FILE SECTION.
004400 FD  PRINT-FILE.
004500 01  PRINT-REC PICTURE X(120).
004600 01  DUMMY-RECORD PICTURE X(120).
004700 WORKING-STORAGE SECTION.
004800 77  ACCUMULATOR1                PIC 9(18) VALUE ZERO.
004900 77  ACCUMULATOR2                PIC 9(18) VALUE ZERO.
005000 01  TABLE-LEVEL-5A.
005100     02  TABLE-LEVEL-4A.
005200         03  TABLE-LEVEL-3A.
005300             04  TABLE-LEVEL-2A.
005400                 05  TABLE-LEVEL-1A.
005500                     06  TBL-ITEM-1   PIC 9  VALUE 1.
005600                 05  TABLE-LEVEL-1B.
005700                     06  TBL-ITEM-1   PIC 9(2)  VALUE 2.
005800             04  TABLE-LEVEL-2B.
005900                 05  TABLE-LEVEL-1A.
006000                     06  TBL-ITEM-1   PIC 9(3)  VALUE 3.
006100                 05  TABLE-LEVEL-1B.
006200                     06  TBL-ITEM-1   PIC 9(4)  VALUE 4.
006300         03  TABLE-LEVEL-3B.
006400             04  TABLE-LEVEL-2A.
006500                 05  TABLE-LEVEL-1A.
006600                     06  TBL-ITEM-1   PIC 9(5)  VALUE 5.
006700                 05  TABLE-LEVEL-1B.
006800                     06  TBL-ITEM-1   PIC 9(6)  VALUE 6.
006900             04  TABLE-LEVEL-2B.
007000                 05  TABLE-LEVEL-1A.
007100                     06  TBL-ITEM-1   PIC 9(7)  VALUE 7.
007200                 05  TABLE-LEVEL-1B.
007300                     06  TBL-ITEM-1   PIC 9(8)  VALUE 8.
007400     02  TABLE-LEVEL-4B.
007500         03  TABLE-LEVEL-3A.
007600             04  TABLE-LEVEL-2A.
007700                 05  TABLE-LEVEL-1A.
007800                     06  TBL-ITEM-1   PIC 9(9)  VALUE 9.
007900                 05  TABLE-LEVEL-1B.
008000                     06  TBL-ITEM-1   PIC 9(10) VALUE 10.
008100             04  TABLE-LEVEL-2B.
008200                 05  TABLE-LEVEL-1A.
008300                     06  TBL-ITEM-1   PIC 9(11) VALUE 11.
008400                 05  TABLE-LEVEL-1B.
008500                     06  TBL-ITEM-1   PIC 9(12) VALUE 12.
008600         03  TABLE-LEVEL-3B.
008700             04  TABLE-LEVEL-2A.
008800                 05  TABLE-LEVEL-1A.
008900                     06  TBL-ITEM-1   PIC 9(13) VALUE 13.
009000                 05  TABLE-LEVEL-1B.
009100                     06  TBL-ITEM-1   PIC 9(14) VALUE 14.
009200             04  TABLE-LEVEL-2B.
009300                 05  TABLE-LEVEL-1A.
009400                     06  TBL-ITEM-1   PIC 9(15) VALUE 15.
009500                 05  TABLE-LEVEL-1B.
009600                     06  TBL-ITEM-1   PIC 9(16) VALUE 16.
009700 01  TABLE-LEVEL-5B.
009800     02  TABLE-LEVEL-4A.
009900         03  TABLE-LEVEL-3A.
010000             04  TABLE-LEVEL-2A.
010100                 05  TABLE-LEVEL-1A.
010200                     06  TBL-ITEM-1   PIC 9(16) VALUE 16.
010300                 05  TABLE-LEVEL-1B.
010400                     06  TBL-ITEM-1   PIC 9(15) VALUE 15.
010500             04  TABLE-LEVEL-2B.
010600                 05  TABLE-LEVEL-1A.
010700                     06  TBL-ITEM-1   PIC 9(14) VALUE 14.
010800                 05  TABLE-LEVEL-1B.
010900                     06  TBL-ITEM-1   PIC 9(13) VALUE 13.
011000         03  TABLE-LEVEL-3B.
011100             04  TABLE-LEVEL-2A.
011200                 05  TABLE-LEVEL-1A.
011300                     06  TBL-ITEM-1   PIC 9(12) VALUE 12.
011400                 05  TABLE-LEVEL-1B.
011500                     06  TBL-ITEM-1   PIC 9(11) VALUE 11.
011600             04  TABLE-LEVEL-2B.
011700                 05  TABLE-LEVEL-1A.
011800                     06  TBL-ITEM-1   PIC 9(10) VALUE 10.
011900                 05  TABLE-LEVEL-1B.
012000                     06  TBL-ITEM-1   PIC 9(9)  VALUE 9.
012100     02  TABLE-LEVEL-4B.
012200         03  TABLE-LEVEL-3A.
012300             04  TABLE-LEVEL-2A.
012400                 05  TABLE-LEVEL-1A.
012500                     06  TBL-ITEM-1   PIC 9(8)  VALUE 8.
012600                 05  TABLE-LEVEL-1B.
012700                     06  TBL-ITEM-1   PIC 9(7)  VALUE 7.
012800             04  TABLE-LEVEL-2B.
012900                 05  TABLE-LEVEL-1A.
013000                     06  TBL-ITEM-1   PIC 9(6)  VALUE 6.
013100                 05  TABLE-LEVEL-1B.
013200                     06  TBL-ITEM-1   PIC 9(5)  VALUE 5.
013300         03  TABLE-LEVEL-3B.
013400             04  TABLE-LEVEL-2A.
013500                 05  TABLE-LEVEL-1A.
013600                     06  TBL-ITEM-1   PIC 9(4)  VALUE 4.
013700                 05  TABLE-LEVEL-1B.
013800                     06  TBL-ITEM-1   PIC 9(3)  VALUE 3.
013900             04  TABLE-LEVEL-2B.
014000                 05  TABLE-LEVEL-1A.
014100                     06  TBL-ITEM-1   PIC 9(2)  VALUE 2.
014200                 05  TABLE-LEVEL-1B.
014300                     06  TBL-ITEM-1   PIC 99 VALUE 1.
014400
014500 01  TABLE-LEVEL-5C.
014600     02  TABLE-LEVEL-4A.
014700         03  TABLE-LEVEL-3A.
014800             04  TABLE-LEVEL-2A.
014900                 05  TABLE-LEVEL-1A.
015000                     06  TBL-ITEM-1   PIC 9  VALUE 1.
015100                 05  TABLE-LEVEL-1B.
015200                     06  TBL-ITEM-1   PIC 9(2)  VALUE  2.
015300             04  TABLE-LEVEL-2B.
015400                 05  TABLE-LEVEL-1A.
015500                     06  TBL-ITEM-1   PIC 9(3)  VALUE  3.
015600                 05  TABLE-LEVEL-1B.
015700                     06  TBL-ITEM-1   PIC 9(4)  VALUE  4.
015800         03  TABLE-LEVEL-3B.
015900             04  TABLE-LEVEL-2A.
016000                 05  TABLE-LEVEL-1A.
016100                     06  TBL-ITEM-1   PIC 9(5)  VALUE  5.
016200                 05  TABLE-LEVEL-1B.
016300                     06  TBL-ITEM-1   PIC 9(6)  VALUE  6.
016400             04  TABLE-LEVEL-2B.
016500                 05  TABLE-LEVEL-1A.
016600                     06  TBL-ITEM-1   PIC 9(7)  VALUE  7.
016700                 05  TABLE-LEVEL-1B.
016800                     06  TBL-ITEM-1   PIC 9(8)  VALUE  8.
016900     02  TABLE-LEVEL-4B.
017000         03  TABLE-LEVEL-3A.
017100             04  TABLE-LEVEL-2A.
017200                 05  TABLE-LEVEL-1A.
017300                     06  TBL-ITEM-1   PIC 9(9)  VALUE  9.
017400                 05  TABLE-LEVEL-1B.
017500                     06  TBL-ITEM-1   PIC 9(10) VALUE 10.
017600             04  TABLE-LEVEL-2B.
017700                 05  TABLE-LEVEL-1A.
017800                     06  TBL-ITEM-1   PIC 9(11) VALUE 11.
017900                 05  TABLE-LEVEL-1B.
018000                     06  TBL-ITEM-1   PIC 9(12) VALUE 12.
018100         03  TABLE-LEVEL-3B.
018200             04  TABLE-LEVEL-2A.
018300                 05  TABLE-LEVEL-1A.
018400                     06  TBL-ITEM-1   PIC 9(13) VALUE 13.
018500                 05  TABLE-LEVEL-1B.
018600                     06  TBL-ITEM-1   PIC 9(14) VALUE 14.
018700             04  TABLE-LEVEL-2B.
018800                 05  TABLE-LEVEL-1A.
018900                     06  TBL-ITEM-1   PIC 9(15) VALUE 15.
019000                 05  TABLE-LEVEL-1B.
019100                     06  TBL-ITEM-1   PIC 9(16) VALUE 16.
019200 01  TABLE-5B-INIT.
019300     02 FILLER         PIC 9(16)  VALUE  16.
019400     02 FILLER         PIC 9(15)  VALUE  15.
019500     02 FILLER         PIC 9(14)  VALUE  14.
019600     02 FILLER         PIC 9(13)  VALUE  13.
019700     02 FILLER         PIC 9(12)  VALUE  12.
019800     02 FILLER         PIC 9(11)  VALUE  11.
019900     02 FILLER         PIC 9(10)  VALUE  10.
020000     02 FILLER         PIC 9(9)   VALUE  9.
020100     02 FILLER         PIC 9(8)   VALUE  8.
020200     02 FILLER         PIC 9(7)   VALUE  7.
020300     02 FILLER         PIC 9(6)   VALUE  6.
020400     02 FILLER         PIC 9(5)   VALUE  5.
020500     02 FILLER         PIC 9(4)   VALUE  4.
020600     02 FILLER         PIC 9(3)   VALUE  3.
020700     02 FILLER         PIC 9(2)   VALUE  2.
020800     02 FILLER         PIC 9(2)   VALUE  1.
020900 01  FIRST-GROUP.
021000  02 GROUP-02.
021100   03 GROUP-03.
021200    04 GROUP-04.
021300     05 GROUP-05.
021400      06 GROUP-06.
021500       07 GROUP-07.
021600        08 GROUP-08.
021700         09 GROUP-09.
021800          10 GROUP-10.
021900           11 GROUP-11.
022000            12 GROUP-12.
022100             13 GROUP-13.
022200              14 GROUP-14.
022300               15 GROUP-15.
022400                16 GROUP-16.
022500                 17 GROUP-17.
022600                  18 GROUP-18.
022700                   19 GROUP-19.
022800                    20 GROUP-20.
022900                     21 GROUP-21.
023000                      22 GROUP-22.
023100                       23 GROUP-23.
023200                        24 GROUP-24.
023300                         25 GROUP-25.
023400                          26 GROUP-26.
023500                           27 GROUP-27.
023600                            28 GROUP-28.
023700                             29 GROUP-29.
023800                              30 GROUP-30.
023900                               31 GROUP-31.
024000                                32 GROUP-32.
024100                                 33 GROUP-33.
024200                                  34 GROUP-34.
024300                                   35 GROUP-35.
024400                                    36 GROUP-36.
024500                                     37 GROUP-37.
024600                                      38 GROUP-38.
024700                                       39 GROUP-39.
024800                                        40 GROUP-40.
024900                                         41 GROUP-41.
025000                                          42 GROUP-42.
025100                                           43 GROUP-43.
025200                                            44 GROUP-44.
025300                                             45 GROUP-45.
025400                                              46 GROUP-46.
025500                                               47 GROUP-47.
025600                                                48 GROUP-48.
025700                   49 GROUP-49-1  PIC 9(4)           VALUE 1.
025800                   49 GROUP-49-2  PIC S9(3)  COMP    VALUE 2.
025900                   49 GROUP-49-3  PIC S9(15) COMP    VALUE 3.
026000                   49 GROUP-49-4  PIC S9(8)  COMP    VALUE 4.
026100                   49 GROUP-49-5  PIC 9(8)           VALUE 5.
026200 01  SECOND-GROUP.
026300  02 GROUP-02.
026400   03 GROUP-03.
026500    04 GROUP-04.
026600     05 GROUP-05.
026700      06 GROUP-06.
026800       07 GROUP-07.
026900        08 GROUP-08.
027000         09 GROUP-09.
027100          10 GROUP-10.
027200           11 GROUP-11.
027300            12 GROUP-12.
027400             13 GROUP-13.
027500              14 GROUP-14.
027600               15 GROUP-15.
027700                16 GROUP-16.
027800                 17 GROUP-17.
027900                  18 GROUP-18.
028000                   19 GROUP-19.
028100                    20 GROUP-20.
028200                     21 GROUP-21.
028300                      22 GROUP-22.
028400                       23 GROUP-23.
028500                        24 GROUP-24.
028600                         25 GROUP-25.
028700                          26 GROUP-26.
028800                           27 GROUP-27.
028900                            28 GROUP-28.
029000                             29 GROUP-29.
029100                              30 GROUP-30.
029200                               31 GROUP-31.
029300                                32 GROUP-32.
029400                                 33 GROUP-33.
029500                                  34 GROUP-34.
029600                                   35 GROUP-35.
029700                                    36 GROUP-36.
029800                                     37 GROUP-37.
029900                                      38 GROUP-38.
030000                                       39 GROUP-39.
030100                                        40 GROUP-40.
030200                                         41 GROUP-41.
030300                                          42 GROUP-42.
030400                                           43 GROUP-43.
030500                                            44 GROUP-44.
030600                                             45 GROUP-45.
030700                                              46 GROUP-46.
030800                                               47 GROUP-47.
030900                                                48 GROUP-48.
031000                   49 GROUP-49-1  PIC 9(4)           VALUE 100.
031100                   49 GROUP-49-2  PIC S9(3)  COMP    VALUE 200.
031200                   49 GROUP-49-3  PIC S9(15) COMP    VALUE 300.
031300                   49 GROUP-49-4  PIC S9(8)  COMP    VALUE 400.
031400                   49 GROUP-49-5  PIC 9(8)           VALUE 500.
031500                     88 LEVEL-49-OK VALUE 500.
031600 01  TEST-RESULTS.
031700     02 FILLER                   PIC X      VALUE SPACE.
031800     02 FEATURE                  PIC X(20)  VALUE SPACE.
031900     02 FILLER                   PIC X      VALUE SPACE.
032000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
032100     02 FILLER                   PIC X      VALUE SPACE.
032200     02  PAR-NAME.
032300       03 FILLER                 PIC X(19)  VALUE SPACE.
032400       03  PARDOT-X              PIC X      VALUE SPACE.
032500       03 DOTVALUE               PIC 99     VALUE ZERO.
032600     02 FILLER                   PIC X(8)   VALUE SPACE.
032700     02 RE-MARK                  PIC X(61).
032800 01  TEST-COMPUTED.
032900     02 FILLER                   PIC X(30)  VALUE SPACE.
033000     02 FILLER                   PIC X(17)  VALUE
033100            "       COMPUTED=".
033200     02 COMPUTED-X.
033300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
033400     03 COMPUTED-N               REDEFINES COMPUTED-A
033500                                 PIC -9(9).9(9).
033600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
033700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
033800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
033900     03       CM-18V0 REDEFINES COMPUTED-A.
034000         04 COMPUTED-18V0                    PIC -9(18).
034100         04 FILLER                           PIC X.
034200     03 FILLER PIC X(50) VALUE SPACE.
034300 01  TEST-CORRECT.
034400     02 FILLER PIC X(30) VALUE SPACE.
034500     02 FILLER PIC X(17) VALUE "       CORRECT =".
034600     02 CORRECT-X.
034700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
034800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
034900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
035000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
035100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
035200     03      CR-18V0 REDEFINES CORRECT-A.
035300         04 CORRECT-18V0                     PIC -9(18).
035400         04 FILLER                           PIC X.
035500     03 FILLER PIC X(2) VALUE SPACE.
035600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
035700 01  CCVS-C-1.
035800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
035900-    "SS  PARAGRAPH-NAME
036000-    "       REMARKS".
036100     02 FILLER                     PIC X(20)    VALUE SPACE.
036200 01  CCVS-C-2.
036300     02 FILLER                     PIC X        VALUE SPACE.
036400     02 FILLER                     PIC X(6)     VALUE "TESTED".
036500     02 FILLER                     PIC X(15)    VALUE SPACE.
036600     02 FILLER                     PIC X(4)     VALUE "FAIL".
036700     02 FILLER                     PIC X(94)    VALUE SPACE.
036800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
036900 01  REC-CT                        PIC 99       VALUE ZERO.
037000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
037100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
037200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
037300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
037400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
037500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
037600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
037700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
037800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
037900 01  CCVS-H-1.
038000     02  FILLER                    PIC X(39)    VALUE SPACES.
038100     02  FILLER                    PIC X(42)    VALUE
038200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
038300     02  FILLER                    PIC X(39)    VALUE SPACES.
038400 01  CCVS-H-2A.
038500   02  FILLER                        PIC X(40)  VALUE SPACE.
038600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
038700   02  FILLER                        PIC XXXX   VALUE
038800     "4.2 ".
038900   02  FILLER                        PIC X(28)  VALUE
039000            " COPY - NOT FOR DISTRIBUTION".
039100   02  FILLER                        PIC X(41)  VALUE SPACE.
039200
039300 01  CCVS-H-2B.
039400   02  FILLER                        PIC X(15)  VALUE
039500            "TEST RESULT OF ".
039600   02  TEST-ID                       PIC X(9).
039700   02  FILLER                        PIC X(4)   VALUE
039800            " IN ".
039900   02  FILLER                        PIC X(12)  VALUE
040000     " HIGH       ".
040100   02  FILLER                        PIC X(22)  VALUE
040200            " LEVEL VALIDATION FOR ".
040300   02  FILLER                        PIC X(58)  VALUE
040400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
040500 01  CCVS-H-3.
040600     02  FILLER                      PIC X(34)  VALUE
040700            " FOR OFFICIAL USE ONLY    ".
040800     02  FILLER                      PIC X(58)  VALUE
040900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
041000     02  FILLER                      PIC X(28)  VALUE
041100            "  COPYRIGHT   1985 ".
041200 01  CCVS-E-1.
041300     02 FILLER                       PIC X(52)  VALUE SPACE.
041400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
041500     02 ID-AGAIN                     PIC X(9).
041600     02 FILLER                       PIC X(45)  VALUE SPACES.
041700 01  CCVS-E-2.
041800     02  FILLER                      PIC X(31)  VALUE SPACE.
041900     02  FILLER                      PIC X(21)  VALUE SPACE.
042000     02 CCVS-E-2-2.
042100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
042200         03 FILLER                   PIC X      VALUE SPACE.
042300         03 ENDER-DESC               PIC X(44)  VALUE
042400            "ERRORS ENCOUNTERED".
042500 01  CCVS-E-3.
042600     02  FILLER                      PIC X(22)  VALUE
042700            " FOR OFFICIAL USE ONLY".
042800     02  FILLER                      PIC X(12)  VALUE SPACE.
042900     02  FILLER                      PIC X(58)  VALUE
043000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
043100     02  FILLER                      PIC X(13)  VALUE SPACE.
043200     02 FILLER                       PIC X(15)  VALUE
043300             " COPYRIGHT 1985".
043400 01  CCVS-E-4.
043500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
043600     02 FILLER                       PIC X(4)   VALUE " OF ".
043700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
043800     02 FILLER                       PIC X(40)  VALUE
043900      "  TESTS WERE EXECUTED SUCCESSFULLY".
044000 01  XXINFO.
044100     02 FILLER                       PIC X(19)  VALUE
044200            "*** INFORMATION ***".
044300     02 INFO-TEXT.
044400       04 FILLER                     PIC X(8)   VALUE SPACE.
044500       04 XXCOMPUTED                 PIC X(20).
044600       04 FILLER                     PIC X(5)   VALUE SPACE.
044700       04 XXCORRECT                  PIC X(20).
044800     02 INF-ANSI-REFERENCE           PIC X(48).
044900 01  HYPHEN-LINE.
045000     02 FILLER  PIC IS X VALUE IS SPACE.
045100     02 FILLER  PIC IS X(65)    VALUE IS "************************
045200-    "*****************************************".
045300     02 FILLER  PIC IS X(54)    VALUE IS "************************
045400-    "******************************".
045500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
045600     "NC207".
045700 PROCEDURE DIVISION.
045800 CCVS1 SECTION.
045900 OPEN-FILES.
046000     OPEN     OUTPUT PRINT-FILE.
046100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
046200     MOVE    SPACE TO TEST-RESULTS.
046300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
046400     GO TO CCVS1-EXIT.
046500 CLOSE-FILES.
046600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
046700 TERMINATE-CCVS.
046800S    EXIT PROGRAM.
046900STERMINATE-CALL.
047000     STOP     RUN.
047100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
047200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
047300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
047400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
047500     MOVE "****TEST DELETED****" TO RE-MARK.
047600 PRINT-DETAIL.
047700     IF REC-CT NOT EQUAL TO ZERO
047800             MOVE "." TO PARDOT-X
047900             MOVE REC-CT TO DOTVALUE.
048000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
048100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
048200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
048300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
048400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
048500     MOVE SPACE TO CORRECT-X.
048600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
048700     MOVE     SPACE TO RE-MARK.
048800 HEAD-ROUTINE.
048900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
049200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
049300 COLUMN-NAMES-ROUTINE.
049400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
049700 END-ROUTINE.
049800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
049900 END-RTN-EXIT.
050000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050100 END-ROUTINE-1.
050200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
050300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
050400      ADD PASS-COUNTER TO ERROR-HOLD.
050500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
050600      MOVE PASS-COUNTER TO CCVS-E-4-1.
050700      MOVE ERROR-HOLD TO CCVS-E-4-2.
050800      MOVE CCVS-E-4 TO CCVS-E-2-2.
050900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
051000  END-ROUTINE-12.
051100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
051200     IF       ERROR-COUNTER IS EQUAL TO ZERO
051300         MOVE "NO " TO ERROR-TOTAL
051400         ELSE
051500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
051600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
051700     PERFORM WRITE-LINE.
051800 END-ROUTINE-13.
051900     IF DELETE-COUNTER IS EQUAL TO ZERO
052000         MOVE "NO " TO ERROR-TOTAL  ELSE
052100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
052200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
052300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
052400      IF   INSPECT-COUNTER EQUAL TO ZERO
052500          MOVE "NO " TO ERROR-TOTAL
052600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
052700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
052800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
052900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
053000 WRITE-LINE.
053100     ADD 1 TO RECORD-COUNT.
053200Y    IF RECORD-COUNT GREATER 50
053300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
053400Y        MOVE SPACE TO DUMMY-RECORD
053500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
053600Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
053700Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
053800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
053900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
054000Y        MOVE ZERO TO RECORD-COUNT.
054100     PERFORM WRT-LN.
054200 WRT-LN.
054300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
054400     MOVE SPACE TO DUMMY-RECORD.
054500 BLANK-LINE-PRINT.
054600     PERFORM WRT-LN.
054700 FAIL-ROUTINE.
054800     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
054900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
055000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
055100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
055200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055300     MOVE   SPACES TO INF-ANSI-REFERENCE.
055400     GO TO  FAIL-ROUTINE-EX.
055500 FAIL-ROUTINE-WRITE.
055600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
055700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
055800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
055900     MOVE   SPACES TO COR-ANSI-REFERENCE.
056000 FAIL-ROUTINE-EX. EXIT.
056100 BAIL-OUT.
056200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
056300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
056400 BAIL-OUT-WRITE.
056500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
056600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
056700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
056800     MOVE   SPACES TO INF-ANSI-REFERENCE.
056900 BAIL-OUT-EX. EXIT.
057000 CCVS1-EXIT.
057100     EXIT.
057200 SECT-NC207A-001 SECTION.
057300 ADD-INIT-F1-1.
057400     MOVE "ADD-TEST-F1-1 " TO PAR-NAME.
057500     MOVE "QUALIFIED ADDITION" TO FEATURE.
057600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
057700     MOVE ZERO TO ACCUMULATOR1.
057800 ADD-TEST-F1-1.
057900     ADD TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
058000         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
058100         TO ACCUMULATOR1.
058200     IF ACCUMULATOR1 EQUAL TO 1
058300         PERFORM PASS
058400         GO TO ADD-WRITE-F1-1.
058500     GO TO ADD-FAIL-F1-1.
058600 ADD-DELETE-F1-1.
058700     PERFORM DE-LETE.
058800     GO TO ADD-WRITE-F1-1.
058900 ADD-FAIL-F1-1.
059000     MOVE 1 TO CORRECT-N.
059100     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
059200         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
059300         TO COMPUTED-N.
059400     PERFORM FAIL.
059500 ADD-WRITE-F1-1.
059600     PERFORM PRINT-DETAIL.
059700*
059800 ADD-INIT-F1-2.
059900     MOVE "ADD-TEST-F1-2 " TO PAR-NAME.
060000     MOVE "QUALIFIED ADDITION" TO FEATURE.
060100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
060200     MOVE ZERO TO ACCUMULATOR1.
060300 ADD-TEST-F1-2.
060400     ADD TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A OF
060500         TABLE-LEVEL-3A OF TABLE-LEVEL-4A OF TABLE-LEVEL-5A TO
060600         ACCUMULATOR1.
060700     IF ACCUMULATOR1 EQUAL TO 2
060800         PERFORM PASS
060900         GO TO ADD-WRITE-F1-2.
061000     GO TO ADD-FAIL-F1-2.
061100 ADD-DELETE-F1-2.
061200     PERFORM DE-LETE.
061300     GO TO ADD-WRITE-F1-2.
061400 ADD-FAIL-F1-2.
061500     MOVE 2 TO CORRECT-N.
061600     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A OF
061700         TABLE-LEVEL-3A OF TABLE-LEVEL-4A OF TABLE-LEVEL-5A TO
061800         COMPUTED-N.
061900     PERFORM FAIL.
062000 ADD-WRITE-F1-2.
062100     PERFORM PRINT-DETAIL.
062200*
062300 ADD-INIT-F1-3.
062400     MOVE "ADD-TEST-F1-3 " TO PAR-NAME.
062500     MOVE "QUALIFIED ADDITION" TO FEATURE.
062600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
062700     MOVE ZERO TO ACCUMULATOR1.
062800 ADD-TEST-F1-3.
062900     ADD TBL-ITEM-1 IN TABLE-LEVEL-1A IN TABLE-LEVEL-2B IN
063000         TABLE-LEVEL-3A IN TABLE-LEVEL-4A IN TABLE-LEVEL-5A TO
063100         ACCUMULATOR1.
063200     IF ACCUMULATOR1 EQUAL TO 3
063300         PERFORM PASS
063400         GO TO ADD-WRITE-F1-3.
063500     GO TO ADD-FAIL-F1-3.
063600 ADD-DELETE-F1-3.
063700     PERFORM DE-LETE.
063800     GO TO ADD-WRITE-F1-3.
063900 ADD-FAIL-F1-3.
064000     MOVE TBL-ITEM-1 IN TABLE-LEVEL-1A IN TABLE-LEVEL-2B IN
064100         TABLE-LEVEL-3A IN TABLE-LEVEL-4A IN TABLE-LEVEL-5A TO
064200         COMPUTED-N.
064300     MOVE 3 TO CORRECT-N.
064400     PERFORM FAIL.
064500 ADD-WRITE-F1-3.
064600     PERFORM PRINT-DETAIL.
064700*
064800 ADD-INIT-F1-4.
064900     MOVE "ADD-TEST-F1-4 " TO PAR-NAME.
065000     MOVE "QUALIFIED ADDITION" TO FEATURE.
065100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
065200     MOVE ZERO TO ACCUMULATOR1.
065300 ADD-TEST-F1-4.
065400     ADD TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2B OF
065500         TABLE-LEVEL-3A IN TABLE-LEVEL-4A IN TABLE-LEVEL-5A TO
065600         ACCUMULATOR1.
065700     IF ACCUMULATOR1 EQUAL TO 4
065800         PERFORM PASS
065900         GO TO ADD-WRITE-F1-4.
066000     GO TO ADD-FAIL-F1-4.
066100 ADD-DELETE-F1-4.
066200     PERFORM DE-LETE.
066300     GO TO ADD-WRITE-F1-4.
066400 ADD-FAIL-F1-4.
066500     MOVE 4 TO CORRECT-N.
066600     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2B OF
066700         TABLE-LEVEL-3A IN TABLE-LEVEL-4A IN TABLE-LEVEL-5A TO
066800         COMPUTED-N.
066900     PERFORM FAIL.
067000 ADD-WRITE-F1-4.
067100     PERFORM PRINT-DETAIL.
067200*
067300 ADD-INIT-F1-5.
067400     MOVE "ADD-TEST-F1-5 " TO PAR-NAME.
067500     MOVE "QUALIFIED ADDITION" TO FEATURE.
067600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
067700     MOVE ZERO TO ACCUMULATOR1.
067800 ADD-TEST-F1-5.
067900     ADD TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2A OF
068000         TABLE-LEVEL-3B OF TABLE-LEVEL-4A OF TABLE-LEVEL-5A TO
068100         ACCUMULATOR1.
068200     IF ACCUMULATOR1 EQUAL TO 5
068300         PERFORM PASS
068400         GO TO ADD-WRITE-F1-5.
068500     GO TO ADD-FAIL-F1-5.
068600 ADD-DELETE-F1-5.
068700     PERFORM DE-LETE.
068800     GO TO ADD-WRITE-F1-5.
068900 ADD-FAIL-F1-5.
069000     MOVE 5 TO CORRECT-N.
069100     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2A OF
069200         TABLE-LEVEL-3B OF TABLE-LEVEL-4A OF TABLE-LEVEL-5A TO
069300         COMPUTED-N.
069400     PERFORM FAIL.
069500 ADD-WRITE-F1-5.
069600     PERFORM PRINT-DETAIL.
069700*
069800 ADD-INIT-F1-6.
069900     MOVE "ADD-TEST-F1-6 " TO PAR-NAME.
070000     MOVE "QUALIFIED ADDITION" TO FEATURE.
070100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
070200     MOVE ZERO TO ACCUMULATOR1.
070300 ADD-TEST-F1-6.
070400     ADD TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A IN
070500         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A TO
070600         ACCUMULATOR1.
070700     IF ACCUMULATOR1 EQUAL TO 6
070800         PERFORM PASS
070900         GO TO ADD-WRITE-F1-6.
071000     GO TO ADD-FAIL-F1-6.
071100 ADD-DELETE-F1-6.
071200     PERFORM DE-LETE.
071300     GO TO ADD-WRITE-F1-6.
071400 ADD-FAIL-F1-6.
071500     MOVE 6 TO CORRECT-N.
071600     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A IN
071700         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A TO
071800         COMPUTED-N.
071900     PERFORM FAIL.
072000 ADD-WRITE-F1-6.
072100     PERFORM PRINT-DETAIL.
072200*
072300 ADD-INIT-F1-7.
072400     MOVE "ADD-TEST-F1-7" TO PAR-NAME.
072500     MOVE "QUALIFIED ADDITION" TO FEATURE.
072600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
072700     MOVE ZERO TO ACCUMULATOR1.
072800 ADD-TEST-F1-7.
072900     ADD TBL-ITEM-1 IN TABLE-LEVEL-1A OF TABLE-LEVEL-2B OF
073000         TABLE-LEVEL-3B OF TABLE-LEVEL-4A OF TABLE-LEVEL-5A TO
073100         ACCUMULATOR1.
073200     IF ACCUMULATOR1 EQUAL TO 7
073300         PERFORM PASS
073400         GO TO ADD-WRITE-F1-7.
073500     GO TO ADD-FAIL-F1-7.
073600 ADD-DELETE-F1-7.
073700     PERFORM DE-LETE.
073800     GO TO ADD-WRITE-F1-7.
073900 ADD-FAIL-F1-7.
074000     MOVE TBL-ITEM-1 IN TABLE-LEVEL-1A OF TABLE-LEVEL-2B OF
074100         TABLE-LEVEL-3B OF TABLE-LEVEL-4A OF TABLE-LEVEL-5A TO
074200         COMPUTED-N.
074300     MOVE 7 TO CORRECT-N.
074400     PERFORM FAIL.
074500 ADD-WRITE-F1-7.
074600     PERFORM PRINT-DETAIL.
074700*
074800 ADD-INIT-F1-8.
074900     MOVE "ADD-TEST-F1-8 " TO PAR-NAME.
075000     MOVE "QUALIFIED ADDITION" TO FEATURE.
075100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
075200     MOVE ZERO TO ACCUMULATOR1.
075300 ADD-TEST-F1-8.
075400     ADD TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B IN
075500         TABLE-LEVEL-3B IN TABLE-LEVEL-4A IN TABLE-LEVEL-5A TO
075600         ACCUMULATOR1.
075700     IF ACCUMULATOR1 EQUAL TO 8
075800         PERFORM PASS
075900         GO TO ADD-WRITE-F1-8.
076000     GO TO ADD-FAIL-F1-8.
076100 ADD-DELETE-F1-8.
076200     PERFORM DE-LETE.
076300     GO TO ADD-WRITE-F1-8.
076400 ADD-FAIL-F1-8.
076500     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B IN
076600         TABLE-LEVEL-3B IN TABLE-LEVEL-4A IN TABLE-LEVEL-5A TO
076700         COMPUTED-N.
076800     MOVE 8 TO CORRECT-N.
076900     PERFORM FAIL.
077000 ADD-WRITE-F1-8.
077100     PERFORM PRINT-DETAIL.
077200*
077300 ADD-INIT-F2-9.
077400     MOVE "ADD-TEST-F2-9 " TO PAR-NAME.
077500     MOVE "QUALIFIED ADDITION" TO FEATURE.
077600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
077700     MOVE ZERO TO ACCUMULATOR2.
077800 ADD-TEST-F2-9.
077900     ADD TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2A OF
078000         TABLE-LEVEL-3A IN TABLE-LEVEL-4B IN TABLE-LEVEL-5A
078100         TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2A OF
078200         TABLE-LEVEL-3A IN TABLE-LEVEL-4B IN TABLE-LEVEL-5A
078300         GIVING ACCUMULATOR2.
078400     IF ACCUMULATOR2 EQUAL TO 18
078500         PERFORM PASS
078600         GO TO ADD-WRITE-F2-9.
078700     GO TO ADD-FAIL-F2-9.
078800 ADD-DELETE-F2-9.
078900     PERFORM DE-LETE.
079000     GO TO ADD-WRITE-F2-9.
079100 ADD-FAIL-F2-9.
079200     MOVE ACCUMULATOR2 TO COMPUTED-N.
079300     MOVE 18 TO CORRECT-N.
079400     PERFORM FAIL.
079500 ADD-WRITE-F2-9.
079600     PERFORM PRINT-DETAIL.
079700*
079800 ADD-INIT-F2-10.
079900     MOVE "ADD-TEST-F2-10 " TO PAR-NAME.
080000     MOVE "QUALIFIED ADDITION" TO FEATURE.
080100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
080200     MOVE ZERO TO ACCUMULATOR2.
080300 ADD-TEST-F2-10.
080400     ADD TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A IN
080500         TABLE-LEVEL-3A IN TABLE-LEVEL-4B IN TABLE-LEVEL-5A
080600         TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A IN
080700         TABLE-LEVEL-3A IN TABLE-LEVEL-4B IN TABLE-LEVEL-5A
080800         GIVING ACCUMULATOR2.
080900     IF ACCUMULATOR2 EQUAL TO 20
081000         PERFORM PASS
081100         GO TO ADD-WRITE-F2-10.
081200     GO TO ADD-FAIL-F2-10.
081300 ADD-DELETE-F2-10.
081400     PERFORM DE-LETE.
081500     GO TO ADD-WRITE-F2-10.
081600 ADD-FAIL-F2-10.
081700     MOVE ACCUMULATOR2 TO COMPUTED-N.
081800     MOVE 20 TO CORRECT-N.
081900     PERFORM FAIL.
082000 ADD-WRITE-F2-10.
082100     PERFORM PRINT-DETAIL.
082200*
082300 ADD-INIT-F2-11.
082400     MOVE "ADD-TEST-F2-11 " TO PAR-NAME.
082500     MOVE "QUALIFIED ADDITION" TO FEATURE.
082600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
082700     MOVE ZERO TO ACCUMULATOR2.
082800 ADD-TEST-F2-11.
082900     ADD TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2B OF
083000         TABLE-LEVEL-3A OF TABLE-LEVEL-4B IN TABLE-LEVEL-5A
083100         TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2B OF
083200         TABLE-LEVEL-3A OF TABLE-LEVEL-4B IN TABLE-LEVEL-5A
083300         GIVING ACCUMULATOR2.
083400     IF ACCUMULATOR2 EQUAL TO 22
083500         PERFORM PASS
083600         GO TO ADD-WRITE-F2-11.
083700     GO TO ADD-FAIL-F2-11.
083800 ADD-DELETE-F2-11.
083900     PERFORM DE-LETE.
084000     GO TO ADD-WRITE-F2-11.
084100 ADD-FAIL-F2-11.
084200     MOVE ACCUMULATOR2 TO COMPUTED-N.
084300     MOVE 22 TO CORRECT-N.
084400     PERFORM FAIL.
084500 ADD-WRITE-F2-11.
084600     PERFORM PRINT-DETAIL.
084700*
084800 ADD-INIT-F2-12.
084900     MOVE "ADD-TEST-F2-12 " TO PAR-NAME.
085000     MOVE "QUALIFIED ADDITION" TO FEATURE.
085100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
085200     MOVE ZERO TO ACCUMULATOR2.
085300 ADD-TEST-F2-12.
085400     ADD TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B IN
085500         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
085600         TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B IN
085700         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
085800         GIVING ACCUMULATOR2.
085900     IF ACCUMULATOR2 EQUAL TO 24
086000         PERFORM PASS
086100         GO TO ADD-WRITE-F2-12.
086200     GO TO ADD-FAIL-F2-12.
086300 ADD-DELETE-F2-12.
086400     PERFORM DE-LETE.
086500     GO TO ADD-WRITE-F2-12.
086600 ADD-FAIL-F2-12.
086700     MOVE ACCUMULATOR2 TO COMPUTED-N.
086800     MOVE 24 TO CORRECT-N.
086900     PERFORM FAIL.
087000 ADD-WRITE-F2-12.
087100     PERFORM PRINT-DETAIL.
087200*
087300 ADD-INIT-F2-13.
087400     MOVE "ADD-TEST-F2-13 " TO PAR-NAME.
087500     MOVE "QUALIFIED ADDITION" TO FEATURE.
087600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
087700     MOVE ZERO TO ACCUMULATOR2.
087800 ADD-TEST-F2-13.
087900     ADD TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2A IN
088000         TABLE-LEVEL-3B OF TABLE-LEVEL-4B OF TABLE-LEVEL-5A
088100         TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2A IN
088200         TABLE-LEVEL-3B OF TABLE-LEVEL-4B OF TABLE-LEVEL-5A
088300         GIVING ACCUMULATOR2.
088400     IF ACCUMULATOR2 EQUAL TO 26
088500         PERFORM PASS
088600         GO TO ADD-WRITE-F2-13.
088700     GO TO ADD-FAIL-F2-13.
088800 ADD-DELETE-F2-13.
088900     PERFORM DE-LETE.
089000     GO TO ADD-WRITE-F2-13.
089100 ADD-FAIL-F2-13.
089200     MOVE ACCUMULATOR2 TO COMPUTED-N.
089300     MOVE 26 TO CORRECT-N.
089400     PERFORM FAIL.
089500 ADD-WRITE-F2-13.
089600     PERFORM PRINT-DETAIL.
089700*
089800 ADD-INIT-F2-14.
089900     MOVE "ADD-TEST-F2-14 " TO PAR-NAME.
090000     MOVE "QUALIFIED ADDITION" TO FEATURE.
090100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
090200     MOVE ZERO TO ACCUMULATOR2.
090300 ADD-TEST-F2-14.
090400     ADD TBL-ITEM-1 IN TABLE-LEVEL-1B IN TABLE-LEVEL-2A IN
090500         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
090600         TBL-ITEM-1 IN TABLE-LEVEL-1B IN TABLE-LEVEL-2A IN
090700         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
090800         GIVING ACCUMULATOR2.
090900     IF ACCUMULATOR2 EQUAL TO 28
091000         PERFORM PASS
091100         GO TO ADD-WRITE-F2-14.
091200     GO TO ADD-FAIL-F2-14.
091300 ADD-DELETE-F2-14.
091400     PERFORM DE-LETE.
091500     GO TO ADD-WRITE-F2-14.
091600 ADD-FAIL-F2-14.
091700     MOVE ACCUMULATOR2 TO COMPUTED-N.
091800     MOVE 28 TO CORRECT-N.
091900     PERFORM FAIL.
092000 ADD-WRITE-F2-14.
092100     PERFORM PRINT-DETAIL.
092200*
092300 ADD-INIT-F2-15.
092400     MOVE "ADD-TEST-F2-15 " TO PAR-NAME.
092500     MOVE "QUALIFIED ADDITION" TO FEATURE.
092600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
092700     MOVE ZERO TO ACCUMULATOR2.
092800 ADD-TEST-F2-15.
092900     ADD TBL-ITEM-1 IN TABLE-LEVEL-1A OF TABLE-LEVEL-2B IN
093000         TABLE-LEVEL-3B OF TABLE-LEVEL-4B OF TABLE-LEVEL-5A
093100         TBL-ITEM-1 IN TABLE-LEVEL-1A OF TABLE-LEVEL-2B IN
093200         TABLE-LEVEL-3B OF TABLE-LEVEL-4B OF TABLE-LEVEL-5A
093300         GIVING ACCUMULATOR2.
093400     IF ACCUMULATOR2 EQUAL TO 30
093500         PERFORM PASS
093600         GO TO ADD-WRITE-F2-15.
093700     GO TO ADD-FAIL-F2-15.
093800 ADD-DELETE-F2-15.
093900     PERFORM DE-LETE.
094000     GO TO ADD-WRITE-F2-15.
094100 ADD-FAIL-F2-15.
094200     MOVE ACCUMULATOR2 TO COMPUTED-N.
094300     MOVE 30 TO CORRECT-N.
094400     PERFORM FAIL.
094500 ADD-WRITE-F2-15.
094600     PERFORM PRINT-DETAIL.
094700*
094800 ADD-INIT-F2-16.
094900     MOVE "ADD-TEST-F2-16 " TO PAR-NAME.
095000     MOVE "QUALIFIED ADDITION" TO FEATURE.
095100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
095200     MOVE ZERO TO ACCUMULATOR2.
095300 ADD-TEST-F2-16.
095400     ADD TBL-ITEM-1 IN TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
095500         TABLE-LEVEL-3B OF TABLE-LEVEL-4B OF TABLE-LEVEL-5A
095600         TBL-ITEM-1 IN TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
095700         TABLE-LEVEL-3B OF TABLE-LEVEL-4B OF TABLE-LEVEL-5A
095800         GIVING ACCUMULATOR2.
095900     IF ACCUMULATOR2 EQUAL TO 32
096000         PERFORM PASS
096100         GO TO ADD-WRITE-F2-16.
096200     GO TO ADD-FAIL-F2-16.
096300 ADD-DELETE-F2-16.
096400     PERFORM DE-LETE.
096500     GO TO ADD-WRITE-F2-16.
096600 ADD-FAIL-F2-16.
096700     MOVE ACCUMULATOR2 TO COMPUTED-N.
096800     MOVE 32 TO CORRECT-N.
096900     PERFORM FAIL.
097000 ADD-WRITE-F2-16.
097100     PERFORM PRINT-DETAIL.
097200*
097300 ADD-INIT-F3-17.
097400     MOVE "ADD-TEST-F3-17" TO PAR-NAME.
097500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
097600     MOVE "       CORRESPONDING" TO FEATURE.
097700     ADD CORRESPONDING TABLE-LEVEL-5A TO TABLE-LEVEL-5B.
097800 ADD-TEST-F3-17.
097900     IF  TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
098000         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
098100         EQUAL TO 17
098200         PERFORM PASS
098300         GO TO ADD-WRITE-F3-17.
098400     GO TO ADD-FAIL-F3-17.
098500 ADD-DELETE-F3-17.
098600     PERFORM DE-LETE.
098700     GO TO ADD-WRITE-F3-17.
098800 ADD-FAIL-F3-17.
098900     MOVE 17 TO CORRECT-N.
099000     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
099100         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
099200         TO COMPUTED-N.
099300     PERFORM FAIL.
099400 ADD-WRITE-F3-17.
099500     PERFORM PRINT-DETAIL.
099600*
099700 ADD-INIT-F3-18.
099800     MOVE "ADD-TEST-F3-18" TO PAR-NAME.
099900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
100000     MOVE "       CORRESPONDING" TO FEATURE.
100100 ADD-TEST-F3-18.
100200     IF  TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A OF
100300         TABLE-LEVEL-3A OF TABLE-LEVEL-4A OF TABLE-LEVEL-5B
100400         EQUAL TO 17
100500         PERFORM PASS
100600         GO TO ADD-WRITE-F3-18.
100700 ADD-DELETE-F3-18.
100800     PERFORM DE-LETE.
100900     GO TO ADD-WRITE-F3-18.
101000 ADD-FAIL-F3-18.
101100     MOVE 17 TO CORRECT-N.
101200     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A OF
101300         TABLE-LEVEL-3A OF TABLE-LEVEL-4A OF TABLE-LEVEL-5B
101400     TO  COMPUTED-N.
101500     PERFORM FAIL.
101600 ADD-WRITE-F3-18.
101700     PERFORM PRINT-DETAIL.
101800*
101900 ADD-INIT-F3-19.
102000     MOVE "ADD-TEST-F3-19" TO PAR-NAME.
102100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
102200     MOVE "       CORRESPONDING" TO FEATURE.
102300 ADD-TEST-F3-19.
102400     IF  TBL-ITEM-1 IN TABLE-LEVEL-1A IN TABLE-LEVEL-2B IN
102500         TABLE-LEVEL-3A IN TABLE-LEVEL-4A IN TABLE-LEVEL-5B
102600         EQUAL TO 17
102700         PERFORM PASS
102800         GO TO ADD-WRITE-F3-19.
102900     GO TO ADD-FAIL-F3-19.
103000 ADD-DELETE-F3-19.
103100     PERFORM DE-LETE.
103200     GO TO ADD-WRITE-F3-19.
103300 ADD-FAIL-F3-19.
103400     MOVE 17 TO CORRECT-N.
103500     MOVE TBL-ITEM-1 IN TABLE-LEVEL-1A IN TABLE-LEVEL-2B IN
103600         TABLE-LEVEL-3A IN TABLE-LEVEL-4A IN TABLE-LEVEL-5B
103700     TO  COMPUTED-N.
103800     PERFORM FAIL.
103900 ADD-WRITE-F3-19.
104000     PERFORM PRINT-DETAIL.
104100*
104200 ADD-INIT-F3-20.
104300     MOVE "ADD-TEST-F3-20" TO PAR-NAME.
104400     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
104500     MOVE "       CORRESPONDING" TO FEATURE.
104600 ADD-TEST-F3-20.
104700     IF  TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2B OF
104800         TABLE-LEVEL-3A IN TABLE-LEVEL-4A IN TABLE-LEVEL-5B
104900         EQUAL TO 17
105000         PERFORM PASS
105100         GO TO ADD-WRITE-F3-20.
105200     GO TO ADD-FAIL-F3-20.
105300 ADD-DELETE-F3-20.
105400     PERFORM DE-LETE.
105500     GO TO ADD-WRITE-F3-20.
105600 ADD-FAIL-F3-20.
105700     MOVE 17 TO CORRECT-N.
105800     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2B OF
105900         TABLE-LEVEL-3A IN TABLE-LEVEL-4A IN TABLE-LEVEL-5B
106000     TO  COMPUTED-N.
106100     PERFORM FAIL.
106200 ADD-WRITE-F3-20.
106300     PERFORM PRINT-DETAIL.
106400*
106500 ADD-INIT-F3-21.
106600     MOVE "ADD-TEST-F3-21" TO PAR-NAME.
106700     MOVE "       CORRESPONDING" TO FEATURE.
106800     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
106900 ADD-TEST-F3-21.
107000     IF  TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2A OF
107100         TABLE-LEVEL-3B OF TABLE-LEVEL-4A OF TABLE-LEVEL-5B
107200         EQUAL TO 17
107300         PERFORM PASS
107400         GO TO ADD-WRITE-F3-21.
107500     GO TO ADD-FAIL-F3-21.
107600 ADD-DELETE-F3-21.
107700     PERFORM DE-LETE.
107800     GO TO ADD-WRITE-F3-21.
107900 ADD-FAIL-F3-21.
108000     MOVE 17 TO CORRECT-N.
108100     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1A OF TABLE-LEVEL-2A OF
108200         TABLE-LEVEL-3B OF TABLE-LEVEL-4A OF TABLE-LEVEL-5B
108300     TO  COMPUTED-N.
108400     PERFORM FAIL.
108500 ADD-WRITE-F3-21.
108600     PERFORM PRINT-DETAIL.
108700*
108800 ADD-INIT-F3-22.
108900     MOVE "ADD-TEST-F3-22" TO PAR-NAME.
109000     MOVE "       CORRESPONDING" TO FEATURE.
109100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
109200 ADD-TEST-F3-22.
109300     IF  TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A IN
109400         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
109500         EQUAL TO 17
109600         PERFORM PASS
109700         GO TO ADD-WRITE-F3-22.
109800     GO TO ADD-FAIL-F3-22.
109900 ADD-DELETE-F3-22.
110000     PERFORM DE-LETE.
110100     GO TO ADD-WRITE-F3-22.
110200 ADD-FAIL-F3-22.
110300     MOVE 17 TO CORRECT-N.
110400     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1B OF TABLE-LEVEL-2A IN
110500         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B TO
110600         COMPUTED-N.
110700     PERFORM FAIL.
110800 ADD-WRITE-F3-22.
110900     PERFORM PRINT-DETAIL.
111000*
111100 ADD-INIT-F3-23.
111200     MOVE "ADD-TEST-F3-23" TO PAR-NAME.
111300     MOVE "       CORRESPONDING" TO FEATURE.
111400     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
111500 ADD-TEST-F3-23.
111600     IF  TBL-ITEM-1 IN TABLE-LEVEL-1A OF TABLE-LEVEL-2B OF
111700         TABLE-LEVEL-3B OF TABLE-LEVEL-4A OF TABLE-LEVEL-5B
111800         EQUAL TO 17
111900         PERFORM PASS
112000         GO TO ADD-WRITE-F3-23.
112100     GO TO ADD-FAIL-F3-23.
112200 ADD-DELETE-F3-23.
112300     PERFORM DE-LETE.
112400     GO TO ADD-WRITE-F3-23.
112500 ADD-FAIL-F3-23.
112600     MOVE 17 TO CORRECT-N.
112700     MOVE TBL-ITEM-1 IN TABLE-LEVEL-1A OF TABLE-LEVEL-2B OF
112800         TABLE-LEVEL-3B OF TABLE-LEVEL-4A OF TABLE-LEVEL-5B TO
112900         COMPUTED-N.
113000     PERFORM FAIL.
113100 ADD-WRITE-F3-23.
113200     PERFORM PRINT-DETAIL.
113300*
113400 ADD-INIT-F3-24.
113500     MOVE "ADD-TEST-F3-24" TO PAR-NAME.
113600     MOVE "       CORRESPONDING" TO FEATURE.
113700     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
113800 ADD-TEST-F3-24.
113900     IF  TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B IN
114000         TABLE-LEVEL-3B IN TABLE-LEVEL-4A IN TABLE-LEVEL-5B
114100         EQUAL TO 17
114200         PERFORM PASS
114300         GO TO ADD-WRITE-F3-24.
114400     GO TO ADD-FAIL-F3-24.
114500 ADD-DELETE-F3-24.
114600     PERFORM DE-LETE.
114700     GO TO ADD-WRITE-F3-24.
114800 ADD-FAIL-F3-24.
114900     MOVE 17 TO CORRECT-N.
115000     MOVE TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B IN
115100         TABLE-LEVEL-3B IN TABLE-LEVEL-4A IN TABLE-LEVEL-5B TO
115200         COMPUTED-N.
115300     PERFORM FAIL.
115400 ADD-WRITE-F3-24.
115500     PERFORM PRINT-DETAIL.
115600     PERFORM END-ROUTINE.
115700*
115800 ADD-INIT-F1-25.
115900*    ===-->  48 LEVELS OF QUALIFICATION  <--===
116000     MOVE   "ADD-TEST-F1-25 " TO PAR-NAME.
116100     MOVE   "VI-2 1.3.2" TO ANSI-REFERENCE.
116200     MOVE    ZERO TO ACCUMULATOR2.
116300 ADD-TEST-F1-25.
116400     ADD     GROUP-49-1  OF GROUP-48 IN GROUP-47 OF GROUP-46
116500             IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
116600             IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
116700             IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
116800             IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
116900             IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
117000             IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
117100             IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
117200             IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
117300             IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
117400             IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
117500             IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
117600             IN SECOND-GROUP
117700          TO ACCUMULATOR2.
117800     IF      ACCUMULATOR2 EQUAL TO 100
117900             PERFORM PASS
118000             GO TO   ADD-WRITE-F1-25.
118100     GO TO ADD-FAIL-F1-25.
118200 ADD-DELETE-F1-25.
118300     PERFORM DE-LETE.
118400     GO TO   ADD-WRITE-F1-25.
118500 ADD-FAIL-F1-25.
118600     MOVE    100 TO CORRECT-N.
118700     MOVE    GROUP-49-1  OF GROUP-48 IN GROUP-47 OF GROUP-46
118800             IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
118900             IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
119000             IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
119100             IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
119200             IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
119300             IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
119400             IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
119500             IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
119600             IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
119700             IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
119800             IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
119900             IN SECOND-GROUP
120000          TO COMPUTED-N.
120100     PERFORM FAIL.
120200 ADD-WRITE-F1-25.
120300     PERFORM PRINT-DETAIL.
120400*
120500 SUB-INIT-F2-1.
120600     MOVE "SUB-TEST-F2-1  " TO PAR-NAME.
120700     MOVE "QUALIFIED SUBTRACT" TO FEATURE.
120800     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
120900     MOVE    TABLE-5B-INIT  TO TABLE-LEVEL-5B.
121000     MOVE ZERO TO ACCUMULATOR1.
121100 SUB-TEST-F2-1.
121200     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
121300         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
121400         FROM TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
121500         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
121600         GIVING ACCUMULATOR1.
121700     IF ACCUMULATOR1 EQUAL TO 15
121800         PERFORM PASS
121900         GO TO SUB-WRITE-F2-1.
122000     GO TO SUB-FAIL-F2-1.
122100 SUB-DELETE-F2-1.
122200     PERFORM DE-LETE.
122300     GO TO SUB-WRITE-F2-1.
122400 SUB-FAIL-F2-1.
122500     MOVE 15 TO CORRECT-N.
122600     MOVE ACCUMULATOR1 TO COMPUTED-N.
122700     PERFORM FAIL.
122800 SUB-WRITE-F2-1.
122900     PERFORM PRINT-DETAIL.
123000*
123100 SUB-INIT-F2-2.
123200     MOVE "SUB-TEST-F2-2  " TO PAR-NAME.
123300     MOVE "QUALIFIED SUBTRACT" TO FEATURE.
123400     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
123500     MOVE ZERO TO ACCUMULATOR1.
123600 SUB-TEST-F2-2.
123700     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
123800         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
123900         FROM TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
124000         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
124100         GIVING ACCUMULATOR1.
124200     IF ACCUMULATOR1 EQUAL TO 13
124300         PERFORM PASS
124400         GO TO SUB-WRITE-F2-2.
124500     GO TO SUB-FAIL-F2-2.
124600 SUB-DELETE-F2-2.
124700     PERFORM DE-LETE.
124800     GO TO SUB-WRITE-F2-2.
124900 SUB-FAIL-F2-2.
125000     MOVE 13 TO CORRECT-N.
125100     MOVE ACCUMULATOR1 TO COMPUTED-N.
125200     PERFORM FAIL.
125300 SUB-WRITE-F2-2.
125400     PERFORM PRINT-DETAIL.
125500*
125600 SUB-INIT-F2-3.
125700     MOVE "SUB-TEST-F2-3  " TO PAR-NAME.
125800     MOVE "QUALIFIED SUBTRACT" TO FEATURE.
125900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
126000     MOVE ZERO TO ACCUMULATOR1.
126100 SUB-TEST-F2-3.
126200     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
126300         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
126400         FROM TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
126500         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
126600         GIVING ACCUMULATOR1.
126700     IF ACCUMULATOR1 EQUAL TO 11
126800         PERFORM PASS
126900         GO TO SUB-WRITE-F2-3.
127000     GO TO SUB-FAIL-F2-3.
127100 SUB-DELETE-F2-3.
127200     PERFORM DE-LETE.
127300     GO TO SUB-WRITE-F2-3.
127400 SUB-FAIL-F2-3.
127500     MOVE 11 TO CORRECT-N.
127600     MOVE ACCUMULATOR1 TO COMPUTED-N.
127700     PERFORM FAIL.
127800 SUB-WRITE-F2-3.
127900     PERFORM PRINT-DETAIL.
128000*
128100 SUB-INIT-F2-4.
128200     MOVE "SUB-TEST-F2-4  " TO PAR-NAME.
128300     MOVE "QUALIFIED SUBTRACT" TO FEATURE.
128400     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
128500     MOVE ZERO TO ACCUMULATOR1.
128600 SUB-TEST-F2-4.
128700     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
128800         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
128900         FROM TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
129000         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
129100         GIVING ACCUMULATOR1.
129200     IF ACCUMULATOR1 EQUAL TO 9
129300         PERFORM PASS
129400         GO TO SUB-WRITE-F2-4.
129500     GO TO SUB-FAIL-F2-4.
129600 SUB-DELETE-F2-4.
129700     PERFORM DE-LETE.
129800     GO TO SUB-WRITE-F2-4.
129900 SUB-FAIL-F2-4.
130000     MOVE 9 TO CORRECT-N.
130100     MOVE ACCUMULATOR1 TO COMPUTED-N.
130200     PERFORM FAIL.
130300 SUB-WRITE-F2-4.
130400     PERFORM PRINT-DETAIL.
130500*
130600 SUB-INIT-F2-5.
130700     MOVE "QUALIFIED SUBTRACT" TO FEATURE.
130800     MOVE "SUB-TEST-F2-5  " TO PAR-NAME.
130900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
131000     MOVE ZERO TO ACCUMULATOR1.
131100 SUB-TEST-F2-5.
131200     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
131300         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
131400         FROM TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
131500         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
131600         GIVING ACCUMULATOR1.
131700     IF ACCUMULATOR1 EQUAL TO 7
131800         PERFORM PASS
131900         GO TO SUB-WRITE-F2-5.
132000     GO TO SUB-FAIL-F2-5.
132100 SUB-DELETE-F2-5.
132200     PERFORM DE-LETE.
132300     GO TO SUB-WRITE-F2-5.
132400 SUB-FAIL-F2-5.
132500     MOVE 7 TO CORRECT-N.
132600     MOVE ACCUMULATOR1 TO COMPUTED-N.
132700     PERFORM FAIL.
132800 SUB-WRITE-F2-5.
132900     PERFORM PRINT-DETAIL.
133000*
133100 SUB-INIT-F2-6.
133200     MOVE "SUB-TEST-F2-6  " TO PAR-NAME.
133300     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
133400     MOVE ZERO TO ACCUMULATOR1.
133500 SUB-TEST-F2-6.
133600     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
133700         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
133800         FROM TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
133900         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
134000         GIVING ACCUMULATOR1.
134100     IF ACCUMULATOR1 EQUAL TO 5
134200         PERFORM PASS
134300         GO TO SUB-WRITE-F2-6.
134400     GO TO SUB-FAIL-F2-6.
134500 SUB-DELETE-F2-6.
134600     PERFORM DE-LETE.
134700     GO TO SUB-WRITE-F2-6.
134800 SUB-FAIL-F2-6.
134900     MOVE 5 TO CORRECT-N.
135000     MOVE ACCUMULATOR1 TO COMPUTED-N.
135100     PERFORM FAIL.
135200 SUB-WRITE-F2-6.
135300     PERFORM PRINT-DETAIL.
135400*
135500 SUB-INIT-F2-7.
135600     MOVE "SUB-TEST-F2-7  " TO PAR-NAME.
135700     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
135800     MOVE ZERO TO ACCUMULATOR1.
135900 SUB-TEST-F2-7.
136000     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
136100         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
136200         FROM TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
136300         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
136400         GIVING ACCUMULATOR1.
136500     IF ACCUMULATOR1 EQUAL TO 3
136600         PERFORM PASS
136700         GO TO SUB-WRITE-F2-7.
136800     GO TO SUB-FAIL-F2-7.
136900 SUB-DELETE-F2-7.
137000     PERFORM DE-LETE.
137100     GO TO SUB-WRITE-F2-7.
137200 SUB-FAIL-F2-7.
137300     MOVE 3 TO CORRECT-N.
137400     MOVE ACCUMULATOR1 TO COMPUTED-N.
137500     PERFORM FAIL.
137600 SUB-WRITE-F2-7.
137700     PERFORM PRINT-DETAIL.
137800*
137900 SUB-INIT-F2-8.
138000     MOVE "SUB-TEST-F2-8  " TO PAR-NAME.
138100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
138200     MOVE ZERO TO ACCUMULATOR1.
138300 SUB-TEST-F2-8.
138400     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
138500         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
138600         FROM TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
138700         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5B
138800         GIVING ACCUMULATOR1.
138900     IF ACCUMULATOR1 EQUAL TO 1
139000         PERFORM PASS
139100         GO TO SUB-WRITE-F2-8.
139200     GO TO SUB-FAIL-F2-8.
139300 SUB-DELETE-F2-8.
139400     PERFORM DE-LETE.
139500     GO TO SUB-WRITE-F2-8.
139600 SUB-FAIL-F2-8.
139700     MOVE 1 TO CORRECT-N.
139800     MOVE ACCUMULATOR1 TO COMPUTED-N.
139900     PERFORM FAIL.
140000 SUB-WRITE-F2-8.
140100     PERFORM PRINT-DETAIL.
140200*
140300 SUB-INIT-F2-9.
140400     MOVE "SUB-TEST-F2-9  " TO PAR-NAME.
140500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
140600     MOVE 5 TO ACCUMULATOR2.
140700 SUB-TEST-F2-9.
140800     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
140900         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
141000         FROM TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
141100         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
141200         GIVING ACCUMULATOR2.
141300     IF ACCUMULATOR2 EQUAL TO ZERO
141400         PERFORM PASS
141500         GO TO SUB-WRITE-F2-9.
141600     GO TO SUB-FAIL-F2-9.
141700 SUB-DELETE-F2-9.
141800     PERFORM DE-LETE.
141900     GO TO SUB-WRITE-F2-9.
142000 SUB-FAIL-F2-9.
142100     MOVE ZERO TO CORRECT-N.
142200     MOVE ACCUMULATOR2 TO COMPUTED-N.
142300     PERFORM FAIL.
142400 SUB-WRITE-F2-9.
142500     PERFORM PRINT-DETAIL.
142600*
142700 SUB-INIT-F2-10.
142800     MOVE "SUB-TEST-F2-10 " TO PAR-NAME.
142900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
143000     MOVE ZERO TO ACCUMULATOR2.
143100 SUB-TEST-F2-10.
143200     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
143300         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5B
143400         FROM TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
143500         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
143600         GIVING ACCUMULATOR2.
143700     IF ACCUMULATOR2 EQUAL TO 3
143800         PERFORM PASS
143900         GO TO SUB-WRITE-F2-10.
144000     GO TO SUB-FAIL-F2-10.
144100 SUB-DELETE-F2-10.
144200     PERFORM DE-LETE.
144300     GO TO SUB-WRITE-F2-10.
144400 SUB-FAIL-F2-10.
144500     MOVE 3 TO CORRECT-N.
144600     MOVE ACCUMULATOR2 TO COMPUTED-N.
144700     PERFORM FAIL.
144800 SUB-WRITE-F2-10.
144900     PERFORM PRINT-DETAIL.
145000*
145100 SUB-INIT-F2-11.
145200     MOVE "SUB-TEST-F2-11 " TO PAR-NAME.
145300     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
145400     MOVE ZERO TO ACCUMULATOR2.
145500 SUB-TEST-F2-11.
145600     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
145700         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5B
145800         FROM TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
145900         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
146000         GIVING ACCUMULATOR2.
146100     IF ACCUMULATOR2 EQUAL TO 5
146200         PERFORM PASS
146300         GO TO SUB-WRITE-F2-11.
146400     GO TO SUB-FAIL-F2-11.
146500 SUB-DELETE-F2-11.
146600     PERFORM DE-LETE.
146700     GO TO SUB-WRITE-F2-11.
146800 SUB-FAIL-F2-11.
146900     MOVE 5 TO CORRECT-N.
147000     MOVE ACCUMULATOR2 TO COMPUTED-N.
147100     PERFORM FAIL.
147200 SUB-WRITE-F2-11.
147300     PERFORM PRINT-DETAIL.
147400*
147500 SUB-INIT-F2-12.
147600     MOVE "SUB-TEST-F2-12 " TO PAR-NAME.
147700     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
147800     MOVE ZERO TO ACCUMULATOR2.
147900 SUB-TEST-F2-12.
148000     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
148100         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5B
148200         FROM TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
148300         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
148400         GIVING ACCUMULATOR2.
148500     IF ACCUMULATOR2 EQUAL TO 7
148600         PERFORM PASS
148700         GO TO SUB-WRITE-F2-12.
148800     GO TO SUB-FAIL-F2-12.
148900 SUB-DELETE-F2-12.
149000     PERFORM DE-LETE.
149100     GO TO SUB-WRITE-F2-12.
149200 SUB-FAIL-F2-12.
149300     MOVE 7 TO CORRECT-N.
149400     MOVE ACCUMULATOR2 TO COMPUTED-N.
149500     PERFORM FAIL.
149600 SUB-WRITE-F2-12.
149700     PERFORM PRINT-DETAIL.
149800*
149900 SUB-INIT-F2-13.
150000     MOVE "SUB-TEST-F2-13 " TO PAR-NAME.
150100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
150200     MOVE ZERO TO ACCUMULATOR2.
150300 SUB-TEST-F2-13.
150400     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
150500         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5B
150600         FROM TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
150700         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
150800         GIVING ACCUMULATOR2.
150900     IF ACCUMULATOR2 EQUAL TO 9
151000         PERFORM PASS
151100         GO TO SUB-WRITE-F2-13.
151200     GO TO SUB-FAIL-F2-13.
151300 SUB-DELETE-F2-13.
151400     PERFORM DE-LETE.
151500     GO TO SUB-WRITE-F2-13.
151600 SUB-FAIL-F2-13.
151700     MOVE 9 TO CORRECT-N.
151800     MOVE ACCUMULATOR2 TO COMPUTED-N.
151900     PERFORM FAIL.
152000 SUB-WRITE-F2-13.
152100     PERFORM PRINT-DETAIL.
152200*
152300 SUB-INIT-F2-14.
152400     MOVE "SUB-TEST-F2-14 " TO PAR-NAME.
152500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
152600     MOVE ZERO TO ACCUMULATOR2.
152700 SUB-TEST-F2-14.
152800     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
152900         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5B
153000         FROM TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
153100         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
153200         GIVING ACCUMULATOR2.
153300     IF ACCUMULATOR2 EQUAL TO 11
153400         PERFORM PASS
153500         GO TO SUB-WRITE-F2-14.
153600     GO TO SUB-FAIL-F2-14.
153700 SUB-DELETE-F2-14.
153800     PERFORM DE-LETE.
153900     GO TO SUB-WRITE-F2-14.
154000 SUB-FAIL-F2-14.
154100     MOVE 11 TO CORRECT-N.
154200     MOVE ACCUMULATOR2 TO COMPUTED-N.
154300     PERFORM FAIL.
154400 SUB-WRITE-F2-14.
154500     PERFORM PRINT-DETAIL.
154600*
154700 SUB-INIT-F2-15.
154800     MOVE "SUB-TEST-F2-15 " TO PAR-NAME.
154900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
155000     MOVE ZERO TO ACCUMULATOR2.
155100 SUB-TEST-F2-15.
155200     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
155300         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5B
155400         FROM TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
155500         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
155600         GIVING ACCUMULATOR2.
155700     IF ACCUMULATOR2 EQUAL TO 13
155800         PERFORM PASS
155900         GO TO SUB-WRITE-F2-15.
156000     GO TO SUB-FAIL-F2-15.
156100 SUB-DELETE-F2-15.
156200     PERFORM DE-LETE.
156300     GO TO SUB-WRITE-F2-15.
156400 SUB-FAIL-F2-15.
156500     MOVE 13 TO CORRECT-N.
156600     MOVE ACCUMULATOR2 TO COMPUTED-N.
156700     PERFORM FAIL.
156800 SUB-WRITE-F2-15.
156900     PERFORM PRINT-DETAIL.
157000*
157100 SUB-INIT-F2-16.
157200     MOVE "SUB-TEST-F2-16 " TO PAR-NAME.
157300     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
157400     MOVE ZERO TO ACCUMULATOR2.
157500 SUB-TEST-F2-16.
157600     SUBTRACT TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
157700         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5B
157800         FROM TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
157900         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
158000         GIVING ACCUMULATOR2.
158100     IF ACCUMULATOR2 EQUAL TO 15
158200         PERFORM PASS
158300         GO TO SUB-WRITE-F2-16.
158400     GO TO SUB-FAIL-F2-16.
158500 SUB-DELETE-F2-16.
158600     PERFORM DE-LETE.
158700     GO TO SUB-WRITE-F2-16.
158800 SUB-FAIL-F2-16.
158900     MOVE 15 TO CORRECT-N.
159000     MOVE ACCUMULATOR2 TO COMPUTED-N.
159100     PERFORM FAIL.
159200 SUB-WRITE-F2-16.
159300     PERFORM PRINT-DETAIL.
159400*
159500 SUB-INIT-F3-17.
159600     MOVE "SUB-TEST-F3-17" TO PAR-NAME.
159700     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
159800     MOVE "       CORRESPONDING" TO FEATURE.
159900     SUBTRACT CORRESPONDING TABLE-LEVEL-5A FROM TABLE-LEVEL-5C.
160000 SUB-TEST-F3-17.
160100     IF       TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
160200         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
160300         EQUAL TO ZERO
160400         PERFORM PASS
160500         GO TO SUB-WRITE-F3-17.
160600     GO TO SUB-FAIL-F3-17.
160700 SUB-DELETE-F3-17.
160800     PERFORM DE-LETE.
160900     GO TO SUB-WRITE-F3-17.
161000 SUB-FAIL-F3-17.
161100     MOVE 00 TO CORRECT-N.
161200     MOVE     TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
161300         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
161400         TO COMPUTED-N.
161500     PERFORM FAIL.
161600 SUB-WRITE-F3-17.
161700     PERFORM PRINT-DETAIL.
161800*
161900 SUB-INIT-F3-18.
162000     MOVE "SUB-TEST-F3-18" TO PAR-NAME.
162100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
162200 SUB-TEST-F3-18.
162300     IF       TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
162400         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
162500         EQUAL TO ZERO
162600         PERFORM PASS
162700         GO TO SUB-WRITE-F3-18.
162800     GO TO SUB-FAIL-F3-18.
162900 SUB-DELETE-F3-18.
163000     PERFORM DE-LETE.
163100     GO TO SUB-WRITE-F3-18.
163200 SUB-FAIL-F3-18.
163300     MOVE 00 TO CORRECT-N.
163400     MOVE     TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
163500         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
163600         TO COMPUTED-N.
163700     PERFORM FAIL.
163800 SUB-WRITE-F3-18.
163900     PERFORM PRINT-DETAIL.
164000*
164100 SUB-INIT-F3-19.
164200     MOVE "SUB-TEST-F3-19" TO PAR-NAME.
164300     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
164400 SUB-TEST-F3-19.
164500     IF       TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
164600         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
164700         EQUAL TO ZERO
164800         PERFORM PASS
164900         GO TO SUB-WRITE-F3-19.
165000     GO TO SUB-FAIL-F3-19.
165100 SUB-DELETE-F3-19.
165200     PERFORM DE-LETE.
165300     GO TO SUB-WRITE-F3-19.
165400 SUB-FAIL-F3-19.
165500     MOVE 00 TO CORRECT-N.
165600     MOVE     TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
165700         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
165800         TO COMPUTED-N.
165900     PERFORM FAIL.
166000 SUB-WRITE-F3-19.
166100     PERFORM PRINT-DETAIL.
166200*
166300 SUB-INIT-F3-20.
166400     MOVE "SUB-TEST-F3-20" TO PAR-NAME.
166500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
166600 SUB-TEST-F3-20.
166700     IF       TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
166800         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
166900         EQUAL TO ZERO
167000         PERFORM PASS
167100         GO TO SUB-WRITE-F3-20.
167200     GO TO SUB-FAIL-F3-20.
167300 SUB-DELETE-F3-20.
167400     PERFORM DE-LETE.
167500     GO TO SUB-WRITE-F3-20.
167600 SUB-FAIL-F3-20.
167700     MOVE 00 TO CORRECT-N.
167800     MOVE     TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
167900         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
168000         TO COMPUTED-N.
168100     PERFORM FAIL.
168200 SUB-WRITE-F3-20.
168300     PERFORM PRINT-DETAIL.
168400*
168500 SUB-INIT-F3-21.
168600     MOVE "SUB-TEST-F3-21" TO PAR-NAME.
168700     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
168800 SUB-TEST-F3-21.
168900     IF       TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
169000         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
169100         EQUAL TO ZERO
169200         PERFORM PASS
169300         GO TO SUB-WRITE-F3-21.
169400     GO TO SUB-FAIL-F3-21.
169500 SUB-DELETE-F3-21.
169600     PERFORM DE-LETE.
169700     GO TO SUB-WRITE-F3-21.
169800 SUB-FAIL-F3-21.
169900     MOVE 00 TO CORRECT-N.
170000     MOVE     TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
170100         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
170200         TO COMPUTED-N.
170300     PERFORM FAIL.
170400 SUB-WRITE-F3-21.
170500     PERFORM PRINT-DETAIL.
170600*
170700 SUB-INIT-F3-22.
170800     MOVE "SUB-TEST-F3-22" TO PAR-NAME.
170900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
171000 SUB-TEST-F3-22.
171100     IF       TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
171200         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
171300         EQUAL TO ZERO
171400         PERFORM PASS
171500         GO TO SUB-WRITE-F3-22.
171600     GO TO SUB-FAIL-F3-22.
171700 SUB-DELETE-F3-22.
171800     PERFORM DE-LETE.
171900     GO TO SUB-WRITE-F3-22.
172000 SUB-FAIL-F3-22.
172100     MOVE 00 TO CORRECT-N.
172200     MOVE     TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
172300         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
172400         TO COMPUTED-N.
172500     PERFORM FAIL.
172600 SUB-WRITE-F3-22.
172700     PERFORM PRINT-DETAIL.
172800*
172900 SUB-INIT-F3-23.
173000     MOVE "SUB-TEST-F3-23" TO PAR-NAME.
173100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
173200 SUB-TEST-F3-23.
173300     IF       TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
173400         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
173500         EQUAL TO ZERO
173600         PERFORM PASS
173700         GO TO SUB-WRITE-F3-23.
173800     GO TO SUB-FAIL-F3-23.
173900 SUB-DELETE-F3-23.
174000     PERFORM DE-LETE.
174100     GO TO SUB-WRITE-F3-23.
174200 SUB-FAIL-F3-23.
174300     MOVE 00 TO CORRECT-N.
174400     MOVE     TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
174500         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
174600         TO COMPUTED-N.
174700     PERFORM FAIL.
174800 SUB-WRITE-F3-23.
174900     PERFORM PRINT-DETAIL.
175000*
175100 SUB-INIT-F3-24.
175200     MOVE "SUB-TEST-F3-24" TO PAR-NAME.
175300     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
175400 SUB-TEST-F3-24.
175500     IF       TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
175600         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
175700         EQUAL TO ZERO
175800         PERFORM PASS
175900         GO TO SUB-WRITE-F3-24.
176000     GO TO SUB-FAIL-F3-24.
176100 SUB-DELETE-F3-24.
176200     PERFORM DE-LETE.
176300     GO TO SUB-WRITE-F3-24.
176400 SUB-FAIL-F3-24.
176500     MOVE 00 TO CORRECT-N.
176600     MOVE     TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
176700         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5C
176800         TO COMPUTED-N.
176900     PERFORM FAIL.
177000 SUB-WRITE-F3-24.
177100     PERFORM PRINT-DETAIL.
177200*
177300 SUB-INIT-F2-25.
177400*    ===-->  48 LEVELS OF QUALIFICATION  <--===
177500     MOVE   "SUB-TEST-F2-25 " TO PAR-NAME.
177600     MOVE   "VI-2 1.3.2" TO ANSI-REFERENCE.
177700     MOVE    ZERO TO ACCUMULATOR1.
177800 SUB-TEST-F2-25.
177900     SUBTRACT GROUP-49-2  OF GROUP-48 IN GROUP-47 OF GROUP-46
178000              IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
178100              IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
178200              IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
178300              IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
178400              IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
178500              IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
178600              IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
178700              IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
178800              IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
178900              IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
179000              IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
179100              IN SECOND-GROUP
179200         FROM 200
179300       GIVING ACCUMULATOR1.
179400     IF      ACCUMULATOR1 EQUAL TO ZERO
179500             PERFORM PASS
179600             GO TO   SUB-WRITE-F2-25.
179700     GO TO SUB-FAIL-F2-25.
179800 SUB-DELETE-F2-25.
179900     PERFORM DE-LETE.
180000     GO TO   SUB-WRITE-F2-25.
180100 SUB-FAIL-F2-25.
180200     MOVE    200 TO CORRECT-N.
180300     MOVE    GROUP-49-2  OF GROUP-48 IN GROUP-47 OF GROUP-46
180400             IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
180500             IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
180600             IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
180700             IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
180800             IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
180900             IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
181000             IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
181100             IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
181200             IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
181300             IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
181400             IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
181500             IN SECOND-GROUP
181600          TO COMPUTED-N.
181700     PERFORM FAIL.
181800 SUB-WRITE-F2-25.
181900     PERFORM PRINT-DETAIL.
182000     PERFORM END-ROUTINE.
182100*
182200 MPY-INIT-F2-1.
182300     MOVE "MPY-TEST-F2-1  " TO PAR-NAME.
182400     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
182500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
182600 MPY-TEST-F2-1.
182700     MOVE ZERO TO ACCUMULATOR1.
182800     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
182900         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
183000         BY   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
183100         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
183200     GIVING ACCUMULATOR1.
183300     IF ACCUMULATOR1 EQUAL TO 1
183400         PERFORM PASS
183500         GO TO MPY-WRITE-F2-1.
183600     GO TO MPY-FAIL-F2-1.
183700 MPY-DELETE-F2-1.
183800     PERFORM DE-LETE.
183900     GO TO MPY-WRITE-F2-1.
184000 MPY-FAIL-F2-1.
184100     MOVE ACCUMULATOR1 TO COMPUTED-N.
184200     MOVE 1 TO CORRECT-N.
184300     PERFORM FAIL.
184400 MPY-WRITE-F2-1.
184500     PERFORM PRINT-DETAIL.
184600*
184700 MPY-INIT-F2-2.
184800     MOVE "MPY-TEST-F2-2  " TO PAR-NAME.
184900     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
185000     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
185100     MOVE ZERO TO ACCUMULATOR1.
185200 MPY-TEST-F2-2.
185300     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
185400         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
185500         BY   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
185600         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
185700         GIVING ACCUMULATOR1.
185800     IF ACCUMULATOR1 EQUAL TO 4
185900         PERFORM PASS
186000         GO TO MPY-WRITE-F2-2.
186100     GO TO MPY-FAIL-F2-2.
186200 MPY-DELETE-F2-2.
186300     PERFORM DE-LETE.
186400     GO TO MPY-WRITE-F2-2.
186500 MPY-FAIL-F2-2.
186600     MOVE 4 TO CORRECT-N.
186700     PERFORM FAIL
186800     MOVE ACCUMULATOR1 TO COMPUTED-N.
186900 MPY-WRITE-F2-2.
187000     PERFORM PRINT-DETAIL.
187100*
187200 MPY-INIT-F2-3.
187300     MOVE "MPY-TEST-F2-3  " TO PAR-NAME.
187400     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
187500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
187600     MOVE ZERO TO ACCUMULATOR1.
187700 MPY-TEST-F2-3.
187800     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
187900         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A BY 1
188000     GIVING ACCUMULATOR1.
188100     IF ACCUMULATOR1 EQUAL TO 3
188200         PERFORM PASS
188300         GO TO MPY-WRITE-F2-3.
188400     GO TO MPY-FAIL-F2-3.
188500 MPY-DELETE-F2-3.
188600     PERFORM DE-LETE.
188700     GO TO MPY-WRITE-F2-3.
188800 MPY-FAIL-F2-3.
188900     MOVE ACCUMULATOR1 TO COMPUTED-N.
189000     MOVE 3 TO CORRECT-N.
189100     PERFORM FAIL.
189200 MPY-WRITE-F2-3.
189300     PERFORM PRINT-DETAIL.
189400*
189500 MPY-INIT-F2-4.
189600     MOVE "MPY-TEST-F2-4  " TO PAR-NAME.
189700     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
189800     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
189900     MOVE ZERO TO ACCUMULATOR1.
190000 MPY-TEST-F2-4.
190100     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
190200         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A BY 1
190300     GIVING ACCUMULATOR1.
190400     IF ACCUMULATOR1 EQUAL TO 4
190500         PERFORM PASS
190600         GO TO MPY-WRITE-F2-4.
190700     GO TO MPY-FAIL-F2-4.
190800 MPY-DELETE-F2-4.
190900     PERFORM DE-LETE.
191000     GO TO MPY-WRITE-F2-4.
191100 MPY-FAIL-F2-4.
191200     MOVE ACCUMULATOR1 TO COMPUTED-N.
191300     MOVE 4 TO CORRECT-N.
191400     PERFORM FAIL.
191500 MPY-WRITE-F2-4.
191600     PERFORM PRINT-DETAIL.
191700*
191800 MPY-INIT-F2-5.
191900     MOVE "MPY-TEST-F2-5  " TO PAR-NAME.
192000     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
192100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
192200     MOVE ZERO TO ACCUMULATOR1.
192300 MPY-TEST-F2-5.
192400     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
192500         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
192600         BY   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
192700         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
192800     GIVING ACCUMULATOR1.
192900     IF ACCUMULATOR1 EQUAL TO 25
193000         PERFORM PASS
193100         GO TO MPY-WRITE-F2-5.
193200     GO TO MPY-FAIL-F2-5.
193300 MPY-DELETE-F2-5.
193400     PERFORM DE-LETE.
193500     GO TO MPY-WRITE-F2-5.
193600 MPY-FAIL-F2-5.
193700     MOVE ACCUMULATOR1 TO COMPUTED-N.
193800     MOVE 25 TO CORRECT-N.
193900     PERFORM FAIL.
194000 MPY-WRITE-F2-5.
194100     PERFORM PRINT-DETAIL.
194200*
194300 MPY-INIT-F2-6.
194400     MOVE "MPY-TEST-F2-6  " TO PAR-NAME.
194500     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
194600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
194700     MOVE ZERO TO ACCUMULATOR1.
194800 MPY-TEST-F2-6.
194900     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
195000         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
195100         BY   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
195200         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
195300     GIVING ACCUMULATOR1.
195400     IF ACCUMULATOR1 EQUAL TO 36
195500         PERFORM PASS
195600         GO TO MPY-WRITE-F2-6.
195700     GO TO MPY-FAIL-F2-6.
195800 MPY-DELETE-F2-6.
195900     PERFORM DE-LETE.
196000     GO TO MPY-WRITE-F2-6.
196100 MPY-FAIL-F2-6.
196200     MOVE ACCUMULATOR1 TO COMPUTED-N.
196300     MOVE 36 TO CORRECT-N.
196400     PERFORM FAIL.
196500 MPY-WRITE-F2-6.
196600     PERFORM PRINT-DETAIL.
196700*
196800 MPY-INIT-F2-7.
196900     MOVE "MPY-TEST-F2-7  " TO PAR-NAME.
197000     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
197100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
197200     MOVE ZERO TO ACCUMULATOR1.
197300 MPY-TEST-F2-7.
197400     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
197500         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A BY 1
197600     GIVING ACCUMULATOR1.
197700     IF ACCUMULATOR1 EQUAL TO 7
197800         PERFORM PASS
197900         GO TO MPY-WRITE-F2-7.
198000     GO TO MPY-FAIL-F2-7.
198100 MPY-DELETE-F2-7.
198200     PERFORM DE-LETE.
198300     GO TO MPY-WRITE-F2-7.
198400 MPY-FAIL-F2-7.
198500     MOVE ACCUMULATOR1 TO COMPUTED-N.
198600     MOVE 7 TO CORRECT-N.
198700     PERFORM FAIL.
198800 MPY-WRITE-F2-7.
198900     PERFORM PRINT-DETAIL.
199000*
199100 MPY-INIT-F2-8.
199200     MOVE "MPY-TEST-F2-8  " TO PAR-NAME.
199300     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
199400     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
199500     MOVE ZERO TO ACCUMULATOR1.
199600 MPY-TEST-F2-8.
199700     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
199800         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A BY 1
199900     GIVING ACCUMULATOR1.
200000     IF ACCUMULATOR1 EQUAL TO 8
200100         PERFORM PASS
200200         GO TO MPY-WRITE-F2-8.
200300     GO TO MPY-FAIL-F2-8.
200400 MPY-DELETE-F2-8.
200500     PERFORM DE-LETE.
200600     GO TO MPY-WRITE-F2-8.
200700 MPY-FAIL-F2-8.
200800     MOVE ACCUMULATOR1 TO COMPUTED-N.
200900     MOVE 8 TO CORRECT-N.
201000     PERFORM FAIL.
201100 MPY-WRITE-F2-8.
201200     PERFORM PRINT-DETAIL.
201300*
201400 MPY-INIT-F2-9.
201500     MOVE "MPY-TEST-F2-9  " TO PAR-NAME.
201600     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
201700     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
201800     MOVE ZERO TO ACCUMULATOR2.
201900 MPY-TEST-F2-9.
202000     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
202100         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A BY 1
202200     GIVING ACCUMULATOR2.
202300     IF ACCUMULATOR2 EQUAL TO 9
202400         PERFORM PASS
202500         GO TO MPY-WRITE-F2-9.
202600     GO TO MPY-FAIL-F2-9.
202700 MPY-DELETE-F2-9.
202800     PERFORM DE-LETE.
202900     GO TO MPY-WRITE-F2-9.
203000 MPY-FAIL-F2-9.
203100     MOVE ACCUMULATOR2 TO COMPUTED-N.
203200     MOVE 9 TO CORRECT-N.
203300     PERFORM FAIL.
203400 MPY-WRITE-F2-9.
203500     PERFORM PRINT-DETAIL.
203600*
203700 MPY-INIT-F2-10.
203800     MOVE "MPY-TEST-F2-10 " TO PAR-NAME.
203900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
204000     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
204100     MOVE ZERO TO ACCUMULATOR2.
204200 MPY-TEST-F2-10.
204300     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
204400         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A BY 1
204500     GIVING ACCUMULATOR2.
204600     IF ACCUMULATOR2 EQUAL TO 10
204700         PERFORM PASS
204800         GO TO MPY-WRITE-F2-10.
204900     GO TO MPY-FAIL-F2-10.
205000 MPY-DELETE-F2-10.
205100     PERFORM DE-LETE.
205200     GO TO MPY-WRITE-F2-10.
205300 MPY-FAIL-F2-10.
205400     MOVE ACCUMULATOR2 TO COMPUTED-N.
205500     MOVE 10 TO CORRECT-N.
205600     PERFORM FAIL.
205700 MPY-WRITE-F2-10.
205800     PERFORM PRINT-DETAIL.
205900*
206000 MPY-INIT-F2-11.
206100     MOVE "MPY-TEST-F2-11 " TO PAR-NAME.
206200     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
206300     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
206400     MOVE ZERO TO ACCUMULATOR2.
206500 MPY-TEST-F2-11.
206600     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
206700         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
206800         BY   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
206900         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
207000     GIVING ACCUMULATOR2.
207100     IF ACCUMULATOR2 EQUAL TO 121
207200         PERFORM PASS
207300         GO TO MPY-WRITE-F2-11.
207400     GO TO MPY-FAIL-F2-11.
207500 MPY-DELETE-F2-11.
207600     PERFORM DE-LETE.
207700     GO TO MPY-WRITE-F2-11.
207800 MPY-FAIL-F2-11.
207900     MOVE ACCUMULATOR2 TO COMPUTED-N.
208000     MOVE 121 TO CORRECT-N.
208100     PERFORM FAIL.
208200 MPY-WRITE-F2-11.
208300     PERFORM PRINT-DETAIL.
208400*
208500 MPY-INIT-F2-12.
208600     MOVE "MPY-TEST-F2-12 " TO PAR-NAME.
208700     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
208800     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
208900     MOVE ZERO TO ACCUMULATOR2.
209000 MPY-TEST-F2-12.
209100     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
209200         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
209300         BY   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
209400         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
209500     GIVING ACCUMULATOR2.
209600     IF ACCUMULATOR2 EQUAL TO 144
209700         PERFORM PASS
209800         GO TO MPY-WRITE-F2-12.
209900     GO TO MPY-FAIL-F2-12.
210000 MPY-DELETE-F2-12.
210100     PERFORM DE-LETE.
210200     GO TO MPY-WRITE-F2-12.
210300 MPY-FAIL-F2-12.
210400     MOVE ACCUMULATOR2 TO COMPUTED-N.
210500     MOVE 144 TO CORRECT-N.
210600     PERFORM FAIL.
210700 MPY-WRITE-F2-12.
210800     PERFORM PRINT-DETAIL.
210900*
211000 MPY-INIT-F2-13.
211100     MOVE "MPY-TEST-F2-13 " TO PAR-NAME.
211200     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
211300     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
211400     MOVE ZERO TO ACCUMULATOR2.
211500 MPY-TEST-F2-13.
211600     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
211700         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A BY 1
211800     GIVING ACCUMULATOR2.
211900     IF ACCUMULATOR2 EQUAL TO 13
212000         PERFORM PASS
212100         GO TO MPY-WRITE-F2-13.
212200     GO TO MPY-FAIL-F2-13.
212300 MPY-DELETE-F2-13.
212400     PERFORM DE-LETE.
212500     GO TO MPY-WRITE-F2-13.
212600 MPY-FAIL-F2-13.
212700     MOVE ACCUMULATOR2 TO COMPUTED-N.
212800     MOVE 13 TO CORRECT-N.
212900     PERFORM FAIL.
213000 MPY-WRITE-F2-13.
213100     PERFORM PRINT-DETAIL.
213200*
213300 MPY-INIT-F2-14.
213400     MOVE "MPY-TEST-F2-14 " TO PAR-NAME.
213500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
213600     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
213700     MOVE ZERO TO ACCUMULATOR2.
213800 MPY-TEST-F2-14.
213900     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
214000         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A BY 1
214100     GIVING ACCUMULATOR2.
214200     IF ACCUMULATOR2 EQUAL TO 14
214300         PERFORM PASS
214400         GO TO MPY-WRITE-F2-14.
214500     GO TO MPY-FAIL-F2-14.
214600 MPY-DELETE-F2-14.
214700     PERFORM DE-LETE.
214800     GO TO MPY-WRITE-F2-14.
214900 MPY-FAIL-F2-14.
215000     MOVE ACCUMULATOR2 TO COMPUTED-N.
215100     MOVE 14 TO CORRECT-N.
215200     PERFORM FAIL.
215300 MPY-WRITE-F2-14.
215400     PERFORM PRINT-DETAIL.
215500*
215600 MPY-INIT-F2-15.
215700     MOVE "MPY-TEST-F2-15 " TO PAR-NAME.
215800     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
215900     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
216000     MOVE ZERO TO ACCUMULATOR2.
216100 MPY-TEST-F2-15.
216200     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
216300         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
216400         BY   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
216500         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
216600     GIVING ACCUMULATOR2.
216700     IF ACCUMULATOR2 EQUAL TO 225
216800         PERFORM PASS
216900         GO TO MPY-WRITE-F2-15.
217000     GO TO MPY-FAIL-F2-15.
217100 MPY-DELETE-F2-15.
217200     PERFORM DE-LETE.
217300     GO TO MPY-WRITE-F2-15.
217400 MPY-FAIL-F2-15.
217500     MOVE ACCUMULATOR2 TO COMPUTED-N.
217600     MOVE 225 TO CORRECT-N.
217700     PERFORM FAIL.
217800 MPY-WRITE-F2-15.
217900     PERFORM PRINT-DETAIL.
218000*
218100 MPY-INIT-F2-16.
218200     MOVE "MPY-TEST-F2-16 " TO PAR-NAME.
218300     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
218400     MOVE "QUALIFIED MULTIPLY" TO FEATURE.
218500     MOVE ZERO TO ACCUMULATOR2.
218600 MPY-TEST-F2-16.
218700     MULTIPLY TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
218800         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
218900         BY   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
219000         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
219100     GIVING ACCUMULATOR2.
219200     IF ACCUMULATOR2 EQUAL TO 256
219300         PERFORM PASS
219400         GO TO MPY-WRITE-F2-16.
219500     GO TO MPY-FAIL-F2-16.
219600 MPY-DELETE-F2-16.
219700     PERFORM DE-LETE.
219800     GO TO MPY-WRITE-F2-16.
219900 MPY-FAIL-F2-16.
220000     MOVE ACCUMULATOR2 TO COMPUTED-N.
220100     MOVE 256 TO CORRECT-N.
220200     PERFORM FAIL.
220300 MPY-WRITE-F2-16.
220400     PERFORM PRINT-DETAIL.
220500*
220600 MPY-INIT-F2-17.
220700*    ===-->  48 LEVELS OF QUALIFICATION  <--===
220800     MOVE   "MPY-TEST-F2-17 " TO PAR-NAME.
220900     MOVE   "VI-2 1.3.2" TO ANSI-REFERENCE.
221000     MOVE    ZERO TO ACCUMULATOR1.
221100 MPY-TEST-F2-17.
221200     MULTIPLY GROUP-49-3  OF GROUP-48 IN GROUP-47 OF GROUP-46
221300              IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
221400              IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
221500              IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
221600              IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
221700              IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
221800              IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
221900              IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
222000              IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
222100              IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
222200              IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
222300              IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
222400              IN FIRST-GROUP
222500           BY 3
222600       GIVING ACCUMULATOR1.
222700     IF      ACCUMULATOR1 EQUAL TO 9
222800             PERFORM PASS
222900             GO TO   MPY-WRITE-F2-17.
223000     GO TO MPY-FAIL-F2-17.
223100 MPY-DELETE-F2-17.
223200     PERFORM DE-LETE.
223300     GO TO   MPY-WRITE-F2-17.
223400 MPY-FAIL-F2-17.
223500     MOVE    9 TO CORRECT-N.
223600     MOVE    GROUP-49-3  OF GROUP-48 IN GROUP-47 OF GROUP-46
223700             IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
223800             IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
223900             IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
224000             IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
224100             IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
224200             IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
224300             IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
224400             IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
224500             IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
224600             IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
224700             IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
224800             IN FIRST-GROUP
224900          TO COMPUTED-N.
225000     MOVE   "3 TIMES 3 SHOULD BE 9" TO RE-MARK.
225100     PERFORM FAIL.
225200 MPY-WRITE-F2-17.
225300     PERFORM PRINT-DETAIL.
225400     PERFORM END-ROUTINE.
225500*
225600 DIV-INIT-F3-1.
225700     MOVE "DIV-TEST-F3-1  " TO PAR-NAME
225800     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
225900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
226000     MOVE ZERO TO ACCUMULATOR1.
226100 DIV-TEST-F3-1.
226200     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
226300         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
226400         BY   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
226500         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
226600     GIVING ACCUMULATOR1.
226700     IF ACCUMULATOR1 EQUAL TO 1
226800         PERFORM PASS
226900         GO TO DIV-WRITE-F3-1.
227000     GO TO DIV-FAIL-F3-1.
227100 DIV-DELETE-F3-1.
227200     PERFORM DE-LETE.
227300     GO TO DIV-WRITE-F3-1.
227400 DIV-FAIL-F3-1.
227500     MOVE ACCUMULATOR1 TO COMPUTED-N.
227600     MOVE 1 TO CORRECT-N.
227700     PERFORM FAIL.
227800 DIV-WRITE-F3-1.
227900     PERFORM PRINT-DETAIL.
228000*
228100 DIV-INIT-F3-2.
228200     MOVE "DIV-TEST-F3-2  " TO PAR-NAME
228300     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
228400     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
228500     MOVE ZERO TO ACCUMULATOR1.
228600 DIV-TEST-F3-2.
228700     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
228800         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
228900         BY   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
229000         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
229100     GIVING ACCUMULATOR1.
229200     IF ACCUMULATOR1 EQUAL TO 1
229300         PERFORM PASS
229400         GO TO DIV-WRITE-F3-2.
229500     GO TO DIV-FAIL-F3-2.
229600 DIV-DELETE-F3-2.
229700     PERFORM DE-LETE.
229800     GO TO DIV-WRITE-F3-2.
229900 DIV-FAIL-F3-2.
230000     MOVE 1 TO CORRECT-N.
230100     MOVE ACCUMULATOR1 TO COMPUTED-N.
230200     PERFORM FAIL.
230300 DIV-WRITE-F3-2.
230400     PERFORM PRINT-DETAIL.
230500*
230600 DIV-INIT-F3-3.
230700     MOVE "DIV-TEST-F3-3  " TO PAR-NAME
230800     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
230900     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
231000     MOVE ZERO TO ACCUMULATOR1.
231100 DIV-TEST-F3-3.
231200     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
231300         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A BY 3
231400     GIVING ACCUMULATOR1.
231500     IF ACCUMULATOR1 EQUAL TO 1
231600         PERFORM PASS
231700         GO TO DIV-WRITE-F3-3.
231800     GO TO DIV-FAIL-F3-3.
231900 DIV-DELETE-F3-3.
232000     PERFORM DE-LETE.
232100     GO TO DIV-WRITE-F3-3.
232200 DIV-FAIL-F3-3.
232300     MOVE 1 TO CORRECT-N.
232400     MOVE ACCUMULATOR1 TO COMPUTED-N.
232500     PERFORM FAIL.
232600 DIV-WRITE-F3-3.
232700     PERFORM PRINT-DETAIL.
232800*
232900 DIV-INIT-F3-4.
233000     MOVE "DIV-TEST-F3-4  " TO PAR-NAME
233100     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
233200     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
233300     MOVE ZERO TO ACCUMULATOR1.
233400 DIV-TEST-F3-4.
233500     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
233600         TABLE-LEVEL-3A IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A BY 3
233700     GIVING ACCUMULATOR1.
233800     IF ACCUMULATOR1 EQUAL TO 1
233900         PERFORM PASS
234000         GO TO DIV-WRITE-F3-4.
234100     GO TO DIV-FAIL-F3-4.
234200 DIV-DELETE-F3-4.
234300     PERFORM DE-LETE.
234400     GO TO DIV-WRITE-F3-4.
234500 DIV-FAIL-F3-4.
234600     MOVE 1 TO CORRECT-N.
234700     MOVE ACCUMULATOR1 TO COMPUTED-N.
234800     PERFORM FAIL.
234900 DIV-WRITE-F3-4.
235000     PERFORM PRINT-DETAIL.
235100*
235200 DIV-INIT-F3-5.
235300     MOVE "DIV-TEST-F3-5  " TO PAR-NAME
235400     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
235500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
235600     MOVE ZERO TO ACCUMULATOR1.
235700 DIV-TEST-F3-5.
235800     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
235900         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
236000         BY   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
236100         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
236200     GIVING ACCUMULATOR1.
236300     IF ACCUMULATOR1 EQUAL TO 1
236400         PERFORM PASS
236500         GO TO DIV-WRITE-F3-5.
236600     GO TO DIV-FAIL-F3-5.
236700 DIV-DELETE-F3-5.
236800     PERFORM DE-LETE.
236900     GO TO DIV-WRITE-F3-5.
237000 DIV-FAIL-F3-5.
237100     MOVE 1 TO CORRECT-N.
237200     MOVE ACCUMULATOR1 TO COMPUTED-N.
237300     PERFORM FAIL.
237400 DIV-WRITE-F3-5.
237500     PERFORM PRINT-DETAIL.
237600*
237700 DIV-INIT-F3-6.
237800     MOVE "DIV-TEST-F3-6  " TO PAR-NAME
237900     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
238000     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
238100     MOVE ZERO TO ACCUMULATOR1.
238200 DIV-TEST-F3-6.
238300     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
238400         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
238500         BY   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
238600         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A
238700     GIVING ACCUMULATOR1.
238800     IF ACCUMULATOR1 EQUAL TO 1
238900         PERFORM PASS
239000         GO TO DIV-WRITE-F3-6.
239100     GO TO DIV-FAIL-F3-6.
239200 DIV-DELETE-F3-6.
239300     PERFORM DE-LETE.
239400     GO TO DIV-WRITE-F3-6.
239500 DIV-FAIL-F3-6.
239600     MOVE 1 TO CORRECT-N.
239700     MOVE ACCUMULATOR1 TO COMPUTED-N.
239800     PERFORM FAIL.
239900 DIV-WRITE-F3-6.
240000     PERFORM PRINT-DETAIL.
240100*
240200 DIV-INIT-F3-7.
240300     MOVE "DIV-TEST-F3-7  " TO PAR-NAME
240400     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
240500     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
240600     MOVE ZERO TO ACCUMULATOR1.
240700 DIV-TEST-F3-7.
240800     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
240900         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A BY 7
241000     GIVING ACCUMULATOR1.
241100     IF ACCUMULATOR1 EQUAL TO 1
241200         PERFORM PASS
241300         GO TO DIV-WRITE-F3-7.
241400     GO TO DIV-FAIL-F3-7.
241500 DIV-DELETE-F3-7.
241600     PERFORM DE-LETE.
241700     GO TO DIV-WRITE-F3-7.
241800 DIV-FAIL-F3-7.
241900     MOVE 1 TO CORRECT-N.
242000     MOVE ACCUMULATOR1 TO COMPUTED-N.
242100     PERFORM FAIL.
242200 DIV-WRITE-F3-7.
242300     PERFORM PRINT-DETAIL.
242400*
242500 DIV-INIT-F3-8.
242600     MOVE "DIV-TEST-F3-8  " TO PAR-NAME
242700     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
242800     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
242900     MOVE ZERO TO ACCUMULATOR1.
243000 DIV-TEST-F3-8.
243100     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
243200         TABLE-LEVEL-3B IN TABLE-LEVEL-4A OF TABLE-LEVEL-5A BY 8
243300     GIVING ACCUMULATOR1.
243400     IF ACCUMULATOR1 EQUAL TO 1
243500         PERFORM PASS
243600         GO TO DIV-WRITE-F3-8.
243700     GO TO DIV-FAIL-F3-8.
243800 DIV-DELETE-F3-8.
243900     PERFORM DE-LETE.
244000     GO TO DIV-WRITE-F3-8.
244100 DIV-FAIL-F3-8.
244200     MOVE 1 TO CORRECT-N.
244300     MOVE ACCUMULATOR1 TO COMPUTED-N.
244400     PERFORM FAIL.
244500 DIV-WRITE-F3-8.
244600     PERFORM PRINT-DETAIL.
244700*
244800 DIV-INIT-F3-9.
244900     MOVE "DIV-TEST-F3-9  " TO PAR-NAME
245000     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
245100     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
245200     MOVE ZERO TO ACCUMULATOR2.
245300 DIV-TEST-F3-9.
245400     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
245500         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A BY 9
245600     GIVING ACCUMULATOR2.
245700     IF ACCUMULATOR2 EQUAL TO 1
245800         PERFORM PASS
245900         GO TO DIV-WRITE-F3-9.
246000     GO TO DIV-FAIL-F3-9.
246100 DIV-DELETE-F3-9.
246200     PERFORM DE-LETE.
246300     GO TO DIV-WRITE-F3-9.
246400 DIV-FAIL-F3-9.
246500     MOVE 1 TO CORRECT-N.
246600     MOVE ACCUMULATOR2 TO COMPUTED-N.
246700     PERFORM FAIL.
246800 DIV-WRITE-F3-9.
246900     PERFORM PRINT-DETAIL.
247000*
247100 DIV-INIT-F3-10.
247200     MOVE "DIV-TEST-F3-10 " TO PAR-NAME
247300     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
247400     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
247500     MOVE ZERO TO ACCUMULATOR2.
247600 DIV-TEST-F3-10.
247700     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
247800         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A BY 10
247900     GIVING ACCUMULATOR2.
248000     IF ACCUMULATOR2 EQUAL TO 1
248100         PERFORM PASS
248200         GO TO DIV-WRITE-F3-10.
248300     GO TO DIV-FAIL-F3-10.
248400 DIV-DELETE-F3-10.
248500     PERFORM DE-LETE.
248600     GO TO DIV-WRITE-F3-10.
248700 DIV-FAIL-F3-10.
248800     MOVE 1 TO CORRECT-N.
248900     MOVE ACCUMULATOR2 TO COMPUTED-N.
249000     PERFORM FAIL.
249100 DIV-WRITE-F3-10.
249200     PERFORM PRINT-DETAIL.
249300*
249400 DIV-INIT-F3-11.
249500     MOVE "DIV-TEST-F3-11 " TO PAR-NAME
249600     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
249700     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
249800     MOVE ZERO TO ACCUMULATOR2.
249900 DIV-TEST-F3-11.
250000     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
250100         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
250200         BY   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
250300         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
250400     GIVING ACCUMULATOR2.
250500     IF ACCUMULATOR2 EQUAL TO 1
250600         PERFORM PASS
250700         GO TO DIV-WRITE-F3-11.
250800     GO TO DIV-FAIL-F3-11.
250900 DIV-DELETE-F3-11.
251000     PERFORM DE-LETE.
251100     GO TO DIV-WRITE-F3-11.
251200 DIV-FAIL-F3-11.
251300     MOVE 1 TO CORRECT-N.
251400     MOVE ACCUMULATOR2 TO COMPUTED-N.
251500     PERFORM FAIL.
251600 DIV-WRITE-F3-11.
251700     PERFORM PRINT-DETAIL.
251800*
251900 DIV-INIT-F3-12.
252000     MOVE "DIV-TEST-F3-12 " TO PAR-NAME
252100     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
252200     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
252300     MOVE ZERO TO ACCUMULATOR2.
252400 DIV-TEST-F3-12.
252500     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
252600         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
252700         BY   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
252800         TABLE-LEVEL-3A IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
252900     GIVING ACCUMULATOR2.
253000     IF ACCUMULATOR2 EQUAL TO 1
253100         PERFORM PASS
253200         GO TO DIV-WRITE-F3-12.
253300     GO TO DIV-FAIL-F3-12.
253400 DIV-DELETE-F3-12.
253500     PERFORM DE-LETE.
253600     GO TO DIV-WRITE-F3-12.
253700 DIV-FAIL-F3-12.
253800     MOVE 1 TO CORRECT-N.
253900     MOVE ACCUMULATOR2 TO COMPUTED-N.
254000     PERFORM FAIL.
254100 DIV-WRITE-F3-12.
254200     PERFORM PRINT-DETAIL.
254300*
254400 DIV-INIT-F3-13.
254500     MOVE "DIV-TEST-F3-13 " TO PAR-NAME
254600     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
254700     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
254800     MOVE ZERO TO ACCUMULATOR2.
254900 DIV-TEST-F3-13.
255000     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2A OF
255100         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A BY 13
255200     GIVING ACCUMULATOR2.
255300     IF ACCUMULATOR2 EQUAL TO 1
255400         PERFORM PASS
255500         GO TO DIV-WRITE-F3-13.
255600     GO TO DIV-FAIL-F3-13.
255700 DIV-DELETE-F3-13.
255800     PERFORM DE-LETE.
255900     GO TO DIV-WRITE-F3-13.
256000 DIV-FAIL-F3-13.
256100     MOVE 1 TO CORRECT-N.
256200     MOVE ACCUMULATOR2 TO COMPUTED-N.
256300     PERFORM FAIL.
256400 DIV-WRITE-F3-13.
256500     PERFORM PRINT-DETAIL.
256600*
256700 DIV-INIT-F3-14.
256800     MOVE "DIV-TEST-F3-14 " TO PAR-NAME
256900     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
257000     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
257100     MOVE ZERO TO ACCUMULATOR2.
257200 DIV-TEST-F3-14.
257300     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2A OF
257400         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A BY 14
257500     GIVING ACCUMULATOR2.
257600     IF ACCUMULATOR2 EQUAL TO 1
257700         PERFORM PASS
257800         GO TO DIV-WRITE-F3-14.
257900     GO TO DIV-FAIL-F3-14.
258000 DIV-DELETE-F3-14.
258100     PERFORM DE-LETE.
258200     GO TO DIV-WRITE-F3-14.
258300 DIV-FAIL-F3-14.
258400     MOVE 1 TO CORRECT-N.
258500     MOVE ACCUMULATOR2 TO COMPUTED-N.
258600     PERFORM FAIL.
258700 DIV-WRITE-F3-14.
258800     PERFORM PRINT-DETAIL.
258900*
259000 DIV-INIT-F3-15.
259100     MOVE "DIV-TEST-F3-15 " TO PAR-NAME
259200     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
259300     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
259400     MOVE ZERO TO ACCUMULATOR2.
259500 DIV-TEST-F3-15.
259600     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
259700         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
259800         BY   TBL-ITEM-1 OF TABLE-LEVEL-1A IN TABLE-LEVEL-2B OF
259900         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
260000     GIVING ACCUMULATOR2.
260100     IF ACCUMULATOR2 EQUAL TO 1
260200         PERFORM PASS
260300         GO TO DIV-WRITE-F3-15.
260400     GO TO DIV-FAIL-F3-15.
260500 DIV-DELETE-F3-15.
260600     PERFORM DE-LETE.
260700     GO TO DIV-WRITE-F3-15.
260800 DIV-FAIL-F3-15.
260900     MOVE 1 TO CORRECT-N.
261000     MOVE ACCUMULATOR2 TO COMPUTED-N.
261100     PERFORM FAIL.
261200 DIV-WRITE-F3-15.
261300     PERFORM PRINT-DETAIL.
261400*
261500 DIV-INIT-F3-16.
261600     MOVE "DIV-TEST-F3-16 " TO PAR-NAME
261700     MOVE "QUALIFIED DIVIDE " TO  FEATURE.
261800     MOVE "IV-18 4.3.8.1" TO ANSI-REFERENCE.
261900     MOVE ZERO TO ACCUMULATOR2.
262000 DIV-TEST-F3-16.
262100     DIVIDE   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
262200         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
262300         BY   TBL-ITEM-1 OF TABLE-LEVEL-1B IN TABLE-LEVEL-2B OF
262400         TABLE-LEVEL-3B IN TABLE-LEVEL-4B OF TABLE-LEVEL-5A
262500     GIVING ACCUMULATOR2.
262600     IF ACCUMULATOR2 EQUAL TO 1
262700         PERFORM PASS
262800         GO TO DIV-WRITE-F3-16.
262900     GO TO DIV-FAIL-F3-16.
263000 DIV-DELETE-F3-16.
263100     PERFORM DE-LETE.
263200     GO TO DIV-WRITE-F3-16.
263300 DIV-FAIL-F3-16.
263400     MOVE 1 TO CORRECT-N.
263500     MOVE ACCUMULATOR2 TO COMPUTED-N.
263600     PERFORM FAIL.
263700 DIV-WRITE-F3-16.
263800     PERFORM PRINT-DETAIL.
263900*
264000 DIV-INIT-F3-17.
264100*    ===-->  48 LEVELS OF QUALIFICATION  <--===
264200     MOVE   "DIV-TEST-F3-17 " TO PAR-NAME.
264300     MOVE   "VI-2 1.3.2" TO ANSI-REFERENCE.
264400     MOVE    ZERO TO ACCUMULATOR1.
264500 DIV-TEST-F3-17.
264600     DIVIDE  GROUP-49-4  OF GROUP-48 IN GROUP-47 OF GROUP-46
264700             IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
264800             IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
264900             IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
265000             IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
265100             IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
265200             IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
265300             IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
265400             IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
265500             IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
265600             IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
265700             IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
265800             IN SECOND-GROUP
265900          BY 40
266000       GIVING ACCUMULATOR1.
266100     IF      ACCUMULATOR1 EQUAL TO 10
266200             PERFORM PASS
266300             GO TO   DIV-WRITE-F3-17.
266400     GO TO DIV-FAIL-F3-17.
266500 DIV-DELETE-F3-17.
266600     PERFORM DE-LETE.
266700     GO TO   DIV-WRITE-F3-17.
266800 DIV-FAIL-F3-17.
266900     MOVE    10 TO CORRECT-N.
267000     MOVE    GROUP-49-4  OF GROUP-48 IN GROUP-47 OF GROUP-46
267100             IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
267200             IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
267300             IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
267400             IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
267500             IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
267600             IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
267700             IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
267800             IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
267900             IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
268000             IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
268100             IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
268200             IN SECOND-GROUP
268300          TO COMPUTED-N.
268400     PERFORM FAIL.
268500 DIV-WRITE-F3-17.
268600     PERFORM PRINT-DETAIL.
268700     PERFORM END-ROUTINE.
268800*
268900 CND-INIT-GF-1.
269000*    ===-->  48 LEVELS OF QUALIFICATION  <--===
269100     MOVE   "CND-TEST-GF-1 " TO PAR-NAME.
269200     MOVE   "VI-2 1.3.2" TO ANSI-REFERENCE.
269300     MOVE   "CONDITION NAME " TO  FEATURE.
269400 CND-TEST-GF-1.
269500     IF      LEVEL-49-OK
269600             PERFORM PASS
269700             GO TO   CND-WRITE-GF-1.
269800     GO TO CND-FAIL-GF-1.
269900 CND-DELETE-GF-1.
270000     PERFORM DE-LETE.
270100     GO TO   CND-WRITE-GF-1.
270200 CND-FAIL-GF-1.
270300     MOVE    500 TO CORRECT-N.
270400     MOVE    GROUP-49-5  OF GROUP-48 IN GROUP-47 OF GROUP-46
270500             IN GROUP-45 OF GROUP-44 IN GROUP-43 OF GROUP-42
270600             IN GROUP-41 OF GROUP-40 IN GROUP-39 OF GROUP-38
270700             IN GROUP-37 OF GROUP-36 IN GROUP-35 OF GROUP-34
270800             IN GROUP-33 OF GROUP-32 IN GROUP-31 OF GROUP-30
270900             IN GROUP-29 OF GROUP-28 IN GROUP-27 OF GROUP-26
271000             IN GROUP-25 OF GROUP-24 IN GROUP-23 OF GROUP-22
271100             IN GROUP-21 OF GROUP-20 IN GROUP-19 OF GROUP-18
271200             IN GROUP-17 OF GROUP-16 IN GROUP-15 OF GROUP-14
271300             IN GROUP-13 OF GROUP-12 IN GROUP-11 OF GROUP-10
271400             IN GROUP-09 OF GROUP-08 IN GROUP-07 OF GROUP-06
271500             IN GROUP-05 OF GROUP-04 IN GROUP-03 OF GROUP-02
271600             IN SECOND-GROUP
271700          TO COMPUTED-N.
271800     PERFORM FAIL.
271900 CND-WRITE-GF-1.
272000     PERFORM PRINT-DETAIL.
272100 CCVS-EXIT SECTION.
272200 CCVS-999999.
272300     GO TO CLOSE-FILES.
