000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC216A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM NC216A TESTS ALL FOUR FORMATS OF THE "INSPECT"    *
002300*    STATEMENT USING VARIOUS COMBINATIONS OF THE OPTIONAL      *
002400*    PHRASES: CHARACTERS, ALL, LEADING, FIRST, BEFORE, AFTER.  *
002500*                                                              *
002600****************************************************************
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 01  WRK-DU-999-1 PIC 999.
004400 01  WRK-DU-999-2 PIC 999.
004500 01  WRK-DU-999-3 PIC 999.
004600 01  WRK-DU-999-4 PIC 999.
004700 01  JUST-XN-20-1 PIC X(20) JUSTIFIED.
004800 01  SPACE-XN-1-1 PIC X VALUE SPACE.
004900 01  COMMA-XN-1-1 PIC X VALUE ",".
005000 01  HYPEN-XN-1-1 PIC X VALUE "-".
005100 01  A-XN-1-1 PIC X VALUE "A".
005200 01  D-XN-1-1 PIC X VALUE "D".
005300 01  G-XN-1-1 PIC X VALUE "G".
005400 01  H-XN-1-1 PIC X VALUE "H".
005500 01  L-XN-1-1 PIC X VALUE "L".
005600 01  O-XN-1-1 PIC X VALUE "O".
005700 01  P-XN-1-1 PIC X VALUE "P".
005800 01  S-XN-1-1 PIC X VALUE "S".
005900 01  Z-XN-1-1 PIC X VALUE "Z".
006000 01  AH-XN-2 PIC X(2) VALUE "AH".
006100 01  HSPACE-XN-2 PIC X(2) VALUE "H ".
006200 01  OH-XN-2 PIC X(2) VALUE "OH".
006300 01  ALL-XN-3 PIC X(3) VALUE "ALL".
006400 01  YES-XN-3 PIC X(3) VALUE "YES".
006500 01  X-SPACE-X-XN-3                  PICTURE X(3) VALUE "X X".
006600 01  AABA-XN-4                       PICTURE X(4) VALUE "AABA".
006700 01  WRK-XN-83-1 PIC X(83).
006800 01  WRK-XN-83-2  PIC X(83).
006900 01  WRK-DS-5V0-1  PIC S9(5) VALUE -12345.
007000 01  WRK-NE-1  PIC -999,999.99/9 VALUE "-123,456.78/9".
007100 01  KIDS-CAN-NOT-BE  PIC  X(15)  VALUE "KIDS CAN NOT BE".
007200 01  BLANK-PERIOD PIC X(2) VALUE " ." .
007300 01  WC-XN-83  PIC X(83) VALUE
007400     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
007500-    "IDS CAN NOT BE ALL BAD.".
007600 01  ANS-XN-83-1 PIC X(83) VALUE
007700     "OH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
007800-    "IDS CAN NOT BE ALL BAD.".
007900 01  ANS-XN-83-2 PIC X(83) VALUE
008000     "AH YES,AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
008100-    "IDS CAN NOT BE ALL BAD.".
008200 01  ANS-XN-83-3 PIC X(83) VALUE
008300     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
008400-    "IDS CAN NOT BE ALL-BAD.".
008500 01  ANS-XN-83-4 PIC X(83) VALUE
008600     "EH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
008700-    "IDS CAN NOT BE ALL BAD.".
008800 01  ANS-XN-83-5 PIC X(83) VALUE
008900     "AH YES OH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
009000-    "IDS CAN NOT BE ALL BAD.".
009100 01  ANS-XN-83-6 PIC X(83) VALUE
009200     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
009300-    "IDS CAN NOT BE ALZZZZZZ".
009400 01  ANS-XN-83-7 PIC X(83) VALUE
009500     "OH-YES-AH-YES-W.P.-ZRITOES-HERE.-ANYONE-WHO-HATES-DOGS-AND-K
009600-    "IDS-CAN-NOT-BE-ALZZZZZZ".
009700 01  ANS-XN-83-8 PIC X(83) VALUE
009800     "AH-YES-AH-YES-W.C.-FRITOES-HERE.-ANYONE-WHO-HATES-DOGS-AND-K
009900-    "IDS-CAN-NOT-BE-ALL-BAD.".
010000 01  ANS-XN-83-9  PIC X(83) VALUE
010100     "OH YES AH YES W.C. FROTOES HERE, ANYONE WHO HATES DOGS AND K
010200-    "IDS CAN NOT BE ALL BAD.".
010300 01  ANS-XN-83-10 PIC X(83) VALUE
010400     "OH YES AH YES W.C. FRITOES HE
010500-    "            BE ALL BAD.".
010600 01  ANS-XN-83-11 PIC X(83) VALUE
010700     "OH YES AH
010800-    "                     D.".
010900
011000
011100 01  WS-RIGHT-1-83.
011200   03  WS-RIGHT-1-20                PIC X(20).
011300   03  WS-RIGHT-21-40               PIC X(20).
011400   03  WS-RIGHT-41-60               PIC X(20).
011500   03  WS-RIGHT-61-80               PIC X(20).
011600   03  WS-RIGHT-81-83               PIC X(3).
011700 01  WS-WRONG-1-83.
011800   03  WS-WRONG-1-20                PIC X(20).
011900   03  WS-WRONG-21-40               PIC X(20).
012000   03  WS-WRONG-41-60               PIC X(20).
012100   03  WS-WRONG-61-80               PIC X(20).
012200   03  WS-WRONG-81-83               PIC X(3).
012300
012400 01  INSPECT-FIELDS.
012500   03  GRP-A.
012600     05  PIC X(7)  VALUE "XXXXXXX".
012700     05  PIC X(7)  VALUE "YYYYYYY".
012800     05  PIC X(7)  VALUE "AAABAAA".
012900     05  PIC X(7)  VALUE "SSSSSSS".
013000     05  PIC X(7)  VALUE "TTTTTTT".
013100   03  GRP-B       REDEFINES GRP-A.
013200     05  DATA-FIELD  PIC X(7) OCCURS 5.
013300 01  LOCATE-CHARS.
013400   03  GRP-C.
013500     05  PIC X  VALUE "G".
013600     05  PIC X  VALUE "H".
013700     05  PIC X  VALUE "B".
013800     05  PIC X  VALUE "D".
013900     05  PIC X  VALUE "C".
014000   03  GRP-D       REDEFINES GRP-C.
014100     05  END-CHAR  PIC X OCCURS 5.
014200 01  SUB PIC 9 COMP.
014300 01  WS-BB         PIC XX VALUE "BB".
014400 01  WS-Y          PIC X  VALUE "Y".
014500 01  WS-3          PIC X  VALUE "3".
014600 01  WS-E          PIC X  VALUE "E".
014700 01  XN-DF         PIC XX VALUE "DF".
014800 01  XN-67         PIC XX VALUE "67".
014900 01  XN-B          PIC X  VALUE "B".
015000 01  TEST-31-DATA.
015100   03  FILLER PIC X(48)  VALUE
015200            "AABBCCDDEBBBBGHDDIJJXXAABBCCDDEEEFFGGHHIIJJKKLLM".
015300 01  TEST-32-DATA.
015400   03  FILLER PIC X(48)  VALUE
015500            "AABSSSSSEBBTTTT1URSTSTSTVVDYYDEEEFFGSSSSTZSTZSTM".
015600 01  TEST-34-DATA.
015700   03  FILLER PIC X(20)  VALUE
015800            "AAFSSA  ET U V W H S".
015900 01  TEST-34-ANSWER.
016000   03  FILLER PIC X(20)  VALUE
016100            "AAFXXA  ET Y Y Y H S".
016200 01  TEST-35-DATA.
016300   03  FILLER PIC X(20)  VALUE
016400            "AX SSA YEG U V W H S".
016500 01  TEST-35-ANSWER.
016600   03  FILLER PIC X(20)  VALUE
016700            "AX AAA YEG       H S".
016800 01  TEST-38-DATA.
016900   03  FILLER PIC X(20)  VALUE
017000            "AXESSA YEGTUASSW H S".
017100 01  TEST-39-DATA.
017200   03  FILLER PIC X(20)  VALUE
017300            "ABESSA YE TUTCGW H S".
017400 01  TEST-40-DATA.
017500   03  FILLER PIC X(13)  VALUE
017600            "GADQAUZTABAGA".
017700 01  TEST-RESULTS.
017800     02 FILLER                   PIC X      VALUE SPACE.
017900     02 FEATURE                  PIC X(20)  VALUE SPACE.
018000     02 FILLER                   PIC X      VALUE SPACE.
018100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
018200     02 FILLER                   PIC X      VALUE SPACE.
018300     02  PAR-NAME.
018400       03 FILLER                 PIC X(19)  VALUE SPACE.
018500       03  PARDOT-X              PIC X      VALUE SPACE.
018600       03 DOTVALUE               PIC 99     VALUE ZERO.
018700     02 FILLER                   PIC X(8)   VALUE SPACE.
018800     02 RE-MARK                  PIC X(61).
018900 01  TEST-COMPUTED.
019000     02 FILLER                   PIC X(30)  VALUE SPACE.
019100     02 FILLER                   PIC X(17)  VALUE
019200            "       COMPUTED=".
019300     02 COMPUTED-X.
019400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
019500     03 COMPUTED-N               REDEFINES COMPUTED-A
019600                                 PIC -9(9).9(9).
019700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
019800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
019900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
020000     03       CM-18V0 REDEFINES COMPUTED-A.
020100         04 COMPUTED-18V0                    PIC -9(18).
020200         04 FILLER                           PIC X.
020300     03 FILLER PIC X(50) VALUE SPACE.
020400 01  TEST-CORRECT.
020500     02 FILLER PIC X(30) VALUE SPACE.
020600     02 FILLER PIC X(17) VALUE "       CORRECT =".
020700     02 CORRECT-X.
020800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
021000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
021100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
021200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
021300     03      CR-18V0 REDEFINES CORRECT-A.
021400         04 CORRECT-18V0                     PIC -9(18).
021500         04 FILLER                           PIC X.
021600     03 FILLER PIC X(2) VALUE SPACE.
021700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021800 01  CCVS-C-1.
021900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
022000-    "SS  PARAGRAPH-NAME
022100-    "       REMARKS".
022200     02 FILLER                     PIC X(20)    VALUE SPACE.
022300 01  CCVS-C-2.
022400     02 FILLER                     PIC X        VALUE SPACE.
022500     02 FILLER                     PIC X(6)     VALUE "TESTED".
022600     02 FILLER                     PIC X(15)    VALUE SPACE.
022700     02 FILLER                     PIC X(4)     VALUE "FAIL".
022800     02 FILLER                     PIC X(94)    VALUE SPACE.
022900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
023000 01  REC-CT                        PIC 99       VALUE ZERO.
023100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
023200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
023300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
023400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
023500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
023600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
023700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
023800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
023900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
024000 01  CCVS-H-1.
024100     02  FILLER                    PIC X(39)    VALUE SPACES.
024200     02  FILLER                    PIC X(42)    VALUE
024300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024400     02  FILLER                    PIC X(39)    VALUE SPACES.
024500 01  CCVS-H-2A.
024600   02  FILLER                        PIC X(40)  VALUE SPACE.
024700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
024800   02  FILLER                        PIC XXXX   VALUE
024900     "4.2 ".
025000   02  FILLER                        PIC X(28)  VALUE
025100            " COPY - NOT FOR DISTRIBUTION".
025200   02  FILLER                        PIC X(41)  VALUE SPACE.
025300
025400 01  CCVS-H-2B.
025500   02  FILLER                        PIC X(15)  VALUE
025600            "TEST RESULT OF ".
025700   02  TEST-ID                       PIC X(9).
025800   02  FILLER                        PIC X(4)   VALUE
025900            " IN ".
026000   02  FILLER                        PIC X(12)  VALUE
026100     " HIGH       ".
026200   02  FILLER                        PIC X(22)  VALUE
026300            " LEVEL VALIDATION FOR ".
026400   02  FILLER                        PIC X(58)  VALUE
026500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026600 01  CCVS-H-3.
026700     02  FILLER                      PIC X(34)  VALUE
026800            " FOR OFFICIAL USE ONLY    ".
026900     02  FILLER                      PIC X(58)  VALUE
027000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
027100     02  FILLER                      PIC X(28)  VALUE
027200            "  COPYRIGHT   1985 ".
027300 01  CCVS-E-1.
027400     02 FILLER                       PIC X(52)  VALUE SPACE.
027500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027600     02 ID-AGAIN                     PIC X(9).
027700     02 FILLER                       PIC X(45)  VALUE SPACES.
027800 01  CCVS-E-2.
027900     02  FILLER                      PIC X(31)  VALUE SPACE.
028000     02  FILLER                      PIC X(21)  VALUE SPACE.
028100     02 CCVS-E-2-2.
028200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
028300         03 FILLER                   PIC X      VALUE SPACE.
028400         03 ENDER-DESC               PIC X(44)  VALUE
028500            "ERRORS ENCOUNTERED".
028600 01  CCVS-E-3.
028700     02  FILLER                      PIC X(22)  VALUE
028800            " FOR OFFICIAL USE ONLY".
028900     02  FILLER                      PIC X(12)  VALUE SPACE.
029000     02  FILLER                      PIC X(58)  VALUE
029100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029200     02  FILLER                      PIC X(13)  VALUE SPACE.
029300     02 FILLER                       PIC X(15)  VALUE
029400             " COPYRIGHT 1985".
029500 01  CCVS-E-4.
029600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
029700     02 FILLER                       PIC X(4)   VALUE " OF ".
029800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
029900     02 FILLER                       PIC X(40)  VALUE
030000      "  TESTS WERE EXECUTED SUCCESSFULLY".
030100 01  XXINFO.
030200     02 FILLER                       PIC X(19)  VALUE
030300            "*** INFORMATION ***".
030400     02 INFO-TEXT.
030500       04 FILLER                     PIC X(8)   VALUE SPACE.
030600       04 XXCOMPUTED                 PIC X(20).
030700       04 FILLER                     PIC X(5)   VALUE SPACE.
030800       04 XXCORRECT                  PIC X(20).
030900     02 INF-ANSI-REFERENCE           PIC X(48).
031000 01  HYPHEN-LINE.
031100     02 FILLER  PIC IS X VALUE IS SPACE.
031200     02 FILLER  PIC IS X(65)    VALUE IS "************************
031300-    "*****************************************".
031400     02 FILLER  PIC IS X(54)    VALUE IS "************************
031500-    "******************************".
031600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
031700     "NC216A".
031800 PROCEDURE DIVISION.
031900 CCVS1 SECTION.
032000 OPEN-FILES.
032100     OPEN     OUTPUT PRINT-FILE.
032200     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
032300     MOVE    SPACE TO TEST-RESULTS.
032400     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
032500     GO TO CCVS1-EXIT.
032600 CLOSE-FILES.
032700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
032800 TERMINATE-CCVS.
032900S    EXIT PROGRAM.
033000STERMINATE-CALL.
033100     STOP     RUN.
033200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
033300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
033400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
033500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
033600     MOVE "****TEST DELETED****" TO RE-MARK.
033700 PRINT-DETAIL.
033800     IF REC-CT NOT EQUAL TO ZERO
033900             MOVE "." TO PARDOT-X
034000             MOVE REC-CT TO DOTVALUE.
034100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
034200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
034300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
034400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
034500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
034600     MOVE SPACE TO CORRECT-X.
034700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
034800     MOVE     SPACE TO RE-MARK.
034900 HEAD-ROUTINE.
035000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035400 COLUMN-NAMES-ROUTINE.
035500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
035800 END-ROUTINE.
035900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
036000 END-RTN-EXIT.
036100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036200 END-ROUTINE-1.
036300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
036400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
036500      ADD PASS-COUNTER TO ERROR-HOLD.
036600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
036700      MOVE PASS-COUNTER TO CCVS-E-4-1.
036800      MOVE ERROR-HOLD TO CCVS-E-4-2.
036900      MOVE CCVS-E-4 TO CCVS-E-2-2.
037000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
037100  END-ROUTINE-12.
037200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
037300     IF       ERROR-COUNTER IS EQUAL TO ZERO
037400         MOVE "NO " TO ERROR-TOTAL
037500         ELSE
037600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
037700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
037800     PERFORM WRITE-LINE.
037900 END-ROUTINE-13.
038000     IF DELETE-COUNTER IS EQUAL TO ZERO
038100         MOVE "NO " TO ERROR-TOTAL  ELSE
038200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
038300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
038400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038500      IF   INSPECT-COUNTER EQUAL TO ZERO
038600          MOVE "NO " TO ERROR-TOTAL
038700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
038800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039100 WRITE-LINE.
039200     ADD 1 TO RECORD-COUNT.
039300Y    IF RECORD-COUNT GREATER 50
039400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
039500Y        MOVE SPACE TO DUMMY-RECORD
039600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039700Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
039800Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
039900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
040000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
040100Y        MOVE ZERO TO RECORD-COUNT.
040200     PERFORM WRT-LN.
040300 WRT-LN.
040400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
040500     MOVE SPACE TO DUMMY-RECORD.
040600 BLANK-LINE-PRINT.
040700     PERFORM WRT-LN.
040800 FAIL-ROUTINE.
040900     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
041000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
041100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041400     MOVE   SPACES TO INF-ANSI-REFERENCE.
041500     GO TO  FAIL-ROUTINE-EX.
041600 FAIL-ROUTINE-WRITE.
041700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
041800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
041900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
042000     MOVE   SPACES TO COR-ANSI-REFERENCE.
042100 FAIL-ROUTINE-EX. EXIT.
042200 BAIL-OUT.
042300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
042400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
042500 BAIL-OUT-WRITE.
042600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
042700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
042800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042900     MOVE   SPACES TO INF-ANSI-REFERENCE.
043000 BAIL-OUT-EX. EXIT.
043100 CCVS1-EXIT.
043200     EXIT.
043300 SECT-NC216A-001 SECTION.
043400*
043500 INS-INIT-F1-1.
043600     MOVE "INS-TEST-F1-1" TO PAR-NAME.
043700     MOVE   "VI-94" TO ANSI-REFERENCE.
043800     MOVE "TALLY FOR CHARACTERS" TO FEATURE.
043900     MOVE
044000     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
044100-    "IDS CAN NOT BE ALL BAD."
044200         TO WC-XN-83.
044300     MOVE    ZERO TO WRK-DU-999-1.
044400 INS-TEST-F1-1.
044500     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR CHARACTERS.
044600     IF      WRK-DU-999-1 EQUAL TO 83
044700             PERFORM PASS
044800             GO TO   INS-WRITE-F1-1.
044900     GO TO INS-FAIL-F1-1.
045000 INS-DELETE-F1-1.
045100     PERFORM DE-LETE.
045200     GO TO INS-WRITE-F1-1.
045300 INS-FAIL-F1-1.
045400     PERFORM FAIL.
045500     MOVE WRK-DU-999-1 TO COMPUTED-N.
045600     MOVE 83 TO CORRECT-N.
045700 INS-WRITE-F1-1.
045800     PERFORM PRINT-DETAIL.
045900*
046000 INS-INIT-F1-2.
046100     MOVE "INS-TEST-F1-2" TO PAR-NAME.
046200     MOVE   "VI-94" TO ANSI-REFERENCE.
046300     MOVE "TALLY ALL LITERAL" TO FEATURE.
046400     MOVE
046500     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
046600-    "IDS CAN NOT BE ALL BAD."
046700         TO WC-XN-83.
046800     MOVE ZERO TO WRK-DU-999-1.
046900 INS-TEST-F1-2.
047000     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR ALL "A".
047100     IF      WRK-DU-999-1 EQUAL TO 8
047200            PERFORM PASS
047300            GO      TO INS-WRITE-F1-2.
047400     GO TO INS-FAIL-F1-2.
047500 INS-DELETE-F1-2.
047600     PERFORM DE-LETE.
047700     GO TO INS-WRITE-F1-2.
047800 INS-FAIL-F1-2.
047900     PERFORM FAIL.
048000     MOVE WRK-DU-999-1 TO COMPUTED-N.
048100     MOVE 8 TO CORRECT-N.
048200 INS-WRITE-F1-2.
048300     PERFORM PRINT-DETAIL.
048400*
048500 INS-INIT-F1-3.
048600     MOVE "INS-TEST-F1-3" TO PAR-NAME.
048700     MOVE   "VI-94" TO ANSI-REFERENCE.
048800     MOVE "TALLY FOR ALL SPACES" TO FEATURE.
048900     MOVE
049000     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
049100-    "IDS CAN NOT BE ALL BAD."
049200         TO WC-XN-83.
049300     MOVE ZERO TO WRK-DU-999-1.
049400 INS-TEST-F1-3.
049500     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR ALL SPACES.
049600     IF      WRK-DU-999-1 EQUAL TO 17
049700     PERFORM PASS
049800     GO      TO INS-WRITE-F1-3.
049900     GO TO INS-FAIL-F1-3.
050000 INS-DELETE-F1-3.
050100     PERFORM DE-LETE.
050200     GO TO INS-WRITE-F1-3.
050300 INS-FAIL-F1-3.
050400     PERFORM FAIL.
050500     MOVE WRK-DU-999-1 TO COMPUTED-N.
050600     MOVE 17 TO CORRECT-N.
050700 INS-WRITE-F1-3.
050800     PERFORM PRINT-DETAIL.
050900*
051000 INS-INIT-F1-4.
051100     MOVE "INS-TEST-F1-4" TO PAR-NAME.
051200     MOVE   "VI-94" TO ANSI-REFERENCE.
051300     MOVE "TALLY LEADING LIT" TO FEATURE.
051400     MOVE
051500     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
051600-    "IDS CAN NOT BE ALL BAD."
051700         TO WC-XN-83.
051800     MOVE ZERO TO WRK-DU-999-1.
051900 INS-TEST-F1-4.
052000     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR LEADING "AH".
052100     IF      WRK-DU-999-1 EQUAL TO 1
052200     PERFORM PASS
052300     GO      TO INS-WRITE-F1-4.
052400     GO TO INS-FAIL-F1-4.
052500 INS-DELETE-F1-4.
052600     PERFORM DE-LETE.
052700     GO TO INS-WRITE-F1-4.
052800 INS-FAIL-F1-4.
052900     PERFORM FAIL.
053000     MOVE WRK-DU-999-1 TO COMPUTED-N.
053100     MOVE 1 TO CORRECT-N.
053200 INS-WRITE-F1-4.
053300     PERFORM PRINT-DETAIL.
053400*
053500 INS-INIT-F1-5.
053600     MOVE "INS-TEST-F1-5" TO PAR-NAME.
053700     MOVE   "VI-94" TO ANSI-REFERENCE.
053800     MOVE "FOR CHARS AFTER LIT" TO FEATURE.
053900     MOVE
054000     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
054100-    "IDS CAN NOT BE ALL BAD."
054200         TO WC-XN-83.
054300     MOVE ZERO TO WRK-DU-999-1.
054400 INS-TEST-F1-5.
054500     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR CHARACTERS
054600         AFTER " W".
054700     IF      WRK-DU-999-1 EQUAL TO 68
054800     PERFORM PASS
054900     GO      TO INS-WRITE-F1-5.
055000     GO TO INS-FAIL-F1-5.
055100 INS-DELETE-F1-5.
055200     PERFORM DE-LETE.
055300     GO TO INS-WRITE-F1-5.
055400 INS-FAIL-F1-5.
055500     PERFORM FAIL.
055600     MOVE WRK-DU-999-1 TO COMPUTED-N.
055700     MOVE 68 TO CORRECT-N.
055800 INS-WRITE-F1-5.
055900     PERFORM PRINT-DETAIL.
056000*
056100 INS-INIT-F1-6.
056200     MOVE "INS-TEST-F1-6" TO PAR-NAME.
056300     MOVE   "VI-94" TO ANSI-REFERENCE.
056400     MOVE "ALL BEFORE INITIAL" TO FEATURE.
056500     MOVE
056600     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
056700-    "IDS CAN NOT BE ALL BAD."
056800         TO WC-XN-83.
056900     MOVE ZERO TO WRK-DU-999-1.
057000 INS-TEST-F1-6.
057100     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR ALL " "
057200         BEFORE INITIAL "W.C.".
057300     IF      WRK-DU-999-1 EQUAL TO 4
057400     PERFORM PASS
057500     GO      TO INS-WRITE-F1-6.
057600     GO TO INS-FAIL-F1-6.
057700 INS-DELETE-F1-6.
057800     PERFORM DE-LETE.
057900     GO TO INS-WRITE-F1-6.
058000 INS-FAIL-F1-6.
058100     PERFORM FAIL.
058200     MOVE WRK-DU-999-1 TO COMPUTED-N.
058300     MOVE 4 TO CORRECT-N.
058400 INS-WRITE-F1-6.
058500     PERFORM PRINT-DETAIL.
058600*
058700 INS-INIT-F1-7.
058800     MOVE "INS-TEST-F1-7" TO PAR-NAME.
058900     MOVE   "VI-94" TO ANSI-REFERENCE.
059000     MOVE "LEAD LIT INITIAL FIG" TO FEATURE.
059100     MOVE
059200     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
059300-    "IDS CAN NOT BE ALL BAD."
059400         TO WC-XN-83.
059500     MOVE ZERO TO WRK-DU-999-1.
059600 INS-TEST-F1-7.
059700     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR LEADING "Y"
059800         AFTER INITIAL SPACES.
059900     IF      WRK-DU-999-1 EQUAL TO 1
060000     PERFORM PASS
060100     GO      TO INS-WRITE-F1-7.
060200     GO TO INS-FAIL-F1-7.
060300 INS-DELETE-F1-7.
060400     PERFORM DE-LETE.
060500     GO TO INS-WRITE-F1-7.
060600 INS-FAIL-F1-7.
060700     PERFORM FAIL.
060800     MOVE WRK-DU-999-1 TO COMPUTED-N.
060900     MOVE 1 TO CORRECT-N.
061000 INS-WRITE-F1-7.
061100     PERFORM PRINT-DETAIL.
061200*
061300 INS-INIT-F2-8.
061400     MOVE "INS-TEST-F2-8" TO PAR-NAME.
061500     MOVE   "VI-94 6.17.3" TO ANSI-REFERENCE.
061600     MOVE "REP CHARS BY SPACES" TO FEATURE.
061700     MOVE
061800     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
061900-    "IDS CAN NOT BE ALL BAD."
062000         TO WC-XN-83.
062100     MOVE    WC-XN-83 TO WRK-XN-83-1.
062200     MOVE
062300     "AH YES OH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
062400-    "IDS CAN NOT BE ALL BAD."
062500         TO ANS-XN-83-5.
062600 INS-TEST-F2-8.
062700     INSPECT WRK-XN-83-1 REPLACING CHARACTERS BY SPACES.
062800     IF      WRK-XN-83-1 EQUAL TO SPACES
062900             PERFORM PASS
063000             GO      TO INS-WRITE-F2-8.
063100     GO TO INS-FAIL-F2-8.
063200 INS-DELETE-F2-8.
063300     PERFORM DE-LETE.
063400     GO TO INS-WRITE-F2-8.
063500 INS-FAIL-F2-8.
063600     PERFORM FAIL.
063700     MOVE    "83 SPACES" TO RE-MARK.
063800     MOVE    WRK-XN-83-1 TO WS-WRONG-1-83.
063900     MOVE    SPACES      TO WS-RIGHT-1-83.
064000     PERFORM FAIL.
064100     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83.
064200     MOVE    ANS-XN-83-5     TO WS-RIGHT-1-83.
064300     MOVE    WS-RIGHT-1-20   TO CORRECT-A.
064400     MOVE    WS-WRONG-1-20   TO COMPUTED-A.
064500     PERFORM PRINT-DETAIL.
064600     MOVE    WS-RIGHT-21-40  TO CORRECT-A.
064700     MOVE    WS-WRONG-21-40  TO COMPUTED-A.
064800     PERFORM PRINT-DETAIL.
064900     MOVE    WS-RIGHT-41-60  TO CORRECT-A.
065000     MOVE    WS-WRONG-41-60  TO COMPUTED-A.
065100     PERFORM PRINT-DETAIL.
065200     MOVE    WS-RIGHT-61-80  TO CORRECT-A
065300     MOVE    WS-WRONG-61-80  TO COMPUTED-A
065400     PERFORM PRINT-DETAIL.
065500     MOVE    WS-RIGHT-81-83  TO CORRECT-A
065600     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
065700 INS-WRITE-F2-8.
065800     PERFORM PRINT-DETAIL.
065900*
066000 INS-INIT-F2-9.
066100     MOVE "INS-TEST-F2-9" TO PAR-NAME.
066200     MOVE   "VI-94 6.17.3" TO ANSI-REFERENCE.
066300     MOVE "CHARS BEFORE INITIAL" TO FEATURE.
066400     MOVE
066500     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
066600-    "IDS CAN NOT BE ALL BAD."
066700         TO WC-XN-83.
066800     MOVE
066900     "OH YES AH YES W.C. FROTOES HERE, ANYONE WHO HATES DOGS AND K
067000-    "IDS CAN NOT BE ALL BAD."
067100         TO ANS-XN-83-9.
067200     MOVE WC-XN-83 TO WRK-XN-83-1.
067300     MOVE    1 TO REC-CT.
067400 INS-TEST-F2-9.
067500     INSPECT WRK-XN-83-1
067600         REPLACING LEADING "AH" BY "OH" BEFORE INITIAL " AH YES"
067700                   FIRST "I" BY "O" AFTER INITIAL "."
067800                   ALL ". " BY ", " AFTER INITIAL "HE".
067900     MOVE    WRK-XN-83-1 TO WRK-XN-83-2.
068000     INSPECT WRK-XN-83-1
068100         REPLACING ALL "OT" BY "IT" BEFORE "HE"
068200                   LEADING ", " BY ". " AFTER "RE"
068300                   FIRST "KIDS CAN NOT BE" BY  KIDS-CAN-NOT-BE
068400                   ALL BLANK-PERIOD BY " ." AFTER "BAD".
068500     GO      TO INS-TEST-F2-9-1.
068600 INS-DELETE-F2-9.
068700     PERFORM DE-LETE.
068800     PERFORM PRINT-DETAIL.
068900     GO      TO INS-TEST-F2-10.
069000*
069100 INS-TEST-F2-9-1.
069200     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-1
069300             PERFORM PASS
069400             GO TO INS-WRITE-F2-9-1
069500     ELSE
069600             GO TO INS-FAIL-F2-9-1.
069700 INS-DELETE-F2-9-1.
069800     PERFORM DE-LETE.
069900     GO TO INS-WRITE-F2-9-1.
070000 INS-FAIL-F2-9-1.
070100     PERFORM FAIL
070200     MOVE    WRK-XN-83-1 TO COMPUTED-A
070300     MOVE    ANS-XN-83-1 TO CORRECT-A.
070400 INS-WRITE-F2-9-1.
070500     PERFORM PRINT-DETAIL.
070600*
070700 INS-TEST-F2-9-2.
070800     ADD     1 TO REC-CT.
070900     IF      WRK-XN-83-2 EQUAL TO ANS-XN-83-9
071000             PERFORM PASS
071100             GO TO INS-WRITE-F2-9-2
071200     ELSE
071300             GO TO INS-FAIL-F2-9-2.
071400 INS-FAIL-F2-9-2.
071500     PERFORM FAIL
071600     MOVE    WRK-XN-83-2     TO WS-WRONG-1-83
071700     MOVE    ANS-XN-83-9     TO WS-RIGHT-1-83
071800     MOVE    WS-RIGHT-1-20   TO CORRECT-A
071900     MOVE    WS-WRONG-1-20   TO COMPUTED-A
072000     PERFORM PRINT-DETAIL
072100     MOVE    WS-RIGHT-21-40  TO CORRECT-A
072200     MOVE    WS-WRONG-21-40  TO COMPUTED-A
072300     PERFORM PRINT-DETAIL
072400     MOVE    WS-RIGHT-41-60  TO CORRECT-A
072500     MOVE    WS-WRONG-41-60  TO COMPUTED-A
072600     PERFORM PRINT-DETAIL
072700     MOVE    WS-RIGHT-61-80  TO CORRECT-A
072800     MOVE    WS-WRONG-61-80  TO COMPUTED-A
072900     PERFORM PRINT-DETAIL
073000     MOVE    WS-RIGHT-81-83  TO CORRECT-A
073100     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
073200 INS-WRITE-F2-9-2.
073300     PERFORM PRINT-DETAIL.
073400*
073500 INS-INIT-F2-10.
073600     MOVE "INS-TEST-F2-10" TO PAR-NAME.
073700     MOVE   "VI-94 6.17.3" TO ANSI-REFERENCE.
073800     MOVE "LEAD AFTER INIT ID" TO FEATURE.
073900     MOVE    ZERO TO REC-CT.
074000     MOVE
074100     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
074200-    "IDS CAN NOT BE ALL BAD."
074300         TO WC-XN-83.
074400     MOVE WC-XN-83 TO WRK-XN-83-1.
074500 INS-TEST-F2-10.
074600     INSPECT WRK-XN-83-1 REPLACING LEADING SPACE-XN-1-1
074700         BY COMMA-XN-1-1 AFTER INITIAL YES-XN-3.
074800     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-2
074900     PERFORM PASS
075000     GO      TO INS-WRITE-F2-10.
075100     GO TO INS-FAIL-F2-10.
075200 INS-DELETE-F2-10.
075300     PERFORM DE-LETE.
075400     GO TO INS-WRITE-F2-10.
075500 INS-FAIL-F2-10.
075600     PERFORM FAIL.
075700     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
075800     MOVE    ANS-XN-83-2     TO WS-RIGHT-1-83
075900     MOVE    WS-RIGHT-1-20   TO CORRECT-A
076000     MOVE    WS-WRONG-1-20   TO COMPUTED-A
076100     PERFORM PRINT-DETAIL
076200     MOVE    WS-RIGHT-21-40  TO CORRECT-A
076300     MOVE    WS-WRONG-21-40  TO COMPUTED-A
076400     PERFORM PRINT-DETAIL
076500     MOVE    WS-RIGHT-41-60  TO CORRECT-A
076600     MOVE    WS-WRONG-41-60  TO COMPUTED-A
076700     PERFORM PRINT-DETAIL
076800     MOVE    WS-RIGHT-61-80  TO CORRECT-A
076900     MOVE    WS-WRONG-61-80  TO COMPUTED-A
077000     PERFORM PRINT-DETAIL
077100     MOVE    WS-RIGHT-81-83  TO CORRECT-A
077200     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
077300 INS-WRITE-F2-10.
077400     PERFORM PRINT-DETAIL.
077500*
077600 INS-INIT-F2-11.
077700     MOVE "INS-TEST-F2-11" TO PAR-NAME.
077800     MOVE   "VI-94 6.17.3" TO ANSI-REFERENCE.
077900     MOVE "FIRST BY ID BEFORE" TO FEATURE.
078000     MOVE
078100     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
078200-    "IDS CAN NOT BE ALL BAD."
078300         TO WC-XN-83.
078400     MOVE WC-XN-83 TO WRK-XN-83-1.
078500     MOVE "O" TO O-XN-1-1.
078600 INS-TEST-F2-11.
078700     INSPECT WRK-XN-83-1 REPLACING FIRST "A" BY O-XN-1-1
078800         BEFORE INITIAL "H YES".
078900     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-1
079000     PERFORM PASS
079100     GO      TO INS-WRITE-F2-11.
079200     GO TO INS-FAIL-F2-11.
079300 INS-DELETE-F2-11.
079400     PERFORM DE-LETE.
079500     GO TO INS-WRITE-F2-11.
079600 INS-FAIL-F2-11.
079700     PERFORM FAIL.
079800     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
079900     MOVE    ANS-XN-83-1     TO WS-RIGHT-1-83
080000     MOVE    WS-RIGHT-1-20   TO CORRECT-A
080100     MOVE    WS-WRONG-1-20   TO COMPUTED-A
080200     PERFORM PRINT-DETAIL
080300     MOVE    WS-RIGHT-21-40  TO CORRECT-A
080400     MOVE    WS-WRONG-21-40  TO COMPUTED-A
080500     PERFORM PRINT-DETAIL
080600     MOVE    WS-RIGHT-41-60  TO CORRECT-A
080700     MOVE    WS-WRONG-41-60  TO COMPUTED-A
080800     PERFORM PRINT-DETAIL
080900     MOVE    WS-RIGHT-61-80  TO CORRECT-A
081000     MOVE    WS-WRONG-61-80  TO COMPUTED-A
081100     PERFORM PRINT-DETAIL
081200     MOVE    WS-RIGHT-81-83  TO CORRECT-A
081300     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
081400 INS-WRITE-F2-11.
081500     PERFORM PRINT-DETAIL.
081600*
081700 INS-INIT-F2-12.
081800     MOVE "INS-TEST-F2-12" TO PAR-NAME.
081900     MOVE   "VI-94 6.17.3" TO ANSI-REFERENCE.
082000     MOVE "ALL ID BY LIT AFTER" TO FEATURE.
082100     MOVE
082200     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
082300-    "IDS CAN NOT BE ALL BAD."
082400         TO WC-XN-83.
082500     MOVE WC-XN-83 TO WRK-XN-83-1.
082600 INS-TEST-F2-12.
082700     INSPECT WRK-XN-83-1 REPLACING ALL SPACE-XN-1-1 BY "-"
082800         AFTER ALL-XN-3.
082900     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-3
083000     PERFORM PASS
083100     GO      TO INS-WRITE-F2-12.
083200     GO TO INS-FAIL-F2-12.
083300 INS-DELETE-F2-12.
083400     PERFORM DE-LETE.
083500     GO TO INS-WRITE-F2-12.
083600 INS-FAIL-F2-12.
083700     PERFORM FAIL.
083800     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
083900     MOVE    ANS-XN-83-3     TO WS-RIGHT-1-83
084000     MOVE    WS-RIGHT-1-20   TO CORRECT-A
084100     MOVE    WS-WRONG-1-20   TO COMPUTED-A
084200     PERFORM PRINT-DETAIL
084300     MOVE    WS-RIGHT-21-40  TO CORRECT-A
084400     MOVE    WS-WRONG-21-40  TO COMPUTED-A
084500     PERFORM PRINT-DETAIL
084600     MOVE    WS-RIGHT-41-60  TO CORRECT-A
084700     MOVE    WS-WRONG-41-60  TO COMPUTED-A
084800     PERFORM PRINT-DETAIL
084900     MOVE    WS-RIGHT-61-80  TO CORRECT-A
085000     MOVE    WS-WRONG-61-80  TO COMPUTED-A
085100     PERFORM PRINT-DETAIL
085200     MOVE    WS-RIGHT-81-83  TO CORRECT-A
085300     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
085400 INS-WRITE-F2-12.
085500     PERFORM PRINT-DETAIL.
085600*
085700 INS-INIT-F3-13.
085800     MOVE "INS-TEST-F3-13" TO PAR-NAME.
085900     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
086000     MOVE "TALLY-REPLACE CHARS" TO FEATURE.
086100     MOVE ZERO TO WRK-DU-999-1.
086200     MOVE
086300     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
086400-    "IDS CAN NOT BE ALL BAD."
086500         TO WC-XN-83.
086600     MOVE WC-XN-83 TO WRK-XN-83-1.
086700     MOVE    1 TO REC-CT.
086800 INS-TEST-F3-13-0.
086900     INSPECT WRK-XN-83-1 TALLYING WRK-DU-999-1 FOR CHARACTERS
087000         REPLACING CHARACTERS BY SPACES.
087100     GO      TO INS-TEST-F3-13-1.
087200 INS-DELETE-F3-13.
087300     PERFORM DE-LETE.
087400     PERFORM PRINT-DETAIL.
087500     GO TO INS-INIT-F3-14.
087600*
087700 INS-TEST-F3-13-1.
087800     IF      WRK-DU-999-1 EQUAL TO 83
087900             PERFORM PASS
088000             GO TO INS-WRITE-F3-13-1
088100     ELSE
088200             GO TO INS-FAIL-F3-13-1.
088300 INS-DELETE-F3-13-1.
088400     PERFORM DE-LETE.
088500     GO TO INS-WRITE-F3-13-1.
088600 INS-FAIL-F3-13-1.
088700     PERFORM FAIL
088800     MOVE    WRK-DU-999-1 TO COMPUTED-N
088900     MOVE    83 TO CORRECT-N.
089000 INS-WRITE-F3-13-1.
089100     PERFORM PRINT-DETAIL.
089200*
089300 TEST-13-2.
089400     ADD     1 TO REC-CT.
089500     IF      WRK-XN-83-1 EQUAL TO SPACES
089600             PERFORM PASS
089700             GO TO INS-WRITE-F3-13-2
089800     ELSE
089900             GO TO INS-FAIL-F3-13-2.
090000 INS-DELETE-F3-13-2.
090100     PERFORM DE-LETE.
090200     GO TO INS-WRITE-F3-13-2.
090300 INS-FAIL-F3-13-2.
090400     PERFORM FAIL
090500     MOVE    WRK-XN-83-1 TO COMPUTED-A
090600     MOVE    "83 SPACES" TO CORRECT-A.
090700 INS-WRITE-F3-13-2.
090800     PERFORM PRINT-DETAIL.
090900*
091000 INS-INIT-F3-14.
091100     MOVE "INS-TEST-F3-14" TO PAR-NAME.
091200     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
091300     MOVE "LIT BY BEFORE INIT" TO FEATURE.
091400     MOVE ZERO TO WRK-DU-999-1.
091500     MOVE
091600     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
091700-    "IDS CAN NOT BE ALL BAD."
091800         TO WC-XN-83.
091900     MOVE WC-XN-83 TO WRK-XN-83-1.
092000     MOVE    1 TO REC-CT.
092100 INS-TEST-F3-14-0.
092200     INSPECT WRK-XN-83-1 TALLYING WRK-DU-999-1 FOR CHARACTERS
092300         AFTER L-XN-1-1 REPLACING ALL "A" BY "E" BEFORE INITIAL
092400     HSPACE-XN-2.
092500     GO TO INS-TEST-F3-14-1.
092600 INS-DELETE-F3-14.
092700     PERFORM DE-LETE.
092800     PERFORM PRINT-DETAIL.
092900     GO TO INS-INIT-F3-15.
093000*
093100 INS-TEST-F3-14-1.
093200     IF      WRK-DU-999-1 EQUAL TO 6
093300     PERFORM PASS
093400             GO TO INS-WRITE-F3-14-1
093500     ELSE
093600             PERFORM FAIL
093700             GO TO INS-FAIL-F3-14-1.
093800 INS-DELETE-F3-14-1.
093900     PERFORM DE-LETE.
094000     GO TO INS-WRITE-F3-14-1.
094100 INS-FAIL-F3-14-1.
094200     MOVE    WRK-DU-999-1 TO COMPUTED-N
094300     MOVE    6 TO CORRECT-N.
094400 INS-WRITE-F3-14-1.
094500     PERFORM PRINT-DETAIL.
094600*
094700 INS-TEST-F3-14-2.
094800     ADD     1 TO REC-CT.
094900     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-4
095000             PERFORM PASS
095100             GO TO INS-WRITE-F3-14-2
095200     ELSE
095300             PERFORM FAIL
095400             GO TO INS-FAIL-F3-14-2.
095500 INS-DELETE-F3-14-2.
095600     PERFORM DE-LETE.
095700     GO TO INS-WRITE-F3-14-2.
095800 INS-FAIL-F3-14-2.
095900     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
096000     MOVE    ANS-XN-83-4     TO WS-RIGHT-1-83
096100     MOVE    WS-RIGHT-1-20   TO CORRECT-A
096200     MOVE    WS-WRONG-1-20   TO COMPUTED-A
096300     PERFORM PRINT-DETAIL
096400     MOVE    WS-RIGHT-21-40  TO CORRECT-A
096500     MOVE    WS-WRONG-21-40  TO COMPUTED-A
096600     PERFORM PRINT-DETAIL
096700     MOVE    WS-RIGHT-41-60  TO CORRECT-A
096800     MOVE    WS-WRONG-41-60  TO COMPUTED-A
096900     PERFORM PRINT-DETAIL
097000     MOVE    WS-RIGHT-61-80  TO CORRECT-A
097100     MOVE    WS-WRONG-61-80  TO COMPUTED-A
097200     PERFORM PRINT-DETAIL
097300     MOVE    WS-RIGHT-81-83  TO CORRECT-A
097400     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
097500 INS-WRITE-F3-14-2.
097600     PERFORM PRINT-DETAIL.
097700*
097800 INS-INIT-F3-15.
097900     MOVE "INS-TEST-F3-15" TO PAR-NAME.
098000     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
098100     MOVE "REPL FIRST AFTER" TO FEATURE.
098200     MOVE ZERO TO WRK-DU-999-1.
098300     MOVE
098400     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
098500-    "IDS CAN NOT BE ALL BAD."
098600         TO WC-XN-83.
098700     MOVE WC-XN-83 TO WRK-XN-83-1.
098800     MOVE
098900     "AH YES OH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
099000-    "IDS CAN NOT BE ALL BAD."
099100         TO ANS-XN-83-5.
099200     MOVE    1 TO REC-CT.
099300 INS-TEST-F3-15-0.
099400     INSPECT WRK-XN-83-1 TALLYING WRK-DU-999-1 FOR ALL "A" BEFORE
099500         L-XN-1-1 REPLACING FIRST  AH-XN-2 BY "OH" AFTER
099600         INITIAL HSPACE-XN-2.
099700     GO      TO INS-TEST-F3-15-1.
099800 INS-DELETE-F3-15.
099900     PERFORM DE-LETE.
100000     PERFORM PRINT-DETAIL.
100100     GO TO INS-INIT-F3-16.
100200*
100300 INS-TEST-F3-15-1.
100400     IF      WRK-DU-999-1 EQUAL TO 7
100500             PERFORM PASS
100600             GO TO INS-WRITE-F3-15-1
100700     ELSE
100800             PERFORM FAIL
100900             GO TO INS-FAIL-F3-15-1.
101000 INS-DELETE-F3-15-1.
101100     PERFORM DE-LETE.
101200     GO TO INS-WRITE-F3-15-1.
101300 INS-FAIL-F3-15-1.
101400     MOVE    WRK-DU-999-1 TO COMPUTED-N
101500     MOVE    7 TO CORRECT-N.
101600 INS-WRITE-F3-15-1.
101700     PERFORM PRINT-DETAIL.
101800*
101900 INS-TEST-F3-15-2.
102000     ADD     1 TO REC-CT.
102100     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-5
102200             PERFORM PASS
102300             GO TO INS-WRITE-F3-15-2
102400     ELSE
102500             PERFORM FAIL
102600             GO TO INS-FAIL-F3-15-2.
102700 INS-DELETE-F3-15-2.
102800     PERFORM DE-LETE.
102900     GO TO INS-WRITE-F3-15-2.
103000 INS-FAIL-F3-15-2.
103100     MOVE    WRK-XN-83-1 TO COMPUTED-A
103200     MOVE    ANS-XN-83-5 TO CORRECT-A.
103300 INS-WRITE-F3-15-2.
103400     PERFORM PRINT-DETAIL.
103500*
103600 INS-INIT-F3-16.
103700     MOVE "INS-TEST-F3-16" TO PAR-NAME.
103800     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
103900     MOVE "FOR LEADING" TO FEATURE.
104000     MOVE ZERO TO WRK-DU-999-1.
104100     MOVE
104200     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
104300-    "IDS CAN NOT BE ALL BAD."
104400         TO WC-XN-83.
104500     MOVE
104600     "AH YES OH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
104700-    "IDS CAN NOT BE ALL BAD."
104800         TO ANS-XN-83-5.
104900     MOVE WC-XN-83 TO WRK-XN-83-1.
105000     MOVE    1 TO REC-CT.
105100 INS-TEST-F3-16-0.
105200     INSPECT WRK-XN-83-1 TALLYING WRK-DU-999-1 FOR LEADING
105300         AH-XN-2 REPLACING LEADING AH-XN-2 BY "OH".
105400     GO      TO INS-TEST-F3-16-1.
105500 INS-DELETE-F3-16.
105600     PERFORM DE-LETE.
105700     PERFORM PRINT-DETAIL.
105800     GO TO INS-INIT-F3-17.
105900*
106000 INS-TEST-F3-16-1.
106100     IF      WRK-DU-999-1 EQUAL TO 1
106200             PERFORM PASS
106300             GO TO INS-WRITE-F3-16-1
106400     ELSE
106500             PERFORM FAIL
106600             GO TO INS-FAIL-F3-16-1.
106700 INS-DELETE-F3-16-1.
106800     PERFORM DE-LETE.
106900     GO TO INS-WRITE-F3-16-1.
107000 INS-FAIL-F3-16-1.
107100     MOVE    WRK-DU-999-1 TO COMPUTED-N
107200     MOVE    1 TO CORRECT-N.
107300 INS-WRITE-F3-16-1.
107400     PERFORM PRINT-DETAIL.
107500*
107600 INS-TEST-F3-16-2.
107700     ADD     1 TO REC-CT.
107800     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-1
107900             PERFORM PASS
108000             GO TO INS-WRITE-F3-16-2
108100     ELSE
108200             PERFORM FAIL
108300             GO TO INS-FAIL-F3-16-2.
108400 INS-DELETE-F3-16-2.
108500     PERFORM DE-LETE.
108600     GO TO   INS-WRITE-F3-16-2.
108700 INS-FAIL-F3-16-2.
108800     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
108900     MOVE    ANS-XN-83-1     TO WS-RIGHT-1-83
109000     MOVE    WS-RIGHT-1-20   TO CORRECT-A
109100     MOVE    WS-WRONG-1-20   TO COMPUTED-A
109200     PERFORM PRINT-DETAIL
109300     MOVE    WS-RIGHT-21-40  TO CORRECT-A
109400     MOVE    WS-WRONG-21-40  TO COMPUTED-A
109500     PERFORM PRINT-DETAIL
109600     MOVE    WS-RIGHT-41-60  TO CORRECT-A
109700     MOVE    WS-WRONG-41-60  TO COMPUTED-A
109800     PERFORM PRINT-DETAIL
109900     MOVE    WS-RIGHT-61-80  TO CORRECT-A
110000     MOVE    WS-WRONG-61-80  TO COMPUTED-A
110100     PERFORM PRINT-DETAIL
110200     MOVE    WS-RIGHT-81-83  TO CORRECT-A
110300     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
110400 INS-WRITE-F3-16-2.
110500     PERFORM PRINT-DETAIL.
110600*
110700 INS-INIT-F3-17.
110800     MOVE "INS-TEST-F3-17" TO PAR-NAME.
110900     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
111000     MOVE "LIT BY AFTER INIT" TO FEATURE.
111100     MOVE ZERO TO WRK-DU-999-1.
111200     MOVE
111300     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
111400-    "IDS CAN NOT BE ALL BAD."
111500         TO WC-XN-83.
111600     MOVE WC-XN-83 TO WRK-XN-83-1.
111700     MOVE
111800     "AH YES OH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
111900-    "IDS CAN NOT BE ALL BAD."
112000         TO ANS-XN-83-5.
112100     MOVE    1 TO REC-CT.
112200 INS-TEST-F3-17-0.
112300     INSPECT WRK-XN-83-1 TALLYING WRK-DU-999-1 FOR ALL "A"
112400         REPLACING FIRST "AH" BY "OH" AFTER INITIAL "YES".
112500     GO      TO INS-TEST-F3-17-1.
112600 INS-DELETE-F3-17.
112700     PERFORM DE-LETE.
112800     PERFORM PRINT-DETAIL.
112900     GO TO INS-INIT-F3-18.
113000*
113100 INS-TEST-F3-17-1.
113200     IF      WRK-DU-999-1 EQUAL TO 8
113300             PERFORM PASS
113400             GO TO INS-WRITE-F3-17-1
113500     ELSE
113600             PERFORM FAIL
113700             GO TO INS-FAIL-F3-17-1.
113800 INS-DELETE-F3-17-1.
113900     PERFORM DE-LETE.
114000     GO TO INS-WRITE-F3-17-1.
114100 INS-FAIL-F3-17-1.
114200     MOVE    WRK-DU-999-1 TO COMPUTED-N
114300     MOVE    8 TO CORRECT-N.
114400 INS-WRITE-F3-17-1.
114500     PERFORM PRINT-DETAIL.
114600*
114700 INS-TEST-F3-17-2.
114800     ADD     1 TO REC-CT.
114900     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-5
115000             PERFORM PASS
115100             GO TO INS-WRITE-F3-17-2
115200     ELSE
115300             PERFORM FAIL
115400             GO TO INS-FAIL-F3-17-2.
115500 INS-DELETE-F3-17-2.
115600     PERFORM DE-LETE.
115700     GO TO INS-WRITE-F3-17-2.
115800 INS-FAIL-F3-17-2.
115900     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
116000     MOVE    ANS-XN-83-5     TO WS-RIGHT-1-83
116100     MOVE    WS-RIGHT-1-20   TO CORRECT-A
116200     MOVE    WS-WRONG-1-20   TO COMPUTED-A
116300     PERFORM PRINT-DETAIL
116400     MOVE    WS-RIGHT-21-40  TO CORRECT-A
116500     MOVE    WS-WRONG-21-40  TO COMPUTED-A
116600     PERFORM PRINT-DETAIL
116700     MOVE    WS-RIGHT-41-60  TO CORRECT-A
116800     MOVE    WS-WRONG-41-60  TO COMPUTED-A
116900     PERFORM PRINT-DETAIL
117000     MOVE    WS-RIGHT-61-80  TO CORRECT-A
117100     MOVE    WS-WRONG-61-80  TO COMPUTED-A
117200     PERFORM PRINT-DETAIL
117300     MOVE    WS-RIGHT-81-83  TO CORRECT-A
117400     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
117500 INS-WRITE-F3-17-2.
117600     PERFORM PRINT-DETAIL.
117700*
117800 INS-INIT-F3-18.
117900     MOVE "INS-TEST-F3-18" TO PAR-NAME.
118000     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
118100     MOVE "CHAR AFTER ALL BEF" TO FEATURE.
118200     MOVE ZERO TO WRK-DU-999-1.
118300     MOVE
118400     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
118500-    "IDS CAN NOT BE ALL BAD."
118600         TO WC-XN-83.
118700     MOVE WC-XN-83 TO WRK-XN-83-1.
118800     MOVE 1 TO REC-CT.
118900 INS-TEST-F3-18-0.
119000     INSPECT WRK-XN-83-1 TALLYING WRK-DU-999-1 FOR CHARACTERS
119100         AFTER AH-XN-2 REPLACING ALL "AH" BY "OH" BEFORE YES-XN-3.
119200     GO      TO INS-TEST-F3-18-1.
119300 INS-DELETE-F3-18.
119400     PERFORM DE-LETE.
119500     PERFORM PRINT-DETAIL.
119600     GO      TO INS-INIT-F3-19.
119700*
119800 INS-TEST-F3-18-1.
119900     IF      WRK-DU-999-1 EQUAL TO 81
120000             PERFORM PASS
120100             GO TO INS-WRITE-F3-18-1
120200     ELSE
120300             PERFORM FAIL
120400             GO TO INS-FAIL-F3-18-1.
120500 INS-DELETE-F3-18-1.
120600     PERFORM DE-LETE.
120700     GO TO INS-WRITE-F3-18-1.
120800 INS-FAIL-F3-18-1.
120900     MOVE    WRK-DU-999-1 TO COMPUTED-N
121000     MOVE    81 TO CORRECT-N.
121100 INS-WRITE-F3-18-1.
121200     PERFORM PRINT-DETAIL.
121300*
121400 INS-TEST-F3-18-2.
121500     ADD     1 TO REC-CT.
121600     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-1
121700             PERFORM PASS
121800             GO TO INS-WRITE-F3-18-2
121900     ELSE
122000             PERFORM FAIL
122100             GO TO INS-FAIL-F3-18-2.
122200 INS-DELETE-F3-18-2.
122300     PERFORM DE-LETE.
122400     GO TO INS-WRITE-F3-18-2.
122500 INS-FAIL-F3-18-2.
122600     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
122700     MOVE    ANS-XN-83-1     TO WS-RIGHT-1-83
122800     MOVE    WS-RIGHT-1-20   TO CORRECT-A
122900     MOVE    WS-WRONG-1-20   TO COMPUTED-A
123000     PERFORM PRINT-DETAIL
123100     MOVE    WS-RIGHT-21-40  TO CORRECT-A
123200     MOVE    WS-WRONG-21-40  TO COMPUTED-A
123300     PERFORM PRINT-DETAIL
123400     MOVE    WS-RIGHT-41-60  TO CORRECT-A
123500     MOVE    WS-WRONG-41-60  TO COMPUTED-A
123600     PERFORM PRINT-DETAIL
123700     MOVE    WS-RIGHT-61-80  TO CORRECT-A
123800     MOVE    WS-WRONG-61-80  TO COMPUTED-A
123900     PERFORM PRINT-DETAIL
124000     MOVE    WS-RIGHT-81-83  TO CORRECT-A
124100     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
124200 INS-WRITE-F3-18-2.
124300     PERFORM PRINT-DETAIL.
124400*
124500 INS-INIT-F3-19.
124600     MOVE "INS-TEST-F3-19" TO PAR-NAME.
124700     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
124800     MOVE "TALLY SERIES" TO FEATURE.
124900     MOVE ZERO TO WRK-DU-999-1 WRK-DU-999-2 WRK-DU-999-3
125000         WRK-DU-999-4.
125100     MOVE
125200     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
125300-    "IDS CAN NOT BE ALL BAD."
125400         TO WC-XN-83.
125500     MOVE WC-XN-83 TO WRK-XN-83-1.
125600     MOVE 1 TO REC-CT.
125700     INSPECT WRK-XN-83-1 TALLYING WRK-DU-999-1 FOR ALL "A"
125800             WRK-DU-999-2 FOR LEADING "AH"
125900             WRK-DU-999-3 FOR CHARACTERS BEFORE "."
126000             WRK-DU-999-4 FOR CHARACTERS AFTER "AL"
126100             REPLACING
126200                 FIRST "L " BY "ZZ" AFTER INITIAL "AL"
126300                 FIRST "BAD" BY "ZZZ" AFTER "L "
126400                 LEADING "BAD" BY "ZZZ" BEFORE INITIAL "Q"
126500                 FIRST "BAD" BY "ZZZ" BEFORE INITIAL "Z"
126600                 FIRST "BAD" BY "ZZZ" AFTER "ALL "
126700                 ALL "." BY "Z" AFTER "AL".
126800     GO TO INS-TEST-F3-19-1.
126900 INS-DELETE-F3-19.
127000     PERFORM DE-LETE.
127100     PERFORM PRINT-DETAIL.
127200     GO TO INS-INIT-F3-20.
127300*
127400 INS-TEST-F3-19-1.
127500     IF WRK-DU-999-1 = 8
127600             PERFORM PASS
127700             GO TO INS-WRITE-F3-19-1
127800     ELSE
127900             GO TO INS-FAIL-F3-19-1.
128000 INS-DELETE-F3-19-1.
128100     PERFORM DE-LETE.
128200     GO TO INS-WRITE-F3-19-1.
128300 INS-FAIL-F3-19-1.
128400     PERFORM FAIL
128500     MOVE WRK-DU-999-1 TO COMPUTED-N
128600     MOVE 8 TO CORRECT-N.
128700 INS-WRITE-F3-19-1.
128800     PERFORM PRINT-DETAIL.
128900*
129000 INS-TEST-F3-19-2.
129100     ADD 1 TO REC-CT.
129200     IF WRK-DU-999-2 = 0
129300             PERFORM PASS
129400             GO TO INS-WRITE-F3-19-2
129500     ELSE
129600             GO TO INS-FAIL-F3-19-2.
129700 INS-DELETE-F3-19-2.
129800     PERFORM DE-LETE.
129900     GO TO INS-WRITE-F3-19-2.
130000 INS-FAIL-F3-19-2.
130100     PERFORM FAIL
130200     MOVE WRK-DU-999-2 TO COMPUTED-N
130300     MOVE 0 TO CORRECT-N.
130400 INS-WRITE-F3-19-2.
130500     PERFORM PRINT-DETAIL.
130600*
130700 INS-TEST-F3-19-3.
130800     ADD 1 TO REC-CT.
130900     IF WRK-DU-999-3 = 13
131000             PERFORM PASS
131100             GO TO INS-WRITE-F3-19-3
131200     ELSE
131300             PERFORM FAIL
131400             GO TO INS-FAIL-F3-19-3.
131500 INS-DELETE-F3-19-3.
131600     PERFORM DE-LETE.
131700     GO TO INS-WRITE-F3-19-3.
131800 INS-FAIL-F3-19-3.
131900     MOVE WRK-DU-999-3 TO COMPUTED-N
132000     MOVE 13 TO CORRECT-N.
132100 INS-WRITE-F3-19-3.
132200     PERFORM PRINT-DETAIL.
132300*
132400 INS-TEST-F3-19-4.
132500     ADD 1 TO REC-CT.
132600     IF WRK-DU-999-4 = 5
132700             PERFORM PASS
132800             GO TO INS-WRITE-F3-19-4
132900     ELSE
133000             GO TO INS-FAIL-F3-19-4.
133100 INS-DELETE-F3-19-4.
133200     PERFORM DE-LETE.
133300     GO TO INS-WRITE-F3-19-4.
133400 INS-FAIL-F3-19-4.
133500     PERFORM FAIL
133600     MOVE WRK-DU-999-4 TO COMPUTED-N
133700     MOVE 5 TO CORRECT-N.
133800 INS-WRITE-F3-19-4.
133900     PERFORM PRINT-DETAIL.
134000*
134100 INS-TEST-F3-19-5.
134200     ADD 1 TO REC-CT.
134300     IF WRK-XN-83-1 = ANS-XN-83-6
134400             PERFORM PASS
134500             GO TO INS-WRITE-F3-19-5
134600     ELSE
134700             GO TO INS-FAIL-F3-19-5.
134800 INS-DELETE-F3-19-5.
134900     PERFORM DE-LETE.
135000     GO TO INS-WRITE-F3-19-5.
135100 INS-FAIL-F3-19-5.
135200     PERFORM FAIL
135300     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
135400     MOVE    ANS-XN-83-6     TO WS-RIGHT-1-83
135500     MOVE    WS-RIGHT-1-20   TO CORRECT-A
135600     MOVE    WS-WRONG-1-20   TO COMPUTED-A
135700     PERFORM PRINT-DETAIL
135800     MOVE    WS-RIGHT-21-40  TO CORRECT-A
135900     MOVE    WS-WRONG-21-40  TO COMPUTED-A
136000     PERFORM PRINT-DETAIL
136100     MOVE    WS-RIGHT-41-60  TO CORRECT-A
136200     MOVE    WS-WRONG-41-60  TO COMPUTED-A
136300     PERFORM PRINT-DETAIL
136400     MOVE    WS-RIGHT-61-80  TO CORRECT-A
136500     MOVE    WS-WRONG-61-80  TO COMPUTED-A
136600     PERFORM PRINT-DETAIL
136700     MOVE    WS-RIGHT-81-83  TO CORRECT-A
136800     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
136900 INS-WRITE-F3-19-5.
137000     PERFORM PRINT-DETAIL.
137100*
137200 INS-INIT-F3-20.
137300     MOVE "INS-TEST-F3-20" TO PAR-NAME.
137400     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
137500     MOVE "REPLACE SERIES" TO FEATURE.
137600     MOVE ZERO TO REC-CT WRK-DU-999-1.
137700     MOVE
137800     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
137900-    "IDS CAN NOT BE ALL BAD."
138000         TO WC-XN-83.
138100     MOVE WC-XN-83 TO WRK-XN-83-1.
138200     MOVE    1 TO REC-CT.
138300 INS-TEST-F3-20-0.
138400     INSPECT WRK-XN-83-1 TALLYING WRK-DU-999-1  FOR CHARACTERS
138500             BEFORE "."
138600             REPLACING
138700             ALL "L BAD." BY "ZZZZZZ" AFTER L-XN-1-1
138800             ALL " " BY HYPEN-XN-1-1
138900             FIRST "C" BY P-XN-1-1
139000             LEADING AH-XN-2 BY OH-XN-2
139100             ALL "F" BY "Z" BEFORE G-XN-1-1.
139200     GO      TO INS-TEST-F3-20-1.
139300 INS-DELETE-F3-20.
139400     PERFORM DE-LETE.
139500     PERFORM PRINT-DETAIL.
139600     GO      TO CCVS-999999.
139700*
139800 INS-TEST-F3-20-1.
139900     IF      WRK-DU-999-1 EQUAL TO 15
140000             PERFORM PASS
140100             GO TO INS-WRITE-F3-20-1
140200     ELSE
140300             GO TO INS-FAIL-F3-20-1.
140400 INS-DELETE-F3-20-1.
140500     PERFORM DE-LETE.
140600     GO TO INS-WRITE-F3-20-1.
140700 INS-FAIL-F3-20-1.
140800     PERFORM FAIL
140900     MOVE    WRK-DU-999-1 TO COMPUTED-N
141000     MOVE    15 TO CORRECT-N.
141100 INS-WRITE-F3-20-1.
141200     PERFORM PRINT-DETAIL.
141300*
141400 INS-TEST-F3-20-2.
141500     ADD     1 TO REC-CT.
141600     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-7
141700             PERFORM PASS
141800             GO TO INS-WRITE-F3-20-2
141900     ELSE
142000             GO TO INS-FAIL-F3-20-2.
142100 INS-DELETE-F3-20-2.
142200     PERFORM DE-LETE.
142300     GO TO INS-WRITE-F3-20-2.
142400 INS-FAIL-F3-20-2.
142500     PERFORM FAIL
142600     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
142700     MOVE    ANS-XN-83-7     TO WS-RIGHT-1-83
142800     MOVE    WS-RIGHT-1-20   TO CORRECT-A
142900     MOVE    WS-WRONG-1-20   TO COMPUTED-A
143000     PERFORM PRINT-DETAIL
143100     MOVE    WS-RIGHT-21-40  TO CORRECT-A
143200     MOVE    WS-WRONG-21-40  TO COMPUTED-A
143300     PERFORM PRINT-DETAIL
143400     MOVE    WS-RIGHT-41-60  TO CORRECT-A
143500     MOVE    WS-WRONG-41-60  TO COMPUTED-A
143600     PERFORM PRINT-DETAIL
143700     MOVE    WS-RIGHT-61-80  TO CORRECT-A
143800     MOVE    WS-WRONG-61-80  TO COMPUTED-A
143900     PERFORM PRINT-DETAIL
144000     MOVE    WS-RIGHT-81-83  TO CORRECT-A
144100     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
144200 INS-WRITE-F3-20-2.
144300     PERFORM PRINT-DETAIL.
144400*
144500 INS-INIT-F2-21.
144600     MOVE    ZERO TO REC-CT.
144700     MOVE    SPACES TO PAR-NAME.
144800     MOVE "INS-TEST-F2-21" TO PAR-NAME.
144900     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
145000     MOVE "REPLACE BEFORE" TO FEATURE.
145100     MOVE
145200     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
145300-    "IDS CAN NOT BE ALL BAD."
145400         TO WC-XN-83.
145500     MOVE    WC-XN-83 TO WRK-XN-83-1.
145600 INS-TEST-F2-21.
145700     INSPECT WRK-XN-83-1
145800         REPLACING ALL SPACE-XN-1-1 BY "-" BEFORE INITIAL "Z".
145900     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-8
146000             PERFORM PASS
146100             GO TO INS-WRITE-F2-21-1
146200     ELSE
146300             GO TO INS-FAIL-F2-21-1.
146400 INS-DELETE-F2-21-1.
146500     PERFORM DE-LETE.
146600     GO TO INS-WRITE-F2-21-1.
146700 INS-FAIL-F2-21-1.
146800     PERFORM FAIL
146900     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
147000     MOVE    ANS-XN-83-8     TO WS-RIGHT-1-83
147100     MOVE    WS-RIGHT-1-20   TO CORRECT-A
147200     MOVE    WS-WRONG-1-20   TO COMPUTED-A
147300     PERFORM PRINT-DETAIL
147400     MOVE    WS-RIGHT-21-40  TO CORRECT-A
147500     MOVE    WS-WRONG-21-40  TO COMPUTED-A
147600     PERFORM PRINT-DETAIL
147700     MOVE    WS-RIGHT-41-60  TO CORRECT-A
147800     MOVE    WS-WRONG-41-60  TO COMPUTED-A
147900     PERFORM PRINT-DETAIL
148000     MOVE    WS-RIGHT-61-80  TO CORRECT-A
148100     MOVE    WS-WRONG-61-80  TO COMPUTED-A
148200     PERFORM PRINT-DETAIL
148300     MOVE    WS-RIGHT-81-83  TO CORRECT-A
148400     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
148500 INS-WRITE-F2-21-1.
148600     PERFORM PRINT-DETAIL.
148700*
148800 INS-INIT-F2-22.
148900     MOVE "INS-TEST-F2-22" TO PAR-NAME.
149000     MOVE "VI-94 6.17.3"   TO ANSI-REFERENCE.
149100     MOVE  "REPLACE AFTER" TO FEATURE.
149200     MOVE
149300     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
149400-    "IDS CAN NOT BE ALL BAD."
149500         TO WC-XN-83.
149600     MOVE    WC-XN-83 TO WRK-XN-83-1.
149700 INS-TEST-F2-22.
149800     INSPECT WRK-XN-83-1
149900         REPLACING ALL SPACE-XN-1-1 BY "-" AFTER INITIAL "Z".
150000     IF      WRK-XN-83-1 EQUAL TO WC-XN-83
150100             PERFORM PASS
150200             GO TO INS-WRITE-F2-22
150300     ELSE
150400             GO TO INS-FAIL-F2-22.
150500 INS-DELETE-F2-22.
150600     PERFORM DE-LETE.
150700     GO TO INS-WRITE-F2-22.
150800 INS-FAIL-F2-22.
150900     PERFORM FAIL
151000     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
151100     MOVE    WC-XN-83        TO WS-RIGHT-1-83
151200     MOVE    WS-RIGHT-1-20   TO CORRECT-A
151300     MOVE    WS-WRONG-1-20   TO COMPUTED-A
151400     PERFORM PRINT-DETAIL
151500     MOVE    WS-RIGHT-21-40  TO CORRECT-A
151600     MOVE    WS-WRONG-21-40  TO COMPUTED-A
151700     PERFORM PRINT-DETAIL
151800     MOVE    WS-RIGHT-41-60  TO CORRECT-A
151900     MOVE    WS-WRONG-41-60  TO COMPUTED-A
152000     PERFORM PRINT-DETAIL
152100     MOVE    WS-RIGHT-61-80  TO CORRECT-A
152200     MOVE    WS-WRONG-61-80  TO COMPUTED-A
152300     PERFORM PRINT-DETAIL
152400     MOVE    WS-RIGHT-81-83  TO CORRECT-A
152500     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
152600 INS-WRITE-F2-22.
152700     PERFORM PRINT-DETAIL.
152800*
152900 INS-INIT-F1-23.
153000     MOVE "INS-TEST-F1-23" TO PAR-NAME.
153100     MOVE   "VI-94" TO ANSI-REFERENCE.
153200     MOVE    "TALLY SIGNED NUM." TO FEATURE.
153300     MOVE    -12345 TO WRK-DS-5V0-1.
153400     MOVE    ZERO TO WRK-DU-999-1.
153500     MOVE    ZERO TO WRK-DU-999-2.
153600     MOVE    1 TO REC-CT.
153700 INS-TEST-F1-23-0.
153800     INSPECT WRK-DS-5V0-1
153900         TALLYING WRK-DU-999-1 FOR ALL "-"
154000                  WRK-DU-999-2 FOR ALL "5".
154100     GO      TO INS-TEST-F1-23-1.
154200 INS-DELETE-F1-23.
154300     PERFORM DE-LETE.
154400     PERFORM PRINT-DETAIL.
154500     GO TO INS-INIT-F1-24.
154600*
154700 INS-TEST-F1-23-1.
154800     IF      WRK-DU-999-1 EQUAL 0
154900             PERFORM PASS
155000             GO TO INS-WRITE-F1-23-1
155100     ELSE
155200             PERFORM FAIL
155300             GO TO INS-FAIL-F1-23-1.
155400 INS-DELETE-F1-23-1.
155500     PERFORM DE-LETE.
155600     GO TO INS-WRITE-F1-23-1.
155700 INS-FAIL-F1-23-1.
155800     MOVE    WRK-DU-999-1 TO COMPUTED-N
155900     MOVE    ZERO TO CORRECT-N.
156000 INS-WRITE-F1-23-1.
156100     PERFORM PRINT-DETAIL.
156200*
156300 INS-TEST-F1-23-2.
156400     ADD     1 TO REC-CT.
156500     IF      WRK-DU-999-2 EQUAL TO 1
156600     PERFORM PASS
156700             GO TO INS-WRITE-F1-23-2
156800     ELSE
156900             PERFORM FAIL
157000             GO TO INS-FAIL-F1-23-2.
157100 INS-DELETE-F1-23-2.
157200     PERFORM DE-LETE.
157300     GO TO INS-WRITE-F1-23-2.
157400 INS-FAIL-F1-23-2.
157500     MOVE    WRK-DU-999-2 TO COMPUTED-N
157600     MOVE    1 TO CORRECT-N.
157700 INS-WRITE-F1-23-2.
157800     PERFORM PRINT-DETAIL.
157900*
158000 INS-INIT-F1-24.
158100     MOVE "INS-TEST-F1-24" TO PAR-NAME.
158200     MOVE "NUMERIC EDITED FIELD" TO FEATURE.
158300     MOVE "VI-94" TO ANSI-REFERENCE.
158400     MOVE  123456.789  TO WRK-NE-1.
158500     MOVE    ZERO TO REC-CT.
158600     MOVE    ZERO TO WRK-DU-999-1.
158700 INS-TEST-F1-24.
158800     INSPECT WRK-NE-1  TALLYING WRK-DU-999-1  FOR ALL ",".
158900     IF WRK-DU-999-1 EQUAL TO 1
159000             PERFORM PASS
159100             GO TO INS-WRITE-F1-24
159200     ELSE
159300             GO TO INS-FAIL-F1-24.
159400 INS-DELETE-F1-24.
159500     PERFORM DE-LETE.
159600     GO TO INS-WRITE-F1-24.
159700 INS-FAIL-F1-24.
159800     PERFORM FAIL
159900     MOVE    WRK-DU-999-1 TO COMPUTED-N
160000     MOVE    1 TO CORRECT-N.
160100 INS-WRITE-F1-24.
160200     PERFORM PRINT-DETAIL.
160300*
160400 INS-INIT-F1-25.
160500     MOVE "INS-TEST-F1-25" TO PAR-NAME.
160600     MOVE   "VI-94" TO ANSI-REFERENCE.
160700     MOVE    "NUMERIC EDITED FIELD" TO FEATURE.
160800     MOVE    123456.789 TO WRK-NE-1.
160900     MOVE    ZERO TO WRK-DU-999-1.
161000 INS-TEST-F1-25.
161100     INSPECT WRK-NE-1  TALLYING WRK-DU-999-1  FOR ALL "-".
161200     IF      WRK-DU-999-1 EQUAL TO ZERO
161300             PERFORM PASS
161400             GO TO INS-WRITE-F1-25
161500     ELSE
161600             GO TO INS-FAIL-F1-25.
161700 INS-DELETE-F1-25.
161800     PERFORM DE-LETE.
161900     GO TO INS-WRITE-F1-25.
162000 INS-FAIL-F1-25.
162100     PERFORM FAIL
162200     MOVE    WRK-DU-999-1 TO COMPUTED-N
162300     MOVE    ZERO TO CORRECT-N.
162400 INS-WRITE-F1-25.
162500     PERFORM PRINT-DETAIL.
162600*
162700 INS-INIT-F1-26.
162800     MOVE    "INS-TEST-F1-26" TO PAR-NAME.
162900     MOVE    "VI-94" TO ANSI-REFERENCE.
163000     MOVE    "2 CHARACTER MASK" TO FEATURE.
163100     MOVE    "X X" TO X-SPACE-X-XN-3.
163200     MOVE    ZERO TO WRK-DU-999-1.
163300 INS-TEST-F1-26.
163400     INSPECT X-SPACE-X-XN-3 TALLYING WRK-DU-999-1 FOR ALL "X ".
163500     IF      WRK-DU-999-1 EQUAL TO 1
163600             PERFORM PASS
163700             GO TO INS-WRITE-F1-26
163800     ELSE
163900             GO TO INS-FAIL-F1-26.
164000 INS-DELETE-F1-26.
164100     PERFORM DE-LETE.
164200     GO TO INS-WRITE-F1-26.
164300 INS-FAIL-F1-26.
164400     PERFORM FAIL
164500     MOVE WRK-DU-999-1 TO COMPUTED-N
164600     MOVE 1 TO CORRECT-N.
164700 INS-WRITE-F1-26.
164800     PERFORM PRINT-DETAIL.
164900*
165000 INS-INIT-F1-27.
165100     MOVE   "INS-TEST-F1-27" TO PAR-NAME.
165200     MOVE   "VI-94" TO ANSI-REFERENCE.
165300     MOVE   "ORDER OF COMPARE" TO FEATURE.
165400     MOVE   "AABA" TO AABA-XN-4.
165500     MOVE    ZERO TO WRK-DU-999-1.
165600     MOVE    ZERO TO WRK-DU-999-2.
165700 INS-TEST-F1-27.
165800     INSPECT AABA-XN-4 TALLYING WRK-DU-999-1 FOR ALL "AA"
165900                                WRK-DU-999-2 FOR ALL "A".
166000     IF      WRK-DU-999-1 EQUAL TO 1
166100         AND
166200             WRK-DU-999-2 EQUAL TO 1
166300             PERFORM PASS
166400             GO TO INS-WRITE-F1-27
166500     ELSE
166600             GO TO INS-FAIL-F1-27.
166700 INS-DELETE-F1-27.
166800     PERFORM DE-LETE.
166900     GO TO INS-WRITE-F1-27.
167000 INS-FAIL-F1-27.
167100     PERFORM FAIL
167200     MOVE WRK-DU-999-1 TO COMPUTED-N
167300     MOVE WRK-DU-999-2 TO CORRECT-N
167400     MOVE "BOTH SHOULD BE 1" TO RE-MARK.
167500 INS-WRITE-F1-27.
167600     PERFORM PRINT-DETAIL.
167700*
167800 INS-INIT-F1-28.
167900*    ===-->  BEFORE AND AFTER PHRASES  <--===
168000     MOVE   "INS-TEST-F1-28" TO PAR-NAME.
168100     MOVE   "VI-94 6.17.3 SR4" TO ANSI-REFERENCE.
168200     MOVE   "TALLY FOR ALL SPACES" TO FEATURE.
168300     MOVE
168400     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
168500-    "IDS CAN NOT BE ALL BAD."
168600         TO WC-XN-83.
168700     MOVE    ZERO TO WRK-DU-999-1.
168800 INS-TEST-F1-28.
168900     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR ALL SPACES
169000             AFTER  "C."
169100             BEFORE "DO".
169200     IF      WRK-DU-999-1 EQUAL TO 6
169300             PERFORM PASS
169400             GO TO   INS-WRITE-F1-28.
169500     GO TO   INS-FAIL-F1-28.
169600 INS-DELETE-F1-28.
169700     PERFORM DE-LETE.
169800     GO TO   INS-WRITE-F1-28.
169900 INS-FAIL-F1-28.
170000     PERFORM FAIL.
170100     MOVE    WRK-DU-999-1 TO COMPUTED-N.
170200     MOVE    6 TO CORRECT-N.
170300 INS-WRITE-F1-28.
170400     PERFORM PRINT-DETAIL.
170500*
170600 INS-INIT-F1-29.
170700*    ===-->  BEFORE AND AFTER PHRASES  <--===
170800     MOVE "INS-TEST-F1-29" TO PAR-NAME.
170900     MOVE "VI-94 6.17.3 SR4" TO ANSI-REFERENCE.
171000     MOVE "FOR CHARS AFTER LIT" TO FEATURE.
171100     MOVE
171200     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
171300-    "IDS CAN NOT BE ALL BAD."
171400         TO WC-XN-83.
171500     MOVE    ZERO TO WRK-DU-999-1.
171600 INS-TEST-F1-29.
171700     INSPECT WC-XN-83 TALLYING WRK-DU-999-1 FOR CHARACTERS
171800             BEFORE "KI"
171900             AFTER  " W".
172000     IF      WRK-DU-999-1 EQUAL TO 44
172100             PERFORM PASS
172200             GO TO   INS-WRITE-F1-29.
172300     GO TO   INS-FAIL-F1-29.
172400 INS-DELETE-F1-29.
172500     PERFORM DE-LETE.
172600     GO TO   INS-WRITE-F1-29.
172700 INS-FAIL-F1-29.
172800     PERFORM FAIL.
172900     MOVE WRK-DU-999-1 TO COMPUTED-N.
173000     MOVE 44 TO CORRECT-N.
173100 INS-WRITE-F1-29.
173200     PERFORM PRINT-DETAIL.
173300*
173400 INS-INIT-F1-30.
173500*    ===-->  EVALUATION OF SUBSCRIPTED IDENTIFIERS  <--===
173600     MOVE   "INS-TEST-F1-30" TO PAR-NAME.
173700     MOVE   "VI-95 6.17.4 GR4 & VI-97 6.17.4 GR8"
173800          TO ANSI-REFERENCE.
173900     MOVE   "FOR CHARS AFTER LIT" TO FEATURE.
174000     MOVE    ZERO TO WRK-DU-999-1.
174100     MOVE "XXXXXXXYYYYYYYAAABAAASSSSSSSTTTTTTT"
174200          TO INSPECT-FIELDS.
174300     MOVE "GHBDC" TO LOCATE-CHARS.
174400     MOVE    3    TO SUB.
174500 INS-TEST-F1-30-0.
174600     INSPECT DATA-FIELD (SUB)
174700             TALLYING WRK-DU-999-1
174800             FOR ALL "A" BEFORE END-CHAR (SUB)
174900                 ALL END-CHAR (SUB).
175000 INS-TEST-F1-30-1.
175100     IF      WRK-DU-999-1 EQUAL TO 4
175200             PERFORM PASS
175300             GO TO   INS-WRITE-F1-30-1.
175400     GO TO   INS-FAIL-F1-30-1.
175500 INS-DELETE-F1-30-1.
175600     PERFORM DE-LETE.
175700     GO TO   INS-WRITE-F1-30-1.
175800 INS-FAIL-F1-30-1.
175900     PERFORM FAIL.
176000     MOVE    WRK-DU-999-1 TO COMPUTED-N.
176100     MOVE    4 TO CORRECT-N.
176200 INS-WRITE-F1-30-1.
176300     PERFORM PRINT-DETAIL.
176400*
176500 INS-INIT-F1-31.
176600     MOVE   "INS-TEST-F1-31" TO PAR-NAME.
176700     MOVE   "VI-93" TO ANSI-REFERENCE.
176800     MOVE    ZERO TO WRK-DU-999-1.
176900     MOVE   "AABBCCDDEBBBBGHDDIJJXXAABBCCDDEEEFFGGHHIIJJKKLLM"
177000         TO TEST-31-DATA.
177100     MOVE "BB" TO WS-BB.
177200 INS-TEST-F1-31-0.
177300     INSPECT TEST-31-DATA TALLYING WRK-DU-999-1
177400             FOR ALL "A"    BEFORE "X"
177500                 ALL  WS-BB BEFORE "X"
177600                 ALL "D"    BEFORE "X".
177700 INS-TEST-F1-31-1.
177800     IF      WRK-DU-999-1 EQUAL TO 9
177900             PERFORM PASS
178000             GO TO   INS-WRITE-F1-31-1.
178100     GO TO   INS-FAIL-F1-31-1.
178200 INS-DELETE-F1-31-1.
178300     PERFORM DE-LETE.
178400     GO TO   INS-WRITE-F1-31-1.
178500 INS-FAIL-F1-31-1.
178600     PERFORM FAIL.
178700     MOVE    WRK-DU-999-1 TO COMPUTED-N.
178800     MOVE    10 TO CORRECT-N.
178900 INS-WRITE-F1-31-1.
179000     PERFORM PRINT-DETAIL.
179100*
179200 INS-INIT-F1-32.
179300     MOVE   "INS-TEST-F1-32" TO PAR-NAME.
179400     MOVE   "VI-93" TO ANSI-REFERENCE.
179500     MOVE    ZERO TO WRK-DU-999-1.
179600     MOVE "AABSSSSSEBBTTTT1URSTSTSTVVDYYDEEEFFGSSSSTZSTZSTM"
179700         TO TEST-32-DATA.
179800     MOVE "Y" TO WS-Y.
179900 INS-TEST-F1-32-0.
180000     INSPECT TEST-32-DATA TALLYING WRK-DU-999-1
180100             FOR LEADING "S" AFTER WS-Y
180200                         "S" AFTER "U"
180300                         "T" AFTER WS-Y
180400                         "T" AFTER "U".
180500 INS-TEST-F1-32-1.
180600     IF      WRK-DU-999-1 EQUAL TO 0
180700             PERFORM PASS
180800             GO TO   INS-WRITE-F1-32-1.
180900     GO TO   INS-FAIL-F1-32-1.
181000 INS-DELETE-F1-32-1.
181100     PERFORM DE-LETE.
181200     GO TO   INS-WRITE-F1-32-1.
181300 INS-FAIL-F1-32-1.
181400     PERFORM FAIL.
181500     MOVE    WRK-DU-999-1 TO COMPUTED-N.
181600     MOVE    0 TO CORRECT-N.
181700 INS-WRITE-F1-32-1.
181800     PERFORM PRINT-DETAIL.
181900*
182000 INS-INIT-F2-33.
182100*    ===--> "BEFORE" AND "AFTER" PHRASES  <--===
182200     MOVE "INS-TEST-F2-33" TO PAR-NAME.
182300     MOVE "VI-94 6.17.3 SR4" TO ANSI-REFERENCE.
182400     MOVE "REP CHARS BY SPACES" TO FEATURE.
182500     MOVE
182600     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
182700-    "IDS CAN NOT BE ALL BAD."
182800         TO WC-XN-83.
182900     MOVE    WC-XN-83 TO WRK-XN-83-1.
183000     MOVE
183100     "AH YES AH YES W.C
183200-    "            BE ALL BAD."
183300         TO ANS-XN-83-10.
183400 INS-TEST-F2-33-0.
183500     INSPECT WRK-XN-83-1 REPLACING CHARACTERS BY SPACES
183600             BEFORE "B" AFTER "C".
183700 INS-TEST-F2-33-1.
183800     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-10
183900             PERFORM PASS
184000             GO TO   INS-WRITE-F2-33-1.
184100     GO TO   INS-FAIL-F2-33-1.
184200 INS-DELETE-F2-33-1.
184300     PERFORM DE-LETE.
184400     GO TO   INS-WRITE-F2-33-1.
184500 INS-FAIL-F2-33-1.
184600     PERFORM FAIL.
184700     MOVE    WRK-XN-83-1  TO WS-WRONG-1-83.
184800     MOVE    ANS-XN-83-10 TO WS-RIGHT-1-83.
184900     MOVE "THERE SHOUD BE 55 SPACES BETWEEN ""B"" AND ""C""."
185000          TO RE-MARK.
185100     MOVE    WS-RIGHT-1-20   TO CORRECT-A.
185200     MOVE    WS-WRONG-1-20   TO COMPUTED-A.
185300     PERFORM PRINT-DETAIL.
185400     MOVE    WS-RIGHT-21-40  TO CORRECT-A.
185500     MOVE    WS-WRONG-21-40  TO COMPUTED-A.
185600     PERFORM PRINT-DETAIL.
185700     MOVE    WS-RIGHT-41-60  TO CORRECT-A.
185800     MOVE    WS-WRONG-41-60  TO COMPUTED-A.
185900     PERFORM PRINT-DETAIL.
186000     MOVE    WS-RIGHT-61-80  TO CORRECT-A.
186100     MOVE    WS-WRONG-61-80  TO COMPUTED-A.
186200     PERFORM PRINT-DETAIL.
186300     MOVE    WS-RIGHT-81-83  TO CORRECT-A.
186400     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
186500 INS-WRITE-F2-33-1.
186600     PERFORM PRINT-DETAIL.
186700*
186800 INS-INIT-F2-34.
186900*    ===-->  MULTIPLE "CHARACTERS" PHRASES WITH  <--===
187000*    ===-->         "BEFORE" AND "AFTER"         <--===
187100     MOVE   "INS-TEST-F2-34" TO PAR-NAME.
187200     MOVE   "VI-93 6.17.2" TO ANSI-REFERENCE.
187300     MOVE   "AAFSSQ  ET U V W H S" TO TEST-34-DATA.
187400     MOVE   "AAFXXQ  ETYYYYYYYH S" TO TEST-34-ANSWER.
187500 INS-TEST-F2-34-0.
187600     INSPECT TEST-34-DATA
187700             REPLACING
187800             CHARACTERS BY "X" AFTER "F" BEFORE "Q"
187900             CHARACTERS BY "Y" AFTER "T" BEFORE "H".
188000 INS-TEST-F2-34-1.
188100     IF      TEST-34-DATA = TEST-34-ANSWER
188200             PERFORM PASS
188300             GO TO   INS-WRITE-F2-34-1.
188400     GO TO   INS-FAIL-F2-34-1.
188500 INS-DELETE-F2-34-1.
188600     PERFORM DE-LETE.
188700     GO TO   INS-WRITE-F2-34-1.
188800 INS-FAIL-F2-34-1.
188900     PERFORM FAIL.
189000     MOVE    TEST-34-DATA TO COMPUTED-A.
189100     MOVE    TEST-34-ANSWER TO CORRECT-A.
189200 INS-WRITE-F2-34-1.
189300     PERFORM PRINT-DETAIL.
189400*
189500 INS-INIT-F3-35.
189600*    ===-->  MULTIPLE "CHARACTERS" PHRASES WITH  <--===
189700*    ===-->         "BEFORE" AND "AFTER"         <--===
189800     MOVE   "INS-TEST-F3-35-1" TO PAR-NAME.
189900     MOVE   "VI-93 6.17.2" TO ANSI-REFERENCE.
190000     MOVE    ZERO TO WRK-DU-999-1.
190100     MOVE "AX SSA YEG U V W H S"  TO TEST-35-DATA.
190200     MOVE "AXAAAAAYEG       H S"  TO TEST-35-ANSWER.
190300 INS-TEST-F3-35-0.
190400     INSPECT TEST-35-DATA TALLYING WRK-DU-999-1
190500             FOR CHARACTERS
190600             REPLACING
190700             CHARACTERS BY   "A" AFTER "X" BEFORE "Y"
190800             CHARACTERS BY SPACE AFTER "G" BEFORE "H".
190900 INS-TEST-F3-35-1.
191000     IF      TEST-35-DATA = TEST-35-ANSWER
191100             PERFORM PASS
191200             GO TO   INS-WRITE-F3-35-1.
191300     GO TO   INS-FAIL-F3-35-1.
191400 INS-DELETE-F3-35-1.
191500     PERFORM DE-LETE.
191600     GO TO   INS-WRITE-F3-35-1.
191700 INS-FAIL-F3-35-1.
191800     PERFORM FAIL.
191900     MOVE    TEST-35-DATA TO COMPUTED-A.
192000     MOVE    TEST-35-ANSWER TO CORRECT-A.
192100 INS-WRITE-F3-35-1.
192200     PERFORM PRINT-DETAIL.
192300*
192400 INS-INIT-F3-36.
192500*    ===-->    "BEFORE" AND "AFTER" PHRASES     <--===
192600     MOVE   "INS-TEST-F3-36" TO PAR-NAME.
192700     MOVE   "TALLY-REPLACE CHARS" TO FEATURE.
192800     MOVE    ZERO TO WRK-DU-999-1.
192900     MOVE
193000     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
193100-    "IDS CAN NOT BE ALL BAZ."
193200         TO WC-XN-83.
193300     MOVE    WC-XN-83 TO WRK-XN-83-1.
193400     MOVE
193500     "AH
193600-    "                     Z."
193700          TO ANS-XN-83-11.
193800     MOVE    1 TO REC-CT.
193900 INS-TEST-F3-36-0.
194000     INSPECT WRK-XN-83-1
194100             TALLYING  WRK-DU-999-1 FOR CHARACTERS
194200                       BEFORE "LL" AFTER "ES"
194300             REPLACING CHARACTERS BY SPACES
194400                       AFTER "H" BEFORE "Z".
194500     GO TO   INS-TEST-F3-36-1.
194600 INS-DELETE-F3-36.
194700     PERFORM DE-LETE.
194800     PERFORM PRINT-DETAIL.
194900     GO      TO INS-INIT-F3-37.
195000 INS-TEST-F3-36-1.
195100     IF      WRK-DU-999-1 EQUAL TO 70
195200             PERFORM PASS
195300             GO TO INS-WRITE-F3-36-1
195400     ELSE
195500             GO TO INS-FAIL-F3-36-1.
195600 INS-DELETE-F3-36-1.
195700     PERFORM DE-LETE.
195800     GO TO INS-WRITE-F3-36-1.
195900 INS-FAIL-F3-36-1.
196000     PERFORM FAIL
196100     MOVE    WRK-DU-999-1 TO COMPUTED-N
196200     MOVE    70 TO CORRECT-N.
196300 INS-WRITE-F3-36-1.
196400     PERFORM PRINT-DETAIL.
196500*
196600 INS-TEST-F3-36-2.
196700     ADD     1 TO REC-CT.
196800     IF      WRK-XN-83-1 = ANS-XN-83-11
196900             PERFORM PASS
197000             GO TO INS-WRITE-F3-36-2
197100     ELSE
197200             GO TO INS-FAIL-F3-36-2.
197300 INS-DELETE-F3-36-2.
197400     PERFORM DE-LETE.
197500     GO TO INS-WRITE-F3-36-2.
197600 INS-FAIL-F3-36-2.
197700     PERFORM FAIL
197800     MOVE    WRK-XN-83-1  TO WS-WRONG-1-83
197900     MOVE    ANS-XN-83-11 TO WS-RIGHT-1-83
198000     MOVE "THERE SHOULD BE 81 SPACES BETWEEN ""H"" AND ""Z""."
198100             TO RE-MARK
198200     MOVE    WS-RIGHT-1-20   TO CORRECT-A
198300     MOVE    WS-WRONG-1-20   TO COMPUTED-A
198400     PERFORM PRINT-DETAIL
198500     MOVE    WS-RIGHT-21-40  TO CORRECT-A
198600     MOVE    WS-WRONG-21-40  TO COMPUTED-A
198700     PERFORM PRINT-DETAIL
198800     MOVE    WS-RIGHT-41-60  TO CORRECT-A
198900     MOVE    WS-WRONG-41-60  TO COMPUTED-A
199000     PERFORM PRINT-DETAIL
199100     MOVE    WS-RIGHT-61-80  TO CORRECT-A
199200     MOVE    WS-WRONG-61-80  TO COMPUTED-A
199300     PERFORM PRINT-DETAIL
199400     MOVE    WS-RIGHT-81-83  TO CORRECT-A
199500     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
199600 INS-WRITE-F3-36-2.
199700     PERFORM PRINT-DETAIL.
199800*
199900 INS-INIT-F3-37.
200000*    ===-->    "BEFORE" AND "AFTER" PHRASES     <--===
200100     MOVE   "INS-TEST-F3-37" TO PAR-NAME.
200200     MOVE   "REPL FIRST AFTER" TO FEATURE.
200300     MOVE    ZERO TO WRK-DU-999-1.
200400     MOVE
200500     "AH YES AH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
200600-    "IDS CAN NOT BE ALL BAD."
200700         TO WC-XN-83.
200800     MOVE    WC-XN-83 TO WRK-XN-83-1.
200900     MOVE
201000     "AH YES OH YES W.C. FRITOES HERE. ANYONE WHO HATES DOGS AND K
201100-    "IDS CAN NOT BE ALL BAD."
201200         TO ANS-XN-83-5.
201300     MOVE    1 TO REC-CT.
201400 INS-TEST-F3-37-0.
201500     INSPECT WRK-XN-83-1
201600             TALLYING  WRK-DU-999-1 FOR ALL "A"
201700                       BEFORE L-XN-1-1
201800                       AFTER  "YE"
201900             REPLACING FIRST  AH-XN-2 BY "OH"
202000                       AFTER  INITIAL HSPACE-XN-2
202100                       BEFORE "F".
202200     GO TO INS-TEST-F3-37-1.
202300 INS-DELETE-F3-37.
202400     PERFORM DE-LETE.
202500     PERFORM PRINT-DETAIL.
202600     GO      TO INS-INIT-F3-38.
202700 INS-TEST-F3-37-1.
202800     IF      WRK-DU-999-1 EQUAL TO 6
202900             PERFORM PASS
203000             GO TO INS-WRITE-F3-37-1
203100     ELSE
203200             GO TO INS-FAIL-F3-37-1.
203300 INS-DELETE-F3-37-1.
203400     PERFORM DE-LETE.
203500     GO TO INS-WRITE-F3-37-1.
203600 INS-FAIL-F3-37-1.
203700     PERFORM FAIL
203800     MOVE    WRK-DU-999-1 TO COMPUTED-N
203900     MOVE    6 TO CORRECT-N.
204000 INS-WRITE-F3-37-1.
204100     PERFORM PRINT-DETAIL.
204200*
204300 INS-TEST-F3-37-2.
204400     ADD     1 TO REC-CT.
204500     IF      WRK-XN-83-1 EQUAL TO ANS-XN-83-5
204600             PERFORM PASS
204700             GO TO INS-WRITE-F3-37-2
204800     ELSE
204900             GO TO INS-FAIL-F3-37-2.
205000 INS-DELETE-F3-37-2.
205100     PERFORM DE-LETE.
205200     GO TO INS-WRITE-F3-37-2.
205300 INS-FAIL-F3-37-2.
205400     PERFORM FAIL
205500     MOVE    WRK-XN-83-1     TO WS-WRONG-1-83
205600     MOVE    ANS-XN-83-5     TO WS-RIGHT-1-83
205700     MOVE    WS-RIGHT-1-20   TO CORRECT-A
205800     MOVE    WS-WRONG-1-20   TO COMPUTED-A
205900     PERFORM PRINT-DETAIL
206000     MOVE    WS-RIGHT-21-40  TO CORRECT-A
206100     MOVE    WS-WRONG-21-40  TO COMPUTED-A
206200     PERFORM PRINT-DETAIL
206300     MOVE    WS-RIGHT-41-60  TO CORRECT-A
206400     MOVE    WS-WRONG-41-60  TO COMPUTED-A
206500     PERFORM PRINT-DETAIL
206600     MOVE    WS-RIGHT-61-80  TO CORRECT-A
206700     MOVE    WS-WRONG-61-80  TO COMPUTED-A
206800     PERFORM PRINT-DETAIL
206900     MOVE    WS-RIGHT-81-83  TO CORRECT-A
207000     MOVE    WS-WRONG-81-83  TO COMPUTED-A.
207100 INS-WRITE-F3-37-2.
207200     PERFORM PRINT-DETAIL.
207300*
207400 INS-INIT-F3-38.
207500*    ===-->  MULTIPLE OPERANDS FOR "ALL"         <--===
207600     MOVE   "INS-TEST-F3-38" TO PAR-NAME.
207700     MOVE   "VI-93 6.17.2" TO ANSI-REFERENCE.
207800     MOVE    ZERO TO WRK-DU-999-1.
207900     MOVE "E" TO WS-E.
208000     MOVE "AXESSA YEGTUASSW H S"  TO TEST-38-DATA.
208100     MOVE    ZERO TO REC-CT.
208200 INS-TEST-F3-38-0.
208300     INSPECT TEST-38-DATA TALLYING WRK-DU-999-1
208400             FOR
208500             ALL "A" AFTER WS-E
208600                 "A" AFTER "T"
208700                 "S" AFTER WS-E
208800                 "S" AFTER "T".
208900 INS-TEST-F3-38-1.
209000     IF      WRK-DU-999-1 = 7
209100             PERFORM PASS
209200             GO TO   INS-WRITE-F3-38.
209300     GO TO   INS-FAIL-F3-38.
209400 INS-DELETE-F3-38.
209500     PERFORM DE-LETE.
209600     GO TO   INS-WRITE-F3-38.
209700 INS-FAIL-F3-38.
209800     PERFORM FAIL.
209900     MOVE    WRK-DU-999-1 TO COMPUTED-N.
210000     MOVE    7 TO CORRECT-N.
210100 INS-WRITE-F3-38.
210200     PERFORM PRINT-DETAIL.
210300*
210400 INS-INIT-F3-39.
210500*    ===-->  MULTIPLE OPERANDS FOR "LEADING"     <--===
210600     MOVE   "INS-TEST-F3-39" TO PAR-NAME.
210700     MOVE   "VI-93 6.17.2" TO ANSI-REFERENCE.
210800     MOVE    ZERO TO WRK-DU-999-1.
210900     MOVE "ABESSA YE TUTCGW H S" TO TEST-39-DATA.
211000 INS-TEST-F3-39-0.
211100     INSPECT TEST-39-DATA
211200             TALLYING   WRK-DU-999-1
211300             FOR        LEADING "B"
211400                        LEADING WS-E
211500                        BEFORE  "C"
211600             REPLACING
211700             CHARACTERS BY   "A" AFTER "X" BEFORE "Y"
211800             CHARACTERS BY SPACE AFTER "G" BEFORE "H".
211900 INS-TEST-F3-39-1.
212000     IF      WRK-DU-999-1 = 0
212100             PERFORM PASS
212200             GO TO   INS-WRITE-F3-39-1.
212300     GO TO   INS-FAIL-F3-39-1.
212400 INS-DELETE-F3-39-1.
212500     PERFORM DE-LETE.
212600     GO TO   INS-WRITE-F3-39-1.
212700 INS-FAIL-F3-39-1.
212800     PERFORM FAIL.
212900     MOVE    WRK-DU-999-1 TO COMPUTED-N.
213000     MOVE    0            TO CORRECT-N.
213100 INS-WRITE-F3-39-1.
213200     PERFORM PRINT-DETAIL.
213300*
213400 INS-INIT-F4-40.
213500*    ===-->        INSPECT CONVERTING            <--===
213600     MOVE   "INS-TEST-F4-40" TO PAR-NAME.
213700     MOVE   "VI-943" TO ANSI-REFERENCE.
213800     MOVE    ZERO TO WRK-DU-999-1.
213900     MOVE "GADQAUZTABAGA" TO TEST-40-DATA.
214000 INS-TEST-F4-40-0.
214100     INSPECT TEST-40-DATA
214200             CONVERTING "AU" TO "23" BEFORE "B" AFTER "Q".
214300     GO TO   INS-TEST-F4-40-1.
214400 INS-DELETE-F4-40.
214500     PERFORM DE-LETE.
214600     PERFORM PRINT-DETAIL.
214700     GO TO   INS-INIT-F4-41.
214800 INS-TEST-F4-40-1.
214900     IF      TEST-40-DATA = "GADQ23ZT2BAGA"
215000             PERFORM PASS
215100             GO TO INS-WRITE-F4-40-1
215200     ELSE
215300             GO TO INS-FAIL-F4-40-1.
215400 INS-DELETE-F4-40-1.
215500     PERFORM DE-LETE.
215600     GO TO INS-WRITE-F4-40-1.
215700 INS-FAIL-F4-40-1.
215800     MOVE   "GADQ23ZT2BAGA" TO CORRECT-A
215900     MOVE    TEST-40-DATA TO COMPUTED-A
216000     PERFORM FAIL.
216100 INS-WRITE-F4-40-1.
216200     PERFORM PRINT-DETAIL.
216300 INS-INIT-F4-41.
216400*    ===-->        INSPECT CONVERTING            <--===
216500     MOVE   "INS-TEST-F4-41" TO PAR-NAME.
216600     MOVE   "VI-943" TO ANSI-REFERENCE.
216700     MOVE   "GADQ23ZT2BAGA"  TO TEST-40-DATA.
216800     MOVE   "DF" TO XN-DF.
216900     MOVE    ZERO TO WRK-DU-999-1.
217000 INS-TEST-F4-41-0.
217100     INSPECT TEST-40-DATA
217200             CONVERTING XN-DF TO "45".
217300     GO TO   INS-TEST-F4-41-1.
217400 INS-DELETE-F4-41.
217500     PERFORM DE-LETE.
217600     PERFORM PRINT-DETAIL.
217700     GO TO   INS-INIT-F4-42.
217800 INS-TEST-F4-41-1.
217900     IF      TEST-40-DATA = "GA4Q23ZT2BAGA"
218000             PERFORM PASS
218100             GO TO INS-WRITE-F4-41-1
218200     ELSE
218300             GO TO INS-FAIL-F4-41-1.
218400 INS-DELETE-F4-41-1.
218500     PERFORM DE-LETE.
218600     GO TO INS-WRITE-F4-41-1.
218700 INS-FAIL-F4-41-1.
218800     MOVE   "GA4Q23ZT2BAGA" TO CORRECT-A
218900     MOVE    TEST-40-DATA TO COMPUTED-A
219000     PERFORM FAIL.
219100 INS-WRITE-F4-41-1.
219200     PERFORM PRINT-DETAIL.
219300*
219400 INS-INIT-F4-42.
219500*    ===-->        INSPECT CONVERTING            <--===
219600     MOVE   "INS-TEST-F4-42" TO PAR-NAME.
219700     MOVE   "VI-943" TO ANSI-REFERENCE.
219800     MOVE    ZERO TO WRK-DU-999-1.
219900     MOVE   "GA4Q23ZT2BAGA" TO TEST-40-DATA.
220000     MOVE   "67" TO XN-67.
220100 INS-TEST-F4-42-0.
220200     INSPECT TEST-40-DATA
220300             CONVERTING  "GA" TO XN-67 BEFORE XN-B.
220400     GO TO   INS-TEST-F4-42-1.
220500 INS-DELETE-F4-42.
220600     PERFORM DE-LETE.
220700     PERFORM PRINT-DETAIL.
220800     GO TO   CCVS-EXIT.
220900 INS-TEST-F4-42-1.
221000     IF      TEST-40-DATA = "674Q23ZT2BAGA"
221100             PERFORM PASS
221200             GO TO INS-WRITE-F4-42-1
221300     ELSE
221400             GO TO INS-FAIL-F4-42-1.
221500 INS-DELETE-F4-42-1.
221600     PERFORM DE-LETE.
221700     GO TO INS-WRITE-F4-42-1.
221800 INS-FAIL-F4-42-1.
221900     MOVE   "674Q23ZT2BAGA" TO CORRECT-A
222000     MOVE    TEST-40-DATA TO COMPUTED-A
222100     PERFORM FAIL.
222200 INS-WRITE-F4-42-1.
222300     PERFORM PRINT-DETAIL.
222400*
222500 CCVS-EXIT SECTION.
222600 CCVS-999999.
222700     GO TO CLOSE-FILES.
