000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC218A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM NC218A TESTS TYHE USE OF THE "UNSTRING" STATEMENT *
002300*    INCLUDING THE OPTIONAL PHRASES "POINTER", "TALLYING",     *
002400*    "OVERFLOW", "NOT OVERFLOW" AND "END-STRING".              *
002500*                                                              *
002600****************************************************************
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 WORKING-STORAGE SECTION.
004300 01  WRK-XN-00001-1       PIC X.
004400 01  WRK-XN-00001-2       PIC X.
004500 01  WRK-XN-00001-3       PIC X.
004600 01  ZERO-XN-1 PIC X VALUE "0".
004700 01  GRP1-XN-6 PIC X(6) VALUE "ABCDEF".
004800 01  ID1-XN-7 PIC X(7) VALUE "1200000".
004900 01  GRP1-XN-7 PIC X(7) VALUE "ABCDEFG".
005000 01  GRP1-XN-10 PIC X(10) VALUE "ABCDEFGHIJ".
005100 01  ID1-XN-12 PIC X(12) VALUE "ABCDEFGHIJKL".
005200 01  GRP1-XN-36 PIC X(36) VALUE
005300     "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789".
005400 01  GRP1-XN-X-36 REDEFINES GRP1-XN-36.
005500     10 ID1 PIC X(6) OCCURS 6 TIMES.
005600 01  GRP2-XN-2 PIC XX VALUE "CE".
005700 01  GRP2-XN-X-2 REDEFINES GRP2-XN-2.
005800     10 ID2A PIC X OCCURS 2 TIMES.
005900 01  GRP2-XN-7 PIC X(7) VALUE "BCDEFGH".
006000 01  GRP2-XN-X-7 REDEFINES GRP2-XN-7.
006100     10 ID2 PIC X OCCURS 7 TIMES.
006200 01  ID4-X PIC X VALUE SPACE.
006300 01  ID4-XJ PIC X JUSTIFIED RIGHT VALUE SPACE.
006400 01  ID4-XXX  PIC XXX VALUE SPACES.
006500 01  ID4-XXXJ PIC XXX JUST RIGHT VALUE SPACES.
006600 01  ID4-DU-1V0 PIC 9 VALUE ZERO.
006700 01  ID4-DS-1V0 PIC S9 VALUE ZERO.
006800 01  ID4-DU-2V0 PIC 99 VALUE ZERO.
006900 01  ID4-DS-2V0 PIC S99 VALUE ZERO.
007000 01  ID4-DS-TS-1V0 PIC S9 TRAILING VALUE ZERO.
007100 01  ID4-DS-LS-1V0 PIC S9 LEADING VALUE ZERO.
007200 01  GRP4-XN-6.
007300     10 ID4A-XXXXX PIC X(5).
007400     10 ID4B-X PIC X.
007500 01  ID4C-XXXX PIC X(4) VALUE SPACES.
007600 01  ID4D-X PIC X VALUE SPACE.
007700 01  GRP4-XN-10.
007800     10 ID4A-X PIC X.
007900     10 ID4B-XX PIC XX.
008000     10 ID4C-XXX PIC XXX.
008100     10 ID4D-XXXX PIC XXXX.
008200 01  ASTER-XN-4 PIC X(4) VALUE "****".
008300 01  ID5-XN-4 PIC X(4) VALUE SPACES.
008400 01  ID5-XN-4-2 PIC X(4) VALUE SPACES.
008500 01  ID5-XN-6 PIC X(6) VALUE SPACES.
008600 01  ID6-DU-2V0 PIC 99 VALUE ZERO.
008700 01  ID6-DU-2V0-2  PIC 99 VALUE ZERO.
008800 01  ID10-DU-2V0 PIC 99 VALUE ZERO.
008900 01  ID11-DU-2V0 PIC 99 VALUE ZERO.
009000 01  TEST-RESULTS.
009100     02 FILLER                   PIC X      VALUE SPACE.
009200     02 FEATURE                  PIC X(20)  VALUE SPACE.
009300     02 FILLER                   PIC X      VALUE SPACE.
009400     02 P-OR-F                   PIC X(5)   VALUE SPACE.
009500     02 FILLER                   PIC X      VALUE SPACE.
009600     02  PAR-NAME.
009700       03 FILLER                 PIC X(19)  VALUE SPACE.
009800       03  PARDOT-X              PIC X      VALUE SPACE.
009900       03 DOTVALUE               PIC 99     VALUE ZERO.
010000     02 FILLER                   PIC X(8)   VALUE SPACE.
010100     02 RE-MARK                  PIC X(61).
010200 01  TEST-COMPUTED.
010300     02 FILLER                   PIC X(30)  VALUE SPACE.
010400     02 FILLER                   PIC X(17)  VALUE
010500            "       COMPUTED=".
010600     02 COMPUTED-X.
010700     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
010800     03 COMPUTED-N               REDEFINES COMPUTED-A
010900                                 PIC -9(9).9(9).
011000     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
011100     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
011200     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
011300     03       CM-18V0 REDEFINES COMPUTED-A.
011400         04 COMPUTED-18V0                    PIC -9(18).
011500         04 FILLER                           PIC X.
011600     03 FILLER PIC X(50) VALUE SPACE.
011700 01  TEST-CORRECT.
011800     02 FILLER PIC X(30) VALUE SPACE.
011900     02 FILLER PIC X(17) VALUE "       CORRECT =".
012000     02 CORRECT-X.
012100     03 CORRECT-A                  PIC X(20) VALUE SPACE.
012200     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
012300     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
012400     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
012500     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
012600     03      CR-18V0 REDEFINES CORRECT-A.
012700         04 CORRECT-18V0                     PIC -9(18).
012800         04 FILLER                           PIC X.
012900     03 FILLER PIC X(2) VALUE SPACE.
013000     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
013100 01  CCVS-C-1.
013200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
013300-    "SS  PARAGRAPH-NAME
013400-    "       REMARKS".
013500     02 FILLER                     PIC X(20)    VALUE SPACE.
013600 01  CCVS-C-2.
013700     02 FILLER                     PIC X        VALUE SPACE.
013800     02 FILLER                     PIC X(6)     VALUE "TESTED".
013900     02 FILLER                     PIC X(15)    VALUE SPACE.
014000     02 FILLER                     PIC X(4)     VALUE "FAIL".
014100     02 FILLER                     PIC X(94)    VALUE SPACE.
014200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
014300 01  REC-CT                        PIC 99       VALUE ZERO.
014400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
014500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
014600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
014700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
015000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
015100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
015200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
015300 01  CCVS-H-1.
015400     02  FILLER                    PIC X(39)    VALUE SPACES.
015500     02  FILLER                    PIC X(42)    VALUE
015600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
015700     02  FILLER                    PIC X(39)    VALUE SPACES.
015800 01  CCVS-H-2A.
015900   02  FILLER                        PIC X(40)  VALUE SPACE.
016000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
016100   02  FILLER                        PIC XXXX   VALUE
016200     "4.2 ".
016300   02  FILLER                        PIC X(28)  VALUE
016400            " COPY - NOT FOR DISTRIBUTION".
016500   02  FILLER                        PIC X(41)  VALUE SPACE.
016600
016700 01  CCVS-H-2B.
016800   02  FILLER                        PIC X(15)  VALUE
016900            "TEST RESULT OF ".
017000   02  TEST-ID                       PIC X(9).
017100   02  FILLER                        PIC X(4)   VALUE
017200            " IN ".
017300   02  FILLER                        PIC X(12)  VALUE
017400     " HIGH       ".
017500   02  FILLER                        PIC X(22)  VALUE
017600            " LEVEL VALIDATION FOR ".
017700   02  FILLER                        PIC X(58)  VALUE
017800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017900 01  CCVS-H-3.
018000     02  FILLER                      PIC X(34)  VALUE
018100            " FOR OFFICIAL USE ONLY    ".
018200     02  FILLER                      PIC X(58)  VALUE
018300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
018400     02  FILLER                      PIC X(28)  VALUE
018500            "  COPYRIGHT   1985 ".
018600 01  CCVS-E-1.
018700     02 FILLER                       PIC X(52)  VALUE SPACE.
018800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018900     02 ID-AGAIN                     PIC X(9).
019000     02 FILLER                       PIC X(45)  VALUE SPACES.
019100 01  CCVS-E-2.
019200     02  FILLER                      PIC X(31)  VALUE SPACE.
019300     02  FILLER                      PIC X(21)  VALUE SPACE.
019400     02 CCVS-E-2-2.
019500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
019600         03 FILLER                   PIC X      VALUE SPACE.
019700         03 ENDER-DESC               PIC X(44)  VALUE
019800            "ERRORS ENCOUNTERED".
019900 01  CCVS-E-3.
020000     02  FILLER                      PIC X(22)  VALUE
020100            " FOR OFFICIAL USE ONLY".
020200     02  FILLER                      PIC X(12)  VALUE SPACE.
020300     02  FILLER                      PIC X(58)  VALUE
020400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020500     02  FILLER                      PIC X(13)  VALUE SPACE.
020600     02 FILLER                       PIC X(15)  VALUE
020700             " COPYRIGHT 1985".
020800 01  CCVS-E-4.
020900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
021000     02 FILLER                       PIC X(4)   VALUE " OF ".
021100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
021200     02 FILLER                       PIC X(40)  VALUE
021300      "  TESTS WERE EXECUTED SUCCESSFULLY".
021400 01  XXINFO.
021500     02 FILLER                       PIC X(19)  VALUE
021600            "*** INFORMATION ***".
021700     02 INFO-TEXT.
021800       04 FILLER                     PIC X(8)   VALUE SPACE.
021900       04 XXCOMPUTED                 PIC X(20).
022000       04 FILLER                     PIC X(5)   VALUE SPACE.
022100       04 XXCORRECT                  PIC X(20).
022200     02 INF-ANSI-REFERENCE           PIC X(48).
022300 01  HYPHEN-LINE.
022400     02 FILLER  PIC IS X VALUE IS SPACE.
022500     02 FILLER  PIC IS X(65)    VALUE IS "************************
022600-    "*****************************************".
022700     02 FILLER  PIC IS X(54)    VALUE IS "************************
022800-    "******************************".
022900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
023000     "NC218A".
023100 PROCEDURE DIVISION.
023200 CCVS1 SECTION.
023300 OPEN-FILES.
023400     OPEN     OUTPUT PRINT-FILE.
023500     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
023600     MOVE    SPACE TO TEST-RESULTS.
023700     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023800     GO TO CCVS1-EXIT.
023900 CLOSE-FILES.
024000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
024100 TERMINATE-CCVS.
024200S    EXIT PROGRAM.
024300STERMINATE-CALL.
024400     STOP     RUN.
024500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
024600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
024700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
024800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
024900     MOVE "****TEST DELETED****" TO RE-MARK.
025000 PRINT-DETAIL.
025100     IF REC-CT NOT EQUAL TO ZERO
025200             MOVE "." TO PARDOT-X
025300             MOVE REC-CT TO DOTVALUE.
025400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
025500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
025600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
025700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
025800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
025900     MOVE SPACE TO CORRECT-X.
026000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
026100     MOVE     SPACE TO RE-MARK.
026200 HEAD-ROUTINE.
026300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026700 COLUMN-NAMES-ROUTINE.
026800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
027100 END-ROUTINE.
027200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
027300 END-RTN-EXIT.
027400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027500 END-ROUTINE-1.
027600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
027700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
027800      ADD PASS-COUNTER TO ERROR-HOLD.
027900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
028000      MOVE PASS-COUNTER TO CCVS-E-4-1.
028100      MOVE ERROR-HOLD TO CCVS-E-4-2.
028200      MOVE CCVS-E-4 TO CCVS-E-2-2.
028300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
028400  END-ROUTINE-12.
028500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
028600     IF       ERROR-COUNTER IS EQUAL TO ZERO
028700         MOVE "NO " TO ERROR-TOTAL
028800         ELSE
028900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
029000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
029100     PERFORM WRITE-LINE.
029200 END-ROUTINE-13.
029300     IF DELETE-COUNTER IS EQUAL TO ZERO
029400         MOVE "NO " TO ERROR-TOTAL  ELSE
029500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
029600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
029700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029800      IF   INSPECT-COUNTER EQUAL TO ZERO
029900          MOVE "NO " TO ERROR-TOTAL
030000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
030100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
030200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030400 WRITE-LINE.
030500     ADD 1 TO RECORD-COUNT.
030600Y    IF RECORD-COUNT GREATER 50
030700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
030800Y        MOVE SPACE TO DUMMY-RECORD
030900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
031000Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
031100Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
031200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
031300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
031400Y        MOVE ZERO TO RECORD-COUNT.
031500     PERFORM WRT-LN.
031600 WRT-LN.
031700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031800     MOVE SPACE TO DUMMY-RECORD.
031900 BLANK-LINE-PRINT.
032000     PERFORM WRT-LN.
032100 FAIL-ROUTINE.
032200     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032700     MOVE   SPACES TO INF-ANSI-REFERENCE.
032800     GO TO  FAIL-ROUTINE-EX.
032900 FAIL-ROUTINE-WRITE.
033000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
033100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
033200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
033300     MOVE   SPACES TO COR-ANSI-REFERENCE.
033400 FAIL-ROUTINE-EX. EXIT.
033500 BAIL-OUT.
033600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033800 BAIL-OUT-WRITE.
033900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
034000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
034100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034200     MOVE   SPACES TO INF-ANSI-REFERENCE.
034300 BAIL-OUT-EX. EXIT.
034400 CCVS1-EXIT.
034500     EXIT.
034600 SECT-NC218A-001 SECTION.
034700
034800 UST-INIT-GF-1.
034900     MOVE   "VI-135" TO ANSI-REFERENCE.
035000     MOVE   "UST-TEST-GF-1" TO PAR-NAME.
035100     MOVE   "PIC X " TO FEATURE.
035200     MOVE    ZERO TO ID4-X.
035300     MOVE   "1200000" TO ID1-XN-7.
035400     MOVE    "****" TO ID5-XN-4.
035500     MOVE    ZERO TO ID6-DU-2V0.
035600     MOVE    1 TO ID10-DU-2V0.
035700     MOVE    ZERO TO ID11-DU-2V0.
035800     MOVE    1 TO REC-CT.
035900 UST-TEST-GF-1.
036000     UNSTRING ID1-XN-7 DELIMITED BY ZERO
036100              INTO ID4-X DELIMITER IN ID5-XN-4
036200              COUNT IN ID6-DU-2V0
036300              WITH POINTER ID10-DU-2V0
036400              TALLYING ID11-DU-2V0
036500              ON OVERFLOW  PERFORM PASS
036600                           GO TO UST-WRITE-GF-1.
036700     GO TO UST-FAIL-GF-1.
036800 UST-DELETE-GF-1.
036900     PERFORM DE-LETE.
037000     PERFORM PRINT-DETAIL.
037100     GO      TO UST-INIT-GF-2.
037200 UST-FAIL-GF-1.
037300     PERFORM FAIL.
037400     MOVE    "OVERFLOW SHOULD OCCUR" TO RE-MARK.
037500 UST-WRITE-GF-1.
037600     PERFORM PRINT-DETAIL.
037700*
037800 UST-TEST-GF-1-1.
037900     ADD     1 TO REC-CT.
038000     IF      ID4-X = "1"
038100             PERFORM PASS
038200             GO TO UST-WRITE-GF-1-1
038300     ELSE
038400             GO TO UST-FAIL-GF-1-1.
038500 UST-DELETE-GF-1-1.
038600     PERFORM DE-LETE.
038700     GO TO UST-WRITE-GF-1-1.
038800 UST-FAIL-GF-1-1.
038900     PERFORM FAIL
039000     MOVE    ID4-X TO COMPUTED-A
039100     MOVE    "1" TO CORRECT-A.
039200 UST-WRITE-GF-1-1.
039300     PERFORM PRINT-DETAIL.
039400*
039500 UST-TEST-GF-1-2.
039600     ADD     1 TO REC-CT.
039700     IF      ID5-XN-4 = "0   "
039800             PERFORM PASS
039900             GO TO UST-WRITE-GF-1-2
040000     ELSE
040100             GO TO UST-FAIL-GF-1-2.
040200 UST-DELETE-GF-1-2.
040300     PERFORM DE-LETE.
040400     GO TO UST-WRITE-GF-1-2.
040500 UST-FAIL-GF-1-2.
040600     PERFORM FAIL
040700     MOVE    ID5-XN-4 TO COMPUTED-A
040800     MOVE    "0   " TO CORRECT-A.
040900 UST-WRITE-GF-1-2.
041000     PERFORM PRINT-DETAIL.
041100*
041200 UST-TEST-GF-1-3.
041300     ADD     1 TO REC-CT.
041400     IF      ID6-DU-2V0 = 2
041500             PERFORM PASS
041600             GO TO UST-WRITE-GF-1-3
041700     ELSE
041800             GO TO UST-FAIL-GF-1-3.
041900 UST-DELETE-GF-1-3.
042000     PERFORM DE-LETE.
042100     GO TO UST-WRITE-GF-1-3.
042200 UST-FAIL-GF-1-3.
042300     PERFORM FAIL
042400     MOVE    ID6-DU-2V0 TO COMPUTED-N
042500     MOVE    2 TO CORRECT-N.
042600 UST-WRITE-GF-1-3.
042700     PERFORM PRINT-DETAIL.
042800*
042900 UST-TEST-GF-1-4.
043000     ADD     1 TO REC-CT.
043100     IF      ID10-DU-2V0 = 4
043200             PERFORM PASS
043300             GO TO UST-WRITE-GF-1-4
043400     ELSE
043500             GO TO UST-FAIL-GF-1-4.
043600 UST-DELETE-GF-1-4.
043700     PERFORM DE-LETE.
043800     GO TO UST-WRITE-GF-1-4.
043900 UST-FAIL-GF-1-4.
044000     PERFORM FAIL
044100     MOVE    ID10-DU-2V0 TO COMPUTED-N
044200     MOVE    4 TO CORRECT-N.
044300 UST-WRITE-GF-1-4.
044400     PERFORM PRINT-DETAIL.
044500*
044600 UST-TEST-GF-1-5.
044700     ADD     1 TO REC-CT.
044800     IF      ID11-DU-2V0 = 1
044900             PERFORM PASS
045000             GO TO UST-WRITE-GF-1-5
045100     ELSE
045200             GO TO UST-FAIL-GF-1-5.
045300 UST-DELETE-GF-1-5.
045400     PERFORM DE-LETE.
045500     GO TO UST-WRITE-GF-1-5.
045600 UST-FAIL-GF-1-5.
045700     PERFORM FAIL
045800     MOVE    ID11-DU-2V0 TO COMPUTED-N
045900     MOVE    1 TO CORRECT-N.
046000 UST-WRITE-GF-1-5.
046100     PERFORM PRINT-DETAIL.
046200*
046300 UST-INIT-GF-2.
046400     MOVE    "UST-TEST-GF-2" TO PAR-NAME.
046500     MOVE    "VI-135" TO ANSI-REFERENCE.
046600     MOVE    "PIC X JUST" TO FEATURE.
046700     MOVE    "1200000" TO ID1-XN-7.
046800     MOVE    ZERO TO ID4-XJ.
046900     MOVE    "****" TO ID5-XN-4.
047000     MOVE    ZERO TO ID6-DU-2V0.
047100     MOVE    1 TO ID10-DU-2V0.
047200     MOVE    ZERO TO ID11-DU-2V0.
047300     MOVE    1 TO REC-CT.
047400*
047500 UST-TEST-GF-2.
047600     UNSTRING ID1-XN-7 DELIMITED ZERO INTO ID4-XJ
047700             DELIMITER ID5-XN-4
047800             COUNT ID6-DU-2V0
047900             POINTER ID10-DU-2V0
048000             TALLYING ID11-DU-2V0
048100             OVERFLOW PERFORM PASS
048200                      GO TO UST-WRITE-GF-2.
048300     GO TO UST-FAIL-GF-2.
048400 UST-DELETE-GF-2.
048500     PERFORM DE-LETE.
048600     PERFORM PRINT-DETAIL.
048700     GO      TO UST-INIT-GF-3.
048800 UST-FAIL-GF-2.
048900     PERFORM FAIL.
049000     MOVE    "OVERFLOW SHOULD HAVE OCCURED" TO RE-MARK.
049100 UST-WRITE-GF-2.
049200     PERFORM PRINT-DETAIL.
049300*
049400 UST-TEST-GF-2-1.
049500     ADD     1 TO REC-CT.
049600     IF      ID4-XJ = "2"
049700             PERFORM PASS
049800             GO TO UST-WRITE-GF-2-1
049900     ELSE
050000             GO TO UST-FAIL-GF-2-1.
050100 UST-DELETE-GF-2-1.
050200     PERFORM DE-LETE.
050300     GO TO UST-WRITE-GF-2-1.
050400 UST-FAIL-GF-2-1.
050500     PERFORM FAIL
050600     MOVE    ID4-XJ TO COMPUTED-A
050700     MOVE    "2" TO CORRECT-A.
050800 UST-WRITE-GF-2-1.
050900     PERFORM PRINT-DETAIL.
051000*
051100 UST-TEST-GF-2-2.
051200     ADD     1 TO REC-CT.
051300     IF      ID5-XN-4 = "0   "
051400             PERFORM PASS
051500             GO TO UST-WRITE-GF-2-2
051600     ELSE
051700             GO TO UST-FAIL-GF-2-2.
051800 UST-DELETE-GF-2-2.
051900     PERFORM DE-LETE.
052000     GO TO UST-WRITE-GF-2-2.
052100 UST-FAIL-GF-2-2.
052200     PERFORM FAIL
052300     MOVE    ID5-XN-4 TO COMPUTED-A
052400     MOVE    "0   " TO CORRECT-A.
052500 UST-WRITE-GF-2-2.
052600     PERFORM PRINT-DETAIL.
052700*
052800 UST-TEST-GF-2-3.
052900     ADD     1 TO REC-CT.
053000     IF      ID6-DU-2V0 = 2
053100             PERFORM PASS
053200             GO TO UST-WRITE-GF-2-3
053300     ELSE
053400             GO TO UST-FAIL-GF-2-3.
053500 UST-DELETE-GF-2-3.
053600     PERFORM DE-LETE.
053700     GO TO UST-WRITE-GF-2-3.
053800 UST-FAIL-GF-2-3.
053900     PERFORM FAIL
054000     MOVE    ID6-DU-2V0 TO COMPUTED-N
054100     MOVE    2 TO CORRECT-N.
054200 UST-WRITE-GF-2-3.
054300     PERFORM PRINT-DETAIL.
054400*
054500 UST-TEST-GF-2-4.
054600     ADD     1 TO REC-CT.
054700     IF      ID10-DU-2V0 = 4
054800             PERFORM PASS
054900             GO TO UST-WRITE-GF-2-4
055000     ELSE
055100             GO TO UST-FAIL-GF-2-4.
055200 UST-DELETE-GF-2-4.
055300     PERFORM DE-LETE.
055400     GO TO UST-WRITE-GF-2-4.
055500 UST-FAIL-GF-2-4.
055600     PERFORM FAIL
055700     MOVE    ID10-DU-2V0 TO COMPUTED-N
055800     MOVE    4 TO CORRECT-N.
055900 UST-WRITE-GF-2-4.
056000     PERFORM PRINT-DETAIL.
056100*
056200 UST-TEST-GF-2-5.
056300     ADD     1 TO REC-CT.
056400     IF      ID11-DU-2V0 = 1
056500             PERFORM PASS
056600             GO TO UST-WRITE-GF-2-5
056700     ELSE
056800             GO TO UST-FAIL-GF-2-5.
056900 UST-DELETE-GF-2-5.
057000     PERFORM DE-LETE.
057100     GO TO UST-WRITE-GF-2-5.
057200 UST-FAIL-GF-2-5.
057300     PERFORM FAIL
057400     MOVE    ID11-DU-2V0 TO COMPUTED-N
057500     MOVE    1 TO CORRECT-N.
057600 UST-WRITE-GF-2-5.
057700     PERFORM PRINT-DETAIL.
057800*
057900 UST-INIT-GF-3.
058000     MOVE    "UST-TEST-GF-3" TO PAR-NAME.
058100     MOVE    "VI-135" TO ANSI-REFERENCE.
058200     MOVE    "PIC XXX" TO FEATURE.
058300     MOVE    "1200000" TO ID1-XN-7.
058400     MOVE    ZERO TO ID4-XXX.
058500     MOVE    "****" TO ID5-XN-4.
058600     MOVE    ZERO TO ID6-DU-2V0.
058700     MOVE    1 TO ID10-DU-2V0.
058800     MOVE    ZERO TO ID11-DU-2V0.
058900     MOVE    1 TO REC-CT.
059000*
059100 UST-TEST-GF-3.
059200     UNSTRING ID1-XN-7 DELIMITED "0" INTO ID4-XXX
059300              DELIMITER ID5-XN-4
059400              COUNT ID6-DU-2V0
059500              POINTER ID10-DU-2V0
059600              TALLYING ID11-DU-2V0.
059700     GO TO UST-TEST-GF-3-1.
059800 UST-DELETE-GF-3.
059900     PERFORM DE-LETE.
060000     PERFORM PRINT-DETAIL.
060100     GO      TO UST-INIT-GF-4.
060200*
060300 UST-TEST-GF-3-1.
060400     IF      ID4-XXX = "12  "
060500             PERFORM PASS
060600             GO TO UST-WRITE-GF-3-1
060700     ELSE
060800             GO TO UST-FAIL-GF-3-1.
060900 UST-DELETE-GF-3-1.
061000     PERFORM DE-LETE.
061100     GO TO UST-WRITE-GF-3-1.
061200 UST-FAIL-GF-3-1.
061300     PERFORM FAIL
061400     MOVE    ID4-XXX TO COMPUTED-A
061500     MOVE    "12  " TO CORRECT-A.
061600 UST-WRITE-GF-3-1.
061700     PERFORM PRINT-DETAIL.
061800*
061900 UST-TEST-GF-3-2.
062000     ADD     1 TO REC-CT.
062100     IF      ID5-XN-4 = "0   "
062200             PERFORM PASS
062300             GO TO UST-WRITE-GF-3-2
062400     ELSE
062500             GO TO UST-FAIL-GF-3-2.
062600 UST-DELETE-GF-3-2.
062700     PERFORM DE-LETE.
062800     GO TO UST-WRITE-GF-3-2.
062900 UST-FAIL-GF-3-2.
063000     PERFORM FAIL
063100     MOVE    ID5-XN-4 TO COMPUTED-A
063200     MOVE    "0   " TO CORRECT-A.
063300 UST-WRITE-GF-3-2.
063400     PERFORM PRINT-DETAIL.
063500*
063600 UST-TEST-GF-3-3.
063700     ADD     1 TO REC-CT.
063800     IF      ID6-DU-2V0 = 2
063900             PERFORM PASS
064000             GO TO UST-WRITE-GF-3-3
064100     ELSE
064200             GO TO UST-FAIL-GF-3-3.
064300 UST-DELETE-GF-3-3.
064400     PERFORM DE-LETE.
064500     GO TO UST-WRITE-GF-3-3.
064600 UST-FAIL-GF-3-3.
064700     PERFORM FAIL
064800     MOVE    ID6-DU-2V0 TO COMPUTED-N
064900     MOVE    2 TO CORRECT-N.
065000 UST-WRITE-GF-3-3.
065100     PERFORM PRINT-DETAIL.
065200*
065300 UST-TEST-GF-3-4.
065400     ADD     1 TO REC-CT.
065500     IF      ID10-DU-2V0 = 4
065600             PERFORM PASS
065700             GO TO UST-WRITE-GF-3-4
065800     ELSE
065900             GO TO UST-FAIL-GF-3-4.
066000 UST-DELETE-GF-3-4.
066100     PERFORM DE-LETE.
066200     GO TO UST-WRITE-GF-3-4.
066300 UST-FAIL-GF-3-4.
066400     PERFORM FAIL
066500     MOVE    ID10-DU-2V0 TO COMPUTED-N
066600     MOVE    4 TO CORRECT-N.
066700 UST-WRITE-GF-3-4.
066800     PERFORM PRINT-DETAIL.
066900*
067000 UST-TEST-GF-3-5.
067100     ADD     1 TO REC-CT.
067200     IF      ID11-DU-2V0 = 1
067300             PERFORM PASS
067400             GO TO UST-WRITE-GF-3-5
067500     ELSE
067600             GO TO UST-FAIL-GF-3-5.
067700 UST-DELETE-GF-3-5.
067800     PERFORM DE-LETE.
067900     GO TO UST-WRITE-GF-3-5.
068000 UST-FAIL-GF-3-5.
068100     PERFORM FAIL
068200     MOVE    ID11-DU-2V0 TO COMPUTED-N
068300     MOVE    1 TO CORRECT-N.
068400 UST-WRITE-GF-3-5.
068500     PERFORM PRINT-DETAIL.
068600*
068700 UST-INIT-GF-4.
068800     MOVE    "UST-TEST-GF-4" TO PAR-NAME.
068900     MOVE    "VI-135" TO ANSI-REFERENCE.
069000     MOVE    "PIC XXX JUST" TO FEATURE.
069100     MOVE    "1200000" TO ID1-XN-7.
069200     MOVE    "0" TO ZERO-XN-1.
069300     MOVE    ZERO TO ID4-XXXJ.
069400     MOVE    "****" TO ID5-XN-4.
069500     MOVE    ZERO TO ID6-DU-2V0.
069600     MOVE    1 TO ID10-DU-2V0.
069700     MOVE    ZERO TO ID11-DU-2V0.
069800     MOVE    1 TO REC-CT.
069900*
070000 UST-TEST-GF-4.
070100     UNSTRING ID1-XN-7 DELIMITED BY ZERO-XN-1 INTO ID4-XXXJ
070200              DELIMITER ID5-XN-4
070300              COUNT IN ID6-DU-2V0
070400              POINTER ID10-DU-2V0
070500              TALLYING IN ID11-DU-2V0.
070600     GO TO UST-TEST-GF-4-1.
070700 UST-DELETE-GF-4.
070800     PERFORM DE-LETE.
070900     PERFORM PRINT-DETAIL.
071000     GO      TO UST-INIT-GF-5.
071100*
071200 UST-TEST-GF-4-1.
071300     IF      ID4-XXXJ = " 12"
071400             PERFORM PASS
071500             GO TO UST-WRITE-GF-4-1
071600     ELSE
071700             GO TO UST-FAIL-GF-4-1.
071800 UST-DELETE-GF-4-1.
071900     PERFORM DE-LETE.
072000     GO TO UST-WRITE-GF-4-1.
072100 UST-FAIL-GF-4-1.
072200     PERFORM FAIL
072300     MOVE    ID4-XXXJ TO COMPUTED-A
072400     MOVE    " 12" TO CORRECT-A.
072500 UST-WRITE-GF-4-1.
072600     PERFORM PRINT-DETAIL.
072700*
072800 UST-TEST-GF-4-2.
072900     ADD     1 TO REC-CT.
073000     IF      ID5-XN-4 = "0   "
073100             PERFORM PASS
073200             GO TO UST-WRITE-GF-4-2
073300     ELSE
073400             GO TO UST-FAIL-GF-4-2.
073500 UST-DELETE-GF-4-2.
073600     PERFORM DE-LETE.
073700     GO TO UST-WRITE-GF-4-2.
073800 UST-FAIL-GF-4-2.
073900     PERFORM FAIL
074000     MOVE    ID5-XN-4 TO COMPUTED-A
074100     MOVE "0   " TO CORRECT-A.
074200 UST-WRITE-GF-4-2.
074300     PERFORM PRINT-DETAIL.
074400*
074500 UST-TEST-GF-4-3.
074600     ADD     1 TO REC-CT.
074700     IF      ID6-DU-2V0 = 2
074800             PERFORM PASS
074900             GO TO UST-WRITE-GF-4-3
075000     ELSE
075100             GO TO UST-FAIL-GF-4-3.
075200 UST-DELETE-GF-4-3.
075300     PERFORM DE-LETE.
075400     GO TO UST-WRITE-GF-4-3.
075500 UST-FAIL-GF-4-3.
075600     PERFORM FAIL
075700     MOVE    ID6-DU-2V0 TO COMPUTED-N
075800     MOVE    2 TO CORRECT-N.
075900 UST-WRITE-GF-4-3.
076000     PERFORM PRINT-DETAIL.
076100*
076200 UST-TEST-GF-4-4.
076300     ADD     1 TO REC-CT.
076400     IF      ID10-DU-2V0 = 4
076500             PERFORM PASS
076600             GO TO UST-WRITE-GF-4-4
076700     ELSE
076800             GO TO UST-FAIL-GF-4-4.
076900 UST-DELETE-GF-4-4.
077000     PERFORM DE-LETE.
077100     GO TO UST-WRITE-GF-4-4.
077200 UST-FAIL-GF-4-4.
077300     PERFORM FAIL
077400     MOVE    ID10-DU-2V0 TO COMPUTED-N
077500     MOVE    4 TO CORRECT-N.
077600 UST-WRITE-GF-4-4.
077700     PERFORM PRINT-DETAIL.
077800*
077900 UST-TEST-GF-4-5.
078000     ADD     1 TO REC-CT.
078100     IF      ID11-DU-2V0 = 1
078200             PERFORM PASS
078300             GO TO UST-WRITE-GF-4-5
078400     ELSE
078500             GO TO UST-FAIL-GF-4-5.
078600 UST-DELETE-GF-4-5.
078700     PERFORM DE-LETE.
078800     GO TO UST-WRITE-GF-4-5.
078900 UST-FAIL-GF-4-5.
079000     PERFORM FAIL
079100     MOVE    ID11-DU-2V0 TO COMPUTED-N
079200     MOVE    1 TO CORRECT-N.
079300 UST-WRITE-GF-4-5.
079400     PERFORM PRINT-DETAIL.
079500*
079600 UST-INIT-GF-5.
079700     MOVE    "UST-TEST-GF-5" TO PAR-NAME.
079800     MOVE    "VI-135" TO ANSI-REFERENCE.
079900     MOVE    "PIC 9" TO FEATURE.
080000     MOVE    ZERO TO ID4-DU-1V0.
080100     MOVE    "****" TO ID5-XN-4.
080200     MOVE    ZERO TO ID6-DU-2V0.
080300     MOVE    "1200000" TO ID1-XN-7.
080400     MOVE    1 TO ID10-DU-2V0.
080500     MOVE    ZERO TO ID11-DU-2V0.
080600     MOVE    1 TO REC-CT.
080700*
080800 UST-TEST-GF-5.
080900     UNSTRING ID1-XN-7 DELIMITED "0" INTO ID4-DU-1V0
081000              DELIMITER IN ID5-XN-4
081100              COUNT ID6-DU-2V0
081200              WITH POINTER ID10-DU-2V0
081300              TALLYING ID11-DU-2V0.
081400     GO TO UST-TEST-GF-5-1.
081500 UST-DELETE-GF-5.
081600     PERFORM DE-LETE.
081700     PERFORM PRINT-DETAIL.
081800     GO      TO UST-INIT-GF-6.
081900*
082000 UST-TEST-GF-5-1.
082100     IF      ID4-DU-1V0 = 2
082200             PERFORM PASS
082300             GO TO UST-WRITE-GF-5-1
082400     ELSE
082500             GO TO UST-FAIL-GF-5-1.
082600 UST-DELETE-GF-5-1.
082700     PERFORM DE-LETE.
082800     GO TO UST-WRITE-GF-5-1.
082900 UST-FAIL-GF-5-1.
083000     PERFORM FAIL
083100     MOVE    ID4-DU-1V0 TO COMPUTED-N
083200     MOVE    2 TO CORRECT-N.
083300 UST-WRITE-GF-5-1.
083400     PERFORM PRINT-DETAIL.
083500*
083600 UST-TEST-GF-5-2.
083700     ADD     1 TO REC-CT.
083800     IF      ID5-XN-4 = "0   "
083900             PERFORM PASS
084000             GO TO UST-WRITE-GF-5-2
084100     ELSE
084200             GO TO UST-FAIL-GF-5-2.
084300 UST-DELETE-GF-5-2.
084400     PERFORM DE-LETE.
084500     GO TO UST-WRITE-GF-5-2.
084600 UST-FAIL-GF-5-2.
084700     PERFORM FAIL
084800     MOVE    ID5-XN-4 TO COMPUTED-A
084900     MOVE    "0   " TO CORRECT-A.
085000 UST-WRITE-GF-5-2.
085100     PERFORM PRINT-DETAIL.
085200*
085300 UST-TEST-GF-5-3.
085400     ADD     1 TO REC-CT.
085500     IF      ID6-DU-2V0 = 2
085600             PERFORM PASS
085700             GO TO UST-WRITE-GF-5-3
085800     ELSE
085900             GO TO UST-FAIL-GF-5-3.
086000 UST-DELETE-GF-5-3.
086100     PERFORM DE-LETE.
086200     GO TO UST-WRITE-GF-5-3.
086300 UST-FAIL-GF-5-3.
086400     PERFORM FAIL
086500     MOVE    ID6-DU-2V0 TO COMPUTED-N
086600     MOVE    2 TO CORRECT-N.
086700 UST-WRITE-GF-5-3.
086800     PERFORM PRINT-DETAIL.
086900*
087000 UST-TEST-GF-5-4.
087100     ADD     1 TO REC-CT.
087200     IF      ID10-DU-2V0 = 4
087300             PERFORM PASS
087400             GO TO UST-WRITE-GF-5-4
087500     ELSE
087600             GO TO UST-FAIL-GF-5-4.
087700 UST-DELETE-GF-5-4.
087800     PERFORM DE-LETE.
087900     GO TO UST-WRITE-GF-5-4.
088000 UST-FAIL-GF-5-4.
088100     PERFORM FAIL
088200     MOVE    ID10-DU-2V0 TO COMPUTED-N
088300     MOVE    4 TO CORRECT-N.
088400 UST-WRITE-GF-5-4.
088500     PERFORM PRINT-DETAIL.
088600*
088700 UST-TEST-GF-5-5.
088800     ADD     1 TO REC-CT.
088900     IF      ID11-DU-2V0 = 1
089000             PERFORM PASS
089100             GO TO UST-WRITE-GF-5-5
089200     ELSE
089300             GO TO UST-FAIL-GF-5-5.
089400 UST-DELETE-GF-5-5.
089500     PERFORM DE-LETE.
089600     GO TO UST-WRITE-GF-5-5.
089700 UST-FAIL-GF-5-5.
089800     PERFORM FAIL
089900     MOVE    ID11-DU-2V0 TO COMPUTED-N
090000     MOVE    1 TO CORRECT-N.
090100 UST-WRITE-GF-5-5.
090200     PERFORM PRINT-DETAIL.
090300*
090400 UST-INIT-GF-6.
090500     MOVE    "UST-TEST-GF-6" TO PAR-NAME.
090600     MOVE    "VI-135" TO ANSI-REFERENCE.
090700     MOVE    "PIC S9" TO FEATURE.
090800     MOVE    ZERO TO ID4-DS-1V0.
090900     MOVE    "****" TO ID5-XN-4.
091000     MOVE    ZERO TO ID6-DU-2V0.
091100     MOVE    "1200000" TO ID1-XN-7.
091200     MOVE    1 TO ID10-DU-2V0.
091300     MOVE    ZERO TO ID11-DU-2V0.
091400     MOVE    1 TO REC-CT.
091500*
091600 UST-TEST-GF-6.
091700     UNSTRING ID1-XN-7 DELIMITED BY ALL ZERO INTO ID4-DS-1V0
091800              DELIMITER ID5-XN-4
091900              COUNT ID6-DU-2V0
092000              POINTER ID10-DU-2V0
092100              TALLYING ID11-DU-2V0.
092200     GO TO UST-TEST-GF-6-1.
092300 UST-DELETE-GF-6.
092400     PERFORM DE-LETE.
092500     PERFORM PRINT-DETAIL.
092600     GO      TO UST-INIT-GF-7.
092700*
092800 UST-TEST-GF-6-1.
092900     IF      ID4-DS-1V0 = +2
093000             PERFORM PASS
093100             GO TO UST-WRITE-GF-6-1
093200     ELSE
093300             GO TO UST-FAIL-GF-6-1.
093400 UST-DELETE-GF-6-1.
093500     PERFORM DE-LETE.
093600     GO TO UST-WRITE-GF-6-1.
093700 UST-FAIL-GF-6-1.
093800     PERFORM FAIL
093900     MOVE    ID4-DS-1V0 TO COMPUTED-N
094000     MOVE    +2 TO CORRECT-N.
094100 UST-WRITE-GF-6-1.
094200     PERFORM PRINT-DETAIL.
094300*
094400 UST-TEST-GF-6-2.
094500     ADD     1 TO REC-CT.
094600     IF      ID5-XN-4 = "0   "
094700             PERFORM PASS
094800             GO TO UST-WRITE-GF-6-2
094900     ELSE
095000             GO TO UST-FAIL-GF-6-2.
095100 UST-DELETE-GF-6-2.
095200     PERFORM DE-LETE.
095300     GO TO UST-WRITE-GF-6-2.
095400 UST-FAIL-GF-6-2.
095500     PERFORM FAIL
095600     MOVE    ID5-XN-4 TO COMPUTED-A
095700     MOVE    "0   " TO CORRECT-A.
095800 UST-WRITE-GF-6-2.
095900     PERFORM PRINT-DETAIL.
096000*
096100 UST-TEST-GF-6-3.
096200     ADD     1 TO REC-CT.
096300     IF      ID6-DU-2V0 = 2
096400             PERFORM PASS
096500             GO TO UST-WRITE-GF-6-3
096600     ELSE
096700             GO TO UST-FAIL-GF-6-3.
096800 UST-DELETE-GF-6-3.
096900     PERFORM DE-LETE.
097000     GO TO UST-WRITE-GF-6-3.
097100 UST-FAIL-GF-6-3.
097200     PERFORM FAIL
097300     MOVE    ID6-DU-2V0 TO COMPUTED-N
097400     MOVE    2 TO CORRECT-N.
097500 UST-WRITE-GF-6-3.
097600     PERFORM PRINT-DETAIL.
097700*
097800 UST-TEST-GF-6-4.
097900     ADD     1 TO REC-CT.
098000     IF      ID10-DU-2V0 = 8
098100             PERFORM PASS
098200             GO TO UST-WRITE-GF-6-4
098300     ELSE
098400             GO TO UST-FAIL-GF-6-4.
098500 UST-DELETE-GF-6-4.
098600     PERFORM DE-LETE.
098700     GO TO UST-WRITE-GF-6-4.
098800 UST-FAIL-GF-6-4.
098900     PERFORM FAIL
099000     MOVE    ID10-DU-2V0 TO COMPUTED-N
099100     MOVE    8 TO CORRECT-N.
099200 UST-WRITE-GF-6-4.
099300     PERFORM PRINT-DETAIL.
099400*
099500 UST-TEST-GF-6-5.
099600     ADD     1 TO REC-CT.
099700     IF      ID11-DU-2V0 = 1
099800             PERFORM PASS
099900             GO TO UST-WRITE-GF-6-5
100000     ELSE
100100             GO TO UST-FAIL-GF-6-5.
100200 UST-DELETE-GF-6-5.
100300     PERFORM DE-LETE.
100400     GO TO UST-WRITE-GF-6-5.
100500 UST-FAIL-GF-6-5.
100600     PERFORM FAIL
100700     MOVE    ID11-DU-2V0 TO COMPUTED-N
100800     MOVE    1 TO CORRECT-N.
100900 UST-WRITE-GF-6-5.
101000     PERFORM PRINT-DETAIL.
101100*
101200 UST-INIT-GF-7.
101300     MOVE    "UST-TEST-GF-7" TO PAR-NAME.
101400     MOVE    "VI-135" TO ANSI-REFERENCE.
101500     MOVE    "PIC 99" TO FEATURE.
101600     MOVE    "1200000" TO ID1-XN-7.
101700     MOVE    ZERO TO ID4-DU-2V0.
101800     MOVE    "****" TO ID5-XN-4.
101900     MOVE    ZERO TO ID6-DU-2V0.
102000     MOVE    1 TO ID10-DU-2V0.
102100     MOVE    ZERO TO ID11-DU-2V0.
102200     MOVE    1 TO REC-CT.
102300*
102400 UST-TEST-GF-7.
102500     UNSTRING ID1-XN-7 DELIMITED ALL "0" INTO ID4-DU-2V0
102600             DELIMITER ID5-XN-4
102700             COUNT ID6-DU-2V0
102800             POINTER ID10-DU-2V0
102900             TALLYING ID11-DU-2V0.
103000     GO      TO UST-TEST-GF-7-1.
103100 UST-DELETE-GF-7.
103200     PERFORM DE-LETE.
103300     PERFORM PRINT-DETAIL.
103400     GO      TO UST-INIT-GF-8.
103500*
103600 UST-TEST-GF-7-1.
103700     IF      ID4-DU-2V0 = 12
103800             PERFORM PASS
103900             GO TO UST-WRITE-GF-7-1
104000     ELSE
104100             GO TO UST-FAIL-GF-7-1.
104200 UST-DELETE-GF-7-1.
104300     PERFORM DE-LETE.
104400     GO TO UST-WRITE-GF-7-1.
104500 UST-FAIL-GF-7-1.
104600     PERFORM FAIL
104700     MOVE    ID4-DU-2V0 TO COMPUTED-N
104800     MOVE    12 TO CORRECT-N.
104900 UST-WRITE-GF-7-1.
105000     PERFORM PRINT-DETAIL.
105100*
105200 UST-TEST-GF-7-2.
105300     ADD     1 TO REC-CT.
105400     IF      ID5-XN-4 = "0   "
105500             PERFORM PASS
105600             GO TO UST-WRITE-GF-7-2
105700     ELSE
105800             GO TO UST-FAIL-GF-7-2.
105900 UST-DELETE-GF-7-2.
106000     PERFORM DE-LETE.
106100     GO TO UST-WRITE-GF-7-2.
106200 UST-FAIL-GF-7-2.
106300     PERFORM FAIL
106400     MOVE    ID5-XN-4 TO COMPUTED-A
106500     MOVE    "0   " TO CORRECT-A.
106600 UST-WRITE-GF-7-2.
106700     PERFORM PRINT-DETAIL.
106800*
106900 UST-TEST-GF-7-3.
107000     ADD     1 TO REC-CT.
107100     IF      ID6-DU-2V0 = 2
107200             PERFORM PASS
107300             GO TO UST-WRITE-GF-7-3
107400     ELSE
107500             GO TO UST-FAIL-GF-7-3.
107600 UST-DELETE-GF-7-3.
107700     PERFORM DE-LETE.
107800     GO TO UST-WRITE-GF-7-3.
107900 UST-FAIL-GF-7-3.
108000     PERFORM FAIL
108100     MOVE    ID6-DU-2V0 TO COMPUTED-N
108200     MOVE    2 TO CORRECT-N.
108300 UST-WRITE-GF-7-3.
108400     PERFORM PRINT-DETAIL.
108500*
108600 UST-TEST-GF-7-4.
108700     ADD     1 TO REC-CT.
108800     IF      ID10-DU-2V0 = 8
108900             PERFORM PASS
109000             GO TO UST-WRITE-GF-7-4
109100     ELSE
109200             GO TO UST-FAIL-GF-7-4.
109300 UST-DELETE-GF-7-4.
109400     PERFORM DE-LETE.
109500     GO TO UST-WRITE-GF-7-4.
109600 UST-FAIL-GF-7-4.
109700     PERFORM FAIL
109800     MOVE    ID10-DU-2V0 TO COMPUTED-N
109900     MOVE    8 TO CORRECT-N.
110000 UST-WRITE-GF-7-4.
110100     PERFORM PRINT-DETAIL.
110200*
110300 UST-TEST-GF-7-5.
110400     ADD     1 TO REC-CT.
110500     IF      ID11-DU-2V0 = 1
110600             PERFORM PASS
110700             GO TO UST-WRITE-GF-7-5
110800     ELSE
110900             GO TO UST-FAIL-GF-7-5.
111000 UST-DELETE-GF-7-5.
111100     PERFORM DE-LETE.
111200     GO TO UST-WRITE-GF-7-5.
111300 UST-FAIL-GF-7-5.
111400     PERFORM FAIL
111500     MOVE    ID11-DU-2V0 TO COMPUTED-N
111600     MOVE    1 TO CORRECT-N.
111700 UST-WRITE-GF-7-5.
111800     PERFORM PRINT-DETAIL.
111900*
112000 UST-INIT-GF-8.
112100     MOVE    "UST-TEST-GF-8" TO PAR-NAME.
112200     MOVE    "VI-135" TO ANSI-REFERENCE.
112300     MOVE    "PIC S99" TO FEATURE.
112400     MOVE    "1200000" TO ID1-XN-7.
112500     MOVE    ZERO TO ID4-DS-2V0.
112600     MOVE    "****" TO ID5-XN-4.
112700     MOVE    ZERO TO ID6-DU-2V0.
112800     MOVE    1 TO ID10-DU-2V0.
112900     MOVE    ZERO TO ID11-DU-2V0.
113000     MOVE    1 TO REC-CT.
113100*
113200 UST-TEST-GF-8.
113300     UNSTRING ID1-XN-7 DELIMITED ZERO-XN-1 INTO ID4-DS-2V0
113400             DELIMITER ID5-XN-4
113500             COUNT ID6-DU-2V0
113600             POINTER ID10-DU-2V0
113700             TALLYING IN ID11-DU-2V0.
113800     GO TO UST-TEST-GF-8-1.
113900 UST-DELETE-GF-8.
114000     PERFORM DE-LETE.
114100     PERFORM PRINT-DETAIL.
114200     GO      TO UST-INIT-GF-9.
114300*
114400 UST-TEST-GF-8-1.
114500     IF      ID4-DS-2V0 = +12
114600             PERFORM PASS
114700             GO TO UST-WRITE-GF-8-1
114800     ELSE
114900             GO TO UST-FAIL-GF-8-1.
115000 UST-DELETE-GF-8-1.
115100     PERFORM DE-LETE.
115200     GO TO UST-WRITE-GF-8-1.
115300 UST-FAIL-GF-8-1.
115400     PERFORM FAIL
115500     MOVE    ID4-DS-2V0 TO COMPUTED-N
115600     MOVE    +12 TO CORRECT-N.
115700 UST-WRITE-GF-8-1.
115800     PERFORM PRINT-DETAIL.
115900*
116000 UST-TEST-GF-8-2.
116100     ADD     1 TO REC-CT.
116200     IF      ID5-XN-4 = "0   "
116300             PERFORM PASS
116400             GO TO UST-WRITE-GF-8-2
116500     ELSE
116600             GO TO UST-FAIL-GF-8-2.
116700 UST-DELETE-GF-8-2.
116800     PERFORM DE-LETE.
116900     GO TO UST-WRITE-GF-8-2.
117000 UST-FAIL-GF-8-2.
117100     PERFORM FAIL
117200     MOVE    ID5-XN-4 TO COMPUTED-A
117300     MOVE    "0   " TO CORRECT-A.
117400 UST-WRITE-GF-8-2.
117500     PERFORM PRINT-DETAIL.
117600*
117700 UST-TEST-GF-8-3.
117800     ADD     1 TO REC-CT.
117900     IF      ID6-DU-2V0 = 2
118000             PERFORM PASS
118100             GO TO UST-WRITE-GF-8-3
118200     ELSE
118300             GO TO UST-FAIL-GF-8-3.
118400 UST-DELETE-GF-8-3.
118500     PERFORM DE-LETE.
118600     GO TO UST-WRITE-GF-8-3.
118700 UST-FAIL-GF-8-3.
118800     PERFORM FAIL
118900     MOVE    ID6-DU-2V0 TO COMPUTED-N
119000     MOVE    2 TO CORRECT-N.
119100 UST-WRITE-GF-8-3.
119200     PERFORM PRINT-DETAIL.
119300*
119400 UST-TEST-GF-8-4.
119500     ADD     1 TO REC-CT.
119600     IF      ID10-DU-2V0 = 4
119700             PERFORM PASS
119800             GO TO UST-WRITE-GF-8-4
119900     ELSE
120000             GO TO UST-FAIL-GF-8-4.
120100 UST-DELETE-GF-8-4.
120200     PERFORM DE-LETE.
120300     GO TO UST-WRITE-GF-8-4.
120400 UST-FAIL-GF-8-4.
120500     PERFORM FAIL
120600     MOVE    ID10-DU-2V0 TO COMPUTED-N
120700     MOVE    4 TO CORRECT-N.
120800 UST-WRITE-GF-8-4.
120900     PERFORM PRINT-DETAIL.
121000*
121100 UST-TEST-GF-8-5.
121200     ADD     1 TO REC-CT.
121300     IF      ID11-DU-2V0 = 1
121400             PERFORM PASS
121500             GO TO UST-WRITE-GF-8-5
121600     ELSE
121700             GO TO UST-FAIL-GF-8-5.
121800 UST-DELETE-GF-8-5.
121900     PERFORM DE-LETE.
122000     GO TO UST-WRITE-GF-8-5.
122100 UST-FAIL-GF-8-5.
122200     PERFORM FAIL
122300     MOVE    ID11-DU-2V0 TO COMPUTED-N
122400     MOVE    1 TO CORRECT-N.
122500 UST-WRITE-GF-8-5.
122600     PERFORM PRINT-DETAIL.
122700*
122800 UST-INIT-GF-9.
122900     MOVE    "UST-TEST-GF-9" TO PAR-NAME.
123000     MOVE    "VI-135" TO ANSI-REFERENCE.
123100     MOVE    "PIC S9 TRAIL SEP" TO FEATURE.
123200     MOVE    "1200000" TO ID1-XN-7.
123300     MOVE    ZERO TO ID4-DS-TS-1V0.
123400     MOVE    "****" TO ID5-XN-4.
123500     MOVE    ZERO TO ID6-DU-2V0.
123600     MOVE    1 TO ID10-DU-2V0.
123700     MOVE    ZERO TO ID11-DU-2V0.
123800     MOVE    1 TO REC-CT.
123900*
124000 UST-TEST-GF-9.
124100     UNSTRING ID1-XN-7 DELIMITED ALL ZERO-XN-1 INTO ID4-DS-TS-1V0
124200             DELIMITER ID5-XN-4
124300             COUNT ID6-DU-2V0
124400             POINTER ID10-DU-2V0
124500             TALLYING IN ID11-DU-2V0.
124600     GO TO UST-TEST-GF-9-1.
124700 UST-DELETE-GF-9.
124800     PERFORM DE-LETE.
124900     PERFORM PRINT-DETAIL.
125000     GO      TO UST-INIT-GF-10.
125100*
125200 UST-TEST-GF-9-1.
125300     IF      ID4-DS-TS-1V0 = +2
125400             PERFORM PASS
125500             GO TO UST-WRITE-GF-9-1
125600     ELSE
125700             GO TO UST-FAIL-GF-9-1.
125800 UST-DELETE-GF-9-1.
125900     PERFORM DE-LETE.
126000     GO TO UST-WRITE-GF-9-1.
126100 UST-FAIL-GF-9-1.
126200     PERFORM FAIL
126300     MOVE    ID4-DS-TS-1V0 TO COMPUTED-N
126400     MOVE    +2 TO CORRECT-N.
126500 UST-WRITE-GF-9-1.
126600     PERFORM PRINT-DETAIL.
126700*
126800 UST-TEST-GF-9-2.
126900     ADD     1 TO REC-CT.
127000     IF      ID5-XN-4 = "0   "
127100             PERFORM PASS
127200             GO TO UST-WRITE-GF-9-2
127300     ELSE
127400             GO TO UST-FAIL-GF-9-2.
127500 UST-DELETE-GF-9-2.
127600     PERFORM DE-LETE.
127700     GO TO UST-WRITE-GF-9-2.
127800 UST-FAIL-GF-9-2.
127900     PERFORM FAIL
128000     MOVE    ID5-XN-4 TO COMPUTED-A
128100     MOVE    "0   " TO CORRECT-A.
128200 UST-WRITE-GF-9-2.
128300     PERFORM PRINT-DETAIL.
128400*
128500 UST-TEST-GF-9-3.
128600     IF      ID6-DU-2V0 = 2
128700             PERFORM PASS
128800             GO TO UST-WRITE-GF-9-3
128900     ELSE
129000             GO TO UST-FAIL-GF-9-3.
129100 UST-DELETE-GF-9-3.
129200     PERFORM DE-LETE.
129300     GO TO UST-WRITE-GF-9-3.
129400 UST-FAIL-GF-9-3.
129500     PERFORM FAIL
129600     MOVE    ID6-DU-2V0 TO COMPUTED-N
129700     MOVE    2 TO CORRECT-N.
129800 UST-WRITE-GF-9-3.
129900     PERFORM PRINT-DETAIL.
130000*
130100 UST-TEST-GF-9-4.
130200     ADD     1 TO REC-CT.
130300     IF      ID10-DU-2V0 = 8
130400             PERFORM PASS
130500             GO TO UST-WRITE-GF-9-4
130600     ELSE
130700             GO TO UST-FAIL-GF-9-4.
130800 UST-DELETE-GF-9-4.
130900     PERFORM DE-LETE.
131000     GO TO UST-WRITE-GF-9-4.
131100 UST-FAIL-GF-9-4.
131200     PERFORM FAIL
131300     MOVE    ID10-DU-2V0 TO COMPUTED-N
131400     MOVE    8 TO CORRECT-N.
131500 UST-WRITE-GF-9-4.
131600     PERFORM PRINT-DETAIL.
131700*
131800 UST-TEST-GF-9-5.
131900     ADD     1 TO REC-CT.
132000     IF      ID11-DU-2V0 = 1
132100             PERFORM PASS
132200             GO TO UST-WRITE-GF-9-5
132300     ELSE
132400             GO TO UST-FAIL-GF-9-5.
132500 UST-DELETE-GF-9-5.
132600     PERFORM DE-LETE.
132700     GO TO UST-WRITE-GF-9-5.
132800 UST-FAIL-GF-9-5.
132900     PERFORM FAIL
133000     MOVE    ID11-DU-2V0 TO COMPUTED-N
133100     MOVE    1 TO CORRECT-N.
133200 UST-WRITE-GF-9-5.
133300     PERFORM PRINT-DETAIL.
133400*
133500 UST-INIT-GF-10.
133600     MOVE    "UST-TEST-GF-10" TO PAR-NAME.
133700     MOVE    "VI-135" TO ANSI-REFERENCE.
133800     MOVE    "PIC S9 LEAD SEP" TO FEATURE.
133900     MOVE    "1200000" TO ID1-XN-7.
134000     MOVE    ZERO TO ID4-DS-LS-1V0.
134100     MOVE    "****" TO ID5-XN-4.
134200     MOVE    ZERO TO ID6-DU-2V0.
134300     MOVE    1 TO ID10-DU-2V0.
134400     MOVE    ZERO TO ID11-DU-2V0.
134500     MOVE    1 TO REC-CT.
134600*
134700 UST-TEST-GF-10.
134800     UNSTRING ID1-XN-7 DELIMITED BY "0" INTO ID4-DS-LS-1V0
134900             DELIMITER ID5-XN-4
135000             COUNT ID6-DU-2V0
135100             POINTER ID10-DU-2V0
135200             TALLYING ID11-DU-2V0.
135300     GO TO UST-TEST-GF-10-1.
135400 UST-DELETE-GF-10.
135500     PERFORM DE-LETE.
135600     PERFORM PRINT-DETAIL.
135700     GO      TO UST-INIT-GF-11.
135800*
135900 UST-TEST-GF-10-1.
136000     IF      ID4-DS-LS-1V0 = +2
136100             PERFORM PASS
136200             GO TO UST-WRITE-GF-10-1
136300     ELSE
136400             GO TO UST-FAIL-GF-10-1.
136500 UST-DELETE-GF-10-1.
136600     PERFORM DE-LETE.
136700     GO TO UST-WRITE-GF-10-1.
136800 UST-FAIL-GF-10-1.
136900     PERFORM FAIL
137000     MOVE    ID4-DS-LS-1V0 TO COMPUTED-N
137100     MOVE    +2 TO CORRECT-N.
137200 UST-WRITE-GF-10-1.
137300     PERFORM PRINT-DETAIL.
137400*
137500 UST-TEST-GF-10-2.
137600     ADD     1 TO REC-CT.
137700     IF      ID5-XN-4 = "0   "
137800             PERFORM PASS
137900             GO TO UST-WRITE-GF-10-2
138000     ELSE
138100             GO TO UST-FAIL-GF-10-2.
138200 UST-DELETE-GF-10-2.
138300     PERFORM DE-LETE.
138400     GO TO UST-WRITE-GF-10-2.
138500 UST-FAIL-GF-10-2.
138600     PERFORM FAIL
138700     MOVE    ID5-XN-4 TO COMPUTED-A
138800     MOVE    "0   " TO CORRECT-A.
138900 UST-WRITE-GF-10-2.
139000     PERFORM PRINT-DETAIL.
139100*
139200 UST-TEST-GF-10-3.
139300     ADD     1 TO REC-CT.
139400     IF      ID6-DU-2V0 = 2
139500             PERFORM PASS
139600             GO TO UST-WRITE-GF-10-3
139700     ELSE
139800             GO TO UST-FAIL-GF-10-3.
139900 UST-DELETE-GF-10-3.
140000     PERFORM DE-LETE.
140100     GO TO UST-WRITE-GF-10-3.
140200 UST-FAIL-GF-10-3.
140300     PERFORM FAIL
140400     MOVE    ID6-DU-2V0 TO COMPUTED-N
140500     MOVE    2 TO CORRECT-N.
140600 UST-WRITE-GF-10-3.
140700     PERFORM PRINT-DETAIL.
140800*
140900 UST-TEST-GF-10-4.
141000     ADD     1 TO REC-CT.
141100     IF      ID10-DU-2V0 = 4
141200             PERFORM PASS
141300             GO TO UST-WRITE-GF-10-4
141400     ELSE
141500             GO TO UST-FAIL-GF-10-4.
141600 UST-DELETE-GF-10-4.
141700     PERFORM DE-LETE.
141800     GO TO UST-WRITE-GF-10-4.
141900 UST-FAIL-GF-10-4.
142000     PERFORM FAIL
142100     MOVE    ID10-DU-2V0 TO COMPUTED-N
142200     MOVE    4 TO CORRECT-N.
142300 UST-WRITE-GF-10-4.
142400     PERFORM PRINT-DETAIL.
142500*
142600 UST-TEST-GF-10-5.
142700     ADD     1 TO REC-CT.
142800     IF      ID11-DU-2V0 = 1
142900             PERFORM PASS
143000             GO TO UST-WRITE-GF-10-5
143100     ELSE
143200             GO TO UST-FAIL-GF-10-5.
143300 UST-DELETE-GF-10-5.
143400     PERFORM DE-LETE.
143500     GO TO UST-WRITE-GF-10-5.
143600 UST-FAIL-GF-10-5.
143700     PERFORM FAIL
143800     MOVE    ID11-DU-2V0 TO COMPUTED-N
143900     MOVE    1 TO CORRECT-N.
144000 UST-WRITE-GF-10-5.
144100     PERFORM PRINT-DETAIL.
144200*
144300 UST-INIT-GF-11.
144400     MOVE    "UST-TEST-GF-11" TO PAR-NAME.
144500     MOVE    "VI-135" TO ANSI-REFERENCE.
144600     MOVE    "GROUP BOTTOM UP" TO FEATURE.
144700     MOVE    "ABCDEFGHIJ" TO GRP1-XN-10.
144800     MOVE    SPACES TO GRP4-XN-10.
144900     MOVE    "****" TO ID5-XN-4.
145000     MOVE    ZERO TO ID6-DU-2V0.
145100     MOVE    1 TO ID10-DU-2V0.
145200     MOVE    ZERO TO ID11-DU-2V0.
145300     MOVE    ZERO TO REC-CT.
145400*
145500 UST-TEST-GF-11.
145600     UNSTRING GRP1-XN-10 INTO ID4D-XXXX ID4C-XXX ID4B-XX ID4A-X.
145700     IF      GRP4-XN-10 = "JHIEFGABCD"
145800             PERFORM PASS
145900             GO TO UST-WRITE-GF-11-1
146000     ELSE
146100             GO TO UST-FAIL-GF-11-1.
146200 UST-DELETE-GF-11-1.
146300     PERFORM DE-LETE.
146400     GO TO UST-WRITE-GF-11-1.
146500 UST-FAIL-GF-11-1.
146600     PERFORM FAIL
146700     MOVE    GRP4-XN-10 TO COMPUTED-A
146800     MOVE    "JHIEFGABCD" TO CORRECT-A.
146900 UST-WRITE-GF-11-1.
147000     PERFORM PRINT-DETAIL.
147100*
147200 UST-INIT-GF-12.
147300     MOVE   "UST-TEST-GF-12" TO PAR-NAME.
147400     MOVE    "VI-135" TO ANSI-REFERENCE.
147500     MOVE   "OVERFLOW TEST" TO FEATURE.
147600     MOVE    SPACES TO GRP4-XN-6.
147700     MOVE    "****" TO ID5-XN-4.
147800     MOVE    ZERO TO ID6-DU-2V0.
147900     MOVE    1 TO ID10-DU-2V0.
148000     MOVE    ZERO TO ID11-DU-2V0.
148100     MOVE    "ABCDEF" TO GRP1-XN-6.
148200     MOVE    1 TO REC-CT.
148300*
148400 UST-TEST-GF-12-1.
148500     UNSTRING GRP1-XN-6  INTO ID4A-XXXXX ID4B-X
148600             ON OVERFLOW GO TO UST-FAIL-GF-12-1.
148700     PERFORM PASS.
148800     GO TO UST-WRITE-GF-12-1.
148900 UST-DELETE-GF-12-1.
149000     PERFORM DE-LETE.
149100     PERFORM PRINT-DETAIL.
149200     GO      TO UST-INIT-GF-13.
149300 UST-FAIL-GF-12-1.
149400     PERFORM FAIL.
149500     MOVE    "OVERFLOW SHOULD NOT HAVE OCCURED" TO RE-MARK.
149600 UST-WRITE-GF-12-1.
149700     PERFORM PRINT-DETAIL.
149800*
149900 UST-TEST-GF-12-2.
150000     MOVE    "UST-TEST-GF-12" TO PAR-NAME.
150100     ADD     1 TO REC-CT.
150200     IF      GRP4-XN-6 = "ABCDEF"
150300             PERFORM PASS
150400             GO TO UST-WRITE-GF-12-2
150500     ELSE
150600             GO TO UST-FAIL-GF-12-2.
150700 UST-DELETE-GF-12-2.
150800     PERFORM DE-LETE.
150900     GO TO UST-WRITE-GF-12-2.
151000 UST-FAIL-GF-12-2.
151100     PERFORM FAIL
151200     MOVE    GRP4-XN-6 TO COMPUTED-A
151300     MOVE    "ABCDEF" TO CORRECT-A.
151400 UST-WRITE-GF-12-2.
151500     PERFORM PRINT-DETAIL.
151600*
151700 UST-INIT-GF-13.
151800     MOVE    "UST-TEST-GF-13" TO PAR-NAME.
151900     MOVE    "VI-135" TO ANSI-REFERENCE.
152000     MOVE    "OVERFLOW EXPECTED" TO FEATURE.
152100     MOVE    "ABCDEF" TO GRP1-XN-6.
152200     MOVE    SPACES TO GRP4-XN-6.
152300     MOVE    "****" TO ID5-XN-4.
152400     MOVE    ZERO TO ID6-DU-2V0.
152500     MOVE    1 TO ID10-DU-2V0.
152600     MOVE    ZERO TO ID11-DU-2V0.
152700     MOVE    1 TO REC-CT.
152800 UST-TEST-GF-13-1.
152900     UNSTRING GRP1-XN-6 INTO ID4A-XXXXX OVERFLOW PERFORM PASS
153000                                        GO TO UST-WRITE-GF-13-1.
153100     GO      TO UST-FAIL-GF-13-1.
153200 UST-DELETE-GF-13-1.
153300     PERFORM DE-LETE.
153400     PERFORM PRINT-DETAIL.
153500     GO      TO UST-INIT-GF-14.
153600 UST-FAIL-GF-13-1.
153700     PERFORM FAIL.
153800     MOVE    "OVERFLOW SHOULD HAVE OCCURED" TO RE-MARK.
153900 UST-WRITE-GF-13-1.
154000     PERFORM PRINT-DETAIL.
154100*
154200 UST-TEST-GF-13-2.
154300     ADD     1 TO REC-CT.
154400     IF      GRP4-XN-6 = "ABCDE "
154500             PERFORM PASS
154600             GO TO UST-WRITE-GF-13-2
154700     ELSE
154800             GO TO UST-FAIL-GF-13-2.
154900 UST-DELETE-GF-13-2.
155000     PERFORM DE-LETE.
155100     GO TO UST-WRITE-GF-13-2.
155200 UST-FAIL-GF-13-2.
155300     PERFORM FAIL
155400     MOVE    GRP4-XN-6 TO COMPUTED-A
155500     MOVE    "ABCDE " TO CORRECT-A.
155600 UST-WRITE-GF-13-2.
155700     PERFORM PRINT-DETAIL.
155800*
155900 UST-INIT-GF-14.
156000     MOVE    "UST-TEST-GF-14" TO PAR-NAME.
156100     MOVE    "VI-135" TO ANSI-REFERENCE.
156200     MOVE    "INSTANT OVERFLOW" TO FEATURE.
156300     MOVE    SPACES TO GRP4-XN-6.
156400     MOVE    "****" TO ID5-XN-4.
156500     MOVE    ZERO TO ID6-DU-2V0.
156600     MOVE    7 TO ID10-DU-2V0.
156700     MOVE    ZERO TO ID11-DU-2V0.
156800     MOVE    1 TO REC-CT.
156900*
157000 UST-TEST-GF-14-1.
157100     UNSTRING GRP1-XN-6 INTO ID4A-XXXXX ID4B-X POINTER ID10-DU-2V0
157200             OVERFLOW PERFORM PASS
157300                      GO TO UST-WRITE-GF-14-1.
157400     GO      TO UST-FAIL-GF-14-1.
157500 UST-DELETE-GF-14-1.
157600     PERFORM DE-LETE.
157700     PERFORM PRINT-DETAIL.
157800     GO      TO UST-INIT-GF-15.
157900 UST-FAIL-GF-14-1.
158000     PERFORM FAIL.
158100     MOVE    "OVERFLOW SHOULD HAVE OCCURED" TO RE-MARK.
158200 UST-WRITE-GF-14-1.
158300     PERFORM PRINT-DETAIL.
158400*
158500 UST-TEST-GF-14-2.
158600     MOVE    "UST-TEST-GF-14" TO PAR-NAME.
158700     ADD     1 TO REC-CT.
158800     IF      GRP4-XN-6 = SPACES
158900             PERFORM PASS
159000             GO TO UST-WRITE-GF-14-2
159100     ELSE
159200             GO TO UST-FAIL-GF-14-2.
159300 UST-DELETE-GF-14-2.
159400     PERFORM DE-LETE.
159500     GO TO UST-WRITE-GF-14-2.
159600 UST-FAIL-GF-14-2.
159700     PERFORM FAIL
159800     MOVE    GRP4-XN-6 TO COMPUTED-A
159900     MOVE    "ALL SPACES" TO CORRECT-A.
160000 UST-WRITE-GF-14-2.
160100     PERFORM PRINT-DETAIL.
160200*
160300 UST-TEST-GF-14-3.
160400     ADD     1 TO REC-CT.
160500     IF      ID10-DU-2V0 = 7
160600             PERFORM PASS
160700             GO TO UST-WRITE-GF-14-3
160800     ELSE
160900             GO TO UST-FAIL-GF-14-3.
161000 UST-DELETE-GF-14-3.
161100     PERFORM DE-LETE.
161200     GO TO UST-WRITE-GF-14-3.
161300 UST-FAIL-GF-14-3.
161400     PERFORM FAIL
161500     MOVE    ID10-DU-2V0 TO COMPUTED-N
161600     MOVE    7 TO CORRECT-N.
161700 UST-WRITE-GF-14-3.
161800     PERFORM PRINT-DETAIL.
161900*
162000 UST-INIT-GF-15.
162100     MOVE    "UST-TEST-GF-15" TO PAR-NAME.
162200     MOVE    "VI-135" TO ANSI-REFERENCE.
162300     MOVE    "POINTER NOT = 1" TO FEATURE.
162400     MOVE    "ABCDEF" TO GRP1-XN-6.
162500     MOVE    SPACES TO GRP4-XN-6.
162600     MOVE    "****" TO ID5-XN-4.
162700     MOVE    ZERO TO ID6-DU-2V0.
162800     MOVE    3 TO ID10-DU-2V0.
162900     MOVE    ZERO TO ID11-DU-2V0.
163000     MOVE    1 TO REC-CT.
163100*
163200 UST-TEST-GF-15-1.
163300     UNSTRING GRP1-XN-6 INTO ID4A-XXXXX ID4B-X POINTER ID10-DU-2V0
163400             OVERFLOW GO TO UST-FAIL-GF-15-1.
163500     PERFORM PASS
163600     GO TO UST-WRITE-GF-15-1.
163700 UST-DELETE-GF-15-1.
163800     PERFORM DE-LETE.
163900     PERFORM PRINT-DETAIL.
164000     GO      TO UST-INIT-GF-16.
164100 UST-FAIL-GF-15-1.
164200     PERFORM FAIL.
164300     MOVE    "OVERFLOW SHOULD NOT HAVE OCCURED" TO RE-MARK.
164400 UST-WRITE-GF-15-1.
164500     PERFORM PRINT-DETAIL.
164600*
164700 UST-TEST-GF-15-2.
164800     ADD     1 TO REC-CT.
164900     IF      GRP4-XN-6 = "CDEF  "
165000             PERFORM PASS
165100             GO TO UST-WRITE-GF-15-2
165200     ELSE
165300             GO TO UST-FAIL-GF-15-2.
165400 UST-DELETE-GF-15-2.
165500     PERFORM DE-LETE.
165600     GO TO UST-WRITE-GF-15-2.
165700 UST-FAIL-GF-15-2.
165800     PERFORM FAIL
165900     MOVE    GRP4-XN-6 TO COMPUTED-A
166000     MOVE    "CDEF  " TO CORRECT-A.
166100 UST-WRITE-GF-15-2.
166200     PERFORM PRINT-DETAIL.
166300*
166400 UST-TEST-GF-15-3.
166500     ADD     1 TO REC-CT.
166600     IF      ID10-DU-2V0 = 7
166700             PERFORM PASS
166800             GO TO UST-WRITE-GF-15-3
166900     ELSE
167000             GO TO UST-FAIL-GF-15-3.
167100 UST-DELETE-GF-15-3.
167200     PERFORM DE-LETE.
167300     GO TO UST-WRITE-GF-15-3.
167400 UST-FAIL-GF-15-3.
167500     PERFORM FAIL
167600     MOVE    ID10-DU-2V0 TO COMPUTED-N
167700     MOVE    7 TO CORRECT-N.
167800 UST-WRITE-GF-15-3.
167900     PERFORM PRINT-DETAIL.
168000*
168100 UST-INIT-GF-16.
168200     MOVE    "UST-TEST-GF-16" TO PAR-NAME.
168300     MOVE    "VI-135" TO ANSI-REFERENCE.
168400     MOVE    "TALLY 3 FIELDS TEST" TO FEATURE.
168500     MOVE    "ABCDEF" TO GRP1-XN-6.
168600     MOVE    SPACES TO GRP4-XN-6.
168700     MOVE    "****" TO ID4C-XXXX.
168800     MOVE    "****" TO ID5-XN-4.
168900     MOVE    ZERO TO ID6-DU-2V0.
169000     MOVE    1 TO ID10-DU-2V0.
169100     MOVE    ZERO TO ID11-DU-2V0.
169200     MOVE    1 TO REC-CT.
169300*
169400 UST-TEST-GF-16-0.
169500     UNSTRING GRP1-XN-6 INTO ID4A-XXXXX ID4B-X ID4C-XXXX
169600             TALLYING ID11-DU-2V0.
169700     GO      TO UST-TEST-GF-16-1.
169800 UST-DELETE-GF-16.
169900     PERFORM DE-LETE.
170000     PERFORM PRINT-DETAIL.
170100     GO      TO UST-INIT-GF-17.
170200*
170300 UST-TEST-GF-16-1.
170400     IF      GRP4-XN-6 = "ABCDEF"
170500             PERFORM PASS
170600             GO TO UST-WRITE-GF-16-1
170700     ELSE
170800             GO TO UST-FAIL-GF-16-1.
170900 UST-DELETE-GF-16-1.
171000     PERFORM DE-LETE.
171100     GO TO UST-WRITE-GF-16-1.
171200 UST-FAIL-GF-16-1.
171300     PERFORM FAIL
171400     MOVE    GRP4-XN-6 TO COMPUTED-A
171500     MOVE    "ABCDEF" TO CORRECT-A.
171600 UST-WRITE-GF-16-1.
171700     PERFORM PRINT-DETAIL.
171800*
171900 UST-TEST-GF-16-2.
172000     ADD     1 TO REC-CT.
172100     IF      ID4C-XXXX = "****"
172200             PERFORM PASS
172300             GO TO UST-WRITE-GF-16-2
172400     ELSE
172500             GO TO UST-FAIL-GF-16-2.
172600 UST-DELETE-GF-16-2.
172700     PERFORM DE-LETE.
172800     GO TO UST-WRITE-GF-16-2.
172900 UST-FAIL-GF-16-2.
173000     PERFORM FAIL
173100     MOVE    ID4C-XXXX TO COMPUTED-A
173200     MOVE    "****" TO CORRECT-A.
173300 UST-WRITE-GF-16-2.
173400     PERFORM PRINT-DETAIL.
173500*
173600 UST-TEST-GF-16-3.
173700     ADD     1 TO REC-CT.
173800     IF      ID11-DU-2V0 = 2
173900             PERFORM PASS
174000             GO TO UST-WRITE-GF-16-3
174100     ELSE
174200             GO TO UST-FAIL-GF-16-3.
174300 UST-DELETE-GF-16-3.
174400     PERFORM DE-LETE.
174500     GO TO UST-WRITE-GF-16-3.
174600 UST-FAIL-GF-16-3.
174700     PERFORM FAIL
174800     MOVE    ID11-DU-2V0 TO COMPUTED-N
174900     MOVE    2 TO CORRECT-N.
175000 UST-WRITE-GF-16-3.
175100     PERFORM PRINT-DETAIL.
175200*
175300 UST-INIT-GF-17.
175400     MOVE    "UST-TEST-GF-17" TO PAR-NAME.
175500     MOVE    "VI-135" TO ANSI-REFERENCE.
175600     MOVE    "QUAL DEL BY POINT" TO FEATURE.
175700     MOVE    "ABCDEFG" TO GRP1-XN-7.
175800     MOVE    "BCDEFGH" TO GRP2-XN-7.
175900     MOVE    SPACES TO GRP4-XN-6.
176000     MOVE    ALL "*" TO ID5-XN-6.
176100     MOVE    ZERO TO ID6-DU-2V0.
176200     MOVE    2 TO ID10-DU-2V0.
176300     MOVE    ZERO TO ID11-DU-2V0.
176400     MOVE    1 TO REC-CT.
176500*
176600 UST-TEST-GF-17.
176700     UNSTRING GRP1-XN-7 DELIMITED BY ID2 (ID10-DU-2V0)
176800             INTO GRP4-XN-6
176900             DELIMITER IN ID5-XN-6
177000             COUNT ID6-DU-2V0
177100             POINTER ID10-DU-2V0.
177200     GO TO UST-TEST-GF-17-1.
177300 UST-DELETE-GF-17.
177400     PERFORM DE-LETE.
177500     PERFORM PRINT-DETAIL.
177600     GO      TO UST-INIT-GF-18.
177700*
177800 UST-TEST-GF-17-1.
177900     IF      GRP4-XN-6 = "B     "
178000             PERFORM PASS
178100             GO TO UST-WRITE-GF-17-1
178200     ELSE
178300             GO TO UST-FAIL-GF-17-1.
178400 UST-DELETE-GF-17-1.
178500     PERFORM DE-LETE.
178600     GO TO UST-WRITE-GF-17-1.
178700 UST-FAIL-GF-17-1.
178800     PERFORM FAIL
178900     MOVE    GRP4-XN-6 TO COMPUTED-A
179000     MOVE    "B     " TO CORRECT-A.
179100 UST-WRITE-GF-17-1.
179200     PERFORM PRINT-DETAIL.
179300*
179400 UST-TEST-GF-17-2.
179500     ADD     1 TO REC-CT.
179600     IF      ID5-XN-6 = "C     "
179700             PERFORM PASS
179800             GO TO UST-WRITE-GF-17-2
179900     ELSE
180000             GO TO UST-FAIL-GF-17-2.
180100 UST-DELETE-GF-17-2.
180200     PERFORM DE-LETE.
180300     GO TO UST-WRITE-GF-17-2.
180400 UST-FAIL-GF-17-2.
180500     PERFORM FAIL
180600     MOVE    ID5-XN-6 TO COMPUTED-A
180700     MOVE    "C     " TO CORRECT-A.
180800 UST-WRITE-GF-17-2.
180900     PERFORM PRINT-DETAIL.
181000*
181100 UST-TEST-GF-17-3.
181200     ADD     1 TO REC-CT.
181300     IF      ID6-DU-2V0 = 1
181400             PERFORM PASS
181500             GO TO UST-WRITE-GF-17-3
181600     ELSE
181700             GO TO UST-FAIL-GF-17-3.
181800 UST-DELETE-GF-17-3.
181900     PERFORM DE-LETE.
182000     GO TO UST-WRITE-GF-17-3.
182100 UST-FAIL-GF-17-3.
182200     PERFORM FAIL
182300     MOVE    ID6-DU-2V0 TO COMPUTED-N
182400     MOVE    1 TO CORRECT-N.
182500 UST-WRITE-GF-17-3.
182600     PERFORM PRINT-DETAIL.
182700*
182800 UST-TEST-GF-17-4.
182900     ADD     1 TO REC-CT.
183000     IF      ID10-DU-2V0 = 4
183100             PERFORM PASS
183200             GO TO UST-WRITE-GF-17-4
183300     ELSE
183400             GO TO UST-FAIL-GF-17-4.
183500 UST-DELETE-GF-17-4.
183600     PERFORM DE-LETE.
183700     GO TO UST-WRITE-GF-17-4.
183800 UST-FAIL-GF-17-4.
183900     PERFORM FAIL
184000     MOVE    ID10-DU-2V0 TO COMPUTED-N
184100     MOVE    4 TO CORRECT-N.
184200 UST-WRITE-GF-17-4.
184300     PERFORM PRINT-DETAIL.
184400*
184500 UST-INIT-GF-18.
184600     ADD     1 TO REC-CT.
184700     MOVE    "UST-TEST-GF-18" TO PAR-NAME.
184800     MOVE    "VI-136" TO ANSI-REFERENCE.
184900     MOVE    "QUAL DEL BY TALLY" TO FEATURE.
185000     MOVE    "ABCDEFG" TO GRP1-XN-7.
185100     MOVE    "CE" TO GRP2-XN-2.
185200     MOVE    SPACES TO GRP4-XN-6.
185300     MOVE    "****" TO ID5-XN-4.
185400     MOVE    "****" TO ID5-XN-4-2.
185500     MOVE    ZERO TO ID6-DU-2V0.
185600     MOVE    ZERO TO ID6-DU-2V0-2.
185700     MOVE    1 TO ID10-DU-2V0.
185800     MOVE    1 TO ID11-DU-2V0.
185900     MOVE    1 TO REC-CT.
186000*
186100 UST-TEST-GF-18.
186200     UNSTRING GRP1-XN-7 DELIMITED ID2A (ID10-DU-2V0)
186300              INTO ID4A-XXXXX
186400              DELIMITER IN ID5-XN-4
186500              COUNT ID6-DU-2V0
186600             ID4B-X DELIMITER IN ID5-XN-4-2
186700              COUNT ID6-DU-2V0-2
186800              TALLYING ID11-DU-2V0.
186900     GO TO UST-TEST-GF-18-1.
187000 UST-DELETE-GF-18.
187100     PERFORM DE-LETE.
187200     PERFORM PRINT-DETAIL.
187300     GO      TO UST-INIT-GF-19.
187400*
187500 UST-TEST-GF-18-1.
187600     IF      GRP4-XN-6 = "AB   D"
187700             PERFORM PASS
187800             GO TO UST-WRITE-GF-18-1
187900     ELSE
188000             GO TO UST-FAIL-GF-18-1.
188100 UST-DELETE-GF-18-1.
188200     PERFORM DE-LETE.
188300     GO TO UST-WRITE-GF-18-1.
188400 UST-FAIL-GF-18-1.
188500     PERFORM FAIL
188600     MOVE    GRP4-XN-6 TO COMPUTED-A
188700     MOVE    "AB   D" TO CORRECT-A.
188800 UST-WRITE-GF-18-1.
188900     PERFORM PRINT-DETAIL.
189000*
189100 UST-TEST-GF-18-2.
189200     ADD     1 TO REC-CT.
189300     IF      ID5-XN-4 = "C   "
189400             PERFORM PASS
189500             GO TO UST-WRITE-GF-18-2
189600     ELSE
189700             GO TO UST-FAIL-GF-18-2.
189800 UST-DELETE-GF-18-2.
189900     PERFORM DE-LETE.
190000     GO TO UST-WRITE-GF-18-2.
190100 UST-FAIL-GF-18-2.
190200     PERFORM FAIL
190300     MOVE    ID5-XN-4 TO COMPUTED-A
190400     MOVE    "C   " TO CORRECT-A.
190500 UST-WRITE-GF-18-2.
190600     PERFORM PRINT-DETAIL.
190700*
190800 UST-TEST-GF-18-3.
190900     ADD     1 TO REC-CT.
191000     IF      ID6-DU-2V0 = 2
191100             PERFORM PASS
191200             GO TO UST-WRITE-GF-18-3
191300     ELSE
191400             GO TO UST-FAIL-GF-18-3.
191500 UST-DELETE-GF-18-3.
191600     PERFORM DE-LETE.
191700     GO TO UST-WRITE-GF-18-3.
191800 UST-FAIL-GF-18-3.
191900     PERFORM FAIL
192000     MOVE    ID6-DU-2V0 TO COMPUTED-N
192100     MOVE    2 TO CORRECT-N.
192200 UST-WRITE-GF-18-3.
192300     PERFORM PRINT-DETAIL.
192400*
192500 UST-TEST-GF-18-4.
192600     ADD     1 TO REC-CT.
192700     IF      ID6-DU-2V0-2 EQUAL TO 4
192800             PERFORM PASS
192900             GO TO UST-WRITE-GF-18-4
193000     ELSE
193100             GO TO UST-FAIL-GF-18-4.
193200 UST-DELETE-GF-18-4.
193300     PERFORM DE-LETE.
193400     GO TO UST-WRITE-GF-18-4.
193500 UST-FAIL-GF-18-4.
193600     PERFORM FAIL
193700     MOVE    ID6-DU-2V0-2 TO COMPUTED-N
193800     MOVE    4 TO CORRECT-N.
193900 UST-WRITE-GF-18-4.
194000     PERFORM PRINT-DETAIL.
194100*
194200 UST-TEST-GF-18-5.
194300     ADD     1 TO REC-CT.
194400     IF      ID11-DU-2V0 = 3
194500             PERFORM PASS
194600             GO TO UST-WRITE-GF-18-5
194700     ELSE
194800             GO TO UST-FAIL-GF-18-5.
194900 UST-DELETE-GF-18-5.
195000     PERFORM DE-LETE.
195100     GO TO UST-WRITE-GF-18-5.
195200 UST-FAIL-GF-18-5.
195300     PERFORM FAIL
195400     MOVE    ID11-DU-2V0 TO COMPUTED-N
195500     MOVE    3 TO CORRECT-N.
195600 UST-WRITE-GF-18-5.
195700     PERFORM PRINT-DETAIL.
195800*
195900 UST-TEST-GF-18-6.
196000     ADD     1 TO REC-CT.
196100     IF      ID5-XN-4-2 = SPACES  AND  ID6-DU-2V0-2 = 4
196200             PERFORM PASS
196300             GO TO UST-WRITE-GF-18-6
196400     ELSE
196500             GO TO UST-FAIL-GF-18-6.
196600 UST-DELETE-GF-18-6.
196700     PERFORM DE-LETE.
196800     GO TO UST-WRITE-GF-18-6.
196900 UST-FAIL-GF-18-6.
197000     PERFORM FAIL
197100     MOVE    ID5-XN-4-2   TO COMPUTED-A
197200     MOVE    4 TO CORRECT-A.
197300 UST-WRITE-GF-18-6.
197400     PERFORM PRINT-DETAIL.
197500*
197600 UST-INIT-GF-19.
197700     MOVE "UST-TEST-GF-19" TO PAR-NAME.
197800     MOVE "VI-135" TO ANSI-REFERENCE.
197900     MOVE "QUALIFIED ID1" TO FEATURE.
198000     MOVE "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789" TO GRP1-XN-X-36.
198100     MOVE SPACES TO GRP4-XN-6.
198200     MOVE "****" TO ID5-XN-4.
198300     MOVE ZERO TO ID6-DU-2V0.
198400     MOVE 1 TO ID10-DU-2V0.
198500     MOVE ZERO TO ID11-DU-2V0.
198600     MOVE 1 TO REC-CT.
198700*
198800 UST-TEST-GF-19-0.
198900     UNSTRING ID1 OF GRP1-XN-X-36 (ID10-DU-2V0) INTO GRP4-XN-6
199000             POINTER ID10-DU-2V0.
199100     GO TO UST-TEST-GF-19-1.
199200 UST-DELETE-GF-19.
199300     PERFORM DE-LETE.
199400     PERFORM PRINT-DETAIL.
199500     GO TO UST-INIT-GF-20.
199600*
199700 UST-TEST-GF-19-1.
199800     IF      GRP4-XN-6 = "ABCDEF"
199900             PERFORM PASS
200000             GO TO UST-WRITE-GF-19-1
200100     ELSE
200200             GO TO UST-FAIL-GF-19-1.
200300 UST-DELETE-GF-19-1.
200400     PERFORM DE-LETE.
200500     GO TO UST-WRITE-GF-19-1.
200600 UST-FAIL-GF-19-1.
200700     PERFORM FAIL
200800     MOVE    GRP4-XN-6 TO COMPUTED-A
200900     MOVE    "ABCDEF" TO CORRECT-A.
201000 UST-WRITE-GF-19-1.
201100     PERFORM PRINT-DETAIL.
201200*
201300 UST-TEST-GF-19-2.
201400     ADD     1 TO REC-CT.
201500     IF      ID10-DU-2V0 = 7
201600             PERFORM PASS
201700             GO TO UST-WRITE-GF-19-2
201800     ELSE
201900             GO TO UST-FAIL-GF-19-2.
202000 UST-DELETE-GF-19-2.
202100     PERFORM DE-LETE.
202200     GO TO UST-WRITE-GF-19-2.
202300 UST-FAIL-GF-19-2.
202400     PERFORM FAIL
202500     MOVE    ID10-DU-2V0 TO COMPUTED-N
202600     MOVE    7 TO CORRECT-N.
202700 UST-WRITE-GF-19-2.
202800     PERFORM PRINT-DETAIL.
202900*
203000 UST-TEST-GF-19-3.
203100     ADD     1 TO REC-CT.
203200     IF      ID11-DU-2V0 = ZERO
203300             PERFORM PASS
203400             GO TO UST-WRITE-GF-19-3
203500     ELSE
203600             GO TO UST-FAIL-GF-19-3.
203700 UST-DELETE-GF-19-3.
203800     PERFORM DE-LETE.
203900     GO TO UST-WRITE-GF-19-3.
204000 UST-FAIL-GF-19-3.
204100     PERFORM FAIL
204200     MOVE    ID11-DU-2V0 TO COMPUTED-N
204300     MOVE    ZERO TO CORRECT-N.
204400 UST-WRITE-GF-19-3.
204500     PERFORM PRINT-DETAIL.
204600*
204700 UST-INIT-GF-20.
204800     MOVE    "UST-TEST-GF-20" TO PAR-NAME.
204900     MOVE    "VI-135" TO ANSI-REFERENCE.
205000     MOVE    "MULT RECEIVE AREAS" TO FEATURE.
205100     MOVE    SPACES TO GRP4-XN-6.
205200     MOVE    "****" TO ID4C-XXXX.
205300     MOVE    "*" TO ID4D-X.
205400     MOVE    "****" TO ID5-XN-4.
205500     MOVE    ZERO TO ID6-DU-2V0.
205600     MOVE    1 TO ID10-DU-2V0.
205700     MOVE    1 TO ID11-DU-2V0.
205800     MOVE    1 TO REC-CT.
205900*
206000 UST-TEST-GF-20.
206100     UNSTRING ID1 OF GRP1-XN-X-36 (ID11-DU-2V0)
206200              INTO ID4A-XXXXX ID4B-X ID4C-XXXX ID4D-X
206300              TALLYING ID11-DU-2V0.
206400     GO TO UST-TEST-GF-20-1.
206500 UST-DELETE-GF-20.
206600     PERFORM DE-LETE.
206700     PERFORM PRINT-DETAIL.
206800     GO      TO UST-INIT-GF-21.
206900*
207000 UST-TEST-GF-20-1.
207100     IF      GRP4-XN-6 = "ABCDEF"
207200             PERFORM PASS
207300             GO TO UST-WRITE-GF-20-1
207400     ELSE
207500             GO TO UST-FAIL-GF-20-1.
207600 UST-DELETE-GF-20-1.
207700     PERFORM DE-LETE.
207800     GO TO UST-WRITE-GF-20-1.
207900 UST-FAIL-GF-20-1.
208000     PERFORM FAIL
208100     MOVE    GRP4-XN-6 TO COMPUTED-A
208200     MOVE    "ABCDEF" TO CORRECT-A.
208300 UST-WRITE-GF-20-1.
208400     PERFORM PRINT-DETAIL.
208500*
208600 UST-TEST-GF-20-2.
208700     ADD     1 TO REC-CT.
208800     IF      ID4C-XXXX = "****"
208900             PERFORM PASS
209000             GO TO UST-WRITE-GF-20-2
209100     ELSE
209200             GO TO UST-FAIL-GF-20-2.
209300 UST-DELETE-GF-20-2.
209400     PERFORM DE-LETE.
209500     GO TO UST-WRITE-GF-20-2.
209600 UST-FAIL-GF-20-2.
209700     PERFORM FAIL
209800     MOVE    ID4C-XXXX TO COMPUTED-A
209900     MOVE    "****" TO CORRECT-A.
210000 UST-WRITE-GF-20-2.
210100     PERFORM PRINT-DETAIL.
210200*
210300 UST-TEST-GF-20-3.
210400     ADD     1 TO REC-CT.
210500     IF      ID4D-X = "*"
210600             PERFORM PASS
210700             GO TO UST-WRITE-GF-20-3
210800     ELSE
210900             GO TO UST-FAIL-GF-20-3.
211000 UST-DELETE-GF-20-3.
211100     PERFORM DE-LETE.
211200     GO TO UST-WRITE-GF-20-3.
211300 UST-FAIL-GF-20-3.
211400     PERFORM FAIL
211500     MOVE    ID4D-X TO COMPUTED-A
211600     MOVE    "*" TO CORRECT-A.
211700 UST-WRITE-GF-20-3.
211800     PERFORM PRINT-DETAIL.
211900*
212000 UST-TEST-GF-20-4.
212100     ADD     1 TO REC-CT.
212200     IF      ID11-DU-2V0 = 3
212300             PERFORM PASS
212400             GO TO UST-WRITE-GF-20-4
212500     ELSE
212600             GO TO UST-FAIL-GF-20-4.
212700 UST-DELETE-GF-20-4.
212800     PERFORM DE-LETE.
212900     GO TO UST-WRITE-GF-20-4.
213000 UST-FAIL-GF-20-4.
213100     PERFORM FAIL
213200     MOVE    ID11-DU-2V0 TO COMPUTED-N
213300     MOVE    3 TO CORRECT-N.
213400 UST-WRITE-GF-20-4.
213500     PERFORM PRINT-DETAIL.
213600*
213700 UST-INIT-GF-21.
213800     MOVE    "UST-TEST-GF-21" TO PAR-NAME.
213900     MOVE    "VI-135" TO ANSI-REFERENCE.
214000     MOVE    "TRUNCATION CHECKS" TO FEATURE.
214100     MOVE    "ABCDEFGHIJKL" TO ID1-XN-12.
214200     MOVE    ALL "*" TO GRP4-XN-10.
214300     MOVE    1 TO  ID11-DU-2V0.
214400     MOVE    1 TO REC-CT.
214500*
214600 UST-TEST-GF-21.
214700     UNSTRING ID1-XN-12
214800             DELIMITED BY "E" OR "H" OR "K" OR "L"
214900             INTO ID4C-XXX ID4B-XX ID4A-X
215000             TALLYING IN ID11-DU-2V0.
215100     GO      TO UST-TEST-GF-21-1.
215200 UNSTRING-DELETE.
215300     PERFORM  DE-LETE.
215400     PERFORM PRINT-DETAIL.
215500     GO TO UST-INIT-GF-22.
215600*
215700 UST-TEST-GF-21-1.
215800     IF      ID4C-XXX = "ABC"
215900             PERFORM PASS
216000             GO TO UST-WRITE-GF-21-1
216100     ELSE
216200             GO TO UST-FAIL-GF-21-1.
216300 UST-DELETE-GF-21-1.
216400     PERFORM DE-LETE.
216500     GO TO UST-WRITE-GF-21-1.
216600 UST-FAIL-GF-21-1.
216700     PERFORM FAIL
216800     MOVE    ID4C-XXX TO COMPUTED-A
216900     MOVE    "ABC" TO CORRECT-A.
217000 UST-WRITE-GF-21-1.
217100     PERFORM PRINT-DETAIL.
217200*
217300 UST-TEST-GF-21-2.
217400     ADD     1 TO REC-CT.
217500     IF      ID4B-XX = "FG"
217600             PERFORM PASS
217700             GO TO UST-WRITE-GF-21-2
217800     ELSE
217900             GO TO UST-FAIL-GF-21-2.
218000 UST-DELETE-GF-21-2.
218100     PERFORM DE-LETE.
218200     GO TO UST-WRITE-GF-21-2.
218300 UST-FAIL-GF-21-2.
218400     PERFORM FAIL
218500     MOVE    ID4B-XX  TO COMPUTED-A
218600     MOVE    "FG" TO CORRECT-A.
218700 UST-WRITE-GF-21-2.
218800     PERFORM PRINT-DETAIL.
218900*
219000 UST-TEST-GF-21-3.
219100     ADD     1 TO REC-CT.
219200     IF      ID4A-X = "I"
219300             PERFORM PASS
219400             GO TO UST-WRITE-GF-21-3
219500     ELSE
219600             GO TO UST-FAIL-GF-21-3.
219700 UST-DELETE-GF-21-3.
219800     PERFORM DE-LETE.
219900     GO TO UST-WRITE-GF-21-3.
220000 UST-FAIL-GF-21-3.
220100     PERFORM FAIL
220200     MOVE    ID4A-X   TO COMPUTED-A
220300     MOVE    "I" TO CORRECT-A.
220400 UST-WRITE-GF-21-3.
220500     PERFORM PRINT-DETAIL.
220600*
220700 UST-TEST-GF-21-4.
220800     ADD     1 TO REC-CT.
220900     IF       ID11-DU-2V0 = 4
221000             PERFORM PASS
221100             GO TO UST-WRITE-GF-21-4
221200     ELSE
221300             GO TO UST-FAIL-GF-21-4.
221400 UST-DELETE-GF-21-4.
221500     PERFORM DE-LETE.
221600     GO TO UST-WRITE-GF-21-4.
221700 UST-FAIL-GF-21-4.
221800     PERFORM FAIL
221900     MOVE     ID11-DU-2V0 TO COMPUTED-N
222000     MOVE    4 TO CORRECT-N.
222100 UST-WRITE-GF-21-4.
222200     PERFORM PRINT-DETAIL.
222300*
222400 UST-INIT-GF-22.
222500*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
222600     MOVE   "VI-138 6.26.4 GR17" TO ANSI-REFERENCE.
222700     MOVE   "UST-TEST-GF-22" TO PAR-NAME.
222800     MOVE   "PIC X " TO FEATURE.
222900     MOVE    ZERO TO ID4-X.
223000     MOVE    "****" TO ID5-XN-4.
223100     MOVE    ZERO TO ID6-DU-2V0.
223200     MOVE    1 TO ID10-DU-2V0.
223300     MOVE ZERO TO ID11-DU-2V0.
223400     MOVE    1 TO REC-CT.
223500*
223600 UST-TEST-GF-22-1.
223700     UNSTRING ID1-XN-7 DELIMITED BY ZERO INTO ID4-X DELIMITER IN
223800             ID5-XN-4 COUNT IN ID6-DU-2V0 WITH POINTER ID10-DU-2V0
223900             TALLYING ID11-DU-2V0
224000         NOT ON OVERFLOW  GO TO UST-FAIL-GF-22-1.
224100     PERFORM PASS.
224200     GO TO UST-WRITE-GF-22-1.
224300 UST-DELETE-GF-22-1.
224400     PERFORM DE-LETE.
224500     PERFORM PRINT-DETAIL.
224600     GO TO   UST-INIT-GF-23.
224700 UST-FAIL-GF-22-1.
224800     PERFORM FAIL.
224900     MOVE   "NOT ON OVERFLOW SHOULD NOT HAVE EXECUTED" TO RE-MARK.
225000 UST-WRITE-GF-22-1.
225100     PERFORM PRINT-DETAIL.
225200*
225300 UST-TEST-GF-22-2.
225400     ADD     1 TO REC-CT.
225500     IF      ID4-X = "1"
225600             PERFORM PASS
225700             GO TO UST-WRITE-GF-22-2
225800     ELSE
225900             GO TO UST-FAIL-GF-22-2.
226000 UST-DELETE-GF-22-2.
226100     PERFORM DE-LETE.
226200     GO TO UST-WRITE-GF-22-2.
226300 UST-FAIL-GF-22-2.
226400     PERFORM FAIL
226500     MOVE    ID4-X TO COMPUTED-A
226600     MOVE    "1" TO CORRECT-A.
226700 UST-WRITE-GF-22-2.
226800     PERFORM PRINT-DETAIL.
226900*
227000 UST-TEST-GF-22-3.
227100     ADD     1 TO REC-CT.
227200     IF      ID5-XN-4 = "0   "
227300             PERFORM PASS
227400             GO TO UST-WRITE-GF-22-3
227500     ELSE
227600             GO TO UST-FAIL-GF-22-3.
227700 UST-DELETE-GF-22-3.
227800     PERFORM DE-LETE.
227900     GO TO UST-WRITE-GF-22-3.
228000 UST-FAIL-GF-22-3.
228100     PERFORM FAIL
228200     MOVE    ID5-XN-4 TO COMPUTED-A
228300     MOVE   "0   " TO CORRECT-A.
228400 UST-WRITE-GF-22-3.
228500     PERFORM PRINT-DETAIL.
228600*
228700 UST-TEST-GF-22-4.
228800     ADD     1 TO REC-CT.
228900     IF      ID6-DU-2V0 = 2
229000             PERFORM PASS
229100             GO TO UST-WRITE-GF-22-4
229200     ELSE
229300             GO TO UST-FAIL-GF-22-4.
229400 UST-DELETE-GF-22-4.
229500     PERFORM DE-LETE.
229600     GO TO UST-WRITE-GF-22-4.
229700 UST-FAIL-GF-22-4.
229800     PERFORM FAIL
229900     MOVE    ID6-DU-2V0 TO COMPUTED-N
230000     MOVE    2 TO CORRECT-N.
230100 UST-WRITE-GF-22-4.
230200     PERFORM PRINT-DETAIL.
230300*
230400 UST-TEST-GF-22-5.
230500     ADD     1 TO REC-CT.
230600     IF      ID10-DU-2V0 = 4
230700             PERFORM PASS
230800             GO TO UST-WRITE-GF-22-5
230900     ELSE
231000             GO TO UST-FAIL-GF-22-5.
231100 UST-DELETE-GF-22-5.
231200     PERFORM DE-LETE.
231300     GO TO UST-WRITE-GF-22-5.
231400 UST-FAIL-GF-22-5.
231500     PERFORM FAIL
231600     MOVE    ID10-DU-2V0 TO COMPUTED-N
231700     MOVE    4 TO CORRECT-N.
231800 UST-WRITE-GF-22-5.
231900     PERFORM PRINT-DETAIL.
232000*
232100 UST-TEST-GF-22-6.
232200     ADD     1 TO REC-CT.
232300     IF      ID11-DU-2V0 = 1
232400             PERFORM PASS
232500             GO TO UST-WRITE-GF-22-6
232600     ELSE
232700             GO TO UST-FAIL-GF-22-6.
232800 UST-DELETE-GF-22-6.
232900     PERFORM DE-LETE.
233000     GO TO UST-WRITE-GF-22-6.
233100 UST-FAIL-GF-22-6.
233200     PERFORM FAIL
233300     MOVE    ID11-DU-2V0 TO COMPUTED-N
233400     MOVE    1 TO CORRECT-N.
233500 UST-WRITE-GF-22-6.
233600     PERFORM PRINT-DETAIL.
233700*
233800 UST-INIT-GF-23.
233900*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
234000     MOVE   "VI-138 6.26.4 GR17" TO ANSI-REFERENCE.
234100     MOVE   "UST-TEST-GF-23" TO PAR-NAME.
234200     MOVE   "OVERFLOW TEST" TO FEATURE.
234300     MOVE    SPACES TO GRP4-XN-6.
234400     MOVE    "****" TO ID5-XN-4.
234500     MOVE    ZERO TO ID6-DU-2V0.
234600     MOVE    1 TO ID10-DU-2V0.
234700     MOVE    ZERO TO ID11-DU-2V0.
234800     MOVE    1 TO REC-CT.
234900*
235000 UST-TEST-GF-23-1.
235100     UNSTRING GRP1-XN-6  INTO ID4A-XXXXX ID4B-X
235200         NOT ON OVERFLOW PERFORM PASS
235300                         GO TO UST-WRITE-GF-23-1.
235400     GO TO   UST-FAIL-GF-23-1.
235500 UST-DELETE-GF-23-1.
235600     PERFORM DE-LETE.
235700     PERFORM PRINT-DETAIL.
235800     GO      TO UST-INIT-GF-24.
235900 UST-FAIL-GF-23-1.
236000     PERFORM FAIL.
236100     MOVE    "OVERFLOW SHOULD NOT HAVE OCCURED" TO RE-MARK.
236200 UST-WRITE-GF-23-1.
236300     PERFORM PRINT-DETAIL.
236400*
236500 UST-TEST-GF-23-2.
236600     ADD     1 TO REC-CT.
236700     IF      GRP4-XN-6 = "ABCDEF"
236800             PERFORM PASS
236900             GO TO UST-WRITE-GF-23-2
237000     ELSE
237100             GO TO UST-FAIL-GF-23-2.
237200 UST-DELETE-GF-23-2.
237300     PERFORM DE-LETE.
237400     GO TO UST-WRITE-GF-23-2.
237500 UST-FAIL-GF-23-2.
237600     PERFORM FAIL
237700     MOVE    GRP4-XN-6 TO COMPUTED-A
237800     MOVE   "ABCDEF" TO CORRECT-A.
237900 UST-WRITE-GF-23-2.
238000     PERFORM PRINT-DETAIL.
238100*
238200 UST-INIT-GF-24.
238300*    ===-->  BOTH "OVERFLOW" PHRASES  <--===
238400     MOVE   "VI-138 6.26.4 GR17" TO ANSI-REFERENCE.
238500     MOVE   "UST-TEST-GF-24" TO PAR-NAME.
238600     MOVE   "PIC X " TO FEATURE.
238700     MOVE    ZERO TO ID4-X.
238800     MOVE    "****" TO ID5-XN-4.
238900     MOVE    ZERO TO ID6-DU-2V0.
239000     MOVE    1 TO ID10-DU-2V0.
239100     MOVE ZERO TO ID11-DU-2V0.
239200     MOVE    1 TO REC-CT.
239300*
239400 UST-TEST-GF-24-1.
239500     UNSTRING ID1-XN-7 DELIMITED BY ZERO INTO ID4-X
239600             DELIMITER IN ID5-XN-4
239700             COUNT IN ID6-DU-2V0
239800             WITH POINTER ID10-DU-2V0
239900             TALLYING ID11-DU-2V0
240000             ON OVERFLOW  PERFORM PASS
240100                          GO TO UST-WRITE-GF-24-1
240200         NOT ON OVERFLOW  GO TO UST-FAIL-GF-24-1.
240300 UST-DELETE-GF-24-1.
240400     PERFORM DE-LETE.
240500     PERFORM PRINT-DETAIL.
240600     GO TO   UST-INIT-GF-25.
240700 UST-FAIL-GF-24-1.
240800     PERFORM FAIL.
240900     MOVE   "ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK.
241000 UST-WRITE-GF-24-1.
241100     PERFORM PRINT-DETAIL.
241200*
241300 UST-TEST-GF-24-2.
241400     ADD     1 TO REC-CT.
241500     IF      ID4-X = "1"
241600             PERFORM PASS
241700             GO TO UST-WRITE-GF-24-2
241800     ELSE
241900             GO TO UST-FAIL-GF-24-2.
242000 UST-DELETE-GF-24-2.
242100     PERFORM DE-LETE.
242200     GO TO UST-WRITE-GF-24-2.
242300 UST-FAIL-GF-24-2.
242400     PERFORM FAIL
242500     MOVE    ID4-X TO COMPUTED-A
242600     MOVE    "1" TO CORRECT-A.
242700 UST-WRITE-GF-24-2.
242800     PERFORM PRINT-DETAIL.
242900*
243000 UST-TEST-GF-24-3.
243100     ADD     1 TO REC-CT.
243200     IF      ID5-XN-4 = "0   "
243300             PERFORM PASS
243400             GO TO UST-WRITE-GF-24-3
243500     ELSE
243600             GO TO UST-FAIL-GF-24-3.
243700 UST-DELETE-GF-24-3.
243800     PERFORM DE-LETE.
243900     GO TO UST-WRITE-GF-24-3.
244000 UST-FAIL-GF-24-3.
244100     PERFORM FAIL
244200     MOVE    ID5-XN-4 TO COMPUTED-A
244300     MOVE   "0   " TO CORRECT-A.
244400 UST-WRITE-GF-24-3.
244500     PERFORM PRINT-DETAIL.
244600*
244700 UST-TEST-GF-24-4.
244800     ADD     1 TO REC-CT.
244900     IF      ID6-DU-2V0 = 2
245000             PERFORM PASS
245100             GO TO UST-WRITE-GF-24-4
245200     ELSE
245300             GO TO UST-FAIL-GF-24-4.
245400 UST-DELETE-GF-24-4.
245500     PERFORM DE-LETE.
245600     GO TO UST-WRITE-GF-24-4.
245700 UST-FAIL-GF-24-4.
245800     PERFORM FAIL
245900     MOVE    ID6-DU-2V0 TO COMPUTED-N
246000     MOVE    2 TO CORRECT-N.
246100 UST-WRITE-GF-24-4.
246200     PERFORM PRINT-DETAIL.
246300*
246400 UST-TEST-GF-24-5.
246500     ADD     1 TO REC-CT.
246600     IF      ID10-DU-2V0 = 4
246700             PERFORM PASS
246800             GO TO UST-WRITE-GF-24-5
246900     ELSE
247000             GO TO UST-FAIL-GF-24-5.
247100 UST-DELETE-GF-24-5.
247200     PERFORM DE-LETE.
247300     GO TO UST-WRITE-GF-24-5.
247400 UST-FAIL-GF-24-5.
247500     PERFORM FAIL
247600     MOVE    ID10-DU-2V0 TO COMPUTED-N
247700     MOVE    4 TO CORRECT-N.
247800 UST-WRITE-GF-24-5.
247900     PERFORM PRINT-DETAIL.
248000*
248100 UST-TEST-GF-24-6.
248200     ADD     1 TO REC-CT.
248300     IF      ID11-DU-2V0 = 1
248400             PERFORM PASS
248500             GO TO UST-WRITE-GF-24-6
248600     ELSE
248700             GO TO UST-FAIL-GF-24-6.
248800 UST-DELETE-GF-24-6.
248900     PERFORM DE-LETE.
249000     GO TO UST-WRITE-GF-24-6.
249100 UST-FAIL-GF-24-6.
249200     PERFORM FAIL
249300     MOVE    ID11-DU-2V0 TO COMPUTED-N
249400     MOVE    1 TO CORRECT-N.
249500 UST-WRITE-GF-24-6.
249600     PERFORM PRINT-DETAIL.
249700*
249800 UST-INIT-GF-25.
249900*    ===-->  BOTH "OVERFLOW" PHRASES  <--===
250000     MOVE   "VI-138 6.26.4 GR17" TO ANSI-REFERENCE.
250100     MOVE   "UST-TEST-GF-25" TO PAR-NAME.
250200     MOVE   "OVERFLOW TEST" TO FEATURE.
250300     MOVE    SPACES TO GRP4-XN-6.
250400     MOVE    "****" TO ID5-XN-4.
250500     MOVE    ZERO TO ID6-DU-2V0.
250600     MOVE    1 TO ID10-DU-2V0.
250700     MOVE    ZERO TO ID11-DU-2V0.
250800     MOVE    1 TO REC-CT.
250900*
251000 UST-TEST-GF-25-1.
251100     UNSTRING GRP1-XN-6  INTO ID4A-XXXXX ID4B-X
251200             ON OVERFLOW GO TO UST-FAIL-GF-25-1
251300         NOT ON OVERFLOW PERFORM PASS
251400                         GO TO UST-WRITE-GF-25-1.
251500 UST-DELETE-GF-25-1.
251600     PERFORM DE-LETE.
251700     PERFORM PRINT-DETAIL.
251800     GO      TO UST-INIT-GF-26.
251900 UST-FAIL-GF-25-1.
252000     PERFORM FAIL.
252100     MOVE    "ON OVERFLOW SHOULD NOT HAVE EXECUTED" TO RE-MARK.
252200 UST-WRITE-GF-25-1.
252300     PERFORM PRINT-DETAIL.
252400*
252500 UST-TEST-GF-25-2.
252600     ADD     1 TO REC-CT.
252700     IF      GRP4-XN-6 = "ABCDEF"
252800             PERFORM PASS
252900             GO TO UST-WRITE-GF-25-2
253000     ELSE
253100             GO TO UST-FAIL-GF-25-2.
253200 UST-DELETE-GF-25-2.
253300     PERFORM DE-LETE.
253400     GO TO UST-WRITE-GF-25-2.
253500 UST-FAIL-GF-25-2.
253600     PERFORM FAIL
253700     MOVE    GRP4-XN-6 TO COMPUTED-A
253800     MOVE   "ABCDEF" TO CORRECT-A.
253900 UST-WRITE-GF-25-2.
254000     PERFORM PRINT-DETAIL.
254100*
254200 UST-INIT-GF-26.
254300*    ===-->  EXPLICIT SCOPE TERMINATOR  <--===
254400     MOVE   "VI-138 6.26.4 GR19" TO ANSI-REFERENCE.
254500     MOVE   "ABCDEF" TO GRP1-XN-6.
254600     MOVE    SPACE TO WRK-XN-00001-1.
254700     MOVE    SPACE TO WRK-XN-00001-2.
254800     MOVE    SPACE TO WRK-XN-00001-3.
254900     MOVE    ZERO TO REC-CT.
255000*
255100 UST-TEST-GF-26-0.
255200     UNSTRING GRP1-XN-6  INTO ID4A-XXXXX ID4B-X
255300             ON OVERFLOW
255400                     MOVE "A" TO WRK-XN-00001-1
255500                     MOVE "B" TO WRK-XN-00001-2
255600         NOT ON OVERFLOW
255700                     MOVE "C" TO WRK-XN-00001-1
255800                     MOVE "D" TO WRK-XN-00001-2
255900     END-UNSTRING
256000     MOVE   "Z"  TO WRK-XN-00001-3.
256100     GO TO   UST-TEST-GF-26-1.
256200 UST-DELETE-GF-26.
256300     PERFORM DE-LETE.
256400     PERFORM PRINT-DETAIL.
256500     GO      TO UST-INIT-GF-27.
256600*
256700 UST-TEST-GF-26-1.
256800     ADD     1 TO REC-CT.
256900     IF      GRP4-XN-6 = "ABCDEF"
257000             PERFORM PASS
257100             GO TO UST-WRITE-GF-26-1
257200     ELSE
257300             GO TO UST-FAIL-GF-26-1.
257400 UST-DELETE-GF-26-1.
257500     PERFORM DE-LETE.
257600     GO TO UST-WRITE-GF-26-1.
257700 UST-FAIL-GF-26-1.
257800     PERFORM FAIL
257900     MOVE    GRP4-XN-6 TO COMPUTED-A
258000     MOVE   "ABCDEF" TO CORRECT-A.
258100 UST-WRITE-GF-26-1.
258200     PERFORM PRINT-DETAIL.
258300*
258400 UST-TEST-GF-26-2.
258500     ADD     1 TO REC-CT.
258600     IF      WRK-XN-00001-1 = "C"
258700             PERFORM PASS
258800             GO TO UST-WRITE-GF-26-2
258900     ELSE
259000             GO TO UST-FAIL-GF-26-2.
259100 UST-DELETE-GF-26-2.
259200     PERFORM DE-LETE.
259300     GO TO UST-WRITE-GF-26-2.
259400 UST-FAIL-GF-26-2.
259500     MOVE    WRK-XN-00001-1 TO COMPUTED-A
259600     MOVE   "C" TO CORRECT-A.
259700     MOVE   "NOT ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK
259800     PERFORM FAIL.
259900 UST-WRITE-GF-26-2.
260000     PERFORM PRINT-DETAIL.
260100*
260200 UST-TEST-GF-26-3.
260300     ADD     1 TO REC-CT.
260400     IF      WRK-XN-00001-2 = "D"
260500             PERFORM PASS
260600             GO TO UST-WRITE-GF-26-3
260700     ELSE
260800             GO TO UST-FAIL-GF-26-3.
260900 UST-DELETE-GF-26-3.
261000     PERFORM DE-LETE.
261100     GO TO UST-WRITE-GF-26-3.
261200 UST-FAIL-GF-26-3.
261300     MOVE    WRK-XN-00001-2 TO COMPUTED-A
261400     MOVE   "D" TO CORRECT-A.
261500     MOVE   "NOT ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK
261600     PERFORM FAIL.
261700 UST-WRITE-GF-26-3.
261800     PERFORM PRINT-DETAIL.
261900*
262000 UST-TEST-GF-26-4.
262100     ADD     1 TO REC-CT.
262200     IF      WRK-XN-00001-3 = "Z"
262300             PERFORM PASS
262400             GO TO UST-WRITE-GF-26-4
262500     ELSE
262600             GO TO UST-FAIL-GF-26-4.
262700 UST-DELETE-GF-26-4.
262800     PERFORM DE-LETE.
262900     GO TO UST-WRITE-GF-26-4.
263000 UST-FAIL-GF-26-4.
263100     MOVE    WRK-XN-00001-3 TO COMPUTED-A
263200     MOVE   "Z" TO CORRECT-A.
263300     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
263400     PERFORM FAIL.
263500 UST-WRITE-GF-26-4.
263600     PERFORM PRINT-DETAIL.
263700*
263800 UST-INIT-GF-27.
263900*    ===-->  EXPLICIT SCOPE TERMINATOR  <--===
264000     MOVE   "VI-138 6.26.4 GR17" TO ANSI-REFERENCE.
264100     MOVE   "UST-TEST-GF-27" TO PAR-NAME.
264200     MOVE   "PIC X " TO FEATURE.
264300     MOVE   "1200000" TO ID1-XN-7.
264400     MOVE    ZERO TO ID4-X.
264500     MOVE    "****" TO ID5-XN-4.
264600     MOVE    ZERO TO ID6-DU-2V0.
264700     MOVE    1 TO ID10-DU-2V0.
264800     MOVE    ZERO TO ID11-DU-2V0.
264900     MOVE    ZERO TO REC-CT.
265000     MOVE    SPACE TO WRK-XN-00001-1.
265100     MOVE    SPACE TO WRK-XN-00001-2.
265200     MOVE    SPACE TO WRK-XN-00001-3.
265300*
265400 UST-TEST-GF-27-0.
265500     UNSTRING ID1-XN-7 DELIMITED BY ZERO INTO ID4-X
265600             DELIMITER IN ID5-XN-4
265700             COUNT IN ID6-DU-2V0
265800             WITH POINTER ID10-DU-2V0
265900             TALLYING ID11-DU-2V0
266000             ON OVERFLOW
266100                     MOVE "A" TO WRK-XN-00001-1
266200                     MOVE "B" TO WRK-XN-00001-2
266300     END-UNSTRING
266400     MOVE   "Z"  TO WRK-XN-00001-3.
266500     GO TO   UST-TEST-GF-27-1.
266600 UST-DELETE-GF-27.
266700     PERFORM DE-LETE.
266800     PERFORM PRINT-DETAIL.
266900     GO TO   UST-INIT-GF-28.
267000*
267100 UST-TEST-GF-27-1.
267200     ADD     1 TO REC-CT.
267300     IF      ID4-X = "1"
267400             PERFORM PASS
267500             GO TO UST-WRITE-GF-27-1
267600     ELSE
267700             GO TO UST-FAIL-GF-27-1.
267800 UST-DELETE-GF-27-1.
267900     PERFORM DE-LETE.
268000     GO TO UST-WRITE-GF-27-1.
268100 UST-FAIL-GF-27-1.
268200     PERFORM FAIL
268300     MOVE    ID4-X TO COMPUTED-A
268400     MOVE    "1" TO CORRECT-A.
268500 UST-WRITE-GF-27-1.
268600     PERFORM PRINT-DETAIL.
268700*
268800 UST-TEST-GF-27-2.
268900     ADD     1 TO REC-CT.
269000     IF      ID5-XN-4 = "0   "
269100             PERFORM PASS
269200             GO TO UST-WRITE-GF-27-2
269300     ELSE
269400             GO TO UST-FAIL-GF-27-2.
269500 UST-DELETE-GF-27-2.
269600     PERFORM DE-LETE.
269700     GO TO UST-WRITE-GF-27-2.
269800 UST-FAIL-GF-27-2.
269900     PERFORM FAIL
270000     MOVE    ID5-XN-4 TO COMPUTED-A
270100     MOVE   "0   " TO CORRECT-A.
270200 UST-WRITE-GF-27-2.
270300     PERFORM PRINT-DETAIL.
270400*
270500 UST-TEST-GF-27-3.
270600     ADD     1 TO REC-CT.
270700     IF      ID6-DU-2V0 = 2
270800             PERFORM PASS
270900             GO TO UST-WRITE-GF-27-3
271000     ELSE
271100             GO TO UST-FAIL-GF-27-3.
271200 UST-DELETE-GF-27-3.
271300     PERFORM DE-LETE.
271400     GO TO UST-WRITE-GF-27-3.
271500 UST-FAIL-GF-27-3.
271600     PERFORM FAIL
271700     MOVE    ID6-DU-2V0 TO COMPUTED-N
271800     MOVE    2 TO CORRECT-N.
271900 UST-WRITE-GF-27-3.
272000     PERFORM PRINT-DETAIL.
272100*
272200 UST-TEST-GF-27-4.
272300     ADD     1 TO REC-CT.
272400     IF      ID10-DU-2V0 = 4
272500             PERFORM PASS
272600             GO TO UST-WRITE-GF-27-4
272700     ELSE
272800             GO TO UST-FAIL-GF-27-4.
272900 UST-DELETE-GF-27-4.
273000     PERFORM DE-LETE.
273100     GO TO UST-WRITE-GF-27-4.
273200 UST-FAIL-GF-27-4.
273300     PERFORM FAIL
273400     MOVE    ID10-DU-2V0 TO COMPUTED-N
273500     MOVE    4 TO CORRECT-N.
273600 UST-WRITE-GF-27-4.
273700     PERFORM PRINT-DETAIL.
273800*
273900 UST-TEST-GF-27-5.
274000     ADD     1 TO REC-CT.
274100     IF      ID11-DU-2V0 = 1
274200             PERFORM PASS
274300             GO TO UST-WRITE-GF-27-5
274400     ELSE
274500             GO TO UST-FAIL-GF-27-5.
274600 UST-DELETE-GF-27-5.
274700     PERFORM DE-LETE.
274800     GO TO UST-WRITE-GF-27-5.
274900 UST-FAIL-GF-27-5.
275000     PERFORM FAIL
275100     MOVE    ID11-DU-2V0 TO COMPUTED-N
275200     MOVE    1 TO CORRECT-N.
275300 UST-WRITE-GF-27-5.
275400*
275500 UST-INIT-GF-28.
275600*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
275700     MOVE   "VI-138 6.26.4 GR17" TO ANSI-REFERENCE.
275800     MOVE   "UST-TEST-GF-28" TO PAR-NAME.
275900     MOVE   "OVERFLOW TEST" TO FEATURE.
276000     MOVE   "ABCDEF" TO GRP1-XN-6.
276100     MOVE    SPACES TO GRP4-XN-6.
276200     MOVE    "****" TO ID5-XN-4.
276300     MOVE    ZERO TO ID6-DU-2V0.
276400     MOVE    1 TO ID10-DU-2V0.
276500     MOVE    ZERO TO ID11-DU-2V0.
276600     MOVE    ZERO TO REC-CT.
276700     MOVE    SPACE TO WRK-XN-00001-1.
276800     MOVE    SPACE TO WRK-XN-00001-2.
276900     MOVE    SPACE TO WRK-XN-00001-3.
277000*
277100 UST-TEST-GF-28-0.
277200     UNSTRING GRP1-XN-6  INTO ID4A-XXXXX ID4B-X
277300             ON OVERFLOW
277400                     MOVE "A" TO WRK-XN-00001-1
277500                     MOVE "B" TO WRK-XN-00001-2
277600     END-UNSTRING
277700     MOVE   "Z"  TO WRK-XN-00001-3.
277800     GO TO   UST-TEST-GF-28-1.
277900 UST-DELETE-GF-28.
278000     PERFORM DE-LETE.
278100     PERFORM PRINT-DETAIL.
278200     GO      TO UST-INIT-GF-29.
278300*
278400 UST-TEST-GF-28-1.
278500     ADD     1 TO REC-CT.
278600     IF      GRP4-XN-6 = "ABCDEF"
278700             PERFORM PASS
278800             GO TO UST-WRITE-GF-28-1
278900     ELSE
279000             GO TO UST-FAIL-GF-28-1.
279100 UST-DELETE-GF-28-1.
279200     PERFORM DE-LETE.
279300     GO TO UST-WRITE-GF-28-1.
279400 UST-FAIL-GF-28-1.
279500     PERFORM FAIL
279600     MOVE    GRP4-XN-6 TO COMPUTED-A
279700     MOVE   "ABCDEF" TO CORRECT-A.
279800 UST-WRITE-GF-28-1.
279900     PERFORM PRINT-DETAIL.
280000*
280100*
280200 UST-INIT-GF-29.
280300*    ===-->  EXPLICIT SCOPE TERMINATOR  <--===
280400     MOVE   "VI-138 6.26.4 GR17" TO ANSI-REFERENCE.
280500     MOVE   "UST-TEST-GF-29" TO PAR-NAME.
280600     MOVE   "PIC X " TO FEATURE.
280700     MOVE   "1200000" TO ID1-XN-7.
280800     MOVE    ZERO TO ID4-X.
280900     MOVE    "****" TO ID5-XN-4.
281000     MOVE    ZERO TO ID6-DU-2V0.
281100     MOVE    1 TO ID10-DU-2V0.
281200     MOVE    ZERO TO ID11-DU-2V0.
281300     MOVE    ZERO TO REC-CT.
281400     MOVE    SPACE TO WRK-XN-00001-1.
281500     MOVE    SPACE TO WRK-XN-00001-2.
281600     MOVE    SPACE TO WRK-XN-00001-3.
281700*
281800 UST-TEST-GF-29-0.
281900     UNSTRING ID1-XN-7 DELIMITED BY ZERO INTO ID4-X
282000             DELIMITER IN ID5-XN-4
282100             COUNT IN ID6-DU-2V0
282200             WITH POINTER ID10-DU-2V0
282300             TALLYING ID11-DU-2V0
282400         NOT ON OVERFLOW
282500                     MOVE "A" TO WRK-XN-00001-1
282600                     MOVE "B" TO WRK-XN-00001-2
282700     END-UNSTRING
282800     MOVE   "Z"  TO WRK-XN-00001-3.
282900     GO TO   UST-TEST-GF-29-1.
283000 UST-DELETE-GF-29.
283100     PERFORM DE-LETE.
283200     PERFORM PRINT-DETAIL.
283300     GO TO   UST-INIT-GF-30.
283400*
283500 UST-TEST-GF-29-1.
283600     MOVE   "UST-TEST-GF-29-1" TO PAR-NAME.
283700     ADD     1 TO REC-CT.
283800     IF      ID4-X = "1"
283900             PERFORM PASS
284000             GO TO UST-WRITE-GF-29-1
284100     ELSE
284200             GO TO UST-FAIL-GF-29-1.
284300 UST-DELETE-GF-29-1.
284400     PERFORM DE-LETE.
284500     GO TO UST-WRITE-GF-29-1.
284600 UST-FAIL-GF-29-1.
284700     PERFORM FAIL
284800     MOVE    ID4-X TO COMPUTED-A
284900     MOVE    "1" TO CORRECT-A.
285000 UST-WRITE-GF-29-1.
285100     PERFORM PRINT-DETAIL.
285200*
285300 UST-TEST-GF-29-2.
285400     ADD     1 TO REC-CT.
285500     IF      ID5-XN-4 = "0   "
285600             PERFORM PASS
285700             GO TO UST-WRITE-GF-29-2
285800     ELSE
285900             GO TO UST-FAIL-GF-29-2.
286000 UST-DELETE-GF-29-2.
286100     PERFORM DE-LETE.
286200     GO TO UST-WRITE-GF-29-2.
286300 UST-FAIL-GF-29-2.
286400     PERFORM FAIL
286500     MOVE    ID5-XN-4 TO COMPUTED-A
286600     MOVE   "0   " TO CORRECT-A.
286700 UST-WRITE-GF-29-2.
286800     PERFORM PRINT-DETAIL.
286900*
287000 UST-TEST-GF-29-3.
287100     ADD     1 TO REC-CT.
287200     IF      ID6-DU-2V0 = 2
287300             PERFORM PASS
287400             GO TO UST-WRITE-GF-29-3
287500     ELSE
287600             GO TO UST-FAIL-GF-29-3.
287700 UST-DELETE-GF-29-3.
287800     PERFORM DE-LETE.
287900     GO TO UST-WRITE-GF-29-3.
288000 UST-FAIL-GF-29-3.
288100     PERFORM FAIL
288200     MOVE    ID6-DU-2V0 TO COMPUTED-N
288300     MOVE    2 TO CORRECT-N.
288400 UST-WRITE-GF-29-3.
288500     PERFORM PRINT-DETAIL.
288600*
288700 UST-TEST-GF-29-4.
288800     ADD     1 TO REC-CT.
288900     IF      ID10-DU-2V0 = 4
289000             PERFORM PASS
289100             GO TO UST-WRITE-GF-29-4
289200     ELSE
289300             GO TO UST-FAIL-GF-29-4.
289400 UST-DELETE-GF-29-4.
289500     PERFORM DE-LETE.
289600     GO TO UST-WRITE-GF-29-4.
289700 UST-FAIL-GF-29-4.
289800     PERFORM FAIL
289900     MOVE    ID10-DU-2V0 TO COMPUTED-N
290000     MOVE    4 TO CORRECT-N.
290100 UST-WRITE-GF-29-4.
290200     PERFORM PRINT-DETAIL.
290300*
290400 UST-TEST-GF-29-5.
290500     ADD     1 TO REC-CT.
290600     IF      ID11-DU-2V0 = 1
290700             PERFORM PASS
290800             GO TO UST-WRITE-GF-29-5
290900     ELSE
291000             GO TO UST-FAIL-GF-29-5.
291100 UST-DELETE-GF-29-5.
291200     PERFORM DE-LETE.
291300     GO TO UST-WRITE-GF-29-5.
291400 UST-FAIL-GF-29-5.
291500     PERFORM FAIL
291600     MOVE    ID11-DU-2V0 TO COMPUTED-N
291700     MOVE    1 TO CORRECT-N.
291800 UST-WRITE-GF-29-5.
291900     PERFORM PRINT-DETAIL.
292000*
292100 UST-TEST-GF-29-6.
292200     ADD     1 TO REC-CT.
292300     IF      WRK-XN-00001-1 = SPACE
292400             PERFORM PASS
292500             GO TO UST-WRITE-GF-29-6
292600     ELSE
292700             GO TO UST-FAIL-GF-29-6.
292800 UST-DELETE-GF-29-6.
292900     PERFORM DE-LETE.
293000     GO TO UST-WRITE-GF-29-6.
293100 UST-FAIL-GF-29-6.
293200     MOVE    WRK-XN-00001-1 TO COMPUTED-A
293300     MOVE    SPACE TO CORRECT-A.
293400     MOVE "NOT ON OVERFLOW SHOULD NOT HAVE EXECUTED" TO RE-MARK
293500     PERFORM FAIL.
293600 UST-WRITE-GF-29-6.
293700     PERFORM PRINT-DETAIL.
293800*
293900 UST-TEST-GF-29-7.
294000     ADD     1 TO REC-CT.
294100     IF      WRK-XN-00001-2 = SPACE
294200             PERFORM PASS
294300             GO TO UST-WRITE-GF-29-7
294400     ELSE
294500             GO TO UST-FAIL-GF-29-7.
294600 UST-DELETE-GF-29-7.
294700     PERFORM DE-LETE.
294800     GO TO UST-WRITE-GF-29-7.
294900 UST-FAIL-GF-29-7.
295000     MOVE    WRK-XN-00001-2 TO COMPUTED-A
295100     MOVE    SPACE TO CORRECT-A.
295200     MOVE "NOT ON OVERFLOW SHOULD NOT HAVE EXECUTED" TO RE-MARK.
295300     PERFORM FAIL.
295400 UST-WRITE-GF-29-7.
295500     PERFORM PRINT-DETAIL.
295600*
295700 UST-TEST-GF-29-8.
295800     ADD     1 TO REC-CT.
295900     IF      WRK-XN-00001-3 = "Z"
296000             PERFORM PASS
296100             GO TO UST-WRITE-GF-29-8
296200     ELSE
296300             GO TO UST-FAIL-GF-29-8.
296400 UST-DELETE-GF-29-8.
296500     PERFORM DE-LETE.
296600     GO TO UST-WRITE-GF-29-8.
296700 UST-FAIL-GF-29-8.
296800     MOVE    WRK-XN-00001-3 TO COMPUTED-A
296900     MOVE   "Z" TO CORRECT-A.
297000     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
297100     PERFORM FAIL.
297200 UST-WRITE-GF-29-8.
297300     PERFORM PRINT-DETAIL.
297400*
297500 UST-INIT-GF-30.
297600*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
297700     MOVE   "VI-138 6.26.4 GR17" TO ANSI-REFERENCE.
297800     MOVE   "UST-TEST-GF-30" TO PAR-NAME.
297900     MOVE   "OVERFLOW TEST" TO FEATURE.
298000     MOVE   "ABCDEF" TO GRP1-XN-6.
298100     MOVE    SPACES TO GRP4-XN-6.
298200     MOVE    "****" TO ID5-XN-4.
298300     MOVE    ZERO TO ID6-DU-2V0.
298400     MOVE    1 TO ID10-DU-2V0.
298500     MOVE    ZERO TO ID11-DU-2V0.
298600     MOVE    ZERO TO REC-CT.
298700     MOVE    SPACE TO WRK-XN-00001-1.
298800     MOVE    SPACE TO WRK-XN-00001-2.
298900     MOVE    SPACE TO WRK-XN-00001-3.
299000*
299100 UST-TEST-GF-30-0.
299200     UNSTRING GRP1-XN-6  INTO ID4A-XXXXX ID4B-X
299300         NOT ON OVERFLOW
299400                     MOVE "A" TO WRK-XN-00001-1
299500                     MOVE "B" TO WRK-XN-00001-2
299600     END-UNSTRING
299700     MOVE   "Z"  TO WRK-XN-00001-3.
299800     GO TO   UST-TEST-GF-30-1.
299900 UST-DELETE-GF-30.
300000     PERFORM DE-LETE.
300100     PERFORM PRINT-DETAIL.
300200     GO      TO CCVS-EXIT.
300300*
300400 UST-TEST-GF-30-1.
300500     MOVE    1 TO REC-CT.
300600     IF      GRP4-XN-6 = "ABCDEF"
300700             PERFORM PASS
300800             GO TO UST-WRITE-GF-30-1
300900     ELSE
301000             GO TO UST-FAIL-GF-30-1.
301100 UST-DELETE-GF-30-1.
301200     PERFORM DE-LETE.
301300     GO TO UST-WRITE-GF-30-1.
301400 UST-FAIL-GF-30-1.
301500     PERFORM FAIL
301600     MOVE    GRP4-XN-6 TO COMPUTED-A
301700     MOVE   "ABCDEF" TO CORRECT-A.
301800 UST-WRITE-GF-30-1.
301900     PERFORM PRINT-DETAIL.
302000*
302100 UST-TEST-GF-30-2.
302200     ADD     1 TO REC-CT.
302300     IF      WRK-XN-00001-1 = "A"
302400             PERFORM PASS
302500             GO TO UST-WRITE-GF-30-2
302600     ELSE
302700             GO TO UST-FAIL-GF-30-2.
302800 UST-DELETE-GF-30-2.
302900     PERFORM DE-LETE.
303000     GO TO UST-WRITE-GF-30-2.
303100 UST-FAIL-GF-30-2.
303200     MOVE    WRK-XN-00001-1 TO COMPUTED-A
303300     MOVE   "A"    TO CORRECT-A.
303400     MOVE   "NOT ON OVERFLOW SHOULD HAVE EXECUTED"  TO RE-MARK.
303500     PERFORM FAIL.
303600 UST-WRITE-GF-30-2.
303700     PERFORM PRINT-DETAIL.
303800*
303900 UST-TEST-GF-30-3.
304000     ADD     1 TO REC-CT.
304100     IF      WRK-XN-00001-2 = "B"
304200             PERFORM PASS
304300             GO TO UST-WRITE-GF-30-3
304400     ELSE
304500             GO TO UST-FAIL-GF-30-3.
304600 UST-DELETE-GF-30-3.
304700     PERFORM DE-LETE.
304800     GO TO UST-WRITE-GF-30-3.
304900 UST-FAIL-GF-30-3.
305000     MOVE    WRK-XN-00001-2 TO COMPUTED-A
305100     MOVE   "B"    TO CORRECT-A.
305200     MOVE   "NOT ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK.
305300     PERFORM FAIL.
305400 UST-WRITE-GF-30-3.
305500     PERFORM PRINT-DETAIL.
305600*
305700 UST-TEST-GF-30-4.
305800     ADD     1 TO REC-CT.
305900     IF      WRK-XN-00001-3 = "Z"
306000             PERFORM PASS
306100             GO TO UST-WRITE-GF-30-4
306200     ELSE
306300             GO TO UST-FAIL-GF-30-4.
306400 UST-DELETE-GF-30-4.
306500     PERFORM DE-LETE.
306600     GO TO UST-WRITE-GF-30-4.
306700 UST-FAIL-GF-30-4.
306800     MOVE    WRK-XN-00001-3 TO COMPUTED-A
306900     MOVE   "Z" TO CORRECT-A.
307000     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
307100     PERFORM FAIL.
307200 UST-WRITE-GF-30-4.
307300     PERFORM PRINT-DETAIL.
307400*
307500 CCVS-EXIT SECTION.
307600 CCVS-999999.
307700     GO TO CLOSE-FILES.
