000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC217A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM NC217A TESTS THE USE OF THE "STRING" STATEMENT,   *
002300*    INCLUDING THE OPTIONAL PHRASES "POINTER", "OVERFLOW",     *
002400*    "NOT OVERFLOW" AND "END-STRING".                          *
002500*                                                              *
002600*                                                              *
002700****************************************************************
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 01  WRK-XN-00001-1     PIC X.
004500 01  WRK-XN-00001-2     PIC X.
004600 01  WRK-XN-00001-3     PIC X.
004700 01  ID8-DU-2V0 PIC 99.
004800 01  ISUB-DU-2V0 PIC 99.
004900 01  MY-BOSS-DU-2V0 PIC 99 VALUE ZERO.
005000 01  ID1-DS-LS-4 PIC S9(4) VALUE +1001 SIGN IS LEADING SEPARATE.
005100 01  ID1-DS-TS-4 PIC S9(4) VALUE +1001 SIGN IS TRAILING SEPARATE.
005200 01  ID1-XN-25 PIC X(25) VALUE
005300     "A2345B2345C2345D2345E2345".
005400 01  ID1-XN-X-25 REDEFINES ID1-XN-25.
005500     10 ID1-1 PIC X OCCURS 5 TIMES.
005600     10 ID1-2 PIC X OCCURS 5 TIMES.
005700     10 ID1-3 PIC X OCCURS 5 TIMES.
005800     10 ID1-4 PIC X OCCURS 5 TIMES.
005900     10 ID1-5 PIC X OCCURS 5 TIMES.
006000 01  ZEROX-XN-1 PIC X VALUE ZERO.
006100 01  A-XN-1 PIC X VALUE "A".
006200 01  B-XN-1 PIC X VALUE "B".
006300 01  AB-XN-2 PIC XX VALUE "AB".
006400 01  ID7-XN-5 PIC X(5).
006500 01  ASTER-XN-5 PIC X(5) VALUE "*****".
006600 01  ANS-XN-5-1.
006700     10 FILLER PIC X VALUE LOW-VALUE.
006800     10 FILLER PIC X(4) VALUE "ABCD".
006900 01  ANS-XN-5-2.
007000     10 FILLER PIC X VALUE HIGH-VALUE.
007100     10 FILLER PIC X(4) VALUE "****".
007200 01  DELIM-TABLE-XN-5 PIC X(5) VALUE "CDEFF".
007300 01  DELIM-XN-X-1 REDEFINES DELIM-TABLE-XN-5.
007400     10 ID3-XN-1 PIC X OCCURS 5 TIMES.
007500 01  ABCDEFG-XN-7 PIC X(7) VALUE "ABCDEFG".
007600 01  ID7-XN-15  PIC X(15) VALUE SPACES.
007700 01  WISH-LIST-XN-37 PIC X(37) VALUE SPACES.
007800 01  ANS-XN-37 PIC X(37) VALUE
007900     "GEE I WISH I WAS A FORTRAN PROGRAMMER".
008000 01  TEST-21-GROUP.
008100   03  TEST-21-A                 PIC XX.
008200   03  TEST-21-B                 PIC XX.
008300   03  TEST-21-C                 PIC X.
008400
008500 01  TEST-RESULTS.
008600     02 FILLER                   PIC X      VALUE SPACE.
008700     02 FEATURE                  PIC X(20)  VALUE SPACE.
008800     02 FILLER                   PIC X      VALUE SPACE.
008900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
009000     02 FILLER                   PIC X      VALUE SPACE.
009100     02  PAR-NAME.
009200       03 FILLER                 PIC X(19)  VALUE SPACE.
009300       03  PARDOT-X              PIC X      VALUE SPACE.
009400       03 DOTVALUE               PIC 99     VALUE ZERO.
009500     02 FILLER                   PIC X(8)   VALUE SPACE.
009600     02 RE-MARK                  PIC X(61).
009700 01  TEST-COMPUTED.
009800     02 FILLER                   PIC X(30)  VALUE SPACE.
009900     02 FILLER                   PIC X(17)  VALUE
010000            "       COMPUTED=".
010100     02 COMPUTED-X.
010200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
010300     03 COMPUTED-N               REDEFINES COMPUTED-A
010400                                 PIC -9(9).9(9).
010500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
010600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
010700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
010800     03       CM-18V0 REDEFINES COMPUTED-A.
010900         04 COMPUTED-18V0                    PIC -9(18).
011000         04 FILLER                           PIC X.
011100     03 FILLER PIC X(50) VALUE SPACE.
011200 01  TEST-CORRECT.
011300     02 FILLER PIC X(30) VALUE SPACE.
011400     02 FILLER PIC X(17) VALUE "       CORRECT =".
011500     02 CORRECT-X.
011600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
011700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
011800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
011900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
012000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
012100     03      CR-18V0 REDEFINES CORRECT-A.
012200         04 CORRECT-18V0                     PIC -9(18).
012300         04 FILLER                           PIC X.
012400     03 FILLER PIC X(2) VALUE SPACE.
012500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012600 01  CCVS-C-1.
012700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
012800-    "SS  PARAGRAPH-NAME
012900-    "       REMARKS".
013000     02 FILLER                     PIC X(20)    VALUE SPACE.
013100 01  CCVS-C-2.
013200     02 FILLER                     PIC X        VALUE SPACE.
013300     02 FILLER                     PIC X(6)     VALUE "TESTED".
013400     02 FILLER                     PIC X(15)    VALUE SPACE.
013500     02 FILLER                     PIC X(4)     VALUE "FAIL".
013600     02 FILLER                     PIC X(94)    VALUE SPACE.
013700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
013800 01  REC-CT                        PIC 99       VALUE ZERO.
013900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
014000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
014100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
014200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
014800 01  CCVS-H-1.
014900     02  FILLER                    PIC X(39)    VALUE SPACES.
015000     02  FILLER                    PIC X(42)    VALUE
015100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
015200     02  FILLER                    PIC X(39)    VALUE SPACES.
015300 01  CCVS-H-2A.
015400   02  FILLER                        PIC X(40)  VALUE SPACE.
015500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015600   02  FILLER                        PIC XXXX   VALUE
015700     "4.2 ".
015800   02  FILLER                        PIC X(28)  VALUE
015900            " COPY - NOT FOR DISTRIBUTION".
016000   02  FILLER                        PIC X(41)  VALUE SPACE.
016100
016200 01  CCVS-H-2B.
016300   02  FILLER                        PIC X(15)  VALUE
016400            "TEST RESULT OF ".
016500   02  TEST-ID                       PIC X(9).
016600   02  FILLER                        PIC X(4)   VALUE
016700            " IN ".
016800   02  FILLER                        PIC X(12)  VALUE
016900     " HIGH       ".
017000   02  FILLER                        PIC X(22)  VALUE
017100            " LEVEL VALIDATION FOR ".
017200   02  FILLER                        PIC X(58)  VALUE
017300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017400 01  CCVS-H-3.
017500     02  FILLER                      PIC X(34)  VALUE
017600            " FOR OFFICIAL USE ONLY    ".
017700     02  FILLER                      PIC X(58)  VALUE
017800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
017900     02  FILLER                      PIC X(28)  VALUE
018000            "  COPYRIGHT   1985 ".
018100 01  CCVS-E-1.
018200     02 FILLER                       PIC X(52)  VALUE SPACE.
018300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018400     02 ID-AGAIN                     PIC X(9).
018500     02 FILLER                       PIC X(45)  VALUE SPACES.
018600 01  CCVS-E-2.
018700     02  FILLER                      PIC X(31)  VALUE SPACE.
018800     02  FILLER                      PIC X(21)  VALUE SPACE.
018900     02 CCVS-E-2-2.
019000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
019100         03 FILLER                   PIC X      VALUE SPACE.
019200         03 ENDER-DESC               PIC X(44)  VALUE
019300            "ERRORS ENCOUNTERED".
019400 01  CCVS-E-3.
019500     02  FILLER                      PIC X(22)  VALUE
019600            " FOR OFFICIAL USE ONLY".
019700     02  FILLER                      PIC X(12)  VALUE SPACE.
019800     02  FILLER                      PIC X(58)  VALUE
019900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020000     02  FILLER                      PIC X(13)  VALUE SPACE.
020100     02 FILLER                       PIC X(15)  VALUE
020200             " COPYRIGHT 1985".
020300 01  CCVS-E-4.
020400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020500     02 FILLER                       PIC X(4)   VALUE " OF ".
020600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020700     02 FILLER                       PIC X(40)  VALUE
020800      "  TESTS WERE EXECUTED SUCCESSFULLY".
020900 01  XXINFO.
021000     02 FILLER                       PIC X(19)  VALUE
021100            "*** INFORMATION ***".
021200     02 INFO-TEXT.
021300       04 FILLER                     PIC X(8)   VALUE SPACE.
021400       04 XXCOMPUTED                 PIC X(20).
021500       04 FILLER                     PIC X(5)   VALUE SPACE.
021600       04 XXCORRECT                  PIC X(20).
021700     02 INF-ANSI-REFERENCE           PIC X(48).
021800 01  HYPHEN-LINE.
021900     02 FILLER  PIC IS X VALUE IS SPACE.
022000     02 FILLER  PIC IS X(65)    VALUE IS "************************
022100-    "*****************************************".
022200     02 FILLER  PIC IS X(54)    VALUE IS "************************
022300-    "******************************".
022400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022500     "NC217A".
022600 PROCEDURE DIVISION.
022700 CCVS1 SECTION.
022800 OPEN-FILES.
022900     OPEN     OUTPUT PRINT-FILE.
023000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
023100     MOVE    SPACE TO TEST-RESULTS.
023200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023300     GO TO CCVS1-EXIT.
023400 CLOSE-FILES.
023500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023600 TERMINATE-CCVS.
023700S    EXIT PROGRAM.
023800STERMINATE-CALL.
023900     STOP     RUN.
024000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
024100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
024200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
024300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
024400     MOVE "****TEST DELETED****" TO RE-MARK.
024500 PRINT-DETAIL.
024600     IF REC-CT NOT EQUAL TO ZERO
024700             MOVE "." TO PARDOT-X
024800             MOVE REC-CT TO DOTVALUE.
024900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
025000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
025100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
025200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
025300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
025400     MOVE SPACE TO CORRECT-X.
025500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025600     MOVE     SPACE TO RE-MARK.
025700 HEAD-ROUTINE.
025800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026200 COLUMN-NAMES-ROUTINE.
026300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026600 END-ROUTINE.
026700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026800 END-RTN-EXIT.
026900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027000 END-ROUTINE-1.
027100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
027200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
027300      ADD PASS-COUNTER TO ERROR-HOLD.
027400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
027500      MOVE PASS-COUNTER TO CCVS-E-4-1.
027600      MOVE ERROR-HOLD TO CCVS-E-4-2.
027700      MOVE CCVS-E-4 TO CCVS-E-2-2.
027800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
027900  END-ROUTINE-12.
028000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
028100     IF       ERROR-COUNTER IS EQUAL TO ZERO
028200         MOVE "NO " TO ERROR-TOTAL
028300         ELSE
028400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
028500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028600     PERFORM WRITE-LINE.
028700 END-ROUTINE-13.
028800     IF DELETE-COUNTER IS EQUAL TO ZERO
028900         MOVE "NO " TO ERROR-TOTAL  ELSE
029000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
029100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
029200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029300      IF   INSPECT-COUNTER EQUAL TO ZERO
029400          MOVE "NO " TO ERROR-TOTAL
029500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029900 WRITE-LINE.
030000     ADD 1 TO RECORD-COUNT.
030100Y    IF RECORD-COUNT GREATER 50
030200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
030300Y        MOVE SPACE TO DUMMY-RECORD
030400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
030500Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
030600Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
030700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
030800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
030900Y        MOVE ZERO TO RECORD-COUNT.
031000     PERFORM WRT-LN.
031100 WRT-LN.
031200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031300     MOVE SPACE TO DUMMY-RECORD.
031400 BLANK-LINE-PRINT.
031500     PERFORM WRT-LN.
031600 FAIL-ROUTINE.
031700     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032200     MOVE   SPACES TO INF-ANSI-REFERENCE.
032300     GO TO  FAIL-ROUTINE-EX.
032400 FAIL-ROUTINE-WRITE.
032500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
032600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
032700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
032800     MOVE   SPACES TO COR-ANSI-REFERENCE.
032900 FAIL-ROUTINE-EX. EXIT.
033000 BAIL-OUT.
033100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033300 BAIL-OUT-WRITE.
033400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
033500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033700     MOVE   SPACES TO INF-ANSI-REFERENCE.
033800 BAIL-OUT-EX. EXIT.
033900 CCVS1-EXIT.
034000     EXIT.
034100 SECT-NC217A-001 SECTION.
034200 STR-INIT-GF-1.
034300     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
034400     MOVE   "STR-TEST-GF-1" TO PAR-NAME.
034500     MOVE   "LIT DEL BY SIZE" TO FEATURE.
034600     MOVE    "*****" TO ID7-XN-5.
034700     MOVE    1 TO ID8-DU-2V0.
034800     MOVE    1 TO REC-CT.
034900 STR-TEST-GF-1.
035000     STRING "ABCDEF" DELIMITED BY SIZE INTO ID7-XN-5
035100         WITH POINTER ID8-DU-2V0.
035200     GO TO STR-TEST-GF-1-1.
035300 STR-DELETE-GF-1.
035400     PERFORM DE-LETE.
035500     PERFORM PRINT-DETAIL.
035600     GO      TO STR-INIT-GF-2.
035700 STR-TEST-GF-1-1.
035800     IF ID7-XN-5 = "ABCDE"
035900         PERFORM PASS
036000         GO TO STR-WRITE-GF-1-1
036100     ELSE
036200         GO TO STR-FAIL-GF-1-1.
036300 STR-DELETE-GF-1-1.
036400     PERFORM DE-LETE.
036500     GO TO STR-WRITE-GF-1-1.
036600 STR-FAIL-GF-1-1.
036700     PERFORM FAIL
036800     MOVE ID7-XN-5 TO COMPUTED-A
036900     MOVE "ABCDE" TO CORRECT-A.
037000 STR-WRITE-GF-1-1.
037100     PERFORM PRINT-DETAIL.
037200*
037300 STR-TEST-GF-1-2.
037400     ADD 1 TO REC-CT.
037500     IF ID8-DU-2V0 = 6
037600         PERFORM PASS
037700         GO TO STR-WRITE-GF-1-2
037800     ELSE
037900         GO TO STR-FAIL-GF-1-2.
038000 STR-DELETE-GF-1-2.
038100     PERFORM DE-LETE.
038200     GO TO STR-WRITE-GF-1-2.
038300 STR-FAIL-GF-1-2.
038400     PERFORM FAIL
038500     MOVE ID8-DU-2V0 TO COMPUTED-N
038600     MOVE 6 TO CORRECT-N.
038700 STR-WRITE-GF-1-2.
038800     PERFORM PRINT-DETAIL.
038900*
039000 STR-INIT-GF-2.
039100     MOVE   "STR-TEST-GF-2" TO PAR-NAME.
039200     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
039300     MOVE   "LIT DEL BY LIT" TO FEATURE.
039400     MOVE    "*****" TO ID7-XN-5.
039500     MOVE    1 TO ID8-DU-2V0.
039600     MOVE    1 TO REC-CT.
039700 STR-TEST-GF-2-0.
039800     STRING "ABCDEF" DELIMITED BY "ABCDEFG"
039900             INTO ID7-XN-5 WITH POINTER ID8-DU-2V0
040000             ON OVERFLOW PERFORM PASS
040100                         GO TO STR-WRITE-GF-2-1.
040200     GO      TO STR-FAIL-GF-2-1.
040300 STR-DELETE-GF-2.
040400     PERFORM DE-LETE.
040500     PERFORM PRINT-DETAIL.
040600     GO      TO STR-INIT-GF-3.
040700 STR-TEST-GF-2-1.
040800*    THIS IS THE BLOCK TO WHICH CONTROL WILL BE SENT BY
040900*    PARAGRAPH "STR-TEST-GF-2-0".
041000 STR-DELETE-GF-2-1.
041100*    GO TO STR-DELETE-GF-2.
041200 STR-FAIL-GF-2-1.
041300     PERFORM FAIL.
041400     MOVE    "OVERFLOW SHOULD OCCUR" TO RE-MARK.
041500 STR-WRITE-GF-2-1.
041600     PERFORM PRINT-DETAIL.
041700*
041800 STR-TEST-GF-2-2.
041900     ADD 1 TO REC-CT.
042000     IF      ID7-XN-5 = "ABCDE"
042100          PERFORM PASS
042200          GO TO STR-WRITE-GF-2-2
042300     ELSE
042400          GO TO STR-FAIL-GF-2-2.
042500 STR-DELETE-GF-2-2.
042600     PERFORM DE-LETE.
042700     GO TO STR-WRITE-GF-2-2.
042800 STR-FAIL-GF-2-2.
042900     PERFORM FAIL
043000     MOVE    ID7-XN-5 TO COMPUTED-A
043100     MOVE    "ABCDE" TO CORRECT-A.
043200 STR-WRITE-GF-2-2.
043300     PERFORM PRINT-DETAIL.
043400*
043500 STR-TEST-GF-2-3.
043600     ADD     1 TO REC-CT.
043700     IF      ID8-DU-2V0 = 6
043800          PERFORM PASS
043900          GO TO STR-WRITE-GF-2-3
044000     ELSE
044100          GO TO STR-FAIL-GF-2-3.
044200 STR-DELETE-GF-2-3.
044300     PERFORM DE-LETE.
044400     GO TO STR-WRITE-GF-2-3.
044500 STR-FAIL-GF-2-3.
044600     PERFORM FAIL
044700     MOVE    ID8-DU-2V0 TO COMPUTED-N
044800     MOVE    6 TO CORRECT-N.
044900 STR-WRITE-GF-2-3.
045000     PERFORM PRINT-DETAIL.
045100*
045200 STR-INIT-GF-3.
045300     MOVE   "STR-TEST-GF-3" TO PAR-NAME.
045400     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
045500     MOVE    "ID DEL BY QUAL ID" TO FEATURE.
045600     MOVE "*****" TO ID7-XN-5.
045700     MOVE 1 TO ID8-DU-2V0.
045800     MOVE    5 TO ISUB-DU-2V0.
045900     MOVE 1 TO REC-CT.
046000*
046100 STR-TEST-GF-3.
046200     STRING  ABCDEFG-XN-7 DELIMITED BY ID3-XN-1 (ISUB-DU-2V0)
046300             INTO ID7-XN-5 POINTER ID8-DU-2V0.
046400     GO      TO STR-TEST-GF-3-1.
046500 STR-DELETE-GF-3.
046600     PERFORM DE-LETE.
046700     PERFORM PRINT-DETAIL.
046800     GO      TO STRING-INIT-4.
046900*
047000 STR-TEST-GF-3-1.
047100     IF      ID7-XN-5 = "ABCDE"
047200          PERFORM PASS
047300          GO TO STR-WRITE-GF-3-1
047400     ELSE
047500          GO TO STR-FAIL-GF-3-1.
047600 STR-DELETE-GF-3-1.
047700     PERFORM DE-LETE.
047800     GO TO STR-WRITE-GF-3-1.
047900 STR-FAIL-GF-3-1.
048000     PERFORM FAIL
048100     MOVE    ID7-XN-5 TO COMPUTED-A
048200     MOVE    "ABCDE" TO CORRECT-A.
048300 STR-WRITE-GF-3-1.
048400     PERFORM PRINT-DETAIL.
048500*
048600 STR-TEST-GF-3-2.
048700     ADD     1 TO REC-CT.
048800     IF      ID8-DU-2V0 = 6
048900          PERFORM PASS
049000          GO TO STR-WRITE-GF-3-2
049100     ELSE
049200          GO TO STR-FAIL-GF-3-2.
049300 STR-DELETE-GF-3-2.
049400     PERFORM DE-LETE.
049500     GO TO STR-WRITE-GF-3-2.
049600 STR-FAIL-GF-3-2.
049700     PERFORM FAIL
049800     MOVE    ID8-DU-2V0 TO COMPUTED-N
049900     MOVE    6 TO CORRECT-N.
050000 STR-WRITE-GF-3-2.
050100     PERFORM PRINT-DETAIL.
050200*
050300 STRING-INIT-4.
050400     MOVE    "STR-TEST-GF-4" TO PAR-NAME.
050500     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
050600     MOVE    "SUBSCRIPTED IDS" TO FEATURE.
050700     MOVE "*****" TO ID7-XN-5.
050800     MOVE 1 TO ID8-DU-2V0.
050900     MOVE    ZERO TO REC-CT.
051000     MOVE    "**** " TO P-OR-F.
051100*
051200 STRING-TEST-4.
051300*    STRING  ID1-1 OF ID1-XN-X-25 (ID8-DU-2V0)
051400*            ID1-2 OF ID1-XN-X-25 (ID8-DU-2V0)
051500*            ID1-3 OF ID1-XN-X-25 (ID8-DU-2V0)
051600*            ID1-4 OF ID1-XN-X-25 (ID8-DU-2V0)
051700*            ID1-5 OF ID1-XN-X-25 (ID8-DU-2V0)
051800*            DELIMITED BY SIZE INTO ID7-XN-5
051900*            POINTER ID8-DU-2V0.
052000*    GO      TO STRING-TEST-4-1.
052100 STRING-DELETE-4.
052200     PERFORM DE-LETE.
052300     MOVE    "*DELETED - ANSC INTERPRETATION*" TO RE-MARK.
052400     PERFORM PRINT-DETAIL.
052500     GO      TO STR-INIT-GF-5.
052600 STRING-TEST-4-1.
052700     IF      ID7-XN-5 = "ABCDE"
052800     PERFORM PASS
052900     PERFORM PRINT-DETAIL
053000     ELSE
053100     PERFORM FAIL
053200     MOVE    ID7-XN-5 TO COMPUTED-A
053300     MOVE    "ABCDE" TO CORRECT-A
053400     PERFORM PRINT-DETAIL.
053500     ADD     1 TO REC-CT.
053600 STRING-TEST-4-2.
053700     IF      ID8-DU-2V0 = 6
053800     PERFORM PASS
053900     PERFORM PRINT-DETAIL
054000     ELSE
054100     PERFORM FAIL
054200     MOVE    ID8-DU-2V0 TO COMPUTED-N
054300     MOVE    6 TO CORRECT-N
054400     PERFORM PRINT-DETAIL.
054500*
054600 STR-INIT-GF-5.
054700     MOVE    "STR-TEST-GF-5" TO PAR-NAME.
054800     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
054900     MOVE    "IMMEDIATE OVERFLOW" TO FEATURE.
055000     MOVE "*****" TO ID7-XN-5.
055100     MOVE "*****" TO ASTER-XN-5.
055200* NOTE THAT THE POINTER IS SET TO A VALUE GREATER THAN
055300*    THE LENGTH OF THE RECEIVING ITEM ID7-XN-5..........
055400     MOVE    7 TO ID8-DU-2V0.
055500     MOVE    1 TO REC-CT.
055600*
055700 STR-TEST-GF-5-1.
055800     STRING  "ABCDE" DELIMITED BY ABCDEFG-XN-7 INTO ID7-XN-5
055900             POINTER ID8-DU-2V0
056000                     ON OVERFLOW PERFORM PASS
056100                                 GO TO STR-WRITE-GF-5-1.
056200     GO      TO STR-FAIL-GF-5-1.
056300 STR-DELETE-GF-5-1.
056400     PERFORM DE-LETE.
056500     PERFORM PRINT-DETAIL.
056600     GO TO STR-INIT-GF-6.
056700 STR-FAIL-GF-5-1.
056800     PERFORM FAIL.
056900     MOVE    "OVERFLOW SHOULD OCCUR" TO RE-MARK.
057000 STR-WRITE-GF-5-1.
057100     PERFORM PRINT-DETAIL.
057200*
057300 STR-TEST-GF-5-2.
057400     ADD 1 TO REC-CT.
057500     IF      ID7-XN-5 = ASTER-XN-5
057600          PERFORM PASS
057700          GO TO STR-WRITE-GF-5-2
057800     ELSE
057900          GO TO STR-FAIL-GF-5-2.
058000 STR-DELETE-GF-5-2.
058100     PERFORM DE-LETE.
058200     GO TO STR-WRITE-GF-5-2.
058300 STR-FAIL-GF-5-2.
058400     PERFORM FAIL
058500     MOVE    ID7-XN-5 TO COMPUTED-A
058600     MOVE    "*****" TO CORRECT-A.
058700 STR-WRITE-GF-5-2.
058800     PERFORM PRINT-DETAIL.
058900*
059000 STR-TEST-GF-5-3.
059100     ADD     1 TO REC-CT.
059200     IF      ID8-DU-2V0 = 7
059300          PERFORM PASS
059400          GO TO STR-WRITE-GF-5-3
059500     ELSE
059600          GO TO STR-FAIL-GF-5-3.
059700 STR-DELETE-GF-5-3.
059800     PERFORM DE-LETE.
059900     GO TO STR-WRITE-GF-5-3.
060000 STR-FAIL-GF-5-3.
060100     PERFORM FAIL
060200     MOVE    ID8-DU-2V0 TO COMPUTED-N
060300     MOVE    7 TO CORRECT-N.
060400 STR-WRITE-GF-5-3.
060500     PERFORM PRINT-DETAIL.
060600*
060700 STR-INIT-GF-6.
060800     MOVE    "STR-TEST-GF-6" TO PAR-NAME.
060900     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
061000     MOVE    "SPACE LIT OVERFLOWS" TO FEATURE.
061100     MOVE    "*****" TO ID7-XN-5.
061200     MOVE    1 TO ID8-DU-2V0.
061300     MOVE    1 TO REC-CT.
061400*
061500 STR-TEST-GF-6-1.
061600     STRING  SPACE "ABCDE" DELIMITED BY " ABCDE"
061700             INTO ID7-XN-5 OVERFLOW PERFORM PASS
061800                                    GO TO STR-WRITE-GF-6-1.
061900     GO      TO STR-FAIL-GF-6-1.
062000 STR-DELETE-GF-6-1.
062100     PERFORM DE-LETE.
062200     PERFORM PRINT-DETAIL.
062300     GO      TO STR-INIT-GF-7.
062400 STR-FAIL-GF-6-1.
062500     PERFORM FAIL.
062600     MOVE    "OVERFLOW SHOULD OCCUR" TO RE-MARK.
062700 STR-WRITE-GF-6-1.
062800     PERFORM PRINT-DETAIL.
062900*
063000 STR-TEST-GF-6-2.
063100     ADD 1 TO REC-CT.
063200     IF      ID7-XN-5 = " ABCD"
063300          PERFORM PASS
063400          GO TO STR-WRITE-GF-6-2
063500     ELSE
063600          GO TO STR-FAIL-GF-6-2.
063700 STR-DELETE-GF-6-2.
063800     PERFORM DE-LETE.
063900     GO TO STR-WRITE-GF-6-2.
064000 STR-FAIL-GF-6-2.
064100     PERFORM FAIL
064200     MOVE    ID7-XN-5 TO COMPUTED-A
064300     MOVE    " ABCD" TO CORRECT-A.
064400 STR-WRITE-GF-6-2.
064500     PERFORM PRINT-DETAIL.
064600*
064700 STR-INIT-GF-7.
064800     MOVE    "STR-TEST-GF-7" TO PAR-NAME.
064900     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
065000     MOVE    "LITERAL SERIES" TO FEATURE.
065100     MOVE    "*****" TO ID7-XN-5.
065200     MOVE    1 TO ID8-DU-2V0.
065300     MOVE    1 TO REC-CT.
065400*
065500 STR-TEST-GF-7-1.
065600     STRING  "A" "B" "C" "D" "E" DELIMITED "ABCDE" INTO ID7-XN-5
065700             POINTER ID8-DU-2V0 OVERFLOW GO TO STR-FAIL-GF-7-1.
065800     PERFORM PASS.
065900     GO TO STR-WRITE-GF-7-1.
066000 STR-DELETE-GF-7-1.
066100     PERFORM DE-LETE.
066200     PERFORM PRINT-DETAIL.
066300     GO      TO STR-INIT-GF-8.
066400 STR-FAIL-GF-7-1.
066500     PERFORM FAIL.
066600     MOVE    "OVERFLOW SHOULD NOT OCCUR" TO RE-MARK.
066700 STR-WRITE-GF-7-1.
066800     PERFORM PRINT-DETAIL.
066900*
067000 STR-TEST-GF-7-2.
067100     ADD     1 TO REC-CT.
067200     IF      ID7-XN-5 = "ABCDE"
067300          PERFORM PASS
067400          GO TO STR-WRITE-GF-7-2
067500     ELSE
067600          GO TO STR-FAIL-GF-7-2.
067700 STR-DELETE-GF-7-2.
067800     PERFORM DE-LETE.
067900     GO TO STR-WRITE-GF-7-2.
068000 STR-FAIL-GF-7-2.
068100     PERFORM FAIL
068200     MOVE    ID7-XN-5 TO COMPUTED-A
068300     MOVE    "ABCDE" TO CORRECT-A.
068400 STR-WRITE-GF-7-2.
068500     PERFORM PRINT-DETAIL.
068600*
068700 STR-TEST-GF-7-3.
068800     ADD     1 TO REC-CT.
068900     IF      ID8-DU-2V0 = 6
069000          PERFORM PASS
069100          GO TO STR-WRITE-GF-7-3
069200     ELSE
069300          GO TO STR-FAIL-GF-7-3.
069400 STR-DELETE-GF-7-3.
069500     PERFORM DE-LETE.
069600     GO TO STR-WRITE-GF-7-3.
069700 STR-FAIL-GF-7-3.
069800     PERFORM FAIL
069900     MOVE    ID8-DU-2V0 TO COMPUTED-N
070000     MOVE    6 TO CORRECT-N.
070100 STR-WRITE-GF-7-3.
070200     PERFORM PRINT-DETAIL.
070300*
070400 STR-INIT-GF-8.
070500     MOVE    "STR-TEST-GF-8" TO PAR-NAME.
070600     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
070700     MOVE    "LOW-VALUE OVERFLOW" TO FEATURE.
070800     MOVE    "*****" TO ID7-XN-5.
070900     MOVE    1 TO ID8-DU-2V0.
071000     MOVE    1 TO REC-CT.
071100*
071200 STR-TEST-GF-8-1.
071300     STRING  LOW-VALUE "ABCDE" DELIMITED BY SIZE INTO ID7-XN-5
071400             WITH POINTER ID8-DU-2V0
071500                  ON OVERFLOW PERFORM PASS
071600                              GO TO STR-WRITE-GF-8-1.
071700     GO      TO STR-FAIL-GF-8-1.
071800 STR-DELETE-GF-8-1.
071900     PERFORM DE-LETE.
072000     PERFORM PRINT-DETAIL.
072100     GO      TO STR-INIT-GF-9.
072200 STR-FAIL-GF-8-1.
072300     PERFORM FAIL.
072400     MOVE    "OVERFLOW SHOULD OCCUR" TO RE-MARK.
072500 STR-WRITE-GF-8-1.
072600     PERFORM PRINT-DETAIL.
072700*
072800 STR-TEST-GF-8-2.
072900     ADD     1 TO REC-CT.
073000     IF      ID7-XN-5 = ANS-XN-5-1
073100          PERFORM PASS
073200          GO TO STR-WRITE-GF-8-2
073300     ELSE
073400          GO TO STR-FAIL-GF-8-2.
073500 STR-DELETE-GF-8-2.
073600     PERFORM DE-LETE.
073700     GO TO STR-WRITE-GF-8-2.
073800 STR-FAIL-GF-8-2.
073900     PERFORM FAIL
074000     MOVE    ID7-XN-5 TO COMPUTED-A
074100     MOVE    ANS-XN-5-1 TO CORRECT-A.
074200 STR-WRITE-GF-8-2.
074300     PERFORM PRINT-DETAIL.
074400*
074500 STR-TEST-GF-8-3.
074600     ADD     1 TO REC-CT.
074700     IF      ID8-DU-2V0 = 6
074800          PERFORM PASS
074900          GO TO STR-WRITE-GF-8-3
075000     ELSE
075100          GO TO STR-FAIL-GF-8-3.
075200 STR-DELETE-GF-8-3.
075300     PERFORM DE-LETE.
075400     GO TO STR-WRITE-GF-8-3.
075500 STR-FAIL-GF-8-3.
075600     PERFORM FAIL
075700     MOVE    ID8-DU-2V0 TO COMPUTED-N
075800     MOVE    6 TO CORRECT-N.
075900 STR-WRITE-GF-8-3.
076000     PERFORM PRINT-DETAIL.
076100*
076200 STR-INIT-GF-9.
076300     MOVE    "STR-TEST-GF-9" TO PAR-NAME.
076400     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
076500     MOVE    "HIGH-VALUE DEL SIZE" TO FEATURE.
076600     MOVE    "*****" TO ID7-XN-5.
076700     MOVE    1 TO ID8-DU-2V0.
076800     MOVE    1 TO REC-CT.
076900*
077000 STR-TEST-GF-9-1.
077100     STRING  HIGH-VALUE DELIMITED BY SIZE INTO ID7-XN-5
077200             POINTER ID8-DU-2V0
077300                   OVERFLOW GO TO STR-FAIL-GF-9-1.
077400     PERFORM PASS.
077500     GO TO STR-WRITE-GF-9-1.
077600 STR-DELETE-GF-9-1.
077700     PERFORM DE-LETE.
077800     PERFORM PRINT-DETAIL.
077900     GO      TO STR-INIT-GF-10.
078000 STR-FAIL-GF-9-1.
078100     PERFORM FAIL.
078200     MOVE    "OVERFLOW SHOULD NOT OCCUR" TO RE-MARK.
078300 STR-WRITE-GF-9-1.
078400     PERFORM PRINT-DETAIL.
078500*
078600 STR-TEST-GF-9-2.
078700     ADD     1 TO REC-CT.
078800     IF      ID7-XN-5 = ANS-XN-5-2
078900          PERFORM PASS
079000          GO TO STR-WRITE-GF-9-2
079100     ELSE
079200          GO TO STR-FAIL-GF-9-2.
079300 STR-DELETE-GF-9-2.
079400     PERFORM DE-LETE.
079500     GO TO STR-WRITE-GF-9-2.
079600 STR-FAIL-GF-9-2.
079700     PERFORM FAIL
079800     MOVE    ID7-XN-5 TO COMPUTED-A
079900     MOVE    ANS-XN-5-2 TO CORRECT-A.
080000 STR-WRITE-GF-9-2.
080100     PERFORM PRINT-DETAIL.
080200*
080300 STR-TEST-GF-9-3.
080400     ADD     1 TO REC-CT.
080500     IF      ID8-DU-2V0 = 2
080600          PERFORM PASS
080700          GO TO STR-WRITE-GF-9-3
080800     ELSE
080900          GO TO STR-FAIL-GF-9-3.
081000 STR-DELETE-GF-9-3.
081100     PERFORM DE-LETE.
081200     GO TO STR-WRITE-GF-9-3.
081300 STR-FAIL-GF-9-3.
081400     PERFORM FAIL
081500     MOVE    ID8-DU-2V0 TO COMPUTED-N
081600     MOVE    2 TO CORRECT-N.
081700 STR-WRITE-GF-9-3.
081800     PERFORM PRINT-DETAIL.
081900*
082000 STR-INIT-GF-10.
082100     MOVE    "STR-TEST-GF-10" TO PAR-NAME.
082200     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
082300     MOVE    "LIT DEL ZERO" TO FEATURE.
082400     MOVE    "*****" TO ID7-XN-5.
082500     MOVE    1 TO ID8-DU-2V0.
082600     MOVE    1 TO REC-CT.
082700*
082800 STR-TEST-GF-10-0.
082900     STRING  "A0" "B0D" "C0LKJSD" "D0321" "E0987LKJALKJKLLKJSD"
083000             DELIMITED BY ZERO INTO ID7-XN-5 POINTER ID8-DU-2V0.
083100     GO      TO STR-TEST-GF-10-1.
083200 STR-DELETE-GF-10.
083300     PERFORM DE-LETE.
083400     PERFORM PRINT-DETAIL.
083500     GO      TO STR-INIT-GF-11.
083600*
083700 STR-TEST-GF-10-1.
083800     IF      ID7-XN-5 = "ABCDE"
083900             PERFORM PASS
084000             GO TO STR-WRITE-GF-10-1
084100     ELSE
084200             GO TO STR-FAIL-GF-10-1.
084300 STR-DELETE-GF-10-1.
084400     PERFORM DE-LETE.
084500     GO TO STR-WRITE-GF-10-1.
084600 STR-FAIL-GF-10-1.
084700     PERFORM FAIL
084800     MOVE    ID7-XN-5 TO COMPUTED-A
084900     MOVE    "ABCDE" TO CORRECT-A.
085000 STR-WRITE-GF-10-1.
085100     PERFORM PRINT-DETAIL.
085200*
085300 STR-TEST-GF-10-2.
085400     ADD     1 TO REC-CT.
085500     IF      ID8-DU-2V0 = 6
085600             PERFORM PASS
085700             GO TO STR-WRITE-GF-10-2
085800     ELSE
085900             GO TO STR-FAIL-GF-10-2.
086000 STR-DELETE-GF-10-2.
086100     PERFORM DE-LETE.
086200     GO TO STR-WRITE-GF-10-2.
086300 STR-FAIL-GF-10-2.
086400     PERFORM FAIL
086500     MOVE    ID8-DU-2V0 TO COMPUTED-N
086600     MOVE    6 TO CORRECT-N.
086700 STR-WRITE-GF-10-2.
086800     PERFORM PRINT-DETAIL.
086900*
087000 STR-INIT-GF-11.
087100     MOVE    "STR-TEST-GF-11" TO PAR-NAME.
087200     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
087300     MOVE    "LIT DEL BY QUOTE" TO FEATURE.
087400     MOVE    "*****" TO ID7-XN-5.
087500     MOVE    1 TO ID8-DU-2V0.
087600     MOVE    1 TO REC-CT.
087700*
087800 STR-TEST-GF-11.
087900     STRING  "A""" "B""KJHSF" "C""321654987LLKJHAF" "D""=,l."
088000             "E""********" DELIMITED BY QUOTE INTO ID7-XN-5
088100             POINTER ID8-DU-2V0.
088200     GO      TO STR-TEST-GF-11-1.
088300 STR-DELETE-GF-11-0.
088400     PERFORM DE-LETE.
088500     PERFORM PRINT-DETAIL.
088600     GO      TO STR-INIT-GF-12.
088700*
088800 STR-TEST-GF-11-1.
088900     IF      ID7-XN-5 = "ABCDE"
089000             PERFORM PASS
089100             GO TO STR-WRITE-GF-11-1
089200     ELSE
089300             GO TO STR-FAIL-GF-11-1.
089400 STR-DELETE-GF-11-1.
089500     PERFORM DE-LETE.
089600     GO TO STR-WRITE-GF-11-1.
089700 STR-FAIL-GF-11-1.
089800     PERFORM FAIL
089900     MOVE    ID7-XN-5 TO COMPUTED-A
090000     MOVE    "ABCDE" TO CORRECT-A.
090100 STR-WRITE-GF-11-1.
090200     PERFORM PRINT-DETAIL.
090300     ADD     1 TO REC-CT.
090400*
090500 STR-TEST-GF-11-2.
090600     IF      ID8-DU-2V0 = 6
090700             PERFORM PASS
090800             GO TO STR-WRITE-GF-11-2
090900     ELSE
091000             GO TO STR-FAIL-GF-11-2.
091100 STR-DELETE-GF-11-2.
091200     PERFORM DE-LETE.
091300     GO TO STR-WRITE-GF-11-2.
091400 STR-FAIL-GF-11-2.
091500     PERFORM FAIL
091600     MOVE    ID8-DU-2V0 TO COMPUTED-N
091700     MOVE    6 TO CORRECT-N.
091800 STR-WRITE-GF-11-2.
091900     PERFORM PRINT-DETAIL.
092000*
092100 STR-INIT-GF-12.
092200     MOVE    "STR-TEST-GF-12" TO PAR-NAME.
092300     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
092400     MOVE    "ZERO ID DEL SIZE" TO FEATURE.
092500     MOVE    0 TO REC-CT.
092600     MOVE    ALL "*" TO ID7-XN-15.
092700*
092800 STR-TEST-GF-12-1.
092900     STRING  ZERO ABCDEFG-XN-7 DELIMITED BY SIZE ZERO ABCDEFG-XN-7
093000             DELIMITED BY SIZE INTO ID7-XN-15.
093100     IF      ID7-XN-15 = "0ABCDEFG0ABCDEF"
093200             PERFORM PASS
093300             GO TO STR-WRITE-GF-12-1
093400     ELSE
093500             GO TO STR-FAIL-GF-12-1.
093600 STR-DELETE-GF-12-1.
093700     PERFORM DE-LETE.
093800     GO TO STR-WRITE-GF-12-1.
093900 STR-FAIL-GF-12-1.
094000     PERFORM FAIL
094100     MOVE    ID7-XN-15 TO COMPUTED-A
094200     MOVE    "0ABCDEFG0ABCDEF" TO CORRECT-A.
094300 STR-WRITE-GF-12-1.
094400     PERFORM PRINT-DETAIL.
094500*
094600 STR-INIT-GF-13.
094700     MOVE    "STR-TEST-GF-13" TO PAR-NAME.
094800     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
094900     MOVE    "LITERAL SERIES" TO FEATURE.
095000     MOVE    "*****" TO ID7-XN-5.
095100*
095200 STR-TEST-GF-13.
095300     STRING  "A" "B" "C" DELIMITED BY SIZE "D" "E" "F"  DELIMITED
095400             BY SIZE INTO ID7-XN-5.
095500     IF      ID7-XN-5 = "ABCDE"
095600             PERFORM PASS
095700             GO TO STR-WRITE-GF-13
095800     ELSE
095900             GO TO STR-FAIL-GF-13.
096000 STR-DELETE-GF-13.
096100     PERFORM DE-LETE.
096200     GO TO STR-WRITE-GF-13.
096300 STR-FAIL-GF-13.
096400     PERFORM FAIL
096500     MOVE    ID7-XN-5 TO COMPUTED-A
096600     MOVE    "ABCDE" TO CORRECT-A.
096700 STR-WRITE-GF-13.
096800     PERFORM PRINT-DETAIL.
096900*
097000 STR-INIT-GF-14.
097100     MOVE    "STR-TEST-GF-14" TO PAR-NAME.
097200     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
097300     MOVE    "IDENTIFIER SERIES" TO FEATURE.
097400     MOVE    "*****" TO ID7-XN-5.
097500*
097600 STR-TEST-GF-14.
097700     STRING  AB-XN-2 AB-XN-2 AB-XN-2 DELIMITED BY B-XN-1
097800     AB-XN-2 AB-XN-2 DELIMITED BY B-XN-1 INTO ID7-XN-5.
097900     IF      ID7-XN-5 = "AAAAA"
098000             PERFORM PASS
098100             GO TO STR-WRITE-GF-14
098200     ELSE
098300             GO TO STR-FAIL-GF-14.
098400 STR-DELETE-GF-14.
098500     PERFORM DE-LETE.
098600     GO TO STR-WRITE-GF-14.
098700 STR-FAIL-GF-14.
098800     PERFORM FAIL
098900     MOVE    ID7-XN-5 TO COMPUTED-A
099000     MOVE "AAAAA" TO CORRECT-A.
099100 STR-WRITE-GF-14.
099200     PERFORM PRINT-DETAIL.
099300*
099400 STR-INIT-GF-15.
099500     MOVE    "STR-TEST-GF-15" TO PAR-NAME.
099600     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
099700     MOVE    "SIGN LEADING" TO FEATURE.
099800     MOVE    "*****" TO ID7-XN-5.
099900     MOVE    +1001 TO ID1-DS-LS-4.
100000     MOVE    ZERO TO ZEROX-XN-1.
100100     MOVE    1 TO ID8-DU-2V0.
100200     MOVE    1 TO REC-CT.
100300*
100400 STR-TEST-GF-15-0.
100500     STRING  ID1-DS-LS-4 DELIMITED BY ZEROX-XN-1 SPACE DELIMITED
100600             BY SIZE ID1-DS-LS-4 DELIMITED "0" INTO
100700             ID7-XN-5 POINTER ID8-DU-2V0.
100800     GO      TO STR-TEST-GF-15-1.
100900 STR-DELETE-GF-15.
101000     PERFORM DE-LETE.
101100     PERFORM PRINT-DETAIL.
101200     GO      TO STR-INIT-GF-16.
101300*
101400 STR-TEST-GF-15-1.
101500     IF      ID7-XN-5 = "+1 +1"
101600             PERFORM PASS
101700             GO TO STR-WRITE-GF-15-1
101800     ELSE
101900             GO TO STR-FAIL-GF-15-1.
102000 STR-DELETE-GF-15-1.
102100     PERFORM DE-LETE.
102200     GO TO STR-WRITE-GF-15-1.
102300 STR-FAIL-GF-15-1.
102400     PERFORM FAIL
102500     MOVE    ID7-XN-5 TO COMPUTED-A
102600     MOVE    "+1 +1" TO CORRECT-A.
102700 STR-WRITE-GF-15-1.
102800     PERFORM PRINT-DETAIL.
102900*
103000 STR-TEST-GF-15-2.
103100     ADD     1 TO REC-CT.
103200     IF      ID8-DU-2V0 = 6
103300             PERFORM PASS
103400             GO TO STR-WRITE-GF-15-2
103500     ELSE
103600             GO TO STR-FAIL-GF-15-2.
103700 STR-DELETE-GF-15-2.
103800     PERFORM DE-LETE.
103900     GO TO STR-WRITE-GF-15-2.
104000 STR-FAIL-GF-15-2.
104100     PERFORM FAIL
104200     MOVE    ID8-DU-2V0 TO COMPUTED-N
104300     MOVE 6 TO CORRECT-N.
104400 STR-WRITE-GF-15-2.
104500     PERFORM PRINT-DETAIL.
104600*
104700 STR-INIT-GF-16.
104800     MOVE    "STR-TEST-GF-16" TO PAR-NAME.
104900     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
105000     MOVE    "SIGN LEADING" TO FEATURE.
105100     MOVE    "*****" TO ID7-XN-5.
105200     MOVE    +1001 TO ID1-DS-LS-4.
105300     MOVE    ZERO TO ZEROX-XN-1.
105400     MOVE    1 TO ID8-DU-2V0.
105500     MOVE    1 TO REC-CT.
105600*
105700 STR-TEST-GF-16-0.
105800     STRING  ID1-DS-LS-4 DELIMITED "0" " " DELIMITED BY SIZE
105900             ID1-DS-LS-4 DELIMITED BY ZEROX-XN-1 INTO ID7-XN-5
106000             POINTER ID8-DU-2V0.
106100     GO      TO STR-TEST-GF-16-1.
106200 STR-DELETE-GF-16.
106300     PERFORM DE-LETE.
106400     PERFORM PRINT-DETAIL.
106500     GO      TO STR-INIT-GF-17.
106600*
106700 STR-TEST-GF-16-1.
106800     IF      ID7-XN-5 = "+1 +1"
106900             PERFORM PASS
107000             GO TO STR-WRITE-GF-16-1
107100     ELSE
107200             GO TO STR-FAIL-GF-16-1.
107300 STR-DELETE-GF-16-1.
107400     PERFORM DE-LETE.
107500     GO TO STR-WRITE-GF-16-1.
107600 STR-FAIL-GF-16-1.
107700     PERFORM FAIL
107800     MOVE    ID7-XN-5 TO COMPUTED-A
107900     MOVE    "+1 +1" TO CORRECT-A.
108000 STR-WRITE-GF-16-1.
108100     PERFORM PRINT-DETAIL.
108200*
108300 STR-TEST-GF-16-2.
108400     ADD     1 TO REC-CT.
108500     IF      ID8-DU-2V0 = 6
108600             PERFORM PASS
108700             GO TO STR-WRITE-GF-16-2
108800     ELSE
108900             GO TO STR-FAIL-GF-16-2.
109000 STR-DELETE-GF-16-2.
109100     PERFORM DE-LETE.
109200     GO TO STR-WRITE-GF-16-2.
109300 STR-FAIL-GF-16-2.
109400     PERFORM FAIL
109500     MOVE    ID8-DU-2V0 TO COMPUTED-N
109600     MOVE    6 TO CORRECT-N.
109700 STR-WRITE-GF-16-2.
109800     PERFORM PRINT-DETAIL.
109900*
110000 STR-INIT-GF-17.
110100     MOVE    "STR-TEST-GF-17" TO PAR-NAME.
110200     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
110300     MOVE    "SIGN TRAILING" TO FEATURE.
110400     MOVE    "*****" TO ID7-XN-5.
110500     MOVE    1 TO ID8-DU-2V0.
110600     MOVE    +1001 TO ID1-DS-TS-4.
110700     MOVE    1 TO REC-CT.
110800*
110900 STR-TEST-GF-17-0.
111000     STRING  ID1-DS-TS-4 DELIMITED BY SIZE SPACE DELIMITED SIZE
111100             ID1-DS-TS-4 DELIMITED BY SIZE
111200             INTO ID7-XN-5 POINTER ID8-DU-2V0.
111300     GO      TO STR-TEST-GF-17-1.
111400 STR-DELETE-GF-17.
111500     PERFORM DE-LETE.
111600     PERFORM PRINT-DETAIL.
111700     GO      TO STR-INIT-GF-18.
111800*
111900 STR-TEST-GF-17-1.
112000     IF      ID7-XN-5 = "1001+"
112100             PERFORM PASS
112200             GO TO STR-WRITE-GF-17-1
112300     ELSE
112400             GO TO STR-FAIL-GF-17-1.
112500 STR-DELETE-GF-17-1.
112600     PERFORM DE-LETE.
112700     GO TO STR-WRITE-GF-17-1.
112800 STR-FAIL-GF-17-1.
112900     PERFORM FAIL
113000     MOVE    ID7-XN-5 TO COMPUTED-A
113100     MOVE    "1001+" TO CORRECT-A.
113200 STR-WRITE-GF-17-1.
113300     PERFORM PRINT-DETAIL.
113400*
113500 STR-TEST-GF-17-2.
113600     ADD     1 TO REC-CT.
113700     IF      ID8-DU-2V0 = 6
113800             PERFORM PASS
113900             GO TO STR-WRITE-GF-17-2
114000     ELSE
114100             GO TO STR-FAIL-GF-17-2.
114200 STR-DELETE-GF-17-2.
114300     PERFORM DE-LETE.
114400     GO TO STR-WRITE-GF-17-2.
114500 STR-FAIL-GF-17-2.
114600     PERFORM FAIL
114700     MOVE    ID8-DU-2V0 TO COMPUTED-N
114800     MOVE    6 TO CORRECT-N.
114900 STR-WRITE-GF-17-2.
115000     PERFORM PRINT-DETAIL.
115100*
115200 STR-INIT-GF-18.
115300     MOVE    "STR-TEST-GF-18" TO PAR-NAME.
115400     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
115500     MOVE    "NEG LEADING SEPARATE" TO FEATURE.
115600     MOVE    -1001 TO ID1-DS-LS-4.
115700     MOVE    "*****" TO ID7-XN-5.
115800     MOVE    ZERO TO ZEROX-XN-1.
115900     MOVE    1 TO ID8-DU-2V0.
116000     MOVE    1 TO REC-CT.
116100*
116200 STR-TEST-GF-18-0.
116300     STRING  ID1-DS-LS-4 DELIMITED BY ZEROX-XN-1 SPACE DELIMITED
116400             BY SIZE ID1-DS-LS-4 DELIMITED BY "0" INTO
116500             ID7-XN-5 POINTER ID8-DU-2V0.
116600     GO      TO STR-TEST-GF-18-1.
116700 STR-DELETE-GF-18.
116800     PERFORM DE-LETE.
116900     PERFORM PRINT-DETAIL.
117000     GO      TO STR-INIT-GF-19.
117100*
117200 STR-TEST-GF-18-1.
117300     IF      ID7-XN-5 = "-1 -1"
117400             PERFORM PASS
117500             GO TO STR-WRITE-GF-18-1
117600     ELSE
117700             GO TO STR-FAIL-GF-18-1.
117800 STR-DELETE-GF-18-1.
117900     PERFORM DE-LETE.
118000     GO TO STR-WRITE-GF-18-1.
118100 STR-FAIL-GF-18-1.
118200     PERFORM FAIL
118300     MOVE    ID7-XN-5 TO COMPUTED-A
118400     MOVE    "-1 -1" TO CORRECT-A.
118500 STR-WRITE-GF-18-1.
118600     PERFORM PRINT-DETAIL.
118700*
118800 STR-TEST-GF-18-2.
118900     ADD     1 TO REC-CT.
119000     IF      ID8-DU-2V0 = 6
119100             PERFORM PASS
119200             GO TO STR-WRITE-GF-18-2
119300     ELSE
119400             GO TO STR-FAIL-GF-18-2.
119500 STR-DELETE-GF-18-2.
119600     PERFORM DE-LETE.
119700     GO TO STR-WRITE-GF-18-2.
119800 STR-FAIL-GF-18-2.
119900     PERFORM FAIL
120000     MOVE    ID8-DU-2V0 TO COMPUTED-N
120100     MOVE    6 TO CORRECT-N.
120200 STR-WRITE-GF-18-2.
120300     PERFORM PRINT-DETAIL.
120400*
120500 STR-INIT-GF-19.
120600     MOVE    "STR-TEST-GF-19" TO PAR-NAME.
120700     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
120800     MOVE    "NEGATIVE SIGN TRAIL" TO FEATURE.
120900     MOVE    "*****" TO ID7-XN-5.
121000     MOVE    1 TO ID8-DU-2V0.
121100     MOVE    -1001 TO ID1-DS-TS-4.
121200     MOVE    1 TO REC-CT.
121300*
121400 STR-TEST-GF-19-0.
121500     STRING  ID1-DS-TS-4 DELIMITED BY SIZE SPACE DELIMITED SIZE
121600             ID1-DS-TS-4 DELIMITED BY SIZE INTO ID7-XN-5
121700             POINTER ID8-DU-2V0.
121800     GO      TO STR-TEST-GF-19-1.
121900 STR-DELETE-GF-19.
122000     PERFORM DE-LETE.
122100     PERFORM PRINT-DETAIL.
122200     GO      TO STR-INIT-GF-20.
122300*
122400 STR-TEST-GF-19-1.
122500     IF      ID7-XN-5 = "1001-"
122600             PERFORM PASS
122700             GO TO STR-WRITE-GF-19-1
122800     ELSE
122900             GO TO STR-FAIL-GF-19-1.
123000 STR-DELETE-GF-19-1.
123100     PERFORM DE-LETE.
123200     GO TO STR-WRITE-GF-19-1.
123300 STR-FAIL-GF-19-1.
123400     PERFORM FAIL
123500     MOVE    ID7-XN-5 TO COMPUTED-A
123600     MOVE    "1001-" TO CORRECT-A.
123700 STR-WRITE-GF-19-1.
123800     PERFORM PRINT-DETAIL.
123900*
124000 STR-TEST-GF-19-2.
124100     ADD     1 TO REC-CT.
124200     IF      ID8-DU-2V0 = 6
124300             PERFORM PASS
124400             GO TO STR-WRITE-GF-19-2
124500     ELSE
124600             GO TO STR-FAIL-GF-19-2.
124700 STR-DELETE-GF-19-2.
124800     PERFORM DE-LETE.
124900     GO TO STR-WRITE-GF-19-2.
125000 STR-FAIL-GF-19-2.
125100     PERFORM FAIL
125200     MOVE    ID8-DU-2V0 TO COMPUTED-N
125300     MOVE 6 TO CORRECT-N.
125400 STR-WRITE-GF-19-2.
125500     PERFORM PRINT-DETAIL.
125600*
125700 STR-INIT-GF-20.
125800     MOVE    "STR-TEST-GF-20" TO PAR-NAME.
125900     MOVE   "VI-130 6.24.3+4" TO ANSI-REFERENCE.
126000     MOVE    "LITERAL SERIES" TO FEATURE.
126100     MOVE ALL "*" TO WISH-LIST-XN-37.
126200     MOVE "GEE I WISH I WAS A FORTRAN PROGRAMMER" TO ANS-XN-37.
126300     MOVE    1 TO MY-BOSS-DU-2V0.
126400     MOVE    1 TO REC-CT.
126500*
126600 STR-TEST-GF-20-1.
126700     STRING  "GEE" SPACE "I WISH I" SPACES "WAS A FORTRAN" " "
126800             "PROGRAMMER"
126900             DELIMITED BY SIZE INTO WISH-LIST-XN-37
127000             WITH POINTER MY-BOSS-DU-2V0
127100             ON OVERFLOW GO TO STR-FAIL-GF-20-1.
127200     PERFORM PASS.
127300     GO TO STR-WRITE-GF-20-1.
127400 STR-DELETE-GF-20.
127500     PERFORM DE-LETE.
127600     PERFORM PRINT-DETAIL.
127700     GO TO   STR-INIT-GF-21.
127800 STR-FAIL-GF-20-1.
127900     PERFORM FAIL.
128000     MOVE    "OVERFLOW SHOULD NOT OCCUR" TO RE-MARK.
128100 STR-WRITE-GF-20-1.
128200     PERFORM PRINT-DETAIL.
128300*
128400 STR-TEST-GF-20-2.
128500     MOVE    "STR-TEST-GF-20" TO PAR-NAME.
128600     MOVE    1 TO REC-CT.
128700     IF      WISH-LIST-XN-37 = ANS-XN-37
128800             PERFORM PASS
128900             GO TO STR-WRITE-GF-20-2
129000     ELSE
129100             GO TO STR-FAIL-GF-20-2.
129200 STR-DELETE-GF-20-2.
129300     PERFORM DE-LETE.
129400     GO TO STR-WRITE-GF-20-2.
129500 STR-FAIL-GF-20-2.
129600     PERFORM FAIL
129700     MOVE    WISH-LIST-XN-37 TO COMPUTED-A
129800     MOVE    ANS-XN-37 TO CORRECT-A.
129900 STR-WRITE-GF-20-2.
130000     PERFORM PRINT-DETAIL.
130100*
130200 STR-TEST-GF-20-3.
130300     ADD     1 TO REC-CT.
130400     IF      MY-BOSS-DU-2V0 = 38
130500             PERFORM PASS
130600             GO TO STR-WRITE-GF-20-3
130700     ELSE
130800             GO TO STR-FAIL-GF-20-3.
130900 STR-DELETE-GF-20-3.
131000     PERFORM DE-LETE.
131100     GO TO STR-WRITE-GF-20-3.
131200 STR-FAIL-GF-20-3.
131300     PERFORM FAIL
131400     MOVE    MY-BOSS-DU-2V0 TO COMPUTED-N
131500     MOVE    38 TO CORRECT-N.
131600 STR-WRITE-GF-20-3.
131700     PERFORM PRINT-DETAIL.
131800*
131900*
132000 STR-INIT-GF-21.
132100*    ===-->  INTO GROUP FIELD  <--===
132200     MOVE   "VI-130 6.24.3 GR4" TO ANSI-REFERENCE.
132300     MOVE   "STR-TEST-GF-21" TO PAR-NAME.
132400     MOVE   "LIT DEL BY SIZE" TO FEATURE.
132500     MOVE    "*****" TO ID7-XN-5.
132600     MOVE    1 TO ID8-DU-2V0.
132700     MOVE    1 TO REC-CT.
132800*
132900 STR-TEST-GF-21-0.
133000     STRING "ABCDEF" DELIMITED BY SIZE INTO TEST-21-GROUP
133100             WITH POINTER ID8-DU-2V0.
133200     GO TO   STR-TEST-GF-21-1.
133300 STR-DELETE-GF-21.
133400     PERFORM DE-LETE.
133500     PERFORM PRINT-DETAIL.
133600     GO TO   STR-INIT-GF-22.
133700*
133800 STR-TEST-GF-21-1.
133900     IF      TEST-21-GROUP = "ABCDE"
134000             PERFORM PASS
134100             GO TO STR-WRITE-GF-21-1
134200     ELSE
134300             GO TO STR-FAIL-GF-21-1.
134400 STR-DELETE-GF-21-1.
134500     PERFORM DE-LETE.
134600     GO TO STR-WRITE-GF-21-1.
134700 STR-FAIL-GF-21-1.
134800     PERFORM FAIL
134900     MOVE    TEST-21-GROUP TO COMPUTED-A
135000     MOVE   "ABCDE" TO CORRECT-A.
135100 STR-WRITE-GF-21-1.
135200     PERFORM PRINT-DETAIL.
135300*
135400 STR-TEST-GF-21-2.
135500     ADD 1 TO REC-CT.
135600     IF      ID8-DU-2V0 = 6
135700             PERFORM PASS
135800             GO TO STR-WRITE-GF-21-2
135900     ELSE
136000             GO TO STR-FAIL-GF-21-2.
136100 STR-DELETE-GF-21-2.
136200     PERFORM DE-LETE.
136300     GO TO STR-WRITE-GF-21-2.
136400 STR-FAIL-GF-21-2.
136500     PERFORM FAIL
136600     MOVE    ID8-DU-2V0 TO COMPUTED-N
136700     MOVE    6 TO CORRECT-N.
136800 STR-WRITE-GF-21-2.
136900     PERFORM PRINT-DETAIL.
137000*
137100 STR-INIT-GF-22.
137200*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
137300     MOVE   "VI-132 6.24.4 GR9, 10" TO ANSI-REFERENCE.
137400     MOVE   "STR-TEST-GF-22" TO PAR-NAME.
137500     MOVE   "LIT DEL BY LIT" TO FEATURE.
137600     MOVE    "*****" TO ID7-XN-5.
137700     MOVE    1 TO ID8-DU-2V0.
137800     MOVE    1 TO REC-CT.
137900*
138000 STR-TEST-GF-22-1.
138100     STRING "ABCDEF" DELIMITED BY "ABCDEFG"
138200             INTO ID7-XN-5 WITH POINTER ID8-DU-2V0
138300         NOT ON OVERFLOW GO TO STR-FAIL-GF-22-1.
138400     PERFORM PASS.
138500     GO TO STR-WRITE-GF-22-1.
138600 STR-DELETE-GF-22.
138700     PERFORM DE-LETE.
138800     PERFORM PRINT-DETAIL.
138900     GO      TO STR-INIT-GF-23.
139000 STR-FAIL-GF-22-1.
139100     PERFORM FAIL.
139200     MOVE    "NOT ON OVERFLOW SHOULD NOT OCCUR" TO RE-MARK.
139300 STR-WRITE-GF-22-1.
139400     PERFORM PRINT-DETAIL.
139500*
139600 STR-TEST-GF-22-2.
139700     ADD     1 TO REC-CT.
139800     IF      ID7-XN-5 = "ABCDE"
139900             PERFORM PASS
140000             GO TO STR-WRITE-GF-22-2
140100     ELSE
140200             GO TO STR-FAIL-GF-22-2.
140300 STR-DELETE-GF-22-2.
140400     PERFORM DE-LETE.
140500     GO TO STR-WRITE-GF-22-2.
140600 STR-FAIL-GF-22-2.
140700     PERFORM FAIL.
140800     MOVE    ID7-XN-5 TO COMPUTED-A
140900     MOVE   "ABCDE" TO CORRECT-A.
141000 STR-WRITE-GF-22-2.
141100     PERFORM PRINT-DETAIL.
141200*
141300 STR-TEST-GF-22-3.
141400     ADD     1 TO REC-CT.
141500     IF      ID8-DU-2V0 = 6
141600             PERFORM PASS
141700             GO TO STR-WRITE-GF-22-3
141800     ELSE
141900             GO TO STR-FAIL-GF-22-3.
142000 STR-DELETE-GF-22-3.
142100     PERFORM DE-LETE.
142200     GO TO STR-WRITE-GF-22-3.
142300 STR-FAIL-GF-22-3.
142400     PERFORM FAIL
142500     MOVE    ID8-DU-2V0 TO COMPUTED-N
142600     MOVE    6 TO CORRECT-N.
142700 STR-WRITE-GF-22-3.
142800     PERFORM PRINT-DETAIL.
142900*
143000 STR-INIT-GF-23.
143100*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
143200     MOVE   "VI-132 6.24.4 GR9, 10" TO ANSI-REFERENCE.
143300     MOVE   "STR-TEST-GF-23" TO PAR-NAME.
143400     MOVE   "LITERAL SERIES" TO FEATURE.
143500     MOVE    "*****" TO ID7-XN-5.
143600     MOVE    1 TO ID8-DU-2V0.
143700     MOVE    1 TO REC-CT.
143800*
143900 STR-TEST-GF-23-1.
144000     STRING "A" "B" "C" "D" "E" DELIMITED "ABCDE" INTO ID7-XN-5
144100             POINTER ID8-DU-2V0
144200         NOT ON OVERFLOW PERFORM PASS
144300                         GO TO   STR-WRITE-GF-23-1.
144400     GO TO   STR-FAIL-GF-23-1.
144500 STR-DELETE-GF-23.
144600     PERFORM DE-LETE.
144700     PERFORM PRINT-DETAIL.
144800     GO TO   STR-INIT-GF-24.
144900 STR-FAIL-GF-23-1.
145000     PERFORM FAIL.
145100     MOVE   "NOT ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK.
145200 STR-WRITE-GF-23-1.
145300     PERFORM PRINT-DETAIL.
145400*
145500 STR-TEST-GF-23-2.
145600     ADD     1 TO REC-CT.
145700     IF      ID7-XN-5 = "ABCDE"
145800             PERFORM PASS
145900             GO TO STR-WRITE-GF-23-2
146000     ELSE
146100             GO TO STR-FAIL-GF-23-2.
146200 STR-DELETE-GF-23-2.
146300     PERFORM DE-LETE.
146400     GO TO STR-WRITE-GF-23-2.
146500 STR-FAIL-GF-23-2.
146600     PERFORM FAIL
146700     MOVE    ID7-XN-5 TO COMPUTED-A
146800     MOVE   "ABCDE" TO CORRECT-A.
146900 STR-WRITE-GF-23-2.
147000     PERFORM PRINT-DETAIL.
147100*
147200 STR-TEST-GF-23-3.
147300     ADD     1 TO REC-CT.
147400     IF      ID8-DU-2V0 = 6
147500             PERFORM PASS
147600             GO TO STR-WRITE-GF-23-3
147700     ELSE
147800             GO TO STR-FAIL-GF-23-3.
147900 STR-DELETE-GF-23-3.
148000     PERFORM DE-LETE.
148100     GO TO STR-WRITE-GF-23-3.
148200 STR-FAIL-GF-23-3.
148300     PERFORM FAIL
148400     MOVE    ID8-DU-2V0 TO COMPUTED-N
148500     MOVE    6 TO CORRECT-N.
148600 STR-WRITE-GF-23-3.
148700     PERFORM PRINT-DETAIL.
148800*
148900 STR-INIT-GF-24.
149000*    ===-->  BOTH "OVERFLOW" PHRASES  <--===
149100     MOVE   "VI-132 6.24.4 GR9, 10" TO ANSI-REFERENCE.
149200     MOVE   "STR-TEST-GF-24" TO PAR-NAME.
149300     MOVE   "LIT DEL BY LIT" TO FEATURE.
149400     MOVE    "*****" TO ID7-XN-5.
149500     MOVE    1 TO ID8-DU-2V0.
149600     MOVE    1 TO REC-CT.
149700*
149800 STR-TEST-GF-24-1.
149900     STRING "ABCDEF" DELIMITED BY "ABCDEFG"
150000             INTO ID7-XN-5 WITH POINTER ID8-DU-2V0
150100             ON OVERFLOW PERFORM PASS
150200                         GO TO STR-WRITE-GF-24-1
150300         NOT ON OVERFLOW GO TO STR-FAIL-GF-24-1.
150400 STR-DELETE-GF-24.
150500     PERFORM DE-LETE.
150600     PERFORM PRINT-DETAIL.
150700     GO      TO STR-INIT-GF-25.
150800 STR-FAIL-GF-24-1.
150900     PERFORM FAIL.
151000     MOVE    "NOT ON OVERFLOW SHOULD NOT OCCUR" TO RE-MARK.
151100 STR-WRITE-GF-24-1.
151200     PERFORM PRINT-DETAIL.
151300*
151400 STR-TEST-GF-24-2.
151500     ADD     1 TO REC-CT.
151600     IF      ID7-XN-5 = "ABCDE"
151700             PERFORM PASS
151800             GO TO STR-WRITE-GF-24-2
151900     ELSE
152000             GO TO STR-FAIL-GF-24-2.
152100 STR-DELETE-GF-24-2.
152200     PERFORM DE-LETE.
152300     GO TO STR-WRITE-GF-24-2.
152400 STR-FAIL-GF-24-2.
152500     PERFORM FAIL
152600     MOVE    ID7-XN-5 TO COMPUTED-A
152700     MOVE   "ABCDE" TO CORRECT-A.
152800 STR-WRITE-GF-24-2.
152900     PERFORM PRINT-DETAIL.
153000*
153100 STR-TEST-GF-24-3.
153200     ADD     1 TO REC-CT.
153300     IF      ID8-DU-2V0 = 6
153400             PERFORM PASS
153500             GO TO STR-WRITE-GF-24-3
153600     ELSE
153700             GO TO STR-FAIL-GF-24-3.
153800 STR-DELETE-GF-24-3.
153900     PERFORM DE-LETE.
154000     GO TO STR-WRITE-GF-24-3.
154100 STR-FAIL-GF-24-3.
154200     PERFORM FAIL
154300     MOVE    ID8-DU-2V0 TO COMPUTED-N
154400     MOVE    6 TO CORRECT-N.
154500 STR-WRITE-GF-24-3.
154600     PERFORM PRINT-DETAIL.
154700*
154800 STR-INIT-GF-25.
154900*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
155000     MOVE   "VI-132 6.24.4 GR9, 10" TO ANSI-REFERENCE.
155100     MOVE   "STR-TEST-GF-25" TO PAR-NAME.
155200     MOVE   "LITERAL SERIES" TO FEATURE.
155300     MOVE    "*****" TO ID7-XN-5.
155400     MOVE    1 TO ID8-DU-2V0.
155500     MOVE    ZERO TO REC-CT.
155600*
155700 STR-TEST-GF-25-1.
155800     STRING "A" "B" "C" "D" "E" DELIMITED "ABCDE" INTO ID7-XN-5
155900             POINTER ID8-DU-2V0
156000             ON OVERFLOW GO TO STR-FAIL-GF-25-1
156100         NOT ON OVERFLOW PERFORM PASS
156200                         GO TO STR-WRITE-GF-25-1.
156300 STR-DELETE-GF-25-1.
156400     PERFORM DE-LETE.
156500     PERFORM PRINT-DETAIL.
156600     GO TO   STR-INIT-GF-26.
156700 STR-FAIL-GF-25-1.
156800     PERFORM FAIL.
156900     MOVE   "ON OVERFLOW SHOULD NOT HAVE EXECUTED" TO RE-MARK.
157000 STR-WRITE-GF-25-1.
157100     PERFORM PRINT-DETAIL.
157200*
157300 STR-TEST-GF-25-2.
157400     MOVE   "STR-TEST-GF-25-1" TO PAR-NAME.
157500     MOVE    1 TO REC-CT.
157600     IF      ID7-XN-5 = "ABCDE"
157700             PERFORM PASS
157800             GO TO STR-WRITE-GF-25-2
157900     ELSE
158000             GO TO STR-FAIL-GF-25-2.
158100 STR-DELETE-GF-25-2.
158200     PERFORM DE-LETE.
158300     GO TO STR-WRITE-GF-25-2.
158400 STR-FAIL-GF-25-2.
158500     PERFORM FAIL
158600     MOVE    ID7-XN-5 TO COMPUTED-A
158700     MOVE   "ABCDE" TO CORRECT-A.
158800 STR-WRITE-GF-25-2.
158900     PERFORM PRINT-DETAIL.
159000*
159100 STR-TEST-GF-25-3.
159200     ADD     1 TO REC-CT.
159300     IF      ID8-DU-2V0 = 6
159400             PERFORM PASS
159500             GO TO STR-WRITE-GF-25-3
159600     ELSE
159700             GO TO STR-FAIL-GF-25-3.
159800 STR-DELETE-GF-25-3.
159900     PERFORM DE-LETE.
160000     GO TO STR-WRITE-GF-25-3.
160100 STR-FAIL-GF-25-3.
160200     PERFORM FAIL
160300     MOVE    ID8-DU-2V0 TO COMPUTED-N
160400     MOVE    6 TO CORRECT-N.
160500 STR-WRITE-GF-25-3.
160600     PERFORM PRINT-DETAIL.
160700*
160800 STR-INIT-GF-26.
160900*    ===-->  EXPLICIT SCOPE TERMINATOR  <--===
161000     MOVE   "VI-132 6.24.4 GR11" TO ANSI-REFERENCE.
161100     MOVE   "STR-TEST-GF-26" TO PAR-NAME.
161200     MOVE   "LIT DEL BY LIT" TO FEATURE.
161300     MOVE    "*****" TO ID7-XN-5.
161400     MOVE    1 TO ID8-DU-2V0.
161500     MOVE    1 TO REC-CT.
161600     MOVE    SPACE TO WRK-XN-00001-1.
161700     MOVE    SPACE TO WRK-XN-00001-2.
161800     MOVE    SPACE TO WRK-XN-00001-3.
161900*
162000 STR-TEST-GF-26-0.
162100     STRING "ABCDEF" DELIMITED BY "ABCDEFG"
162200             INTO ID7-XN-5 WITH POINTER ID8-DU-2V0
162300             ON OVERFLOW
162400             MOVE "A" TO WRK-XN-00001-1
162500             MOVE "B" TO WRK-XN-00001-2
162600         NOT ON OVERFLOW
162700             MOVE "C" TO WRK-XN-00001-1
162800             MOVE "D" TO WRK-XN-00001-2
162900     END-STRING
163000     MOVE   "Z" TO WRK-XN-00001-3.
163100     GO TO   STR-TEST-GF-26-1.
163200 STR-DELETE-GF-26.
163300     PERFORM DE-LETE.
163400     PERFORM PRINT-DETAIL.
163500     GO      TO STR-INIT-GF-27.
163600*
163700 STR-TEST-GF-26-1.
163800     IF      ID7-XN-5 = "ABCDE"
163900             PERFORM PASS
164000             GO TO STR-WRITE-GF-26-1
164100     ELSE
164200             GO TO STR-FAIL-GF-26-1.
164300 STR-DELETE-GF-26-1.
164400     PERFORM DE-LETE.
164500     GO TO STR-WRITE-GF-26-1.
164600 STR-FAIL-GF-26-1.
164700     PERFORM FAIL
164800     MOVE    ID7-XN-5 TO COMPUTED-A
164900     MOVE   "ABCDE" TO CORRECT-A.
165000 STR-WRITE-GF-26-1.
165100     PERFORM PRINT-DETAIL.
165200*
165300 STR-TEST-GF-26-2.
165400     ADD     1 TO REC-CT.
165500     MOVE   "STR-TEST-GF-26-2" TO PAR-NAME.
165600     IF      ID8-DU-2V0 = 6
165700             PERFORM PASS
165800             GO TO STR-WRITE-GF-26-2
165900     ELSE
166000             GO TO STR-FAIL-GF-26-2.
166100 STR-DELETE-GF-26-2.
166200     PERFORM DE-LETE.
166300     GO TO STR-WRITE-GF-26-2.
166400 STR-FAIL-GF-26-2.
166500     PERFORM FAIL
166600     MOVE    ID8-DU-2V0 TO COMPUTED-N
166700     MOVE    6 TO CORRECT-N.
166800 STR-WRITE-GF-26-2.
166900     PERFORM PRINT-DETAIL.
167000*
167100 STR-TEST-GF-26-3.
167200     ADD     1 TO REC-CT.
167300     IF      WRK-XN-00001-1 = "A"
167400             PERFORM PASS
167500             GO TO STR-WRITE-GF-26-3
167600     ELSE
167700             GO TO STR-FAIL-GF-26-3.
167800 STR-DELETE-GF-26-3.
167900     PERFORM DE-LETE.
168000     GO TO STR-WRITE-GF-26-3.
168100 STR-FAIL-GF-26-3.
168200     MOVE    WRK-XN-00001-1 TO COMPUTED-X
168300     MOVE   "A" TO CORRECT-X
168400     MOVE   "ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK
168500     PERFORM FAIL.
168600 STR-WRITE-GF-26-3.
168700     PERFORM PRINT-DETAIL.
168800*
168900 STR-TEST-GF-26-4.
169000     ADD     1 TO REC-CT.
169100     IF      WRK-XN-00001-2 = "B"
169200             PERFORM PASS
169300             GO TO STR-WRITE-GF-26-4
169400     ELSE
169500             GO TO STR-FAIL-GF-26-4.
169600 STR-DELETE-GF-26-4.
169700     PERFORM DE-LETE.
169800     GO TO STR-WRITE-GF-26-4.
169900 STR-FAIL-GF-26-4.
170000     MOVE    WRK-XN-00001-2 TO COMPUTED-X
170100     MOVE   "B" TO CORRECT-X
170200     MOVE   "ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK
170300     PERFORM FAIL.
170400 STR-WRITE-GF-26-4.
170500     PERFORM PRINT-DETAIL.
170600*
170700 STR-TEST-GF-26-5.
170800     ADD     1 TO REC-CT.
170900     IF      WRK-XN-00001-3 = "Z"
171000             PERFORM PASS
171100             GO TO STR-WRITE-GF-26-5
171200     ELSE
171300             GO TO STR-FAIL-GF-26-5.
171400 STR-DELETE-GF-26-5.
171500     PERFORM DE-LETE.
171600     GO TO STR-WRITE-GF-26-5.
171700 STR-FAIL-GF-26-5.
171800     MOVE    WRK-XN-00001-3 TO COMPUTED-X
171900     MOVE   "Z" TO CORRECT-X
172000     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
172100     PERFORM FAIL.
172200 STR-WRITE-GF-26-5.
172300     PERFORM PRINT-DETAIL.
172400*
172500 STR-INIT-GF-27.
172600*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
172700     MOVE   "VI-132 6.24.4 GR9, 10" TO ANSI-REFERENCE.
172800     MOVE   "STR-TEST-GF-27" TO PAR-NAME.
172900     MOVE   "LIT DEL BY LIT" TO FEATURE.
173000     MOVE    "*****" TO ID7-XN-5.
173100     MOVE    1 TO ID8-DU-2V0.
173200     MOVE    ZERO TO REC-CT.
173300     MOVE    SPACE TO WRK-XN-00001-1.
173400     MOVE    SPACE TO WRK-XN-00001-2.
173500     MOVE    SPACE TO WRK-XN-00001-3.
173600*
173700 STR-TEST-GF-27-0.
173800     STRING "ABCDEF" DELIMITED BY "ABCDEFG"
173900             INTO ID7-XN-5 WITH POINTER ID8-DU-2V0
174000             ON OVERFLOW
174100             MOVE "A" TO WRK-XN-00001-1
174200             MOVE "B" TO WRK-XN-00001-2
174300     END-STRING
174400     MOVE   "Z" TO WRK-XN-00001-3.
174500     GO TO   STR-TEST-GF-27-1.
174600 STR-DELETE-GF-27.
174700     PERFORM DE-LETE.
174800     PERFORM PRINT-DETAIL.
174900     GO TO   STR-INIT-GF-28.
175000*
175100 STR-TEST-GF-27-1.
175200     MOVE    1 TO REC-CT.
175300     IF      ID7-XN-5 = "ABCDE"
175400             PERFORM PASS
175500             GO TO STR-WRITE-GF-27-1
175600     ELSE
175700             GO TO STR-FAIL-GF-27-1.
175800 STR-DELETE-GF-27-1.
175900     PERFORM DE-LETE.
176000     GO TO STR-WRITE-GF-27-1.
176100 STR-FAIL-GF-27-1.
176200     PERFORM FAIL
176300     MOVE    ID7-XN-5 TO COMPUTED-A
176400     MOVE   "ABCDE" TO CORRECT-A.
176500 STR-WRITE-GF-27-1.
176600     PERFORM PRINT-DETAIL.
176700*
176800 STR-TEST-GF-27-2.
176900     ADD     1 TO REC-CT.
177000     IF      ID8-DU-2V0 = 6
177100             PERFORM PASS
177200             GO TO STR-WRITE-GF-27-2
177300     ELSE
177400             GO TO STR-FAIL-GF-27-2.
177500 STR-DELETE-GF-27-2.
177600     PERFORM DE-LETE.
177700     GO TO STR-WRITE-GF-27-2.
177800 STR-FAIL-GF-27-2.
177900             PERFORM FAIL
178000             MOVE    ID8-DU-2V0 TO COMPUTED-N
178100             MOVE    6 TO CORRECT-N.
178200 STR-WRITE-GF-27-2.
178300             PERFORM PRINT-DETAIL.
178400*
178500 STR-TEST-GF-27-3.
178600     ADD     1 TO REC-CT.
178700     IF      WRK-XN-00001-1 = "A"
178800             PERFORM PASS
178900             GO TO STR-WRITE-GF-27-3
179000     ELSE
179100             GO TO STR-FAIL-GF-27-3.
179200 STR-DELETE-GF-27-3.
179300     PERFORM DE-LETE.
179400     GO TO STR-WRITE-GF-27-3.
179500 STR-FAIL-GF-27-3.
179600     MOVE    WRK-XN-00001-1 TO COMPUTED-X
179700     MOVE   "A"    TO CORRECT-X
179800     MOVE   "ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK
179900     PERFORM FAIL.
180000 STR-WRITE-GF-27-3.
180100     PERFORM PRINT-DETAIL.
180200*
180300 STR-TEST-GF-27-4.
180400     ADD     1 TO REC-CT.
180500     IF      WRK-XN-00001-2 = "B"
180600             PERFORM PASS
180700             GO TO STR-WRITE-GF-27-4
180800     ELSE
180900             GO TO STR-FAIL-GF-27-4.
181000 STR-DELETE-GF-27-4.
181100     PERFORM DE-LETE.
181200     GO TO STR-WRITE-GF-27-4.
181300 STR-FAIL-GF-27-4.
181400     MOVE    WRK-XN-00001-2 TO COMPUTED-X
181500     MOVE   "B" TO CORRECT-X
181600     MOVE   "ON OVERFLOW SHOULD HAVE EXECUTED" TO RE-MARK
181700     PERFORM FAIL.
181800 STR-WRITE-GF-27-4.
181900     PERFORM PRINT-DETAIL.
182000*
182100 STR-TEST-GF-27-5.
182200     ADD     1 TO REC-CT.
182300     IF      WRK-XN-00001-3 = "Z"
182400             PERFORM PASS
182500             GO TO STR-WRITE-GF-27-5
182600     ELSE
182700             GO TO STR-FAIL-GF-27-5.
182800 STR-DELETE-GF-27-5.
182900     PERFORM DE-LETE.
183000     GO TO STR-WRITE-GF-27-5.
183100 STR-FAIL-GF-27-5.
183200     MOVE    WRK-XN-00001-3 TO COMPUTED-X
183300     MOVE   "Z" TO CORRECT-X
183400     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
183500     PERFORM FAIL.
183600 STR-WRITE-GF-27-5.
183700     PERFORM PRINT-DETAIL.
183800*
183900 STR-INIT-GF-28.
184000*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
184100     MOVE   "VI-132 6.24.4 GR9, 10" TO ANSI-REFERENCE.
184200     MOVE   "STR-TEST-GF-28" TO PAR-NAME.
184300     MOVE   "LITERAL SERIES" TO FEATURE.
184400     MOVE    "*****" TO ID7-XN-5.
184500     MOVE    1 TO ID8-DU-2V0.
184600     MOVE    ZERO TO REC-CT.
184700     MOVE    SPACE TO WRK-XN-00001-1.
184800     MOVE    SPACE TO WRK-XN-00001-2.
184900     MOVE    SPACE TO WRK-XN-00001-3.
185000*
185100 STR-TEST-GF-28-0.
185200     STRING "A" "B" "C" "D" "E" DELIMITED "ABCDE" INTO ID7-XN-5
185300             POINTER ID8-DU-2V0
185400             ON OVERFLOW
185500             MOVE "A" TO WRK-XN-00001-1
185600             MOVE "B" TO WRK-XN-00001-2
185700     END-STRING
185800     MOVE   "Z" TO WRK-XN-00001-3.
185900     GO TO   STR-TEST-GF-28-1.
186000 STR-DELETE-GF-28.
186100     PERFORM DE-LETE.
186200     PERFORM PRINT-DETAIL.
186300     GO TO   STR-INIT-GF-29.
186400*
186500 STR-TEST-GF-28-1.
186600     MOVE    1 TO REC-CT.
186700     IF      ID7-XN-5 = "ABCDE"
186800             PERFORM PASS
186900             GO TO STR-WRITE-GF-28-1
187000     ELSE
187100             GO TO STR-FAIL-GF-28-1.
187200 STR-DELETE-GF-28-1.
187300     PERFORM DE-LETE.
187400     GO TO STR-WRITE-GF-28-1.
187500 STR-FAIL-GF-28-1.
187600     PERFORM FAIL
187700     MOVE    ID7-XN-5 TO COMPUTED-A
187800     MOVE   "ABCDE" TO CORRECT-A.
187900 STR-WRITE-GF-28-1.
188000     PERFORM PRINT-DETAIL.
188100*
188200 STR-TEST-GF-28-2.
188300     ADD     1 TO REC-CT.
188400     IF      ID8-DU-2V0 = 6
188500             PERFORM PASS
188600             GO TO STR-WRITE-GF-28-2
188700     ELSE
188800             GO TO STR-FAIL-GF-28-2.
188900 STR-DELETE-GF-28-2.
189000     PERFORM DE-LETE.
189100     GO TO STR-WRITE-GF-28-2.
189200 STR-FAIL-GF-28-2.
189300     PERFORM FAIL
189400     MOVE    ID8-DU-2V0 TO COMPUTED-N
189500     MOVE    6 TO CORRECT-N.
189600 STR-WRITE-GF-28-2.
189700     PERFORM PRINT-DETAIL.
189800*
189900 STR-TEST-GF-28-3.
190000     ADD     1 TO REC-CT.
190100     IF      WRK-XN-00001-1 = SPACE
190200             PERFORM PASS
190300             GO TO STR-WRITE-GF-28-3
190400     ELSE
190500             GO TO STR-FAIL-GF-28-3.
190600 STR-DELETE-GF-28-3.
190700     PERFORM DE-LETE.
190800     GO TO STR-WRITE-GF-28-3.
190900 STR-FAIL-GF-28-3.
191000     MOVE    WRK-XN-00001-1 TO COMPUTED-X
191100     MOVE    SPACE TO CORRECT-X
191200     MOVE   "ON OVERFLOW SHOULD NOT HAVE EXECUTED" TO RE-MARK
191300     PERFORM FAIL.
191400 STR-WRITE-GF-28-3.
191500     PERFORM PRINT-DETAIL.
191600*
191700 STR-TEST-GF-28-4.
191800     ADD     1 TO REC-CT.
191900     IF      WRK-XN-00001-2 =  SPACE
192000             PERFORM PASS
192100             GO TO STR-WRITE-GF-28-4
192200     ELSE
192300             GO TO STR-FAIL-GF-28-4.
192400 STR-DELETE-GF-28-4.
192500     PERFORM DE-LETE.
192600     GO TO STR-WRITE-GF-28-4.
192700 STR-FAIL-GF-28-4.
192800     MOVE    WRK-XN-00001-2 TO COMPUTED-X
192900     MOVE    SPACE TO CORRECT-X
193000     MOVE   "ON OVERFLOW SHOULD NOT HAVE EXECUTED" TO RE-MARK
193100     PERFORM FAIL.
193200 STR-WRITE-GF-28-4.
193300     PERFORM PRINT-DETAIL.
193400*
193500 STR-TEST-GF-28-5.
193600     ADD     1 TO REC-CT.
193700     IF      WRK-XN-00001-3 = "Z"
193800             PERFORM PASS
193900             GO TO STR-WRITE-GF-28-5
194000     ELSE
194100             GO TO STR-FAIL-GF-28-5.
194200 STR-DELETE-GF-28-5.
194300     PERFORM DE-LETE.
194400     GO TO STR-WRITE-GF-28-5.
194500 STR-FAIL-GF-28-5.
194600     MOVE    WRK-XN-00001-3 TO COMPUTED-X
194700     MOVE   "Z" TO CORRECT-X
194800     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
194900     PERFORM FAIL.
195000 STR-WRITE-GF-28-5.
195100     PERFORM PRINT-DETAIL.
195200*
195300 STR-INIT-GF-29.
195400*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
195500     MOVE   "VI-132 6.24.4 GR9, 10" TO ANSI-REFERENCE.
195600     MOVE   "STR-TEST-GF-29" TO PAR-NAME.
195700     MOVE   "LIT DEL BY LIT" TO FEATURE.
195800     MOVE    "*****" TO ID7-XN-5.
195900     MOVE    1 TO ID8-DU-2V0.
196000     MOVE    ZERO TO REC-CT.
196100     MOVE    SPACE TO WRK-XN-00001-1.
196200     MOVE    SPACE TO WRK-XN-00001-2.
196300     MOVE    SPACE TO WRK-XN-00001-3.
196400*
196500 STR-TEST-GF-29.
196600     STRING "ABCDEF" DELIMITED BY "ABCDEFG"
196700             INTO ID7-XN-5 WITH POINTER ID8-DU-2V0
196800         NOT ON OVERFLOW
196900             MOVE "A" TO WRK-XN-00001-1
197000             MOVE "B" TO WRK-XN-00001-2
197100     END-STRING
197200     MOVE   "Z" TO WRK-XN-00001-3.
197300     GO TO   STR-TEST-GF-29-1.
197400 STR-DELETE-GF-29.
197500     PERFORM DE-LETE.
197600     PERFORM PRINT-DETAIL.
197700     GO TO   STR-INIT-GF-30.
197800*
197900 STR-TEST-GF-29-1.
198000     MOVE    1 TO REC-CT.
198100     IF      ID7-XN-5 = "ABCDE"
198200             PERFORM PASS
198300             GO TO STR-WRITE-GF-29-1
198400     ELSE
198500             GO TO STR-FAIL-GF-29-1.
198600 STR-DELETE-GF-29-1.
198700     PERFORM DE-LETE.
198800     GO TO STR-WRITE-GF-29-1.
198900 STR-FAIL-GF-29-1.
199000     PERFORM FAIL
199100     MOVE    ID7-XN-5 TO COMPUTED-A
199200     MOVE   "ABCDE" TO CORRECT-A.
199300 STR-WRITE-GF-29-1.
199400     PERFORM PRINT-DETAIL.
199500*
199600 STR-TEST-GF-29-2.
199700     ADD     1 TO REC-CT.
199800     IF      ID8-DU-2V0 = 6
199900             PERFORM PASS
200000             GO TO STR-WRITE-GF-29-2
200100     ELSE
200200             GO TO STR-FAIL-GF-29-2.
200300 STR-DELETE-GF-29-2.
200400     PERFORM DE-LETE.
200500     GO TO STR-WRITE-GF-29-2.
200600 STR-FAIL-GF-29-2.
200700     PERFORM FAIL
200800     MOVE    ID8-DU-2V0 TO COMPUTED-N
200900     MOVE    6 TO CORRECT-N.
201000 STR-WRITE-GF-29-2.
201100     PERFORM PRINT-DETAIL.
201200*
201300 STR-TEST-GF-29-3.
201400     ADD     1 TO REC-CT.
201500     IF      WRK-XN-00001-1 = SPACE
201600             PERFORM PASS
201700             GO TO STR-WRITE-GF-29-3
201800     ELSE
201900             GO TO STR-FAIL-GF-29-3.
202000 STR-DELETE-GF-29-3.
202100     PERFORM DE-LETE.
202200     GO TO STR-WRITE-GF-29-3.
202300 STR-FAIL-GF-29-3.
202400     MOVE    WRK-XN-00001-1 TO COMPUTED-X
202500     MOVE    SPACE TO CORRECT-X
202600     MOVE   "NOT ON OVERFLOW SHOULD NOT HAVE EXECUTED"
202700          TO RE-MARK
202800     PERFORM FAIL.
202900 STR-WRITE-GF-29-3.
203000     PERFORM PRINT-DETAIL.
203100*
203200 STR-TEST-GF-29-4.
203300     ADD     1 TO REC-CT.
203400     IF      WRK-XN-00001-2 = SPACE
203500             PERFORM PASS
203600             GO TO STR-WRITE-GF-29-4
203700     ELSE
203800             GO TO STR-FAIL-GF-29-4.
203900 STR-DELETE-GF-29-4.
204000     PERFORM DE-LETE.
204100     GO TO STR-WRITE-GF-29-4.
204200 STR-FAIL-GF-29-4.
204300     MOVE    WRK-XN-00001-2 TO COMPUTED-X
204400     MOVE    SPACE TO CORRECT-X
204500     MOVE   "NOT ON OVERFLOW SHOULD NOT HAVE EXECUTED"
204600          TO RE-MARK
204700     PERFORM FAIL.
204800 STR-WRITE-GF-29-4.
204900     PERFORM PRINT-DETAIL.
205000*
205100 STR-TEST-GF-29-5.
205200     ADD     1 TO REC-CT.
205300     IF      WRK-XN-00001-3 = "Z"
205400             PERFORM PASS
205500             GO TO STR-WRITE-GF-29-5
205600     ELSE
205700             GO TO STR-FAIL-GF-29-5.
205800 STR-DELETE-GF-29-5.
205900     PERFORM DE-LETE.
206000     GO TO STR-WRITE-GF-29-5.
206100 STR-FAIL-GF-29-5.
206200     MOVE    WRK-XN-00001-3 TO COMPUTED-X
206300     MOVE   "Z" TO CORRECT-X
206400     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
206500     PERFORM FAIL.
206600 STR-WRITE-GF-29-5.
206700     PERFORM PRINT-DETAIL.
206800*
206900 STR-INIT-GF-30.
207000*    ===--> "NOT ON OVERFLOW" PHRASE  <--===
207100     MOVE   "VI-132 6.24.4 GR9, 10" TO ANSI-REFERENCE.
207200     MOVE   "STR-TEST-GF-30" TO PAR-NAME.
207300     MOVE   "LITERAL SERIES" TO FEATURE.
207400     MOVE    "*****" TO ID7-XN-5.
207500     MOVE    1 TO ID8-DU-2V0.
207600     MOVE    ZERO TO REC-CT.
207700     MOVE    SPACE TO WRK-XN-00001-1.
207800     MOVE    SPACE TO WRK-XN-00001-2.
207900     MOVE    SPACE TO WRK-XN-00001-3.
208000*
208100 STR-TEST-GF-30.
208200     STRING "A" "B" "C" "D" "E" DELIMITED "ABCDE" INTO ID7-XN-5
208300             POINTER ID8-DU-2V0
208400         NOT ON OVERFLOW
208500             MOVE "A" TO WRK-XN-00001-1
208600             MOVE "B" TO WRK-XN-00001-2
208700     END-STRING
208800     MOVE   "Z" TO WRK-XN-00001-3.
208900     GO TO   STR-TEST-GF-30-1.
209000 STR-DELETE-GF-30.
209100     PERFORM DE-LETE.
209200     PERFORM PRINT-DETAIL.
209300     GO TO   CCVS-EXIT.
209400*
209500 STR-TEST-GF-30-1.
209600     MOVE    1 TO REC-CT.
209700     IF      ID7-XN-5 = "ABCDE"
209800             PERFORM PASS
209900             GO TO STR-WRITE-GF-30-1
210000     ELSE
210100             GO TO STR-FAIL-GF-30-1.
210200 STR-DELETE-GF-30-1.
210300     PERFORM DE-LETE.
210400     GO TO STR-WRITE-GF-30-1.
210500 STR-FAIL-GF-30-1.
210600     PERFORM FAIL
210700     MOVE    ID7-XN-5 TO COMPUTED-A
210800     MOVE   "ABCDE" TO CORRECT-A.
210900 STR-WRITE-GF-30-1.
211000     PERFORM PRINT-DETAIL.
211100*
211200 STR-TEST-GF-30-2.
211300     ADD     1 TO REC-CT.
211400     IF      ID8-DU-2V0 = 6
211500             PERFORM PASS
211600             GO TO STR-WRITE-GF-30-2
211700     ELSE
211800             GO TO STR-FAIL-GF-30-2.
211900 STR-DELETE-GF-30-2.
212000     PERFORM DE-LETE.
212100     GO TO STR-WRITE-GF-30-2.
212200 STR-FAIL-GF-30-2.
212300     PERFORM FAIL
212400     MOVE    ID8-DU-2V0 TO COMPUTED-N
212500     MOVE    6 TO CORRECT-N.
212600 STR-WRITE-GF-30-2.
212700     PERFORM PRINT-DETAIL.
212800*
212900 STR-TEST-GF-30-3.
213000     ADD     1 TO REC-CT.
213100     IF      WRK-XN-00001-1 = "A"
213200             PERFORM PASS
213300             GO TO STR-WRITE-GF-30-3
213400     ELSE
213500             GO TO STR-FAIL-GF-30-3.
213600 STR-DELETE-GF-30-3.
213700     PERFORM DE-LETE.
213800     GO TO STR-WRITE-GF-30-3.
213900 STR-FAIL-GF-30-3.
214000     MOVE    WRK-XN-00001-1 TO COMPUTED-X
214100     MOVE   "A"    TO CORRECT-X
214200     MOVE   "NOT ON OVERFLOW SHOULD HAVE EXECUTED"
214300          TO RE-MARK
214400     PERFORM FAIL.
214500 STR-WRITE-GF-30-3.
214600     PERFORM PRINT-DETAIL.
214700*
214800 STR-TEST-GF-30-4.
214900     ADD     1 TO REC-CT.
215000     IF      WRK-XN-00001-2 =  "B"
215100             PERFORM PASS
215200             GO TO STR-WRITE-GF-30-4
215300     ELSE
215400             GO TO STR-FAIL-GF-30-4.
215500 STR-DELETE-GF-30-4.
215600     PERFORM DE-LETE.
215700     GO TO STR-WRITE-GF-30-4.
215800 STR-FAIL-GF-30-4.
215900     MOVE    WRK-XN-00001-2 TO COMPUTED-X
216000     MOVE   "B"    TO CORRECT-X
216100     MOVE   "NOT ON OVERFLOW SHOULD HAVE EXECUTED"
216200          TO RE-MARK
216300     PERFORM FAIL.
216400 STR-WRITE-GF-30-4.
216500     PERFORM PRINT-DETAIL.
216600*
216700 STR-TEST-GF-30-5.
216800     ADD     1 TO REC-CT.
216900     IF      WRK-XN-00001-3 = "Z"
217000             PERFORM PASS
217100             GO TO STR-WRITE-GF-30-5
217200     ELSE
217300             GO TO STR-FAIL-GF-30-5.
217400 STR-DELETE-GF-30-5.
217500     PERFORM DE-LETE.
217600     GO TO STR-WRITE-GF-30-5.
217700 STR-FAIL-GF-30-5.
217800     MOVE    WRK-XN-00001-3 TO COMPUTED-X
217900     MOVE   "Z" TO CORRECT-X
218000     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
218100     PERFORM FAIL.
218200 STR-WRITE-GF-30-5.
218300     PERFORM PRINT-DETAIL.
218400*
218500 CCVS-EXIT SECTION.
218600 CCVS-999999.
218700     GO TO CLOSE-FILES.
