000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC215A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*                                                              *
002300*    PROGRAM NC215A TESTS THE LITERAL PHRASE OF THE "ALPHABET" *
002400*    CLAUSE OF THE "SPECIAL-NAMES" PARAGRAPH AND THE           *
002500*    "PROGRAM COLLATING SEQUENCE" OF THE "OBJECT COMPUTER      *
002600*    PARAGRAPH.                                                *
002700*                                                              *
002800****************************************************************
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.
003200     XXXXX082.
003300 OBJECT-COMPUTER.
003400     XXXXX083
003500     PROGRAM COLLATING SEQUENCE IS THE-WILD-ONE.
003600 SPECIAL-NAMES.
003700     ALPHABET
003800     THE-WILD-ONE IS "A" THRU "H" "I" ALSO "J", ALSO "K", ALSO
003900     "L" ALSO "M" ALSO "N" "O" THROUGH "Z" "0" THRU "9",
004000*
004100*
004200*ALPHABET-TEST-10     *****     THE WHOLE ALPHABET IS ONE LITERAL
004300*    WITH ALL 51 CHARACTERS IN THE COBOL CHARACTER SET.  TEST-10
004400*    IS ONLY A SYNTAX CHECK ON
004500*            ALPHABET-NAME IS LITERAL.
004600*
004700*
004800     ALPHABET
004900     THE-BIG-OL-LITERAL-ALPHABET IS "A+0B-1C*2D/3E=4Fl5G,6H;7I.8J"
005000-    ""9K(L)M>N<O PQRSTUVWXYZ".
005100*
005200*
005300 INPUT-OUTPUT SECTION.
005400 FILE-CONTROL.
005500     SELECT PRINT-FILE ASSIGN TO
005600     XXXXX055.
005700 DATA DIVISION.
005800 FILE SECTION.
005900 FD  PRINT-FILE.
006000 01  PRINT-REC PICTURE X(120).
006100 01  DUMMY-RECORD PICTURE X(120).
006200 WORKING-STORAGE SECTION.
006300 01  A-AN-1 PIC A VALUE "A".
006400 01  B-AN-1 PIC A VALUE "B".
006500 01  H-AN-1 PIC A VALUE "H".
006600 01  I-AN-1 PIC A VALUE "I".
006700 01  J-AN-1 PIC A VALUE "J".
006800 01  K-AN-1 PIC A VALUE "K".
006900 01  L-AN-1 PIC A VALUE "L".
007000 01  M-AN-1 PIC A VALUE "M".
007100 01  N-AN-1 PIC A VALUE "N".
007200 01  O-AN-1 PIC A VALUE "O".
007300 01  ZERO-DU-9V0-1 PIC 9 VALUE ZERO.
007400 01  NINE-DU-9V0-1 PIC 9 VALUE 9.
007500 01  TEST-RESULTS.
007600     02 FILLER                   PIC X      VALUE SPACE.
007700     02 FEATURE                  PIC X(20)  VALUE SPACE.
007800     02 FILLER                   PIC X      VALUE SPACE.
007900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
008000     02 FILLER                   PIC X      VALUE SPACE.
008100     02  PAR-NAME.
008200       03 FILLER                 PIC X(19)  VALUE SPACE.
008300       03  PARDOT-X              PIC X      VALUE SPACE.
008400       03 DOTVALUE               PIC 99     VALUE ZERO.
008500     02 FILLER                   PIC X(8)   VALUE SPACE.
008600     02 RE-MARK                  PIC X(61).
008700 01  TEST-COMPUTED.
008800     02 FILLER                   PIC X(30)  VALUE SPACE.
008900     02 FILLER                   PIC X(17)  VALUE
009000            "       COMPUTED=".
009100     02 COMPUTED-X.
009200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009300     03 COMPUTED-N               REDEFINES COMPUTED-A
009400                                 PIC -9(9).9(9).
009500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
009600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
009700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
009800     03       CM-18V0 REDEFINES COMPUTED-A.
009900         04 COMPUTED-18V0                    PIC -9(18).
010000         04 FILLER                           PIC X.
010100     03 FILLER PIC X(50) VALUE SPACE.
010200 01  TEST-CORRECT.
010300     02 FILLER PIC X(30) VALUE SPACE.
010400     02 FILLER PIC X(17) VALUE "       CORRECT =".
010500     02 CORRECT-X.
010600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
010700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
010800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
010900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
011000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
011100     03      CR-18V0 REDEFINES CORRECT-A.
011200         04 CORRECT-18V0                     PIC -9(18).
011300         04 FILLER                           PIC X.
011400     03 FILLER PIC X(2) VALUE SPACE.
011500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011600 01  CCVS-C-1.
011700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011800-    "SS  PARAGRAPH-NAME
011900-    "       REMARKS".
012000     02 FILLER                     PIC X(20)    VALUE SPACE.
012100 01  CCVS-C-2.
012200     02 FILLER                     PIC X        VALUE SPACE.
012300     02 FILLER                     PIC X(6)     VALUE "TESTED".
012400     02 FILLER                     PIC X(15)    VALUE SPACE.
012500     02 FILLER                     PIC X(4)     VALUE "FAIL".
012600     02 FILLER                     PIC X(94)    VALUE SPACE.
012700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012800 01  REC-CT                        PIC 99       VALUE ZERO.
012900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
013000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013800 01  CCVS-H-1.
013900     02  FILLER                    PIC X(39)    VALUE SPACES.
014000     02  FILLER                    PIC X(42)    VALUE
014100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014200     02  FILLER                    PIC X(39)    VALUE SPACES.
014300 01  CCVS-H-2A.
014400   02  FILLER                        PIC X(40)  VALUE SPACE.
014500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014600   02  FILLER                        PIC XXXX   VALUE
014700     "4.2 ".
014800   02  FILLER                        PIC X(28)  VALUE
014900            " COPY - NOT FOR DISTRIBUTION".
015000   02  FILLER                        PIC X(41)  VALUE SPACE.
015100
015200 01  CCVS-H-2B.
015300   02  FILLER                        PIC X(15)  VALUE
015400            "TEST RESULT OF ".
015500   02  TEST-ID                       PIC X(9).
015600   02  FILLER                        PIC X(4)   VALUE
015700            " IN ".
015800   02  FILLER                        PIC X(12)  VALUE
015900     " HIGH       ".
016000   02  FILLER                        PIC X(22)  VALUE
016100            " LEVEL VALIDATION FOR ".
016200   02  FILLER                        PIC X(58)  VALUE
016300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016400 01  CCVS-H-3.
016500     02  FILLER                      PIC X(34)  VALUE
016600            " FOR OFFICIAL USE ONLY    ".
016700     02  FILLER                      PIC X(58)  VALUE
016800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016900     02  FILLER                      PIC X(28)  VALUE
017000            "  COPYRIGHT   1985 ".
017100 01  CCVS-E-1.
017200     02 FILLER                       PIC X(52)  VALUE SPACE.
017300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017400     02 ID-AGAIN                     PIC X(9).
017500     02 FILLER                       PIC X(45)  VALUE SPACES.
017600 01  CCVS-E-2.
017700     02  FILLER                      PIC X(31)  VALUE SPACE.
017800     02  FILLER                      PIC X(21)  VALUE SPACE.
017900     02 CCVS-E-2-2.
018000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018100         03 FILLER                   PIC X      VALUE SPACE.
018200         03 ENDER-DESC               PIC X(44)  VALUE
018300            "ERRORS ENCOUNTERED".
018400 01  CCVS-E-3.
018500     02  FILLER                      PIC X(22)  VALUE
018600            " FOR OFFICIAL USE ONLY".
018700     02  FILLER                      PIC X(12)  VALUE SPACE.
018800     02  FILLER                      PIC X(58)  VALUE
018900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019000     02  FILLER                      PIC X(13)  VALUE SPACE.
019100     02 FILLER                       PIC X(15)  VALUE
019200             " COPYRIGHT 1985".
019300 01  CCVS-E-4.
019400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019500     02 FILLER                       PIC X(4)   VALUE " OF ".
019600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019700     02 FILLER                       PIC X(40)  VALUE
019800      "  TESTS WERE EXECUTED SUCCESSFULLY".
019900 01  XXINFO.
020000     02 FILLER                       PIC X(19)  VALUE
020100            "*** INFORMATION ***".
020200     02 INFO-TEXT.
020300       04 FILLER                     PIC X(8)   VALUE SPACE.
020400       04 XXCOMPUTED                 PIC X(20).
020500       04 FILLER                     PIC X(5)   VALUE SPACE.
020600       04 XXCORRECT                  PIC X(20).
020700     02 INF-ANSI-REFERENCE           PIC X(48).
020800 01  HYPHEN-LINE.
020900     02 FILLER  PIC IS X VALUE IS SPACE.
021000     02 FILLER  PIC IS X(65)    VALUE IS "************************
021100-    "*****************************************".
021200     02 FILLER  PIC IS X(54)    VALUE IS "************************
021300-    "******************************".
021400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021500     "NC215A".
021600 PROCEDURE DIVISION.
021700 CCVS1 SECTION.
021800 OPEN-FILES.
021900     OPEN     OUTPUT PRINT-FILE.
022000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022100     MOVE    SPACE TO TEST-RESULTS.
022200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022300     GO TO CCVS1-EXIT.
022400 CLOSE-FILES.
022500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022600 TERMINATE-CCVS.
022700S    EXIT PROGRAM.
022800STERMINATE-CALL.
022900     STOP     RUN.
023000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023400     MOVE "****TEST DELETED****" TO RE-MARK.
023500 PRINT-DETAIL.
023600     IF REC-CT NOT EQUAL TO ZERO
023700             MOVE "." TO PARDOT-X
023800             MOVE REC-CT TO DOTVALUE.
023900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
024000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024400     MOVE SPACE TO CORRECT-X.
024500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024600     MOVE     SPACE TO RE-MARK.
024700 HEAD-ROUTINE.
024800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025200 COLUMN-NAMES-ROUTINE.
025300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025600 END-ROUTINE.
025700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025800 END-RTN-EXIT.
025900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026000 END-ROUTINE-1.
026100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026300      ADD PASS-COUNTER TO ERROR-HOLD.
026400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
026500      MOVE PASS-COUNTER TO CCVS-E-4-1.
026600      MOVE ERROR-HOLD TO CCVS-E-4-2.
026700      MOVE CCVS-E-4 TO CCVS-E-2-2.
026800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026900  END-ROUTINE-12.
027000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027100     IF       ERROR-COUNTER IS EQUAL TO ZERO
027200         MOVE "NO " TO ERROR-TOTAL
027300         ELSE
027400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027600     PERFORM WRITE-LINE.
027700 END-ROUTINE-13.
027800     IF DELETE-COUNTER IS EQUAL TO ZERO
027900         MOVE "NO " TO ERROR-TOTAL  ELSE
028000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028300      IF   INSPECT-COUNTER EQUAL TO ZERO
028400          MOVE "NO " TO ERROR-TOTAL
028500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028900 WRITE-LINE.
029000     ADD 1 TO RECORD-COUNT.
029100Y    IF RECORD-COUNT GREATER 50
029200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029300Y        MOVE SPACE TO DUMMY-RECORD
029400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029500Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
029600Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
029700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029900Y        MOVE ZERO TO RECORD-COUNT.
030000     PERFORM WRT-LN.
030100 WRT-LN.
030200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030300     MOVE SPACE TO DUMMY-RECORD.
030400 BLANK-LINE-PRINT.
030500     PERFORM WRT-LN.
030600 FAIL-ROUTINE.
030700     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031200     MOVE   SPACES TO INF-ANSI-REFERENCE.
031300     GO TO  FAIL-ROUTINE-EX.
031400 FAIL-ROUTINE-WRITE.
031500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
031600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
031700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
031800     MOVE   SPACES TO COR-ANSI-REFERENCE.
031900 FAIL-ROUTINE-EX. EXIT.
032000 BAIL-OUT.
032100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032300 BAIL-OUT-WRITE.
032400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
032500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032700     MOVE   SPACES TO INF-ANSI-REFERENCE.
032800 BAIL-OUT-EX. EXIT.
032900 CCVS1-EXIT.
033000     EXIT.
033100 SECT-NC215A-001 SECTION.
033200 SEQ-INIT-GF-1.
033300     MOVE      "SEQ-TEST-GF-1" TO PAR-NAME.
033400     MOVE "VI-15 4.5.4 GR4(D)" TO ANSI-REFERENCE.
033500     MOVE      "A = LOW-VALUE" TO FEATURE.
033600     MOVE                  "A" TO A-AN-1.
033700 SEQ-TEST-GF-1.
033800     IF      A-AN-1 EQUAL TO LOW-VALUE PERFORM PASS
033900         ELSE
034000         GO TO SEQ-FAIL-GF-1.
034100     GO TO SEQ-WRITE-GF-1.
034200 SEQ-DELETE-GF-1.
034300     PERFORM DE-LETE.
034400     GO TO SEQ-WRITE-GF-1.
034500 SEQ-FAIL-GF-1.
034600     MOVE "A NOT = LOW-VALUE" TO COMPUTED-A.
034700     PERFORM FAIL.
034800 SEQ-WRITE-GF-1.
034900     PERFORM PRINT-DETAIL.
035000*
035100 SEQ-INIT-GF-2.
035200     MOVE      "SEQ-TEST-GF-2" TO PAR-NAME.
035300     MOVE "VI-15 4.5.4 GR4(D)" TO ANSI-REFERENCE.
035400     MOVE   "H I J B SEQUENCE" TO FEATURE.
035500     MOVE                  "H" TO H-AN-1.
035600     MOVE                  "I" TO I-AN-1.
035700     MOVE                  "J" TO J-AN-1.
035800     MOVE                  "B" TO B-AN-1.
035900 SEQ-TEST-GF-2.
036000     IF H-AN-1 < I-AN-1 AND J-AN-1 > B-AN-1 PERFORM PASS
036100         ELSE
036200         GO TO SEQ-FAIL-GF-2.
036300     GO TO SEQ-WRITE-GF-2.
036400 SEQ-DELETE-GF-2.
036500     PERFORM DE-LETE.
036600     GO TO SEQ-WRITE-GF-2.
036700 SEQ-FAIL-GF-2.
036800     MOVE "H I J B NOT SEQUENCED" TO COMPUTED-A.
036900     PERFORM FAIL.
037000 SEQ-WRITE-GF-2.
037100     PERFORM PRINT-DETAIL.
037200*
037300 SEQ-INIT-GF-3.
037400     MOVE      "SEQ-TEST-GF-3" TO PAR-NAME.
037500     MOVE "VI-15 4.5.4 GR4(D)" TO ANSI-REFERENCE.
037600     MOVE  "I J K L M N EQUAL" TO FEATURE.
037700     MOVE                  "I" TO I-AN-1.
037800     MOVE                  "J" TO J-AN-1.
037900     MOVE                  "K" TO K-AN-1.
038000     MOVE                  "L" TO L-AN-1.
038100     MOVE                  "M" TO M-AN-1.
038200     MOVE                  "N" TO N-AN-1.
038300 SEQ-TEST-GF-3.
038400     IF I-AN-1 = J-AN-1 AND K-AN-1 AND L-AN-1 AND M-AN-1
038500         AND N-AN-1 PERFORM PASS
038600     ELSE
038700         GO TO SEQ-FAIL-GF-3.
038800     GO TO SEQ-WRITE-GF-3.
038900 SEQ-DELETE-GF-3.
039000     PERFORM DE-LETE.
039100     GO TO SEQ-WRITE-GF-3.
039200 SEQ-FAIL-GF-3.
039300     MOVE    "I J K L M N NOT =" TO COMPUTED-A.
039400     PERFORM FAIL.
039500 SEQ-WRITE-GF-3.
039600     PERFORM PRINT-DETAIL.
039700*
039800 SEQ-INIT-GF-4.
039900     MOVE      "SEQ-TEST-GF-4" TO PAR-NAME.
040000     MOVE "VI-15 4.5.4 GR4(D)" TO ANSI-REFERENCE.
040100     MOVE         "O > THAN N" TO FEATURE.
040200     MOVE                  "O" TO O-AN-1.
040300     MOVE                  "N" TO N-AN-1.
040400 SEQ-TEST-GF-4.
040500     IF O-AN-1 > N-AN-1 PERFORM PASS
040600         ELSE
040700         GO TO SEQ-FAIL-GF-4.
040800     GO TO SEQ-WRITE-GF-4.
040900 SEQ-DELETE-GF-4.
041000     PERFORM DE-LETE.
041100     GO TO SEQ-WRITE-GF-4.
041200 SEQ-FAIL-GF-4.
041300     MOVE "O NOT > THAN N" TO COMPUTED-A.
041400     PERFORM FAIL.
041500 SEQ-WRITE-GF-4.
041600     PERFORM PRINT-DETAIL.
041700*
041800 SEQ-INIT-GF-5.
041900     MOVE      "SEQ-TEST-GF-5" TO PAR-NAME.
042000     MOVE "VI-15 4.5.4 GR4(D)" TO ANSI-REFERENCE.
042100     MOVE      "A < THAN ZERO" TO FEATURE.
042200     MOVE                  "A" TO A-AN-1.
042300     MOVE                 ZERO TO ZERO-DU-9V0-1.
042400 SEQ-TEST-GF-5.
042500     IF A-AN-1 < ZERO-DU-9V0-1 PERFORM PASS
042600         ELSE
042700         GO TO SEQ-FAIL-GF-5.
042800     GO      TO SEQ-WRITE-GF-5.
042900 SEQ-DELETE-GF-5.
043000     PERFORM DE-LETE.
043100     GO TO SEQ-WRITE-GF-5.
043200 SEQ-FAIL-GF-5.
043300     MOVE "A FOUND > THAN ZERO" TO COMPUTED-A.
043400     PERFORM FAIL.
043500 SEQ-WRITE-GF-5.
043600     PERFORM PRINT-DETAIL.
043700*
043800 SEQ-INIT-GF-6.
043900     MOVE      "SEQ-TEST-GF-6" TO PAR-NAME.
044000     MOVE "VI-15 4.5.4 GR4(D)" TO ANSI-REFERENCE.
044100     MOVE  "NINE < THAN SPACE" TO FEATURE.
044200     MOVE                    9 TO NINE-DU-9V0-1.
044300 SEQ-TEST-GF-6.
044400     IF NINE-DU-9V0-1 < SPACE PERFORM PASS
044500         ELSE
044600         GO TO SEQ-FAIL-GF-6.
044700     GO TO SEQ-WRITE-GF-6.
044800 SEQ-DELETE-GF-6.
044900     PERFORM DE-LETE.
045000     GO TO SEQ-WRITE-GF-6.
045100 SEQ-FAIL-GF-6.
045200     MOVE "9 FOUND > THAN SPACE" TO COMPUTED-A.
045300     PERFORM FAIL.
045400 SEQ-WRITE-GF-6.
045500     PERFORM PRINT-DETAIL.
045600*
045700 SEQ-INIT-GF-7.
045800     MOVE      "SEQ-TEST-GF-7" TO PAR-NAME.
045900     MOVE "VI-15 4.5.4 GR4(D)" TO ANSI-REFERENCE.
046000     MOVE  "NINE < THAN QUOTE" TO FEATURE.
046100     MOVE                    9 TO NINE-DU-9V0-1.
046200 SEQ-TEST-GF-7.
046300     IF NINE-DU-9V0-1 < QUOTE PERFORM PASS
046400         ELSE
046500         GO TO SEQ-FAIL-GF-7.
046600     GO TO SEQ-WRITE-GF-7.
046700 SEQ-DELETE-GF-7.
046800     PERFORM DE-LETE.
046900     GO TO SEQ-WRITE-GF-7.
047000 SEQ-FAIL-GF-7.
047100     MOVE "NINE FOUND >  QUOTE" TO COMPUTED-A.
047200     PERFORM FAIL.
047300 SEQ-WRITE-GF-7.
047400     PERFORM PRINT-DETAIL.
047500*
047600 ALPHABET-TEST-10.
047700     PERFORM END-ROUTINE.
047800     MOVE    " ALPHABET-NAME     *****     CHECK THE ALPHABET-NAME
047900-    " IN THE SPECIAL-NAMES PARAGRAPH" TO TEST-RESULTS.
048000     PERFORM PRINT-DETAIL.
048100 CCVS-EXIT SECTION.
048200 CCVS-999999.
048300     GO TO CLOSE-FILES.
