000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC210A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*    PROGRAM NC210A TESTS NESTED "IF" STATEMENTS, USING 63     *
001500*    STATEMENTS AND 6 LEVELS OF NESTING IN ONE SENTENCE AND    *
001600*    22 LEVELS OF NESTING IN A SECOND TEST.                    *
001700*                                                              *
001800*     X-CARDS USED ARE :-                                      *
001900*                                                              *
002000*      X-55  - SYSTEM PRINTER NAME.                            *
002100*      X-82  - SOURCE COMPUTER NAME.                           *
002200*      X-83  - OBJECT COMPUTER NAME.                           *
002300*                                                              *
002400****************************************************************
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.
002800     XXXXX082.
002900 OBJECT-COMPUTER.
003000     XXXXX083.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300     SELECT PRINT-FILE ASSIGN TO
003400     XXXXX055.
003500 DATA DIVISION.
003600 FILE SECTION.
003700 FD  PRINT-FILE.
003800 01  PRINT-REC PICTURE X(120).
003900 01  DUMMY-RECORD PICTURE X(120).
004000 WORKING-STORAGE SECTION.
004100 77  ACCUM-DATANAME PIC 99  VALUE ZERO.
004200 77  DATANAME-A  PIC 9 VALUE 0.
004300 77  DATANAME-B  PIC 9 VALUE 0.
004400 77  DATANAME-C  PIC 9 VALUE 0.
004500 77  DATANAME-D  PIC 9 VALUE 0.
004600 77  DATANAME-E  PIC 9 VALUE 0.
004700 77  DATANAME-F  PIC 9 VALUE 0.
004800 77  SUB-SCRIPT     PIC 99  VALUE 01.
004900 01  DATA-NAMES.
005000     02  ONE-A PIC 9 VALUE 0.
005100     02  ONE-B PIC 9 VALUE 0.
005200     02  ONE-C PIC 9 VALUE 0.
005300     02  ONE-D PIC 9 VALUE 0.
005400     02  ONE-E PIC 9 VALUE 0.
005500     02  ONE-F PIC 9 VALUE 0.
005600 01  ONE-X REDEFINES DATA-NAMES  PIC 9(6).
005700 01  BUILT-TABLE.
005800     02  A-POS                   PIC XX.
005900     02  B-POS                   PIC XX.
006000     02  C-POS                   PIC XX.
006100     02  D-POS                   PIC XXX.
006200     02  E-POS                   PIC XXX.
006300     02  F-POS                   PIC XXX.
006400 01  PARAGRAPH-NAME.
006500     02  FILLER                  PIC X(11) VALUE "IF-TEST-GF-".
006600     02  PAR-NUMBER              PIC 99  VALUE 00.
006700 01  COMPARISON-TABLE.
006800     02  FILLER PIC X(15) VALUE "A1B1C1D01E01F01".
006900     02  FILLER PIC X(15) VALUE "A1B1C1D01E01F02".
007000     02  FILLER PIC X(15) VALUE "A1B1C1D01E02F03".
007100     02  FILLER PIC X(15) VALUE "A1B1C1D01E02F04".
007200     02  FILLER PIC X(15) VALUE "A1B1C1D02E03F05".
007300     02  FILLER PIC X(15) VALUE "A1B1C1D02E03F06".
007400     02  FILLER PIC X(15) VALUE "A1B1C1D02E04F07".
007500     02  FILLER PIC X(15) VALUE "A1B1C1D02E04F08".
007600     02  FILLER PIC X(15) VALUE "A1B1C2D03E05F09".
007700     02  FILLER PIC X(15) VALUE "A1B1C2D03E05F10".
007800     02  FILLER PIC X(15) VALUE "A1B1C2D03E06F11".
007900     02  FILLER PIC X(15) VALUE "A1B1C2D03E06F12".
008000     02  FILLER PIC X(15) VALUE "A1B1C2D04E07F13".
008100     02  FILLER PIC X(15) VALUE "A1B1C2D04E07F14".
008200     02  FILLER PIC X(15) VALUE "A1B1C2D04E08F15".
008300     02  FILLER PIC X(15) VALUE "A1B1C2D04E08F16".
008400     02  FILLER PIC X(15) VALUE "A1B2C3D05E09F17".
008500     02  FILLER PIC X(15) VALUE "A1B2C3D05E09F18".
008600     02  FILLER PIC X(15) VALUE "A1B2C3D05E10F19".
008700     02  FILLER PIC X(15) VALUE "A1B2C3D05E10F20".
008800     02  FILLER PIC X(15) VALUE "A1B2C3D06E11F21".
008900     02  FILLER PIC X(15) VALUE "A1B2C3D06E11F22".
009000     02  FILLER PIC X(15) VALUE "A1B2C3D06E12F23".
009100     02  FILLER PIC X(15) VALUE "A1B2C3D06E12F24".
009200     02  FILLER PIC X(15) VALUE "A1B2C4D07E13F25".
009300     02  FILLER PIC X(15) VALUE "A1B2C4D07E13F26".
009400     02  FILLER PIC X(15) VALUE "A1B2C4D07E14F27".
009500     02  FILLER PIC X(15) VALUE "A1B2C4D07E14F28".
009600     02  FILLER PIC X(15) VALUE "A1B2C4D08E15F29".
009700     02  FILLER PIC X(15) VALUE "A1B2C4D08E15F30".
009800     02  FILLER PIC X(15) VALUE "A1B2C4D08E16F31".
009900     02  FILLER PIC X(15) VALUE "A1B2C4D08E16F32".
010000     02  FILLER PIC X(15) VALUE "A2B3C5D09E17F33".
010100     02  FILLER PIC X(15) VALUE "A2B3C5D09E17F34".
010200     02  FILLER PIC X(15) VALUE "A2B3C5D09E18F35".
010300     02  FILLER PIC X(15) VALUE "A2B3C5D09E18F36".
010400     02  FILLER PIC X(15) VALUE "A2B3C5D10E19F37".
010500     02  FILLER PIC X(15) VALUE "A2B3C5D10E19F38".
010600     02  FILLER PIC X(15) VALUE "A2B3C5D10E20F39".
010700     02  FILLER PIC X(15) VALUE "A2B3C5D10E20F40".
010800     02  FILLER PIC X(15) VALUE "A2B3C6D11E21F41".
010900     02  FILLER PIC X(15) VALUE "A2B3C6D11E21F42".
011000     02  FILLER PIC X(15) VALUE "A2B3C6D11E22F43".
011100     02  FILLER PIC X(15) VALUE "A2B3C6D11E22F44".
011200     02  FILLER PIC X(15) VALUE "A2B3C6D12E23F45".
011300     02  FILLER PIC X(15) VALUE "A2B3C6D12E23F46".
011400     02  FILLER PIC X(15) VALUE "A2B3C6D12E24F47".
011500     02  FILLER PIC X(15) VALUE "A2B3C6D12E24F48".
011600     02  FILLER PIC X(15) VALUE "A2B4C7D13E25F49".
011700     02  FILLER PIC X(15) VALUE "A2B4C7D13E25F50".
011800     02  FILLER PIC X(15) VALUE "A2B4C7D13E26F51".
011900     02  FILLER PIC X(15) VALUE "A2B4C7D13E26F52".
012000     02  FILLER PIC X(15) VALUE "A2B4C7D14E27F53".
012100     02  FILLER PIC X(15) VALUE "A2B4C7D14E27F54".
012200     02  FILLER PIC X(15) VALUE "A2B4C7D14E28F55".
012300     02  FILLER PIC X(15) VALUE "A2B4C7D14E28F56".
012400     02  FILLER PIC X(15) VALUE "A2B4C8D15E29F57".
012500     02  FILLER PIC X(15) VALUE "A2B4C8D15E29F58".
012600     02  FILLER PIC X(15) VALUE "A2B4C8D15E30F59".
012700     02  FILLER PIC X(15) VALUE "A2B4C8D15E30F60".
012800     02  FILLER PIC X(15) VALUE "A2B4C8D16E31F61".
012900     02  FILLER PIC X(15) VALUE "A2B4C8D16E31F62".
013000     02  FILLER PIC X(15) VALUE "A2B4C8D16E32F63".
013100     02  FILLER PIC X(15) VALUE "A2B4C8D16E32F64".
013200 01  COMP-TBL REDEFINES COMPARISON-TABLE.
013300     02  CORRECT-ENTRY OCCURS 64 TIMES PIC X(15).
013400 01  T-F  PIC X(5) VALUE "FALSE".
013500 01  CHECK-PARA.
013600     02  FILLER  PIC X(21) VALUE "VALUE OF DATANAME AT ".
013700     02  CHECK-VALU  PIC 99.
013800     02  FILLER  PIC X(4) VALUE SPACES.
013900 01  TEST-RESULTS.
014000     02 FILLER                   PIC X      VALUE SPACE.
014100     02 FEATURE                  PIC X(20)  VALUE SPACE.
014200     02 FILLER                   PIC X      VALUE SPACE.
014300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
014400     02 FILLER                   PIC X      VALUE SPACE.
014500     02  PAR-NAME.
014600       03 FILLER                 PIC X(19)  VALUE SPACE.
014700       03  PARDOT-X              PIC X      VALUE SPACE.
014800       03 DOTVALUE               PIC 99     VALUE ZERO.
014900     02 FILLER                   PIC X(8)   VALUE SPACE.
015000     02 RE-MARK                  PIC X(61).
015100 01  TEST-COMPUTED.
015200     02 FILLER                   PIC X(30)  VALUE SPACE.
015300     02 FILLER                   PIC X(17)  VALUE
015400            "       COMPUTED=".
015500     02 COMPUTED-X.
015600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
015700     03 COMPUTED-N               REDEFINES COMPUTED-A
015800                                 PIC -9(9).9(9).
015900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
016000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
016100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
016200     03       CM-18V0 REDEFINES COMPUTED-A.
016300         04 COMPUTED-18V0                    PIC -9(18).
016400         04 FILLER                           PIC X.
016500     03 FILLER PIC X(50) VALUE SPACE.
016600 01  TEST-CORRECT.
016700     02 FILLER PIC X(30) VALUE SPACE.
016800     02 FILLER PIC X(17) VALUE "       CORRECT =".
016900     02 CORRECT-X.
017000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
017100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
017200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
017300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
017400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
017500     03      CR-18V0 REDEFINES CORRECT-A.
017600         04 CORRECT-18V0                     PIC -9(18).
017700         04 FILLER                           PIC X.
017800     03 FILLER PIC X(2) VALUE SPACE.
017900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
018000 01  CCVS-C-1.
018100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
018200-    "SS  PARAGRAPH-NAME
018300-    "       REMARKS".
018400     02 FILLER                     PIC X(20)    VALUE SPACE.
018500 01  CCVS-C-2.
018600     02 FILLER                     PIC X        VALUE SPACE.
018700     02 FILLER                     PIC X(6)     VALUE "TESTED".
018800     02 FILLER                     PIC X(15)    VALUE SPACE.
018900     02 FILLER                     PIC X(4)     VALUE "FAIL".
019000     02 FILLER                     PIC X(94)    VALUE SPACE.
019100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
019200 01  REC-CT                        PIC 99       VALUE ZERO.
019300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
019400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
019500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
019600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
019700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
019800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
019900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
020000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
020100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
020200 01  CCVS-H-1.
020300     02  FILLER                    PIC X(39)    VALUE SPACES.
020400     02  FILLER                    PIC X(42)    VALUE
020500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
020600     02  FILLER                    PIC X(39)    VALUE SPACES.
020700 01  CCVS-H-2A.
020800   02  FILLER                        PIC X(40)  VALUE SPACE.
020900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
021000   02  FILLER                        PIC XXXX   VALUE
021100     "4.2 ".
021200   02  FILLER                        PIC X(28)  VALUE
021300            " COPY - NOT FOR DISTRIBUTION".
021400   02  FILLER                        PIC X(41)  VALUE SPACE.
021500
021600 01  CCVS-H-2B.
021700   02  FILLER                        PIC X(15)  VALUE
021800            "TEST RESULT OF ".
021900   02  TEST-ID                       PIC X(9).
022000   02  FILLER                        PIC X(4)   VALUE
022100            " IN ".
022200   02  FILLER                        PIC X(12)  VALUE
022300     " HIGH       ".
022400   02  FILLER                        PIC X(22)  VALUE
022500            " LEVEL VALIDATION FOR ".
022600   02  FILLER                        PIC X(58)  VALUE
022700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
022800 01  CCVS-H-3.
022900     02  FILLER                      PIC X(34)  VALUE
023000            " FOR OFFICIAL USE ONLY    ".
023100     02  FILLER                      PIC X(58)  VALUE
023200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
023300     02  FILLER                      PIC X(28)  VALUE
023400            "  COPYRIGHT   1985 ".
023500 01  CCVS-E-1.
023600     02 FILLER                       PIC X(52)  VALUE SPACE.
023700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
023800     02 ID-AGAIN                     PIC X(9).
023900     02 FILLER                       PIC X(45)  VALUE SPACES.
024000 01  CCVS-E-2.
024100     02  FILLER                      PIC X(31)  VALUE SPACE.
024200     02  FILLER                      PIC X(21)  VALUE SPACE.
024300     02 CCVS-E-2-2.
024400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
024500         03 FILLER                   PIC X      VALUE SPACE.
024600         03 ENDER-DESC               PIC X(44)  VALUE
024700            "ERRORS ENCOUNTERED".
024800 01  CCVS-E-3.
024900     02  FILLER                      PIC X(22)  VALUE
025000            " FOR OFFICIAL USE ONLY".
025100     02  FILLER                      PIC X(12)  VALUE SPACE.
025200     02  FILLER                      PIC X(58)  VALUE
025300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025400     02  FILLER                      PIC X(13)  VALUE SPACE.
025500     02 FILLER                       PIC X(15)  VALUE
025600             " COPYRIGHT 1985".
025700 01  CCVS-E-4.
025800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
025900     02 FILLER                       PIC X(4)   VALUE " OF ".
026000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
026100     02 FILLER                       PIC X(40)  VALUE
026200      "  TESTS WERE EXECUTED SUCCESSFULLY".
026300 01  XXINFO.
026400     02 FILLER                       PIC X(19)  VALUE
026500            "*** INFORMATION ***".
026600     02 INFO-TEXT.
026700       04 FILLER                     PIC X(8)   VALUE SPACE.
026800       04 XXCOMPUTED                 PIC X(20).
026900       04 FILLER                     PIC X(5)   VALUE SPACE.
027000       04 XXCORRECT                  PIC X(20).
027100     02 INF-ANSI-REFERENCE           PIC X(48).
027200 01  HYPHEN-LINE.
027300     02 FILLER  PIC IS X VALUE IS SPACE.
027400     02 FILLER  PIC IS X(65)    VALUE IS "************************
027500-    "*****************************************".
027600     02 FILLER  PIC IS X(54)    VALUE IS "************************
027700-    "******************************".
027800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
027900     "NC210A".
028000 PROCEDURE DIVISION.
028100 CCVS1 SECTION.
028200 OPEN-FILES.
028300     OPEN     OUTPUT PRINT-FILE.
028400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
028500     MOVE    SPACE TO TEST-RESULTS.
028600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028700     GO TO CCVS1-EXIT.
028800 CLOSE-FILES.
028900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029000 TERMINATE-CCVS.
029100     STOP     RUN.
029200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029600     MOVE "****TEST DELETED****" TO RE-MARK.
029700 PRINT-DETAIL.
029800     IF REC-CT NOT EQUAL TO ZERO
029900             MOVE "." TO PARDOT-X
030000             MOVE REC-CT TO DOTVALUE.
030100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030600     MOVE SPACE TO CORRECT-X.
030700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030800     MOVE     SPACE TO RE-MARK.
030900 HEAD-ROUTINE.
031000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031400 COLUMN-NAMES-ROUTINE.
031500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031800 END-ROUTINE.
031900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
032000 END-RTN-EXIT.
032100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032200 END-ROUTINE-1.
032300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032500      ADD PASS-COUNTER TO ERROR-HOLD.
032600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032700      MOVE PASS-COUNTER TO CCVS-E-4-1.
032800      MOVE ERROR-HOLD TO CCVS-E-4-2.
032900      MOVE CCVS-E-4 TO CCVS-E-2-2.
033000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033100  END-ROUTINE-12.
033200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033300     IF       ERROR-COUNTER IS EQUAL TO ZERO
033400         MOVE "NO " TO ERROR-TOTAL
033500         ELSE
033600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033800     PERFORM WRITE-LINE.
033900 END-ROUTINE-13.
034000     IF DELETE-COUNTER IS EQUAL TO ZERO
034100         MOVE "NO " TO ERROR-TOTAL  ELSE
034200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034500      IF   INSPECT-COUNTER EQUAL TO ZERO
034600          MOVE "NO " TO ERROR-TOTAL
034700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035100 WRITE-LINE.
035200     ADD 1 TO RECORD-COUNT.
035300Y    IF RECORD-COUNT GREATER 50
035400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035500Y        MOVE SPACE TO DUMMY-RECORD
035600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035700Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
035800Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
035900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
036000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036100Y        MOVE ZERO TO RECORD-COUNT.
036200     PERFORM WRT-LN.
036300 WRT-LN.
036400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036500     MOVE SPACE TO DUMMY-RECORD.
036600 BLANK-LINE-PRINT.
036700     PERFORM WRT-LN.
036800 FAIL-ROUTINE.
036900     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037400     MOVE   SPACES TO INF-ANSI-REFERENCE.
037500     GO TO  FAIL-ROUTINE-EX.
037600 FAIL-ROUTINE-WRITE.
037700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
037900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038000     MOVE   SPACES TO COR-ANSI-REFERENCE.
038100 FAIL-ROUTINE-EX. EXIT.
038200 BAIL-OUT.
038300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038500 BAIL-OUT-WRITE.
038600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038900     MOVE   SPACES TO INF-ANSI-REFERENCE.
039000 BAIL-OUT-EX. EXIT.
039100 CCVS1-EXIT.
039200     EXIT.
039300 SECT-NC210A-001 SECTION.
039400 IF-INIT-GF-X.
039500     MOVE   "VI-89 6.15.4 GR1(C)" TO ANSI-REFERENCE.
039600 IF-TEST-GF-X.
039700     IF DATANAME-A EQUAL TO ONE-A
039800         MOVE "A1" TO A-POS
039900         IF DATANAME-B EQUAL TO ONE-B
040000             MOVE "B1" TO B-POS
040100             IF DATANAME-C EQUAL TO ONE-C
040200                 MOVE "C1" TO C-POS
040300                 IF DATANAME-D EQUAL TO ONE-D
040400                     MOVE "D01" TO D-POS
040500                     IF DATANAME-E EQUAL TO ONE-E
040600                         MOVE "E01" TO E-POS
040700                         IF DATANAME-F EQUAL TO ONE-F
040800                             MOVE "F01" TO F-POS
040900                           ELSE
041000                             MOVE "F02" TO F-POS
041100                       ELSE
041200                         MOVE "E02" TO E-POS
041300                         IF DATANAME-F EQUAL TO ONE-F
041400                             MOVE "F03" TO F-POS
041500                           ELSE
041600                             MOVE "F04" TO F-POS
041700                   ELSE
041800                     MOVE "D02" TO D-POS
041900                     IF DATANAME-E EQUAL TO ONE-E
042000                         MOVE "E03" TO E-POS
042100                         IF DATANAME-F EQUAL TO ONE-F
042200                             MOVE "F05" TO F-POS
042300                           ELSE
042400                             MOVE "F06" TO F-POS
042500                       ELSE
042600                         MOVE "E04" TO E-POS
042700                         IF DATANAME-F EQUAL TO ONE-F
042800                             MOVE "F07" TO F-POS
042900                           ELSE
043000                             MOVE "F08" TO F-POS
043100               ELSE
043200                 MOVE "C2" TO C-POS
043300                 IF DATANAME-D EQUAL TO ONE-D
043400                     MOVE "D03" TO D-POS
043500                     IF DATANAME-E EQUAL TO ONE-E
043600                         MOVE "E05" TO E-POS
043700                         IF DATANAME-F EQUAL TO ONE-F
043800                             MOVE "F09" TO F-POS
043900                           ELSE
044000                             MOVE "F10" TO F-POS
044100                       ELSE
044200                         MOVE "E06" TO E-POS
044300                         IF DATANAME-F EQUAL TO ONE-F
044400                             MOVE "F11" TO F-POS
044500                           ELSE
044600                             MOVE "F12" TO F-POS
044700                   ELSE
044800                     MOVE "D04" TO D-POS
044900                     IF DATANAME-E EQUAL TO ONE-E
045000                         MOVE "E07" TO E-POS
045100                         IF DATANAME-F EQUAL TO ONE-F
045200                             MOVE "F13" TO F-POS
045300                           ELSE
045400                             MOVE "F14" TO F-POS
045500                       ELSE
045600                         MOVE "E08" TO E-POS
045700                         IF DATANAME-F EQUAL TO ONE-F
045800                             MOVE "F15" TO F-POS
045900                           ELSE
046000                             MOVE "F16" TO F-POS
046100           ELSE
046200             MOVE "B2" TO B-POS
046300             IF DATANAME-C EQUAL TO ONE-C
046400                 MOVE "C3" TO C-POS
046500                 IF DATANAME-D EQUAL TO ONE-D
046600                     MOVE "D05" TO D-POS
046700                     IF DATANAME-E EQUAL TO ONE-E
046800                         MOVE "E09" TO E-POS
046900                         IF DATANAME-F EQUAL TO ONE-F
047000                             MOVE "F17" TO F-POS
047100                           ELSE
047200                             MOVE "F18" TO F-POS
047300                       ELSE
047400                         MOVE "E10" TO E-POS
047500                         IF DATANAME-F EQUAL TO ONE-F
047600                             MOVE "F19" TO F-POS
047700                           ELSE
047800                             MOVE "F20" TO F-POS
047900                   ELSE
048000                     MOVE "D06" TO D-POS
048100                     IF DATANAME-E EQUAL TO ONE-E
048200                         MOVE "E11" TO E-POS
048300                         IF DATANAME-F EQUAL TO ONE-F
048400                             MOVE "F21" TO F-POS
048500                           ELSE
048600                             MOVE "F22" TO F-POS
048700                       ELSE
048800                         MOVE "E12" TO E-POS
048900                         IF DATANAME-F EQUAL TO ONE-F
049000                             MOVE "F23" TO F-POS
049100                           ELSE
049200                             MOVE "F24" TO F-POS
049300               ELSE
049400                 MOVE "C4" TO C-POS
049500                 IF DATANAME-D EQUAL TO ONE-D
049600                     MOVE "D07" TO D-POS
049700                     IF DATANAME-E EQUAL TO ONE-E
049800                         MOVE "E13" TO E-POS
049900                         IF DATANAME-F EQUAL TO ONE-F
050000                             MOVE "F25" TO F-POS
050100                           ELSE
050200                             MOVE "F26" TO F-POS
050300                       ELSE
050400                         MOVE "E14" TO E-POS
050500                         IF DATANAME-F EQUAL TO ONE-F
050600                             MOVE "F27" TO F-POS
050700                           ELSE
050800                             MOVE "F28" TO F-POS
050900                   ELSE
051000                     MOVE "D08" TO D-POS
051100                     IF DATANAME-E EQUAL TO ONE-E
051200                         MOVE "E15" TO E-POS
051300                         IF DATANAME-F EQUAL TO ONE-F
051400                             MOVE "F29" TO F-POS
051500                           ELSE
051600                             MOVE "F30" TO F-POS
051700                       ELSE
051800                         MOVE "E16" TO E-POS
051900                         IF DATANAME-F EQUAL TO ONE-F
052000                             MOVE "F31" TO F-POS
052100                           ELSE
052200                             MOVE "F32" TO F-POS
052300       ELSE
052400         MOVE "A2" TO A-POS
052500         IF DATANAME-B EQUAL TO ONE-B
052600             MOVE "B3" TO B-POS
052700             IF DATANAME-C EQUAL TO ONE-C
052800                 MOVE "C5" TO C-POS
052900                 IF DATANAME-D EQUAL TO ONE-D
053000                     MOVE "D09" TO D-POS
053100                     IF DATANAME-E EQUAL TO ONE-E
053200                         MOVE "E17" TO E-POS
053300                         IF DATANAME-F EQUAL TO ONE-F
053400                             MOVE "F33" TO F-POS
053500                           ELSE
053600                             MOVE "F34" TO F-POS
053700                       ELSE
053800                         MOVE "E18" TO E-POS
053900                         IF DATANAME-F EQUAL TO ONE-F
054000                             MOVE "F35" TO F-POS
054100                           ELSE
054200                             MOVE "F36" TO F-POS
054300                   ELSE
054400                     MOVE "D10" TO D-POS
054500                     IF DATANAME-E EQUAL TO ONE-E
054600                         MOVE "E19" TO E-POS
054700                         IF DATANAME-F EQUAL TO ONE-F
054800                             MOVE "F37" TO F-POS
054900                           ELSE
055000                             MOVE "F38" TO F-POS
055100                       ELSE
055200                         MOVE "E20" TO E-POS
055300                         IF DATANAME-F EQUAL TO ONE-F
055400                             MOVE "F39" TO F-POS
055500                           ELSE
055600                             MOVE "F40" TO F-POS
055700               ELSE
055800                 MOVE "C6" TO C-POS
055900                 IF DATANAME-D EQUAL TO ONE-D
056000                     MOVE "D11" TO D-POS
056100                     IF DATANAME-E EQUAL TO ONE-E
056200                         MOVE "E21" TO E-POS
056300                         IF DATANAME-F EQUAL TO ONE-F
056400                             MOVE "F41" TO F-POS
056500                           ELSE
056600                             MOVE "F42" TO F-POS
056700                       ELSE
056800                         MOVE "E22" TO E-POS
056900                         IF DATANAME-F EQUAL TO ONE-F
057000                             MOVE "F43" TO F-POS
057100                           ELSE
057200                             MOVE "F44" TO F-POS
057300                   ELSE
057400                     MOVE "D12" TO D-POS
057500                     IF DATANAME-E EQUAL TO ONE-E
057600                         MOVE "E23" TO E-POS
057700                         IF DATANAME-F EQUAL TO ONE-F
057800                             MOVE "F45" TO F-POS
057900                           ELSE
058000                             MOVE "F46" TO F-POS
058100                       ELSE
058200                         MOVE "E24" TO E-POS
058300                         IF DATANAME-F EQUAL TO ONE-F
058400                             MOVE "F47" TO F-POS
058500                           ELSE
058600                             MOVE "F48" TO F-POS
058700           ELSE
058800             MOVE "B4" TO B-POS
058900             IF DATANAME-C EQUAL TO ONE-C
059000                 MOVE "C7" TO C-POS
059100                 IF DATANAME-D EQUAL TO ONE-D
059200                     MOVE "D13" TO D-POS
059300                     IF DATANAME-E EQUAL TO ONE-E
059400                         MOVE "E25" TO E-POS
059500                         IF DATANAME-F EQUAL TO ONE-F
059600                             MOVE "F49" TO F-POS
059700                           ELSE
059800                             MOVE "F50" TO F-POS
059900                       ELSE
060000                         MOVE "E26" TO E-POS
060100                         IF DATANAME-F EQUAL TO ONE-F
060200                             MOVE "F51" TO F-POS
060300                           ELSE
060400                             MOVE "F52" TO F-POS
060500                   ELSE
060600                     MOVE "D14" TO D-POS
060700                     IF DATANAME-E EQUAL TO ONE-E
060800                         MOVE "E27" TO E-POS
060900                         IF DATANAME-F EQUAL TO ONE-F
061000                             MOVE "F53" TO F-POS
061100                           ELSE
061200                             MOVE "F54" TO F-POS
061300                       ELSE
061400                         MOVE "E28" TO E-POS
061500                         IF DATANAME-F EQUAL TO ONE-F
061600                             MOVE "F55" TO F-POS
061700                           ELSE
061800                             MOVE "F56" TO F-POS
061900               ELSE
062000                 MOVE "C8" TO C-POS
062100                 IF DATANAME-D EQUAL TO ONE-D
062200                     MOVE "D15" TO D-POS
062300                     IF DATANAME-E EQUAL TO ONE-E
062400                         MOVE "E29" TO E-POS
062500                         IF DATANAME-F EQUAL TO ONE-F
062600                             MOVE "F57" TO F-POS
062700                           ELSE
062800                             MOVE "F58" TO F-POS
062900                       ELSE
063000                         MOVE "E30" TO E-POS
063100                         IF DATANAME-F EQUAL TO ONE-F
063200                             MOVE "F59" TO F-POS
063300                           ELSE
063400                             MOVE "F60" TO F-POS
063500                   ELSE
063600                     MOVE "D16" TO D-POS
063700                     IF DATANAME-E EQUAL TO ONE-E
063800                         MOVE "E31" TO E-POS
063900                         IF DATANAME-F EQUAL TO ONE-F
064000                             MOVE "F61" TO F-POS
064100                           ELSE
064200                             MOVE "F62" TO F-POS
064300                       ELSE
064400                         MOVE "E32" TO E-POS
064500                         IF DATANAME-F EQUAL TO ONE-F
064600                             MOVE "F63" TO F-POS
064700                           ELSE
064800                             MOVE "F64" TO F-POS.
064900     IF BUILT-TABLE EQUAL TO CORRECT-ENTRY (SUB-SCRIPT)
065000         PERFORM PASS
065100         GO TO IF-WRITE-GF-X.
065200     GO TO IF-FAIL-GF-X.
065300 IF-DELETE-GF-X.
065400     MOVE 63 TO PAR-NUMBER.
065500     PERFORM DE-LETE.
065600     ADD 63 TO DELETE-COUNTER.
065700     GO TO IF-WRITE-GF-X.
065800 IF-FAIL-GF-X.
065900     MOVE BUILT-TABLE TO COMPUTED-A.
066000     MOVE CORRECT-ENTRY (SUB-SCRIPT) TO CORRECT-A.
066100     PERFORM FAIL.
066200 IF-WRITE-GF-X.
066300     ADD 1 TO PAR-NUMBER.
066400     MOVE PARAGRAPH-NAME TO PAR-NAME.
066500     PERFORM PRINT-DETAIL.
066600     IF PAR-NUMBER EQUAL TO 64 GO TO IF-INIT-GF-Y.
066700     ADD 1 TO  SUB-SCRIPT.
066800     MOVE SPACES TO BUILT-TABLE.
066900     ADD 1 TO ONE-X.
067000     IF ONE-F EQUAL TO 2 ADD 8 TO ONE-X.
067100     IF ONE-E EQUAL TO 2 ADD 80 TO ONE-X.
067200     IF ONE-D EQUAL TO 2 ADD 800 TO ONE-X.
067300     IF ONE-C EQUAL TO 2 ADD 8000 TO ONE-X.
067400     IF ONE-B EQUAL TO 2 ADD 80000 TO ONE-X.
067500     GO TO IF-INIT-GF-X.
067600*
067700 IF-INIT-GF-Y.
067800     MOVE   "VI-89 6.15.4 GR1(C)" TO ANSI-REFERENCE.
067900     ADD 1 TO PAR-NUMBER.
068000     MOVE 22 TO ACCUM-DATANAME.
068100 IF-TEST-GF-Y.
068200     MOVE "FALSE" TO T-F.
068300     IF ACCUM-DATANAME NOT EQUAL TO 1
068400     IF ACCUM-DATANAME NOT EQUAL TO 2
068500     IF ACCUM-DATANAME NOT EQUAL TO 3
068600     IF ACCUM-DATANAME NOT EQUAL TO 4
068700     IF ACCUM-DATANAME NOT EQUAL TO 5
068800     IF ACCUM-DATANAME NOT EQUAL TO 6
068900     IF ACCUM-DATANAME NOT EQUAL TO 7
069000     IF ACCUM-DATANAME NOT EQUAL TO 8
069100     IF ACCUM-DATANAME NOT EQUAL TO 9
069200     IF ACCUM-DATANAME NOT EQUAL TO 10
069300     IF ACCUM-DATANAME NOT EQUAL TO 11
069400     IF ACCUM-DATANAME NOT EQUAL TO 12
069500     IF ACCUM-DATANAME NOT EQUAL TO 13
069600     IF ACCUM-DATANAME NOT EQUAL TO 14
069700     IF ACCUM-DATANAME NOT EQUAL TO 15
069800     IF ACCUM-DATANAME NOT EQUAL TO 16
069900     IF ACCUM-DATANAME NOT EQUAL TO 17
070000     IF ACCUM-DATANAME NOT EQUAL TO 18
070100     IF ACCUM-DATANAME NOT EQUAL TO 19
070200     IF ACCUM-DATANAME NOT EQUAL TO 20
070300     IF ACCUM-DATANAME NOT EQUAL TO 21
070400         MOVE "TRUE" TO T-F.
070500     IF ACCUM-DATANAME EQUAL TO 22 AND T-F EQUAL TO "TRUE"
070600         PERFORM PASS
070700         PERFORM IF-WRITE-GF-Y
070800         SUBTRACT 1 FROM ACCUM-DATANAME
070900         GO TO IF-TEST-GF-Y.
071000     IF ACCUM-DATANAME LESS THAN 22 AND T-F EQUAL TO "FALSE"
071100         PERFORM PASS
071200         GO TO IF-WRITE-GF-Y
071300     ELSE  GO TO IF-FAIL-GF-Y.
071400 IF-DELETE-GF-Y.
071500     ADD 21 TO PAR-NUMBER.
071600     PERFORM DE-LETE.
071700     ADD 21 TO DELETE-COUNTER.
071800     MOVE 1 TO ACCUM-DATANAME.
071900     GO TO IF-WRITE-GF-Y.
072000 IF-FAIL-GF-Y.
072100     MOVE "*****" TO COMPUTED-A  CORRECT-A.
072200     MOVE ACCUM-DATANAME TO CHECK-VALU.
072300     MOVE CHECK-PARA TO RE-MARK.
072400     PERFORM FAIL.
072500 IF-WRITE-GF-Y.
072600     MOVE PARAGRAPH-NAME TO PAR-NAME.
072700     ADD 1 TO PAR-NUMBER.
072800     PERFORM PRINT-DETAIL.
072900     IF ACCUM-DATANAME EQUAL TO 1 GO TO TEST-EXIT.
073000     SUBTRACT 1 FROM ACCUM-DATANAME.
073100 IF-RETURN-GF-Y.
073200     GO TO IF-TEST-GF-Y.
073300 TEST-EXIT.
073400     EXIT.
073500 CCVS-EXIT SECTION.
073600 CCVS-999999.
073700     GO TO CLOSE-FILES.
