000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC211A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*                                                              *
002300*    PROGRAM NC211A TESTS THE GENERAL FORMAT OF THE "IF"       *
002400*    STATEMENT USING COMPOUND CONDITIONAL STATEMENTS WITH      *
002500*    ABREVIATED CONDITIONS, CONDITION NAMES AND QUALIFIED      *
002600*    DATA-NAMES.                                               *
002700*                                                              *
002800****************************************************************
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.
003200     XXXXX082.
003300 OBJECT-COMPUTER.
003400     XXXXX083.
003500ASPECIAL-NAMES.
003600A    XXXXX051
003700A    IS WRK-SWITCH-1
003800A    ON STATUS IS ON-WRK-SWITCH-1
003900A    OFF STATUS IS OFF-WRK-SWITCH-1
004000A    XXXXX052
004100A    IS WRK-SWITCH-2
004200A    OFF STATUS IS OFF-WRK-SWITCH-2.
004300 INPUT-OUTPUT SECTION.
004400 FILE-CONTROL.
004500     SELECT PRINT-FILE ASSIGN TO
004600     XXXXX055.
004700 DATA DIVISION.
004800 FILE SECTION.
004900 FD  PRINT-FILE.
005000 01  PRINT-REC PICTURE X(120).
005100 01  DUMMY-RECORD PICTURE X(120).
005200 WORKING-STORAGE SECTION.
005300 77  WRK-DS-02V00                 PICTURE S99.
005400     88 TEST-2NUC-COND-99         VALUE 99.
005500 77  WRK-DS-06V06                 PICTURE 9(6)V9(6).
005600 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06
005700                                  PICTURE S9(12).
005800 77  A02TWOS-DS-02V00             PICTURE S99    VALUE 22.
005900 77  WRK-DS-01V00                 PICTURE S9.
006000 77  A02TWOS-DS-03V02             PICTURE S999V99 VALUE +022.00.
006100 77  A990-DS-0201P                PICTURE S99P   VALUE 990.
006200 77  A02ONES-DS-02V00             PICTURE S99    VALUE 11.
006300 77  A01ONE-DS-P0801              PICTURE SP(8)9 VALUE .000000001.
006400 77  ATWO-DS-01V00                PICTURE S9     VALUE 2.
006500 77  WRK-XN-00001                 PICTURE X.
006600 77  WRK-XN-00005                 PICTURE X(5).
006700 77  MINUS-TWO          PICTURE S9 VALUE -2.
006800 77  MINUS-ONE          PICTURE S9 VALUE -1.
006900 77  MINUS-UNO          PICTURE S9 VALUE -1.
007000 77  NAUGHT             PICTURE S9 VALUE  0.
007100 77  NOTHING            PICTURE S9 VALUE ZERO.
007200 77  ONE                PICTURE S9 VALUE  1.
007300 77  UNO                PICTURE S9 VALUE +1.
007400 77  TWO  PICTURE 9 VALUE 2.
007500 77  DOS                PICTURE S9 VALUE +2.
007600 77  THREE PICTURE 9 VALUE 3.
007700 77  TRES               PICTURE S9 VALUE +3.
007800 77  FOUR               PICTURE S9 VALUE  4.
007900 77  QUATROS            PICTURE S9 VALUE +4.
008000 77  FIVE               PICTURE S9 VALUE  5.
008100 77  SIX                PICTURE S9 VALUE  6.
008200 77  SEVEN PICTURE 9 VALUE 7.
008300 77  EIGHT              PICTURE S9 VALUE  8.
008400 77  NINE  PICTURE 9 VALUE 9.
008500 77  TEN  PICTURE 99 VALUE 10.
008600 77  ONE-THIRD PIC SV9(18) VALUE +.333333333333333333.
008700 77  THREE-SEVENTHS PIC SV9(10) VALUE +.4285714286.
008800 77  ALTERCOUNT PICTURE 999 VALUE ZERO.
008900 77  XRAY PICTURE IS X.
009000 77  IF-D1 PICTURE S9(4)V9(2) VALUE 0.
009100 77  IF-D2 PICTURE S9(4)V9(2) VALUE ZERO.
009200 77  IF-D3 PICTURE X(10) VALUE "0000000000".
009300 77  IF-D4 PICTURE X(15) VALUE "               ".
009400 77  IF-D5 PICTURE X(10) VALUE ALL QUOTE.
009500 77  IF-D6 PICTURE A(10) VALUE "BABABABABA".
009600 77  IF-D7 PICTURE S9(6)V9(4) VALUE +123.45.
009700 77  IF-D8 PICTURE 9(6)V9(4) VALUE 12300.
009800 77  IF-D9 PICTURE X(3) VALUE "123".
009900 77  IF-D11 PICTURE X(6) VALUE "ABCDEF".
010000 77  IF-D13 PICTURE 9(6)V9(4) VALUE 12300.
010100 77  IF-D14 PICTURE S9(4)V9(2) VALUE +123.45.
010200 77  IF-D15 PICTURE S999PP VALUE 12300.
010300 77  IF-D16 PICTURE PP99 VALUE .0012.
010400 77  IF-D17 PICTURE SV9(4) VALUE .0012.
010500 77  IF-D18 PICTURE X(10) VALUE "BABABABABA".
010600 77  IF-D19 PICTURE X(10) VALUE "ABCDEF    ".
010700 77  IF-D23 PICTURE $9,9B9.90+.
010800 77  IF-D24 PICTURE X(10) VALUE "l1,2 3.40+".
010900 77  IF-D25 PICTURE ABABX0A.
011000 77  IF-D26 PICTURE X(8) VALUE "A C D0E".
011100 77  IF-D27 PICTURE IS 9(6)V9(4) VALUE IS 2137.45
011200     USAGE IS COMPUTATIONAL.
011300 77  IF-D28 PICTURE IS 999999V9999 VALUE IS 2137.45.
011400 77  IF-D31 PICTURE S9(6) VALUE -123.
011500 77  IF-D32 PICTURE S9(4)V99.
011600     88  A; VALUE 1.
011700     88  B VALUES ARE 2 THRU 4.
011800     88  C VALUE IS ZERO.
011900     88  D VALUE IS +12.34.
012000     88  E  VALUE IS .01, .11, .21 .81.
012100     88  F  VALUE IS 100 THRU 128 1000 THRU 1280 -9 THRU -2.
012200     88  G  VALUE IS 8765.43 1234 THRU 5678 5 -9999 THRU 10.
012300 77  IF-D33 PICTURE X(4).
012400     88  B   VALUE QUOTE.
012500     88  C   VALUE SPACE.
012600     88 D VALUE ALL "BAC".
012700 77  IF-D34 PICTURE A(4).
012800     88  B VALUE "A A ".
012900 77  IF-D37 PICTURE 9(5) VALUE 12345.
013000 77  IF-D38 PICTURE X(9) VALUE "12345    ".
013100 77  CCON-1 PICTURE 99 VALUE 11.
013200 77  CCON-2 PICTURE 99 VALUE 12.
013300 77  CCON-3 PICTURE 99 VALUE 13.
013400 77  CCON-4   PICTURE 99 VALUE 14.
013500 77  CLASS-1            PICTURE X(5).
013600 77  CLASS-2            PICTURE X(5).
013700 77  CLASS-3            PICTURE X(5).
013800 77  SIGN-1             PICTURE S9(5).
013900 77  SIGN-2             PICTURE S9(5).
014000 77  SIGN-3             PICTURE S9(5).
014100 77  AZE                PICTURE X(5) VALUE "AAAAA".
014200 77  BEEZE              PICTURE X(5) VALUE "BBBBB".
014300 77  CEEZE              PICTURE X(5) VALUE "CCCCC".
014400 01  SUBSCRIPT-6 PICTURE 99999 VALUE ZERO.
014500 01  IF-TABLE.
014600     02 IF-ELEM PICTURE X OCCURS 12 TIMES.
014700 01  QUOTE-DATA.
014800     02 QU-1 PICTURE X(3) VALUE "123".
014900     02 QU-2 PICTURE X VALUE QUOTE.
015000     02 QU-3 PICTURE X(6) VALUE "ABC456".
015100 01  IF-D10.
015200     02  D1 PICTURE X(2) VALUE "01".
015300     02  D2 PICTURE X(2) VALUE "23".
015400     02  D3.
015500     03  D4 PICTURE X(4) VALUE "4567".
015600     03 D5 PICTURE X(4) VALUE "8912".
015700 01  IF-D12.
015800     02  D1 PICTURE X(3) VALUE "ABC".
015900     02  D2.
016000     03  D3.
016100     04  D4      PICTURE XX     VALUE "DE".
016200     04  D5 PICTURE X VALUE "F".
016300 01  IF-D20.
016400     02  FILLER    PICTURE 9(5)   VALUE ZERO.
016500     02  D1 PICTURE 9(2) VALUE 12.
016600     02  D2 PICTURE 9 VALUE 3.
016700     02  D3 PICTURE 9(2) VALUE 45.
016800 01  IF-D21.
016900     02  D1 PICTURE 9(5) VALUE ZEROS.
017000     02  D2 PICTURE 9(5) VALUE 12345.
017100 01  IF-D22.
017200     02  D1 PICTURE A(2) VALUE "AB".
017300     02  D2 PICTURE A(4) VALUE "CDEF".
017400 01  IF-D35.
017500     02  AA PICTURE X(2).
017600     88  A1 VALUE "AA".
017700     88  A2 VALUE "AB".
017800     02  BB PICTURE IS X(2).
017900     88  B1 VALUE "CC".
018000     88  B2 VALUE "CD".
018100     02 BB-2 REDEFINES BB.
018200     03  AAA PICTURE X.
018300     88  AA1 VALUE "A".
018400     88  AA2 VALUE "C".
018500     03  BBB PICTURE X.
018600     88  BB1    VALUE "B".
018700     88  BB2 VALUE "D".
018800 01  IF-D36  PICTURE X(120) VALUE IS    "ABCDEFGHIJKLMNOPQRSTUVWXY
018900-    "Z1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLM
019000-    "NOPQRSTUVWXYZ1234567890ABCDEFGHIJKL".
019100 01  IF-D40 PICTURE 9(5) VALUE 12345
019200              COMPUTATIONAL SYNCHRONIZED RIGHT.
019300     88 IF-D40A VALUE ZERO THRU 10000.
019400     88 IF-D40B VALUE 10001 THRU 99999.
019500     88 IF-D40C VALUE 99999.
019600 01  PERFORM1  PICTURE XXX  VALUE SPACES.
019700 01  PERFORM2  PICTURE S999 VALUE 20.
019800 01  PERFORM3  PICTURE  9  VALUE  5.
019900 01  PERFORM4  PICTURE S99V9.
020000 01  PERFORM5  PICTURE S99V9  VALUE 10.0.
020100 01  PERFORM6  PICTURE  99V9.
020200 01  PERFORM7.
020300     02  PERFORM8  OCCURS 7 TIMES  PICTURE  99V9.
020400 01  PERFORM9  PICTURE 9   VALUE 3.
020500 01  PERFORM10  PICTURE  S9  VALUE -1.
020600 01  PERFORM11  PICTURE  99  VALUE 6.
020700 01  PERFORM12.
020800     02 PERFORM13  OCCURS 4 TIMES.
020900         03 PERFORM14  OCCURS 20 TIMES  PICTURE  99V9.
021000         03 PERFORM15  OCCURS 10 TIMES.
021100             04 PERFORM16  OCCURS 5 TIMES  PICTURE 99V9.
021200 01  PERFORM-KEY  PICTURE 9.
021300 01  RECEIVING-TABLE.
021400     03 TBL-ELEMEN-A.
021500         05 TBL-ELEMEN-B          PICTURE X(18).
021600         05 TBL-ELEMEN-C          PICTURE X(18).
021700     03  TBL-ELEMEN-D.
021800         05 TBL-ELEMEN-E          PICTURE X OCCURS 36 TIMES.
021900 01  LITERAL-SPLITTER.
022000     02 PART1                     PICTURE X(20).
022100     02 PART2                     PICTURE X(20).
022200     02 PART3                     PICTURE X(20).
022300     02 PART4                     PICTURE X(20).
022400 01  LITERAL-TABLE REDEFINES LITERAL-SPLITTER.
022500     02 80PARTS                   PICTURE X      OCCURS 80 TIMES.
022600 01  GRP-FOR-88-LEVELS.
022700     03 WRK-DS-02V00-COND         PICTURE 99.
022800         88 COND-1                VALUE IS 01 THRU 05.
022900         88 COND-2                VALUES ARE 06 THRU 10
023000                                           16 THRU 20  00.
023100         88 COND-3                VALUES 11 THRU 15.
023200 01  GRP-MOVE-CONSTANTS.
023300     03 GRP-GROUP-MOVE-FROM.
023400         04 GRP-ALPHABETIC.
023500             05 ALPHABET-AN-00026 PICTURE A(26)
023600                        VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
023700         04 GRP-NUMERIC.
023800             05 DIGITS-DV-10V00   PICTURE 9(10) VALUE 0123456789.
023900         05 DIGITS-DU-06V04-S REDEFINES DIGITS-DV-10V00
024000                                  PICTURE 9(6)V9999.
024100         04 GRP-ALPHANUMERIC.
024200             05 ALPHANUMERIC-XN-00049 PICTURE X(50)
024300     VALUE  "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-><=l,;.()/* 0123456789".
024400             05 FILLER                PICTURE X  VALUE QUOTE.
024500 01  GRP-FOR-2N058.
024600     02 SUB-GRP-FOR-2N058-A.
024700         03 ELEM-FOR-2N058-A PICTURE 999  VALUE ZEROES.
024800         03 ELEM-FOR-2N058-B PICTURE XXX  VALUE ZEROS.
024900         03 ELEM-FOR-2N058-C PICTURE XXX  VALUE SPACES.
025000         03 ELEM-FOR-2N058-D PICTURE X(6) VALUE ALL "ABC".
025100         03 ELEM-FOR-2N058-E PICTURE XXX  VALUE ALL "Z".
025200         03 ELEM-FOR-2N058-F PICTURE XXX  VALUE ALL SPACES.
025300         03 ELEM-FOR-2N058-G PICTURE XXX  VALUE ALL ZEROES.
025400         03 ELEM-FOR-2N058-H PICTURE 999  VALUE ALL ZEROS.
025500         03 ELEM-FOR-2N058-I PICTURE XXX  VALUE QUOTES.
025600         03 ELEM-FOR-2N058-J PICTURE XXX  VALUE ALL QUOTES.
025700         03 ELEM-FOR-2N058-K PICTURE XXX  VALUE ALL HIGH-VALUES.
025800         03 ELEM-FOR-2N058-L PICTURE XXX  VALUE ALL LOW-VALUES.
025900         03 ELEM-FOR-2N058-M PICTURE XXX  VALUE HIGH-VALUES.
026000         03 ELEM-FOR-2N058-N PICTURE XXX  VALUE LOW-VALUES.
026100     02 SUB-GRP-FOR-2N058-B.
026200         03 SUB-SUB-BA.
026300             04 ELEM-FOR-2N058-A  PICTURE 999.
026400             04 ELEM-FOR-2N058-B  PICTURE XXX.
026500             04 ELEM-FOR-2N058-C  PICTURE XXX.
026600             04 ELEM-FOR-2N058-D  PICTURE X(6).
026700         03 SUB-SUB-BB.
026800             04 ELEM-FOR-2N058-E  PICTURE XXX.
026900             04 ELEM-FOR-2N058-F  PICTURE XXX.
027000             04 ELEM-FOR-2N058-G  PICTURE XXX.
027100             04 ELEM-FOR-2N058-H  PICTURE 999.
027200         03 SUB-SUB-BC.
027300             04 ELEM-FOR-2N058-I  PICTURE XXX.
027400             04 ELEM-FOR-2N058-J  PICTURE XXX.
027500             04 ELEM-FOR-2N058-K  PICTURE XXX.
027600             04 ELEM-FOR-2N058-L  PICTURE XXX.
027700             04 ELEM-FOR-2N058-M  PICTURE XXX.
027800             04 ELEM-FOR-2N058-N  PICTURE XXX.
027900 01  CHARACTER-BREAKDOWN-S.
028000     02   FIRST-20S PICTURE X(20).
028100     02  SECOND-20S PICTURE X(20).
028200     02   THIRD-20S PICTURE X(20).
028300     02  FOURTH-20S PICTURE X(20).
028400     02   FIFTH-20S PICTURE X(20).
028500     02   SIXTH-20S PICTURE X(20).
028600     02 SEVENTH-20S PICTURE X(20).
028700     02  EIGHTH-20S PICTURE X(20).
028800     02   NINTH-20S PICTURE X(20).
028900     02   TENTH-20S PICTURE X(20).
029000 01  CHARACTER-BREAKDOWN-R.
029100     02   FIRST-20R PICTURE X(20).
029200     02  SECOND-20R PICTURE X(20).
029300     02   THIRD-20R PICTURE X(20).
029400     02  FOURTH-20R PICTURE X(20).
029500     02   FIFTH-20R PICTURE X(20).
029600     02   SIXTH-20R PICTURE X(20).
029700     02 SEVENTH-20R PICTURE X(20).
029800     02  EIGHTH-20R PICTURE X(20).
029900     02   NINTH-20R PICTURE X(20).
030000     02   TENTH-20R PICTURE X(20).
030100 01  TABLE-80.
030200     02  ELMT OCCURS 3 TIMES PIC 9.
030300     88  A80  VALUES ARE ZERO THRU 7.
030400     88  B80  VALUE 8.
030500     88  C80  VALUES ARE 7, 8 THROUGH 9.
030600
030700 01  TABLE-86.
030800     88  A86  VALUE "ABC".
030900     88  B86  VALUE "ABCABC".
031000     88  C86  VALUE "   ABC".
031100     02  DATANAME-86  PIC XXX  VALUE "ABC".
031200     02  DNAME-86.
031300         03  FILLER  PIC X  VALUE "A".
031400         03  FILLER  PIC X  VALUE "B".
031500         03  FILLER  PIC X   VALUE "C".
031600B01  DNAME-SWITCH       PICTURE 9 VALUE 1.
031700B    88 ON-WRK-SWITCH-1     VALUE 1.
031800B    88 OFF-WRK-SWITCH-1    VALUE 0.
031900B01  DNAME-SWITCH2  PICTURE 9 VALUE 0.
032000B    88  ON-WRK-SWITCH-2  VALUE 1.
032100B    88  OFF-WRK-SWITCH-2  VALUE 0.
032200 01  FIGCON-DATA.
032300     02 SPACE-X         PICTURE X(10) VALUE "          ".
032400     02 QUOTE-X         PICTURE X(5)  VALUE QUOTE.
032500     02 LOW-VAL         PICTURE X(5)  VALUE LOW-VALUE.
032600     02 ABC PICTURE XXX VALUE "ABC".
032700     02 ONE23           PICTURE 9999  VALUE 123.
032800     02 ZERO-C          PICTURE 9(10) VALUE 0 COMPUTATIONAL.
032900     02 ZERO-D          PICTURE 9     VALUE ZERO USAGE DISPLAY.
033000 01  XX-TALLY PIC S9(5) USAGE COMP.
033100 01  TEST-RESULTS.
033200     02 FILLER                   PIC X      VALUE SPACE.
033300     02 FEATURE                  PIC X(20)  VALUE SPACE.
033400     02 FILLER                   PIC X      VALUE SPACE.
033500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
033600     02 FILLER                   PIC X      VALUE SPACE.
033700     02  PAR-NAME.
033800       03 FILLER                 PIC X(19)  VALUE SPACE.
033900       03  PARDOT-X              PIC X      VALUE SPACE.
034000       03 DOTVALUE               PIC 99     VALUE ZERO.
034100     02 FILLER                   PIC X(8)   VALUE SPACE.
034200     02 RE-MARK                  PIC X(61).
034300 01  TEST-COMPUTED.
034400     02 FILLER                   PIC X(30)  VALUE SPACE.
034500     02 FILLER                   PIC X(17)  VALUE
034600            "       COMPUTED=".
034700     02 COMPUTED-X.
034800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
034900     03 COMPUTED-N               REDEFINES COMPUTED-A
035000                                 PIC -9(9).9(9).
035100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
035200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
035300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
035400     03       CM-18V0 REDEFINES COMPUTED-A.
035500         04 COMPUTED-18V0                    PIC -9(18).
035600         04 FILLER                           PIC X.
035700     03 FILLER PIC X(50) VALUE SPACE.
035800 01  TEST-CORRECT.
035900     02 FILLER PIC X(30) VALUE SPACE.
036000     02 FILLER PIC X(17) VALUE "       CORRECT =".
036100     02 CORRECT-X.
036200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
036300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
036400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
036500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
036600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
036700     03      CR-18V0 REDEFINES CORRECT-A.
036800         04 CORRECT-18V0                     PIC -9(18).
036900         04 FILLER                           PIC X.
037000     03 FILLER PIC X(2) VALUE SPACE.
037100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
037200 01  CCVS-C-1.
037300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
037400-    "SS  PARAGRAPH-NAME
037500-    "       REMARKS".
037600     02 FILLER                     PIC X(20)    VALUE SPACE.
037700 01  CCVS-C-2.
037800     02 FILLER                     PIC X        VALUE SPACE.
037900     02 FILLER                     PIC X(6)     VALUE "TESTED".
038000     02 FILLER                     PIC X(15)    VALUE SPACE.
038100     02 FILLER                     PIC X(4)     VALUE "FAIL".
038200     02 FILLER                     PIC X(94)    VALUE SPACE.
038300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
038400 01  REC-CT                        PIC 99       VALUE ZERO.
038500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
038600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
038700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
038800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
038900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
039000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
039100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
039200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
039300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
039400 01  CCVS-H-1.
039500     02  FILLER                    PIC X(39)    VALUE SPACES.
039600     02  FILLER                    PIC X(42)    VALUE
039700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
039800     02  FILLER                    PIC X(39)    VALUE SPACES.
039900 01  CCVS-H-2A.
040000   02  FILLER                        PIC X(40)  VALUE SPACE.
040100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
040200   02  FILLER                        PIC XXXX   VALUE
040300     "4.2 ".
040400   02  FILLER                        PIC X(28)  VALUE
040500            " COPY - NOT FOR DISTRIBUTION".
040600   02  FILLER                        PIC X(41)  VALUE SPACE.
040700
040800 01  CCVS-H-2B.
040900   02  FILLER                        PIC X(15)  VALUE
041000            "TEST RESULT OF ".
041100   02  TEST-ID                       PIC X(9).
041200   02  FILLER                        PIC X(4)   VALUE
041300            " IN ".
041400   02  FILLER                        PIC X(12)  VALUE
041500     " HIGH       ".
041600   02  FILLER                        PIC X(22)  VALUE
041700            " LEVEL VALIDATION FOR ".
041800   02  FILLER                        PIC X(58)  VALUE
041900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
042000 01  CCVS-H-3.
042100     02  FILLER                      PIC X(34)  VALUE
042200            " FOR OFFICIAL USE ONLY    ".
042300     02  FILLER                      PIC X(58)  VALUE
042400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
042500     02  FILLER                      PIC X(28)  VALUE
042600            "  COPYRIGHT   1985 ".
042700 01  CCVS-E-1.
042800     02 FILLER                       PIC X(52)  VALUE SPACE.
042900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
043000     02 ID-AGAIN                     PIC X(9).
043100     02 FILLER                       PIC X(45)  VALUE SPACES.
043200 01  CCVS-E-2.
043300     02  FILLER                      PIC X(31)  VALUE SPACE.
043400     02  FILLER                      PIC X(21)  VALUE SPACE.
043500     02 CCVS-E-2-2.
043600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
043700         03 FILLER                   PIC X      VALUE SPACE.
043800         03 ENDER-DESC               PIC X(44)  VALUE
043900            "ERRORS ENCOUNTERED".
044000 01  CCVS-E-3.
044100     02  FILLER                      PIC X(22)  VALUE
044200            " FOR OFFICIAL USE ONLY".
044300     02  FILLER                      PIC X(12)  VALUE SPACE.
044400     02  FILLER                      PIC X(58)  VALUE
044500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
044600     02  FILLER                      PIC X(13)  VALUE SPACE.
044700     02 FILLER                       PIC X(15)  VALUE
044800             " COPYRIGHT 1985".
044900 01  CCVS-E-4.
045000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
045100     02 FILLER                       PIC X(4)   VALUE " OF ".
045200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
045300     02 FILLER                       PIC X(40)  VALUE
045400      "  TESTS WERE EXECUTED SUCCESSFULLY".
045500 01  XXINFO.
045600     02 FILLER                       PIC X(19)  VALUE
045700            "*** INFORMATION ***".
045800     02 INFO-TEXT.
045900       04 FILLER                     PIC X(8)   VALUE SPACE.
046000       04 XXCOMPUTED                 PIC X(20).
046100       04 FILLER                     PIC X(5)   VALUE SPACE.
046200       04 XXCORRECT                  PIC X(20).
046300     02 INF-ANSI-REFERENCE           PIC X(48).
046400 01  HYPHEN-LINE.
046500     02 FILLER  PIC IS X VALUE IS SPACE.
046600     02 FILLER  PIC IS X(65)    VALUE IS "************************
046700-    "*****************************************".
046800     02 FILLER  PIC IS X(54)    VALUE IS "************************
046900-    "******************************".
047000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
047100            "NC211A".
047200 PROCEDURE DIVISION.
047300 CCVS1 SECTION.
047400 OPEN-FILES.
047500     OPEN     OUTPUT PRINT-FILE.
047600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
047700     MOVE    SPACE TO TEST-RESULTS.
047800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
047900     GO TO CCVS1-EXIT.
048000 CLOSE-FILES.
048100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
048200 TERMINATE-CCVS.
048300S    EXIT PROGRAM.
048400STERMINATE-CALL.
048500     STOP     RUN.
048600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
048700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
048800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
048900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
049000     MOVE "****TEST DELETED****" TO RE-MARK.
049100 PRINT-DETAIL.
049200     IF REC-CT NOT EQUAL TO ZERO
049300             MOVE "." TO PARDOT-X
049400             MOVE REC-CT TO DOTVALUE.
049500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
049600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
049700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
049800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
049900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
050000     MOVE SPACE TO CORRECT-X.
050100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
050200     MOVE     SPACE TO RE-MARK.
050300 HEAD-ROUTINE.
050400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
050700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
050800 COLUMN-NAMES-ROUTINE.
050900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
051000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
051200 END-ROUTINE.
051300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
051400 END-RTN-EXIT.
051500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051600 END-ROUTINE-1.
051700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
051800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
051900      ADD PASS-COUNTER TO ERROR-HOLD.
052000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
052100      MOVE PASS-COUNTER TO CCVS-E-4-1.
052200      MOVE ERROR-HOLD TO CCVS-E-4-2.
052300      MOVE CCVS-E-4 TO CCVS-E-2-2.
052400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
052500  END-ROUTINE-12.
052600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
052700     IF       ERROR-COUNTER IS EQUAL TO ZERO
052800         MOVE "NO " TO ERROR-TOTAL
052900         ELSE
053000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
053100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
053200     PERFORM WRITE-LINE.
053300 END-ROUTINE-13.
053400     IF DELETE-COUNTER IS EQUAL TO ZERO
053500         MOVE "NO " TO ERROR-TOTAL  ELSE
053600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
053700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
053800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
053900      IF   INSPECT-COUNTER EQUAL TO ZERO
054000          MOVE "NO " TO ERROR-TOTAL
054100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
054200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
054300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054500 WRITE-LINE.
054600     ADD 1 TO RECORD-COUNT.
054700Y    IF RECORD-COUNT GREATER 50
054800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
054900Y        MOVE SPACE TO DUMMY-RECORD
055000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
055100Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
055200Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
055300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
055400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
055500Y        MOVE ZERO TO RECORD-COUNT.
055600     PERFORM WRT-LN.
055700 WRT-LN.
055800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
055900     MOVE SPACE TO DUMMY-RECORD.
056000 BLANK-LINE-PRINT.
056100     PERFORM WRT-LN.
056200 FAIL-ROUTINE.
056300     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
056400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
056500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
056600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
056700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
056800     MOVE   SPACES TO INF-ANSI-REFERENCE.
056900     GO TO  FAIL-ROUTINE-EX.
057000 FAIL-ROUTINE-WRITE.
057100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
057200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
057300     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
057400     MOVE   SPACES TO COR-ANSI-REFERENCE.
057500 FAIL-ROUTINE-EX. EXIT.
057600 BAIL-OUT.
057700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
057800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
057900 BAIL-OUT-WRITE.
058000     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
058100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
058200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
058300     MOVE   SPACES TO INF-ANSI-REFERENCE.
058400 BAIL-OUT-EX. EXIT.
058500 CCVS1-EXIT.
058600     EXIT.
058700 SECT-NC211A-001 SECTION.
058800 NC-211A-001.
058900 CC--INIT-GF-1.
059000     MOVE "CC--TEST-GF-1 " TO PAR-NAME.
059100     MOVE "COMPOUND CONDITIONS" TO FEATURE.
059200     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
059300     PERFORM PRINT-DETAIL.
059400     MOVE "  NOT ABBREVIATED   " TO FEATURE.
059500     MOVE 11 TO CCON-1.
059600     MOVE 12 TO CCON-2.
059700     MOVE 13 TO CCON-3.
059800 CC--TEST-GF-1.
059900     IF CCON-1 IS LESS THAN CCON-2 AND CCON-3 IS GREATER THAN 10
060000            PERFORM PASS
060100            GO TO CC--WRITE-GF-1.
060200     GO TO CC--FAIL-GF-1.
060300 CC--DELETE-GF-1.
060400     PERFORM DE-LETE.
060500     GO TO CC--WRITE-GF-1.
060600 CC--FAIL-GF-1.
060700     PERFORM FAIL.
060800 CC--WRITE-GF-1.
060900     PERFORM PRINT-DETAIL.
061000*
061100 CC--INIT-GF-2.
061200     MOVE "CC--TEST-GF-2 " TO PAR-NAME.
061300     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
061400     MOVE 11 TO CCON-1.
061500     MOVE 12 TO CCON-2.
061600     MOVE 13 TO CCON-3.
061700 CC--TEST-GF-2.
061800     IF CCON-2 GREATER THAN CCON-1 AND 20 LESS THAN CCON-3
061900            GO TO CC--FAIL-GF-2.
062000     PERFORM PASS.
062100     GO TO CC--WRITE-GF-2.
062200 CC--DELETE-GF-2.
062300     PERFORM DE-LETE.
062400     GO TO CC--WRITE-GF-2.
062500 CC--FAIL-GF-2.
062600     PERFORM FAIL.
062700 CC--WRITE-GF-2.
062800     PERFORM PRINT-DETAIL.
062900*
063000 CC--INIT-GF-3.
063100     MOVE "CC--TEST-GF-3 " TO PAR-NAME.
063200     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
063300     MOVE 11 TO CCON-1.
063400     MOVE 12 TO CCON-2.
063500     MOVE 13 TO CCON-3.
063600 CC--TEST-GF-3.
063700     IF CCON-1 GREATER THAN CCON-2 AND 20 GREATER THAN CCON-3
063800             GO TO CC--FAIL-GF-3.
063900     PERFORM PASS.
064000     GO TO CC--WRITE-GF-3.
064100 CC--DELETE-GF-3.
064200     PERFORM DE-LETE.
064300     GO TO CC--WRITE-GF-3.
064400 CC--FAIL-GF-3.
064500     PERFORM FAIL.
064600 CC--WRITE-GF-3.
064700     PERFORM PRINT-DETAIL.
064800*
064900 CC--INIT-GF-4.
065000     MOVE "CC--TEST-GF-4 " TO PAR-NAME.
065100     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
065200     MOVE 11 TO CCON-1.
065300     MOVE 13 TO CCON-3.
065400 CC--TEST-GF-4.
065500     IF CCON-1 GREATER THAN 10 OR 20 LESS THAN CCON-3
065600           PERFORM PASS
065700           GO TO CC--WRITE-GF-4.
065800     GO TO CC--FAIL-GF-4.
065900 CC--DELETE-GF-4.
066000     PERFORM DE-LETE.
066100     GO TO CC--WRITE-GF-4.
066200 CC--FAIL-GF-4.
066300     PERFORM FAIL.
066400 CC--WRITE-GF-4.
066500     PERFORM PRINT-DETAIL.
066600*
066700 CC--INIT-GF-5.
066800     MOVE "CC--TEST-GF-5 " TO PAR-NAME.
066900     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
067000     MOVE 11 TO CCON-1.
067100     MOVE 12 TO CCON-2.
067200     MOVE 13 TO CCON-3.
067300 CC--TEST-GF-5.
067400     IF CCON-3 LESS THAN CCON-2 OR 20 GREATER THAN CCON-1
067500              PERFORM PASS
067600              GO TO CC--WRITE-GF-5.
067700     GO TO CC--FAIL-GF-5.
067800 CC--DELETE-GF-5.
067900     PERFORM DE-LETE.
068000     GO TO CC--WRITE-GF-5.
068100 CC--FAIL-GF-5.
068200     PERFORM FAIL.
068300 CC--WRITE-GF-5.
068400     PERFORM PRINT-DETAIL.
068500*
068600 CC--INIT-GF-6.
068700     MOVE "CC--TEST-GF-6 " TO PAR-NAME.
068800     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
068900     MOVE 11 TO CCON-1.
069000     MOVE 12 TO CCON-2.
069100     MOVE 13 TO CCON-3.
069200 CC--TEST-GF-6.
069300     IF CCON-1 EQUAL TO 11 AND CCON-3 GREATER THAN 12 OR CCON-2
069400     LESS THAN 20 AND CCON-1 GREATER THAN 12
069500              PERFORM PASS
069600              GO TO CC--WRITE-GF-6.
069700     GO TO CC--FAIL-GF-6.
069800 CC--DELETE-GF-6.
069900     PERFORM DE-LETE.
070000     GO TO CC--WRITE-GF-6.
070100 CC--FAIL-GF-6.
070200     PERFORM FAIL.
070300 CC--WRITE-GF-6.
070400     PERFORM PRINT-DETAIL.
070500*
070600 CC--INIT-GF-7.
070700     MOVE "CC--TEST-GF-7 " TO PAR-NAME.
070800     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
070900     MOVE 11 TO CCON-1.
071000     MOVE 12 TO CCON-2.
071100     MOVE 13 TO CCON-3.
071200 CC--TEST-GF-7.
071300     IF CCON-1 LESS THAN 9 AND CCON-3 GREATER THAN 12 OR CCON-2
071400     GREATER THAN 10 AND CCON-1 GREATER THAN 8
071500           PERFORM PASS
071600           GO TO CC--WRITE-GF-7.
071700     GO TO CC--FAIL-GF-7.
071800 CC--DELETE-GF-7.
071900     PERFORM DE-LETE.
072000     GO TO CC--WRITE-GF-7.
072100 CC--FAIL-GF-7.
072200     PERFORM FAIL.
072300 CC--WRITE-GF-7.
072400     PERFORM PRINT-DETAIL.
072500*
072600 CC--INIT-GF-8.
072700     MOVE "CC--TEST-GF-8 " TO PAR-NAME.
072800     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
072900     MOVE 11 TO CCON-1.
073000     MOVE 12 TO CCON-2.
073100 CC--TEST-GF-8.
073200     IF CCON-1 NOT EQUAL TO 11 OR CCON-2 NOT LESS THAN 10
073300     PERFORM PASS ELSE PERFORM FAIL.
073400     GO TO CC--WRITE-GF-8.
073500 CC--DELETE-GF-8.
073600     PERFORM DE-LETE.
073700     GO TO CC--WRITE-GF-8.
073800 CC--FAIL-GF-8.
073900     PERFORM FAIL.
074000 CC--WRITE-GF-8.
074100     PERFORM PRINT-DETAIL.
074200*
074300 CC--INIT-GF-9.
074400     MOVE "CC--TEST-GF-9 " TO PAR-NAME.
074500     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
074600     MOVE 11 TO CCON-1.
074700     MOVE 12 TO CCON-2.
074800     MOVE 13 TO CCON-3.
074900 CC--TEST-GF-9.
075000     IF CCON-2 NOT EQUAL TO CCON-3 AND CCON-1 NOT GREATER THAN 12
075100              PERFORM PASS
075200              GO TO CC--WRITE-GF-9.
075300     GO TO CC--FAIL-GF-9.
075400 CC--DELETE-GF-9.
075500     PERFORM DE-LETE.
075600     GO TO CC--WRITE-GF-9.
075700 CC--FAIL-GF-9.
075800     PERFORM FAIL.
075900 CC--WRITE-GF-9.
076000     PERFORM PRINT-DETAIL.
076100*
076200 CC--INIT-GF-10.
076300     MOVE "CC--TEST-GF-10" TO PAR-NAME.
076400     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
076500     MOVE 12 TO CCON-2.
076600     MOVE 13 TO CCON-3.
076700 CC--TEST-GF-10.
076800     IF CCON-3 NOT EQUAL TO 13 OR CCON-2 NOT LESS THAN 13
076900            GO TO CC--FAIL-GF-10.
077000     PERFORM PASS.
077100     GO TO CC--WRITE-GF-10.
077200 CC--DELETE-GF-10.
077300     PERFORM DE-LETE.
077400     GO TO CC--WRITE-GF-10.
077500 CC--FAIL-GF-10.
077600     PERFORM FAIL.
077700 CC--WRITE-GF-10.
077800     PERFORM PRINT-DETAIL.
077900*
078000 CC--INIT-GF-11.
078100     MOVE "CC--TEST-GF-11" TO PAR-NAME.
078200     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
078300     MOVE "  ABBREVIATED       " TO FEATURE.
078400     MOVE 13 TO CCON-3.
078500 CC--TEST-GF-11.
078600     IF CCON-3 NOT EQUAL TO 12 AND GREATER THAN 10
078700             PERFORM PASS
078800             GO TO CC--WRITE-GF-11.
078900     GO TO CC--FAIL-GF-11.
079000 CC--DELETE-GF-11.
079100     PERFORM DE-LETE.
079200     GO TO CC--WRITE-GF-11.
079300 CC--FAIL-GF-11.
079400     PERFORM FAIL.
079500 CC--WRITE-GF-11.
079600     PERFORM PRINT-DETAIL.
079700*
079800 CC--INIT-GF-12.
079900     MOVE "CC--TEST-GF-12" TO PAR-NAME.
080000     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
080100     MOVE 12 TO CCON-2.
080200 CC--TEST-GF-12.
080300     IF CCON-2 LESS THAN 10 OR EQUAL TO 12 PERFORM PASS
080400               GO TO CC--WRITE-GF-12.
080500     GO TO CC--FAIL-GF-12.
080600 CC--DELETE-GF-12.
080700     PERFORM DE-LETE.
080800     GO TO CC--WRITE-GF-12.
080900 CC--FAIL-GF-12.
081000     PERFORM FAIL.
081100 CC--WRITE-GF-12.
081200     PERFORM PRINT-DETAIL.
081300*
081400 CC--INIT-GF-13.
081500     MOVE "CC--TEST-GF-13" TO PAR-NAME.
081600     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
081700     MOVE 11 TO CCON-1.
081800     MOVE 12 TO CCON-2.
081900 CC--TEST-GF-13.
082000     IF CCON-1 EQUAL TO CCON-2 OR 10 OR 11 PERFORM PASS
082100             GO TO CC--WRITE-GF-13.
082200     GO TO CC--FAIL-GF-13.
082300 CC--DELETE-GF-13.
082400     PERFORM DE-LETE.
082500     GO TO CC--WRITE-GF-13.
082600 CC--FAIL-GF-13.
082700     PERFORM FAIL.
082800 CC--WRITE-GF-13.
082900     PERFORM PRINT-DETAIL.
083000*
083100 CC--INIT-GF-14.
083200     MOVE "CC--TEST-GF-14" TO PAR-NAME.
083300     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
083400     MOVE 11 TO CCON-1.
083500     MOVE 12 TO CCON-2.
083600     MOVE 13 TO CCON-3.
083700 CC--TEST-GF-14.
083800     IF CCON-2 GREATER THAN CCON-3 OR EQUAL TO CCON-1 OR 8 OR
083900              CCON-3 - 1; PERFORM PASS
084000              GO TO CC--WRITE-GF-14.
084100     GO TO CC--FAIL-GF-14.
084200 CC--DELETE-GF-14.
084300     PERFORM DE-LETE.
084400     GO TO CC--WRITE-GF-14.
084500 CC--FAIL-GF-14.
084600     PERFORM FAIL.
084700 CC--WRITE-GF-14.
084800     PERFORM PRINT-DETAIL.
084900*
085000 CC--INIT-GF-15.
085100     MOVE "CC--TEST-GF-15" TO PAR-NAME.
085200     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
085300     MOVE "ABCDEF" TO IF-D11.
085400     MOVE "ABC"    TO D1 OF IF-D12.
085500     MOVE "DE"     TO D4 OF IF-D12.
085600     MOVE "F"      TO D5 OF IF-D12.
085700     MOVE "AB"     TO D1 OF IF-D22.
085800     MOVE "CDEF"   TO D2 OF IF-D22.
085900 CC--TEST-GF-15.
086000     IF IF-D11 EQUAL TO IF-D12 OR IF-D22 AND "ABCDEF"
086100             PERFORM PASS
086200             GO TO CC--WRITE-GF-15.
086300     GO TO CC--FAIL-GF-15.
086400 CC--DELETE-GF-15.
086500     PERFORM DE-LETE.
086600     GO TO CC--WRITE-GF-15.
086700 CC--FAIL-GF-15.
086800     PERFORM FAIL.
086900 CC--WRITE-GF-15.
087000     PERFORM PRINT-DETAIL.
087100*
087200 CC--INIT-GF-16.
087300     MOVE "CC--TEST-GF-16" TO PAR-NAME.
087400     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
087500     MOVE "ABCDEF" TO IF-D11.
087600     MOVE "ABC"    TO D1 OF IF-D12.
087700     MOVE "DE"     TO D4 OF IF-D12.
087800     MOVE "F"      TO D5 OF IF-D12.
087900     MOVE "AB"     TO D1 OF IF-D22.
088000     MOVE "CDEF"   TO D2 OF IF-D22.
088100 CC--TEST-GF-16.
088200     IF IF-D11 NOT EQUAL TO IF-D12 AND IF-D22 OR "ABCDEF"
088300              PERFORM FAIL
088400              GO TO CC--WRITE-GF-16.
088500     GO TO CC--PASS-GF-16.
088600 CC--DELETE-GF-16.
088700     PERFORM DE-LETE.
088800     GO TO CC--WRITE-GF-16.
088900 CC--PASS-GF-16.
089000     PERFORM PASS.
089100 CC--WRITE-GF-16.
089200     PERFORM PRINT-DETAIL.
089300*
089400 CC--INIT-GF-17.
089500     MOVE "CC--TEST-GF-17" TO PAR-NAME.
089600     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
089700     MOVE  +123.45 TO IF-D7.
089800     MOVE 12300    TO IF-D13.
089900     MOVE  2137.45 TO IF-D27.
090000     MOVE  2137.45 TO IF-D28.
090100 CC--TEST-GF-17.
090200     IF IF-D27 GREATER THAN IF-D13 OR (IF-D27 IS EQUAL TO IF-D28
090300     AND IF-D27 NOT LESS THAN IF-D7) PERFORM PASS
090400                GO TO CC--WRITE-GF-17.
090500     GO TO CC--FAIL-GF-17.
090600 CC--DELETE-GF-17.
090700     PERFORM DE-LETE.
090800     GO TO CC--WRITE-GF-17.
090900 CC--FAIL-GF-17.
091000     PERFORM FAIL.
091100 CC--WRITE-GF-17.
091200     PERFORM PRINT-DETAIL.
091300*
091400 CC--INIT-GF-18.
091500     MOVE "CC--TEST-GF-18" TO PAR-NAME.
091600     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
091700     MOVE 11 TO CCON-1.
091800     MOVE 12 TO CCON-2.
091900     MOVE 13 TO CCON-3.
092000 CC--TEST-GF-18.
092100     IF CCON-2 GREATER THAN CCON-1 AND NOT GREATER THAN CCON-3 OR
092200         CCON-1      PERFORM PASS
092300                     GO TO CC--WRITE-GF-18.
092400     GO TO CC--FAIL-GF-18.
092500*    NOTE THE STANDARD SAYS THAT THE ABOVE IS EQUIVALENT TO ---
092600*        IF CCON-2 GREATER THAN CCON-1 AND CCON-2 NOT GREATER THAN
092700*        CCON-3 OR CCON-2 NOT GREATER THAN CCON-1 PERFORM PASS
092800*        ELSE PERFORM FAIL.
092900 CC--DELETE-GF-18.
093000     PERFORM DE-LETE.
093100     GO TO CC--WRITE-GF-18.
093200 CC--FAIL-GF-18.
093300     PERFORM FAIL.
093400 CC--WRITE-GF-18.
093500     PERFORM PRINT-DETAIL.
093600*
093700 CC--INIT-GF-19.
093800     MOVE "CC--TEST-GF-19" TO PAR-NAME.
093900     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
094000     MOVE "  ABBREV. W/PARENS  " TO FEATURE.
094100     MOVE 11 TO CCON-1.
094200     MOVE 12 TO CCON-2.
094300     MOVE 13 TO CCON-3.
094400 CC--TEST-GF-19.
094500     IF CCON-1 NOT LESS THAN 9 AND (CCON-3 GREATER THAN 12 OR
094600     CCON-2 GREATER THAN 10) AND CCON-1 GREATER THAN 8
094700             PERFORM PASS
094800             GO TO CC--WRITE-GF-19.
094900     GO TO CC--FAIL-GF-19.
095000 CC--DELETE-GF-19.
095100     PERFORM DE-LETE.
095200     GO TO CC--WRITE-GF-19.
095300 CC--FAIL-GF-19.
095400     PERFORM FAIL.
095500 CC--WRITE-GF-19.
095600     PERFORM PRINT-DETAIL.
095700*
095800 CC--INIT-GF-20.
095900     MOVE "CC--TEST-GF-20" TO PAR-NAME.
096000     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
096100     MOVE "  ABBREV. W/PARENS  " TO FEATURE.
096200     MOVE     0             TO IF-D1.
096300     MOVE  ZERO             TO IF-D2.
096400     MOVE "               " TO IF-D4.
096500     MOVE      .0012        TO IF-D16.
096600     MOVE      .0012        TO IF-D17.
096700     MOVE    12             TO D1 OF IF-D20.
096800     MOVE     3             TO D2 OF IF-D20.
096900     MOVE    45             TO D3 OF IF-D20.
097000     MOVE ZEROS             TO D1 OF IF-D21.
097100     MOVE 12345             TO D2 OF IF-D21.
097200 CC--TEST-GF-20.
097300     IF IF-D4 EQUAL TO ZEROS OR (IF-D1 NOT LESS THAN
097400     IF-D2 AND (IF-D16 GREATER THAN IF-D17 OR IF-D20 EQUAL TO
097500     IF-D21)) PERFORM PASS
097600              GO TO CC--WRITE-GF-20.
097700     GO TO CC--FAIL-GF-20.
097800 CC--DELETE-GF-20.
097900     PERFORM DE-LETE.
098000     GO TO CC--WRITE-GF-20.
098100 CC--FAIL-GF-20.
098200     PERFORM FAIL.
098300 CC--WRITE-GF-20.
098400     PERFORM PRINT-DETAIL.
098500*
098600 CC--INIT-GF-21.
098700     MOVE "CC--TEST-GF-21" TO PAR-NAME.
098800     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
098900     MOVE "  NESTED IF         " TO FEATURE.
099000     MOVE      .0012 TO IF-D16.
099100     MOVE      .0012 TO IF-D17.
099200     MOVE    12      TO D1 OF IF-D20.
099300     MOVE     3      TO D2 OF IF-D20.
099400     MOVE    45      TO D3 OF IF-D20.
099500     MOVE ZEROS      TO D1 OF IF-D21.
099600     MOVE 12345      TO D2 OF IF-D21.
099700 CC--TEST-GF-21.
099800     IF IF-D20 NOT LESS THAN IF-D21
099900         IF IF-D16 EQUAL TO IF-D17
100000             PERFORM PASS
100100             GO TO CC--WRITE-GF-21
100200         ELSE
100300             PERFORM CC--FAIL-GF-21
100400     ELSE
100500         NEXT SENTENCE.
100600     GO TO CC--FAIL-GF-21.
100700 CC--DELETE-GF-21.
100800     PERFORM DE-LETE.
100900     GO TO CC--WRITE-GF-21.
101000 CC--FAIL-GF-21.
101100     PERFORM FAIL.
101200 CC--WRITE-GF-21.
101300     PERFORM PRINT-DETAIL.
101400*
101500 CC--INIT-GF-22.
101600     MOVE "CC--TEST-GF-22" TO PAR-NAME.
101700     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
101800     MOVE "  NESTED IF         " TO FEATURE.
101900     MOVE    12      TO D1 OF IF-D20.
102000     MOVE     3      TO D2 OF IF-D20.
102100     MOVE    45      TO D3 OF IF-D20.
102200     MOVE ZEROS      TO D1 OF IF-D21.
102300     MOVE 12345      TO D2 OF IF-D21.
102400 CC--TEST-GF-22.
102500     IF IF-D20 NOT EQUAL TO IF-D21
102600         NEXT SENTENCE
102700     ELSE
102800         IF IF-D20 NOT GREATER THAN IF-D21
102900             PERFORM PASS
103000             GO TO CC--WRITE-GF-22
103100         ELSE
103200             GO TO CC--FAIL-GF-22.
103300*
103400     GO TO CC--FAIL-GF-22.
103500 CC--DELETE-GF-22.
103600     PERFORM DE-LETE.
103700     GO TO CC--WRITE-GF-22.
103800 CC--FAIL-GF-22.
103900     PERFORM FAIL.
104000 CC--WRITE-GF-22.
104100     PERFORM PRINT-DETAIL.
104200*
104300 CC--INIT-GF-23.
104400     MOVE     "CC--TEST-GF-23" TO PAR-NAME.
104500     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
104600     MOVE "  NESTED IF         " TO FEATURE.
104700     MOVE     "X" TO WRK-XN-00001.
104800     MOVE     ZERO TO WRK-DS-01V00.
104900     MOVE     1 TO XX-TALLY.
105000       MOVE SPACE TO IF-TABLE.
105100     PERFORM  CC--TEST-GF-23.
105200 CC--TEST-GF-23.
105300     IF       WRK-XN-00001 IS EQUAL TO "X"
105400          MOVE "Z" TO WRK-XN-00001
105500          IF WRK-DS-01V00 IS EQUAL TO ZERO
105600                MOVE 1 TO WRK-DS-01V00
105700          ELSE
105800                MOVE 2 TO WRK-DS-01V00
105900     ELSE
106000          MOVE "W" TO WRK-XN-00001
106100          IF WRK-DS-01V00 IS GREATER THAN ZERO
106200                MOVE "1" TO IF-ELEM (7).
106300     MOVE     WRK-XN-00001 TO IF-ELEM (XX-TALLY).
106400     ADD      1 TO XX-TALLY.
106500     MOVE     WRK-DS-01V00 TO IF-ELEM (XX-TALLY).
106600     ADD      1 TO XX-TALLY.
106700     MOVE     SPACE TO IF-ELEM (XX-TALLY)
106800     ADD      1 TO XX-TALLY.
106900 CC--TEST-GF-23-1.
107000     IF       IF-TABLE EQUAL TO "Z1 W1 1     "
107100              PERFORM PASS GO TO CC--WRITE-GF-23.
107200     GO       TO CC--FAIL-GF-23.
107300 CC--DELETE-GF-23.
107400     PERFORM  DE-LETE.
107500     GO       TO CC--WRITE-GF-23.
107600 CC--FAIL-GF-23.
107700     MOVE     IF-TABLE TO COMPUTED-A.
107800     MOVE     "Z1 W1 1" TO CORRECT-A.
107900     PERFORM FAIL.
108000 CC--WRITE-GF-23.
108100     PERFORM  PRINT-DETAIL.
108200*
108300 CC--INIT-GF-24.
108400     MOVE "CC--TEST-GF-24" TO PAR-NAME.
108500     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
108600     MOVE     "  NOT ABBREVIATED   " TO FEATURE.
108700     MOVE     SPACE TO WRK-XN-00001.
108800     MOVE ZERO TO WRK-DS-01V00.
108900 CC--TEST-GF-24.
109000     IF   WRK-XN-00001 EQUAL TO SPACE
109100          OR
109200          WRK-DS-01V00 EQUAL TO ZERO
109300          PERFORM PASS
109400     ELSE
109500          GO TO CC--FAIL-GF-24.
109600*    NOTE     BOTH CONDITIONS ARE TRUE.
109700     GO TO CC--WRITE-GF-24.
109800 CC--DELETE-GF-24.
109900     PERFORM  DE-LETE.
110000     GO TO CC--WRITE-GF-24.
110100 CC--FAIL-GF-24.
110200     PERFORM FAIL.
110300 CC--WRITE-GF-24.
110400     PERFORM PRINT-DETAIL.
110500*
110600 CC--INIT-GF-25.
110700     MOVE   "VI-89 6.15.3/4" TO ANSI-REFERENCE.
110800     MOVE     "CC--TEST-GF-25" TO PAR-NAME.
110900     MOVE     "0" TO WRK-XN-00001.
111000     MOVE     0 TO WRK-DS-01V00.
111100 CC--TEST-GF-25.
111200     IF   WRK-XN-00001 EQUAL TO "0"
111300          AND
111400          WRK-DS-01V00 EQUAL TO 0
111500          PERFORM PASS
111600     ELSE
111700          GO TO CC--FAIL-GF-25.
111800*    NOTE     BOTH CONDITIONS ARE TRUE.
111900     GO TO CC--WRITE-GF-25.
112000 CC--DELETE-GF-25.
112100     PERFORM  DE-LETE.
112200     GO TO CC--WRITE-GF-25.
112300 CC--FAIL-GF-25.
112400     PERFORM FAIL.
112500 CC--WRITE-GF-25.
112600     PERFORM  PRINT-DETAIL.
112700*
112800 CC--INIT-GF-26.
112900     MOVE     "CC--TEST-GF-26" TO PAR-NAME.
113000     MOVE     "VI-89 6.15.3/4" TO ANSI-REFERENCE.
113100     MOVE     "  NOT ABBR, W/PARENS" TO FEATURE.
113200     MOVE     SPACE TO IF-TABLE.
113300     MOVE     ZERO TO WRK-DS-01V00.
113400     MOVE     ZERO TO WRK-XN-00001.
113500     PERFORM  CC--TEST-GF-26.
113600     MOVE     "X" TO IF-ELEM (5).
113700 CC--TEST-GF-26.
113800     IF (WRK-DS-01V00 IS EQUAL TO 0
113900                    OR
114000         WRK-XN-00001 EQUAL TO "0")
114100                    AND
114200         SPACE IS EQUAL TO IF-TABLE
114300          MOVE "1" TO IF-ELEM (1)
114400     ELSE
114500          MOVE "1" TO IF-ELEM (3).
114600*    NOTE     ALL CONDITIONS ARE TRUE THE FIRST TIME, THEN THE
114700*             FIRST TWO ARE TRUE THE SECOND TIME.
114800 CC--TEST-GF-26-1.
114900     IF       IF-TABLE EQUAL TO "1 1 X"
115000              PERFORM PASS GO TO CC--WRITE-GF-26.
115100     GO       TO CC--FAIL-GF-26.
115200 CC--DELETE-GF-26.
115300     PERFORM  DE-LETE.
115400     GO       TO CC--WRITE-GF-26.
115500 CC--FAIL-GF-26.
115600     MOVE     IF-TABLE TO COMPUTED-A.
115700     MOVE     "1 1 X" TO CORRECT-A.
115800     PERFORM FAIL.
115900 CC--WRITE-GF-26.
116000     PERFORM  PRINT-DETAIL.
116100*
116200 CC--INIT-GF-27.
116300     MOVE     "CC--TEST-GF-27" TO PAR-NAME.
116400     MOVE     "VI-89 6.15.3/4" TO ANSI-REFERENCE.
116500     MOVE     "  NOT ABBR, W/PARENS" TO FEATURE.
116600     MOVE     SPACE TO IF-TABLE.
116700     MOVE     ZERO TO WRK-DS-01V00.
116800     MOVE     ZERO TO WRK-XN-00001.
116900     PERFORM  CC--TEST-GF-27.
117000     MOVE     "X" TO IF-ELEM (5).
117100 CC--TEST-GF-27.
117200     IF   NOT (WRK-DS-01V00 IS EQUAL TO 0
117300                         AND
117400               WRK-XN-00001 IS EQUAL TO "0")
117500                     OR
117600          SPACE IS EQUAL TO IF-TABLE
117700          MOVE "1" TO IF-ELEM (1)
117800     ELSE
117900          MOVE "1" TO IF-ELEM (3).
118000*    NOTE     THE FIRST PART IS ALWAYS FALSE, AND THE PORTION
118100*             AFTER THE "OR" IS FIRST TRUE, THEN FALSE.
118200 CC--TEST-GF-27-1.
118300     IF   IF-TABLE EQUAL TO "1 1 X"
118400          PERFORM PASS GO TO CC--WRITE-GF-27.
118500     GO TO CC--FAIL-GF-27.
118600 CC--DELETE-GF-27.
118700     PERFORM  DE-LETE.
118800     GO       TO CC--WRITE-GF-27.
118900 CC--FAIL-GF-27.
119000     MOVE     IF-TABLE TO COMPUTED-A.
119100     MOVE     "1 1 X" TO CORRECT-A.
119200     PERFORM FAIL.
119300 CC--WRITE-GF-27.
119400     PERFORM  PRINT-DETAIL.
119500*
119600 CC--INIT-GF-28.
119700     MOVE     "CC--TEST-GF-28" TO PAR-NAME.
119800     MOVE     "VI-89 6.15.3/4" TO ANSI-REFERENCE.
119900     MOVE     "  ABBREVIATED       " TO FEATURE.
120000     MOVE     ZERO TO IF-TABLE
120100     MOVE     ZERO TO WRK-XN-00001.
120200     MOVE     1 TO XX-TALLY.
120300     PERFORM  CC--TEST-GF-28.
120400     MOVE     "X" TO IF-ELEM (5).
120500 CC--TEST-GF-28.
120600     IF   WRK-XN-00001 = "0" OR = "1" OR = IF-TABLE
120700          AND = IF-ELEM (5)
120800          MOVE "1" TO IF-ELEM (XX-TALLY)
120900          ADD 1 TO XX-TALLY
121000     ELSE
121100          MOVE "2" TO IF-ELEM (XX-TALLY)
121200          ADD 1 TO XX-TALLY.
121300 CC--TEST-GF-28-1.
121400     IF IF-TABLE EQUAL TO "1100X0000000"
121500          PERFORM PASS GO TO CC--WRITE-GF-28.
121600     GO TO CC--FAIL-GF-28.
121700 CC--DELETE-GF-28.
121800     PERFORM  DE-LETE.
121900     GO       TO CC--WRITE-GF-28.
122000 CC--FAIL-GF-28.
122100     MOVE     IF-TABLE TO COMPUTED-A.
122200     MOVE     "1100X0000000" TO CORRECT-A.
122300     PERFORM  FAIL.
122400 CC--WRITE-GF-28.
122500     PERFORM  PRINT-DETAIL.
122600*
122700 CC--INIT-GF-29.
122800     MOVE     "CC--TEST-GF-29" TO PAR-NAME.
122900     MOVE     "VI-89 6.15.3/4" TO ANSI-REFERENCE.
123000     MOVE     ZERO TO IF-TABLE.
123100     MOVE     ZERO TO WRK-XN-00001.
123200     MOVE     1 TO XX-TALLY.
123300     PERFORM  CC--TEST-GF-29.
123400     MOVE     "X" TO WRK-XN-00001.
123500 CC--TEST-GF-29.
123600     IF  WRK-XN-00001 = "0" OR "1" OR "2" OR IF-TABLE OR "3"
123700         MOVE "1" TO IF-ELEM (XX-TALLY)
123800         ADD 1 TO XX-TALLY
123900     ELSE
124000         MOVE "2" TO IF-ELEM (XX-TALLY)
124100         ADD 1 TO XX-TALLY.
124200 CC--TEST-GF-29-1.
124300     IF IF-TABLE EQUAL TO "120000000000"
124400         PERFORM PASS GO TO CC--WRITE-GF-29.
124500     GO TO CC--FAIL-GF-29.
124600 CC--DELETE-GF-29.
124700     PERFORM  DE-LETE.
124800     GO       TO CC--WRITE-GF-29.
124900 CC--FAIL-GF-29.
125000     MOVE     IF-TABLE TO COMPUTED-A.
125100     MOVE     "120000000000" TO CORRECT-A.
125200     PERFORM  FAIL.
125300 CC--WRITE-GF-29.
125400     PERFORM  PRINT-DETAIL.
125500*
125600 CC--INIT-GF-30.
125700     MOVE "CC--TEST-GF-30"  TO PAR-NAME.
125800     MOVE "VI-89 6.15.3/4"  TO ANSI-REFERENCE.
125900     MOVE "  LOGICAL *NOT*" TO FEATURE.
126000     MOVE "AAAAA"           TO AZE.
126100     MOVE -2                TO MINUS-TWO.
126200     MOVE  2                TO TWO.
126300 CC--TEST-GF-30.
126400     IF  NOT AZE < "AAAAA"
126500               AND
126600         MINUS-TWO < TWO
126700          PERFORM PASS
126800     ELSE
126900          GO TO CC--FAIL-GF-30.
127000*        NOTE CC--TEST-GF-30 TESTS LOGICAL "NOT" PLUS "AND" ---
127100*             FIRST LINE TRUE,
127200*             SECOND LINE TRUE.
127300     GO TO CC--WRITE-GF-30.
127400 CC--DELETE-GF-30.
127500     PERFORM  DE-LETE.
127600     GO TO CC--WRITE-GF-30.
127700 CC--FAIL-GF-30.
127800     PERFORM FAIL.
127900 CC--WRITE-GF-30.
128000     PERFORM  PRINT-DETAIL.
128100*
128200 CC--INIT-GF-31.
128300     MOVE     "CC--TEST-GF-31" TO PAR-NAME.
128400     MOVE "VI-89 6.15.3/4"  TO ANSI-REFERENCE.
128500     MOVE 10  TO TEN.
128600     MOVE  3  TO THREE.
128700 CC--TEST-GF-31.
128800     IF NOT TEN = 10.00000000
128900               OR
129000          THREE = TEN
129100          GO TO CC--FAIL-GF-31
129200     ELSE
129300          PERFORM PASS.
129400*        NOTE CC--TEST-GF-31 TESTS LOGICAL "NOT" PLUS "OR" ---
129500*             FIRST LINE FALSE,
129600*             SECOND LINE FALSE.
129700     GO TO CC--WRITE-GF-31.
129800 CC--DELETE-GF-31.
129900     PERFORM  DE-LETE.
130000     GO TO CC--WRITE-GF-31.
130100 CC--FAIL-GF-31.
130200     PERFORM FAIL.
130300 CC--WRITE-GF-31.
130400     PERFORM  PRINT-DETAIL.
130500*
130600 CC--INIT-GF-32.
130700     MOVE  "CC--TEST-GF-32" TO PAR-NAME.
130800     MOVE "VI-89 6.15.3/4"  TO ANSI-REFERENCE.
130900     MOVE  0                TO NAUGHT.
131000     MOVE  3                TO THREE.
131100     MOVE  6                TO SIX.
131200 CC--TEST-GF-32.
131300     IF      NOT (NAUGHT > THREE
131400                        OR
131500                  NAUGHT < ZERO)
131600                    AND
131700             6.00000000000000001 NOT EQUAL TO SIX
131800          PERFORM PASS
131900     ELSE
132000          GO TO CC--FAIL-GF-32.
132100*        NOTE CC--TEST-GF-32 TESTS LOGICAL "NOT" OF PARENTHESIZED
132200*             CONDITION PLUS "AND" ---
132300*             FIRST LINE (WITHIN PARENTHESES) FALSE
132400*             SECOND LINE (WITHIN PARENTHESES) FALSE
132500*             FIRST PLUS SECOND LINE (WITHIN PARENS) FALSE
132600*             FIRST PLUS SECOND LINE TRUE
132700*             THIRD LINE TRUE.
132800     GO TO CC--WRITE-GF-32.
132900 CC--DELETE-GF-32.
133000     PERFORM  DE-LETE.
133100     GO TO CC--WRITE-GF-32.
133200 CC--FAIL-GF-32.
133300     PERFORM FAIL.
133400 CC--WRITE-GF-32.
133500     PERFORM  PRINT-DETAIL.
133600*
133700 CC--INIT-GF-33.
133800     MOVE "CC--TEST-GF-33"     TO PAR-NAME.
133900     MOVE "VI-89 6.15.3/4"     TO ANSI-REFERENCE.
134000     MOVE +.333333333333333333 TO ONE-THIRD.
134100     MOVE "AAAAA"              TO AZE.
134200     MOVE "CCCCC"              TO CEEZE.
134300 CC--TEST-GF-33.
134400     IF      ( .3703703333 ) EQUAL TO ONE-THIRD
134500          AND NOT AZE EQUAL TO CEEZE
134600              GO TO CC--FAIL-GF-33
134700     ELSE
134800              PERFORM PASS.
134900*       NOTE CC--TEST-GF-33 TESTS LOGICAL "NOT" FOLLOWING AN "AND"
135000*             FIRST LINE FALSE,
135100*             SECOND LINE TRUE.
135200     GO       TO CC--WRITE-GF-33.
135300 CC--DELETE-GF-33.
135400     PERFORM DE-LETE.
135500     GO TO CC--WRITE-GF-33.
135600 CC--FAIL-GF-33.
135700     PERFORM FAIL.
135800 CC--WRITE-GF-33.
135900     PERFORM  PRINT-DETAIL.
136000*
136100 CC--INIT-GF-34.
136200     MOVE "CC--TEST-GF-34" TO PAR-NAME.
136300     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
136400     MOVE 11  TO CCON-1.
136500     MOVE 12  TO CCON-2.
136600     MOVE 13  TO CCON-3.
136700     MOVE 14  TO CCON-4.
136800 CC--TEST-GF-34.
136900     IF NOT (CCON-4 NOT GREATER THAN CCON-2  AND CCON-3
137000              AND NOT CCON-1)
137100           PERFORM PASS
137200     ELSE
137300           GO TO CC--FAIL-GF-34.
137400*
137500*    NOTE     THE ABOVE STATEMENT TESTS THE USE OF A COMPLEX
137600*             CONDITION  WITH  COMBINATIONS  OF LOGICAL OPERATORS
137700*             ABREVIATED RELATIONAL OPERATORS AND  OMITTED
137800*             CONDITION SUBJECTS.
137900*             THE EXPANDED EQUIVALENT OF THIS STATEMENT IS -
138000*               "NOT  (((CCON-4 NOT > CCON-2) AND (CCON-4 NOT >
138100*                    CCON-3)) AND (NOT (CCON-4 NOT > CCON-1)))"
138200     GO TO CC--WRITE-GF-34.
138300 CC--DELETE-GF-34.
138400     PERFORM  DE-LETE.
138500     GO TO CC--WRITE-GF-34.
138600 CC--FAIL-GF-34.
138700     PERFORM FAIL.
138800 CC--WRITE-GF-34.
138900     PERFORM  PRINT-DETAIL.
139000*
139100 CC--INIT-GF-35.
139200     MOVE "CC--TEST-GF-35" TO PAR-NAME.
139300     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
139400     MOVE -1            TO MINUS-ONE.
139500     MOVE  +.4285714286 TO THREE-SEVENTHS.
139600     MOVE  1            TO ONE.
139700     MOVE  2            TO TWO.
139800     MOVE +2            TO DOS.
139900     MOVE  5            TO FIVE.
140000 CC--TEST-GF-35.
140100     IF           TWO > DOS
140200                     OR
140300               NOT ( THREE-SEVENTHS ) EQUAL TO FIVE
140400                     AND
140500                MINUS-ONE = ONE
140600          GO TO CC--FAIL-GF-35
140700     ELSE
140800          PERFORM PASS.
140900*        NOTE CC--TEST-GF-35 TESTS LOGICAL "NOT" WHICH FOLLOWS AN
141000*             "OR" AND PRECEDES AN "AND" ---
141100*             FIRST LINE FALSE
141200*             SECOND LINE TRUE
141300*             THIRD LINE FALSE.
141400     GO TO CC--WRITE-GF-35.
141500 CC--DELETE-GF-35.
141600     PERFORM  DE-LETE.
141700     GO TO CC--WRITE-GF-35.
141800 CC--FAIL-GF-35.
141900     PERFORM FAIL.
142000 CC--WRITE-GF-35.
142100     PERFORM  PRINT-DETAIL.
142200*
142300 CC--INIT-GF-36.
142400     MOVE "CC--TEST-GF-36" TO PAR-NAME.
142500     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
142600     MOVE "AAAAA" TO AZE.
142700     MOVE "BBBBB" TO BEEZE.
142800     MOVE  5      TO FIVE.
142900 CC--TEST-GF-36.
143000     IF           AZE = BEEZE
143100           OR NOT (5 > FIVE       AND
143200              NOT  5 > FIVE)
143300          PERFORM PASS
143400     ELSE
143500          GO TO CC--FAIL-GF-36.
143600*        NOTE CC--TEST-GF-36 TESTS LOGICAL "NOT" WHICH FOLLOWS AN
143700*             "OR" AND PRECEDES A PARENTHESIZED CONDITION ---
143800*             FIRST LINE FALSE,
143900*             SECOND LINE (WITHIN PARENS) FALSE
144000*             THIRD LINE (WITHIN PARENS) TRUE
144100*             SECOND PLUS THIRD LINE (WITHIN PARENS) FALSE
144200*             SECOND PLUS THIRD LINE TRUE.
144300     GO TO CC--WRITE-GF-36.
144400 CC--DELETE-GF-36.
144500     PERFORM  DE-LETE.
144600     GO TO CC--WRITE-GF-36.
144700 CC--FAIL-GF-36.
144800     PERFORM FAIL.
144900 CC--WRITE-GF-36.
145000     PERFORM  PRINT-DETAIL.
145100*
145200 CC--INIT-GF-37.
145300     MOVE "CC--TEST-GF-37" TO PAR-NAME.
145400     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
145500     MOVE  0 TO NAUGHT.
145600     MOVE  1 TO ONE.
145700     MOVE +1 TO UNO.
145800     MOVE  2 TO TWO.
145900     MOVE +2 TO DOS.
146000 CC--TEST-GF-37.
146100     IF          ((NAUGHT EQUAL TO ONE)
146200           OR (NOT ((UNO = ONE)         OR
146300                    (TWO = DOS))))
146400         GO TO CC--FAIL-GF-37
146500     ELSE
146600         PERFORM PASS.
146700*        NOTE CC--TEST-GF-37 TESTS LOGICAL "NOT" THAT IS CONTAINED
146800*             PARENTHESES AND WHICH PRECEDES A PARENTHESIZED
146900*             CONDITION ---
147000*             FIRST LINE (IN INNER PARENS) FALSE
147100*             SECOND LINE (IN INNER PARENS) TRUE
147200*             THIRD LINE (IN INNER PARENS) FALSE
147300*             SECOND PLUS THIRD LINE (IN MIDDLE PARENS) TRUE
147400*             SECOND PLUS THIRD LINE (IN OUTER PARENS) FALSE
147500*             PARENS AROUND ENTIRE CONDITION ARE REDUNDANT.
147600     GO TO CC--WRITE-GF-37.
147700 CC--DELETE-GF-37.
147800     PERFORM  DE-LETE.
147900     GO TO CC--WRITE-GF-37.
148000 CC--FAIL-GF-37.
148100     PERFORM  FAIL.
148200 CC--WRITE-GF-37.
148300     PERFORM  PRINT-DETAIL.
148400*
148500 CC--INIT-GF-38.
148600     MOVE "CC--TEST-GF-38" TO PAR-NAME.
148700     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
148800     MOVE "AAAAA" TO AZE.
148900     MOVE  1      TO ONE.
149000     MOVE  2      TO TWO.
149100     MOVE  3      TO THREE.
149200 CC--TEST-GF-38.
149300     IF       NOT AZE LESS THAN ONE      AND
149400              NOT ONE < AZE
149500           OR           TWO              AND
149600              NOT THREE LESS THAN TWO
149700         PERFORM PASS
149800     ELSE
149900         GO TO CC--FAIL-GF-38.
150000*        NOTE CC--TEST-GF-38 TESTS LOGICAL "NOT" FOLLOWING "AND" A
150100*             IN COMBINATION WITH AN ABBREVIATION ---
150200*             EITHER FIRST LINE OR SECOND LINE MUST BE FALSE,
150300*             THEREFORE,
150400*             FIRST PLUS SECOND LINES FALSE
150500*             ABBREVIATED THIRD LINE TRUE
150600*             FOURTH LINE TRUE
150700*             THIRD PLUS FOURTH LINES TRUE.
150800     GO TO CC--WRITE-GF-38.
150900 CC--DELETE-GF-38.
151000     PERFORM  DE-LETE.
151100     GO TO CC--WRITE-GF-38.
151200 CC--FAIL-GF-38.
151300     PERFORM  FAIL.
151400 CC--WRITE-GF-38.
151500     PERFORM  PRINT-DETAIL.
151600*
151700 CC--INIT-GF-39.
151800     MOVE "CC--TEST-GF-39" TO PAR-NAME.
151900     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
152000     MOVE "  SIGN CONDITIONS" TO FEATURE.
152100     MOVE 0 TO SIGN-1.
152200     MOVE 0 TO SIGN-2.
152300     MOVE 9 TO SIGN-3.
152400 CC--TEST-GF-39.
152500     IF       NOT (SIGN-1 POSITIVE      OR
152600                   SIGN-2 NEGATIVE)
152700          AND     SIGN-3 NOT ZERO
152800         PERFORM PASS
152900     ELSE
153000         GO TO CC--FAIL-GF-39.
153100*        NOTE CC--TEST-GF-39 TESTS SIGN CONDITIONS WITH SEVERAL TY
153200*             OF LOGICAL CONNECTORS INCLUDING PARENTHESES ---
153300*             FIRST LINE FALSE
153400*             SECOND LINE FALSE
153500*             FIRST PLUS SECOND LINES (WITHIN PARENS) FALSE
153600*             FIRST PLUS SECOND LINES TRUE
153700*             THIRD LINE TRUE.
153800     GO TO CC--WRITE-GF-39.
153900 CC--DELETE-GF-39.
154000     PERFORM  DE-LETE.
154100     GO TO CC--WRITE-GF-39.
154200 CC--FAIL-GF-39.
154300     PERFORM  FAIL.
154400 CC--WRITE-GF-39.
154500     PERFORM  PRINT-DETAIL.
154600*
154700 CC--INIT-GF-40.
154800     MOVE "CC--TEST-GF-40" TO PAR-NAME.
154900     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
155000     MOVE "  SIGN CONDITIONS" TO FEATURE.
155100     MOVE -5 TO SIGN-1.
155200     MOVE -1 TO SIGN-2.
155300     MOVE  0 TO SIGN-3.
155400 CC--TEST-GF-40.
155500     IF           SIGN-1 IS POSITIVE
155600           OR NOT SIGN-2 IS NEGATIVE
155700          AND     SIGN-3 IS ZERO
155800         GO TO CC--FAIL-GF-40
155900     ELSE
156000         PERFORM PASS.
156100*        NOTE CC--TEST-GF-40 TESTS SIGN CONDITIONS WITH SEVERAL TY
156200*             OF LOGICAL CONNECTORS BUT NO PARENTHESES ---
156300*             FIRST LINE FALSE
156400*             SECOND LINE FALSE
156500*             THIRD LINE TRUE.
156600     GO TO CC--WRITE-GF-40.
156700 CC--DELETE-GF-40.
156800     PERFORM  DE-LETE.
156900     GO TO CC--WRITE-GF-40.
157000 CC--FAIL-GF-40.
157100     PERFORM  FAIL.
157200 CC--WRITE-GF-40.
157300     PERFORM  PRINT-DETAIL.
157400*
157500 CC--INIT-GF-41.
157600     MOVE "CC--TEST-GF-41" TO PAR-NAME.
157700     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
157800     MOVE "  CLASS CONDITIONS" TO FEATURE.
157900     MOVE SPACE TO CLASS-1.
158000     MOVE ZERO  TO CLASS-2.
158100     MOVE ZERO  TO CLASS-3.
158200 CC--TEST-GF-41.
158300     IF       NOT (CLASS-1 NUMERIC      OR
158400                   CLASS-2 ALPHABETIC)
158500          AND     CLASS-3 NOT NUMERIC
158600         GO TO CC--FAIL-GF-41
158700     ELSE
158800         PERFORM PASS.
158900*        NOTE CC--TEST-GF-41 TESTS CLASS CONDITIONS WITH SEVERAL
159000*             TYPES OF LOGICAL CONNECTORS INCLUDING PARENTHESES --
159100*             FIRST LINE FALSE
159200*             SECOND LINE FALSE
159300*             FIRST PLUS SECOND LINES (WITHIN PARENS) FALSE
159400*             FIRST PLUS SECOND LINES TRUE
159500*             THIRD LINE FALSE.
159600     GO TO CC--WRITE-GF-41.
159700 CC--DELETE-GF-41.
159800     PERFORM  DE-LETE.
159900     GO TO CC--WRITE-GF-41.
160000 CC--FAIL-GF-41.
160100     PERFORM  FAIL.
160200 CC--WRITE-GF-41.
160300     PERFORM  PRINT-DETAIL.
160400*
160500 CC--INIT-GF-42.
160600     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
160700     MOVE "  CLASS CONDITIONS" TO FEATURE.
160800     MOVE "CC--TEST-GF-42" TO PAR-NAME.
160900     MOVE 12345 TO CLASS-1.
161000     MOVE 12345 TO CLASS-2.
161100     MOVE 12345 TO CLASS-3.
161200 CC--TEST-GF-42.
161300     IF           CLASS-1 NUMERIC
161400           OR NOT CLASS-2 ALPHABETIC
161500          AND     CLASS-3 NUMERIC
161600         PERFORM PASS
161700     ELSE
161800         GO TO CC--FAIL-GF-42.
161900*        NOTE CC--TEST-GF-42 TESTS CLASS CONDITIONS WITH SEVERAL
162000*             TYPES OF LOGICAL CONNECTORS BUT NO PARENTHESES ---
162100*             FIRST LINE TRUE
162200*             SECOND LINE TRUE
162300*             THIRD LINE TRUE.
162400     GO TO CC--WRITE-GF-42.
162500 CC--DELETE-GF-42.
162600     PERFORM  DE-LETE.
162700     GO TO CC--WRITE-GF-42.
162800 CC--FAIL-GF-42.
162900     PERFORM  FAIL.
163000 CC--WRITE-GF-42.
163100     PERFORM  PRINT-DETAIL.
163200*
163300 CC--INIT-GF-43.
163400     MOVE "CC--TEST-GF-43" TO PAR-NAME.
163500     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
163600     MOVE "  SWITCH CONDITIONS" TO FEATURE.
163700 CC--TEST-GF-43.
163800     IF       NOT (ON-WRK-SWITCH-1       OR
163900                   OFF-WRK-SWITCH-2)
164000          AND NOT OFF-WRK-SWITCH-1
164100         GO TO CC--FAIL-GF-43
164200     ELSE
164300         PERFORM PASS.
164400*    NOTE ***     ***   *** IF SWITCHES ARE NOT IMPLEMENTED
164500*        THE CONDITION-NAMES WILL AUTOMATICALLY BE ASSIGNED TO AN
164600*        01 IN WORKING-STORAGE THEREBY SATISFYING THE TEST.
164700*        NOTE CC--TEST-GF-43 TESTS SWITCH-STATUS CONDITIONS WITH
164800*             SEVERAL TYPES OF LOGICAL CONNECTORS INCLUDING
164900*             PARENTHESES ---
165000*             FIRST LINE TRUE
165100*             SECOND LINE TRUE
165200*             FIRST PLUS SECOND LINES (WITHIN PARENS) TRUE
165300*             FIRST PLUS SECOND LINES FALSE
165400*             THIRD LINE TRUE.
165500     GO TO CC--WRITE-GF-43.
165600 CC--DELETE-GF-43.
165700     PERFORM  DE-LETE.
165800     GO TO CC--WRITE-GF-43.
165900 CC--FAIL-GF-43.
166000     PERFORM  FAIL.
166100 CC--WRITE-GF-43.
166200     PERFORM  PRINT-DETAIL.
166300*
166400 CC--INIT-GF-44.
166500     MOVE "CC--TEST-GF-44" TO PAR-NAME.
166600     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
166700     MOVE "  SWITCH CONDITIONS" TO FEATURE.
166800 CC--TEST-GF-44.
166900     IF           ON-WRK-SWITCH-1
167000           OR NOT OFF-WRK-SWITCH-2
167100          AND     OFF-WRK-SWITCH-1
167200         PERFORM PASS
167300     ELSE
167400         GO TO CC--FAIL-GF-44.
167500*        NOTE CC--TEST-GF-44 TESTS SWITCH-STATUS CONDITIONS WITH
167600*             SEVERAL TYPES OF LOGICAL CONNECTORS BUT WITHOUT
167700*             PARENTHESES ---
167800*             FIRST LINE TRUE
167900*             SECOND LINE FALSE
168000*             THIRD LINE FALSE.
168100     GO TO CC--WRITE-GF-44.
168200 CC--DELETE-GF-44.
168300     PERFORM  DE-LETE.
168400     GO TO CC--WRITE-GF-44.
168500 CC--FAIL-GF-44.
168600     PERFORM  FAIL.
168700 CC--WRITE-GF-44.
168800     PERFORM  PRINT-DETAIL.
168900*
169000 CC--INIT-GF-45.
169100     MOVE "CC--TEST-GF-45" TO PAR-NAME.
169200     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
169300     MOVE "  CONDITION-NAMES" TO FEATURE.
169400     MOVE "AA" TO AA.
169500     MOVE "CD" TO BB.
169600     MOVE "C"  TO AAA.
169700 CC--TEST-GF-45.
169800     IF       NOT (A1     OR
169900                   B1)
170000          AND NOT AA1
170100         GO TO CC--FAIL-GF-45
170200     ELSE
170300         PERFORM PASS.
170400*        NOTE CC--TEST-GF-45 TESTS CONDITION-NAME CONDITIONS WITH
170500*             SEVERAL TYPES OF LOGICAL CONNECTORS INCLUDING
170600*             PARENTHESES ---
170700*             FIRST LINE TRUE
170800*             SECOND LINE FALSE
170900*             FIRST PLUS SECOND LINE (WITHIN PARENS) TRUE
171000*             FIRST PLUS SECOND LINE FALSE
171100*             THIRD LINE TRUE.
171200     GO TO CC--WRITE-GF-45.
171300 CC--DELETE-GF-45.
171400     PERFORM  DE-LETE.
171500     GO TO CC--WRITE-GF-45.
171600 CC--FAIL-GF-45.
171700     PERFORM  FAIL.
171800 CC--WRITE-GF-45.
171900     PERFORM  PRINT-DETAIL.
172000*
172100 CC--INIT-GF-46.
172200     MOVE "CC--TEST-GF-46" TO PAR-NAME.
172300     MOVE "VI-89 6.15.3/4" TO ANSI-REFERENCE.
172400     MOVE "  CONDITION-NAMES" TO FEATURE.
172500     MOVE     "AB" TO AA.
172600     MOVE     "CD" TO BB.
172700     MOVE     "A" TO AAA.
172800 CC--TEST-GF-46.
172900     IF           A1
173000           OR NOT B1
173100          AND     AA1
173200         PERFORM PASS
173300     ELSE
173400         GO TO CC--FAIL-GF-46.
173500*        NOTE CC--TEST-GF-46 TESTS CONDITION-NAME CONDITIONS WITH
173600*             SEVERAL TYPES OF LOGICAL CONNECTORS BUT NO
173700*             PARENTHESES ---
173800*             FIRST LINE FALSE
173900*             SECOND LINE TRUE
174000*             THIRD LINE TRUE.
174100     GO TO CC--WRITE-GF-46.
174200 CC--DELETE-GF-46.
174300     PERFORM  DE-LETE.
174400     GO TO CC--WRITE-GF-46.
174500 CC--FAIL-GF-46.
174600     PERFORM  FAIL.
174700 CC--WRITE-GF-46.
174800     PERFORM  PRINT-DETAIL.
174900*  PAUL WOZ UPTO HERE.
175000 CC--INIT-GF-47.
175100     MOVE     "  MIXED CONDITIONS" TO FEATURE.
175200     MOVE     -1 TO IF-D32.
175300     MOVE     "ABCD4" TO CLASS-1.
175400     MOVE     -1 TO SIGN-1.
175500 CC--TEST-GF-47.
175600*    NOTE IF SWITCHES ARE NOT IMPLEMENTED SWITCH-1 WILL
175700*        BE AUTOMATICALLY TURNED ON TO FULFILL THE REQUIREMENTS
175800*        OF THIS TEST.
175900     IF       NOT TWO > THREE
176000          AND NOT (ON-WRK-SWITCH-1              AND
176100                   F                        OR
176200                   CLASS-1 ALPHABETIC)
176300           OR     TWO = THREE
176400          AND     SIGN-1 ZERO
176500              PERFORM PASS ELSE PERFORM FAIL.
176600*        NOTE CC--TEST-GF-47 TESTS A COMPOUND CONDITION WHICH
176700*             CONTAINS ALL OF THE TYPES OF SIMPLE CONDITIONS AND
176800*             SEVERAL TYPES OF LOGICAL CONNECTORS ---
176900*             FIRST LINE TRUE
177000*             SECOND LINE TRUE
177100*             THIRD LINE FALSE
177200*             FOURTH LINE FALSE
177300*             SECOND THRU FOURTH LINES (WITHIN PARENS) FALSE
177400*             SECOND THRU FOURTH LINES TRUE
177500*             FIRST THRU FOURTH LINES TRUE
177600*             FIFTH LINE FALSE
177700*             SIXTH LINE FALSE
177800*             FIFTH THRU SIXTH LINES FALSE.
177900     GO       TO CC--WRITE-GF-47.
178000 CC--DELETE-GF-47.
178100     PERFORM  DE-LETE.
178200 CC--WRITE-GF-47.
178300     MOVE     "CC--TEST-GF-47" TO PAR-NAME.
178400     PERFORM  PRINT-DETAIL.
178500 CC--TEST-GF-48.
178600     MOVE     +9 TO SIGN-1.
178700     MOVE     -5 TO SIGN-2.
178800     MOVE     "+1234" TO CLASS-1.
178900     MOVE     1235 TO IF-D32.
179000*    NOTE IF SWITCHES ARE NOT IMPLEMENTED SWITCH-1 WILL BE
179100*        AUTOMATICALLY TURNED ON TO FULFILL THE REQUIREMENTS
179200*        OF THIS TEST.
179300     IF      FOUR GREATER THAN 2.5
179400          AND          EQUAL TO QUATROS
179500          AND     (FOUR     = TEN      OR
179600                        NOT < TEN      OR
179700                   SIGN-1 POSITIVE     AND
179800                   (SIGN-2 NOT NEGATIVE          OR
179900                    CLASS-1 NOT NUMERIC))
180000          AND NOT OFF-WRK-SWITCH-1
180100           OR     E
180200          AND     F
180300           OR NOT G
180400              PERFORM PASS ELSE PERFORM FAIL.
180500*        NOTE CC--TEST-GF-48 TESTS A COMPOUND CONDITION WHICH
180600*             CONTAINS ALL OF THE TYPES OF SIMPLE CONDITIONS AND
180700*             SEVERAL TYPES OF LOGICAL CONNECTORS ---
180800*         *   FIRST LINE TRUE
180900*         *   SECOND ABBREVIATED LINE TRUE
181000*             THIRD LINE FALSE
181100*             FOURTH LINE FALSE
181200*             FIFTH LINE TRUE
181300*             SIXTH LINE FALSE
181400*             SEVENTH LINE TRUE
181500*             SIXTH PLUS SEVENTH LINES TRUE
181600*         *   THIRD THRU SEVENTH LINES TRUE
181700*         *   EIGHTH LINE TRUE
181800*        **   FIRST THRU EIGHTH LINES TRUE
181900*             NINTH LINE FALSE
182000*             TENTH LINE TRUE
182100*        **   NINTH PLUS TENTH LINES FALSE
182200*        **   ELEVENTH LINE FALSE.
182300     GO       TO CC--WRITE-GF-48.
182400 CC--DELETE-GF-48.
182500     PERFORM  DE-LETE.
182600 CC--WRITE-GF-48.
182700     MOVE     "CC--TEST-GF-48" TO PAR-NAME.
182800     PERFORM  PRINT-DETAIL.
182900 FIG-INIT-A.
183000     PERFORM END-ROUTINE.
183100     MOVE     "FIGURATIVE CONSTANTS" TO FEATURE.
183200 FIG-TEST-1.
183300     MOVE     SUB-GRP-FOR-2N058-A TO SUB-GRP-FOR-2N058-B.
183400     IF       SUB-SUB-BA EQUAL TO "000000   ABCABC"
183500              PERFORM PASS GO TO FIG-WRITE-1.
183600     GO       TO FIG-FAIL-1.
183700 FIG-DELETE-1.
183800     PERFORM  DE-LETE.
183900     GO       TO FIG-WRITE-1.
184000 FIG-FAIL-1.
184100     MOVE     SUB-SUB-BA TO COMPUTED-A.
184200     MOVE     "000000   ABCABC" TO CORRECT-A.
184300     PERFORM  FAIL.
184400 FIG-WRITE-1.
184500     MOVE     "FIG-TEST-1" TO PAR-NAME.
184600     PERFORM  PRINT-DETAIL.
184700 FIG-TEST-2.
184800     IF       SUB-SUB-BB EQUAL TO "ZZZ   000000"
184900              PERFORM PASS GO TO FIG-WRITE-2.
185000*    NOTE     THIS TEST DEPENDS UPON THE RESULT OF FIG-TEST-1.
185100     GO       TO FIG-FAIL-2.
185200 FIG-DELETE-2.
185300     PERFORM  DE-LETE.
185400     GO       TO FIG-WRITE-2.
185500 FIG-FAIL-2.
185600     MOVE     SUB-SUB-BB TO COMPUTED-A.
185700     MOVE     "ZZZ   000000" TO CORRECT-A.
185800     PERFORM  FAIL.
185900 FIG-WRITE-2.
186000     MOVE "FIG-TEST-2" TO PAR-NAME.
186100     PERFORM  PRINT-DETAIL.
186200 FIG-TEST-3.
186300     IF       ELEM-FOR-2N058-I OF SUB-SUB-BC NOT EQUAL TO QUOTE
186400              GO TO FIG-FAIL-3.
186500     IF ELEM-FOR-2N058-J OF SUB-SUB-BC NOT EQUAL TO QUOTE
186600              GO TO FIG-FAIL-3.
186700     IF ELEM-FOR-2N058-K OF SUB-SUB-BC NOT EQUAL TO HIGH-VALUE
186800              GO TO FIG-FAIL-3.
186900     IF ELEM-FOR-2N058-L OF SUB-SUB-BC NOT EQUAL TO LOW-VALUE
187000              GO TO FIG-FAIL-3.
187100     IF ELEM-FOR-2N058-M OF SUB-SUB-BC NOT EQUAL TO HIGH-VALUE
187200              GO TO FIG-FAIL-3.
187300     IF ELEM-FOR-2N058-N OF SUB-SUB-BC NOT EQUAL TO LOW-VALUE
187400              GO TO FIG-FAIL-3.
187500     PERFORM  PASS.
187600     GO       TO FIG-WRITE-3.
187700 FIG-DELETE-3.
187800     PERFORM  DE-LETE.
187900     GO       TO FIG-WRITE-3.
188000 FIG-FAIL-3.
188100     MOVE     SPACE TO FEATURE.
188200     MOVE     "6 QUOTES, 3 HIGH-VALUES," TO RE-MARK.
188300     PERFORM  PRINT-DETAIL.
188400     MOVE     "3 LOW-VALUES, 3 HIGH-VALUES" TO RE-MARK.
188500     PERFORM  PRINT-DETAIL.
188600     MOVE     "FIGURATIVE CONSTANTS" TO FEATURE.
188700     MOVE     SUB-SUB-BC TO COMPUTED-A.
188800     MOVE     "SEE REMARKS" TO CORRECT-A.
188900     MOVE     "3 LOW-VALUES" TO RE-MARK.
189000     PERFORM  FAIL.
189100 FIG-WRITE-3.
189200     MOVE     "FIG-TEST-3" TO PAR-NAME.
189300     PERFORM  PRINT-DETAIL.
189400 CCVS-EXIT SECTION.
189500 CCVS-999999.
189600     GO TO CLOSE-FILES.
