000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC214M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM NC214M TESTS FORMAT 2 OF THE "ACCEPT" STATEMENT.  *
002300*                                                              *
002400****************************************************************
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.
002800     XXXXX082.
002900 OBJECT-COMPUTER.
003000     XXXXX083
003100     PROGRAM COLLATING SEQUENCE IS N-A-T-I-V-E.
003200 SPECIAL-NAMES.
003300*
003400*
003500*    THE FOLLOWING IS THE ALPHABET FOR THE PROGRAM COLLATING
003600*    SEQUENCE CLAUSE.
003700*
003800     ALPHABET
003900     N-A-T-I-V-E IS NATIVE
004000*
004100*
004200*
004300*
004400     ALPHABET
004500     THE-ONE-CHARACTER-ALPHABET IS "Q" ALSO LOW-VALUE
004600                                       ALSO HIGH-VALUE
004700                                       ALSO QUOTE
004800                                       ALSO SPACES.
004900*
005000*
005100*    COLLATING-AND-ALPHABET-TEST-9     *****     TEST OF SYNTAX
005200*    ON THE PROGRAM COLLATING SEQUENCE CLAUSE AND ALPHABET-NAME
005300*    CLAUSES.
005400*
005500*
005600 INPUT-OUTPUT SECTION.
005700 FILE-CONTROL.
005800     SELECT PRINT-FILE ASSIGN TO
005900     XXXXX055.
006000 DATA DIVISION.
006100 FILE SECTION.
006200 FD  PRINT-FILE.
006300 01  PRINT-REC PICTURE X(120).
006400 01  DUMMY-RECORD PICTURE X(120).
006500 WORKING-STORAGE SECTION.
006600 01  WRK-DU-6V0-1 PIC 9(6) VALUE ZERO.
006700 01  WRK-DU-5V0-1 PIC 9(5) VALUE ZERO.
006800 01  WRK-DU-8V0-1 PIC 9(8) VALUE ZERO.
006900 01  WRK-XN-120-1 PIC X(120) VALUE
007000     """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
007100-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
007200-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
007300-    """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
007400-    "".
007500 01  WRK-DU-2V1-1 PIC 99V9 VALUE ZERO.
007600 01  WRK-DU-0V1-1 PIC V9 VALUE .1.
007700 01  WRK-DU-2V1-2 PIC 99V9 VALUE 0.1.
007800 01  WRK-DU-2V1-3  PIC 99V9  VALUE  11.1.
007900 01  WRK-DU-1V0-1 PIC 9 VALUE 9.
008000 01  WRK-DU-1V0-2 PIC 9 VALUE 2.
008100 01  WRK-DU-1V0-3 PIC 9 VALUE 3.
008200 01  WRK-DU-1V0-4 PIC 9 VALUE ZERO.
008300 01  WRK-DU-2V0-1 PIC 99 VALUE 10.
008400 01  WRK-DU-2V0-2 PIC 99 VALUE 11.
008500 01  WRK-DU-2V0-3 PIC 99 VALUE 12.
008600 01  COUNT-DU-6V0  PIC 9(6).
008700 01  TEST-RESULTS.
008800     02 FILLER                   PIC X      VALUE SPACE.
008900     02 FEATURE                  PIC X(20)  VALUE SPACE.
009000     02 FILLER                   PIC X      VALUE SPACE.
009100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
009200     02 FILLER                   PIC X      VALUE SPACE.
009300     02  PAR-NAME.
009400       03 FILLER                 PIC X(19)  VALUE SPACE.
009500       03  PARDOT-X              PIC X      VALUE SPACE.
009600       03 DOTVALUE               PIC 99     VALUE ZERO.
009700     02 FILLER                   PIC X(8)   VALUE SPACE.
009800     02 RE-MARK                  PIC X(61).
009900 01  TEST-COMPUTED.
010000     02 FILLER                   PIC X(30)  VALUE SPACE.
010100     02 FILLER                   PIC X(17)  VALUE
010200            "       COMPUTED=".
010300     02 COMPUTED-X.
010400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
010500     03 COMPUTED-N               REDEFINES COMPUTED-A
010600                                 PIC -9(9).9(9).
010700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
010800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
010900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
011000     03       CM-18V0 REDEFINES COMPUTED-A.
011100         04 COMPUTED-18V0                    PIC -9(18).
011200         04 FILLER                           PIC X.
011300     03 FILLER PIC X(50) VALUE SPACE.
011400 01  TEST-CORRECT.
011500     02 FILLER PIC X(30) VALUE SPACE.
011600     02 FILLER PIC X(17) VALUE "       CORRECT =".
011700     02 CORRECT-X.
011800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
011900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
012000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
012100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
012200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
012300     03      CR-18V0 REDEFINES CORRECT-A.
012400         04 CORRECT-18V0                     PIC -9(18).
012500         04 FILLER                           PIC X.
012600     03 FILLER PIC X(2) VALUE SPACE.
012700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012800 01  CCVS-C-1.
012900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
013000-    "SS  PARAGRAPH-NAME
013100-    "       REMARKS".
013200     02 FILLER                     PIC X(20)    VALUE SPACE.
013300 01  CCVS-C-2.
013400     02 FILLER                     PIC X        VALUE SPACE.
013500     02 FILLER                     PIC X(6)     VALUE "TESTED".
013600     02 FILLER                     PIC X(15)    VALUE SPACE.
013700     02 FILLER                     PIC X(4)     VALUE "FAIL".
013800     02 FILLER                     PIC X(94)    VALUE SPACE.
013900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
014000 01  REC-CT                        PIC 99       VALUE ZERO.
014100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
014200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
014300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
014400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
015000 01  CCVS-H-1.
015100     02  FILLER                    PIC X(39)    VALUE SPACES.
015200     02  FILLER                    PIC X(42)    VALUE
015300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
015400     02  FILLER                    PIC X(39)    VALUE SPACES.
015500 01  CCVS-H-2A.
015600   02  FILLER                        PIC X(40)  VALUE SPACE.
015700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015800   02  FILLER                        PIC XXXX   VALUE
015900     "4.2 ".
016000   02  FILLER                        PIC X(28)  VALUE
016100            " COPY - NOT FOR DISTRIBUTION".
016200   02  FILLER                        PIC X(41)  VALUE SPACE.
016300
016400 01  CCVS-H-2B.
016500   02  FILLER                        PIC X(15)  VALUE
016600            "TEST RESULT OF ".
016700   02  TEST-ID                       PIC X(9).
016800   02  FILLER                        PIC X(4)   VALUE
016900            " IN ".
017000   02  FILLER                        PIC X(12)  VALUE
017100     " HIGH       ".
017200   02  FILLER                        PIC X(22)  VALUE
017300            " LEVEL VALIDATION FOR ".
017400   02  FILLER                        PIC X(58)  VALUE
017500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017600 01  CCVS-H-3.
017700     02  FILLER                      PIC X(34)  VALUE
017800            " FOR OFFICIAL USE ONLY    ".
017900     02  FILLER                      PIC X(58)  VALUE
018000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
018100     02  FILLER                      PIC X(28)  VALUE
018200            "  COPYRIGHT   1985 ".
018300 01  CCVS-E-1.
018400     02 FILLER                       PIC X(52)  VALUE SPACE.
018500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018600     02 ID-AGAIN                     PIC X(9).
018700     02 FILLER                       PIC X(45)  VALUE SPACES.
018800 01  CCVS-E-2.
018900     02  FILLER                      PIC X(31)  VALUE SPACE.
019000     02  FILLER                      PIC X(21)  VALUE SPACE.
019100     02 CCVS-E-2-2.
019200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
019300         03 FILLER                   PIC X      VALUE SPACE.
019400         03 ENDER-DESC               PIC X(44)  VALUE
019500            "ERRORS ENCOUNTERED".
019600 01  CCVS-E-3.
019700     02  FILLER                      PIC X(22)  VALUE
019800            " FOR OFFICIAL USE ONLY".
019900     02  FILLER                      PIC X(12)  VALUE SPACE.
020000     02  FILLER                      PIC X(58)  VALUE
020100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020200     02  FILLER                      PIC X(13)  VALUE SPACE.
020300     02 FILLER                       PIC X(15)  VALUE
020400             " COPYRIGHT 1985".
020500 01  CCVS-E-4.
020600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020700     02 FILLER                       PIC X(4)   VALUE " OF ".
020800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020900     02 FILLER                       PIC X(40)  VALUE
021000      "  TESTS WERE EXECUTED SUCCESSFULLY".
021100 01  XXINFO.
021200     02 FILLER                       PIC X(19)  VALUE
021300            "*** INFORMATION ***".
021400     02 INFO-TEXT.
021500       04 FILLER                     PIC X(8)   VALUE SPACE.
021600       04 XXCOMPUTED                 PIC X(20).
021700       04 FILLER                     PIC X(5)   VALUE SPACE.
021800       04 XXCORRECT                  PIC X(20).
021900     02 INF-ANSI-REFERENCE           PIC X(48).
022000 01  HYPHEN-LINE.
022100     02 FILLER  PIC IS X VALUE IS SPACE.
022200     02 FILLER  PIC IS X(65)    VALUE IS "************************
022300-    "*****************************************".
022400     02 FILLER  PIC IS X(54)    VALUE IS "************************
022500-    "******************************".
022600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022700     "NC214M".
022800 PROCEDURE DIVISION.
022900 CCVS1 SECTION.
023000 OPEN-FILES.
023100     OPEN     OUTPUT PRINT-FILE.
023200     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
023300     MOVE    SPACE TO TEST-RESULTS.
023400     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023500     GO TO CCVS1-EXIT.
023600 CLOSE-FILES.
023700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023800 TERMINATE-CCVS.
023900S    EXIT PROGRAM.
024000STERMINATE-CALL.
024100     STOP     RUN.
024200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
024300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
024400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
024500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
024600     MOVE "****TEST DELETED****" TO RE-MARK.
024700 PRINT-DETAIL.
024800     IF REC-CT NOT EQUAL TO ZERO
024900             MOVE "." TO PARDOT-X
025000             MOVE REC-CT TO DOTVALUE.
025100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
025200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
025300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
025400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
025500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
025600     MOVE SPACE TO CORRECT-X.
025700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025800     MOVE     SPACE TO RE-MARK.
025900 HEAD-ROUTINE.
026000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026400 COLUMN-NAMES-ROUTINE.
026500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026800 END-ROUTINE.
026900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
027000 END-RTN-EXIT.
027100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027200 END-ROUTINE-1.
027300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
027400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
027500      ADD PASS-COUNTER TO ERROR-HOLD.
027600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
027700      MOVE PASS-COUNTER TO CCVS-E-4-1.
027800      MOVE ERROR-HOLD TO CCVS-E-4-2.
027900      MOVE CCVS-E-4 TO CCVS-E-2-2.
028000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
028100  END-ROUTINE-12.
028200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
028300     IF       ERROR-COUNTER IS EQUAL TO ZERO
028400         MOVE "NO " TO ERROR-TOTAL
028500         ELSE
028600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
028700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028800     PERFORM WRITE-LINE.
028900 END-ROUTINE-13.
029000     IF DELETE-COUNTER IS EQUAL TO ZERO
029100         MOVE "NO " TO ERROR-TOTAL  ELSE
029200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
029300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
029400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029500      IF   INSPECT-COUNTER EQUAL TO ZERO
029600          MOVE "NO " TO ERROR-TOTAL
029700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030100 WRITE-LINE.
030200     ADD 1 TO RECORD-COUNT.
030300Y    IF RECORD-COUNT GREATER 50
030400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
030500Y        MOVE SPACE TO DUMMY-RECORD
030600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
030700Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
030800Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
030900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
031000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
031100Y        MOVE ZERO TO RECORD-COUNT.
031200     PERFORM WRT-LN.
031300 WRT-LN.
031400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031500     MOVE SPACE TO DUMMY-RECORD.
031600 BLANK-LINE-PRINT.
031700     PERFORM WRT-LN.
031800 FAIL-ROUTINE.
031900     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032400     MOVE   SPACES TO INF-ANSI-REFERENCE.
032500     GO TO  FAIL-ROUTINE-EX.
032600 FAIL-ROUTINE-WRITE.
032700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
032800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
032900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
033000     MOVE   SPACES TO COR-ANSI-REFERENCE.
033100 FAIL-ROUTINE-EX. EXIT.
033200 BAIL-OUT.
033300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033500 BAIL-OUT-WRITE.
033600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
033700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033900     MOVE   SPACES TO INF-ANSI-REFERENCE.
034000 BAIL-OUT-EX. EXIT.
034100 CCVS1-EXIT.
034200     EXIT.
034300 SECT-NC214M-001 SECTION.
034400 ACC-INIT-F2-1.
034500*    ===---> TEST THE ACCEPT FROM DATE STATEMENT <---===
034600     MOVE "ACC-TEST-F2-1" TO PAR-NAME.
034700     MOVE "VI-72 6.5.4 GR7" TO ANSI-REFERENCE.
034800     MOVE "ACCEPT DATE" TO FEATURE.
034900 ACC-TEST-F2-1.
035000     ACCEPT WRK-DU-6V0-1 FROM DATE.
035100     MOVE WRK-DU-6V0-1 TO COMPUTED-N.
035200     MOVE "DATE YYMMDD FORMAT" TO CORRECT-A.
035300     MOVE "CHECK VISUALLY" TO RE-MARK.
035400     GO TO ACC-WRITE-F2-1.
035500 ACC-DELETE-F2-1.
035600     PERFORM DE-LETE.
035700 ACC-WRITE-F2-1.
035800     PERFORM PRINT-DETAIL.
035900*
036000 ACC-INIT-F2-2.
036100*    ===---> TEST THE ACCEPT FROM DAY STATEMENT <---===
036200     MOVE "ACC-TEST-F2-2" TO PAR-NAME.
036300     MOVE "VI-72 6.5.4 GR8" TO ANSI-REFERENCE.
036400     MOVE "ACCEPT DAY" TO FEATURE.
036500 ACC-TEST-F2-2.
036600     ACCEPT WRK-DU-5V0-1 FROM DAY.
036700     MOVE WRK-DU-5V0-1 TO COMPUTED-N.
036800     MOVE "DAY YYDDD FORMAT" TO CORRECT-A.
036900     MOVE "CHECK VISUALLY" TO RE-MARK.
037000     GO TO ACC-WRITE-F2-2.
037100 ACC-DELETE-F2-2.
037200     PERFORM DE-LETE.
037300 ACC-WRITE-F2-2.
037400     PERFORM PRINT-DETAIL.
037500*
037600 ACC-INIT-F2-3.
037700*    ===---> TEST THE ACCEPT FROM TIME STATEMENT <---===
037800     MOVE "ACC-TEST-F2-3" TO PAR-NAME.
037900     MOVE "VI-72 6.5.4 GR9" TO ANSI-REFERENCE.
038000     MOVE "ACCEPT TIME" TO FEATURE.
038100 ACC-TEST-F2-3.
038200     ACCEPT WRK-DU-8V0-1 FROM TIME.
038300     MOVE WRK-DU-8V0-1 TO COMPUTED-N.
038400     MOVE "HHMMSSFF FORMAT" TO CORRECT-A.
038500     MOVE "CHECK VISUALLY" TO RE-MARK.
038600     GO TO ACC-WRITE-F2-3.
038700 ACC-DELETE-F2-3.
038800     PERFORM DE-LETE.
038900 ACC-WRITE-F2-3.
039000     PERFORM PRINT-DETAIL.
039100*
039200 ACC-INIT-F2-4.
039300*    ===---> TEST THE ACCEPT FROM DAY-OF-WEEK STATEMENT <---===
039400     MOVE "ACC-TEST-F2-4" TO PAR-NAME.
039500     MOVE "VI-72 6.5.4 GR10" TO ANSI-REFERENCE.
039600     MOVE "ACCEPT DAY-OF-WEEK" TO FEATURE.
039700 ACC-TEST-F2-4.
039800     ACCEPT WRK-DU-1V0-1 FROM DAY-OF-WEEK.
039900     MOVE WRK-DU-1V0-1 TO COMPUTED-N.
040000     MOVE "SINGLE DIGIT INTEGER REPRESENTING DAY" TO CORRECT-A.
040100     MOVE "CHECK VISUALLY" TO RE-MARK.
040200     GO TO ACC-WRITE-F2-4.
040300 ACC-DELETE-F2-4.
040400     PERFORM DE-LETE.
040500 ACC-WRITE-F2-4.
040600     PERFORM PRINT-DETAIL.
040700 CCVS-EXIT SECTION.
040800 CCVS-999999.
040900     GO TO CLOSE-FILES.
