000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC219A.
000400*
000500****************************************************************
000600*                                                              *
000700*    VALIDATION FOR:-                                          *
000800*                                                              *
000900*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
001000*                                                              *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-82  - SOURCE COMPUTER NAME.                         *
001900*        X-83  - OBJECT COMPUTER NAME.                         *
002000*                                                              *
002100****************************************************************
002200*    PROGRAM NC219A TESTS THE USE OF "HIGH-VALUE" & "LOW-VALUE"
002300*    IN THE LITERAL PHRASE OF THE "ALPHABET" CLAUSE OF THE
002400*    "SPECIAL-NAMES" PARAGRAPH AND THE "PROGRAM COLLATING
002500*    SEQUENCE" OF THE "OBJECT-COMPUTER PARAGRAPH.
002600*
002700****************************************************************
002800*
002900*
003000*        ACCORDING TO THE RULES FOR PROGRAM COLLATING SEQUENCE
003100*    THE LOWEST CHARACTER SHOULD BE THE LETTER  F  FOLLOWED BY
003200*    THE LETTER  U  FOLLOWED IN ASCENDING ORDER BY THE LETTER  N
003300*    WHICH IS SET ON AN EVEN PAR WITH THE COMPUTER VALUES FOR
003400*    HIGH-VALUE AND LOW-VALUE.  THE NEXT HIGHEST CHARACTER IS THE
003500*    LETTER  Y.  THE REMAINDER OF THE CHARACTERS IN THE COBOL
003600*    CHARACTER SET THEN FOLLOW IN ASCENDING ORDER BUT EXCLUDE
003700*    THE CHARACTERS AND VALUES PREVIOUSLY METIONED (F,U,N,HIGH-
003800*    VALUE, LOW-VALUE, AND Y).  LOW-VALUE FOR THE NEW PROGRAM
003900*    COLLATING SEQUENCE JUST EVALUATED SHOULD BE THE LETTER F.
004000*    HIGH-VALUE SHOULD NOW BE EVALUATED AS THE HIGHEST ORDER
004100*    CHARACTER FROM THE REMAINDER OF THE NATIVE COLLATING SEQUENCE
004200*    NOT INCLUDING THE CHARACTERS F,U,N,**PREVIOUS** HIGH-VALUE
004300*    OR **PREVIOUS** LOW-VALUE, AND THE LETTER  Y.
004400*
004500*        THE ALPHABET-NAME COLLATING-SEQ-2 IS NOT USED IN
004600*    THE PROGRAM EXCEPT TO TEST WHETHER THE LETTER  Q  HAS BEEN
004700*    SET TO AN EQUAL PAR WITH THE NEW HIGH-VALUE AND NEW LOW-VALUE
004800*    FOR PURPOSES OF THE PROGRAM COLLATING SEQUENCE.  THIS WOULD
004900*    BE TRUE IF THE ALPHABET-NAME COLLATING-SEQ-2 WERE REFERENCED
005000*    IN A SORT, MERGE, OR CODE-SET CLAUSE.
005100*
005200*
005300*
005400 ENVIRONMENT DIVISION.
005500 CONFIGURATION SECTION.
005600 SOURCE-COMPUTER.
005700     XXXXX082.
005800 OBJECT-COMPUTER.
005900     XXXXX083
006000     PROGRAM COLLATING SEQUENCE IS COLLATING-SEQ-1.
006100 SPECIAL-NAMES.
006200         ALPHABET
006300         COLLATING-SEQ-1 IS "F" "U" "N"
006400             ALSO HIGH-VALUE
006500             ALSO LOW-VALUE
006600             "Y"
006700         ALPHABET
006800         COLLATING-SEQ-2 IS "Q"
006900             ALSO HIGH-VALUE
007000             ALSO LOW-VALUE.
007100 INPUT-OUTPUT SECTION.
007200 FILE-CONTROL.
007300     SELECT PRINT-FILE ASSIGN TO
007400     XXXXX055.
007500 DATA DIVISION.
007600 FILE SECTION.
007700 FD  PRINT-FILE.
007800 01  PRINT-REC PICTURE X(120).
007900 01  DUMMY-RECORD PICTURE X(120).
008000 WORKING-STORAGE SECTION.
008100 01  F-AN-1                          PICTURE A VALUE "F".
008200 01  U-AN-1                          PICTURE A VALUE "U".
008300 01  N-AN-1                          PICTURE A VALUE "N".
008400 01  Y-AN-1                          PICTURE A VALUE "Y".
008500 01  Q-AN-1                          PICTURE A VALUE "Q".
008600 01  NEW-LOW                         PICTURE X VALUE LOW-VALUE.
008700 01  TEST-RESULTS.
008800     02 FILLER                   PIC X      VALUE SPACE.
008900     02 FEATURE                  PIC X(20)  VALUE SPACE.
009000     02 FILLER                   PIC X      VALUE SPACE.
009100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
009200     02 FILLER                   PIC X      VALUE SPACE.
009300     02  PAR-NAME.
009400       03 FILLER                 PIC X(19)  VALUE SPACE.
009500       03  PARDOT-X              PIC X      VALUE SPACE.
009600       03 DOTVALUE               PIC 99     VALUE ZERO.
009700     02 FILLER                   PIC X(8)   VALUE SPACE.
009800     02 RE-MARK                  PIC X(61).
009900 01  TEST-COMPUTED.
010000     02 FILLER                   PIC X(30)  VALUE SPACE.
010100     02 FILLER                   PIC X(17)  VALUE
010200            "       COMPUTED=".
010300     02 COMPUTED-X.
010400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
010500     03 COMPUTED-N               REDEFINES COMPUTED-A
010600                                 PIC -9(9).9(9).
010700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
010800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
010900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
011000     03       CM-18V0 REDEFINES COMPUTED-A.
011100         04 COMPUTED-18V0                    PIC -9(18).
011200         04 FILLER                           PIC X.
011300     03 FILLER PIC X(50) VALUE SPACE.
011400 01  TEST-CORRECT.
011500     02 FILLER PIC X(30) VALUE SPACE.
011600     02 FILLER PIC X(17) VALUE "       CORRECT =".
011700     02 CORRECT-X.
011800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
011900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
012000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
012100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
012200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
012300     03      CR-18V0 REDEFINES CORRECT-A.
012400         04 CORRECT-18V0                     PIC -9(18).
012500         04 FILLER                           PIC X.
012600     03 FILLER PIC X(2) VALUE SPACE.
012700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
012800 01  CCVS-C-1.
012900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
013000-    "SS  PARAGRAPH-NAME
013100-    "       REMARKS".
013200     02 FILLER                     PIC X(20)    VALUE SPACE.
013300 01  CCVS-C-2.
013400     02 FILLER                     PIC X        VALUE SPACE.
013500     02 FILLER                     PIC X(6)     VALUE "TESTED".
013600     02 FILLER                     PIC X(15)    VALUE SPACE.
013700     02 FILLER                     PIC X(4)     VALUE "FAIL".
013800     02 FILLER                     PIC X(94)    VALUE SPACE.
013900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
014000 01  REC-CT                        PIC 99       VALUE ZERO.
014100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
014200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
014300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
014400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
014500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
014600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
014700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
014800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
014900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
015000 01  CCVS-H-1.
015100     02  FILLER                    PIC X(39)    VALUE SPACES.
015200     02  FILLER                    PIC X(42)    VALUE
015300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
015400     02  FILLER                    PIC X(39)    VALUE SPACES.
015500 01  CCVS-H-2A.
015600   02  FILLER                        PIC X(40)  VALUE SPACE.
015700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
015800   02  FILLER                        PIC XXXX   VALUE
015900     "4.2 ".
016000   02  FILLER                        PIC X(28)  VALUE
016100            " COPY - NOT FOR DISTRIBUTION".
016200   02  FILLER                        PIC X(41)  VALUE SPACE.
016300
016400 01  CCVS-H-2B.
016500   02  FILLER                        PIC X(15)  VALUE
016600            "TEST RESULT OF ".
016700   02  TEST-ID                       PIC X(9).
016800   02  FILLER                        PIC X(4)   VALUE
016900            " IN ".
017000   02  FILLER                        PIC X(12)  VALUE
017100     " HIGH       ".
017200   02  FILLER                        PIC X(22)  VALUE
017300            " LEVEL VALIDATION FOR ".
017400   02  FILLER                        PIC X(58)  VALUE
017500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017600 01  CCVS-H-3.
017700     02  FILLER                      PIC X(34)  VALUE
017800            " FOR OFFICIAL USE ONLY    ".
017900     02  FILLER                      PIC X(58)  VALUE
018000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
018100     02  FILLER                      PIC X(28)  VALUE
018200            "  COPYRIGHT   1985 ".
018300 01  CCVS-E-1.
018400     02 FILLER                       PIC X(52)  VALUE SPACE.
018500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
018600     02 ID-AGAIN                     PIC X(9).
018700     02 FILLER                       PIC X(45)  VALUE SPACES.
018800 01  CCVS-E-2.
018900     02  FILLER                      PIC X(31)  VALUE SPACE.
019000     02  FILLER                      PIC X(21)  VALUE SPACE.
019100     02 CCVS-E-2-2.
019200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
019300         03 FILLER                   PIC X      VALUE SPACE.
019400         03 ENDER-DESC               PIC X(44)  VALUE
019500            "ERRORS ENCOUNTERED".
019600 01  CCVS-E-3.
019700     02  FILLER                      PIC X(22)  VALUE
019800            " FOR OFFICIAL USE ONLY".
019900     02  FILLER                      PIC X(12)  VALUE SPACE.
020000     02  FILLER                      PIC X(58)  VALUE
020100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020200     02  FILLER                      PIC X(13)  VALUE SPACE.
020300     02 FILLER                       PIC X(15)  VALUE
020400             " COPYRIGHT 1985".
020500 01  CCVS-E-4.
020600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
020700     02 FILLER                       PIC X(4)   VALUE " OF ".
020800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
020900     02 FILLER                       PIC X(40)  VALUE
021000      "  TESTS WERE EXECUTED SUCCESSFULLY".
021100 01  XXINFO.
021200     02 FILLER                       PIC X(19)  VALUE
021300            "*** INFORMATION ***".
021400     02 INFO-TEXT.
021500       04 FILLER                     PIC X(8)   VALUE SPACE.
021600       04 XXCOMPUTED                 PIC X(20).
021700       04 FILLER                     PIC X(5)   VALUE SPACE.
021800       04 XXCORRECT                  PIC X(20).
021900     02 INF-ANSI-REFERENCE           PIC X(48).
022000 01  HYPHEN-LINE.
022100     02 FILLER  PIC IS X VALUE IS SPACE.
022200     02 FILLER  PIC IS X(65)    VALUE IS "************************
022300-    "*****************************************".
022400     02 FILLER  PIC IS X(54)    VALUE IS "************************
022500-    "******************************".
022600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
022700     "NC219A".
022800 PROCEDURE DIVISION.
022900 CCVS1 SECTION.
023000 OPEN-FILES.
023100     OPEN     OUTPUT PRINT-FILE.
023200     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
023300     MOVE    SPACE TO TEST-RESULTS.
023400     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
023500     GO TO CCVS1-EXIT.
023600 CLOSE-FILES.
023700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
023800 TERMINATE-CCVS.
023900S    EXIT PROGRAM.
024000STERMINATE-CALL.
024100     STOP     RUN.
024200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
024300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
024400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
024500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
024600     MOVE "****TEST DELETED****" TO RE-MARK.
024700 PRINT-DETAIL.
024800     IF REC-CT NOT EQUAL TO ZERO
024900             MOVE "." TO PARDOT-X
025000             MOVE REC-CT TO DOTVALUE.
025100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
025200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
025300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
025400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
025500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
025600     MOVE SPACE TO CORRECT-X.
025700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
025800     MOVE     SPACE TO RE-MARK.
025900 HEAD-ROUTINE.
026000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026400 COLUMN-NAMES-ROUTINE.
026500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
026800 END-ROUTINE.
026900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
027000 END-RTN-EXIT.
027100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027200 END-ROUTINE-1.
027300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
027400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
027500      ADD PASS-COUNTER TO ERROR-HOLD.
027600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
027700      MOVE PASS-COUNTER TO CCVS-E-4-1.
027800      MOVE ERROR-HOLD TO CCVS-E-4-2.
027900      MOVE CCVS-E-4 TO CCVS-E-2-2.
028000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
028100  END-ROUTINE-12.
028200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
028300     IF       ERROR-COUNTER IS EQUAL TO ZERO
028400         MOVE "NO " TO ERROR-TOTAL
028500         ELSE
028600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
028700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
028800     PERFORM WRITE-LINE.
028900 END-ROUTINE-13.
029000     IF DELETE-COUNTER IS EQUAL TO ZERO
029100         MOVE "NO " TO ERROR-TOTAL  ELSE
029200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
029300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
029400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029500      IF   INSPECT-COUNTER EQUAL TO ZERO
029600          MOVE "NO " TO ERROR-TOTAL
029700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
029800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
029900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030100 WRITE-LINE.
030200     ADD 1 TO RECORD-COUNT.
030300Y    IF RECORD-COUNT GREATER 50
030400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
030500Y        MOVE SPACE TO DUMMY-RECORD
030600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
030700Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
030800Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
030900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
031000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
031100Y        MOVE ZERO TO RECORD-COUNT.
031200     PERFORM WRT-LN.
031300 WRT-LN.
031400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031500     MOVE SPACE TO DUMMY-RECORD.
031600 BLANK-LINE-PRINT.
031700     PERFORM WRT-LN.
031800 FAIL-ROUTINE.
031900     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032400     MOVE   SPACES TO INF-ANSI-REFERENCE.
032500     GO TO  FAIL-ROUTINE-EX.
032600 FAIL-ROUTINE-WRITE.
032700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
032800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
032900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
033000     MOVE   SPACES TO COR-ANSI-REFERENCE.
033100 FAIL-ROUTINE-EX. EXIT.
033200 BAIL-OUT.
033300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033500 BAIL-OUT-WRITE.
033600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
033700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033900     MOVE   SPACES TO INF-ANSI-REFERENCE.
034000 BAIL-OUT-EX. EXIT.
034100 CCVS1-EXIT.
034200     EXIT.
034300 SECT-NC219A-001 SECTION.
034400*
034500*
034600*        THE LETTER  F  IS THE LOWEST CHARACTER IN THE PROGRAM
034700*    COLLATING SEQUENCE FOLLOWED IN ASCENDING ORDER BY THE
034800*    LETTER  U.  THIS IS SHOWN IN THE ALPHABET-NAME
034900*    COLLATING-SEQ-1.
035000*
035100*            F  SHOULD BE LESS THAN  U.
035200*
035300*
035400 SEQ-INIT-GF-1.
035500     MOVE    "SEQ-TEST-GF-1" TO PAR-NAME.
035600     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
035700     MOVE    "F < U" TO FEATURE.
035800 SEQ-TEST-GF-1.
035900     IF      F-AN-1 IS LESS THAN U-AN-1
036000             PERFORM PASS
036100         ELSE
036200             GO TO SEQ-FAIL-GF-1.
036300     GO      TO SEQ-WRITE-GF-1.
036400 SEQ-DELETE-GF-1.
036500     PERFORM DE-LETE.
036600     GO      TO SEQ-WRITE-GF-1.
036700 SEQ-FAIL-GF-1.
036800     PERFORM FAIL
036900     MOVE "F NOT < THAN U" TO COMPUTED-A.
037000 SEQ-WRITE-GF-1.
037100     PERFORM PRINT-DETAIL.
037200*
037300*
037400*        THE LETTER  U  IS THE SECOND LOWEST CHARACTER IN THE
037500*    PROGRAM COLLATING SEQUENCE FOLLOWED IN ASCENDING ORDER BY THE
037600*    LETTER  N.  THIS IS SHOWN IN THE ALPHABET-NAME
037700*    COLLATING-SEQ-1.
037800*
037900*            U  SHOULD BE LESS THAN  N.
038000*
038100*
038200 SEQ-INIT-GF-2.
038300     MOVE    "SEQ-TEST-GF-2" TO PAR-NAME.
038400     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
038500     MOVE    "U < N" TO FEATURE.
038600 SEQ-TEST-GF-2.
038700*
038800     IF      U-AN-1 IS LESS THAN N-AN-1
038900             PERFORM PASS
039000         ELSE
039100             GO TO SEQ-FAIL-GF-2.
039200     GO      TO SEQ-WRITE-GF-2.
039300 SEQ-DELETE-GF-2.
039400     PERFORM DE-LETE.
039500     GO      TO SEQ-WRITE-GF-2.
039600 SEQ-FAIL-GF-2.
039700     PERFORM FAIL
039800     MOVE "U NOT < THAN N" TO COMPUTED-A.
039900 SEQ-WRITE-GF-2.
040000     PERFORM PRINT-DETAIL.
040100*
040200*
040300*        THE LETTER  N  IS SET TO AN EVEN PAR WITH THE **OLD**
040400*    HIGH-VALUE BUT NOT EQUAL TO THE **NEW** HIGH-VALUE.
040500*
040600*            N SHOULD NOT = HIGH-VALUE.
040700*
040800*
040900 SEQ-INIT-GF-3.
041000     MOVE    "SEQ-TEST-GF-3" TO PAR-NAME.
041100     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
041200     MOVE    "N = HIGH-VALUE" TO FEATURE.
041300 SEQ-TEST-GF-3.
041400*
041500     IF      N-AN-1 IS EQUAL TO HIGH-VALUE
041600             GO TO SEQ-FAIL-GF-3
041700         ELSE
041800             PERFORM PASS.
041900     GO      TO SEQ-WRITE-GF-3.
042000 SEQ-DELETE-GF-3.
042100     PERFORM DE-LETE.
042200     GO      TO SEQ-WRITE-GF-3.
042300 SEQ-FAIL-GF-3.
042400     PERFORM FAIL
042500     MOVE "N = HIGH-VALUE" TO COMPUTED-A.
042600 SEQ-WRITE-GF-3.
042700     PERFORM PRINT-DETAIL.
042800*
042900*
043000*        LOW-VALUE SHOULD BE SET TO THE LETTER  F  SINCE IT
043100*    IS THE LOWEST CHARACTER IN THE PROGRAM COLLATING SEQUENCE.
043200*
043300*            F SHOULD BE EQUAL TO LOW-VALUE.
043400*
043500*
043600 SEQ-INIT-GF-4.
043700     MOVE    "SEQ-TEST-GF-4" TO PAR-NAME.
043800     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
043900     MOVE    "F = LOW-VALUE" TO FEATURE.
044000 SEQ-TEST-GF-4.
044100*
044200     IF      F-AN-1 IS EQUAL TO LOW-VALUE
044300             PERFORM PASS
044400         ELSE
044500             GO TO SEQ-FAIL-GF-4.
044600     GO      TO SEQ-WRITE-GF-4.
044700 SEQ-DELETE-GF-4.
044800     PERFORM DE-LETE.
044900     GO      TO SEQ-WRITE-GF-4.
045000 SEQ-FAIL-GF-4.
045100     PERFORM FAIL
045200     MOVE "F NOT = LOW-VALUE" TO COMPUTED-A.
045300 SEQ-WRITE-GF-4.
045400     PERFORM PRINT-DETAIL.
045500*
045600*
045700*        THE **NEW** LOW-VALUE SHOULD BE SET TO THE LETTER  F.
045800*    THE **NEW** HIGH-VALUE SHOULD BE SET TO THE HIGHEST ORDER
045900*    CHARACTER IN THE EVALUATED PROGRAM COLLATING SEQUENCE.
046000*
046100*            HIGH-VALUE SHOULD BE GREATER THAN LOW-VALUE.
046200*
046300*
046400 SEQ-INIT-GF-5.
046500     MOVE    "SEQ-TEST-GF-5" TO PAR-NAME.
046600     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
046700     MOVE    "H-VALUE > L-VALUE" TO FEATURE.
046800 SEQ-TEST-GF-5.
046900*
047000     IF      HIGH-VALUE IS GREATER THAN NEW-LOW
047100             PERFORM PASS
047200         ELSE
047300             GO TO SEQ-FAIL-GF-5.
047400     GO      TO SEQ-WRITE-GF-5.
047500 SEQ-DELETE-GF-5.
047600     PERFORM DE-LETE.
047700     GO      TO SEQ-WRITE-GF-5.
047800 SEQ-FAIL-GF-5.
047900     PERFORM FAIL
048000     MOVE "H-VALU NOT > L-VALU" TO COMPUTED-A.
048100 SEQ-WRITE-GF-5.
048200     PERFORM PRINT-DETAIL.
048300*
048400*
048500*            LOW-VALUE SHOULD BE LESS THAN HIGH-VALUE.
048600*
048700*
048800 SEQ-INIT-GF-6.
048900     MOVE    "SEQ-TEST-GF-6" TO PAR-NAME.
049000     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
049100     MOVE    "L-VALUE < H-VALUE" TO FEATURE.
049200 SEQ-TEST-GF-6.
049300*
049400     IF      NEW-LOW IS LESS THAN HIGH-VALUE
049500             PERFORM PASS
049600         ELSE
049700             GO TO SEQ-FAIL-GF-6.
049800     GO      TO SEQ-WRITE-GF-6.
049900 SEQ-DELETE-GF-6.
050000     PERFORM DE-LETE.
050100     GO      TO SEQ-WRITE-GF-6.
050200 SEQ-FAIL-GF-6.
050300     PERFORM FAIL
050400     MOVE "L-VALU NOT < H-VALU" TO COMPUTED-A.
050500 SEQ-WRITE-GF-6.
050600     PERFORM PRINT-DETAIL.
050700*
050800*
050900*            LOW-VALUE SHOULD NOT BE EQUAL TO HIGH-VALUE.
051000*
051100*
051200 SEQ-INIT-GF-7.
051300     MOVE    "SEQ-TEST-GF-7" TO PAR-NAME.
051400     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
051500     MOVE    "H-VALUE = L-VALUE" TO FEATURE.
051600 SEQ-TEST-GF-7.
051700*
051800     IF      HIGH-VALUE IS EQUAL TO NEW-LOW
051900             GO TO SEQ-FAIL-GF-7
052000         ELSE
052100             PERFORM PASS.
052200     GO      TO SEQ-WRITE-GF-7.
052300 SEQ-DELETE-GF-7.
052400     PERFORM DE-LETE.
052500     GO      TO SEQ-WRITE-GF-7.
052600 SEQ-FAIL-GF-7.
052700     PERFORM FAIL
052800     MOVE "H-VALUE = L-VALUE" TO COMPUTED-A.
052900 SEQ-WRITE-GF-7.
053000     PERFORM PRINT-DETAIL.
053100*
053200*
053300*        LOW-VALUE SHOULD BE SET TO THE LETTER  F.
053400*
053500*            THE LETTER  Y  SHOULD NOT BE EQUAL TO LOW-VALUE.
053600*
053700*
053800 SEQ-INIT-GF-8.
053900     MOVE    "SEQ-TEST-GF-8" TO PAR-NAME.
054000     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
054100     MOVE    "Y = LOW-VALUE" TO FEATURE.
054200 SEQ-TEST-GF-8.
054300*
054400     IF      Y-AN-1 IS EQUAL TO LOW-VALUE
054500             GO TO SEQ-FAIL-GF-8
054600         ELSE
054700             PERFORM PASS.
054800     GO      TO SEQ-WRITE-GF-8.
054900 SEQ-DELETE-GF-8.
055000     PERFORM DE-LETE.
055100     GO      TO SEQ-WRITE-GF-8.
055200 SEQ-FAIL-GF-8.
055300     PERFORM FAIL
055400     MOVE "Y = LOW-VALUE" TO COMPUTED-A.
055500 SEQ-WRITE-GF-8.
055600     PERFORM PRINT-DETAIL.
055700*
055800*
055900*        THE LETTER  Q  IS MENTIONED IN THE ALPHABET-NAME
056000*    COLLATING-SEQ-2.  THIS ALPHABET-NAME CLAUSE SHOULD HAVE NO
056100*    EFFECT ON THE PROGRAM COLLATING SEQUENCE.
056200*
056300*            FOR OUR PROGRAM COLLATING SEQUENCE  Q  SHOULD NOT
056400*            BE THE LOW ORDER CHARACTER THEREFORE IT SHOULD NOT
056500*            BE EQUAL TO THE **NEW**  LOW-VALUE.
056600*
056700*
056800 SEQ-INIT-GF-9.
056900     MOVE    "SEQ-TEST-GF-9" TO PAR-NAME.
057000     MOVE    "VI-16 4.5.4 GR5/7" TO ANSI-REFERENCE.
057100     MOVE    "Q = LOW-VALUE" TO FEATURE.
057200 SEQ-TEST-GF-9.
057300*
057400     IF      Q-AN-1 IS EQUAL TO LOW-VALUE
057500             GO TO SEQ-FAIL-GF-9
057600         ELSE
057700             PERFORM PASS.
057800     GO      TO SEQ-WRITE-GF-9.
057900 SEQ-DELETE-GF-9.
058000     PERFORM DE-LETE.
058100     GO      TO SEQ-WRITE-GF-9.
058200 SEQ-FAIL-GF-9.
058300     PERFORM FAIL
058400     MOVE "Q = LOW-VALUE" TO COMPUTED-A.
058500 SEQ-WRITE-GF-9.
058600     PERFORM PRINT-DETAIL.
058700*
058800*
058900 CCVS-EXIT SECTION.
059000 CCVS-999999.
059100     GO TO CLOSE-FILES.
