000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC225A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM NC225A TESTS THE USE OF THE "EVALUATE" STATEMENT. *
002300*    VARIOUS COMBINATIONS OF IDENTIFIERS, LITERALS, ARITHMETIC *
002400*    EXPRESSIONS AND CONDITIONAL EXPRESSIONS AS WELL AS THE    *
002500*    OPTIONAL WORDS "TRUE" AND "FALSE" ARE USED AS SELECTION   *
002600*    SUBJECTS AND SELECTION OBJECTS.                           *
002700*    MULTIPLE SELECTION SUBJECTS AND SETS OF SELECTION         *
002800*    OBJECTS ARE ALSO TESTED.                                  *
002900*                                                              *
003000****************************************************************
003100 ENVIRONMENT DIVISION.
003200 CONFIGURATION SECTION.
003300 SOURCE-COMPUTER.
003400     XXXXX082.
003500 OBJECT-COMPUTER.
003600     XXXXX083.
003700 INPUT-OUTPUT SECTION.
003800 FILE-CONTROL.
003900     SELECT PRINT-FILE ASSIGN TO
004000     XXXXX055.
004100 DATA DIVISION.
004200 FILE SECTION.
004300 FD  PRINT-FILE.
004400 01  PRINT-REC PICTURE X(120).
004500 01  DUMMY-RECORD PICTURE X(120).
004600 WORKING-STORAGE SECTION.
004700 01  WRK-XN-00001-1              PIC   X.
004800 01  WRK-XN-00001-2              PIC   X.
004900 01  WRK-XN-00001-3              PIC   X.
005000 01  WRK-XN-00001-4              PIC   X.
005100 01  WRK-DU-02V00                PIC   99.
005200 01  WRK-DU-08V00                PIC   9(8).
005300 01  WRK-DU-08V00-1              PIC   9(8).
005400 01  WRK-DU-08V00-2              PIC   9(8).
005500         88 IT-IS-81         VALUE 81.
005600 01  WRK-DU-08V00-3              PIC   9(8).
005700 01  WRK-DU-08V00-4              PIC   9(8).
005800 01  TEST-3-DATA                 PIC   X(6)     VALUE "ABCDEF".
005900 01  TEST-4-DATA                 PIC   XXBXXBXX VALUE "AB CD EF".
006000
006100 01  WS-2                        PIC  S9        VALUE +2.
006200 01  WS-3                        PIC  S9        VALUE +3.
006300 01  WS-5                        PIC  S9        VALUE +5.
006400 01  WS-6                        PIC  S9        VALUE +6.
006500 01  WS-7                        PIC  S9        VALUE +7.
006600 01  WS-10                       PIC  S99       VALUE +10.
006700 01  WS-81                       PIC  S99       VALUE +81.
006800 01  TEST-5-TABLE.
006900   03        TABLE-GROUP         OCCURS 4.
007000     05      TABLE-1             PIC 9(8)
007100                                 OCCURS 2.
007200   03         TEST-5-DATA        PIC X(6).
007300*
007400 01  TEST-RESULTS.
007500     02 FILLER                   PIC X      VALUE SPACE.
007600     02 FEATURE                  PIC X(20)  VALUE SPACE.
007700     02 FILLER                   PIC X      VALUE SPACE.
007800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
007900     02 FILLER                   PIC X      VALUE SPACE.
008000     02  PAR-NAME.
008100       03 FILLER                 PIC X(19)  VALUE SPACE.
008200       03  PARDOT-X              PIC X      VALUE SPACE.
008300       03 DOTVALUE               PIC 99     VALUE ZERO.
008400     02 FILLER                   PIC X(8)   VALUE SPACE.
008500     02 RE-MARK                  PIC X(61).
008600 01  TEST-COMPUTED.
008700     02 FILLER                   PIC X(30)  VALUE SPACE.
008800     02 FILLER                   PIC X(17)  VALUE
008900            "       COMPUTED=".
009000     02 COMPUTED-X.
009100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009200     03 COMPUTED-N               REDEFINES COMPUTED-A
009300                                 PIC -9(9).9(9).
009400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
009500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
009600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
009700     03       CM-18V0 REDEFINES COMPUTED-A.
009800         04 COMPUTED-18V0                    PIC -9(18).
009900         04 FILLER                           PIC X.
010000     03 FILLER PIC X(50) VALUE SPACE.
010100 01  TEST-CORRECT.
010200     02 FILLER PIC X(30) VALUE SPACE.
010300     02 FILLER PIC X(17) VALUE "       CORRECT =".
010400     02 CORRECT-X.
010500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
010600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
010700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
010800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
010900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
011000     03      CR-18V0 REDEFINES CORRECT-A.
011100         04 CORRECT-18V0                     PIC -9(18).
011200         04 FILLER                           PIC X.
011300     03 FILLER PIC X(2) VALUE SPACE.
011400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011500 01  CCVS-C-1.
011600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011700-    "SS  PARAGRAPH-NAME
011800-    "       REMARKS".
011900     02 FILLER                     PIC X(20)    VALUE SPACE.
012000 01  CCVS-C-2.
012100     02 FILLER                     PIC X        VALUE SPACE.
012200     02 FILLER                     PIC X(6)     VALUE "TESTED".
012300     02 FILLER                     PIC X(15)    VALUE SPACE.
012400     02 FILLER                     PIC X(4)     VALUE "FAIL".
012500     02 FILLER                     PIC X(94)    VALUE SPACE.
012600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012700 01  REC-CT                        PIC 99       VALUE ZERO.
012800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013700 01  CCVS-H-1.
013800     02  FILLER                    PIC X(39)    VALUE SPACES.
013900     02  FILLER                    PIC X(42)    VALUE
014000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014100     02  FILLER                    PIC X(39)    VALUE SPACES.
014200 01  CCVS-H-2A.
014300   02  FILLER                        PIC X(40)  VALUE SPACE.
014400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014500   02  FILLER                        PIC XXXX   VALUE
014600     "4.2 ".
014700   02  FILLER                        PIC X(28)  VALUE
014800            " COPY - NOT FOR DISTRIBUTION".
014900   02  FILLER                        PIC X(41)  VALUE SPACE.
015000
015100 01  CCVS-H-2B.
015200   02  FILLER                        PIC X(15)  VALUE
015300            "TEST RESULT OF ".
015400   02  TEST-ID                       PIC X(9).
015500   02  FILLER                        PIC X(4)   VALUE
015600            " IN ".
015700   02  FILLER                        PIC X(12)  VALUE
015800     " HIGH       ".
015900   02  FILLER                        PIC X(22)  VALUE
016000            " LEVEL VALIDATION FOR ".
016100   02  FILLER                        PIC X(58)  VALUE
016200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016300 01  CCVS-H-3.
016400     02  FILLER                      PIC X(34)  VALUE
016500            " FOR OFFICIAL USE ONLY    ".
016600     02  FILLER                      PIC X(58)  VALUE
016700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016800     02  FILLER                      PIC X(28)  VALUE
016900            "  COPYRIGHT   1985 ".
017000 01  CCVS-E-1.
017100     02 FILLER                       PIC X(52)  VALUE SPACE.
017200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017300     02 ID-AGAIN                     PIC X(9).
017400     02 FILLER                       PIC X(45)  VALUE SPACES.
017500 01  CCVS-E-2.
017600     02  FILLER                      PIC X(31)  VALUE SPACE.
017700     02  FILLER                      PIC X(21)  VALUE SPACE.
017800     02 CCVS-E-2-2.
017900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018000         03 FILLER                   PIC X      VALUE SPACE.
018100         03 ENDER-DESC               PIC X(44)  VALUE
018200            "ERRORS ENCOUNTERED".
018300 01  CCVS-E-3.
018400     02  FILLER                      PIC X(22)  VALUE
018500            " FOR OFFICIAL USE ONLY".
018600     02  FILLER                      PIC X(12)  VALUE SPACE.
018700     02  FILLER                      PIC X(58)  VALUE
018800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018900     02  FILLER                      PIC X(13)  VALUE SPACE.
019000     02 FILLER                       PIC X(15)  VALUE
019100             " COPYRIGHT 1985".
019200 01  CCVS-E-4.
019300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019400     02 FILLER                       PIC X(4)   VALUE " OF ".
019500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019600     02 FILLER                       PIC X(40)  VALUE
019700      "  TESTS WERE EXECUTED SUCCESSFULLY".
019800 01  XXINFO.
019900     02 FILLER                       PIC X(19)  VALUE
020000            "*** INFORMATION ***".
020100     02 INFO-TEXT.
020200       04 FILLER                     PIC X(8)   VALUE SPACE.
020300       04 XXCOMPUTED                 PIC X(20).
020400       04 FILLER                     PIC X(5)   VALUE SPACE.
020500       04 XXCORRECT                  PIC X(20).
020600     02 INF-ANSI-REFERENCE           PIC X(48).
020700 01  HYPHEN-LINE.
020800     02 FILLER  PIC IS X VALUE IS SPACE.
020900     02 FILLER  PIC IS X(65)    VALUE IS "************************
021000-    "*****************************************".
021100     02 FILLER  PIC IS X(54)    VALUE IS "************************
021200-    "******************************".
021300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021400     "NC225A".
021500 PROCEDURE DIVISION.
021600 CCVS1 SECTION.
021700 OPEN-FILES.
021800     OPEN     OUTPUT PRINT-FILE.
021900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022000     MOVE    SPACE TO TEST-RESULTS.
022100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022200     GO TO CCVS1-EXIT.
022300 CLOSE-FILES.
022400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022500 TERMINATE-CCVS.
022600S    EXIT PROGRAM.
022700STERMINATE-CALL.
022800     STOP     RUN.
022900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023300     MOVE "****TEST DELETED****" TO RE-MARK.
023400 PRINT-DETAIL.
023500     IF REC-CT NOT EQUAL TO ZERO
023600             MOVE "." TO PARDOT-X
023700             MOVE REC-CT TO DOTVALUE.
023800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024300     MOVE SPACE TO CORRECT-X.
024400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024500     MOVE     SPACE TO RE-MARK.
024600 HEAD-ROUTINE.
024700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025100 COLUMN-NAMES-ROUTINE.
025200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025500 END-ROUTINE.
025600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025700 END-RTN-EXIT.
025800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025900 END-ROUTINE-1.
026000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026200      ADD PASS-COUNTER TO ERROR-HOLD.
026300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
026400
026500      MOVE PASS-COUNTER TO CCVS-E-4-1.
026600      MOVE ERROR-HOLD TO CCVS-E-4-2.
026700      MOVE CCVS-E-4 TO CCVS-E-2-2.
026800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026900  END-ROUTINE-12.
027000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027100     IF       ERROR-COUNTER IS EQUAL TO ZERO
027200         MOVE "NO " TO ERROR-TOTAL
027300         ELSE
027400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027600     PERFORM WRITE-LINE.
027700 END-ROUTINE-13.
027800     IF DELETE-COUNTER IS EQUAL TO ZERO
027900         MOVE "NO " TO ERROR-TOTAL  ELSE
028000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028300      IF   INSPECT-COUNTER EQUAL TO ZERO
028400          MOVE "NO " TO ERROR-TOTAL
028500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028900 WRITE-LINE.
029000     ADD 1 TO RECORD-COUNT.
029100Y    IF RECORD-COUNT GREATER 50
029200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029300Y        MOVE SPACE TO DUMMY-RECORD
029400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029500Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
029600Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
029700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029900Y        MOVE ZERO TO RECORD-COUNT.
030000     PERFORM WRT-LN.
030100 WRT-LN.
030200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030300     MOVE SPACE TO DUMMY-RECORD.
030400 BLANK-LINE-PRINT.
030500     PERFORM WRT-LN.
030600 FAIL-ROUTINE.
030700     IF     COMPUTED-X NOT EQUAL TO SPACE
030800            GO TO    FAIL-ROUTINE-WRITE.
030900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
031000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031300     MOVE   SPACES TO INF-ANSI-REFERENCE.
031400     GO TO  FAIL-ROUTINE-EX.
031500 FAIL-ROUTINE-WRITE.
031600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
031700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
031800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
031900     MOVE   SPACES TO COR-ANSI-REFERENCE.
032000 FAIL-ROUTINE-EX. EXIT.
032100 BAIL-OUT.
032200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032400 BAIL-OUT-WRITE.
032500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
032600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032800     MOVE   SPACES TO INF-ANSI-REFERENCE.
032900 BAIL-OUT-EX. EXIT.
033000 CCVS1-EXIT.
033100     EXIT.
033200*
033300 SECT-NC225A-001-1 SECTION.
033400*
033500 EVA-INIT-GF-1.
033600     MOVE   "EVALUATE STATEMENT"  TO FEATURE.
033700     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
033800     MOVE    1       TO REC-CT.
033900     MOVE   "6" TO WRK-XN-00001-1.
034000     GO TO   EVA-TEST-GF-1-1.
034100 EVA-DELETE-GF-1.
034200     PERFORM DE-LETE.
034300     PERFORM PRINT-DETAIL.
034400     GO TO   EVA-INIT-GF-2.
034500 EVA-TEST-GF-1-1.
034600     MOVE   "EVA-TEST-GF-1-1" TO PAR-NAME.
034700     EVALUATE WRK-XN-00001-1 NUMERIC
034800        WHEN TRUE
034900             PERFORM PASS
035000             GO TO   EVA-WRITE-GF-1-1.
035100     GO TO EVA-FAIL-GF-1-1.
035200 EVA-DELETE-GF-1-1.
035300     PERFORM DE-LETE.
035400     GO TO EVA-WRITE-GF-1-1.
035500 EVA-FAIL-GF-1-1.
035600     MOVE   "EXPECTING NUMERIC CONDITION" TO RE-MARK.
035700     PERFORM FAIL.
035800 EVA-WRITE-GF-1-1.
035900     PERFORM PRINT-DETAIL.
036000*
036100 EVA-TEST-GF-1-2.
036200     ADD     1       TO REC-CT.
036300     MOVE   "EVA-TEST-GF-1-2" TO PAR-NAME.
036400     EVALUATE WRK-XN-00001-1 NOT NUMERIC
036500        WHEN TRUE
036600             GO TO EVA-FAIL-GF-1-2.
036700     PERFORM PASS.
036800     GO TO   EVA-WRITE-GF-1-2.
036900 EVA-DELETE-GF-1-2.
037000     PERFORM DE-LETE.
037100     GO TO EVA-WRITE-GF-1-2.
037200 EVA-FAIL-GF-1-2.
037300     MOVE   "EXPECTING NUMERIC CONDITION" TO RE-MARK
037400     PERFORM FAIL.
037500 EVA-WRITE-GF-1-2.
037600     PERFORM PRINT-DETAIL.
037700*
037800 EVA-INIT-GF-2.
037900     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
038000     MOVE    1  TO REC-CT.
038100     MOVE   "*" TO WRK-XN-00001-1.
038200     GO TO   EVA-TEST-GF-2-1.
038300 EVA-DELETE-GF-2.
038400     PERFORM DE-LETE.
038500     PERFORM PRINT-DETAIL.
038600     GO TO   EVA-INIT-GF-3.
038700 EVA-TEST-GF-2-1.
038800     MOVE   "EVA-TEST-GF-2-1" TO PAR-NAME.
038900     EVALUATE WRK-XN-00001-1 NUMERIC
039000        WHEN TRUE
039100             GO TO EVA-FAIL-GF-2-1.
039200     PERFORM PASS.
039300     GO TO EVA-WRITE-GF-2-1.
039400 EVA-DELETE-GF-2-1.
039500     PERFORM DE-LETE.
039600     GO TO EVA-WRITE-GF-2-1.
039700 EVA-FAIL-GF-2-1.
039800     MOVE   "EXPECTING NON-NUMERIC CONDITION" TO RE-MARK
039900     PERFORM FAIL.
040000 EVA-WRITE-GF-2-1.
040100     PERFORM PRINT-DETAIL.
040200*
040300 EVA-TEST-GF-2-2.
040400     ADD     1 TO REC-CT.
040500     MOVE   "EVA-TEST-GF-2-2" TO PAR-NAME.
040600     EVALUATE WRK-XN-00001-1 NOT NUMERIC
040700        WHEN TRUE
040800             PERFORM PASS
040900             GO TO   EVA-WRITE-GF-2-2.
041000     GO TO EVA-FAIL-GF-2-2.
041100 EVA-DELETE-GF-2-2.
041200     PERFORM DE-LETE.
041300     GO TO EVA-WRITE-GF-2-2.
041400 EVA-FAIL-GF-2-2.
041500     MOVE   "EXPECTING NON-NUMERIC CONDITION" TO RE-MARK.
041600     PERFORM FAIL.
041700 EVA-WRITE-GF-2-2.
041800     PERFORM PRINT-DETAIL.
041900*
042000 EVA-INIT-GF-3.
042100     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
042200     MOVE    1  TO REC-CT.
042300     MOVE   "6" TO WRK-XN-00001-1.
042400     MOVE   "6" TO WRK-XN-00001-2.
042500     GO TO   EVA-TEST-GF-3-1.
042600 EVA-DELETE-GF-3.
042700     PERFORM DE-LETE.
042800     PERFORM PRINT-DETAIL.
042900     GO TO   EVA-INIT-GF-4.
043000 EVA-TEST-GF-3-1.
043100     MOVE   "EVA-TEST-GF-3-1" TO PAR-NAME.
043200     EVALUATE WRK-XN-00001-1
043300        WHEN WRK-XN-00001-2
043400             PERFORM PASS
043500             GO TO   EVA-WRITE-GF-3-1.
043600     GO TO EVA-FAIL-GF-3-1.
043700 EVA-DELETE-GF-3-1.
043800     PERFORM DE-LETE.
043900     GO TO EVA-WRITE-GF-3-1.
044000 EVA-FAIL-GF-3-1.
044100     MOVE   "EXPECTING EQUAL IDENTIFIER" TO RE-MARK.
044200     PERFORM FAIL.
044300 EVA-WRITE-GF-3-1.
044400     PERFORM PRINT-DETAIL.
044500*
044600 EVA-TEST-GF-3-2.
044700     ADD     1       TO REC-CT.
044800     MOVE   "EVA-TEST-GF-3-2" TO PAR-NAME.
044900     EVALUATE WRK-XN-00001-1
045000        WHEN NOT WRK-XN-00001-2
045100             GO TO EVA-FAIL-GF-3-2.
045200     PERFORM PASS.
045300     GO TO   EVA-WRITE-GF-3-2.
045400 EVA-DELETE-GF-3-2.
045500     PERFORM DE-LETE.
045600     GO TO EVA-WRITE-GF-3-2.
045700 EVA-FAIL-GF-3-2.
045800     MOVE   "EXPECTING EQUAL IDENTIFIERS" TO RE-MARK
045900     PERFORM FAIL.
046000 EVA-WRITE-GF-3-2.
046100     PERFORM PRINT-DETAIL.
046200*
046300 EVA-INIT-GF-4.
046400     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
046500     MOVE    1  TO REC-CT.
046600     MOVE   "1" TO WRK-XN-00001-1.
046700     MOVE   "*" TO WRK-XN-00001-2.
046800     GO TO   EVA-TEST-GF-4-1.
046900 EVA-DELETE-GF-4.
047000     PERFORM DE-LETE.
047100     PERFORM PRINT-DETAIL.
047200     GO TO   EVA-INIT-GF-5.
047300 EVA-TEST-GF-4-1.
047400     MOVE   "EVA-TEST-GF-4-1" TO PAR-NAME.
047500     EVALUATE WRK-XN-00001-1
047600        WHEN WRK-XN-00001-2
047700             GO TO EVA-FAIL-GF-4-1.
047800     PERFORM PASS.
047900     GO TO   EVA-WRITE-GF-4-1.
048000 EVA-DELETE-GF-4-1.
048100     PERFORM DE-LETE.
048200     GO TO EVA-WRITE-GF-4-1.
048300 EVA-FAIL-GF-4-1.
048400     MOVE   "EXPECTING UNEQUAL IDENTIFIERS" TO RE-MARK
048500     PERFORM FAIL.
048600 EVA-WRITE-GF-4-1.
048700     PERFORM PRINT-DETAIL.
048800*
048900 EVA-TEST-GF-4-2.
049000     ADD     1 TO REC-CT.
049100     EVALUATE WRK-XN-00001-1
049200        WHEN NOT WRK-XN-00001-2
049300             PERFORM PASS
049400             GO TO   EVA-WRITE-GF-4-2.
049500     GO TO EVA-FAIL-GF-4-2.
049600 EVA-DELETE-GF-4-2.
049700     PERFORM DE-LETE.
049800     GO TO   EVA-WRITE-GF-4-2.
049900 EVA-FAIL-GF-4-2.
050000     MOVE   "EXPECTING UNEQUAL IDENTIFIERS" TO RE-MARK.
050100     PERFORM FAIL.
050200 EVA-WRITE-GF-4-2.
050300     MOVE   "EVA-TEST-GF-4-2" TO PAR-NAME.
050400     PERFORM PRINT-DETAIL.
050500*
050600 EVA-INIT-GF-5.
050700     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
050800     MOVE    1  TO REC-CT.
050900     MOVE   "A" TO WRK-XN-00001-1.
051000     GO TO   EVA-TEST-GF-5-1.
051100 EVA-DELETE-GF-5.
051200     PERFORM DE-LETE.
051300     PERFORM PRINT-DETAIL.
051400     GO TO   EVA-INIT-GF-6.
051500 EVA-TEST-GF-5-1.
051600     MOVE   "EVA-TEST-GF-5-1" TO PAR-NAME.
051700     EVALUATE WRK-XN-00001-1
051800        WHEN "A"
051900             PERFORM PASS
052000             GO TO   EVA-WRITE-GF-5-1.
052100     GO TO EVA-FAIL-GF-5-1.
052200 EVA-DELETE-GF-5-1.
052300     PERFORM DE-LETE.
052400     GO TO EVA-WRITE-GF-5-1.
052500 EVA-FAIL-GF-5-1.
052600     MOVE   "EXPECTING EQUAL LITERAL" TO RE-MARK.
052700     PERFORM FAIL.
052800 EVA-WRITE-GF-5-1.
052900     PERFORM PRINT-DETAIL.
053000*
053100 EVA-TEST-GF-5-2.
053200     ADD     1       TO REC-CT.
053300     MOVE   "EVA-TEST-GF-5-2" TO PAR-NAME.
053400     EVALUATE WRK-XN-00001-1
053500        WHEN NOT "A"
053600             GO TO EVA-FAIL-GF-5-2.
053700     PERFORM PASS.
053800     GO TO   EVA-WRITE-GF-5-2.
053900 EVA-DELETE-GF-5-2.
054000     PERFORM DE-LETE.
054100     GO TO EVA-WRITE-GF-5-2.
054200 EVA-FAIL-GF-5-2.
054300     MOVE   "EXPECTING EQUAL LITERAL" TO RE-MARK
054400     PERFORM FAIL.
054500 EVA-WRITE-GF-5-2.
054600     PERFORM PRINT-DETAIL.
054700*
054800 EVA-INIT-GF-6.
054900     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
055000     MOVE    1  TO REC-CT.
055100     MOVE   "A" TO WRK-XN-00001-1.
055200     GO TO   EVA-TEST-GF-6-1.
055300 EVA-DELETE-GF-6.
055400     PERFORM DE-LETE.
055500     PERFORM PRINT-DETAIL.
055600     GO TO   EVA-INIT-GF-7.
055700 EVA-TEST-GF-6-1.
055800     MOVE   "EVA-TEST-GF-6-1" TO PAR-NAME.
055900     EVALUATE WRK-XN-00001-1
056000        WHEN "Z"
056100             GO TO EVA-FAIL-GF-6-1.
056200     PERFORM PASS.
056300     GO TO   EVA-WRITE-GF-6-1.
056400 EVA-DELETE-GF-6-1.
056500     PERFORM DE-LETE.
056600     GO TO EVA-WRITE-GF-6-1.
056700 EVA-FAIL-GF-6-1.
056800     MOVE   "EXPECTING UNEQUAL LITERAL" TO RE-MARK
056900     PERFORM FAIL.
057000 EVA-WRITE-GF-6-1.
057100     PERFORM PRINT-DETAIL.
057200*
057300 EVA-TEST-GF-6-2.
057400     ADD     1 TO REC-CT.
057500     MOVE   "EVA-TEST-GF-6-2" TO PAR-NAME.
057600     EVALUATE WRK-XN-00001-1
057700        WHEN NOT "Z"
057800             PERFORM PASS
057900             GO TO   EVA-WRITE-GF-6-2.
058000     GO TO EVA-FAIL-GF-6-2.
058100 EVA-DELETE-GF-6-2.
058200     PERFORM DE-LETE.
058300     GO TO EVA-WRITE-GF-6-2.
058400 EVA-FAIL-GF-6-2.
058500     MOVE   "EXPECTING UNEQUAL LITERAL" TO RE-MARK.
058600     PERFORM FAIL.
058700 EVA-WRITE-GF-6-2.
058800     PERFORM PRINT-DETAIL.
058900*
059000 EVA-INIT-GF-7.
059100     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
059200     MOVE    1  TO REC-CT.
059300     MOVE    89 TO WRK-DU-08V00.
059400     GO TO   EVA-TEST-GF-7-1.
059500 EVA-DELETE-GF-7.
059600     PERFORM DE-LETE.
059700     PERFORM PRINT-DETAIL.
059800     GO TO   EVA-INIT-GF-8.
059900 EVA-TEST-GF-7-1.
060000     MOVE   "EVA-TEST-GF-7-1" TO PAR-NAME.
060100     EVALUATE WRK-DU-08V00
060200        WHEN (33 + (99 - 43))
060300             PERFORM PASS
060400             GO TO   EVA-WRITE-GF-7-1.
060500     GO TO EVA-FAIL-GF-7-1.
060600 EVA-DELETE-GF-7-1.
060700     PERFORM DE-LETE.
060800     GO TO EVA-WRITE-GF-7-1.
060900 EVA-FAIL-GF-7-1.
061000     MOVE   "EXPECTING EQUAL ARITHMETIC EXPRESSION" TO RE-MARK.
061100     PERFORM FAIL.
061200 EVA-WRITE-GF-7-1.
061300     PERFORM PRINT-DETAIL.
061400*
061500 EVA-TEST-GF-7-2.
061600     ADD     1       TO REC-CT.
061700     MOVE   "EVA-TEST-GF-7-2" TO PAR-NAME.
061800     EVALUATE WRK-DU-08V00
061900        WHEN NOT (33 + (99 - 43))
062000             GO TO EVA-FAIL-GF-7-2.
062100     PERFORM PASS.
062200     GO TO   EVA-WRITE-GF-7-2.
062300 EVA-DELETE-GF-7-2.
062400     PERFORM DE-LETE.
062500     GO TO EVA-WRITE-GF-7-2.
062600 EVA-FAIL-GF-7-2.
062700     MOVE   "EXPECTING EQUAL ARITHMETIC EXPRESSION"
062800          TO RE-MARK
062900     PERFORM FAIL.
063000 EVA-WRITE-GF-7-2.
063100     PERFORM PRINT-DETAIL.
063200*
063300 EVA-INIT-GF-8.
063400     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
063500     MOVE    1  TO REC-CT.
063600     MOVE    89 TO WRK-DU-08V00.
063700     GO TO   EVA-TEST-GF-8-1.
063800 EVA-DELETE-GF-8.
063900     PERFORM DE-LETE.
064000     PERFORM PRINT-DETAIL.
064100     GO TO   EVA-INIT-GF-9.
064200 EVA-TEST-GF-8-1.
064300     MOVE   "EVA-TEST-GF-8-1" TO PAR-NAME.
064400     EVALUATE WRK-DU-08V00
064500        WHEN (2 + 4 + 8 + 16 + 32 + 64)
064600             GO TO EVA-FAIL-GF-8-1.
064700     PERFORM PASS.
064800     GO TO   EVA-WRITE-GF-8-1.
064900 EVA-DELETE-GF-8-1.
065000     PERFORM DE-LETE.
065100     GO TO EVA-WRITE-GF-8-1.
065200 EVA-FAIL-GF-8-1.
065300     MOVE   "EXPECTING UNEQUAL ARITHMETIC EXPRESSION"
065400          TO RE-MARK
065500     PERFORM FAIL.
065600 EVA-WRITE-GF-8-1.
065700     PERFORM PRINT-DETAIL.
065800*
065900 EVA-TEST-GF-8-2.
066000     ADD     1 TO REC-CT.
066100     MOVE   "EVA-TEST-GF-8-2" TO PAR-NAME.
066200     EVALUATE WRK-DU-08V00
066300        WHEN NOT (2 + 4 + 8 + 16 + 32 + 64)
066400             PERFORM PASS
066500             GO TO   EVA-WRITE-GF-8-2.
066600     GO TO   EVA-FAIL-GF-8-2.
066700 EVA-DELETE-GF-8-2.
066800     PERFORM DE-LETE.
066900     GO TO EVA-WRITE-GF-8-2.
067000 EVA-FAIL-GF-8-2.
067100     MOVE   "EXPECTING UNEQUAL ARITHMETIC EXPRESSION" TO RE-MARK.
067200     PERFORM FAIL.
067300 EVA-WRITE-GF-8-2.
067400     PERFORM PRINT-DETAIL.
067500*
067600 EVA-INIT-GF-9.
067700     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
067800     MOVE    1  TO REC-CT.
067900     MOVE   "J" TO WRK-XN-00001-1.
068000     MOVE   "A" TO WRK-XN-00001-2.
068100     MOVE   "N" TO WRK-XN-00001-3.
068200     GO TO   EVA-TEST-GF-9-1.
068300 EVA-DELETE-GF-9.
068400     PERFORM DE-LETE.
068500     PERFORM PRINT-DETAIL.
068600     GO TO   EVA-INIT-GF-10.
068700 EVA-TEST-GF-9-1.
068800     MOVE   "EVA-TEST-GF-9-1" TO PAR-NAME.
068900     EVALUATE WRK-XN-00001-1
069000        WHEN WRK-XN-00001-2 THRU WRK-XN-00001-3
069100             PERFORM PASS
069200             GO TO   EVA-WRITE-GF-9-1.
069300     GO TO   EVA-FAIL-GF-9-1.
069400 EVA-DELETE-GF-9-1.
069500     PERFORM DE-LETE.
069600     GO TO EVA-WRITE-GF-9-1.
069700 EVA-FAIL-GF-9-1.
069800     MOVE   "SUBJECT IDENTIFIER SHOULD BE WITHIN RANGE"
069900          TO RE-MARK.
070000     PERFORM FAIL.
070100 EVA-WRITE-GF-9-1.
070200     PERFORM PRINT-DETAIL.
070300*
070400 EVA-TEST-GF-9-2.
070500     ADD     1       TO REC-CT.
070600     MOVE   "EVA-TEST-GF-9-2" TO PAR-NAME.
070700     EVALUATE WRK-XN-00001-1
070800        WHEN NOT WRK-XN-00001-2 THRU WRK-XN-00001-3
070900             GO TO EVA-FAIL-GF-9-2.
071000     PERFORM PASS.
071100     GO TO   EVA-WRITE-GF-9-2.
071200 EVA-DELETE-GF-9-2.
071300     PERFORM DE-LETE.
071400     GO TO EVA-WRITE-GF-9-2.
071500 EVA-FAIL-GF-9-2.
071600     MOVE   "SUBJECT IDENTIFIER SHOULD BE WITHIN RANGE"
071700          TO RE-MARK
071800     PERFORM FAIL.
071900 EVA-WRITE-GF-9-2.
072000     PERFORM PRINT-DETAIL.
072100*
072200 EVA-INIT-GF-10.
072300     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
072400     MOVE    1  TO REC-CT.
072500     MOVE   "J" TO WRK-XN-00001-1.
072600     MOVE   "A" TO WRK-XN-00001-2.
072700     MOVE   "N" TO WRK-XN-00001-3.
072800     GO TO   EVA-TEST-GF-10-1.
072900 EVA-DELETE-GF-10.
073000     PERFORM DE-LETE.
073100     PERFORM PRINT-DETAIL.
073200     GO TO   EVA-INIT-GF-11.
073300 EVA-TEST-GF-10-1.
073400     MOVE   "EVA-TEST-GF-10-1" TO PAR-NAME.
073500     EVALUATE WRK-XN-00001-3
073600        WHEN WRK-XN-00001-2 THRU WRK-XN-00001-1
073700             GO TO EVA-FAIL-GF-10-1.
073800     PERFORM PASS.
073900     GO TO   EVA-WRITE-GF-10-1.
074000 EVA-DELETE-GF-10-1.
074100     PERFORM DE-LETE.
074200     GO TO EVA-WRITE-GF-10-1.
074300 EVA-FAIL-GF-10-1.
074400     MOVE "SUBJECT IDENTIFIER SHOULD NOT BE WITHIN RANGE"
074500          TO RE-MARK
074600     PERFORM FAIL.
074700 EVA-WRITE-GF-10-1.
074800     PERFORM PRINT-DETAIL.
074900*
075000 EVA-TEST-GF-10-2.
075100     ADD     1 TO REC-CT.
075200     MOVE   "EVA-TEST-GF-10-2" TO PAR-NAME.
075300     EVALUATE WRK-XN-00001-3
075400        WHEN NOT WRK-XN-00001-2 THRU WRK-XN-00001-1
075500             PERFORM PASS
075600             GO TO   EVA-WRITE-GF-10-2.
075700     GO TO EVA-FAIL-GF-10-2.
075800 EVA-DELETE-GF-10-2.
075900     PERFORM DE-LETE.
076000     GO TO EVA-WRITE-GF-10-2.
076100 EVA-FAIL-GF-10-2.
076200     MOVE "  SUBJECT IDENTIFIER SHOULD NOT BE WITHIN RANGE"
076300          TO RE-MARK.
076400     PERFORM FAIL.
076500 EVA-WRITE-GF-10-2.
076600     PERFORM PRINT-DETAIL.
076700*
076800 EVA-INIT-GF-11.
076900     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
077000     MOVE    1  TO REC-CT.
077100     MOVE   "J" TO WRK-XN-00001-1.
077200     MOVE   "A" TO WRK-XN-00001-2.
077300     MOVE   "N" TO WRK-XN-00001-3.
077400     GO TO   EVA-TEST-GF-11-1.
077500 EVA-DELETE-GF-11.
077600     PERFORM DE-LETE.
077700     PERFORM PRINT-DETAIL.
077800     GO TO   EVA-INIT-GF-12.
077900 EVA-TEST-GF-11-1.
078000     MOVE   "EVA-TEST-GF-11-1" TO PAR-NAME.
078100     EVALUATE WRK-XN-00001-1
078200        WHEN "A" THROUGH "N"
078300             PERFORM PASS
078400             GO TO   EVA-WRITE-GF-11-1.
078500     GO TO EVA-FAIL-GF-11-1.
078600 EVA-DELETE-GF-11-1.
078700     PERFORM DE-LETE.
078800     GO TO EVA-WRITE-GF-11-1.
078900 EVA-FAIL-GF-11-1.
079000     MOVE   "SUBJECT IDENTIFIER SHOULD BE WITHIN RANGE"
079100          TO RE-MARK.
079200     PERFORM FAIL.
079300 EVA-WRITE-GF-11-1.
079400     PERFORM PRINT-DETAIL.
079500*
079600 EVA-TEST-GF-11-2.
079700     ADD     1       TO REC-CT.
079800     MOVE   "EVA-TEST-GF-11-2" TO PAR-NAME.
079900     EVALUATE WRK-XN-00001-1
080000        WHEN NOT "A" THROUGH "N"
080100             GO TO EVA-FAIL-GF-11-2.
080200     PERFORM PASS.
080300     GO TO   EVA-WRITE-GF-11-2.
080400 EVA-DELETE-GF-11-2.
080500     PERFORM DE-LETE.
080600     GO TO EVA-WRITE-GF-11-2.
080700 EVA-FAIL-GF-11-2.
080800     MOVE   "SUBJECT IDENTIFIER SHOULD BE WITHIN RANGE"
080900          TO RE-MARK
081000     PERFORM FAIL.
081100 EVA-WRITE-GF-11-2.
081200     PERFORM PRINT-DETAIL.
081300*
081400 EVA-INIT-GF-12.
081500     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
081600     MOVE    1  TO REC-CT.
081700     MOVE   "J" TO WRK-XN-00001-1.
081800     MOVE   "A" TO WRK-XN-00001-2.
081900     MOVE   "N" TO WRK-XN-00001-3.
082000     GO TO   EVA-TEST-GF-12-1.
082100 EVA-DELETE-GF-12.
082200     PERFORM DE-LETE.
082300     PERFORM PRINT-DETAIL.
082400     GO TO   EVA-INIT-GF-13.
082500 EVA-TEST-GF-12-1.
082600     MOVE   "EVA-TEST-GF-12-1" TO PAR-NAME.
082700     EVALUATE WRK-XN-00001-3
082800        WHEN "A" THROUGH "J"
082900             GO TO EVA-FAIL-GF-12-1.
083000     PERFORM PASS.
083100     GO TO   EVA-WRITE-GF-12-1.
083200 EVA-DELETE-GF-12-1.
083300     PERFORM DE-LETE.
083400     GO TO EVA-WRITE-GF-12-1.
083500 EVA-FAIL-GF-12-1.
083600     MOVE "SUBJECT IDENTIFIER SHOULD NOT BE WITHIN RANGE"
083700          TO RE-MARK
083800     PERFORM FAIL.
083900 EVA-WRITE-GF-12-1.
084000     PERFORM PRINT-DETAIL.
084100*
084200 EVA-TEST-GF-12-2.
084300     ADD     1 TO REC-CT.
084400     MOVE   "EVA-TEST-GF-12-2" TO PAR-NAME.
084500     EVALUATE WRK-XN-00001-3
084600        WHEN NOT "A" THROUGH "J"
084700             PERFORM PASS
084800             GO TO   EVA-WRITE-GF-12-2.
084900     GO TO   EVA-FAIL-GF-12-2.
085000 EVA-DELETE-GF-12-2.
085100     PERFORM DE-LETE.
085200     GO TO EVA-WRITE-GF-12-2.
085300 EVA-FAIL-GF-12-2.
085400     MOVE "  SUBJECT IDENTIFIER SHOULD NOT BE WITHIN RANGE"
085500          TO RE-MARK.
085600     PERFORM FAIL.
085700 EVA-WRITE-GF-12-2.
085800     PERFORM PRINT-DETAIL.
085900*
086000 EVA-INIT-GF-13.
086100     MOVE   "VI-84 6.12.4 GR1(a)" TO ANSI-REFERENCE.
086200     MOVE    1  TO REC-CT.
086300     MOVE    89 TO WRK-DU-08V00.
086400     GO TO   EVA-TEST-GF-13-1.
086500 EVA-DELETE-GF-13.
086600     PERFORM DE-LETE.
086700     PERFORM PRINT-DETAIL.
086800     GO TO   EVA-INIT-GF-14.
086900 EVA-TEST-GF-13-1.
087000     MOVE   "EVA-TEST-GF-13-1" TO PAR-NAME.
087100     EVALUATE WRK-DU-08V00
087200        WHEN (11 + (99 - 43)) THRU (20 * 5)
087300             PERFORM PASS
087400             GO TO   EVA-WRITE-GF-13-1.
087500     GO TO   EVA-FAIL-GF-13-1.
087600 EVA-DELETE-GF-13-1.
087700     PERFORM DE-LETE.
087800     GO TO EVA-WRITE-GF-13-1.
087900 EVA-FAIL-GF-13-1.
088000     MOVE   "SUBJECT IDENTIFIER SHOULD BE WITHIN RANGE"
088100          TO RE-MARK.
088200     PERFORM FAIL.
088300 EVA-WRITE-GF-13-1.
088400     PERFORM PRINT-DETAIL.
088500*
088600 EVA-TEST-GF-13-2.
088700     ADD     1       TO REC-CT.
088800     MOVE   "EVA-TEST-GF-13-2" TO PAR-NAME.
088900     EVALUATE WRK-DU-08V00
089000        WHEN NOT (11 + (99 - 43)) THRU (20 * 5)
089100             GO TO EVA-FAIL-GF-13-2.
089200     PERFORM PASS.
089300     GO TO   EVA-WRITE-GF-13-2.
089400 EVA-DELETE-GF-13-2.
089500     PERFORM DE-LETE.
089600     GO TO EVA-WRITE-GF-13-2.
089700 EVA-FAIL-GF-13-2.
089800     MOVE   "SUBJECT IDENTIFIER SHOULD BE WITHIN RANGE"
089900          TO RE-MARK
090000     PERFORM FAIL.
090100 EVA-WRITE-GF-13-2.
090200     PERFORM PRINT-DETAIL.
090300*
090400 EVA-INIT-GF-14.
090500     MOVE   "VI-84 6.12.4 GR1(A)" TO ANSI-REFERENCE.
090600     MOVE    1  TO REC-CT.
090700     MOVE    89 TO WRK-DU-08V00.
090800     GO TO   EVA-TEST-GF-14-1.
090900 EVA-DELETE-GF-14.
091000     PERFORM DE-LETE.
091100     PERFORM PRINT-DETAIL.
091200     GO TO   EVA-INIT-GF-15.
091300 EVA-TEST-GF-14-1.
091400     MOVE   "EVA-TEST-GF-14-1" TO PAR-NAME.
091500     EVALUATE WRK-DU-08V00
091600        WHEN (11 + (99 - 20)) THRU (20 * 5)
091700             GO TO EVA-FAIL-GF-14-1.
091800     PERFORM PASS.
091900     GO TO   EVA-WRITE-GF-14-1.
092000 EVA-DELETE-GF-14-1.
092100     PERFORM DE-LETE.
092200     GO TO EVA-WRITE-GF-14-1.
092300 EVA-FAIL-GF-14-1.
092400     MOVE "SUBJECT IDENTIFIER SHOULD NOT BE WITHIN RANGE"
092500          TO RE-MARK
092600     PERFORM FAIL.
092700 EVA-WRITE-GF-14-1.
092800     PERFORM PRINT-DETAIL.
092900*
093000 EVA-TEST-GF-14-2.
093100     ADD     1 TO REC-CT.
093200     MOVE   "EVA-TEST-GF-14-2" TO PAR-NAME.
093300     EVALUATE WRK-DU-08V00
093400        WHEN NOT (11 + (99 - 20)) THRU (20 * 5)
093500             PERFORM PASS
093600             GO TO   EVA-WRITE-GF-14-2.
093700     GO TO   EVA-FAIL-GF-14-2.
093800 EVA-DELETE-GF-14-2.
093900     PERFORM DE-LETE.
094000     GO TO EVA-WRITE-GF-14-2.
094100 EVA-FAIL-GF-14-2.
094200     MOVE   "SUBJECT IDENTIFIER SHOULD NOT BE WITHIN RANGE"
094300          TO RE-MARK.
094400     PERFORM FAIL.
094500 EVA-WRITE-GF-14-2.
094600     PERFORM PRINT-DETAIL.
094700*
094800 EVA-INIT-GF-15.
094900     MOVE   "VI-84 6.12.4 GR1(b)" TO ANSI-REFERENCE.
095000     MOVE    1  TO REC-CT.
095100     MOVE    26 TO WRK-DU-08V00.
095200     GO TO   EVA-TEST-GF-15-1.
095300 EVA-DELETE-GF-15.
095400     PERFORM DE-LETE.
095500     PERFORM PRINT-DETAIL.
095600     GO TO   EVA-INIT-GF-16.
095700 EVA-TEST-GF-15-1.
095800     MOVE   "EVA-TEST-GF-15-1" TO PAR-NAME.
095900     EVALUATE 26
096000        WHEN WRK-DU-08V00
096100             PERFORM PASS
096200             GO TO   EVA-WRITE-GF-15-1.
096300     GO TO   EVA-FAIL-GF-15-1.
096400 EVA-DELETE-GF-15-1.
096500     PERFORM DE-LETE.
096600     GO TO EVA-WRITE-GF-15-1.
096700 EVA-FAIL-GF-15-1.
096800     MOVE   "IDENTIFIER AND LITERAL SHOULD BE EQUAL"
096900          TO RE-MARK.
097000     PERFORM FAIL.
097100 EVA-WRITE-GF-15-1.
097200     PERFORM PRINT-DETAIL.
097300*
097400 EVA-TEST-GF-15-2.
097500     ADD     1       TO REC-CT.
097600     MOVE   "EVA-TEST-GF-15-2" TO PAR-NAME.
097700     EVALUATE 26
097800        WHEN NOT WRK-DU-08V00
097900             GO TO EVA-FAIL-GF-15-2.
098000     PERFORM PASS.
098100     GO TO   EVA-WRITE-GF-15-2.
098200 EVA-DELETE-GF-15-2.
098300     PERFORM DE-LETE.
098400     GO TO EVA-WRITE-GF-15-2.
098500 EVA-FAIL-GF-15-2.
098600     MOVE   "IDENTIFIER AND LITERAL SHOULD BE EQUAL"
098700          TO RE-MARK
098800     PERFORM FAIL.
098900 EVA-WRITE-GF-15-2.
099000     PERFORM PRINT-DETAIL.
099100*
099200 EVA-INIT-GF-16.
099300     MOVE   "VI-84 6.12.4 GR1(b)" TO ANSI-REFERENCE.
099400     MOVE    1  TO REC-CT.
099500     MOVE    78 TO WRK-DU-08V00.
099600     GO TO   EVA-TEST-GF-16-1.
099700 EVA-DELETE-GF-16.
099800     PERFORM DE-LETE.
099900     PERFORM PRINT-DETAIL.
100000     GO TO   EVA-INIT-GF-17.
100100 EVA-TEST-GF-16-1.
100200     MOVE   "EVA-TEST-GF-16-1" TO PAR-NAME.
100300     EVALUATE 1234
100400        WHEN WRK-DU-08V00
100500             GO TO EVA-FAIL-GF-16-1.
100600     PERFORM PASS.
100700     GO TO   EVA-WRITE-GF-16-1.
100800 EVA-DELETE-GF-16-1.
100900     PERFORM DE-LETE.
101000     GO TO EVA-WRITE-GF-16-1.
101100 EVA-FAIL-GF-16-1.
101200     MOVE   "IDENTIFIER AND LITERAL SHOULD NOT BE EQUAL"
101300          TO RE-MARK
101400     PERFORM FAIL.
101500 EVA-WRITE-GF-16-1.
101600     PERFORM PRINT-DETAIL.
101700*
101800 EVA-TEST-GF-16-2.
101900     ADD     1 TO REC-CT.
102000     MOVE   "EVA-TEST-GF-16-2" TO PAR-NAME.
102100     EVALUATE 1234
102200        WHEN NOT WRK-DU-08V00
102300             PERFORM PASS
102400             GO TO   EVA-WRITE-GF-16-2.
102500     GO TO   EVA-FAIL-GF-16-2.
102600 EVA-DELETE-GF-16-2.
102700     PERFORM DE-LETE.
102800     GO TO EVA-WRITE-GF-16-2.
102900 EVA-FAIL-GF-16-2.
103000     MOVE   "IDENTIFIER AND LITERAL SHOULD NOT BE EQUAL"
103100          TO RE-MARK.
103200     PERFORM FAIL.
103300 EVA-WRITE-GF-16-2.
103400     PERFORM PRINT-DETAIL.
103500*
103600 EVA-INIT-GF-17.
103700     MOVE   "VI-84 6.12.4 GR1(d)" TO ANSI-REFERENCE.
103800     MOVE    1  TO REC-CT.
103900     MOVE    8  TO WRK-XN-00001-1.
104000     GO TO   EVA-TEST-GF-17-1.
104100 EVA-DELETE-GF-17.
104200     PERFORM DE-LETE.
104300     PERFORM PRINT-DETAIL.
104400     GO TO   EVA-INIT-GF-18.
104500 EVA-TEST-GF-17-1.
104600     MOVE   "EVA-TEST-GF-17-1" TO PAR-NAME.
104700     EVALUATE WRK-XN-00001-1 NUMERIC
104800        WHEN TRUE
104900             PERFORM PASS
105000             GO TO   EVA-WRITE-GF-17-1.
105100     GO TO   EVA-FAIL-GF-17-1.
105200 EVA-DELETE-GF-17-1.
105300     PERFORM DE-LETE.
105400     GO TO EVA-WRITE-GF-17-1.
105500 EVA-FAIL-GF-17-1.
105600     MOVE   "CONDITIONAL EXPRESSION SHOULD BE TRUE"
105700          TO RE-MARK.
105800     PERFORM FAIL.
105900 EVA-WRITE-GF-17-1.
106000     PERFORM PRINT-DETAIL.
106100*
106200 EVA-TEST-GF-17-2.
106300     ADD     1       TO REC-CT.
106400     MOVE   "EVA-TEST-GF-17-2" TO PAR-NAME.
106500     EVALUATE WRK-XN-00001-1 NUMERIC
106600        WHEN FALSE
106700             GO TO EVA-FAIL-GF-17-2.
106800     PERFORM PASS.
106900     GO TO   EVA-WRITE-GF-17-2.
107000 EVA-DELETE-GF-17-2.
107100     PERFORM DE-LETE.
107200     GO TO EVA-WRITE-GF-17-2.
107300 EVA-FAIL-GF-17-2.
107400     MOVE   "CONDITIONAL EXPRESSION SHOULD BE TRUE"
107500          TO RE-MARK
107600     PERFORM FAIL.
107700 EVA-WRITE-GF-17-2.
107800     PERFORM PRINT-DETAIL.
107900*
108000 EVA-TEST-GF-17-3.
108100     ADD     1       TO REC-CT.
108200     MOVE   "EVA-TEST-GF-17-3" TO PAR-NAME.
108300     EVALUATE WRK-XN-00001-1 NUMERIC
108400        WHEN ANY
108500             PERFORM PASS
108600             GO TO   EVA-WRITE-GF-17-3.
108700     GO TO   EVA-FAIL-GF-17-3.
108800 EVA-DELETE-GF-17-3.
108900     PERFORM DE-LETE.
109000     GO TO EVA-WRITE-GF-17-3.
109100 EVA-FAIL-GF-17-3.
109200     MOVE   "WHEN 'ANY' SHOULD HAVE EXECUTED" TO RE-MARK
109300     PERFORM FAIL.
109400 EVA-WRITE-GF-17-3.
109500     PERFORM PRINT-DETAIL.
109600*
109700 EVA-INIT-GF-18.
109800     MOVE   "VI-84 6.12.4 GR1(d)" TO ANSI-REFERENCE.
109900     MOVE    1  TO REC-CT.
110000     MOVE   "*" TO WRK-XN-00001-1.
110100     GO TO   EVA-TEST-GF-18-1.
110200 EVA-DELETE-GF-18.
110300     PERFORM DE-LETE.
110400     PERFORM PRINT-DETAIL.
110500     GO TO   EVA-INIT-GF-19.
110600 EVA-TEST-GF-18-1.
110700     MOVE   "EVA-TEST-GF-18-1" TO PAR-NAME.
110800     EVALUATE WRK-XN-00001-1 NUMERIC
110900        WHEN TRUE
111000             GO TO EVA-FAIL-GF-18-1.
111100     PERFORM PASS.
111200     GO TO   EVA-WRITE-GF-18-1.
111300 EVA-DELETE-GF-18-1.
111400     PERFORM DE-LETE.
111500     GO TO EVA-WRITE-GF-18-1.
111600 EVA-FAIL-GF-18-1.
111700     MOVE   "CONDITIONAL EXPRESSION SHOULD BE FALSE"
111800          TO RE-MARK
111900     PERFORM FAIL.
112000 EVA-WRITE-GF-18-1.
112100     PERFORM PRINT-DETAIL.
112200*
112300 EVA-TEST-GF-18-2.
112400     ADD     1 TO REC-CT.
112500     MOVE   "EVA-TEST-GF-18-2" TO PAR-NAME.
112600     EVALUATE WRK-XN-00001-1 NUMERIC
112700        WHEN FALSE
112800             PERFORM PASS
112900             GO TO   EVA-WRITE-GF-18-2.
113000     GO TO   EVA-WRITE-GF-18-2.
113100 EVA-DELETE-GF-18-2.
113200     PERFORM DE-LETE.
113300     GO TO EVA-WRITE-GF-18-2.
113400 EVA-FAIL-GF-18-2.
113500     MOVE   "CONDITIONAL EXPRESSION SHOULD BE FALSE"
113600          TO RE-MARK.
113700     PERFORM FAIL.
113800 EVA-WRITE-GF-18-2.
113900     PERFORM PRINT-DETAIL.
114000*
114100 EVA-TEST-GF-18-3.
114200     ADD     1       TO REC-CT.
114300     MOVE   "EVA-TEST-GF-18-3" TO PAR-NAME.
114400     EVALUATE WRK-XN-00001-1 NUMERIC
114500        WHEN ANY
114600             PERFORM PASS
114700             GO TO   EVA-WRITE-GF-18-3.
114800     GO TO   EVA-FAIL-GF-18-3.
114900 EVA-DELETE-GF-18-3.
115000     PERFORM DE-LETE.
115100     GO TO EVA-WRITE-GF-18-3.
115200 EVA-FAIL-GF-18-3.
115300     MOVE   "WHEN 'ANY' SHOULD HAVE EXECUTED" TO RE-MARK
115400     PERFORM FAIL.
115500 EVA-WRITE-GF-18-3.
115600     PERFORM PRINT-DETAIL.
115700*
115800 EVA-INIT-GF-19.
115900     MOVE   "VI-84 6.12.4 GR1(c)" TO ANSI-REFERENCE.
116000     MOVE    1  TO REC-CT.
116100     MOVE    9  TO WRK-DU-08V00.
116200     GO TO   EVA-TEST-GF-19-1.
116300 EVA-DELETE-GF-19.
116400     PERFORM DE-LETE.
116500     PERFORM PRINT-DETAIL.
116600     GO TO   EVA-INIT-GF-20.
116700 EVA-TEST-GF-19-1.
116800     MOVE   "EVA-TEST-GF-19-1" TO PAR-NAME.
116900     EVALUATE (WRK-DU-08V00 * 9)
117000        WHEN WS-81
117100             PERFORM PASS
117200             GO TO   EVA-WRITE-GF-19-1.
117300     GO TO   EVA-FAIL-GF-19-1.
117400 EVA-DELETE-GF-19-1.
117500     PERFORM DE-LETE.
117600     GO TO EVA-WRITE-GF-19-1.
117700 EVA-FAIL-GF-19-1.
117800     MOVE   "SELECTION SUBJECT SHOULD EQUAL IDENTIFIER"
117900          TO RE-MARK.
118000     PERFORM FAIL.
118100 EVA-WRITE-GF-19-1.
118200     PERFORM PRINT-DETAIL.
118300*
118400 EVA-TEST-GF-19-2.
118500     ADD     1       TO REC-CT.
118600     MOVE   "EVA-TEST-GF-19-2" TO PAR-NAME.
118700     EVALUATE (WRK-DU-08V00 * 9)
118800        WHEN 81
118900             PERFORM PASS
119000             GO TO   EVA-WRITE-GF-19-2.
119100     GO TO   EVA-FAIL-GF-19-2.
119200 EVA-DELETE-GF-19-2.
119300     PERFORM DE-LETE.
119400     GO TO EVA-WRITE-GF-19-2.
119500 EVA-FAIL-GF-19-2.
119600     MOVE   "SELECTION SUBJECT SHOULD EQUAL LITERAL"
119700          TO RE-MARK.
119800     PERFORM FAIL.
119900 EVA-WRITE-GF-19-2.
120000     PERFORM PRINT-DETAIL.
120100*
120200 EVA-TEST-GF-19-3.
120300     ADD     1       TO REC-CT.
120400     MOVE   "EVA-TEST-GF-19-3" TO PAR-NAME.
120500     EVALUATE (WRK-DU-08V00 * 9)
120600        WHEN (9 + 9 + 9 + 9 + 9 + 9 + 9 + 9 + 9)
120700             PERFORM PASS
120800             GO TO   EVA-WRITE-GF-19-3.
120900     GO TO   EVA-FAIL-GF-19-3.
121000 EVA-DELETE-GF-19-3.
121100     PERFORM DE-LETE.
121200     GO TO EVA-WRITE-GF-19-3.
121300 EVA-FAIL-GF-19-3.
121400     MOVE   "SELECTION SUBJECT SHOULD EQUAL ARITHMETIC EXPRESSION"
121500          TO RE-MARK.
121600     PERFORM FAIL.
121700 EVA-WRITE-GF-19-3.
121800     PERFORM PRINT-DETAIL.
121900*
122000 EVA-INIT-GF-20.
122100     MOVE   "VI-84 6.12.4 GR1(c)" TO ANSI-REFERENCE.
122200     MOVE    1  TO REC-CT.
122300     MOVE    8  TO WRK-DU-08V00.
122400     GO TO   EVA-TEST-GF-20-1.
122500 EVA-DELETE-GF-20.
122600     PERFORM DE-LETE.
122700     PERFORM PRINT-DETAIL.
122800     GO TO   EVA-INIT-GF-21.
122900 EVA-TEST-GF-20-1.
123000     MOVE   "EVA-TEST-GF-20-1" TO PAR-NAME.
123100     EVALUATE (WRK-DU-08V00 * 9)
123200        WHEN WS-81
123300             GO TO EVA-FAIL-GF-20-1.
123400     PERFORM PASS.
123500     GO TO   EVA-WRITE-GF-20-1.
123600 EVA-DELETE-GF-20-1.
123700     PERFORM DE-LETE.
123800     GO TO EVA-WRITE-GF-20-1.
123900 EVA-FAIL-GF-20-1.
124000     MOVE "SELECTION SUBJECT SHOULD NOT EQUAL IDENTIFIER"
124100          TO RE-MARK
124200     PERFORM FAIL.
124300 EVA-WRITE-GF-20-1.
124400     PERFORM PRINT-DETAIL.
124500*
124600 EVA-TEST-GF-20-2.
124700     ADD     1 TO REC-CT.
124800     MOVE   "EVA-TEST-GF-20-2" TO PAR-NAME.
124900     EVALUATE (WRK-DU-08V00 * 9)
125000        WHEN 81
125100             GO TO EVA-FAIL-GF-20-2.
125200     PERFORM PASS.
125300     GO TO   EVA-WRITE-GF-20-2.
125400 EVA-DELETE-GF-20-2.
125500     PERFORM DE-LETE.
125600     GO TO EVA-WRITE-GF-20-2.
125700 EVA-FAIL-GF-20-2.
125800     MOVE   "SELECTION SUBJECT SHOULD NOT EQUAL LITERAL"
125900          TO RE-MARK
126000     PERFORM FAIL.
126100 EVA-WRITE-GF-20-2.
126200     PERFORM PRINT-DETAIL.
126300
126400 EVA-TEST-GF-20-3.
126500     ADD     1       TO REC-CT.
126600     MOVE   "EVA-TEST-GF-20-3" TO PAR-NAME.
126700     EVALUATE (WRK-DU-08V00 * 9)
126800        WHEN (9 + 9 + 9 + 9 + 9 + 9 + 9 + 9 + 9)
126900             GO TO EVA-FAIL-GF-20-3.
127000     PERFORM PASS.
127100     GO TO   EVA-WRITE-GF-20-3.
127200 EVA-DELETE-GF-20-3.
127300     PERFORM DE-LETE.
127400     GO TO EVA-WRITE-GF-20-3.
127500 EVA-FAIL-GF-20-3.
127600     MOVE
127700     "SELECTION SUBJECT SHOULD NOT = ARITHMETIC EXPRESSION"
127800          TO RE-MARK
127900     PERFORM FAIL.
128000 EVA-WRITE-GF-20-3.
128100     PERFORM PRINT-DETAIL.
128200*
128300 EVA-INIT-GF-21.
128400     MOVE   "VI-84 6.12.4 GR1(e)" TO ANSI-REFERENCE.
128500     MOVE    1  TO REC-CT.
128600     MOVE    SPACE TO WRK-XN-00001-1.
128700     GO TO   EVA-TEST-GF-21-1.
128800 EVA-DELETE-GF-21.
128900     PERFORM DE-LETE.
129000     PERFORM PRINT-DETAIL.
129100     GO TO   EVA-INIT-GF-22.
129200 EVA-TEST-GF-21-1.
129300     MOVE   "EVA-TEST-GF-21-1" TO PAR-NAME.
129400     EVALUATE TRUE
129500        WHEN WRK-XN-00001-1 = SPACE
129600             PERFORM PASS
129700             GO TO   EVA-WRITE-GF-21-1.
129800     GO TO   EVA-FAIL-GF-21-1.
129900 EVA-DELETE-GF-21-1.
130000     PERFORM DE-LETE.
130100     GO TO EVA-WRITE-GF-21-1.
130200 EVA-FAIL-GF-21-1.
130300     MOVE   "SELECTION OBJECT CONDITION SHOULD BE TRUE"
130400          TO RE-MARK.
130500     PERFORM FAIL.
130600 EVA-WRITE-GF-21-1.
130700     PERFORM PRINT-DETAIL.
130800*
130900 EVA-INIT-GF-22.
131000     MOVE   "VI-84 6.12.4 GR1(e)" TO ANSI-REFERENCE.
131100     MOVE    1  TO REC-CT.
131200     MOVE   "#" TO WRK-XN-00001-1.
131300     GO TO   EVA-TEST-GF-22-1.
131400 EVA-DELETE-GF-22.
131500     PERFORM DE-LETE.
131600     PERFORM PRINT-DETAIL.
131700     GO TO   EVA-INIT-GF-23.
131800 EVA-TEST-GF-22-1.
131900     MOVE   "EVA-TEST-GF-22-1" TO PAR-NAME.
132000     EVALUATE TRUE
132100        WHEN WRK-XN-00001-1 = SPACE
132200             GO TO EVA-FAIL-GF-22-1.
132300     PERFORM PASS.
132400     GO TO   EVA-WRITE-GF-22-1.
132500 EVA-DELETE-GF-22-1.
132600     PERFORM DE-LETE.
132700     GO TO EVA-WRITE-GF-22-1.
132800 EVA-FAIL-GF-22-1.
132900     MOVE   "SELECTION OBJECT CONDITION SHOULD BE FALSE"
133000          TO RE-MARK
133100     PERFORM FAIL.
133200 EVA-WRITE-GF-22-1.
133300     PERFORM PRINT-DETAIL.
133400*
133500 EVA-INIT-GF-23.
133600     MOVE   "VI-84 6.12.4 GR1(e)" TO ANSI-REFERENCE.
133700     MOVE    1  TO REC-CT.
133800     MOVE    SPACE TO WRK-XN-00001-1.
133900     GO TO   EVA-TEST-GF-23-1.
134000 EVA-DELETE-GF-23.
134100     PERFORM DE-LETE.
134200     PERFORM PRINT-DETAIL.
134300     GO TO   EVA-INIT-GF-24.
134400 EVA-TEST-GF-23-1.
134500     MOVE   "EVA-TEST-GF-23-1" TO PAR-NAME.
134600     EVALUATE FALSE
134700        WHEN WRK-XN-00001-1 = SPACE
134800             GO TO EVA-FAIL-GF-23-1.
134900     PERFORM PASS.
135000     GO TO   EVA-WRITE-GF-23-1.
135100 EVA-DELETE-GF-23-1.
135200     PERFORM DE-LETE.
135300     GO TO EVA-WRITE-GF-23-1.
135400 EVA-FAIL-GF-23-1.
135500     MOVE   "SELECTION OBJECT CONDITION SHOULD BE TRUE"
135600          TO RE-MARK
135700     PERFORM FAIL.
135800 EVA-WRITE-GF-23-1.
135900     PERFORM PRINT-DETAIL.
136000*
136100 EVA-INIT-GF-24.
136200     MOVE   "VI-84 6.12.4 GR1(e)" TO ANSI-REFERENCE.
136300     MOVE    1  TO REC-CT.
136400     MOVE   "#" TO WRK-XN-00001-1.
136500     GO TO   EVA-TEST-GF-24-1.
136600 EVA-DELETE-GF-24.
136700     PERFORM DE-LETE.
136800     PERFORM PRINT-DETAIL.
136900     GO TO   EVA-INIT-GF-25.
137000 EVA-TEST-GF-24-1.
137100     MOVE   "EVA-TEST-GF-24-1" TO PAR-NAME.
137200     EVALUATE FALSE
137300        WHEN WRK-XN-00001-1 = SPACE
137400             PERFORM PASS
137500             GO TO   EVA-WRITE-GF-24-1.
137600     GO TO   EVA-FAIL-GF-24-1.
137700 EVA-DELETE-GF-24-1.
137800     PERFORM DE-LETE.
137900     GO TO EVA-WRITE-GF-24-1.
138000 EVA-FAIL-GF-24-1.
138100     MOVE   "SELECTION OBJECT CONDITION SHOULD BE FALSE"
138200          TO RE-MARK.
138300     PERFORM FAIL.
138400 EVA-WRITE-GF-24-1.
138500     PERFORM PRINT-DETAIL.
138600*
138700 EVA-INIT-GF-25.
138800     MOVE   "VI-84 6.12.4 GR3(b)" TO ANSI-REFERENCE.
138900     MOVE    1  TO REC-CT.
139000     MOVE    26 TO WRK-DU-08V00.
139100     GO TO   EVA-TEST-GF-25-1.
139200 EVA-DELETE-GF-25.
139300     PERFORM DE-LETE.
139400     PERFORM PRINT-DETAIL.
139500     GO TO   EVA-INIT-GF-16.
139600 EVA-TEST-GF-25-1.
139700     MOVE   "EVA-TEST-GF-25-1" TO PAR-NAME.
139800     EVALUATE 26
139900        WHEN WRK-DU-08V00
140000             PERFORM PASS
140100        WHEN OTHER
140200             GO TO EVA-FAIL-GF-25-1.
140300     GO TO EVA-WRITE-GF-25-1.
140400 EVA-DELETE-GF-25-1.
140500     PERFORM DE-LETE.
140600     GO TO EVA-WRITE-GF-25-1.
140700 EVA-FAIL-GF-25-1.
140800     MOVE   "IDENTIFIER AND LITERAL SHOULD BE EQUAL"
140900          TO RE-MARK
141000     PERFORM FAIL.
141100 EVA-WRITE-GF-25-1.
141200     PERFORM PRINT-DETAIL.
141300*
141400 EVA-INIT-GF-26.
141500     MOVE   "VI-84 6.12.4 GR3(b)" TO ANSI-REFERENCE.
141600     MOVE    1  TO REC-CT.
141700     MOVE    78 TO WRK-DU-08V00.
141800     GO TO   EVA-TEST-GF-26-1.
141900 EVA-DELETE-GF-26.
142000     PERFORM DE-LETE.
142100     PERFORM PRINT-DETAIL.
142200     GO TO   EVA-INIT-GF-27.
142300 EVA-TEST-GF-26-1.
142400     MOVE   "EVA-TEST-GF-26-1" TO PAR-NAME.
142500     EVALUATE 1234
142600        WHEN WRK-DU-08V00
142700             GO TO EVA-FAIL-GF-26-1
142800        WHEN OTHER
142900             PERFORM PASS.
143000     GO TO EVA-WRITE-GF-26-1.
143100 EVA-DELETE-GF-26-1.
143200     PERFORM DE-LETE.
143300     GO TO EVA-WRITE-GF-26-1.
143400 EVA-FAIL-GF-26-1.
143500     MOVE   "IDENTIFIER AND LITERAL SHOULD NOT BE EQUAL"
143600          TO RE-MARK
143700     PERFORM FAIL.
143800 EVA-WRITE-GF-26-1.
143900     PERFORM PRINT-DETAIL.
144000*
144100 EVA-INIT-GF-27.
144200     MOVE   "VI-84 6.12.4 GR3(c)" TO ANSI-REFERENCE.
144300     MOVE    1  TO REC-CT.
144400     MOVE    26 TO WRK-DU-08V00.
144500     GO TO   EVA-TEST-GF-27-1.
144600 EVA-DELETE-GF-27.
144700     PERFORM DE-LETE.
144800     PERFORM PRINT-DETAIL.
144900     GO TO   EVA-INIT-GF-28.
145000 EVA-TEST-GF-27-1.
145100     MOVE   "EVA-TEST-GF-27-1" TO PAR-NAME.
145200     EVALUATE 26
145300        WHEN NOT WRK-DU-08V00
145400             GO TO   EVA-FAIL-GF-27-1
145500     END-EVALUATE.
145600     PERFORM PASS.
145700     GO TO   EVA-WRITE-GF-27-1.
145800 EVA-DELETE-GF-27-1.
145900     PERFORM DE-LETE.
146000     GO TO EVA-WRITE-GF-27-1.
146100 EVA-FAIL-GF-27-1.
146200     MOVE   "IDENTIFIER AND LITERAL SHOULD BE EQUAL"
146300          TO RE-MARK
146400     PERFORM FAIL.
146500 EVA-WRITE-GF-27-1.
146600     PERFORM PRINT-DETAIL.
146700*
146800 EVA-INIT-GF-28.
146900     MOVE   "VI-84 6.12.4 GR3(c)" TO ANSI-REFERENCE.
147000     MOVE    1  TO REC-CT.
147100     MOVE    78 TO WRK-DU-08V00.
147200     GO TO   EVA-TEST-GF-28-1.
147300 EVA-DELETE-GF-28.
147400     PERFORM DE-LETE.
147500     PERFORM PRINT-DETAIL.
147600     GO TO   EVA-INIT-GF-29.
147700 EVA-TEST-GF-28-1.
147800     MOVE   "EVA-TEST-GF-28-1" TO PAR-NAME.
147900     EVALUATE 1234
148000        WHEN NOT WRK-DU-08V00
148100             PERFORM PASS
148200             GO TO   EVA-WRITE-GF-28-1
148300     end-evaluate.
148400     GO TO   EVA-FAIL-GF-28-1.
148500 EVA-DELETE-GF-28-1.
148600     PERFORM DE-LETE.
148700     GO TO EVA-WRITE-GF-28-1.
148800 EVA-FAIL-GF-28-1.
148900     MOVE   "IDENTIFIER AND LITERAL SHOULD NOT BE EQUAL"
149000          TO RE-MARK.
149100     PERFORM FAIL.
149200 EVA-WRITE-GF-28-1.
149300     PERFORM PRINT-DETAIL.
149400*
149500 EVA-INIT-GF-29.
149600     MOVE   "VI-84 6.12.4 GR3" TO ANSI-REFERENCE.
149700     MOVE    1  TO REC-CT.
149800     MOVE    8  TO WRK-XN-00001-1.
149900     GO TO   EVA-TEST-GF-29-1.
150000 EVA-DELETE-GF-29.
150100     PERFORM DE-LETE.
150200     PERFORM PRINT-DETAIL.
150300     GO TO   EVA-INIT-GF-30.
150400 EVA-TEST-GF-29-1.
150500     MOVE   "EVA-TEST-GF-29-1" TO PAR-NAME.
150600     EVALUATE WRK-XN-00001-1 NUMERIC
150700        WHEN TRUE
150800             PERFORM PASS
150900        WHEN OTHER
151000             GO TO   EVA-FAIL-GF-29-1
151100     END-EVALUATE
151200     GO TO   EVA-WRITE-GF-29-1.
151300 EVA-DELETE-GF-29-1.
151400     PERFORM DE-LETE.
151500     GO TO EVA-WRITE-GF-29-1.
151600 EVA-FAIL-GF-29-1.
151700     MOVE   "CONDITIONAL EXPRESSION SHOULD BE TRUE"
151800          TO RE-MARK
151900     PERFORM FAIL.
152000 EVA-WRITE-GF-29-1.
152100     PERFORM PRINT-DETAIL.
152200*
152300 EVA-INIT-GF-30.
152400     MOVE   "VI-84 6.12.4 GR3" TO ANSI-REFERENCE.
152500     MOVE    1  TO REC-CT.
152600     MOVE   "*" TO WRK-XN-00001-1.
152700     GO TO   EVA-TEST-GF-30-1.
152800 EVA-DELETE-GF-30.
152900     PERFORM DE-LETE.
153000     PERFORM PRINT-DETAIL.
153100     GO TO   EVA-INIT-GF-31.
153200 EVA-TEST-GF-30-1.
153300     MOVE   "EVA-TEST-GF-30-1" TO PAR-NAME.
153400     EVALUATE WRK-XN-00001-1 NUMERIC
153500        WHEN TRUE
153600             GO TO EVA-FAIL-GF-30-1
153700        WHEN OTHER
153800             PERFORM PASS
153900     END-EVALUATE
154000     GO TO   EVA-WRITE-GF-30-1.
154100 EVA-DELETE-GF-30-1.
154200     PERFORM DE-LETE.
154300     GO TO EVA-WRITE-GF-30-1.
154400 EVA-FAIL-GF-30-1.
154500     MOVE   "CONDITIONAL EXPRESSION SHOULD BE FALSE"
154600          TO RE-MARK
154700     PERFORM FAIL.
154800 EVA-WRITE-GF-30-1.
154900     PERFORM PRINT-DETAIL.
155000*
155100 EVA-INIT-GF-31.
155200     MOVE   "VI-84 6.12.4 GR3" TO ANSI-REFERENCE.
155300     MOVE   "EVA-TEST-GF-31-1"   TO PAR-NAME.
155400     MOVE    1   TO REC-CT.
155500     MOVE    81  TO WRK-DU-08V00.
155600     MOVE   "*"  TO WRK-XN-00001-1.
155700     MOVE    "*" TO WRK-XN-00001-2.
155800     MOVE    987 TO WRK-DU-08V00-1.
155900     MOVE    81  TO WRK-DU-08V00-2.
156000     MOVE    0   TO WRK-DU-08V00-3.
156100     MOVE    567 TO WRK-DU-08V00-4.
156200     GO TO   EVA-TEST-GF-31-0.
156300 EVA-DELETE-GF-31.
156400     PERFORM DE-LETE.
156500     PERFORM PRINT-DETAIL.
156600     GO TO   EVA-INIT-GF-32.
156700 EVA-TEST-GF-31-0.
156800     EVALUATE     WRK-DU-08V00
156900             ALSO 81
157000             ALSO (WRK-DU-08V00 * 9)
157100             ALSO IT-IS-81
157200             ALSO TRUE
157300             ALSO FALSE
157400        WHEN NOT  WRK-DU-08V00-1
157500             ALSO WRK-DU-08V00-2
157600             ALSO 729
157700             ALSO TRUE
157800             ALSO WRK-DU-08V00-3 = 0
157900             ALSO WRK-DU-08V00-4 < 9
158000                  MOVE  "A" TO WRK-XN-00001-1
158100                  MOVE  "B" TO WRK-XN-00001-2
158200        WHEN      81
158300             ALSO WRK-DU-08V00
158400             ALSO (9 * 9 * 9)
158500             ALSO FALSE
158600             ALSO WRK-XN-00001-2 = "*"
158700             ALSO WRK-DU-08V00 > 8
158800                  MOVE  "C" TO WRK-XN-00001-1
158900                  MOVE  "D" TO WRK-XN-00001-2
159000        WHEN      ANY
159100             ALSO ANY
159200             ALSO ANY
159300             ALSO ANY
159400             ALSO ANY
159500             ALSO WRK-DU-08V00 = 6
159600                  MOVE  "E" TO WRK-XN-00001-1
159700                  MOVE  "F" TO WRK-XN-00001-2
159800        WHEN      OTHER
159900                  MOVE  "G" TO WRK-XN-00001-1
160000                  MOVE  "H" TO WRK-XN-00001-2
160100     END-EVALUATE.
160200 EVA-TEST-GF-31-1.
160300     IF      WRK-XN-00001-1 = "A"
160400             PERFORM PASS
160500             GO TO EVA-WRITE-GF-31-1
160600     ELSE
160700             GO TO EVA-FAIL-GF-31-1.
160800 EVA-DELETE-GF-31-1.
160900     PERFORM DE-LETE.
161000     GO TO EVA-WRITE-GF-31-1.
161100 EVA-FAIL-GF-31-1.
161200     MOVE   "EVALUATE FAILURE" TO RE-MARK
161300     MOVE    WRK-XN-00001-1 TO COMPUTED-X
161400     MOVE   "A"             TO CORRECT-X
161500     PERFORM FAIL.
161600 EVA-WRITE-GF-31-1.
161700     PERFORM PRINT-DETAIL.
161800 EVA-TEST-GF-31-2.
161900     IF      WRK-XN-00001-2 = "B"
162000             PERFORM PASS
162100             GO TO EVA-WRITE-GF-31-2
162200     ELSE
162300             GO TO EVA-FAIL-GF-31-2.
162400 EVA-DELETE-GF-31-2.
162500     PERFORM DE-LETE.
162600     GO TO EVA-WRITE-GF-31-2.
162700 EVA-FAIL-GF-31-2.
162800     MOVE   "EVALUATE FAILURE" TO RE-MARK
162900     MOVE    WRK-XN-00001-2 TO COMPUTED-X
163000     MOVE   "B"             TO CORRECT-X
163100     PERFORM FAIL.
163200 EVA-WRITE-GF-31-2.
163300     PERFORM PRINT-DETAIL.
163400*
163500 EVA-INIT-GF-32.
163600     MOVE   "VI-84 6.12.4 GR3" TO ANSI-REFERENCE.
163700     MOVE   "EVA-TEST-GF-32-1"   TO PAR-NAME.
163800     MOVE    1   TO REC-CT.
163900     MOVE    81  TO WRK-DU-08V00.
164000     MOVE   "*"  TO WRK-XN-00001-1.
164100     MOVE    987 TO WRK-DU-08V00-1.
164200     MOVE    7   TO WRK-DU-08V00-2.
164300     MOVE    0   TO WRK-DU-08V00-3.
164400     MOVE    567 TO WRK-DU-08V00-4.
164500     GO TO   EVA-TEST-GF-32-0.
164600 EVA-DELETE-GF-32.
164700     PERFORM DE-LETE.
164800     PERFORM PRINT-DETAIL.
164900     GO TO   EVA-INIT-GF-33.
165000 EVA-TEST-GF-32-0.
165100     EVALUATE     WRK-DU-08V00
165200             ALSO 81
165300             ALSO (WRK-DU-08V00 * 2)
165400             ALSO IT-IS-81
165500             ALSO TRUE
165600             ALSO FALSE
165700        WHEN NOT  WRK-DU-08V00-1
165800             ALSO WRK-DU-08V00-2
165900             ALSO 81
166000             ALSO TRUE
166100             ALSO WRK-DU-08V00-3 = 0
166200             ALSO WRK-DU-08V00-4 < 9
166300                  MOVE  "A" TO WRK-XN-00001-1
166400                  MOVE  "B" TO WRK-XN-00001-2
166500        WHEN      81
166600             ALSO WRK-DU-08V00-3 THROUGH WRK-DU-08V00-4
166700             ALSO (WRK-DU-08V00-2 * 8) THRU (WRK-DU-08V00-2 * 30)
166800             ALSO FALSE
166900             ALSO WRK-DU-08V00-2 = 7
167000             ALSO WRK-DU-08V00 > 88
167100                  MOVE  "C" TO WRK-XN-00001-1
167200                  MOVE  "D" TO WRK-XN-00001-2
167300        WHEN      ANY
167400             ALSO ANY
167500             ALSO ANY
167600             ALSO ANY
167700             ALSO ANY
167800             ALSO WRK-DU-08V00 = 6
167900                  MOVE  "E" TO WRK-XN-00001-1
168000                  MOVE  "F" TO WRK-XN-00001-2
168100        WHEN      OTHER
168200                  MOVE  "G" TO WRK-XN-00001-1
168300                  MOVE  "H" TO WRK-XN-00001-2
168400     END-EVALUATE.
168500 EVA-TEST-GF-32-1.
168600     IF      WRK-XN-00001-1 = "C"
168700             PERFORM PASS
168800             GO TO EVA-WRITE-GF-32-1
168900     ELSE
169000             GO TO EVA-FAIL-GF-32-1.
169100 EVA-DELETE-GF-32-1.
169200     PERFORM DE-LETE.
169300     GO TO EVA-WRITE-GF-32-1.
169400 EVA-FAIL-GF-32-1.
169500     MOVE   "EVALUATE FAILURE" TO RE-MARK
169600     MOVE    WRK-XN-00001-1 TO COMPUTED-X
169700     MOVE   "C"             TO CORRECT-X
169800     PERFORM FAIL.
169900 EVA-WRITE-GF-32-1.
170000     PERFORM PRINT-DETAIL.
170100 EVA-TEST-GF-32-2.
170200     ADD     1 TO REC-CT.
170300     IF      WRK-XN-00001-2 = "D"
170400             PERFORM PASS
170500             GO TO EVA-WRITE-GF-32-2
170600     ELSE
170700             GO TO EVA-FAIL-GF-32-2.
170800 EVA-DELETE-GF-32-2.
170900     PERFORM DE-LETE.
171000     GO TO EVA-WRITE-GF-32-2.
171100 EVA-FAIL-GF-32-2.
171200     MOVE   "EVALUATE FAILURE" TO RE-MARK
171300     MOVE    WRK-XN-00001-2 TO COMPUTED-X
171400     MOVE   "D"             TO CORRECT-X
171500     PERFORM FAIL.
171600 EVA-WRITE-GF-32-2.
171700     PERFORM PRINT-DETAIL.
171800*
171900 EVA-INIT-GF-33.
172000     MOVE   "VI-84 6.12.4 GR3" TO ANSI-REFERENCE.
172100     MOVE   "EVA-TEST-GF-33-1"   TO PAR-NAME.
172200     MOVE    1   TO REC-CT.
172300     MOVE    6   TO WRK-DU-08V00.
172400     MOVE   "*"  TO WRK-XN-00001-1.
172500     MOVE    987 TO WRK-DU-08V00-1.
172600     MOVE    7   TO WRK-DU-08V00-2.
172700     MOVE    0   TO WRK-DU-08V00-3.
172800     MOVE    567 TO WRK-DU-08V00-4.
172900     GO TO   EVA-TEST-GF-33-0.
173000 EVA-DELETE-GF-33.
173100     PERFORM DE-LETE.
173200     PERFORM PRINT-DETAIL.
173300     GO TO   EVA-INIT-GF-34.
173400 EVA-TEST-GF-33-0.
173500     EVALUATE     WRK-DU-08V00
173600             ALSO 81
173700             ALSO (WRK-DU-08V00-2 * 9)
173800             ALSO IT-IS-81
173900             ALSO TRUE
174000             ALSO FALSE
174100        WHEN NOT  WRK-DU-08V00-1
174200             ALSO WRK-DU-08V00-2
174300             ALSO 81
174400             ALSO TRUE
174500             ALSO WRK-DU-08V00-3 = 0
174600             ALSO WRK-DU-08V00-4 < 9
174700                  MOVE  "A" TO WRK-XN-00001-1
174800                  MOVE  "B" TO WRK-XN-00001-2
174900        WHEN      81
175000             ALSO WRK-DU-08V00-3 THROUGH WRK-DU-08V00-4
175100             ALSO (WRK-DU-08V00-2 * 7) THRU (WRK-DU-08V00-2 * 8)
175200             ALSO FALSE
175300             ALSO WRK-DU-08V00-2 = 81
175400             ALSO WRK-DU-08V00 > 8
175500                  MOVE  "C" TO WRK-XN-00001-1
175600                  MOVE  "D" TO WRK-XN-00001-2
175700        WHEN      ANY
175800             ALSO ANY
175900             ALSO ANY
176000             ALSO ANY
176100             ALSO ANY
176200             ALSO WRK-DU-08V00-2 = 6
176300                  MOVE  "E" TO WRK-XN-00001-1
176400                  MOVE  "F" TO WRK-XN-00001-2
176500        WHEN      OTHER
176600                  MOVE  "G" TO WRK-XN-00001-1
176700                  MOVE  "H" TO WRK-XN-00001-2
176800     END-EVALUATE.
176900 EVA-TEST-GF-33-1.
177000     IF      WRK-XN-00001-1 = "E"
177100             PERFORM PASS
177200             GO TO EVA-WRITE-GF-33-1
177300     ELSE
177400             GO TO EVA-FAIL-GF-33-1.
177500 EVA-DELETE-GF-33-1.
177600     PERFORM DE-LETE.
177700     GO TO EVA-WRITE-GF-33-1.
177800 EVA-FAIL-GF-33-1.
177900     MOVE   "EVALUATE FAILURE" TO RE-MARK
178000     MOVE    WRK-XN-00001-1 TO COMPUTED-X
178100     MOVE   "E"             TO CORRECT-X
178200     PERFORM FAIL.
178300 EVA-WRITE-GF-33-1.
178400     PERFORM PRINT-DETAIL.
178500 EVA-TEST-GF-33-2.
178600     ADD     1 TO REC-CT.
178700     IF      WRK-XN-00001-2 = "F"
178800             PERFORM PASS
178900             GO TO EVA-WRITE-GF-33-2
179000     ELSE
179100             GO TO EVA-FAIL-GF-33-2.
179200 EVA-DELETE-GF-33-2.
179300     PERFORM DE-LETE.
179400     GO TO EVA-WRITE-GF-33-2.
179500 EVA-FAIL-GF-33-2.
179600     MOVE   "EVALUATE FAILURE" TO RE-MARK
179700     MOVE    WRK-XN-00001-2 TO COMPUTED-X
179800     MOVE   "F"             TO CORRECT-X
179900     PERFORM FAIL.
180000 EVA-WRITE-GF-33-2.
180100     PERFORM PRINT-DETAIL.
180200*
180300 EVA-INIT-GF-34.
180400     MOVE   "VI-84 6.12.4 GR3" TO ANSI-REFERENCE.
180500     MOVE   "EVA-TEST-GF-34-1"   TO PAR-NAME.
180600     MOVE    1   TO REC-CT.
180700     MOVE    99  TO WRK-DU-08V00.
180800     MOVE   "*"  TO WRK-XN-00001-1.
180900     MOVE    99  TO WRK-DU-08V00-1.
181000     MOVE    99  TO WRK-DU-08V00-2.
181100     MOVE    99  TO WRK-DU-08V00-3.
181200     MOVE    99  TO WRK-DU-08V00-4.
181300     GO TO   EVA-TEST-GF-34-0.
181400 EVA-DELETE-GF-34.
181500     PERFORM DE-LETE.
181600     PERFORM PRINT-DETAIL.
181700     GO TO   EVA-INIT-GF-35.
181800 EVA-TEST-GF-34-0.
181900     EVALUATE     WRK-DU-08V00
182000             ALSO 81
182100             ALSO (WRK-DU-08V00-2 * 9)
182200             ALSO IT-IS-81
182300             ALSO TRUE
182400             ALSO FALSE
182500        WHEN NOT  WRK-DU-08V00-1
182600             ALSO WRK-DU-08V00-2
182700             ALSO 81
182800             ALSO TRUE
182900             ALSO WRK-DU-08V00-3 = 0
183000             ALSO WRK-DU-08V00-4 < 9
183100                  MOVE  "A" TO WRK-XN-00001-1
183200                  MOVE  "B" TO WRK-XN-00001-2
183300        WHEN      81
183400             ALSO WRK-DU-08V00-3 THROUGH WRK-DU-08V00-4
183500             ALSO (WRK-DU-08V00-2 * 7) THRU (WRK-DU-08V00-2 * 8)
183600             ALSO FALSE
183700             ALSO WRK-DU-08V00-2 = 81
183800             ALSO WRK-DU-08V00 > 8
183900                  MOVE  "C" TO WRK-XN-00001-1
184000                  MOVE  "D" TO WRK-XN-00001-2
184100        WHEN      ANY
184200             ALSO ANY
184300             ALSO ANY
184400             ALSO ANY
184500             ALSO ANY
184600             ALSO WRK-DU-08V00 = 99
184700                  MOVE  "E" TO WRK-XN-00001-1
184800                  MOVE  "F" TO WRK-XN-00001-2
184900        WHEN      OTHER
185000                  MOVE  "G" TO WRK-XN-00001-1
185100                  MOVE  "H" TO WRK-XN-00001-2
185200     END-EVALUATE.
185300 EVA-TEST-GF-34-1.
185400     IF      WRK-XN-00001-1 = "G"
185500             PERFORM PASS
185600             GO TO EVA-WRITE-GF-34-1
185700     ELSE
185800             GO TO EVA-FAIL-GF-34-1.
185900 EVA-DELETE-GF-34-1.
186000     PERFORM DE-LETE.
186100     GO TO EVA-WRITE-GF-34-1.
186200 EVA-FAIL-GF-34-1.
186300     MOVE   "EVALUATE FAILURE" TO RE-MARK
186400     MOVE    WRK-XN-00001-1 TO COMPUTED-X
186500     MOVE   "G"             TO CORRECT-X
186600     PERFORM FAIL.
186700 EVA-WRITE-GF-34-1.
186800     PERFORM PRINT-DETAIL.
186900 EVA-TEST-GF-34-2.
187000     ADD     1 TO REC-CT.
187100     IF      WRK-XN-00001-2 = "H"
187200             PERFORM PASS
187300             GO TO EVA-WRITE-GF-34-2
187400     ELSE
187500             GO TO EVA-FAIL-GF-34-2.
187600 EVA-DELETE-GF-34-2.
187700     PERFORM DE-LETE.
187800     GO TO EVA-WRITE-GF-34-2.
187900 EVA-FAIL-GF-34-2.
188000     MOVE   "EVALUATE FAILURE" TO RE-MARK
188100     MOVE    WRK-XN-00001-2 TO COMPUTED-X
188200     MOVE   "H"             TO CORRECT-X
188300     PERFORM FAIL.
188400 EVA-WRITE-GF-34-2.
188500     PERFORM PRINT-DETAIL.
188600*
188700 EVA-INIT-GF-35.
188800     MOVE   "VI-84 6.12.4 GR3" TO ANSI-REFERENCE.
188900     MOVE   "EVA-TEST-GF-35-1" TO PAR-NAME.
189000     MOVE    1   TO REC-CT.
189100     MOVE    81  TO WRK-DU-08V00-1.
189200     GO TO   EVA-TEST-GF-35-1.
189300 EVA-DELETE-GF-35.
189400     PERFORM DE-LETE.
189500     PERFORM PRINT-DETAIL.
189600     GO TO   CCVS-EXIT.
189700 EVA-TEST-GF-35-1.
189800     EVALUATE     TRUE
189900             WHEN WRK-DU-08V00 NUMERIC
190000             WHEN WRK-DU-08V00 > 10
190100             WHEN WRK-DU-08V00 < 100
190200                  MOVE "A" TO WRK-XN-00001-1
190300             WHEN OTHER
190400                  MOVE "Z" TO WRK-XN-00001-1
190500     END-EVALUATE.
190600     IF      WRK-XN-00001-1 = "A"
190700             PERFORM PASS
190800             GO TO EVA-WRITE-GF-35-1
190900     ELSE
191000             GO TO EVA-FAIL-GF-35-1.
191100 EVA-DELETE-GF-35-1.
191200     PERFORM DE-LETE.
191300     GO TO EVA-WRITE-GF-35-1.
191400 EVA-FAIL-GF-35-1.
191500     MOVE   "EVALUATE FAILURE" TO RE-MARK
191600     MOVE    WRK-XN-00001-1 TO COMPUTED-X
191700     MOVE   "A"             TO CORRECT-X
191800     PERFORM FAIL.
191900 EVA-WRITE-GF-35-1.
192000     PERFORM PRINT-DETAIL.
192100*
192200 CCVS-EXIT SECTION.
192300 CCVS-999999.
192400     GO TO CLOSE-FILES.
