000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC223A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*    PROGRAM NC223A TESTS THE "INITIALISE" STATEMENT USING     *
002200*    USING VARIOUS COMBINATIONS OD OPTIONAL PHRASES AND A      *
002300*    VARIETY OF RECEIVING AREAS.                               *
002400*                                                              *
002500****************************************************************
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 01  TEST-1-DATA.
004300   03        TEST-1-1            PIC     9(6).
004400   03        TEST-1-2            PIC     $(3)9.99.
004500   03        TEST-1-3            PIC     X(10).
004600   03        TEST-1-4            PIC     XXBXX/XX.
004700   03        TEST-1-5            PIC     A(6).
004800   03        TEST-1-6            PIC     9(6).
004900   03        TEST-1-7            PIC     $(3)9.99.
005000   03        TEST-1-8            PIC     X(10).
005100   03        TEST-1-9            PIC     XXBXX/XX.
005200   03        TEST-1-10           PIC     A(6).
005300 01  NUM-1234                    PIC     9(4) VALUE 1234.
005400 01  TEST-8-DATA-1               PIC     $(3)9.99.
005500 01  TEST-8-DATA-2               PIC     A(10).
005600 01  TEST-RESULTS.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02 FEATURE                  PIC X(20)  VALUE SPACE.
005900     02 FILLER                   PIC X      VALUE SPACE.
006000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006100     02 FILLER                   PIC X      VALUE SPACE.
006200     02  PAR-NAME.
006300       03 FILLER                 PIC X(19)  VALUE SPACE.
006400       03  PARDOT-X              PIC X      VALUE SPACE.
006500       03 DOTVALUE               PIC 99     VALUE ZERO.
006600     02 FILLER                   PIC X(8)   VALUE SPACE.
006700     02 RE-MARK                  PIC X(61).
006800 01  TEST-COMPUTED.
006900     02 FILLER                   PIC X(30)  VALUE SPACE.
007000     02 FILLER                   PIC X(17)  VALUE
007100            "       COMPUTED=".
007200     02 COMPUTED-X.
007300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007400     03 COMPUTED-N               REDEFINES COMPUTED-A
007500                                 PIC -9(9).9(9).
007600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007900     03       CM-18V0 REDEFINES COMPUTED-A.
008000         04 COMPUTED-18V0                    PIC -9(18).
008100         04 FILLER                           PIC X.
008200     03 FILLER PIC X(50) VALUE SPACE.
008300 01  TEST-CORRECT.
008400     02 FILLER PIC X(30) VALUE SPACE.
008500     02 FILLER PIC X(17) VALUE "       CORRECT =".
008600     02 CORRECT-X.
008700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
009000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009200     03      CR-18V0 REDEFINES CORRECT-A.
009300         04 CORRECT-18V0                     PIC -9(18).
009400         04 FILLER                           PIC X.
009500     03 FILLER PIC X(2) VALUE SPACE.
009600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009700 01  CCVS-C-1.
009800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
009900-    "SS  PARAGRAPH-NAME
010000-    "       REMARKS".
010100     02 FILLER                     PIC X(20)    VALUE SPACE.
010200 01  CCVS-C-2.
010300     02 FILLER                     PIC X        VALUE SPACE.
010400     02 FILLER                     PIC X(6)     VALUE "TESTED".
010500     02 FILLER                     PIC X(15)    VALUE SPACE.
010600     02 FILLER                     PIC X(4)     VALUE "FAIL".
010700     02 FILLER                     PIC X(94)    VALUE SPACE.
010800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
010900 01  REC-CT                        PIC 99       VALUE ZERO.
011000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
011100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
011200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
011300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
011400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
011500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
011600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
011700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
011800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
011900 01  CCVS-H-1.
012000     02  FILLER                    PIC X(39)    VALUE SPACES.
012100     02  FILLER                    PIC X(42)    VALUE
012200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
012300     02  FILLER                    PIC X(39)    VALUE SPACES.
012400 01  CCVS-H-2A.
012500   02  FILLER                        PIC X(40)  VALUE SPACE.
012600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
012700   02  FILLER                        PIC XXXX   VALUE
012800     "4.2 ".
012900   02  FILLER                        PIC X(28)  VALUE
013000            " COPY - NOT FOR DISTRIBUTION".
013100   02  FILLER                        PIC X(41)  VALUE SPACE.
013200
013300 01  CCVS-H-2B.
013400   02  FILLER                        PIC X(15)  VALUE
013500            "TEST RESULT OF ".
013600   02  TEST-ID                       PIC X(9).
013700   02  FILLER                        PIC X(4)   VALUE
013800            " IN ".
013900   02  FILLER                        PIC X(12)  VALUE
014000     " HIGH       ".
014100   02  FILLER                        PIC X(22)  VALUE
014200            " LEVEL VALIDATION FOR ".
014300   02  FILLER                        PIC X(58)  VALUE
014400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014500 01  CCVS-H-3.
014600     02  FILLER                      PIC X(34)  VALUE
014700            " FOR OFFICIAL USE ONLY    ".
014800     02  FILLER                      PIC X(58)  VALUE
014900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
015000     02  FILLER                      PIC X(28)  VALUE
015100            "  COPYRIGHT   1985 ".
015200 01  CCVS-E-1.
015300     02 FILLER                       PIC X(52)  VALUE SPACE.
015400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
015500     02 ID-AGAIN                     PIC X(9).
015600     02 FILLER                       PIC X(45)  VALUE SPACES.
015700 01  CCVS-E-2.
015800     02  FILLER                      PIC X(31)  VALUE SPACE.
015900     02  FILLER                      PIC X(21)  VALUE SPACE.
016000     02 CCVS-E-2-2.
016100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
016200         03 FILLER                   PIC X      VALUE SPACE.
016300         03 ENDER-DESC               PIC X(44)  VALUE
016400            "ERRORS ENCOUNTERED".
016500 01  CCVS-E-3.
016600     02  FILLER                      PIC X(22)  VALUE
016700            " FOR OFFICIAL USE ONLY".
016800     02  FILLER                      PIC X(12)  VALUE SPACE.
016900     02  FILLER                      PIC X(58)  VALUE
017000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017100     02  FILLER                      PIC X(13)  VALUE SPACE.
017200     02 FILLER                       PIC X(15)  VALUE
017300             " COPYRIGHT 1985".
017400 01  CCVS-E-4.
017500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
017600     02 FILLER                       PIC X(4)   VALUE " OF ".
017700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
017800     02 FILLER                       PIC X(40)  VALUE
017900      "  TESTS WERE EXECUTED SUCCESSFULLY".
018000 01  XXINFO.
018100     02 FILLER                       PIC X(19)  VALUE
018200            "*** INFORMATION ***".
018300     02 INFO-TEXT.
018400       04 FILLER                     PIC X(8)   VALUE SPACE.
018500       04 XXCOMPUTED                 PIC X(20).
018600       04 FILLER                     PIC X(5)   VALUE SPACE.
018700       04 XXCORRECT                  PIC X(20).
018800     02 INF-ANSI-REFERENCE           PIC X(48).
018900 01  HYPHEN-LINE.
019000     02 FILLER  PIC IS X VALUE IS SPACE.
019100     02 FILLER  PIC IS X(65)    VALUE IS "************************
019200-    "*****************************************".
019300     02 FILLER  PIC IS X(54)    VALUE IS "************************
019400-    "******************************".
019500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
019600     "NC223A".
019700 PROCEDURE DIVISION.
019800 CCVS1 SECTION.
019900 OPEN-FILES.
020000     OPEN     OUTPUT PRINT-FILE.
020100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
020200     MOVE    SPACE TO TEST-RESULTS.
020300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
020400     GO TO CCVS1-EXIT.
020500 CLOSE-FILES.
020600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
020700 TERMINATE-CCVS.
020800S    EXIT PROGRAM.
020900STERMINATE-CALL.
021000     STOP     RUN.
021100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
021200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
021300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
021400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
021500     MOVE "****TEST DELETED****" TO RE-MARK.
021600 PRINT-DETAIL.
021700     IF REC-CT NOT EQUAL TO ZERO
021800             MOVE "." TO PARDOT-X
021900             MOVE REC-CT TO DOTVALUE.
022000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
022100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
022200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
022300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
022400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
022500     MOVE SPACE TO CORRECT-X.
022600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
022700     MOVE     SPACE TO RE-MARK.
022800 HEAD-ROUTINE.
022900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023300 COLUMN-NAMES-ROUTINE.
023400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
023700 END-ROUTINE.
023800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
023900 END-RTN-EXIT.
024000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024100 END-ROUTINE-1.
024200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
024300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
024400      ADD PASS-COUNTER TO ERROR-HOLD.
024500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
024600
024700      MOVE PASS-COUNTER TO CCVS-E-4-1.
024800      MOVE ERROR-HOLD TO CCVS-E-4-2.
024900      MOVE CCVS-E-4 TO CCVS-E-2-2.
025000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
025100  END-ROUTINE-12.
025200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
025300     IF       ERROR-COUNTER IS EQUAL TO ZERO
025400         MOVE "NO " TO ERROR-TOTAL
025500         ELSE
025600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
025700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
025800     PERFORM WRITE-LINE.
025900 END-ROUTINE-13.
026000     IF DELETE-COUNTER IS EQUAL TO ZERO
026100         MOVE "NO " TO ERROR-TOTAL  ELSE
026200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
026300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
026400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026500      IF   INSPECT-COUNTER EQUAL TO ZERO
026600          MOVE "NO " TO ERROR-TOTAL
026700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
026800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
026900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027100 WRITE-LINE.
027200     ADD 1 TO RECORD-COUNT.
027300Y    IF RECORD-COUNT GREATER 50
027400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
027500Y        MOVE SPACE TO DUMMY-RECORD
027600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
027700Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
027800Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
027900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
028000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
028100Y        MOVE ZERO TO RECORD-COUNT.
028200     PERFORM WRT-LN.
028300 WRT-LN.
028400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
028500     MOVE SPACE TO DUMMY-RECORD.
028600 BLANK-LINE-PRINT.
028700     PERFORM WRT-LN.
028800 FAIL-ROUTINE.
028900     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
029300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029400     MOVE   SPACES TO INF-ANSI-REFERENCE.
029500     GO TO  FAIL-ROUTINE-EX.
029600 FAIL-ROUTINE-WRITE.
029700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
029800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
029900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
030000     MOVE   SPACES TO COR-ANSI-REFERENCE.
030100 FAIL-ROUTINE-EX. EXIT.
030200 BAIL-OUT.
030300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
030400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
030500 BAIL-OUT-WRITE.
030600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
030700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030900     MOVE   SPACES TO INF-ANSI-REFERENCE.
031000 BAIL-OUT-EX. EXIT.
031100 CCVS1-EXIT.
031200     EXIT.
031300 SECT-NC223A-001 SECTION.
031400*
031500 INI-INIT-GF-1.
031600     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
031700     MOVE   "VI-92 6.16.2 GR5" TO ANSI-REFERENCE.
031800     MOVE    1 TO REC-CT.
031900 INI-TEST-GF-1-0.
032000     INITIALIZE TEST-1-DATA.
032100     GO TO   INI-TEST-GF-1-1.
032200 INI-DELETE-GF-1.
032300     PERFORM DE-LETE.
032400     PERFORM PRINT-DETAIL.
032500     GO TO   INI-INIT-GF-2.
032600 INI-TEST-GF-1-1.
032700     MOVE   "INI-TEST-GF-1-1" TO PAR-NAME.
032800     IF      TEST-1-1 = ZERO
032900             PERFORM PASS
033000             GO TO INI-WRITE-GF-1-1
033100     ELSE
033200             GO TO INI-FAIL-GF-1-1.
033300 INI-DELETE-GF-1-1.
033400     PERFORM DE-LETE.
033500     GO TO INI-WRITE-GF-1-1.
033600 INI-FAIL-GF-1-1.
033700     MOVE    ZERO     TO CORRECT-N
033800     MOVE    TEST-1-1 TO COMPUTED-X
033900     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
034000     PERFORM FAIL.
034100 INI-WRITE-GF-1-1.
034200     PERFORM PRINT-DETAIL.
034300*
034400 INI-TEST-GF-1-2.
034500     ADD     1 TO REC-CT.
034600     MOVE   "INI-TEST-GF-1-2" TO PAR-NAME.
034700     IF      TEST-1-2 = "  $0.00"
034800             PERFORM PASS
034900             GO TO INI-WRITE-GF-1-2
035000     ELSE
035100             GO TO INI-FAIL-GF-1-2.
035200 INI-DELETE-GF-1-2.
035300     PERFORM DE-LETE.
035400     GO TO INI-WRITE-GF-1-2.
035500 INI-FAIL-GF-1-2.
035600     MOVE   "  $0.00"  TO CORRECT-X
035700     MOVE    TEST-1-2 TO COMPUTED-X
035800     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
035900     PERFORM FAIL.
036000 INI-WRITE-GF-1-2.
036100     PERFORM PRINT-DETAIL.
036200*
036300 INI-TEST-GF-1-3.
036400     ADD     1 TO REC-CT.
036500     MOVE   "INI-TEST-GF-1-3" TO PAR-NAME.
036600     IF      TEST-1-3 = SPACES
036700             PERFORM PASS
036800             GO TO INI-WRITE-GF-1-3
036900     ELSE
037000             GO TO INI-FAIL-GF-1-3.
037100 INI-DELETE-GF-1-3.
037200     PERFORM DE-LETE.
037300     GO TO INI-WRITE-GF-1-3.
037400 INI-FAIL-GF-1-3.
037500     MOVE    SPACES   TO CORRECT-X
037600     MOVE    TEST-1-3 TO COMPUTED-X
037700     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
037800     PERFORM FAIL.
037900 INI-WRITE-GF-1-3.
038000     PERFORM PRINT-DETAIL.
038100*
038200 INI-TEST-GF-1-4.
038300     ADD     1 TO REC-CT.
038400     MOVE   "INI-TEST-GF-1-4" TO PAR-NAME.
038500     IF      TEST-1-4 = "     /  "
038600             PERFORM PASS
038700             GO TO INI-WRITE-GF-1-4
038800     ELSE
038900             GO TO INI-FAIL-GF-1-4.
039000 INI-DELETE-GF-1-4.
039100     PERFORM DE-LETE.
039200     GO TO INI-WRITE-GF-1-4.
039300 INI-FAIL-GF-1-4.
039400     MOVE   "     /  " TO CORRECT-X
039500     MOVE    TEST-1-4  TO COMPUTED-X
039600     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
039700     PERFORM FAIL.
039800 INI-WRITE-GF-1-4.
039900     PERFORM PRINT-DETAIL.
040000*
040100 INI-TEST-GF-1-5.
040200     ADD     1 TO REC-CT.
040300     MOVE   "INI-TEST-GF-1-5" TO PAR-NAME.
040400     IF      TEST-1-5 = SPACES
040500             PERFORM PASS
040600             GO TO INI-WRITE-GF-1-5
040700     ELSE
040800             GO TO INI-FAIL-GF-1-5.
040900 INI-DELETE-GF-1-5.
041000     PERFORM DE-LETE.
041100     GO TO INI-WRITE-GF-1-5.
041200 INI-FAIL-GF-1-5.
041300             MOVE    SPACES   TO CORRECT-X
041400             MOVE    TEST-1-5 TO COMPUTED-X
041500             MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
041600             PERFORM FAIL.
041700 INI-WRITE-GF-1-5.
041800             PERFORM PRINT-DETAIL.
041900*
042000 INI-TEST-GF-1-6.
042100     ADD     1 TO REC-CT.
042200     MOVE   "INI-TEST-GF-1-6" TO PAR-NAME.
042300     IF      TEST-1-6 = ZERO
042400             PERFORM PASS
042500             GO TO INI-WRITE-GF-1-6
042600     ELSE
042700             GO TO INI-FAIL-GF-1-6.
042800 INI-DELETE-GF-1-6.
042900     PERFORM DE-LETE.
043000     GO TO INI-WRITE-GF-1-6.
043100 INI-FAIL-GF-1-6.
043200     MOVE    ZERO     TO CORRECT-N
043300     MOVE    TEST-1-6 TO COMPUTED-X
043400     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
043500     PERFORM FAIL.
043600 INI-WRITE-GF-1-6.
043700     PERFORM PRINT-DETAIL.
043800*
043900 INI-TEST-GF-1-7.
044000     ADD     1 TO REC-CT.
044100     MOVE   "INI-TEST-GF-1-7" TO PAR-NAME.
044200     IF      TEST-1-7 = "  $0.00"
044300             PERFORM PASS
044400             GO TO INI-WRITE-GF-1-7
044500     ELSE
044600             GO TO INI-FAIL-GF-1-7.
044700 INI-DELETE-GF-1-7.
044800     PERFORM DE-LETE.
044900     GO TO INI-WRITE-GF-1-7.
045000 INI-FAIL-GF-1-7.
045100     MOVE   "  $0.00"  TO CORRECT-X.
045200     MOVE    TEST-1-7 TO COMPUTED-X.
045300     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK.
045400     PERFORM FAIL.
045500 INI-WRITE-GF-1-7.
045600     PERFORM PRINT-DETAIL.
045700*
045800 INI-TEST-GF-1-8.
045900     ADD     1 TO REC-CT.
046000     MOVE   "INI-TEST-GF-1-8" TO PAR-NAME.
046100     IF      TEST-1-8 = SPACES
046200             PERFORM PASS
046300             GO TO INI-WRITE-GF-1-8
046400     ELSE
046500             GO TO INI-FAIL-GF-1-8.
046600 INI-DELETE-GF-1-8.
046700     PERFORM DE-LETE.
046800     GO TO INI-WRITE-GF-1-8.
046900 INI-FAIL-GF-1-8.
047000     MOVE    SPACES   TO CORRECT-X
047100     MOVE    TEST-1-8 TO COMPUTED-X
047200     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
047300     PERFORM FAIL.
047400 INI-WRITE-GF-1-8.
047500     PERFORM PRINT-DETAIL.
047600*
047700 INI-TEST-GF-1-9.
047800     ADD     1 TO REC-CT.
047900     MOVE   "INI-TEST-GF-1-9" TO PAR-NAME.
048000     IF      TEST-1-9 = "     /  "
048100             PERFORM PASS
048200             GO TO INI-WRITE-GF-1-9
048300     ELSE
048400             GO TO INI-FAIL-GF-1-9.
048500 INI-DELETE-GF-1-9.
048600     PERFORM DE-LETE.
048700     GO TO INI-WRITE-GF-1-9.
048800 INI-FAIL-GF-1-9.
048900     MOVE   "     /  " TO CORRECT-X
049000     MOVE    TEST-1-9  TO COMPUTED-X
049100     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
049200     PERFORM FAIL.
049300 INI-WRITE-GF-1-9.
049400     PERFORM PRINT-DETAIL.
049500*
049600 INI-TEST-GF-1-10.
049700     ADD     1 TO REC-CT.
049800     MOVE   "INI-TEST-GF-1-10" TO PAR-NAME.
049900     IF      TEST-1-10 = SPACES
050000             PERFORM PASS
050100             GO TO INI-WRITE-GF-1-10
050200     ELSE
050300             GO TO INI-FAIL-GF-1-10.
050400 INI-DELETE-GF-1-10.
050500     PERFORM DE-LETE.
050600     GO TO INI-WRITE-GF-1-10.
050700 INI-FAIL-GF-1-10.
050800     MOVE    SPACES    TO CORRECT-X
050900     MOVE    TEST-1-10 TO COMPUTED-X
051000     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
051100     PERFORM FAIL.
051200 INI-WRITE-GF-1-10.
051300     PERFORM PRINT-DETAIL.
051400*
051500 INI-INIT-GF-2.
051600     MOVE   "VI-91/2 6.16.2 GR2" TO ANSI-REFERENCE.
051700     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
051800     MOVE    1 TO REC-CT.
051900 INI-TEST-GF-2-0.
052000     INITIALIZE TEST-1-DATA
052100             REPLACING ALPHABETIC DATA BY "AAAAAA".
052200     GO TO   INI-TEST-GF-2-1.
052300 INI-DELETE-GF-2.
052400     PERFORM DE-LETE.
052500     PERFORM PRINT-DETAIL.
052600     GO TO   INI-INIT-GF-3.
052700*
052800 INI-TEST-GF-2-1.
052900     MOVE   "INI-TEST-GF-2-1" TO PAR-NAME.
053000     IF      TEST-1-5 = "AAAAAA"
053100             PERFORM PASS
053200             GO TO INI-WRITE-GF-2-1
053300     ELSE
053400             GO TO INI-FAIL-GF-2-1.
053500 INI-DELETE-GF-2-1.
053600     PERFORM DE-LETE.
053700     GO TO INI-WRITE-GF-2-1.
053800 INI-FAIL-GF-2-1.
053900     MOVE   "AAAAAA"  TO CORRECT-X
054000     MOVE    TEST-1-5 TO COMPUTED-X
054100     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
054200     PERFORM FAIL.
054300 INI-WRITE-GF-2-1.
054400     PERFORM PRINT-DETAIL.
054500*
054600 INI-TEST-GF-2-2.
054700     ADD 1 TO REC-CT.
054800     MOVE   "INI-TEST-GF-2-2" TO PAR-NAME.
054900     IF      TEST-1-10 = "AAAAAA"
055000             PERFORM PASS
055100             GO TO INI-WRITE-GF-2-2
055200     ELSE
055300             GO TO INI-FAIL-GF-2-2.
055400 INI-DELETE-GF-2-2.
055500     PERFORM DE-LETE.
055600     GO TO INI-WRITE-GF-2-2.
055700 INI-FAIL-GF-2-2.
055800     MOVE   "AAAAAA"   TO CORRECT-X
055900     MOVE    TEST-1-10 TO COMPUTED-X
056000     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
056100     PERFORM FAIL.
056200 INI-WRITE-GF-2-2.
056300     PERFORM PRINT-DETAIL.
056400*
056500 INI-TEST-GF-2-3.
056600     ADD 1 TO REC-CT.
056700     MOVE   "INI-TEST-GF-2-3" TO PAR-NAME.
056800     IF      TEST-1-1 = ZERO
056900             PERFORM PASS
057000             GO TO INI-WRITE-GF-2-3
057100     ELSE
057200             GO TO INI-FAIL-GF-2-3.
057300 INI-DELETE-GF-2-3.
057400     PERFORM DE-LETE.
057500     GO TO INI-WRITE-GF-2-3.
057600 INI-FAIL-GF-2-3.
057700     MOVE    ZERO     TO CORRECT-N
057800     MOVE    TEST-1-1 TO COMPUTED-X
057900     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
058000          TO RE-MARK
058100     PERFORM FAIL.
058200 INI-WRITE-GF-2-3.
058300     PERFORM PRINT-DETAIL.
058400*
058500 INI-TEST-GF-2-4.
058600     ADD     1 TO REC-CT.
058700     MOVE   "INI-TEST-GF-2-4" TO PAR-NAME.
058800     IF      TEST-1-2 = "  $0.00"
058900             PERFORM PASS
059000             GO TO INI-WRITE-GF-2-4
059100     ELSE
059200             GO TO INI-FAIL-GF-2-4.
059300 INI-DELETE-GF-2-4.
059400     PERFORM DE-LETE.
059500     GO TO INI-WRITE-GF-2-4.
059600 INI-FAIL-GF-2-4.
059700     MOVE   "  $0.00"  TO CORRECT-X
059800     MOVE    TEST-1-2 TO COMPUTED-X
059900     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
060000          TO RE-MARK
060100     PERFORM FAIL.
060200 INI-WRITE-GF-2-4.
060300     PERFORM PRINT-DETAIL.
060400*
060500 INI-TEST-GF-2-5.
060600     ADD     1 TO REC-CT.
060700     MOVE   "INI-TEST-GF-2-5" TO PAR-NAME.
060800     IF      TEST-1-3 = SPACES
060900             PERFORM PASS
061000             GO TO INI-WRITE-GF-2-5
061100     ELSE
061200             GO TO INI-FAIL-GF-2-5.
061300 INI-DELETE-GF-2-5.
061400     PERFORM DE-LETE.
061500     GO TO INI-WRITE-GF-2-5.
061600 INI-FAIL-GF-2-5.
061700     MOVE    SPACES   TO CORRECT-X
061800     MOVE    TEST-1-3 TO COMPUTED-X
061900     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
062000          TO RE-MARK
062100     PERFORM FAIL.
062200 INI-WRITE-GF-2-5.
062300     PERFORM PRINT-DETAIL.
062400*
062500 INI-TEST-GF-2-6.
062600     ADD     1 TO REC-CT.
062700     MOVE   "INI-TEST-GF-2-6" TO PAR-NAME.
062800     IF      TEST-1-4 = "     /  "
062900             PERFORM PASS
063000             GO TO INI-WRITE-GF-2-6
063100     ELSE
063200             GO TO INI-FAIL-GF-2-6.
063300 INI-DELETE-GF-2-6.
063400     PERFORM DE-LETE.
063500     GO TO INI-WRITE-GF-2-6.
063600 INI-FAIL-GF-2-6.
063700     MOVE   "     /  " TO CORRECT-X
063800     MOVE    TEST-1-4  TO COMPUTED-X
063900     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
064000          TO RE-MARK
064100     PERFORM FAIL.
064200 INI-WRITE-GF-2-6.
064300     PERFORM PRINT-DETAIL.
064400*
064500 INI-TEST-GF-2-7.
064600     ADD     1 TO REC-CT.
064700     MOVE   "INI-TEST-GF-2-7" TO PAR-NAME.
064800     IF      TEST-1-6 = ZERO
064900             PERFORM PASS
065000             GO TO INI-WRITE-GF-2-7
065100     ELSE
065200             GO TO INI-FAIL-GF-2-7.
065300 INI-DELETE-GF-2-7.
065400     PERFORM DE-LETE.
065500     GO TO INI-WRITE-GF-2-7.
065600 INI-FAIL-GF-2-7.
065700     MOVE    ZERO     TO CORRECT-N
065800     MOVE    TEST-1-6 TO COMPUTED-X
065900     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
066000          TO RE-MARK
066100     PERFORM FAIL.
066200 INI-WRITE-GF-2-7.
066300     PERFORM PRINT-DETAIL.
066400*
066500 INI-TEST-GF-2-8.
066600     ADD     1 TO REC-CT.
066700     MOVE   "INI-TEST-GF-2-8" TO PAR-NAME.
066800     IF      TEST-1-7 = "  $0.00"
066900             PERFORM PASS
067000             GO TO INI-WRITE-GF-2-8
067100     ELSE
067200             GO TO INI-FAIL-GF-2-8.
067300 INI-DELETE-GF-2-8.
067400     PERFORM DE-LETE.
067500     GO TO INI-WRITE-GF-2-8.
067600 INI-FAIL-GF-2-8.
067700     MOVE   "  $0.00"  TO CORRECT-X
067800     MOVE    TEST-1-7 TO COMPUTED-X
067900     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
068000          TO RE-MARK
068100     PERFORM FAIL.
068200 INI-WRITE-GF-2-8.
068300     PERFORM PRINT-DETAIL.
068400*
068500 INI-TEST-GF-2-9.
068600     ADD     1 TO REC-CT.
068700     MOVE   "INI-TEST-GF-2-9" TO PAR-NAME.
068800     IF      TEST-1-8 = SPACES
068900             PERFORM PASS
069000             GO TO INI-WRITE-GF-2-9
069100     ELSE
069200             GO TO INI-FAIL-GF-2-9.
069300 INI-DELETE-GF-2-9.
069400     PERFORM DE-LETE.
069500     GO TO INI-WRITE-GF-2-9.
069600 INI-FAIL-GF-2-9.
069700     MOVE    SPACES   TO CORRECT-X
069800     MOVE    TEST-1-8 TO COMPUTED-X
069900     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
070000          TO RE-MARK
070100     PERFORM FAIL.
070200 INI-WRITE-GF-2-9.
070300     PERFORM PRINT-DETAIL.
070400*
070500 INI-TEST-GF-2-10.
070600     ADD     1 TO REC-CT.
070700     MOVE   "INI-TEST-GF-2-10" TO PAR-NAME.
070800     IF      TEST-1-9 = "     /  "
070900             PERFORM PASS
071000             GO TO INI-WRITE-GF-2-10
071100     ELSE
071200             GO TO INI-FAIL-GF-2-10.
071300 INI-DELETE-GF-2-10.
071400     PERFORM DE-LETE.
071500     GO TO INI-WRITE-GF-2-10.
071600 INI-FAIL-GF-2-10.
071700     MOVE   "     /  " TO CORRECT-X
071800     MOVE    TEST-1-9  TO COMPUTED-X
071900     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
072000          TO RE-MARK
072100     PERFORM FAIL.
072200 INI-WRITE-GF-2-10.
072300     PERFORM PRINT-DETAIL.
072400*
072500 INI-INIT-GF-3.
072600     MOVE   "VI-91/2 6.16.2 GR2" TO ANSI-REFERENCE.
072700     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
072800     MOVE    1 TO REC-CT.
072900 INI-TEST-GF-3-0.
073000     INITIALIZE TEST-1-DATA
073100             REPLACING ALPHANUMERIC BY "**********".
073200     GO TO   INI-TEST-GF-3-1.
073300 INI-DELETE-GF-3.
073400     PERFORM DE-LETE.
073500     PERFORM PRINT-DETAIL.
073600     GO TO   INI-INIT-GF-4.
073700 INI-TEST-GF-3-1.
073800     MOVE   "INI-TEST-GF-3-1" TO PAR-NAME.
073900     IF      TEST-1-3 = "**********"
074000             PERFORM PASS
074100             GO TO INI-WRITE-GF-3-1
074200     ELSE
074300             GO TO INI-FAIL-GF-3-1.
074400 INI-DELETE-GF-3-1.
074500     PERFORM DE-LETE.
074600     GO TO INI-WRITE-GF-3-1.
074700 INI-FAIL-GF-3-1.
074800     MOVE   "**********"  TO CORRECT-X
074900     MOVE    TEST-1-3 TO COMPUTED-X
075000     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
075100     PERFORM FAIL.
075200 INI-WRITE-GF-3-1.
075300     PERFORM PRINT-DETAIL.
075400*
075500 INI-TEST-GF-3-2.
075600     ADD     1 TO REC-CT.
075700     MOVE   "INI-TEST-GF-3-2" TO PAR-NAME.
075800     IF      TEST-1-8 = "**********"
075900             PERFORM PASS
076000             GO TO INI-WRITE-GF-3-2
076100     ELSE
076200             GO TO INI-FAIL-GF-3-2.
076300 INI-DELETE-GF-3-2.
076400     PERFORM DE-LETE.
076500     GO TO INI-WRITE-GF-3-2.
076600 INI-FAIL-GF-3-2.
076700     MOVE   "**********"   TO CORRECT-X
076800     MOVE    TEST-1-8 TO COMPUTED-X
076900     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
077000     PERFORM FAIL.
077100 INI-WRITE-GF-3-2.
077200     PERFORM PRINT-DETAIL.
077300*
077400 INI-TEST-GF-3-3.
077500     ADD     1 TO REC-CT.
077600     MOVE   "INI-TEST-GF-3-3" TO PAR-NAME.
077700     IF      TEST-1-1 = ZERO
077800             PERFORM PASS
077900             GO TO INI-WRITE-GF-3-3
078000     ELSE
078100             GO TO INI-FAIL-GF-3-3.
078200 INI-DELETE-GF-3-3.
078300     PERFORM DE-LETE.
078400     GO TO INI-WRITE-GF-3-3.
078500 INI-FAIL-GF-3-3.
078600     MOVE    ZERO     TO CORRECT-N
078700     MOVE    TEST-1-1 TO COMPUTED-X
078800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
078900          TO RE-MARK
079000     PERFORM FAIL.
079100 INI-WRITE-GF-3-3.
079200     PERFORM PRINT-DETAIL.
079300*
079400 INI-TEST-GF-3-4.
079500     ADD     1 TO REC-CT.
079600     MOVE   "INI-TEST-GF-3-4" TO PAR-NAME.
079700     IF      TEST-1-2 = "  $0.00"
079800             PERFORM PASS
079900             GO TO INI-WRITE-GF-3-4
080000     ELSE
080100             GO TO INI-FAIL-GF-3-4.
080200 INI-DELETE-GF-3-4.
080300     PERFORM DE-LETE.
080400     GO TO INI-WRITE-GF-3-4.
080500 INI-FAIL-GF-3-4.
080600     MOVE   "  $0.00"  TO CORRECT-X
080700     MOVE    TEST-1-2 TO COMPUTED-X
080800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
080900          TO RE-MARK
081000     PERFORM FAIL.
081100 INI-WRITE-GF-3-4.
081200     PERFORM PRINT-DETAIL.
081300*
081400 INI-TEST-GF-3-5.
081500     ADD     1 TO REC-CT.
081600     MOVE   "INI-TEST-GF-3-5" TO PAR-NAME.
081700     IF      TEST-1-4 = "     /  "
081800             PERFORM PASS
081900             GO TO INI-WRITE-GF-3-5
082000     ELSE
082100             GO TO INI-FAIL-GF-3-5.
082200 INI-DELETE-GF-3-5.
082300     PERFORM DE-LETE.
082400     GO TO INI-WRITE-GF-3-5.
082500 INI-FAIL-GF-3-5.
082600     MOVE   "     /  " TO CORRECT-X
082700     MOVE    TEST-1-4  TO COMPUTED-X
082800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
082900          TO RE-MARK
083000     PERFORM FAIL.
083100 INI-WRITE-GF-3-5.
083200     PERFORM PRINT-DETAIL.
083300*
083400 INI-TEST-GF-3-6.
083500     ADD     1 TO REC-CT.
083600     MOVE   "INI-TEST-GF-3-6" TO PAR-NAME.
083700     IF      TEST-1-5 = "AAAAAA"
083800             PERFORM PASS
083900             GO TO INI-WRITE-GF-3-6
084000     ELSE
084100             GO TO INI-FAIL-GF-3-6.
084200 INI-DELETE-GF-3-6.
084300     PERFORM DE-LETE.
084400     GO TO INI-WRITE-GF-3-6.
084500 INI-FAIL-GF-3-6.
084600     MOVE   "AAAAAA"  TO CORRECT-X
084700     MOVE    TEST-1-5 TO COMPUTED-X
084800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
084900          TO RE-MARK
085000     PERFORM FAIL.
085100 INI-WRITE-GF-3-6.
085200     PERFORM PRINT-DETAIL.
085300*
085400 INI-TEST-GF-3-7.
085500     ADD     1 TO REC-CT.
085600     MOVE   "INI-TEST-GF-3-7" TO PAR-NAME.
085700     IF      TEST-1-6 = ZERO
085800             PERFORM PASS
085900             GO TO INI-WRITE-GF-3-7
086000     ELSE
086100             GO TO INI-FAIL-GF-3-7.
086200 INI-DELETE-GF-3-7.
086300     PERFORM DE-LETE.
086400     GO TO INI-WRITE-GF-3-7.
086500 INI-FAIL-GF-3-7.
086600     MOVE    ZERO     TO CORRECT-N
086700     MOVE    TEST-1-6 TO COMPUTED-X
086800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
086900          TO RE-MARK
087000     PERFORM FAIL.
087100 INI-WRITE-GF-3-7.
087200     PERFORM PRINT-DETAIL.
087300*
087400 INI-TEST-GF-3-8.
087500     ADD     1 TO REC-CT.
087600     MOVE   "INI-TEST-GF-3-8" TO PAR-NAME.
087700     IF      TEST-1-7 = "  $0.00"
087800             PERFORM PASS
087900             GO TO INI-WRITE-GF-3-8
088000     ELSE
088100             GO TO INI-FAIL-GF-3-8.
088200 INI-DELETE-GF-3-8.
088300     PERFORM DE-LETE.
088400     GO TO INI-WRITE-GF-3-8.
088500 INI-FAIL-GF-3-8.
088600     MOVE   "  $0.00"  TO CORRECT-X
088700     MOVE    TEST-1-7 TO COMPUTED-X
088800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
088900          TO RE-MARK
089000     PERFORM FAIL.
089100 INI-WRITE-GF-3-8.
089200     PERFORM PRINT-DETAIL.
089300*
089400 INI-TEST-GF-3-9.
089500     ADD     1 TO REC-CT.
089600     MOVE   "INI-TEST-GF-3-9" TO PAR-NAME.
089700     IF      TEST-1-9 = "     /  "
089800             PERFORM PASS
089900             GO TO INI-WRITE-GF-3-9
090000     ELSE
090100             GO TO INI-FAIL-GF-3-9.
090200 INI-DELETE-GF-3-9.
090300     PERFORM DE-LETE.
090400     GO TO INI-WRITE-GF-3-9.
090500 INI-FAIL-GF-3-9.
090600     MOVE   "     /  " TO CORRECT-X
090700     MOVE    TEST-1-9  TO COMPUTED-X
090800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
090900          TO RE-MARK
091000     PERFORM FAIL.
091100 INI-WRITE-GF-3-9.
091200     PERFORM PRINT-DETAIL.
091300*
091400 INI-TEST-GF-3-10.
091500     ADD     1 TO REC-CT.
091600     MOVE   "INI-TEST-GF-3-10" TO PAR-NAME.
091700     IF      TEST-1-10 = "AAAAAA"
091800             PERFORM PASS
091900             GO TO INI-WRITE-GF-3-10
092000     ELSE
092100             GO TO INI-FAIL-GF-3-10.
092200 INI-DELETE-GF-3-10.
092300     PERFORM DE-LETE.
092400     GO TO INI-WRITE-GF-3-10.
092500 INI-FAIL-GF-3-10.
092600     MOVE   "AAAAAA"  TO CORRECT-X
092700     MOVE    TEST-1-10 TO COMPUTED-X
092800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
092900          TO RE-MARK
093000     PERFORM FAIL.
093100 INI-WRITE-GF-3-10.
093200     PERFORM PRINT-DETAIL.
093300*
093400 INI-INIT-GF-4.
093500     MOVE   "VI-91/2 6.16.2 GR2" TO ANSI-REFERENCE.
093600     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
093700     MOVE    1 TO REC-CT.
093800 INI-TEST-GF-4-0.
093900     INITIALIZE TEST-1-DATA
094000             REPLACING ALPHANUMERIC-EDITED BY "DDDDDD".
094100     GO TO   INI-TEST-GF-4-1.
094200 INI-DELETE-GF-4.
094300     PERFORM DE-LETE.
094400     PERFORM PRINT-DETAIL.
094500     GO TO   INI-INIT-GF-5.
094600 INI-TEST-GF-4-1.
094700     MOVE   "INI-TEST-GF-4-1" TO PAR-NAME.
094800     IF      TEST-1-4 = "DD DD/DD"
094900             PERFORM PASS
095000             GO TO INI-WRITE-GF-4-1
095100     ELSE
095200             GO TO INI-FAIL-GF-4-1.
095300 INI-DELETE-GF-4-1.
095400     PERFORM DE-LETE.
095500     GO TO INI-WRITE-GF-4-1.
095600 INI-FAIL-GF-4-1.
095700     MOVE   "DD DD/DD" TO CORRECT-X
095800     MOVE    TEST-1-4  TO COMPUTED-X
095900     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
096000     PERFORM FAIL.
096100 INI-WRITE-GF-4-1.
096200     PERFORM PRINT-DETAIL.
096300*
096400 INI-TEST-GF-4-2.
096500     ADD     1 TO REC-CT.
096600     MOVE   "INI-TEST-GF-4-2" TO PAR-NAME.
096700     IF      TEST-1-9 = "DD DD/DD"
096800             PERFORM PASS
096900             GO TO INI-WRITE-GF-4-2
097000     ELSE
097100             GO TO INI-FAIL-GF-4-2.
097200 INI-DELETE-GF-4-2.
097300     PERFORM DE-LETE.
097400     GO TO INI-WRITE-GF-4-2.
097500 INI-FAIL-GF-4-2.
097600     MOVE   "DD DD/DD" TO CORRECT-X
097700     MOVE    TEST-1-9  TO COMPUTED-X
097800     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
097900     PERFORM FAIL.
098000 INI-WRITE-GF-4-2.
098100     PERFORM PRINT-DETAIL.
098200*
098300 INI-TEST-GF-4-3.
098400     ADD     1 TO REC-CT.
098500     MOVE   "INI-TEST-GF-4-3" TO PAR-NAME.
098600     IF      TEST-1-1 = ZERO
098700             PERFORM PASS
098800             GO TO INI-WRITE-GF-4-3
098900     ELSE
099000             GO TO INI-FAIL-GF-4-3.
099100 INI-DELETE-GF-4-3.
099200     PERFORM DE-LETE.
099300     GO TO INI-WRITE-GF-4-3.
099400 INI-FAIL-GF-4-3.
099500     MOVE    ZERO     TO CORRECT-N
099600     MOVE    TEST-1-1 TO COMPUTED-X
099700     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
099800        TO RE-MARK
099900     PERFORM FAIL.
100000 INI-WRITE-GF-4-3.
100100     PERFORM PRINT-DETAIL.
100200*
100300 INI-TEST-GF-4-4.
100400     ADD     1 TO REC-CT.
100500     MOVE   "INI-TEST-GF-4-4" TO PAR-NAME.
100600     IF      TEST-1-2 = "  $0.00"
100700             PERFORM PASS
100800             GO TO INI-WRITE-GF-4-4
100900     ELSE
101000             GO TO INI-FAIL-GF-4-4.
101100 INI-DELETE-GF-4-4.
101200     PERFORM DE-LETE.
101300     GO TO INI-WRITE-GF-4-4.
101400 INI-FAIL-GF-4-4.
101500     MOVE   "  $0.00"  TO CORRECT-X
101600     MOVE    TEST-1-2 TO COMPUTED-X
101700     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
101800          TO RE-MARK
101900     PERFORM FAIL.
102000 INI-WRITE-GF-4-4.
102100     PERFORM PRINT-DETAIL.
102200*
102300 INI-TEST-GF-4-5.
102400     ADD     1 TO REC-CT.
102500     MOVE   "INI-TEST-GF-4-5" TO PAR-NAME.
102600     IF      TEST-1-3 = "**********"
102700             PERFORM PASS
102800             GO TO INI-WRITE-GF-4-5
102900     ELSE
103000             GO TO INI-FAIL-GF-4-5.
103100 INI-DELETE-GF-4-5.
103200     PERFORM DE-LETE.
103300     GO TO INI-WRITE-GF-4-5.
103400 INI-FAIL-GF-4-5.
103500     MOVE   "**********" TO CORRECT-X
103600     MOVE    TEST-1-3  TO COMPUTED-X
103700     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
103800          TO RE-MARK
103900     PERFORM FAIL.
104000 INI-WRITE-GF-4-5.
104100     PERFORM PRINT-DETAIL.
104200*
104300 INI-TEST-GF-4-6.
104400     ADD     1 TO REC-CT.
104500     MOVE   "INI-TEST-GF-4-6" TO PAR-NAME.
104600     IF      TEST-1-5 = "AAAAAA"
104700             PERFORM PASS
104800             GO TO INI-WRITE-GF-4-6
104900     ELSE
105000             GO TO INI-FAIL-GF-4-6.
105100 INI-DELETE-GF-4-6.
105200     PERFORM DE-LETE.
105300     GO TO INI-WRITE-GF-4-6.
105400 INI-FAIL-GF-4-6.
105500     MOVE   "AAAAAA"  TO CORRECT-X
105600     MOVE    TEST-1-5 TO COMPUTED-X
105700     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
105800          TO RE-MARK
105900     PERFORM FAIL.
106000 INI-WRITE-GF-4-6.
106100     PERFORM PRINT-DETAIL.
106200*
106300 INI-TEST-GF-4-7.
106400     ADD     1 TO REC-CT.
106500     MOVE   "INI-TEST-GF-4-7" TO PAR-NAME.
106600     IF      TEST-1-6 = ZERO
106700             PERFORM PASS
106800             GO TO INI-WRITE-GF-4-7
106900     ELSE
107000             GO TO INI-FAIL-GF-4-7.
107100 INI-DELETE-GF-4-7.
107200     PERFORM DE-LETE.
107300     GO TO INI-WRITE-GF-4-7.
107400 INI-FAIL-GF-4-7.
107500     MOVE    ZERO     TO CORRECT-N
107600     MOVE    TEST-1-6 TO COMPUTED-X
107700     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
107800          TO RE-MARK
107900     PERFORM FAIL.
108000 INI-WRITE-GF-4-7.
108100     PERFORM PRINT-DETAIL.
108200*
108300 INI-TEST-GF-4-8.
108400     ADD     1 TO REC-CT.
108500     MOVE   "INI-TEST-GF-4-8" TO PAR-NAME.
108600     IF      TEST-1-7 = "  $0.00"
108700             PERFORM PASS
108800             GO TO INI-WRITE-GF-4-8
108900     ELSE
109000             GO TO INI-FAIL-GF-4-8.
109100 INI-DELETE-GF-4-8.
109200     PERFORM DE-LETE.
109300     GO TO INI-WRITE-GF-4-8.
109400 INI-FAIL-GF-4-8.
109500     MOVE   "  $0.00"  TO CORRECT-X
109600     MOVE    TEST-1-7 TO COMPUTED-X
109700     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
109800          TO RE-MARK
109900     PERFORM FAIL.
110000 INI-WRITE-GF-4-8.
110100     PERFORM PRINT-DETAIL.
110200*
110300 INI-TEST-GF-4-9.
110400     ADD     1 TO REC-CT.
110500     MOVE   "INI-TEST-GF-4-9" TO PAR-NAME.
110600     IF      TEST-1-8 = "**********"
110700             PERFORM PASS
110800             GO TO INI-WRITE-GF-4-9
110900     ELSE
111000             GO TO INI-FAIL-GF-4-9.
111100 INI-DELETE-GF-4-9.
111200     PERFORM DE-LETE.
111300     GO TO INI-WRITE-GF-4-9.
111400 INI-FAIL-GF-4-9.
111500     MOVE   "**********" TO CORRECT-X
111600     MOVE    TEST-1-8  TO COMPUTED-X
111700     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
111800          TO RE-MARK
111900     PERFORM FAIL.
112000 INI-WRITE-GF-4-9.
112100     PERFORM PRINT-DETAIL.
112200*
112300 INI-TEST-GF-4-10.
112400     ADD     1 TO REC-CT.
112500     MOVE   "INI-TEST-GF-4-10" TO PAR-NAME.
112600     IF      TEST-1-10 = "AAAAAA"
112700             PERFORM PASS
112800             GO TO INI-WRITE-GF-4-10
112900     ELSE
113000             GO TO INI-FAIL-GF-4-10.
113100 INI-DELETE-GF-4-10.
113200     PERFORM DE-LETE.
113300     GO TO INI-WRITE-GF-4-10.
113400 INI-FAIL-GF-4-10.
113500     MOVE   "AAAAAA"  TO CORRECT-X
113600     MOVE    TEST-1-10 TO COMPUTED-X
113700     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
113800     TO RE-MARK
113900     PERFORM FAIL.
114000 INI-WRITE-GF-4-10.
114100     PERFORM PRINT-DETAIL.
114200*
114300 INI-INIT-GF-5.
114400     MOVE   "VI-91/2 6.16.2 GR2" TO ANSI-REFERENCE.
114500     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
114600     MOVE    1 TO REC-CT.
114700 INI-TEST-GF-5-0.
114800     INITIALIZE TEST-1-DATA
114900             REPLACING NUMERIC DATA BY 1234.
115000     GO TO   INI-TEST-GF-5-1.
115100 INI-DELETE-GF-5.
115200     PERFORM DE-LETE.
115300     PERFORM PRINT-DETAIL.
115400     GO TO   INI-INIT-GF-6.
115500 INI-TEST-GF-5-1.
115600     MOVE   "INI-TEST-GF-5-1" TO PAR-NAME.
115700     IF      TEST-1-1 = 001234
115800             PERFORM PASS
115900             GO TO INI-WRITE-GF-5-1
116000     ELSE
116100             GO TO INI-FAIL-GF-5-1.
116200 INI-DELETE-GF-5-1.
116300     PERFORM DE-LETE.
116400     GO TO INI-WRITE-GF-5-1.
116500 INI-FAIL-GF-5-1.
116600     MOVE    001234   TO CORRECT-N
116700     MOVE    TEST-1-1 TO COMPUTED-N
116800     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
116900     PERFORM FAIL.
117000 INI-WRITE-GF-5-1.
117100     PERFORM PRINT-DETAIL.
117200*
117300 INI-TEST-GF-5-2.
117400     ADD     1 TO REC-CT.
117500     MOVE   "INI-TEST-GF-5-2" TO PAR-NAME.
117600     IF      TEST-1-6 = 001234
117700             PERFORM PASS
117800             GO TO INI-WRITE-GF-5-2
117900     ELSE
118000             GO TO INI-FAIL-GF-5-2.
118100 INI-DELETE-GF-5-2.
118200     PERFORM DE-LETE.
118300     GO TO INI-WRITE-GF-5-2.
118400 INI-FAIL-GF-5-2.
118500     MOVE    001234   TO CORRECT-N
118600     MOVE    TEST-1-6 TO COMPUTED-N
118700     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
118800     PERFORM FAIL.
118900 INI-WRITE-GF-5-2.
119000     PERFORM PRINT-DETAIL.
119100*
119200 INI-TEST-GF-5-3.
119300     ADD     1 TO REC-CT.
119400     MOVE   "INI-TEST-GF-5-3" TO PAR-NAME.
119500     IF      TEST-1-2 = "  $0.00"
119600             PERFORM PASS
119700             GO TO INI-WRITE-GF-5-3
119800     ELSE
119900             GO TO INI-FAIL-GF-5-3.
120000 INI-DELETE-GF-5-3.
120100     PERFORM DE-LETE.
120200     GO TO INI-WRITE-GF-5-3.
120300 INI-FAIL-GF-5-3.
120400     MOVE   "  $0.00"  TO CORRECT-X
120500     MOVE    TEST-1-2 TO COMPUTED-X
120600     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
120700          TO RE-MARK
120800     PERFORM FAIL.
120900 INI-WRITE-GF-5-3.
121000     PERFORM PRINT-DETAIL.
121100*
121200 INI-TEST-GF-5-4.
121300     ADD     1 TO REC-CT.
121400     MOVE   "INI-TEST-GF-5-4" TO PAR-NAME.
121500     IF      TEST-1-3 = "**********"
121600             PERFORM PASS
121700             GO TO INI-WRITE-GF-5-4
121800     ELSE
121900             GO TO INI-FAIL-GF-5-4.
122000 INI-DELETE-GF-5-4.
122100     PERFORM DE-LETE.
122200     GO TO INI-WRITE-GF-5-4.
122300 INI-FAIL-GF-5-4.
122400     MOVE   "**********" TO CORRECT-X
122500     MOVE    TEST-1-3  TO COMPUTED-X
122600     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
122700          TO RE-MARK
122800     PERFORM FAIL.
122900 INI-WRITE-GF-5-4.
123000     PERFORM PRINT-DETAIL.
123100*
123200 INI-TEST-GF-5-5.
123300     ADD     1 TO REC-CT.
123400     MOVE   "INI-TEST-GF-5-5" TO PAR-NAME.
123500     IF      TEST-1-4 = "DD DD/DD"
123600             PERFORM PASS
123700             GO TO INI-WRITE-GF-5-5
123800     ELSE
123900             GO TO INI-FAIL-GF-5-5.
124000 INI-DELETE-GF-5-5.
124100     PERFORM DE-LETE.
124200     GO TO INI-WRITE-GF-5-5.
124300 INI-FAIL-GF-5-5.
124400     MOVE   "DD DD/DD" TO CORRECT-X
124500     MOVE    TEST-1-4  TO COMPUTED-X
124600     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
124700          TO RE-MARK
124800     PERFORM FAIL.
124900 INI-WRITE-GF-5-5.
125000     PERFORM PRINT-DETAIL.
125100*
125200 INI-TEST-GF-5-6.
125300     ADD     1 TO REC-CT.
125400     MOVE   "INI-TEST-GF-5-6" TO PAR-NAME.
125500     IF      TEST-1-5 = "AAAAAA"
125600             PERFORM PASS
125700             GO TO INI-WRITE-GF-5-6
125800     ELSE
125900             GO TO INI-FAIL-GF-5-6.
126000 INI-DELETE-GF-5-6.
126100     PERFORM DE-LETE.
126200     GO TO INI-WRITE-GF-5-6.
126300 INI-FAIL-GF-5-6.
126400     MOVE   "AAAAAA"  TO CORRECT-X
126500     MOVE    TEST-1-5 TO COMPUTED-X
126600     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
126700          TO RE-MARK
126800     PERFORM FAIL.
126900 INI-WRITE-GF-5-6.
127000     PERFORM PRINT-DETAIL.
127100*
127200 INI-TEST-GF-5-7.
127300     ADD     1 TO REC-CT.
127400     MOVE   "INI-TEST-GF-5-7" TO PAR-NAME.
127500     IF      TEST-1-7 = "  $0.00"
127600             PERFORM PASS
127700             GO TO INI-WRITE-GF-5-7
127800     ELSE
127900             GO TO INI-FAIL-GF-5-7.
128000 INI-DELETE-GF-5-7.
128100     PERFORM DE-LETE.
128200     GO TO INI-WRITE-GF-5-7.
128300 INI-FAIL-GF-5-7.
128400     MOVE   "  $0.00"  TO CORRECT-X
128500     MOVE    TEST-1-7 TO COMPUTED-X
128600     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
128700          TO RE-MARK
128800     PERFORM FAIL.
128900 INI-WRITE-GF-5-7.
129000     PERFORM PRINT-DETAIL.
129100*
129200 INI-TEST-GF-5-8.
129300     ADD     1 TO REC-CT.
129400     MOVE   "INI-TEST-GF-5-8" TO PAR-NAME.
129500     IF      TEST-1-8 = "**********"
129600             PERFORM PASS
129700             GO TO INI-WRITE-GF-5-8
129800     ELSE
129900             GO TO INI-FAIL-GF-5-8.
130000 INI-DELETE-GF-5-8.
130100     PERFORM DE-LETE.
130200     GO TO INI-WRITE-GF-5-8.
130300 INI-FAIL-GF-5-8.
130400     MOVE   "**********" TO CORRECT-X
130500     MOVE    TEST-1-8  TO COMPUTED-X
130600     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
130700          TO RE-MARK
130800     PERFORM FAIL.
130900 INI-WRITE-GF-5-8.
131000     PERFORM PRINT-DETAIL.
131100*
131200 INI-TEST-GF-5-9.
131300     ADD     1 TO REC-CT.
131400     MOVE   "INI-TEST-GF-5-9" TO PAR-NAME.
131500     IF      TEST-1-9 = "DD DD/DD"
131600             PERFORM PASS
131700             GO TO INI-WRITE-GF-5-9
131800     ELSE
131900             GO TO INI-FAIL-GF-5-9.
132000 INI-DELETE-GF-5-9.
132100     PERFORM DE-LETE.
132200     GO TO INI-WRITE-GF-5-9.
132300 INI-FAIL-GF-5-9.
132400     MOVE   "DD DD/DD" TO CORRECT-X
132500     MOVE    TEST-1-9  TO COMPUTED-X
132600     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
132700          TO RE-MARK
132800     PERFORM FAIL.
132900 INI-WRITE-GF-5-9.
133000     PERFORM PRINT-DETAIL.
133100*
133200 INI-TEST-GF-5-10.
133300     ADD     1 TO REC-CT.
133400     MOVE   "INI-TEST-GF-5-10" TO PAR-NAME.
133500     IF      TEST-1-10 = "AAAAAA"
133600             PERFORM PASS
133700             GO TO INI-WRITE-GF-5-10
133800     ELSE
133900             GO TO INI-FAIL-GF-5-10.
134000 INI-DELETE-GF-5-10.
134100     PERFORM DE-LETE.
134200     GO TO INI-WRITE-GF-5-10.
134300 INI-FAIL-GF-5-10.
134400     MOVE   "AAAAAA"  TO CORRECT-X
134500     MOVE    TEST-1-10 TO COMPUTED-X
134600     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
134700          TO RE-MARK
134800     PERFORM FAIL.
134900 INI-WRITE-GF-5-10.
135000     PERFORM PRINT-DETAIL.
135100*
135200 INI-INIT-GF-6.
135300     MOVE   "VI-91/2 6.16.2 GR2" TO ANSI-REFERENCE.
135400     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
135500     MOVE    1 TO REC-CT.
135600 INI-TEST-GF-6-0.
135700     INITIALIZE TEST-1-DATA
135800             REPLACING NUMERIC-EDITED DATA BY NUM-1234.
135900     GO TO   INI-TEST-GF-6-1.
136000 INI-DELETE-GF-6.
136100     PERFORM DE-LETE.
136200     PERFORM PRINT-DETAIL.
136300     GO TO   INI-INIT-GF-7.
136400 INI-TEST-GF-6-1.
136500     MOVE   "INI-TEST-GF-6-1" TO PAR-NAME.
136600     IF      TEST-1-2 = "$234.00"
136700             PERFORM PASS
136800             GO TO INI-WRITE-GF-6-1
136900     ELSE
137000             GO TO INI-FAIL-GF-6-1.
137100 INI-DELETE-GF-6-1.
137200     PERFORM DE-LETE.
137300     GO TO INI-WRITE-GF-6-1.
137400 INI-FAIL-GF-6-1.
137500     MOVE   "$234.00" TO CORRECT-X
137600     MOVE    TEST-1-2 TO COMPUTED-X
137700     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
137800     PERFORM FAIL.
137900 INI-WRITE-GF-6-1.
138000     PERFORM PRINT-DETAIL.
138100*
138200 INI-TEST-GF-6-2.
138300     ADD     1 TO REC-CT.
138400     MOVE   "INI-TEST-GF-6-2" TO PAR-NAME.
138500     IF      TEST-1-7 = "$234.00"
138600             PERFORM PASS
138700             GO TO INI-WRITE-GF-6-2
138800     ELSE
138900             GO TO INI-FAIL-GF-6-2.
139000 INI-DELETE-GF-6-2.
139100     PERFORM DE-LETE.
139200     GO TO INI-WRITE-GF-6-2.
139300 INI-FAIL-GF-6-2.
139400     MOVE   "$234.00" TO CORRECT-X
139500     MOVE    TEST-1-7 TO COMPUTED-X
139600     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
139700     PERFORM FAIL.
139800 INI-WRITE-GF-6-2.
139900     PERFORM PRINT-DETAIL.
140000*
140100 INI-TEST-GF-6-3.
140200     ADD     1 TO REC-CT.
140300     MOVE   "INI-TEST-GF-6-3" TO PAR-NAME.
140400     IF      TEST-1-1 = 001234
140500             PERFORM PASS
140600             GO TO INI-WRITE-GF-6-3
140700     ELSE
140800             GO TO INI-FAIL-GF-6-3.
140900 INI-DELETE-GF-6-3.
141000     PERFORM DE-LETE.
141100     GO TO INI-WRITE-GF-6-3.
141200 INI-FAIL-GF-6-3.
141300     MOVE    001234   TO CORRECT-N
141400     MOVE    TEST-1-1 TO COMPUTED-X
141500     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
141600          TO RE-MARK
141700     PERFORM FAIL.
141800 INI-WRITE-GF-6-3.
141900     PERFORM PRINT-DETAIL.
142000*
142100 INI-TEST-GF-6-4.
142200     ADD     1 TO REC-CT.
142300     MOVE   "INI-TEST-GF-6-4" TO PAR-NAME.
142400     IF      TEST-1-3 = "**********"
142500             PERFORM PASS
142600             GO TO INI-WRITE-GF-6-4
142700     ELSE
142800             GO TO INI-FAIL-GF-6-4.
142900 INI-DELETE-GF-6-4.
143000     PERFORM DE-LETE.
143100     GO TO INI-WRITE-GF-6-4.
143200 INI-FAIL-GF-6-4.
143300     MOVE   "**********" TO CORRECT-X
143400     MOVE    TEST-1-3  TO COMPUTED-X
143500     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
143600         TO RE-MARK
143700     PERFORM FAIL.
143800 INI-WRITE-GF-6-4.
143900     PERFORM PRINT-DETAIL.
144000*
144100 INI-TEST-GF-6-5.
144200     ADD     1 TO REC-CT.
144300     MOVE   "INI-TEST-GF-6-5" TO PAR-NAME.
144400     IF      TEST-1-4 = "DD DD/DD"
144500             PERFORM PASS
144600             GO TO INI-WRITE-GF-6-5
144700     ELSE
144800             GO TO INI-FAIL-GF-6-5.
144900 INI-DELETE-GF-6-5.
145000     PERFORM DE-LETE.
145100     GO TO INI-WRITE-GF-6-5.
145200 INI-FAIL-GF-6-5.
145300     MOVE   "DD DD/DD" TO CORRECT-X
145400     MOVE    TEST-1-4  TO COMPUTED-X
145500     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
145600          TO RE-MARK
145700     PERFORM FAIL.
145800 INI-WRITE-GF-6-5.
145900     PERFORM PRINT-DETAIL.
146000*
146100 INI-TEST-GF-6-6.
146200     ADD     1 TO REC-CT.
146300     MOVE   "INI-TEST-GF-6-6" TO PAR-NAME.
146400     IF      TEST-1-5 = "AAAAAA"
146500             PERFORM PASS
146600             GO TO INI-WRITE-GF-6-6
146700     ELSE
146800             GO TO INI-FAIL-GF-6-6.
146900 INI-DELETE-GF-6-6.
147000     PERFORM DE-LETE.
147100     GO TO INI-WRITE-GF-6-6.
147200 INI-FAIL-GF-6-6.
147300     MOVE   "AAAAAA"  TO CORRECT-X
147400     MOVE    TEST-1-5 TO COMPUTED-X
147500     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
147600          TO RE-MARK
147700     PERFORM FAIL.
147800 INI-WRITE-GF-6-6.
147900     PERFORM PRINT-DETAIL.
148000*
148100 INI-TEST-GF-6-7.
148200     ADD     1 TO REC-CT.
148300     MOVE   "INI-TEST-GF-6-7" TO PAR-NAME.
148400     IF      TEST-1-6 = 1234
148500             PERFORM PASS
148600             GO TO INI-WRITE-GF-6-7
148700     ELSE
148800             GO TO INI-FAIL-GF-6-7.
148900 INI-DELETE-GF-6-7.
149000     PERFORM DE-LETE.
149100     GO TO INI-WRITE-GF-6-7.
149200 INI-FAIL-GF-6-7.
149300     MOVE    1234     TO CORRECT-N
149400     MOVE    TEST-1-6 TO COMPUTED-X
149500     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
149600          TO RE-MARK
149700     PERFORM FAIL.
149800 INI-WRITE-GF-6-7.
149900     PERFORM PRINT-DETAIL.
150000*
150100 INI-TEST-GF-6-8.
150200     ADD     1 TO REC-CT.
150300     MOVE   "INI-TEST-GF-6-8" TO PAR-NAME.
150400     IF      TEST-1-8 = "**********"
150500             PERFORM PASS
150600             GO TO INI-WRITE-GF-6-8
150700     ELSE
150800             GO TO INI-FAIL-GF-6-8.
150900 INI-DELETE-GF-6-8.
151000     PERFORM DE-LETE.
151100     GO TO INI-WRITE-GF-6-8.
151200 INI-FAIL-GF-6-8.
151300     MOVE   "**********" TO CORRECT-X
151400     MOVE    TEST-1-8  TO COMPUTED-X
151500     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
151600          TO RE-MARK
151700     PERFORM FAIL.
151800 INI-WRITE-GF-6-8.
151900     PERFORM PRINT-DETAIL.
152000*
152100 INI-TEST-GF-6-9.
152200     ADD     1 TO REC-CT.
152300     MOVE   "INI-TEST-GF-6-9" TO PAR-NAME.
152400     IF      TEST-1-9 = "DD DD/DD"
152500             PERFORM PASS
152600             GO TO INI-WRITE-GF-6-9
152700     ELSE
152800             GO TO INI-FAIL-GF-6-9.
152900 INI-DELETE-GF-6-9.
153000     PERFORM DE-LETE.
153100     GO TO INI-WRITE-GF-6-9.
153200 INI-FAIL-GF-6-9.
153300     MOVE    TEST-1-9  TO COMPUTED-X
153400     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
153500          TO RE-MARK
153600     PERFORM FAIL.
153700 INI-WRITE-GF-6-9.
153800     PERFORM PRINT-DETAIL.
153900*
154000 INI-TEST-GF-6-10.
154100     ADD     1 TO REC-CT.
154200     MOVE   "INI-TEST-GF-6-10" TO PAR-NAME.
154300     IF      TEST-1-10 = "AAAAAA"
154400             PERFORM PASS
154500             GO TO INI-WRITE-GF-6-10
154600     ELSE
154700             GO TO INI-FAIL-GF-6-10.
154800 INI-DELETE-GF-6-10.
154900     PERFORM DE-LETE.
155000     GO TO INI-WRITE-GF-6-10.
155100 INI-FAIL-GF-6-10.
155200     MOVE   "AAAAAA"  TO CORRECT-X
155300     MOVE    TEST-1-10 TO COMPUTED-X
155400     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
155500          TO RE-MARK
155600     PERFORM FAIL.
155700 INI-WRITE-GF-6-10.
155800     PERFORM PRINT-DETAIL.
155900*
156000 INI-INIT-GF-7.
156100*    ===-->  MULTIPLE "REPLACING" PHRASES"  <--===
156200     MOVE   "VI-91 6.16.2" TO ANSI-REFERENCE.
156300     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
156400     MOVE    1 TO REC-CT.
156500     MOVE    ZEROS  TO TEST-1-1.
156600     MOVE    ZEROS  TO TEST-1-2.
156700     MOVE    SPACES TO TEST-1-3.
156800     MOVE    SPACES TO TEST-1-4.
156900     MOVE    SPACES TO TEST-1-5.
157000     MOVE    ZEROS  TO TEST-1-6.
157100     MOVE    ZEROS  TO TEST-1-7.
157200     MOVE    SPACES TO TEST-1-8.
157300     MOVE    SPACES TO TEST-1-9.
157400     MOVE    SPACES TO TEST-1-10.
157500 INI-TEST-GF-7-0.
157600     INITIALIZE TEST-1-DATA
157700             REPLACING ALPHABETIC DATA     BY "AAAAAA"
157800                       ALPHANUMERIC        BY "**********"
157900                       ALPHANUMERIC-EDITED BY "DDDDDD"
158000                       NUMERIC DATA        BY  1234
158100                       NUMERIC-EDITED      BY NUM-1234.
158200     GO TO   INI-TEST-GF-7-1.
158300 INI-DELETE-GF-7.
158400     PERFORM DE-LETE.
158500     PERFORM PRINT-DETAIL.
158600     GO TO   INI-INIT-GF-8.
158700 INI-TEST-GF-7-1.
158800     MOVE   "INI-TEST-GF-7-1" TO PAR-NAME.
158900     IF      TEST-1-2 = "$234.00"
159000             PERFORM PASS
159100             GO TO INI-WRITE-GF-7-1
159200     ELSE
159300             GO TO INI-FAIL-GF-7-1.
159400 INI-DELETE-GF-7-1.
159500     PERFORM DE-LETE.
159600     GO TO INI-WRITE-GF-7-1.
159700 INI-FAIL-GF-7-1.
159800     MOVE   "$234.00" TO CORRECT-X
159900     MOVE    TEST-1-2 TO COMPUTED-X
160000     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
160100     PERFORM FAIL.
160200 INI-WRITE-GF-7-1.
160300     PERFORM PRINT-DETAIL.
160400*
160500 INI-TEST-GF-7-2.
160600     ADD     1 TO REC-CT.
160700     MOVE   "INI-TEST-GF-7-2" TO PAR-NAME.
160800     IF      TEST-1-7 = "$234.00"
160900             PERFORM PASS
161000             GO TO INI-WRITE-GF-7-2
161100     ELSE
161200             GO TO INI-FAIL-GF-7-2.
161300 INI-DELETE-GF-7-2.
161400     PERFORM DE-LETE.
161500     GO TO INI-WRITE-GF-7-2.
161600 INI-FAIL-GF-7-2.
161700     MOVE   "$234.00" TO CORRECT-X
161800     MOVE    TEST-1-7 TO COMPUTED-X
161900     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
162000     PERFORM FAIL.
162100 INI-WRITE-GF-7-2.
162200     PERFORM PRINT-DETAIL.
162300*
162400 INI-TEST-GF-7-3.
162500     ADD     1 TO REC-CT.
162600     MOVE   "INI-TEST-GF-7-3" TO PAR-NAME.
162700     IF      TEST-1-1 = 001234
162800             PERFORM PASS
162900             GO TO INI-WRITE-GF-7-3
163000     ELSE
163100             GO TO INI-FAIL-GF-7-3.
163200 INI-DELETE-GF-7-3.
163300     PERFORM DE-LETE.
163400     GO TO INI-WRITE-GF-7-3.
163500 INI-FAIL-GF-7-3.
163600     MOVE    001234   TO CORRECT-N
163700     MOVE    TEST-1-1 TO COMPUTED-X
163800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
163900          TO RE-MARK
164000     PERFORM FAIL.
164100 INI-WRITE-GF-7-3.
164200     PERFORM PRINT-DETAIL.
164300*
164400 INI-TEST-GF-7-4.
164500     ADD     1 TO REC-CT.
164600     MOVE   "INI-TEST-GF-7-4" TO PAR-NAME.
164700     IF      TEST-1-3 = "**********"
164800             PERFORM PASS
164900             GO TO INI-WRITE-GF-7-4
165000     ELSE
165100             GO TO INI-FAIL-GF-7-4.
165200 INI-DELETE-GF-7-4.
165300     PERFORM DE-LETE.
165400     GO TO INI-WRITE-GF-7-4.
165500 INI-FAIL-GF-7-4.
165600     MOVE   "**********" TO CORRECT-X
165700     MOVE    TEST-1-3  TO COMPUTED-X
165800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
165900          TO RE-MARK
166000     PERFORM FAIL.
166100 INI-WRITE-GF-7-4.
166200     PERFORM PRINT-DETAIL.
166300*
166400 INI-TEST-GF-7-5.
166500     ADD     1 TO REC-CT.
166600     MOVE   "INI-TEST-GF-7-5" TO PAR-NAME.
166700     IF      TEST-1-4 = "DD DD/DD"
166800             PERFORM PASS
166900             GO TO INI-WRITE-GF-7-5
167000     ELSE
167100             GO TO INI-FAIL-GF-7-5.
167200 INI-DELETE-GF-7-5.
167300     PERFORM DE-LETE.
167400     GO TO INI-WRITE-GF-7-5.
167500 INI-FAIL-GF-7-5.
167600     MOVE   "DD DD/DD" TO CORRECT-X
167700     MOVE    TEST-1-4  TO COMPUTED-X
167800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
167900          TO RE-MARK
168000     PERFORM FAIL.
168100 INI-WRITE-GF-7-5.
168200     PERFORM PRINT-DETAIL.
168300*
168400 INI-TEST-GF-7-6.
168500     ADD     1 TO REC-CT.
168600     MOVE   "INI-TEST-GF-7-6" TO PAR-NAME.
168700     IF      TEST-1-5 = "AAAAAA"
168800             PERFORM PASS
168900             GO TO INI-WRITE-GF-7-6
169000     ELSE
169100             GO TO INI-FAIL-GF-7-6.
169200 INI-DELETE-GF-7-6.
169300     PERFORM DE-LETE.
169400     GO TO INI-WRITE-GF-7-6.
169500 INI-FAIL-GF-7-6.
169600     MOVE   "AAAAAA"  TO CORRECT-X
169700     MOVE    TEST-1-5 TO COMPUTED-X
169800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
169900         TO RE-MARK
170000     PERFORM FAIL.
170100 INI-WRITE-GF-7-6.
170200     PERFORM PRINT-DETAIL.
170300*
170400 INI-TEST-GF-7-7.
170500     ADD     1 TO REC-CT.
170600     MOVE   "INI-TEST-GF-7-7" TO PAR-NAME.
170700     IF      TEST-1-6 = 001234
170800             PERFORM PASS
170900             GO TO INI-WRITE-GF-7-7
171000     ELSE
171100             GO TO INI-FAIL-GF-7-7.
171200 INI-DELETE-GF-7-7.
171300     PERFORM DE-LETE.
171400     GO TO INI-WRITE-GF-7-7.
171500 INI-FAIL-GF-7-7.
171600     MOVE    ZERO     TO CORRECT-N
171700     MOVE    TEST-1-6 TO COMPUTED-X
171800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
171900          TO RE-MARK
172000     PERFORM FAIL.
172100 INI-WRITE-GF-7-7.
172200     PERFORM PRINT-DETAIL.
172300*
172400 INI-TEST-GF-7-8.
172500     ADD     1 TO REC-CT.
172600     MOVE   "INI-TEST-GF-7-8" TO PAR-NAME.
172700     IF      TEST-1-8 = "**********"
172800             PERFORM PASS
172900             GO TO INI-WRITE-GF-7-8
173000     ELSE
173100             GO TO INI-FAIL-GF-7-8.
173200 INI-DELETE-GF-7-8.
173300     PERFORM DE-LETE.
173400     GO TO INI-WRITE-GF-7-8.
173500 INI-FAIL-GF-7-8.
173600     MOVE   "**********" TO CORRECT-X
173700     MOVE    TEST-1-8  TO COMPUTED-X
173800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
173900          TO RE-MARK
174000     PERFORM FAIL.
174100 INI-WRITE-GF-7-8.
174200     PERFORM PRINT-DETAIL.
174300*
174400 INI-TEST-GF-7-9.
174500     ADD     1 TO REC-CT.
174600     MOVE   "INI-TEST-GF-7-9" TO PAR-NAME.
174700     IF      TEST-1-9 = "DD DD/DD"
174800             PERFORM PASS
174900             GO TO INI-WRITE-GF-7-9
175000     ELSE
175100             GO TO INI-FAIL-GF-7-9.
175200 INI-DELETE-GF-7-9.
175300     PERFORM DE-LETE.
175400     GO TO INI-WRITE-GF-7-9.
175500 INI-FAIL-GF-7-9.
175600     MOVE   "DD DD/DD" TO CORRECT-X
175700     MOVE    TEST-1-9  TO COMPUTED-X
175800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
175900          TO RE-MARK
176000     PERFORM FAIL.
176100 INI-WRITE-GF-7-9.
176200     PERFORM PRINT-DETAIL.
176300*
176400 INI-TEST-GF-7-10.
176500     ADD     1 TO REC-CT.
176600     MOVE   "INI-TEST-GF-7-10" TO PAR-NAME.
176700     IF      TEST-1-10 = "AAAAAA"
176800             PERFORM PASS
176900             GO TO INI-WRITE-GF-7-10
177000     ELSE
177100             GO TO INI-FAIL-GF-7-10.
177200 INI-DELETE-GF-7-10.
177300     PERFORM DE-LETE.
177400     GO TO INI-WRITE-GF-7-10.
177500 INI-FAIL-GF-7-10.
177600     MOVE   "AAAAAA"  TO CORRECT-X
177700     MOVE    TEST-1-10 TO COMPUTED-X
177800     MOVE   "WRONGLY AFFECTED BY OTHER INITIALISATION"
177900          TO RE-MARK
178000     PERFORM FAIL.
178100 INI-WRITE-GF-7-10.
178200     PERFORM PRINT-DETAIL.
178300*
178400 INI-INIT-GF-8.
178500*    ===-->  MULTIPLE RECEIVING AREAS       <--===
178600     MOVE   "VI-91 6.16.4 GR2" TO ANSI-REFERENCE.
178700     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
178800     MOVE    1 TO REC-CT.
178900     MOVE    LOW-VALUES  TO TEST-1-DATA.
179000     MOVE    999.99      TO TEST-8-DATA-1.
179100     MOVE   "ZZZZZZZZZZ" TO TEST-8-DATA-2.
179200 INI-TEST-GF-8-0.
179300     INITIALIZE TEST-8-DATA-1
179400                TEST-1-DATA
179500                TEST-8-DATA-2.
179600     GO TO   INI-TEST-GF-8-1.
179700 INI-DELETE-GF-8.
179800     PERFORM DE-LETE.
179900     PERFORM PRINT-DETAIL.
180000     GO TO   INI-INIT-GF-9.
180100 INI-TEST-GF-8-1.
180200     MOVE   "INI-TEST-GF-8-1" TO PAR-NAME.
180300     IF      TEST-1-2 = "  $0.00"
180400             PERFORM PASS
180500             GO TO INI-WRITE-GF-8-1
180600     ELSE
180700             GO TO INI-FAIL-GF-8-1.
180800 INI-DELETE-GF-8-1.
180900     PERFORM DE-LETE.
181000     GO TO INI-WRITE-GF-8-1.
181100 INI-FAIL-GF-8-1.
181200     MOVE   "  $0.00"  TO CORRECT-X
181300     MOVE    TEST-1-2 TO COMPUTED-X
181400     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
181500     PERFORM FAIL.
181600 INI-WRITE-GF-8-1.
181700     PERFORM PRINT-DETAIL.
181800*
181900 INI-TEST-GF-8-2.
182000     ADD     1 TO REC-CT.
182100     MOVE   "INI-TEST-GF-8-2" TO PAR-NAME.
182200     IF      TEST-1-7 = "  $0.00"
182300             PERFORM PASS
182400             GO TO INI-WRITE-GF-8-2
182500     ELSE
182600             GO TO INI-FAIL-GF-8-2.
182700 INI-DELETE-GF-8-2.
182800     PERFORM DE-LETE.
182900     GO TO INI-WRITE-GF-8-2.
183000 INI-FAIL-GF-8-2.
183100     MOVE   "  $0.00"  TO CORRECT-X
183200     MOVE    TEST-1-7 TO COMPUTED-X
183300     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
183400     PERFORM FAIL.
183500 INI-WRITE-GF-8-2.
183600     PERFORM PRINT-DETAIL.
183700*
183800 INI-TEST-GF-8-3.
183900     ADD     1 TO REC-CT.
184000     MOVE   "INI-TEST-GF-8-3" TO PAR-NAME.
184100     IF      TEST-1-1 = ZERO
184200             PERFORM PASS
184300             GO TO INI-WRITE-GF-8-3
184400     ELSE
184500             GO TO INI-FAIL-GF-8-3.
184600 INI-DELETE-GF-8-3.
184700     PERFORM DE-LETE.
184800     GO TO INI-WRITE-GF-8-3.
184900 INI-FAIL-GF-8-3.
185000     MOVE    ZERO     TO CORRECT-N
185100     MOVE    TEST-1-1 TO COMPUTED-X
185200     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
185300     PERFORM FAIL.
185400 INI-WRITE-GF-8-3.
185500     PERFORM PRINT-DETAIL.
185600*
185700 INI-TEST-GF-8-4.
185800     ADD     1 TO REC-CT.
185900     MOVE   "INI-TEST-GF-8-4" TO PAR-NAME.
186000     IF      TEST-1-3 = SPACES
186100             PERFORM PASS
186200             GO TO INI-WRITE-GF-8-4
186300     ELSE
186400             GO TO INI-FAIL-GF-8-4.
186500 INI-DELETE-GF-8-4.
186600     PERFORM DE-LETE.
186700     GO TO INI-WRITE-GF-8-4.
186800 INI-FAIL-GF-8-4.
186900     MOVE    SPACES    TO CORRECT-X
187000     MOVE    TEST-1-3  TO COMPUTED-X
187100     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
187200     PERFORM FAIL.
187300 INI-WRITE-GF-8-4.
187400     PERFORM PRINT-DETAIL.
187500*
187600 INI-TEST-GF-8-5.
187700     ADD     1 TO REC-CT.
187800     MOVE   "INI-TEST-GF-8-5" TO PAR-NAME.
187900     IF      TEST-1-4 = "     /  "
188000             PERFORM PASS
188100             GO TO INI-WRITE-GF-8-5
188200     ELSE
188300             GO TO INI-FAIL-GF-8-5.
188400 INI-DELETE-GF-8-5.
188500     PERFORM DE-LETE.
188600     GO TO INI-WRITE-GF-8-5.
188700 INI-FAIL-GF-8-5.
188800     MOVE   "     /  " TO CORRECT-X
188900     MOVE    TEST-1-4  TO COMPUTED-X
189000     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
189100     PERFORM FAIL.
189200 INI-WRITE-GF-8-5.
189300     PERFORM PRINT-DETAIL.
189400*
189500 INI-TEST-GF-8-6.
189600     ADD     1 TO REC-CT.
189700     MOVE   "INI-TEST-GF-8-6" TO PAR-NAME.
189800     IF      TEST-1-5 = SPACES
189900             PERFORM PASS
190000             GO TO INI-WRITE-GF-8-6
190100     ELSE
190200             GO TO INI-FAIL-GF-8-6.
190300 INI-DELETE-GF-8-6.
190400     PERFORM DE-LETE.
190500     GO TO INI-WRITE-GF-8-6.
190600 INI-FAIL-GF-8-6.
190700     MOVE    SPACES   TO CORRECT-X
190800     MOVE    TEST-1-5 TO COMPUTED-X
190900     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
191000     PERFORM FAIL.
191100 INI-WRITE-GF-8-6.
191200     PERFORM PRINT-DETAIL.
191300*
191400 INI-TEST-GF-8-7.
191500     ADD     1 TO REC-CT.
191600     MOVE   "INI-TEST-GF-8-7" TO PAR-NAME.
191700     IF      TEST-1-6 = ZERO
191800             PERFORM PASS
191900             GO TO INI-WRITE-GF-8-7
192000     ELSE
192100             GO TO INI-FAIL-GF-8-7.
192200 INI-DELETE-GF-8-7.
192300     PERFORM DE-LETE.
192400     GO TO INI-WRITE-GF-8-7.
192500 INI-FAIL-GF-8-7.
192600     MOVE    ZERO     TO CORRECT-N
192700     MOVE    TEST-1-6 TO COMPUTED-X
192800     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
192900     PERFORM FAIL.
193000 INI-WRITE-GF-8-7.
193100     PERFORM PRINT-DETAIL.
193200*
193300 INI-TEST-GF-8-8.
193400     ADD     1 TO REC-CT.
193500     MOVE   "INI-TEST-GF-8-8" TO PAR-NAME.
193600     IF      TEST-1-8 = SPACES
193700             PERFORM PASS
193800             GO TO INI-WRITE-GF-8-8
193900     ELSE
194000             GO TO INI-FAIL-GF-8-8.
194100 INI-DELETE-GF-8-8.
194200     PERFORM DE-LETE.
194300     GO TO INI-WRITE-GF-8-8.
194400 INI-FAIL-GF-8-8.
194500     MOVE    SPACES    TO CORRECT-X
194600     MOVE    TEST-1-8  TO COMPUTED-X
194700     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
194800     PERFORM FAIL.
194900 INI-WRITE-GF-8-8.
195000     PERFORM PRINT-DETAIL.
195100*
195200 INI-TEST-GF-8-9.
195300     ADD     1 TO REC-CT.
195400     MOVE   "INI-TEST-GF-8-9" TO PAR-NAME.
195500     IF      TEST-1-9 = "     /  "
195600             PERFORM PASS
195700             GO TO INI-WRITE-GF-8-9
195800     ELSE
195900             GO TO INI-FAIL-GF-8-9.
196000 INI-DELETE-GF-8-9.
196100     PERFORM DE-LETE.
196200     GO TO INI-WRITE-GF-8-9.
196300 INI-FAIL-GF-8-9.
196400     MOVE   "     /  " TO CORRECT-X
196500     MOVE    TEST-1-9  TO COMPUTED-X
196600     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
196700     PERFORM FAIL.
196800 INI-WRITE-GF-8-9.
196900     PERFORM PRINT-DETAIL.
197000*
197100 INI-TEST-GF-8-10.
197200     ADD     1 TO REC-CT.
197300     MOVE   "INI-TEST-GF-8-10" TO PAR-NAME.
197400     IF      TEST-1-10 = SPACES
197500             PERFORM PASS
197600             GO TO INI-WRITE-GF-8-10
197700     ELSE
197800             GO TO INI-FAIL-GF-8-10.
197900 INI-DELETE-GF-8-10.
198000     PERFORM DE-LETE.
198100     GO TO INI-WRITE-GF-8-10.
198200 INI-FAIL-GF-8-10.
198300     MOVE    SPACES    TO CORRECT-X
198400     MOVE    TEST-1-10 TO COMPUTED-X
198500     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
198600     PERFORM FAIL.
198700 INI-WRITE-GF-8-10.
198800     PERFORM PRINT-DETAIL.
198900*
199000 INI-TEST-GF-8-11.
199100     ADD     1 TO REC-CT.
199200     MOVE   "INI-TEST-GF-8-11" TO PAR-NAME.
199300     IF      TEST-8-DATA-1 = "  $0.00"
199400             PERFORM PASS
199500             GO TO INI-WRITE-GF-8-11
199600     ELSE
199700             GO TO INI-FAIL-GF-8-11.
199800 INI-DELETE-GF-8-11.
199900     PERFORM DE-LETE.
200000     GO TO INI-WRITE-GF-8-11.
200100 INI-FAIL-GF-8-11.
200200     MOVE   "  $0.00"   TO CORRECT-X
200300     MOVE    TEST-8-DATA-1  TO COMPUTED-X
200400     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
200500     PERFORM FAIL.
200600 INI-WRITE-GF-8-11.
200700     PERFORM PRINT-DETAIL.
200800*
200900 INI-TEST-GF-8-12.
201000     ADD     1 TO REC-CT.
201100     MOVE   "INI-TEST-GF-8-12" TO PAR-NAME.
201200     IF      TEST-8-DATA-2 = SPACES
201300             PERFORM PASS
201400             GO TO INI-WRITE-GF-8-12
201500     ELSE
201600             GO TO INI-FAIL-GF-8-12.
201700 INI-DELETE-GF-8-12.
201800     PERFORM DE-LETE.
201900     GO TO INI-WRITE-GF-8-12.
202000 INI-FAIL-GF-8-12.
202100     MOVE    SPACES    TO CORRECT-X
202200     MOVE    TEST-8-DATA-2 TO COMPUTED-X
202300     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
202400     PERFORM FAIL.
202500 INI-WRITE-GF-8-12.
202600     PERFORM PRINT-DETAIL.
202700*
202800 INI-INIT-GF-9.
202900*    ===-->  MULTIPLE RECEIVING AREAS AND   <--===
203000*    ===-->  MULTIPLE "REPLACING" PHRASES"  <--===
203100     MOVE   "VI-91 6.16.2" TO ANSI-REFERENCE.
203200     MOVE   "INITIALIZE STATEMENT" TO FEATURE.
203300     MOVE    1 TO REC-CT.
203400     MOVE    ZEROS  TO TEST-1-1.
203500     MOVE    ZEROS  TO TEST-1-2.
203600     MOVE    SPACES TO TEST-1-3.
203700     MOVE    SPACES TO TEST-1-4.
203800     MOVE    SPACES TO TEST-1-5.
203900     MOVE    ZEROS  TO TEST-1-6.
204000     MOVE    ZEROS  TO TEST-1-7.
204100     MOVE    SPACES TO TEST-1-8.
204200     MOVE    SPACES TO TEST-1-9.
204300     MOVE    SPACES TO TEST-1-10.
204400     MOVE    999.99      TO TEST-8-DATA-1.
204500     MOVE   "ZZZZZZZZZZ" TO TEST-8-DATA-2.
204600 INI-TEST-GF-9-0.
204700     INITIALIZE
204800             TEST-8-DATA-1
204900             TEST-1-DATA
205000             TEST-8-DATA-2
205100             REPLACING ALPHABETIC DATA     BY "AAAAAA"
205200                       ALPHANUMERIC        BY "**********"
205300                       ALPHANUMERIC-EDITED BY "DDDDDD"
205400                       NUMERIC DATA        BY  NUM-1234
205500                       NUMERIC-EDITED      BY  1234.
205600     GO TO   INI-TEST-GF-9-1.
205700 INI-DELETE-GF-9.
205800     PERFORM DE-LETE.
205900     PERFORM PRINT-DETAIL.
206000     GO TO   CCVS-EXIT.
206100 INI-TEST-GF-9-1.
206200     MOVE   "INI-TEST-GF-9-1" TO PAR-NAME.
206300     IF      TEST-1-2 = "$234.00"
206400             PERFORM PASS
206500             GO TO INI-WRITE-GF-9-1
206600     ELSE
206700             GO TO INI-FAIL-GF-9-1.
206800 INI-DELETE-GF-9-1.
206900     PERFORM DE-LETE.
207000     GO TO INI-WRITE-GF-9-1.
207100 INI-FAIL-GF-9-1.
207200     MOVE   "$234.00" TO CORRECT-X
207300     MOVE    TEST-1-2 TO COMPUTED-X
207400     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
207500     PERFORM FAIL.
207600 INI-WRITE-GF-9-1.
207700     PERFORM PRINT-DETAIL.
207800*
207900 INI-TEST-GF-9-2.
208000     ADD     1 TO REC-CT.
208100     MOVE   "INI-TEST-GF-9-2" TO PAR-NAME.
208200     IF      TEST-1-7 = "$234.00"
208300             PERFORM PASS
208400             GO TO INI-WRITE-GF-9-2
208500     ELSE
208600             GO TO INI-FAIL-GF-9-2.
208700 INI-DELETE-GF-9-2.
208800     PERFORM DE-LETE.
208900     GO TO INI-WRITE-GF-9-2.
209000 INI-FAIL-GF-9-2.
209100     MOVE   "$234.00" TO CORRECT-X
209200     MOVE    TEST-1-7 TO COMPUTED-X
209300     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
209400     PERFORM FAIL.
209500 INI-WRITE-GF-9-2.
209600     PERFORM PRINT-DETAIL.
209700*
209800 INI-TEST-GF-9-3.
209900     ADD     1 TO REC-CT.
210000     MOVE   "INI-TEST-GF-9-3" TO PAR-NAME.
210100     IF      TEST-1-1 = 001234
210200             PERFORM PASS
210300             GO TO INI-WRITE-GF-9-3
210400     ELSE
210500             GO TO INI-FAIL-GF-9-3.
210600 INI-DELETE-GF-9-3.
210700     PERFORM DE-LETE.
210800     GO TO INI-WRITE-GF-9-3.
210900 INI-FAIL-GF-9-3.
211000     MOVE    001234   TO CORRECT-N
211100     MOVE    TEST-1-1 TO COMPUTED-X
211200     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
211300     PERFORM FAIL.
211400 INI-WRITE-GF-9-3.
211500     PERFORM PRINT-DETAIL.
211600*
211700 INI-TEST-GF-9-4.
211800     ADD     1 TO REC-CT.
211900     MOVE   "INI-TEST-GF-9-4" TO PAR-NAME.
212000     IF      TEST-1-3 = "**********"
212100             PERFORM PASS
212200             GO TO INI-WRITE-GF-9-4
212300     ELSE
212400             GO TO INI-FAIL-GF-9-4.
212500 INI-DELETE-GF-9-4.
212600     PERFORM DE-LETE.
212700     GO TO INI-WRITE-GF-9-4.
212800 INI-FAIL-GF-9-4.
212900     MOVE   "**********" TO CORRECT-X
213000     MOVE    TEST-1-3  TO COMPUTED-X
213100     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
213200     PERFORM FAIL.
213300 INI-WRITE-GF-9-4.
213400     PERFORM PRINT-DETAIL.
213500*
213600 INI-TEST-GF-9-5.
213700     ADD     1 TO REC-CT.
213800     MOVE   "INI-TEST-GF-9-5" TO PAR-NAME.
213900     IF      TEST-1-4 = "DD DD/DD"
214000             PERFORM PASS
214100             GO TO INI-WRITE-GF-9-5
214200     ELSE
214300             GO TO INI-FAIL-GF-9-5.
214400 INI-DELETE-GF-9-5.
214500     PERFORM DE-LETE.
214600     GO TO INI-WRITE-GF-9-5.
214700 INI-FAIL-GF-9-5.
214800     MOVE   "DD DD/DD" TO CORRECT-X
214900     MOVE    TEST-1-4  TO COMPUTED-X
215000     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
215100     PERFORM FAIL.
215200 INI-WRITE-GF-9-5.
215300     PERFORM PRINT-DETAIL.
215400*
215500 INI-TEST-GF-9-6.
215600     ADD     1 TO REC-CT.
215700     MOVE   "INI-TEST-GF-9-6" TO PAR-NAME.
215800     IF      TEST-1-5 = "AAAAAA"
215900             PERFORM PASS
216000             GO TO INI-WRITE-GF-9-6
216100     ELSE
216200             GO TO INI-FAIL-GF-9-6.
216300 INI-DELETE-GF-9-6.
216400     PERFORM DE-LETE.
216500     GO TO INI-WRITE-GF-9-6.
216600 INI-FAIL-GF-9-6.
216700     MOVE   "AAAAAA"  TO CORRECT-X
216800     MOVE    TEST-1-5 TO COMPUTED-X
216900     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
217000     PERFORM FAIL.
217100 INI-WRITE-GF-9-6.
217200     PERFORM PRINT-DETAIL.
217300*
217400 INI-TEST-GF-9-7.
217500     ADD     1 TO REC-CT.
217600     MOVE   "INI-TEST-GF-9-7" TO PAR-NAME.
217700     IF      TEST-1-6 = 1234
217800             PERFORM PASS
217900             GO TO INI-WRITE-GF-9-7
218000     ELSE
218100             GO TO INI-FAIL-GF-9-7.
218200 INI-DELETE-GF-9-7.
218300     PERFORM DE-LETE.
218400     GO TO INI-WRITE-GF-9-7.
218500 INI-FAIL-GF-9-7.
218600     MOVE    1234     TO CORRECT-N
218700     MOVE    TEST-1-6 TO COMPUTED-X
218800     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
218900     PERFORM FAIL.
219000 INI-WRITE-GF-9-7.
219100     PERFORM PRINT-DETAIL.
219200*
219300 INI-TEST-GF-9-8.
219400     ADD     1 TO REC-CT.
219500     MOVE   "INI-TEST-GF-9-8" TO PAR-NAME.
219600     IF      TEST-1-8 = "**********"
219700             PERFORM PASS
219800             GO TO INI-WRITE-GF-9-8
219900     ELSE
220000             GO TO INI-FAIL-GF-9-8.
220100 INI-DELETE-GF-9-8.
220200     PERFORM DE-LETE.
220300     GO TO INI-WRITE-GF-9-8.
220400 INI-FAIL-GF-9-8.
220500     MOVE   "**********" TO CORRECT-X
220600     MOVE    TEST-1-8  TO COMPUTED-X
220700     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
220800     PERFORM FAIL.
220900 INI-WRITE-GF-9-8.
221000     PERFORM PRINT-DETAIL.
221100*
221200 INI-TEST-GF-9-9.
221300     ADD     1 TO REC-CT.
221400     MOVE   "INI-TEST-GF-9-9" TO PAR-NAME.
221500     IF      TEST-1-9 = "DD DD/DD"
221600             PERFORM PASS
221700             GO TO INI-WRITE-GF-9-9
221800     ELSE
221900             GO TO INI-FAIL-GF-9-9.
222000 INI-DELETE-GF-9-9.
222100     PERFORM DE-LETE.
222200     GO TO INI-WRITE-GF-9-9.
222300 INI-FAIL-GF-9-9.
222400     MOVE   "DD DD/DD" TO CORRECT-X
222500     MOVE    TEST-1-9  TO COMPUTED-X
222600     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
222700     PERFORM FAIL.
222800 INI-WRITE-GF-9-9.
222900     PERFORM PRINT-DETAIL.
223000*
223100 INI-TEST-GF-9-10.
223200     ADD     1 TO REC-CT.
223300     MOVE   "INI-TEST-GF-9-10" TO PAR-NAME.
223400     IF      TEST-1-10 = "AAAAAA"
223500             PERFORM PASS
223600             GO TO INI-WRITE-GF-9-10
223700     ELSE
223800             GO TO INI-FAIL-GF-9-10.
223900 INI-DELETE-GF-9-10.
224000     PERFORM DE-LETE.
224100     GO TO INI-WRITE-GF-9-10.
224200 INI-FAIL-GF-9-10.
224300     MOVE   "AAAAAA"  TO CORRECT-X
224400     MOVE    TEST-1-10 TO COMPUTED-X
224500     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
224600     PERFORM FAIL.
224700 INI-WRITE-GF-9-10.
224800     PERFORM PRINT-DETAIL.
224900*
225000 INI-TEST-GF-9-11.
225100     ADD     1 TO REC-CT.
225200     MOVE   "INI-TEST-GF-9-11" TO PAR-NAME.
225300     IF      TEST-8-DATA-1 = "$234.00"
225400             PERFORM PASS
225500             GO TO INI-WRITE-GF-9-11
225600     ELSE
225700             GO TO INI-FAIL-GF-9-11.
225800 INI-DELETE-GF-9-11.
225900     PERFORM DE-LETE.
226000     GO TO INI-WRITE-GF-9-11.
226100 INI-FAIL-GF-9-11.
226200     MOVE   "$234.00"  TO CORRECT-X
226300     MOVE    TEST-8-DATA-1  TO COMPUTED-X
226400     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
226500     PERFORM FAIL.
226600 INI-WRITE-GF-9-11.
226700     PERFORM PRINT-DETAIL.
226800*
226900 INI-TEST-GF-9-12.
227000     ADD     1 TO REC-CT.
227100     MOVE   "INI-TEST-GF-9-12" TO PAR-NAME.
227200     IF      TEST-8-DATA-2 = "AAAAAA    "
227300             PERFORM PASS
227400             GO TO INI-WRITE-GF-9-12
227500     ELSE
227600             GO TO INI-FAIL-GF-9-12.
227700 INI-DELETE-GF-9-12.
227800     PERFORM DE-LETE.
227900     GO TO INI-WRITE-GF-9-12.
228000 INI-FAIL-GF-9-12.
228100     MOVE   "AAAAAA    " TO CORRECT-X
228200     MOVE    TEST-8-DATA-2 TO COMPUTED-X
228300     MOVE   "INCORRECTLY INITIALIZED" TO RE-MARK
228400     PERFORM FAIL.
228500 INI-WRITE-GF-9-12.
228600     PERFORM PRINT-DETAIL.
228700*
228800 CCVS-EXIT SECTION.
228900 CCVS-999999.
229000     GO TO CLOSE-FILES.
