000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC233A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100
002200*                                                              *
002300*    PROGRAM NC233A USES FORMAT 2 OF THE "SEARCH" STATEMENT    *
002400*    TO ACCESS THRE AND SEVEN-DIMENSIONAL TABLES.              *
002500*    THE SCOPE TERMINATOR "END-SEARCH" IS ALSO TESTED.         *
002600*                                                              *
002700****************************************************************
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 77  SUB-1              PICTURE S99  VALUE ZERO.
004500 77  SUB-2              PICTURE 99   VALUE ZERO.
004600 77  SUB-3              PICTURE 99   VALUE ZERO.
004700 77  CON-7              PICTURE 99  VALUE 07.
004800 77  CON-10             PICTURE 99  VALUE 10.
004900 77  GRP-HOLD-AREA                PICTURE X(5)  VALUE SPACES.
005000 77  CON-5              PICTURE 99  VALUE 05.
005100 77  SEC-HOLD-AREA                PICTURE X(11)  VALUE SPACES.
005200 77  CON-6              PICTURE 99  VALUE 06.
005300 77  ELEM-HOLD-AREA               PICTURE X(15)  VALUE SPACES.
005400 77  L1-HOLD                     PIC XX.
005500 77  L2-HOLD                     PIC XX.
005600 77  L3-HOLD                     PIC XX.
005700 77  L4-HOLD                     PIC XX.
005800 77  L5-HOLD                     PIC XX.
005900 77  L6-HOLD                     PIC XX.
006000 77  L7-HOLD                     PIC XX.
006100 77  N1                         PIC 99.
006200 77  N2                         PIC 99.
006300 77  N3                         PIC 99.
006400 77  N4                         PIC 99.
006500 77  N5                         PIC 99.
006600 77  N6                         PIC 99.
006700 77  N7                         PIC 99.
006800 01  GRP-NAME.
006900     02  FILLER              PICTURE XXX    VALUE "GRP".
007000     02  ADD-GRP             PICTURE 99     VALUE 01.
007100
007200 01  SEC-NAME.
007300     02  FILLER              PICTURE X(5)   VALUE "SEC (".
007400     02  SEC-GRP             PICTURE 99     VALUE 00.
007500     02  FILLER              PICTURE X      VALUE ",".
007600     02  ADD-SEC             PICTURE 99     VALUE 01.
007700     02  FILLER              PICTURE X      VALUE ")".
007800
007900 01  ELEM-NAME.
008000     02  FILLER              PICTURE X(6)   VALUE "ELEM (".
008100     02  ELEM-GRP            PICTURE 99     VALUE 00.
008200     02  FILLER              PICTURE X      VALUE ",".
008300     02  ELEM-SEC            PICTURE 99     VALUE 00.
008400     02  FILLER              PICTURE X      VALUE ",".
008500     02  ADD-ELEM            PICTURE 99     VALUE 01.
008600     02  FILLER              PICTURE X      VALUE ")".
008700
008800 01  3-DIMENSION-TBL.
008900     02  GRP-ENTRY OCCURS 10 TIMES ASCENDING KEY IS GRP
009000         INDEXED BY IDX-1.
009100         03  ENTRY-1.
009200             05  GRP         PICTURE X(5).
009300         03  GRP2-ENTRY OCCURS 10 TIMES ASCENDING KEY IS SEC
009400             INDEXED BY IDX-2.
009500             04  ENTRY-2.
009600                 05  FILLER  PICTURE X(4).
009700                 05  SEC     PICTURE X(7).
009800             04  GRP3-ENTRY OCCURS 10 TIMES ASCENDING KEY IS ELEM
009900                 INDEXED BY IDX-3.
010000                 05  ENTRY-3.
010100                 07  FILLER  PICTURE X(8).
010200                 07  ELEM    PICTURE X(7).
010300
010400
010500 01  7-DIMENSION-TBL.
010600   02  GRP-7-1-ENTRY             OCCURS 2
010700                                 ASCENDING KEY IS ENTRY-7-1G
010800                                 INDEXED BY X1.
010900     03  ENTRY-7-1G.
011000       04  CHARS-7-1               PIC X.
011100       04  ENTRY-7-1               PIC 9.
011200     03  GRP-7-2-ENTRY           OCCURS 2
011300                                 ASCENDING KEY IS ENTRY-7-2G
011400                                 INDEXED BY X2.
011500       04  ENTRY-7-2G.
011600         05  CHARS-7-2             PIC X.
011700         05  ENTRY-7-2             PIC 9.
011800       04  GRP-7-3-ENTRY         OCCURS 2
011900                                 ASCENDING KEY IS ENTRY-7-3G
012000                                 INDEXED BY X3.
012100         05  ENTRY-7-3G.
012200           06  CHARS-7-3           PIC X.
012300           06  ENTRY-7-3           PIC 9.
012400         05  GRP-7-4-ENTRY       OCCURS 2
012500                                 ASCENDING KEY IS ENTRY-7-4G
012600                                 INDEXED BY X4.
012700           06  ENTRY-7-4G.
012800             07  CHARS-7-4       PIC X.
012900             07  ENTRY-7-4       PIC 9.
013000           06  GRP-7-5-ENTRY     OCCURS 2
013100                                 ASCENDING KEY IS ENTRY-7-5G
013200                                 INDEXED BY X5.
013300             07  ENTRY-7-5G.
013400               08  CHARS-7-5     PIC X.
013500               08  ENTRY-7-5     PIC 9.
013600             07  GRP-7-6-ENTRY   OCCURS 2
013700                                 ASCENDING KEY IS ENTRY-7-6G
013800                                 INDEXED BY X6.
013900               08  ENTRY-7-6G.
014000                 09  CHARS-7-6   PIC X.
014100                 09  ENTRY-7-6   PIC 9.
014200               08  GRP-7-7-ENTRY OCCURS 2
014300                                 ASCENDING KEY IS ENTRY-7-7G
014400                                 INDEXED BY X7.
014500                 09  ENTRY-7-7G.
014600                   10  CHARS-7-7 PIC X.
014700                   10  ENTRY-7-7 PIC 9.
014800
014900 01  NOTE-1.
015000     02  FILLER                   PICTURE X(74)  VALUE
015100     "NOTE 1 - CORRECT AND COMPUTED DATA ARE EQUAL BUT THE AT END
015200-    "PATH WAS TAKEN".
015300     02  FILLER                   PICTURE X(46)  VALUE SPACES.
015400 01  NOTE-2.
015500     02  FILLER                   PICTURE X(112)  VALUE
015600     "NOTE 2 - CORRECT AND COMPUTED DATA ARE NOT EQUAL. THE COMPUT
015700-    "ED ENTRY WAS EXTRACTED FROM THE TABLE BY SUBSCRIPTS.".
015800     02  FILLER                   PICTURE X(8)  VALUE SPACES.
015900
016000 01  END-STMT.
016100     02  FILLER         PICTURE X(7)  VALUE "AT END ".
016200     02  END-IDX                  PICTURE X(5)  VALUE SPACES.
016300     02  FILLER                   PICTURE XXX  VALUE " = ".
016400     02  IDX-VALU                 PICTURE 99  VALUE 00.
016500     02  FILLER                   PICTURE XXX  VALUE SPACES.
016600 01  TEST-RESULTS.
016700     02 FILLER                   PIC X      VALUE SPACE.
016800     02 FEATURE                  PIC X(20)  VALUE SPACE.
016900     02 FILLER                   PIC X      VALUE SPACE.
017000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
017100     02 FILLER                   PIC X      VALUE SPACE.
017200     02  PAR-NAME.
017300       03 FILLER                 PIC X(19)  VALUE SPACE.
017400       03  PARDOT-X              PIC X      VALUE SPACE.
017500       03 DOTVALUE               PIC 99     VALUE ZERO.
017600     02 FILLER                   PIC X(8)   VALUE SPACE.
017700     02 RE-MARK                  PIC X(61).
017800 01  TEST-COMPUTED.
017900     02 FILLER                   PIC X(30)  VALUE SPACE.
018000     02 FILLER                   PIC X(17)  VALUE
018100            "       COMPUTED=".
018200     02 COMPUTED-X.
018300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
018400     03 COMPUTED-N               REDEFINES COMPUTED-A
018500                                 PIC -9(9).9(9).
018600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
018700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
018800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
018900     03       CM-18V0 REDEFINES COMPUTED-A.
019000         04 COMPUTED-18V0                    PIC -9(18).
019100         04 FILLER                           PIC X.
019200     03 FILLER PIC X(50) VALUE SPACE.
019300 01  TEST-CORRECT.
019400     02 FILLER PIC X(30) VALUE SPACE.
019500     02 FILLER PIC X(17) VALUE "       CORRECT =".
019600     02 CORRECT-X.
019700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
019800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
019900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
020100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
020200     03      CR-18V0 REDEFINES CORRECT-A.
020300         04 CORRECT-18V0                     PIC -9(18).
020400         04 FILLER                           PIC X.
020500     03 FILLER PIC X(2) VALUE SPACE.
020600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
020700 01  CCVS-C-1.
020800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
020900-    "SS  PARAGRAPH-NAME
021000-    "       REMARKS".
021100     02 FILLER                     PIC X(20)    VALUE SPACE.
021200 01  CCVS-C-2.
021300     02 FILLER                     PIC X        VALUE SPACE.
021400     02 FILLER                     PIC X(6)     VALUE "TESTED".
021500     02 FILLER                     PIC X(15)    VALUE SPACE.
021600     02 FILLER                     PIC X(4)     VALUE "FAIL".
021700     02 FILLER                     PIC X(94)    VALUE SPACE.
021800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
021900 01  REC-CT                        PIC 99       VALUE ZERO.
022000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
022100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
022200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
022300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
022400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
022500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
022600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
022700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
022800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
022900 01  CCVS-H-1.
023000     02  FILLER                    PIC X(39)    VALUE SPACES.
023100     02  FILLER                    PIC X(42)    VALUE
023200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
023300     02  FILLER                    PIC X(39)    VALUE SPACES.
023400 01  CCVS-H-2A.
023500   02  FILLER                        PIC X(40)  VALUE SPACE.
023600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
023700   02  FILLER                        PIC XXXX   VALUE
023800     "4.2 ".
023900   02  FILLER                        PIC X(28)  VALUE
024000            " COPY - NOT FOR DISTRIBUTION".
024100   02  FILLER                        PIC X(41)  VALUE SPACE.
024200
024300 01  CCVS-H-2B.
024400   02  FILLER                        PIC X(15)  VALUE
024500            "TEST RESULT OF ".
024600   02  TEST-ID                       PIC X(9).
024700   02  FILLER                        PIC X(4)   VALUE
024800            " IN ".
024900   02  FILLER                        PIC X(12)  VALUE
025000     " HIGH       ".
025100   02  FILLER                        PIC X(22)  VALUE
025200            " LEVEL VALIDATION FOR ".
025300   02  FILLER                        PIC X(58)  VALUE
025400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025500 01  CCVS-H-3.
025600     02  FILLER                      PIC X(34)  VALUE
025700            " FOR OFFICIAL USE ONLY    ".
025800     02  FILLER                      PIC X(58)  VALUE
025900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026000     02  FILLER                      PIC X(28)  VALUE
026100            "  COPYRIGHT   1985 ".
026200 01  CCVS-E-1.
026300     02 FILLER                       PIC X(52)  VALUE SPACE.
026400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
026500     02 ID-AGAIN                     PIC X(9).
026600     02 FILLER                       PIC X(45)  VALUE SPACES.
026700 01  CCVS-E-2.
026800     02  FILLER                      PIC X(31)  VALUE SPACE.
026900     02  FILLER                      PIC X(21)  VALUE SPACE.
027000     02 CCVS-E-2-2.
027100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
027200         03 FILLER                   PIC X      VALUE SPACE.
027300         03 ENDER-DESC               PIC X(44)  VALUE
027400            "ERRORS ENCOUNTERED".
027500 01  CCVS-E-3.
027600     02  FILLER                      PIC X(22)  VALUE
027700            " FOR OFFICIAL USE ONLY".
027800     02  FILLER                      PIC X(12)  VALUE SPACE.
027900     02  FILLER                      PIC X(58)  VALUE
028000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028100     02  FILLER                      PIC X(13)  VALUE SPACE.
028200     02 FILLER                       PIC X(15)  VALUE
028300             " COPYRIGHT 1985".
028400 01  CCVS-E-4.
028500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
028600     02 FILLER                       PIC X(4)   VALUE " OF ".
028700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
028800     02 FILLER                       PIC X(40)  VALUE
028900      "  TESTS WERE EXECUTED SUCCESSFULLY".
029000 01  XXINFO.
029100     02 FILLER                       PIC X(19)  VALUE
029200            "*** INFORMATION ***".
029300     02 INFO-TEXT.
029400       04 FILLER                     PIC X(8)   VALUE SPACE.
029500       04 XXCOMPUTED                 PIC X(20).
029600       04 FILLER                     PIC X(5)   VALUE SPACE.
029700       04 XXCORRECT                  PIC X(20).
029800     02 INF-ANSI-REFERENCE           PIC X(48).
029900 01  HYPHEN-LINE.
030000     02 FILLER  PIC IS X VALUE IS SPACE.
030100     02 FILLER  PIC IS X(65)    VALUE IS "************************
030200-    "*****************************************".
030300     02 FILLER  PIC IS X(54)    VALUE IS "************************
030400-    "******************************".
030500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
030600     "NC233A".
030700 PROCEDURE DIVISION.
030800 CCVS1 SECTION.
030900 OPEN-FILES.
031000     OPEN     OUTPUT PRINT-FILE.
031100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
031200     MOVE    SPACE TO TEST-RESULTS.
031300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
031400     GO TO CCVS1-EXIT.
031500 CLOSE-FILES.
031600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
031700 TERMINATE-CCVS.
031800S    EXIT PROGRAM.
031900STERMINATE-CALL.
032000     STOP     RUN.
032100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
032200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
032300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
032400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
032500     MOVE "****TEST DELETED****" TO RE-MARK.
032600 PRINT-DETAIL.
032700     IF REC-CT NOT EQUAL TO ZERO
032800             MOVE "." TO PARDOT-X
032900             MOVE REC-CT TO DOTVALUE.
033000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
033100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
033200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
033300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
033400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
033500     MOVE SPACE TO CORRECT-X.
033600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
033700     MOVE     SPACE TO RE-MARK.
033800 HEAD-ROUTINE.
033900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
034200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
034300 COLUMN-NAMES-ROUTINE.
034400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
034700 END-ROUTINE.
034800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
034900 END-RTN-EXIT.
035000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035100 END-ROUTINE-1.
035200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
035300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
035400      ADD PASS-COUNTER TO ERROR-HOLD.
035500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
035600      MOVE PASS-COUNTER TO CCVS-E-4-1.
035700      MOVE ERROR-HOLD TO CCVS-E-4-2.
035800      MOVE CCVS-E-4 TO CCVS-E-2-2.
035900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
036000  END-ROUTINE-12.
036100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
036200     IF       ERROR-COUNTER IS EQUAL TO ZERO
036300         MOVE "NO " TO ERROR-TOTAL
036400         ELSE
036500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
036600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
036700     PERFORM WRITE-LINE.
036800 END-ROUTINE-13.
036900     IF DELETE-COUNTER IS EQUAL TO ZERO
037000         MOVE "NO " TO ERROR-TOTAL  ELSE
037100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
037200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
037300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037400      IF   INSPECT-COUNTER EQUAL TO ZERO
037500          MOVE "NO " TO ERROR-TOTAL
037600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
037700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
037800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038000 WRITE-LINE.
038100     ADD 1 TO RECORD-COUNT.
038200Y    IF RECORD-COUNT GREATER 50
038300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
038400Y        MOVE SPACE TO DUMMY-RECORD
038500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
038600Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
038700Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
038800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
038900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
039000Y        MOVE ZERO TO RECORD-COUNT.
039100     PERFORM WRT-LN.
039200 WRT-LN.
039300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
039400     MOVE SPACE TO DUMMY-RECORD.
039500 BLANK-LINE-PRINT.
039600     PERFORM WRT-LN.
039700 FAIL-ROUTINE.
039800     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
039900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
040000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
040100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
040200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040300     MOVE   SPACES TO INF-ANSI-REFERENCE.
040400     GO TO  FAIL-ROUTINE-EX.
040500 FAIL-ROUTINE-WRITE.
040600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
040700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
040800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
040900     MOVE   SPACES TO COR-ANSI-REFERENCE.
041000 FAIL-ROUTINE-EX. EXIT.
041100 BAIL-OUT.
041200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
041300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
041400 BAIL-OUT-WRITE.
041500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
041600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041800     MOVE   SPACES TO INF-ANSI-REFERENCE.
041900 BAIL-OUT-EX. EXIT.
042000 CCVS1-EXIT.
042100     EXIT.
042200 SECT-NC233A-001 SECTION.
042300 TH-05-001.
042400 BUILD-LEVEL-1.
042500     ADD 1 TO SUB-1.
042600     IF SUB-1 = 11 GO TO CHECK-ENTRIES.
042700     MOVE GRP-NAME TO ENTRY-1 (SUB-1).
042800     ADD 1 TO ADD-GRP.
042900 BUILD-LEVEL-2.
043000     ADD 1 TO SUB-2.
043100     IF SUB-2 = 11
043200         MOVE ZERO TO SUB-2
043300         MOVE 01 TO ADD-SEC
043400         GO TO BUILD-LEVEL-1.
043500     MOVE SUB-1 TO SEC-GRP.
043600     MOVE SEC-NAME TO ENTRY-2 (SUB-1, SUB-2).
043700     ADD 1 TO ADD-SEC.
043800 BUILD-LEVEL-3.
043900     ADD 1 TO SUB-3.
044000     IF SUB-3 = 11
044100         MOVE ZERO TO SUB-3
044200              MOVE 01 TO ADD-ELEM
044300              GO TO BUILD-LEVEL-2.
044400     MOVE SUB-1 TO ELEM-GRP.
044500     MOVE SUB-2 TO ELEM-SEC.
044600     MOVE ELEM-NAME TO ENTRY-3 (SUB-1, SUB-2, SUB-3).
044700     ADD 1 TO ADD-ELEM.
044800     GO TO BUILD-LEVEL-3.
044900
045000 CHECK-ENTRIES.
045100     MOVE "SEARCH ALL-FIRST LEV" TO FEATURE.
045200     MOVE "CHECK-ENTRIES       " TO PAR-NAME.
045300     MOVE "GRP02" TO GRP-HOLD-AREA.
045400     MOVE 02 TO SUB-2.
045500     SET IDX-1 TO 1.
045600     SEARCH ALL GRP-ENTRY AT END
045700         PERFORM GRP-FAIL-PARGRAPH
045800         GO TO LEVEL-1-TEST-2
045900         WHEN GRP (IDX-1) = GRP-HOLD-AREA NEXT SENTENCE.
046000
046100     PERFORM PASS-TH.
046200     GO TO LEVEL-1-TEST-2.
046300
046400 GRP-FAIL-PARGRAPH.
046500     MOVE GRP-HOLD-AREA TO CORRECT-A.
046600     IF ENTRY-1 (SUB-2) EQUAL TO GRP-HOLD-AREA
046700         MOVE "IDX-1" TO END-IDX
046800         SET IDX-VALU TO IDX-1
046900         MOVE "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
047000         MOVE END-STMT TO COMPUTED-A  ELSE
047100     MOVE ENTRY-1 (SUB-2) TO COMPUTED-A
047200     MOVE "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
047300
047400     PERFORM FAIL-TH.
047500 LEVEL-1-TEST-2.
047600     MOVE "LEVEL-1-TEST-2      " TO PAR-NAME.
047700     MOVE "GRP01" TO GRP-HOLD-AREA.
047800     MOVE 01 TO SUB-2.
047900     SET IDX-1 TO 1.
048000     SEARCH ALL GRP-ENTRY AT END
048100         PERFORM GRP-FAIL-PARGRAPH
048200         GO TO LEVEL-1-TEST-3
048300         WHEN GRP (IDX-1) = GRP-HOLD-AREA NEXT SENTENCE.
048400
048500     PERFORM PASS-TH.
048600 LEVEL-1-TEST-3.
048700     MOVE "LEVEL-1-TEST-3      " TO PAR-NAME.
048800     MOVE "GRP10" TO GRP-HOLD-AREA.
048900     MOVE 10 TO SUB-2.
049000     SET IDX-1 TO 1.
049100     SEARCH ALL GRP-ENTRY AT END
049200         PERFORM GRP-FAIL-PARGRAPH
049300         GO TO LEVEL-1-TEST-4
049400         WHEN GRP (IDX-1) = GRP-HOLD-AREA NEXT SENTENCE.
049500
049600     PERFORM PASS-TH.
049700 LEVEL-1-TEST-4.
049800     MOVE "LEVEL-1-TEST-4      " TO PAR-NAME.
049900     MOVE "GRP05" TO GRP-HOLD-AREA.
050000     MOVE 05 TO SUB-2.
050100     SET IDX-1 TO 05.
050200     SEARCH ALL GRP-ENTRY
050300         WHEN GRP (IDX-1) = GRP-HOLD-AREA GO TO PASS-TH-TEST-4.
050400     PERFORM GRP-FAIL-PARGRAPH.
050500     GO TO LEVEL-2-TEST-1.
050600 PASS-TH-TEST-4.
050700
050800     PERFORM PASS-TH.
050900
051000 LEVEL-2-TEST-1.
051100     MOVE "SEARCH ALL-SEC LEVEL" TO FEATURE.
051200     MOVE "LEVEL-2-TEST-1      " TO PAR-NAME.
051300     MOVE "SEC (01,01)" TO SEC-HOLD-AREA.
051400     MOVE 1 TO SUB-1   SUB-2.
051500     SET IDX-1 IDX-2 TO 1.
051600     SEARCH ALL GRP2-ENTRY AT END
051700         PERFORM SEC-FAIL-PARGRAF
051800         GO TO LEVEL-2-TEST-2
051900         WHEN SEC (IDX-1, IDX-2) = "(01,01)" NEXT SENTENCE.
052000
052100     PERFORM PASS-TH.
052200
052300 LEVEL-2-TEST-2.
052400     MOVE "LEVEL-2-TEST-2      " TO PAR-NAME.
052500     MOVE "SEC (05,10)" TO SEC-HOLD-AREA.
052600     MOVE 05 TO SUB-1.
052700     MOVE 10 TO SUB-2.
052800     SET IDX-1 TO 5.
052900     SET IDX-2 TO 1.
053000     SEARCH ALL GRP2-ENTRY AT END
053100         PERFORM SEC-FAIL-PARGRAF
053200         GO TO LEVEL-2-TEST-3
053300         WHEN SEC (IDX-1, IDX-2) = "(05,10)" NEXT SENTENCE.
053400
053500     PERFORM PASS-TH.
053600
053700 LEVEL-2-TEST-3.
053800     MOVE "LEVEL-2-TEST-3      " TO PAR-NAME.
053900     MOVE "SEC (10,10)" TO SEC-HOLD-AREA.
054000     SET IDX-1 TO 10.
054100     SET IDX-2 TO 1.
054200     MOVE 10 TO SUB-1  SUB-2.
054300     SEARCH ALL GRP2-ENTRY AT END
054400         PERFORM SEC-FAIL-PARGRAF
054500         GO TO LEVEL-2-TEST-4
054600         WHEN SEC (IDX-1, IDX-2) = "(10,10)" NEXT SENTENCE.
054700
054800     PERFORM PASS-TH.
054900 LEVEL-2-TEST-4.
055000     MOVE "LEVEL-2-TEST-4      " TO PAR-NAME.
055100     MOVE "SEC (08,02)" TO SEC-HOLD-AREA.
055200     MOVE 08 TO SUB-1.
055300     MOVE 02 TO SUB-2.
055400     SET IDX-1 TO 08.
055500     SET IDX-2 TO 01.
055600     SEARCH ALL GRP2-ENTRY
055700         WHEN SEC (IDX-1, IDX-2) = "(08,02)" GO TO PASS-TH-2-4.
055800     PERFORM SEC-FAIL-PARGRAF.
055900     GO TO LEVEL-3-TEST-1.
056000 PASS-TH-2-4.
056100
056200     PERFORM PASS-TH.
056300     GO TO LEVEL-3-TEST-1.
056400
056500 SEC-FAIL-PARGRAF.
056600     MOVE SEC-HOLD-AREA TO CORRECT-A.
056700     IF ENTRY-2 (SUB-1, SUB-2) EQUAL TO SEC-HOLD-AREA
056800         MOVE "IDX-2" TO END-IDX
056900         SET IDX-VALU TO IDX-2
057000         MOVE "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
057100         MOVE END-STMT TO COMPUTED-A  ELSE
057200     MOVE ENTRY-2 (SUB-1, SUB-2) TO COMPUTED-A
057300     MOVE "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
057400
057500     PERFORM FAIL-TH.
057600
057700 LEVEL-3-TEST-1.
057800     MOVE "LEVEL-3-TEST-1      " TO PAR-NAME.
057900     MOVE "SEARCH ALL THIRD LEV" TO FEATURE.
058000     MOVE 1 TO SUB-1  SUB-2  SUB-3.
058100     MOVE "ELEM (01,01,01)" TO ELEM-HOLD-AREA.
058200     SET IDX-1 IDX-2 IDX-3 TO 1.
058300     SEARCH ALL GRP3-ENTRY
058400         WHEN ELEM (IDX-1, IDX-2, IDX-3) = ",01,01)"
058500             GO TO PASS-TH-3-1.
058600     PERFORM ELEM-FAIL-PARA.
058700     GO TO LEVEL-3-TEST-2.
058800 PASS-TH-3-1.
058900
059000     PERFORM PASS-TH.
059100
059200 LEVEL-3-TEST-2.
059300     MOVE "LEVEL-3-TEST-2      " TO PAR-NAME.
059400     MOVE 05 TO SUB-1.
059500     MOVE 06 TO SUB-2.
059600     MOVE 07 TO SUB-3.
059700     SET IDX-1 TO 05.
059800     SET IDX-2 TO 06.
059900     SET IDX-3 TO 1.
060000     MOVE "ELEM (05,06,07)" TO ELEM-HOLD-AREA.
060100     SEARCH ALL GRP3-ENTRY AT END
060200         PERFORM ELEM-FAIL-PARA
060300         GO TO LEVEL-3-TEST-3
060400         WHEN ELEM (IDX-1, IDX-2, IDX-3) = ",06,07)"
060500             NEXT SENTENCE.
060600
060700     PERFORM PASS-TH.
060800
060900 LEVEL-3-TEST-3.
061000     MOVE "LEVEL-3-TEST-3      " TO PAR-NAME.
061100     MOVE 10 TO SUB-1 SUB-2 SUB-3.
061200     SET IDX-1 IDX-2 TO 10.
061300     SET IDX-3 TO 1.
061400     MOVE "ELEM (10,10,10)" TO ELEM-HOLD-AREA.
061500     SEARCH ALL GRP3-ENTRY AT END
061600         PERFORM ELEM-FAIL-PARA
061700         GO TO LEVEL-3-TEST-4
061800         WHEN ELEM (IDX-1, IDX-2, IDX-3) = ",10,10)"
061900             NEXT SENTENCE.
062000
062100     PERFORM PASS-TH.
062200 LEVEL-3-TEST-4.
062300     MOVE "LEVEL-3-TEST-4      " TO PAR-NAME.
062400     MOVE "ELEM (07,06,05)" TO ELEM-HOLD-AREA.
062500     MOVE 07 TO SUB-1.
062600     MOVE 06 TO SUB-2.
062700     MOVE 05 TO SUB-3.
062800     SET IDX-1 TO 07.
062900     SET IDX-2 TO 06.
063000     SET IDX-3 TO 03.
063100     SEARCH ALL GRP3-ENTRY AT END
063200         PERFORM ELEM-FAIL-PARA
063300         GO TO MULT-SEARCH-TEST-1
063400         WHEN ELEM (IDX-1, IDX-2, IDX-3) = ",06,05)"
063500             NEXT SENTENCE.
063600
063700     PERFORM PASS-TH.
063800     GO TO MULT-SEARCH-TEST-1.
063900 ELEM-FAIL-PARA.
064000     MOVE ELEM-HOLD-AREA TO CORRECT-A.
064100     IF ENTRY-3 (SUB-1, SUB-2, SUB-3) EQUAL TO ELEM-HOLD-AREA
064200         MOVE "IDX-3" TO END-IDX
064300         SET IDX-VALU TO IDX-3
064400         MOVE "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
064500         MOVE END-STMT TO COMPUTED-A  ELSE
064600     MOVE ENTRY-3 (SUB-1, SUB-2, SUB-3) TO COMPUTED-A
064700     MOVE "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
064800
064900     PERFORM FAIL-TH.
065000
065100 MULT-SEARCH-TEST-1.
065200     MOVE "MULT-SEARCH-TEST-1  " TO PAR-NAME.
065300     MOVE "MULTIPLE SEARCH STMT" TO FEATURE.
065400     MOVE "GRP08" TO GRP-HOLD-AREA.
065500     MOVE "SEC (08,07)" TO SEC-HOLD-AREA.
065600     SET IDX-1 IDX-2 TO 1.
065700     SEARCH ALL GRP-ENTRY AT END GO TO MULT-SEARCH-FAIL1
065800         WHEN GRP (IDX-1) = "GRP08" NEXT SENTENCE.
065900     SEARCH ALL GRP2-ENTRY AT END GO TO MULT-SEARCH-FAIL
066000         WHEN SEC (IDX-1, IDX-2) = "(08,07)" NEXT SENTENCE.
066100
066200     PERFORM PASS-TH.
066300     GO TO MULT-SEARCH-7-INIT-3.
066400 MULT-SEARCH-FAIL1.
066500     MOVE GRP-HOLD-AREA TO CORRECT-A.
066600     IF ENTRY-1 (08) EQUAL TO GRP-HOLD-AREA
066700         MOVE "IDX-1" TO END-IDX
066800         MOVE "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
066900         SET IDX-VALU TO IDX-1
067000         MOVE END-STMT TO COMPUTED-A  ELSE
067100     MOVE ENTRY-1 (08) TO COMPUTED-A
067200     MOVE "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
067300
067400     PERFORM FAIL-TH.
067500     GO TO MULT-SEARCH-7-INIT-3.
067600 MULT-SEARCH-FAIL.
067700     MOVE SEC-HOLD-AREA TO CORRECT-A.
067800     IF ENTRY-2 (08, 07) EQUAL TO SEC-HOLD-AREA
067900         MOVE "IDX-2" TO END-IDX
068000         SET IDX-VALU TO IDX-2
068100         MOVE "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
068200         MOVE END-STMT TO COMPUTED-A  ELSE
068300     MOVE ENTRY-2 (08, 07) TO COMPUTED-A
068400     MOVE "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
068500
068600     PERFORM FAIL-TH.
068700
068800 MULT-SEARCH-7-INIT-3.
068900     MOVE   "MULT-SEARCH-7-TEST-3" TO PAR-NAME.
069000     MOVE   "VI-122 6.21"          TO ANSI-REFERENCE.
069100     MOVE   "A2" TO L1-HOLD.
069200     MOVE   "B1" TO L2-HOLD.
069300     MOVE   "C2" TO L3-HOLD.
069400     MOVE   "D1" TO L4-HOLD.
069500     MOVE   "E2" TO L5-HOLD.
069600     MOVE   "F1" TO L6-HOLD.
069700     MOVE   "G2" TO L7-HOLD.
069800     SET     X1 X2 X3 X4 X5 X6 X7 TO 1.
069900     PERFORM MULT-SEARCH-7-INIT-3-A
070000             VARYING N1 FROM 1 BY 1 UNTIL N1 > 2
070100               AFTER N2 FROM 1 BY 1 UNTIL N2 > 2
070200               AFTER N3 FROM 1 BY 1 UNTIL N3 > 2
070300               AFTER N4 FROM 1 BY 1 UNTIL N4 > 2
070400               AFTER N5 FROM 1 BY 1 UNTIL N5 > 2
070500               AFTER N6 FROM 1 BY 1 UNTIL N6 > 2
070600               AFTER N7 FROM 1 BY 1 UNTIL N7 > 2.
070700     GO TO   MULT-SEARCH-7-TEST-3.
070800 MULT-SEARCH-7-INIT-3-A.
070900
071000     MOVE    N1 TO ENTRY-7-1 (N1).
071100     MOVE   "A" TO CHARS-7-1 (N1).
071200     MOVE    N2 TO ENTRY-7-2 (N1 N2).
071300     MOVE   "B" TO CHARS-7-2 (N1 N2).
071400     MOVE    N3 TO ENTRY-7-3 (N1 N2 N3).
071500     MOVE   "C" TO CHARS-7-3 (N1 N2 N3).
071600     MOVE    N4 TO ENTRY-7-4 (N1 N2 N3 N4).
071700     MOVE   "D" TO CHARS-7-4 (N1 N2 N3 N4).
071800     MOVE    N5 TO ENTRY-7-5 (N1 N2 N3 N4 N5).
071900     MOVE   "E" TO CHARS-7-5 (N1 N2 N3 N4 N5).
072000     MOVE    N6 TO ENTRY-7-6 (N1 N2 N3 N4 N5 N6).
072100     MOVE   "F" TO CHARS-7-6 (N1 N2 N3 N4 N5 N6).
072200     MOVE    N7 TO ENTRY-7-7 (N1 N2 N3 N4 N5 N6 N7).
072300     MOVE   "G" TO CHARS-7-7 (N1 N2 N3 N4 N5 N6 N7).
072400 MULT-SEARCH-7-DELETE-3.
072500     PERFORM DE-LETE.
072600     PERFORM PRINT-DETAIL.
072700     GO TO   END-SEARCH-TEST.
072800 MULT-SEARCH-7-TEST-3.
072900     SEARCH  ALL GRP-7-1-ENTRY
073000             AT END  GO TO MULT-SEARCH-7-FAIL-1
073100             WHEN    ENTRY-7-1G (X1) =  L1-HOLD
073200                     NEXT SENTENCE.
073300     SET     X1 TO 1.
073400     SEARCH  ALL GRP-7-2-ENTRY
073500             AT END  GO TO MULT-SEARCH-7-FAIL-2
073600             WHEN    ENTRY-7-2G (X1 X2) = L2-HOLD
073700                     NEXT SENTENCE.
073800     SET     X1 TO 2.
073900     SET     X2 TO 1.
074000     SEARCH  ALL GRP-7-3-ENTRY
074100             AT END  GO TO MULT-SEARCH-7-FAIL-3
074200             WHEN    ENTRY-7-3G (X1 X2 X3) = L3-HOLD
074300                     NEXT SENTENCE.
074400     SET     X1 TO 1.
074500     SET     X2, X3 TO 1.
074600     SEARCH  ALL GRP-7-4-ENTRY
074700             AT END  GO TO MULT-SEARCH-7-FAIL-4
074800             WHEN    ENTRY-7-4G (X1 X2 X3 X4) =  L4-HOLD
074900                     NEXT SENTENCE.
075000     SET     X1 TO 2.
075100     SET     X2, X3, X4 TO 1.
075200     SEARCH  ALL GRP-7-5-ENTRY
075300             AT END  GO TO MULT-SEARCH-7-FAIL-5
075400             WHEN    ENTRY-7-5G (X1 X2 X3 X4 X5) = L5-HOLD
075500                     NEXT SENTENCE.
075600     SET     X1 TO 1.
075700     SET     X2, X3, X4, X5 TO 1.
075800     SEARCH  ALL GRP-7-6-ENTRY
075900             AT END  GO TO MULT-SEARCH-7-FAIL-6
076000             WHEN ENTRY-7-6G (X1 X2 X3 X4 X5 X6) = L6-HOLD
076100                     NEXT SENTENCE.
076200     SET     X1 TO 2.
076300     SET     X2, X3, X4, X6 TO 1.
076400     SEARCH  ALL GRP-7-7-ENTRY
076500             AT END  GO TO MULT-SEARCH-7-FAIL-7
076600             WHEN ENTRY-7-7G (X1 X2 X3 X4 X5 X6 X7) = L7-HOLD
076700                     NEXT SENTENCE.
076800
076900     PERFORM PASS-TH.
077000     GO TO   END-SEARCH-TEST.
077100
077200 MULT-SEARCH-7-FAIL-1.
077300     MOVE    L1-HOLD TO CORRECT-A.
077400     IF      ENTRY-7-1 (2) = L1-HOLD
077500             MOVE   "IX-1" TO END-IDX
077600             SET     IDX-VALU TO X1
077700             MOVE   "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
077800             MOVE    END-STMT TO COMPUTED-A
077900     ELSE
078000             MOVE    ENTRY-7-1 (2) TO COMPUTED-A
078100             MOVE   "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
078200
078300     PERFORM FAIL-TH.
078400     GO TO   END-SEARCH-TEST.
078500
078600 MULT-SEARCH-7-FAIL-2.
078700     MOVE    L2-HOLD TO CORRECT-A.
078800     IF      ENTRY-7-2 (2 1) = L1-HOLD
078900             MOVE   "X2" TO END-IDX
079000             SET     IDX-VALU TO X2
079100             MOVE   "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
079200             MOVE    END-STMT TO COMPUTED-A
079300     ELSE
079400             MOVE    ENTRY-7-2 (2 1) TO COMPUTED-A
079500             MOVE   "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
079600
079700     PERFORM FAIL-TH.
079800     GO TO   END-SEARCH-TEST.
079900
080000 MULT-SEARCH-7-FAIL-3.
080100     MOVE    L3-HOLD TO CORRECT-A.
080200     IF      ENTRY-7-3 (2 1 2) = L3-HOLD
080300             MOVE   "X3" TO END-IDX
080400             SET     IDX-VALU TO X3
080500             MOVE   "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
080600             MOVE    END-STMT TO COMPUTED-A
080700     ELSE
080800             MOVE    ENTRY-7-3 (2 1 2) TO COMPUTED-A
080900             MOVE   "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
081000
081100     PERFORM FAIL-TH.
081200     GO TO   END-SEARCH-TEST.
081300
081400 MULT-SEARCH-7-FAIL-4.
081500     MOVE    L4-HOLD TO CORRECT-A.
081600     IF      ENTRY-7-4 (2 1 2 1) = L4-HOLD
081700             MOVE   "X4" TO END-IDX
081800             SET     IDX-VALU TO X4
081900             MOVE   "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
082000             MOVE    END-STMT TO COMPUTED-A
082100     ELSE
082200             MOVE    ENTRY-7-4 (2 1 2 1) TO COMPUTED-A
082300             MOVE   "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
082400
082500     PERFORM FAIL-TH.
082600     GO TO   END-SEARCH-TEST.
082700
082800 MULT-SEARCH-7-FAIL-5.
082900     MOVE    L5-HOLD TO CORRECT-A.
083000     IF      ENTRY-7-5 (2 1 2 1 2) = L5-HOLD
083100             MOVE   "X5" TO END-IDX
083200             SET     IDX-VALU TO X5
083300             MOVE   "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
083400             MOVE    END-STMT TO COMPUTED-A
083500     ELSE
083600             MOVE    ENTRY-7-5 (2 1 2 1 2) TO COMPUTED-A
083700             MOVE   "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
083800
083900     PERFORM FAIL-TH.
084000     GO TO   END-SEARCH-TEST.
084100
084200 MULT-SEARCH-7-FAIL-6.
084300     MOVE    L6-HOLD TO CORRECT-A.
084400     IF      ENTRY-7-6 (2 1 2 1 2 1) = L6-HOLD
084500             MOVE   "X6" TO END-IDX
084600             SET     IDX-VALU TO X6
084700             MOVE   "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
084800             MOVE    END-STMT TO COMPUTED-A
084900     ELSE
085000             MOVE    ENTRY-7-6 (2 1 2 1 2 1) TO COMPUTED-A
085100             MOVE   "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
085200
085300     PERFORM FAIL-TH.
085400     GO TO   END-SEARCH-TEST.
085500
085600 MULT-SEARCH-7-FAIL-7.
085700     MOVE    L7-HOLD TO CORRECT-A.
085800     IF      ENTRY-7-7 (2 1 2 1 2 1 2) = L6-HOLD
085900             MOVE   "X7" TO END-IDX
086000             SET     IDX-VALU TO X7
086100             MOVE   "SEE NOTE 1 FOR DIAGNOSTIC  " TO RE-MARK
086200             MOVE    END-STMT TO COMPUTED-A
086300     ELSE
086400             MOVE    ENTRY-7-7 (2 1 2 1 2 1 2) TO COMPUTED-A
086500             MOVE   "SEE NOTE 2 FOR DIAGNOSTIC  " TO RE-MARK.
086600
086700     PERFORM FAIL-TH.
086800
086900     GO TO END-SEARCH-TEST.
087000
087100 PASS-TH.
087200     PERFORM PASS.
087300     PERFORM PRINT-DETAIL.
087400 FAIL-TH.
087500     PERFORM FAIL.
087600     PERFORM  PRINT-DETAIL.
087700 END-SEARCH-TEST.
087800     EXIT.
087900 CCVS-EXIT SECTION.
088000 CCVS-999999.
088100     GO TO CLOSE-FILES.
