000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC236A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100
002200*                                                              *
002300*    PROGRAM NC236A TESTS FORMAT 1 OF THE "SEARCH" STATEMENT   *
002400*    USING TWO-DIMAENSIONAL TABKES WHICH HAVE BEEN REDEFINED.  *
002500*    THE OPTIONAL "VARYING" AND "AT END" PHRASES ARE USED.     *
002600*                                                              *
002700****************************************************************
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 01  NOTE-1.
004500     02  FILLER        PIC X(74)  VALUE
004600     "NOTE 1 - CORRECT AND COMPUTED DATA ARE EQUAL BUT THE AT END
004700-    "PATH WAS TAKEN".
004800     02  FILLER        PIC X(46)  VALUE SPACES.
004900 01  NOTE-2.
005000     02  FILLER        PIC X(112) VALUE
005100     "NOTE 2 - CORRECT AND COMPUTED DATA ARE NOT EQUAL. THE COMPUT
005200-    "ED ENTRY WAS EXTRACTED FROM THE TABLE BY SUBSCRIPTS.".
005300     02  FILLER        PIC X(8)   VALUE SPACES.
005400 01  TABLE-A PIC X(20) VALUE "01020304050607080910".
005500 01  TABLE-1 REDEFINES TABLE-A.
005600     02  TBL-A OCCURS 10 TIMES INDEXED BY A.
005700         03  ELMT-A   PIC 99.
005800 01  W  USAGE INDEX.
005900 01   INDEX-VALUE  PIC 9999.
006000 01  TABLE-B PIC X(20) VALUE "01020304050607080910".
006100 01  TABLE-2 REDEFINES TABLE-B.
006200     02  TBL-B OCCURS 10 TIMES INDEXED BY B.
006300         03  ELMT-B   PIC 99.
006400 01  TEST-RESULTS.
006500     02 FILLER                   PIC X      VALUE SPACE.
006600     02 FEATURE                  PIC X(20)  VALUE SPACE.
006700     02 FILLER                   PIC X      VALUE SPACE.
006800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006900     02 FILLER                   PIC X      VALUE SPACE.
007000     02  PAR-NAME.
007100       03 FILLER                 PIC X(19)  VALUE SPACE.
007200       03  PARDOT-X              PIC X      VALUE SPACE.
007300       03 DOTVALUE               PIC 99     VALUE ZERO.
007400     02 FILLER                   PIC X(8)   VALUE SPACE.
007500     02 RE-MARK                  PIC X(61).
007600 01  TEST-COMPUTED.
007700     02 FILLER                   PIC X(30)  VALUE SPACE.
007800     02 FILLER                   PIC X(17)  VALUE
007900            "       COMPUTED=".
008000     02 COMPUTED-X.
008100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
008200     03 COMPUTED-N               REDEFINES COMPUTED-A
008300                                 PIC -9(9).9(9).
008400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
008500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
008600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
008700     03       CM-18V0 REDEFINES COMPUTED-A.
008800         04 COMPUTED-18V0                    PIC -9(18).
008900         04 FILLER                           PIC X.
009000     03 FILLER PIC X(50) VALUE SPACE.
009100 01  TEST-CORRECT.
009200     02 FILLER PIC X(30) VALUE SPACE.
009300     02 FILLER PIC X(17) VALUE "       CORRECT =".
009400     02 CORRECT-X.
009500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
009600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
009700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
009800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
010000     03      CR-18V0 REDEFINES CORRECT-A.
010100         04 CORRECT-18V0                     PIC -9(18).
010200         04 FILLER                           PIC X.
010300     03 FILLER PIC X(2) VALUE SPACE.
010400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
010500 01  CCVS-C-1.
010600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
010700-    "SS  PARAGRAPH-NAME
010800-    "       REMARKS".
010900     02 FILLER                     PIC X(20)    VALUE SPACE.
011000 01  CCVS-C-2.
011100     02 FILLER                     PIC X        VALUE SPACE.
011200     02 FILLER                     PIC X(6)     VALUE "TESTED".
011300     02 FILLER                     PIC X(15)    VALUE SPACE.
011400     02 FILLER                     PIC X(4)     VALUE "FAIL".
011500     02 FILLER                     PIC X(94)    VALUE SPACE.
011600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
011700 01  REC-CT                        PIC 99       VALUE ZERO.
011800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
011900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
012200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
012300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
012400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
012500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
012600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
012700 01  CCVS-H-1.
012800     02  FILLER                    PIC X(39)    VALUE SPACES.
012900     02  FILLER                    PIC X(42)    VALUE
013000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013100     02  FILLER                    PIC X(39)    VALUE SPACES.
013200 01  CCVS-H-2A.
013300   02  FILLER                        PIC X(40)  VALUE SPACE.
013400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
013500   02  FILLER                        PIC XXXX   VALUE
013600     "4.2 ".
013700   02  FILLER                        PIC X(28)  VALUE
013800            " COPY - NOT FOR DISTRIBUTION".
013900   02  FILLER                        PIC X(41)  VALUE SPACE.
014000
014100 01  CCVS-H-2B.
014200   02  FILLER                        PIC X(15)  VALUE
014300            "TEST RESULT OF ".
014400   02  TEST-ID                       PIC X(9).
014500   02  FILLER                        PIC X(4)   VALUE
014600            " IN ".
014700   02  FILLER                        PIC X(12)  VALUE
014800     " HIGH       ".
014900   02  FILLER                        PIC X(22)  VALUE
015000            " LEVEL VALIDATION FOR ".
015100   02  FILLER                        PIC X(58)  VALUE
015200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015300 01  CCVS-H-3.
015400     02  FILLER                      PIC X(34)  VALUE
015500            " FOR OFFICIAL USE ONLY    ".
015600     02  FILLER                      PIC X(58)  VALUE
015700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
015800     02  FILLER                      PIC X(28)  VALUE
015900            "  COPYRIGHT   1985 ".
016000 01  CCVS-E-1.
016100     02 FILLER                       PIC X(52)  VALUE SPACE.
016200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
016300     02 ID-AGAIN                     PIC X(9).
016400     02 FILLER                       PIC X(45)  VALUE SPACES.
016500 01  CCVS-E-2.
016600     02  FILLER                      PIC X(31)  VALUE SPACE.
016700     02  FILLER                      PIC X(21)  VALUE SPACE.
016800     02 CCVS-E-2-2.
016900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017000         03 FILLER                   PIC X      VALUE SPACE.
017100         03 ENDER-DESC               PIC X(44)  VALUE
017200            "ERRORS ENCOUNTERED".
017300 01  CCVS-E-3.
017400     02  FILLER                      PIC X(22)  VALUE
017500            " FOR OFFICIAL USE ONLY".
017600     02  FILLER                      PIC X(12)  VALUE SPACE.
017700     02  FILLER                      PIC X(58)  VALUE
017800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017900     02  FILLER                      PIC X(13)  VALUE SPACE.
018000     02 FILLER                       PIC X(15)  VALUE
018100             " COPYRIGHT 1985".
018200 01  CCVS-E-4.
018300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
018400     02 FILLER                       PIC X(4)   VALUE " OF ".
018500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
018600     02 FILLER                       PIC X(40)  VALUE
018700      "  TESTS WERE EXECUTED SUCCESSFULLY".
018800 01  XXINFO.
018900     02 FILLER                       PIC X(19)  VALUE
019000            "*** INFORMATION ***".
019100     02 INFO-TEXT.
019200       04 FILLER                     PIC X(8)   VALUE SPACE.
019300       04 XXCOMPUTED                 PIC X(20).
019400       04 FILLER                     PIC X(5)   VALUE SPACE.
019500       04 XXCORRECT                  PIC X(20).
019600     02 INF-ANSI-REFERENCE           PIC X(48).
019700 01  HYPHEN-LINE.
019800     02 FILLER  PIC IS X VALUE IS SPACE.
019900     02 FILLER  PIC IS X(65)    VALUE IS "************************
020000-    "*****************************************".
020100     02 FILLER  PIC IS X(54)    VALUE IS "************************
020200-    "******************************".
020300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
020400     "NC236A".
020500 PROCEDURE DIVISION.
020600 CCVS1 SECTION.
020700 OPEN-FILES.
020800     OPEN     OUTPUT PRINT-FILE.
020900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021000     MOVE    SPACE TO TEST-RESULTS.
021100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
021200     GO TO CCVS1-EXIT.
021300 CLOSE-FILES.
021400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
021500 TERMINATE-CCVS.
021600S    EXIT PROGRAM.
021700STERMINATE-CALL.
021800     STOP     RUN.
021900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
022200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
022300     MOVE "****TEST DELETED****" TO RE-MARK.
022400 PRINT-DETAIL.
022500     IF REC-CT NOT EQUAL TO ZERO
022600             MOVE "." TO PARDOT-X
022700             MOVE REC-CT TO DOTVALUE.
022800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
022900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
023200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
023300     MOVE SPACE TO CORRECT-X.
023400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
023500     MOVE     SPACE TO RE-MARK.
023600 HEAD-ROUTINE.
023700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024100 COLUMN-NAMES-ROUTINE.
024200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
024500 END-ROUTINE.
024600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
024700 END-RTN-EXIT.
024800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024900 END-ROUTINE-1.
025000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
025200      ADD PASS-COUNTER TO ERROR-HOLD.
025300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
025400      MOVE PASS-COUNTER TO CCVS-E-4-1.
025500      MOVE ERROR-HOLD TO CCVS-E-4-2.
025600      MOVE CCVS-E-4 TO CCVS-E-2-2.
025700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
025800  END-ROUTINE-12.
025900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026000     IF       ERROR-COUNTER IS EQUAL TO ZERO
026100         MOVE "NO " TO ERROR-TOTAL
026200         ELSE
026300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
026400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
026500     PERFORM WRITE-LINE.
026600 END-ROUTINE-13.
026700     IF DELETE-COUNTER IS EQUAL TO ZERO
026800         MOVE "NO " TO ERROR-TOTAL  ELSE
026900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027200      IF   INSPECT-COUNTER EQUAL TO ZERO
027300          MOVE "NO " TO ERROR-TOTAL
027400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
027500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
027600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027800 WRITE-LINE.
027900     ADD 1 TO RECORD-COUNT.
028000Y    IF RECORD-COUNT GREATER 50
028100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
028200Y        MOVE SPACE TO DUMMY-RECORD
028300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
028400Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
028500Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
028600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
028700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
028800Y        MOVE ZERO TO RECORD-COUNT.
028900     PERFORM WRT-LN.
029000 WRT-LN.
029100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
029200     MOVE SPACE TO DUMMY-RECORD.
029300 BLANK-LINE-PRINT.
029400     PERFORM WRT-LN.
029500 FAIL-ROUTINE.
029600     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
030000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030100     MOVE   SPACES TO INF-ANSI-REFERENCE.
030200     GO TO  FAIL-ROUTINE-EX.
030300 FAIL-ROUTINE-WRITE.
030400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
030500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
030600     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
030700     MOVE   SPACES TO COR-ANSI-REFERENCE.
030800 FAIL-ROUTINE-EX. EXIT.
030900 BAIL-OUT.
031000     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
031100     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
031200 BAIL-OUT-WRITE.
031300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
031400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031600     MOVE   SPACES TO INF-ANSI-REFERENCE.
031700 BAIL-OUT-EX. EXIT.
031800 CCVS1-EXIT.
031900     EXIT.
032000 SECT-NC236A-001 SECTION.
032100 TH-09-001.
032200 SCH-INIT-F1-1.
032300     MOVE "SCH-TEST-F1-1" TO PAR-NAME.
032400     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
032500     MOVE "SEARCH " TO FEATURE.
032600     SET A TO 01.
032700     SET W TO A.
032800 SCH-TEST-F1-1.
032900     SEARCH TBL-A VARYING W AT END GO TO SCH-FAIL-F1-1
033000         WHEN ELMT-A (A) EQUAL TO  05
033100         SET A TO W.
033200     IF ELMT-A (A) EQUAL TO  05
033300         PERFORM PASS
033400         GO TO SCH-WRITE-F1-1.
033500 SCH-DELETE-F1-1.
033600     PERFORM DE-LETE.
033700     GO TO SCH-WRITE-F1-1.
033800 SCH-FAIL-F1-1.
033900     IF ELMT-A (05) EQUAL TO  05
034000         MOVE 05 TO CORRECT-18V0
034100         MOVE ELMT-A (05) TO COMPUTED-18V0
034200         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
034300     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
034400     MOVE ELMT-A (05) TO COMPUTED-18V0
034500     MOVE 05 TO CORRECT-18V0.
034600     PERFORM FAIL.
034700 SCH-WRITE-F1-1.
034800     PERFORM PRINT-DETAIL.
034900*
035000 SCH-INIT-F1-2.
035100     MOVE "SCH-TEST-F1-2" TO PAR-NAME.
035200     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
035300     MOVE "SEARCH " TO FEATURE.
035400     SET A TO 09.
035500     SET W TO A.
035600 SCH-TEST-F1-2.
035700     SEARCH TBL-A VARYING W AT END GO TO SCH-FAIL-F1-2
035800         WHEN ELMT-A (A) EQUAL TO  10
035900         SET A TO W.
036000     IF ELMT-A (A) EQUAL TO  10
036100         PERFORM PASS
036200         GO TO SCH-WRITE-F1-2.
036300 SCH-DELETE-F1-2.
036400     PERFORM DE-LETE.
036500     GO TO SCH-WRITE-F1-2.
036600 SCH-FAIL-F1-2.
036700     IF ELMT-A (10) EQUAL TO  10
036800         MOVE 10 TO CORRECT-18V0
036900         MOVE ELMT-A (10) TO COMPUTED-18V0
037000         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
037100     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
037200     MOVE ELMT-A (10) TO COMPUTED-18V0
037300     MOVE 10 TO CORRECT-18V0.
037400     PERFORM FAIL.
037500 SCH-WRITE-F1-2.
037600     PERFORM PRINT-DETAIL.
037700*
037800 SCH-INIT-F1-3.
037900     MOVE "SCH-TEST-F1-3" TO PAR-NAME.
038000     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
038100     MOVE "SEARCH " TO FEATURE.
038200     SET A TO 02.
038300     SET W TO A.
038400 SCH-TEST-F1-3.
038500     SEARCH TBL-A VARYING W AT END GO TO SCH-FAIL-F1-3
038600         WHEN ELMT-A (A) EQUAL TO  02
038700         SET A TO W.
038800     IF ELMT-A (A) EQUAL TO  02
038900         PERFORM PASS
039000         GO TO SCH-WRITE-F1-3.
039100 SCH-DELETE-F1-3.
039200     PERFORM DE-LETE.
039300     GO TO SCH-WRITE-F1-3.
039400 SCH-FAIL-F1-3.
039500     IF ELMT-A (02) EQUAL TO  02
039600         MOVE 02 TO CORRECT-18V0
039700         MOVE ELMT-A (02) TO COMPUTED-18V0
039800         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
039900     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
040000     MOVE ELMT-A (02) TO COMPUTED-18V0
040100     MOVE 02 TO CORRECT-18V0.
040200     PERFORM FAIL.
040300 SCH-WRITE-F1-3.
040400     PERFORM PRINT-DETAIL.
040500*
040600 SCH-INIT-F1-4.
040700     MOVE "SCH-TEST-F1-4" TO PAR-NAME.
040800     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
040900     MOVE "SEARCH " TO FEATURE.
041000     SET A TO 07.
041100     SET W TO A.
041200 SCH-TEST-F1-4.
041300     SEARCH TBL-A VARYING W AT END GO TO SCH-FAIL-F1-4
041400         WHEN ELMT-A (A) EQUAL TO  07
041500         SET A TO W.
041600     IF ELMT-A (A) EQUAL TO  07
041700         PERFORM PASS
041800         GO TO SCH-WRITE-F1-4.
041900 SCH-DELETE-F1-4.
042000     PERFORM DE-LETE.
042100     GO TO SCH-WRITE-F1-4.
042200 SCH-FAIL-F1-4.
042300     IF ELMT-A (07) EQUAL TO  07
042400         MOVE 07 TO CORRECT-18V0
042500         MOVE ELMT-A (07) TO COMPUTED-18V0
042600         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
042700     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
042800     MOVE ELMT-A (07) TO COMPUTED-18V0
042900     MOVE 07 TO CORRECT-18V0.
043000     PERFORM FAIL.
043100 SCH-WRITE-F1-4.
043200     PERFORM PRINT-DETAIL.
043300*
043400 SCH-INIT-F1-5.
043500     MOVE "SCH-TEST-F1-5" TO PAR-NAME.
043600     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
043700     MOVE "SEARCH " TO FEATURE.
043800     SET A TO 03.
043900     SET W TO A.
044000 SCH-TEST-F1-5.
044100     SEARCH TBL-A VARYING W AT END GO TO SCH-FAIL-F1-5
044200         WHEN ELMT-A (A) EQUAL TO 08
044300         SET A TO W.
044400     IF ELMT-A (A) EQUAL TO 08
044500         PERFORM PASS
044600         GO TO SCH-WRITE-F1-5.
044700 SCH-DELETE-F1-5.
044800     PERFORM DE-LETE.
044900     GO TO SCH-WRITE-F1-5.
045000 SCH-FAIL-F1-5.
045100     IF ELMT-A (08) EQUAL TO 08
045200         MOVE 08 TO CORRECT-18V0
045300         MOVE ELMT-A (08) TO COMPUTED-18V0
045400         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
045500     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
045600     MOVE ELMT-A (08) TO COMPUTED-18V0
045700     MOVE 08 TO CORRECT-18V0.
045800     PERFORM FAIL.
045900 SCH-WRITE-F1-5.
046000     PERFORM PRINT-DETAIL.
046100*
046200 SCH-INIT-F1-6.
046300     MOVE "SCH-TEST-F1-6" TO PAR-NAME.
046400     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
046500     MOVE "SEARCH " TO FEATURE.
046600     SET A B TO 01.
046700 SCH-TEST-F1-6.
046800     SEARCH TBL-B VARYING A AT END GO TO SCH-FAIL-F1-6
046900         WHEN ELMT-B (B) EQUAL TO ELMT-A (8)
047000             PERFORM PASS
047100             GO TO SCH-WRITE-F1-6.
047200 SCH-DELETE-F1-6.
047300     PERFORM DE-LETE.
047400     GO TO SCH-WRITE-F1-6.
047500 SCH-FAIL-F1-6.
047600     IF ELMT-B (8) EQUAL TO ELMT-A (8)
047700         MOVE 08 TO CORRECT-18V0 COMPUTED-18V0
047800         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
047900     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
048000     MOVE ELMT-B (8) TO COMPUTED-18V0
048100     MOVE ELMT-A (8) TO CORRECT-18V0.
048200     PERFORM FAIL.
048300 SCH-WRITE-F1-6.
048400     PERFORM PRINT-DETAIL.
048500*
048600 SCH-INIT-F1-7.
048700     MOVE "SCH-TEST-F1-7" TO PAR-NAME.
048800     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
048900     MOVE "SEARCH " TO FEATURE.
049000     SET A B TO 05.
049100 SCH-TEST-F1-7.
049200     SEARCH TBL-B VARYING A AT END GO TO SCH-FAIL-F1-7
049300         WHEN ELMT-B (B) EQUAL TO ELMT-A (10)
049400             PERFORM PASS
049500             GO TO SCH-WRITE-F1-7.
049600 SCH-DELETE-F1-7.
049700     PERFORM DE-LETE.
049800     GO TO SCH-WRITE-F1-6.
049900 SCH-FAIL-F1-7.
050000     IF ELMT-B (10) EQUAL TO ELMT-A (10)
050100         MOVE 10 TO CORRECT-18V0 COMPUTED-18V0
050200         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
050300     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
050400     MOVE ELMT-B (10) TO COMPUTED-18V0
050500     MOVE ELMT-A (10) TO CORRECT-18V0.
050600     PERFORM FAIL.
050700 SCH-WRITE-F1-7.
050800     PERFORM PRINT-DETAIL.
050900*
051000 SCH-INIT-F1-8.
051100     MOVE "SCH-TEST-F1-8" TO PAR-NAME.
051200     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
051300     MOVE "SEARCH " TO FEATURE.
051400     SET A B TO 09.
051500 SCH-TEST-F1-8.
051600     SEARCH TBL-B VARYING A AT END GO TO SCH-FAIL-F1-8
051700         WHEN ELMT-B (09) EQUAL TO ELMT-A (A)
051800             PERFORM PASS
051900             GO TO SCH-WRITE-F1-8.
052000 SCH-DELETE-F1-8.
052100     PERFORM DE-LETE.
052200     GO TO SCH-WRITE-F1-8.
052300 SCH-FAIL-F1-8.
052400     IF ELMT-B (09) EQUAL TO ELMT-A (09)
052500         MOVE 09 TO CORRECT-18V0 COMPUTED-18V0
052600         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
052700     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
052800     MOVE ELMT-B (09) TO COMPUTED-18V0
052900     MOVE ELMT-A (09) TO CORRECT-18V0.
053000     PERFORM FAIL.
053100 SCH-WRITE-F1-8.
053200     PERFORM PRINT-DETAIL.
053300*
053400 SCH-INIT-F1-9.
053500     MOVE "SCH-TEST-F1-9" TO PAR-NAME.
053600     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
053700     MOVE "SEARCH " TO FEATURE.
053800     SET A B TO 3.
053900 SCH-TEST-F1-9.
054000     SEARCH TBL-B VARYING A AT END GO TO SCH-FAIL-F1-9
054100         WHEN ELMT-B (B) EQUAL TO ELMT-A (A)
054200             PERFORM PASS
054300             GO TO SCH-WRITE-F1-9.
054400 SCH-DELETE-F1-9.
054500     PERFORM DE-LETE.
054600     GO TO SCH-WRITE-F1-9.
054700 SCH-FAIL-F1-9.
054800     IF ELMT-B (3) EQUAL TO ELMT-A (3)
054900         MOVE 03 TO CORRECT-18V0 COMPUTED-18V0
055000         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
055100     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
055200     MOVE ELMT-B (3) TO COMPUTED-18V0
055300     MOVE ELMT-A (3) TO CORRECT-18V0.
055400     PERFORM FAIL.
055500 SCH-WRITE-F1-9.
055600     PERFORM PRINT-DETAIL.
055700*
055800 SCH-INIT-F1-10.
055900     MOVE "SCH-TEST-F1-10" TO PAR-NAME.
056000     MOVE "VI-121 6.21.6" TO ANSI-REFERENCE.
056100     MOVE "SEARCH " TO FEATURE.
056200     SET A B TO 06.
056300 SCH-TEST-F1-10.
056400     SEARCH TBL-B VARYING A AT END GO TO SCH-FAIL-F1-10
056500         WHEN ELMT-B (9) EQUAL TO ELMT-A (9)
056600             PERFORM PASS
056700             GO TO SCH-WRITE-F1-10.
056800 SCH-DELETE-F1-10.
056900     PERFORM DE-LETE.
057000     GO TO SCH-WRITE-F1-10.
057100 SCH-FAIL-F1-10.
057200     IF ELMT-B (9) EQUAL TO ELMT-A (9)
057300         MOVE 09 TO CORRECT-18V0 COMPUTED-18V0
057400         MOVE "SEE NOTE 1 FOR DIAGNOSTIC" TO RE-MARK ELSE
057500     MOVE "SEE NOTE 2 FOR DIAGNOSTIC" TO RE-MARK
057600     MOVE ELMT-B (9) TO COMPUTED-18V0
057700     MOVE ELMT-A (9) TO CORRECT-18V0.
057800     PERFORM FAIL.
057900 SCH-WRITE-F1-10.
058000     PERFORM PRINT-DETAIL.
058100*
058200 CCVS-EXIT SECTION.
058300 CCVS-999999.
058400     GO TO CLOSE-FILES.
