000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC244A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM NCC244A TESTS THE CONSTRUCTION  AND ACCESS OF A   *
002300*    TWO-DIMENSIONAL TABLE WHICH HAS MULTIPLE INDICES.         *
002400*    RELATIVE INDEXING AND FORMATS 1 AND 2 OF THE "SET"        *
002500*    STATEMENT ARE USED.                                       *
002600*                                                              *
002700****************************************************************
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 77  SUB-COMP1    PICTURE S9     VALUE 3    COMPUTATIONAL.
004500 77  SUB-COMP2    PICTURE S9(10) VALUE 1    COMPUTATIONAL.
004600 77  SUB-COMP3    PICTURE S9(18) VALUE 49   COMPUTATIONAL.
004700 77  SUB-COMP4    PICTURE 9      VALUE 3    COMPUTATIONAL.
004800 77  SUB-COMP5    PICTURE 9(10)  VALUE 1    COMPUTATIONAL.
004900 77  SUB-COMP6    PICTURE 9(18)  VALUE 9    COMPUTATIONAL.
005000 77  SUB-7        PICTURE 99  VALUE 20.
005100 77  SUB-8        PICTURE 99 VALUE 01.
005200 77  SUB-9        PICTURE 99  VALUE 10.
005300 77  IN-SERT     PICTURE AA  VALUE "AA".
005400 77  ENTRY-HOLD  PICTURE XX  VALUE SPACES.
005500 01  IDX-HOLD.
005600     02  IDX-3HOLD PICTURE 9(6)  VALUE 0.
005700     02  FILLER    PICTURE X(8)  VALUE SPACES.
005800     02  IDX-14HOLD PICTURE 9(6) VALUE 0.
005900 01  TWO-DIMENSION-TABLE.
006000     02  GRP-ENTRY OCCURS 50 INDEXED IDX-1 IDX-2 IDX-3 IDX-4
006100         IDX-5.
006200         03  ENTRY-1  PICTURE 99.
006300         03  ELEM-ENTRY OCCURS 10 TIMES INDEXED BY IDX-6 IDX-7
006400             IDX-8 IDX-9 IDX-10 IDX-11 IDX-12 IDX-13 IDX-14
006500             IDX-15.
006600             04  ENTRY-2 PICTURE XX.
006700 01  TEST-RESULTS.
006800     02 FILLER                   PIC X      VALUE SPACE.
006900     02 FEATURE                  PIC X(20)  VALUE SPACE.
007000     02 FILLER                   PIC X      VALUE SPACE.
007100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
007200     02 FILLER                   PIC X      VALUE SPACE.
007300     02  PAR-NAME.
007400       03 FILLER                 PIC X(19)  VALUE SPACE.
007500       03  PARDOT-X              PIC X      VALUE SPACE.
007600       03 DOTVALUE               PIC 99     VALUE ZERO.
007700     02 FILLER                   PIC X(8)   VALUE SPACE.
007800     02 RE-MARK                  PIC X(61).
007900 01  TEST-COMPUTED.
008000     02 FILLER                   PIC X(30)  VALUE SPACE.
008100     02 FILLER                   PIC X(17)  VALUE
008200            "       COMPUTED=".
008300     02 COMPUTED-X.
008400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
008500     03 COMPUTED-N               REDEFINES COMPUTED-A
008600                                 PIC -9(9).9(9).
008700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
008800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
008900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
009000     03       CM-18V0 REDEFINES COMPUTED-A.
009100         04 COMPUTED-18V0                    PIC -9(18).
009200         04 FILLER                           PIC X.
009300     03 FILLER PIC X(50) VALUE SPACE.
009400 01  TEST-CORRECT.
009500     02 FILLER PIC X(30) VALUE SPACE.
009600     02 FILLER PIC X(17) VALUE "       CORRECT =".
009700     02 CORRECT-X.
009800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
009900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
010000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
010100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
010200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
010300     03      CR-18V0 REDEFINES CORRECT-A.
010400         04 CORRECT-18V0                     PIC -9(18).
010500         04 FILLER                           PIC X.
010600     03 FILLER PIC X(2) VALUE SPACE.
010700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
010800 01  CCVS-C-1.
010900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011000-    "SS  PARAGRAPH-NAME
011100-    "       REMARKS".
011200     02 FILLER                     PIC X(20)    VALUE SPACE.
011300 01  CCVS-C-2.
011400     02 FILLER                     PIC X        VALUE SPACE.
011500     02 FILLER                     PIC X(6)     VALUE "TESTED".
011600     02 FILLER                     PIC X(15)    VALUE SPACE.
011700     02 FILLER                     PIC X(4)     VALUE "FAIL".
011800     02 FILLER                     PIC X(94)    VALUE SPACE.
011900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012000 01  REC-CT                        PIC 99       VALUE ZERO.
012100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
012500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
012600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
012700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
012800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
012900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013000 01  CCVS-H-1.
013100     02  FILLER                    PIC X(39)    VALUE SPACES.
013200     02  FILLER                    PIC X(42)    VALUE
013300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013400     02  FILLER                    PIC X(39)    VALUE SPACES.
013500 01  CCVS-H-2A.
013600   02  FILLER                        PIC X(40)  VALUE SPACE.
013700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
013800   02  FILLER                        PIC XXXX   VALUE
013900     "4.2 ".
014000   02  FILLER                        PIC X(28)  VALUE
014100            " COPY - NOT FOR DISTRIBUTION".
014200   02  FILLER                        PIC X(41)  VALUE SPACE.
014300
014400 01  CCVS-H-2B.
014500   02  FILLER                        PIC X(15)  VALUE
014600            "TEST RESULT OF ".
014700   02  TEST-ID                       PIC X(9).
014800   02  FILLER                        PIC X(4)   VALUE
014900            " IN ".
015000   02  FILLER                        PIC X(12)  VALUE
015100     " HIGH       ".
015200   02  FILLER                        PIC X(22)  VALUE
015300            " LEVEL VALIDATION FOR ".
015400   02  FILLER                        PIC X(58)  VALUE
015500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015600 01  CCVS-H-3.
015700     02  FILLER                      PIC X(34)  VALUE
015800            " FOR OFFICIAL USE ONLY    ".
015900     02  FILLER                      PIC X(58)  VALUE
016000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016100     02  FILLER                      PIC X(28)  VALUE
016200            "  COPYRIGHT   1985 ".
016300 01  CCVS-E-1.
016400     02 FILLER                       PIC X(52)  VALUE SPACE.
016500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
016600     02 ID-AGAIN                     PIC X(9).
016700     02 FILLER                       PIC X(45)  VALUE SPACES.
016800 01  CCVS-E-2.
016900     02  FILLER                      PIC X(31)  VALUE SPACE.
017000     02  FILLER                      PIC X(21)  VALUE SPACE.
017100     02 CCVS-E-2-2.
017200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017300         03 FILLER                   PIC X      VALUE SPACE.
017400         03 ENDER-DESC               PIC X(44)  VALUE
017500            "ERRORS ENCOUNTERED".
017600 01  CCVS-E-3.
017700     02  FILLER                      PIC X(22)  VALUE
017800            " FOR OFFICIAL USE ONLY".
017900     02  FILLER                      PIC X(12)  VALUE SPACE.
018000     02  FILLER                      PIC X(58)  VALUE
018100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018200     02  FILLER                      PIC X(13)  VALUE SPACE.
018300     02 FILLER                       PIC X(15)  VALUE
018400             " COPYRIGHT 1985".
018500 01  CCVS-E-4.
018600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
018700     02 FILLER                       PIC X(4)   VALUE " OF ".
018800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
018900     02 FILLER                       PIC X(40)  VALUE
019000      "  TESTS WERE EXECUTED SUCCESSFULLY".
019100 01  XXINFO.
019200     02 FILLER                       PIC X(19)  VALUE
019300            "*** INFORMATION ***".
019400     02 INFO-TEXT.
019500       04 FILLER                     PIC X(8)   VALUE SPACE.
019600       04 XXCOMPUTED                 PIC X(20).
019700       04 FILLER                     PIC X(5)   VALUE SPACE.
019800       04 XXCORRECT                  PIC X(20).
019900     02 INF-ANSI-REFERENCE           PIC X(48).
020000 01  HYPHEN-LINE.
020100     02 FILLER  PIC IS X VALUE IS SPACE.
020200     02 FILLER  PIC IS X(65)    VALUE IS "************************
020300-    "*****************************************".
020400     02 FILLER  PIC IS X(54)    VALUE IS "************************
020500-    "******************************".
020600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
020700     "NC244A".
020800 PROCEDURE DIVISION.
020900 CCVS1 SECTION.
021000 OPEN-FILES.
021100     OPEN     OUTPUT PRINT-FILE.
021200     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021300     MOVE    SPACE TO TEST-RESULTS.
021400     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
021500     GO TO CCVS1-EXIT.
021600 CLOSE-FILES.
021700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
021800 TERMINATE-CCVS.
021900S    EXIT PROGRAM.
022000STERMINATE-CALL.
022100     STOP     RUN.
022200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
022500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
022600     MOVE "****TEST DELETED****" TO RE-MARK.
022700 PRINT-DETAIL.
022800     IF REC-CT NOT EQUAL TO ZERO
022900             MOVE "." TO PARDOT-X
023000             MOVE REC-CT TO DOTVALUE.
023100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
023500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
023600     MOVE SPACE TO CORRECT-X.
023700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
023800     MOVE     SPACE TO RE-MARK.
023900 HEAD-ROUTINE.
024000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024400 COLUMN-NAMES-ROUTINE.
024500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
024800 END-ROUTINE.
024900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025000 END-RTN-EXIT.
025100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025200 END-ROUTINE-1.
025300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
025500      ADD PASS-COUNTER TO ERROR-HOLD.
025600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
025700      MOVE PASS-COUNTER TO CCVS-E-4-1.
025800      MOVE ERROR-HOLD TO CCVS-E-4-2.
025900      MOVE CCVS-E-4 TO CCVS-E-2-2.
026000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026100  END-ROUTINE-12.
026200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026300     IF       ERROR-COUNTER IS EQUAL TO ZERO
026400         MOVE "NO " TO ERROR-TOTAL
026500         ELSE
026600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
026700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
026800     PERFORM WRITE-LINE.
026900 END-ROUTINE-13.
027000     IF DELETE-COUNTER IS EQUAL TO ZERO
027100         MOVE "NO " TO ERROR-TOTAL  ELSE
027200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027500      IF   INSPECT-COUNTER EQUAL TO ZERO
027600          MOVE "NO " TO ERROR-TOTAL
027700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
027800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
027900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028100 WRITE-LINE.
028200     ADD 1 TO RECORD-COUNT.
028300Y    IF RECORD-COUNT GREATER 50
028400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
028500Y        MOVE SPACE TO DUMMY-RECORD
028600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
028700Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
028800Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
028900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029100Y        MOVE ZERO TO RECORD-COUNT.
029200     PERFORM WRT-LN.
029300 WRT-LN.
029400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
029500     MOVE SPACE TO DUMMY-RECORD.
029600 BLANK-LINE-PRINT.
029700     PERFORM WRT-LN.
029800 FAIL-ROUTINE.
029900     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
030300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030400     MOVE   SPACES TO INF-ANSI-REFERENCE.
030500     GO TO  FAIL-ROUTINE-EX.
030600 FAIL-ROUTINE-WRITE.
030700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
030800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
030900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
031000     MOVE   SPACES TO COR-ANSI-REFERENCE.
031100 FAIL-ROUTINE-EX. EXIT.
031200 BAIL-OUT.
031300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
031400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
031500 BAIL-OUT-WRITE.
031600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
031700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
031800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031900     MOVE   SPACES TO INF-ANSI-REFERENCE.
032000 BAIL-OUT-EX. EXIT.
032100 CCVS1-EXIT.
032200     EXIT.
032300 SECT-NC244A-001 SECTION.
032400 TH-18-001.
032500 BUILD-2DEM-TABLE.
032600     SET IDX-1  IDX-2  IDX-3  IDX-4  IDX-5  IDX-6  IDX-7  IDX-8
032700         IDX-9  IDX-10 TO 01.
032800     SET IDX-11  IDX-12  IDX-13  IDX-14  IDX-15 TO 01.
032900 BUILD-LEVEL-1.
033000     SET ENTRY-1 (IDX-5) TO IDX-5.
033100     IF IDX-5 EQUAL TO 6 MOVE "BB" TO IN-SERT GO TO BUILD-ENTRY.
033200     IF IDX-5 EQUAL TO 11 MOVE "CC" TO IN-SERT GO TO BUILD-ENTRY.
033300     IF IDX-5 EQUAL TO 16 MOVE "DD" TO IN-SERT GO TO BUILD-ENTRY.
033400     IF IDX-5 EQUAL TO 21 MOVE "EE" TO IN-SERT GO TO BUILD-ENTRY.
033500     IF IDX-5 EQUAL TO 26 MOVE "FF" TO IN-SERT GO TO BUILD-ENTRY.
033600     IF IDX-5 EQUAL TO 31 MOVE "GG" TO IN-SERT GO TO BUILD-ENTRY.
033700     IF IDX-5 EQUAL TO 36 MOVE "HH" TO IN-SERT GO TO BUILD-ENTRY.
033800     IF IDX-5 EQUAL TO 41 MOVE "II" TO IN-SERT GO TO BUILD-ENTRY.
033900     IF IDX-5 EQUAL TO 46 MOVE "JJ" TO IN-SERT.
034000 BUILD-ENTRY.
034100     MOVE IN-SERT TO ENTRY-2 (IDX-5, IDX-15).
034200     IF IDX-15 EQUAL TO 10 AND IDX-5 EQUAL TO 50
034300         GO TO BUILD-EXIT.
034400     IF IDX-15 EQUAL TO 10
034500         SET IDX-15 TO 01
034600         SET IDX-5 UP BY 1
034700         GO TO BUILD-LEVEL-1.
034800     SET IDX-15 UP BY 01.
034900     GO TO BUILD-ENTRY.
035000 BUILD-EXIT.
035100     EXIT.
035200 TABLE-CHECKING SECTION.
035300*
035400 IDX-INIT-F1-1.
035500     MOVE "IDX-TEST-F1-1" TO PAR-NAME.
035600     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
035700     MOVE "RELATIVE INDEXING   " TO FEATURE.
035800 IDX-TEST-F1-1.
035900     SET IDX-4  IDX-14 TO SUB-COMP2.
036000     IF ENTRY-2 (IDX-4 + 49, IDX-14 + 9) EQUAL TO "JJ"
036100         PERFORM PASS
036200         GO TO IDX-WRITE-F1-1
036300     ELSE
036400         GO TO IDX-FAIL-F1-1.
036500 IDX-DELETE-F1-1.
036600     PERFORM DE-LETE.
036700     GO TO IDX-WRITE-F1-1.
036800 IDX-FAIL-F1-1.
036900     MOVE ENTRY-2 (IDX-4 + 49, IDX-14 + 9) TO COMPUTED-A.
037000     MOVE "JJ" TO CORRECT-A.
037100     PERFORM FAIL.
037200 IDX-WRITE-F1-1.
037300     PERFORM PRINT-DETAIL.
037400*
037500 IDX-INIT-F2-2.
037600     MOVE "IDX-TEST-F2-2" TO PAR-NAME.
037700     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
037800     MOVE "SET DN BY COMP ITEM " TO FEATURE.
037900 IDX-TEST-F2-2.
038000     SET IDX-3 TO SUB-COMP3.
038100     SET IDX-3 DOWN BY SUB-7.
038200     IF ENTRY-1 (IDX-3) EQUAL TO 29
038300         PERFORM PASS
038400         GO TO IDX-WRITE-F2-2
038500     ELSE
038600         GO TO IDX-FAIL-F2-2.
038700 IDX-DELETE-F2-2.
038800     PERFORM DE-LETE.
038900     GO TO IDX-WRITE-F2-2.
039000 IDX-FAIL-F2-2.
039100     MOVE ENTRY-1 (IDX-3) TO COMPUTED-N.
039200     MOVE 29 TO CORRECT-N.
039300     PERFORM FAIL.
039400 IDX-WRITE-F2-2.
039500     PERFORM PRINT-DETAIL.
039600*
039700 IDX-INIT-F2-3.
039800     MOVE "IDX-TEST-F2-3" TO PAR-NAME.
039900     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
040000     MOVE "SET UP BY COMP ITEM " TO FEATURE.
040100 IDX-TEST-F2-3.
040200     SET IDX-2 TO SUB-COMP6.
040300     SET IDX-2 UP BY SUB-COMP1.
040400     IF ENTRY-1 (IDX-2) EQUAL TO 12
040500         PERFORM PASS
040600         GO TO IDX-WRITE-F2-3
040700     ELSE
040800         GO TO IDX-FAIL-F2-3.
040900 IDX-DELETE-F2-3.
041000     PERFORM DE-LETE.
041100     GO TO IDX-WRITE-F2-3.
041200 IDX-FAIL-F2-3.
041300     MOVE ENTRY-1 (IDX-2) TO COMPUTED-N.
041400     MOVE 12 TO CORRECT-N.
041500     PERFORM FAIL.
041600 IDX-WRITE-F2-3.
041700     PERFORM PRINT-DETAIL.
041800*
041900 IDX-INIT-F2-4.
042000     MOVE "IDX-TEST-F2-4" TO PAR-NAME.
042100     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
042200     MOVE "MULT OPERND SET STMT" TO FEATURE.
042300     GO TO IDX-TEST-F2-4.
042400 TEST-4.
042500     SET IDX-1  IDX-6 DOWN BY SUB-COMP5.
042600     MOVE ENTRY-2 (IDX-1, IDX-6) TO ENTRY-HOLD.
042700 TEST-4EXIT.
042800     EXIT.
042900 IDX-TEST-F2-4.
043000     SET IDX-1 TO SUB-COMP3.
043100     SET IDX-6 TO SUB-9.
043200     PERFORM TEST-4 THRU TEST-4EXIT UNTIL
043300                ENTRY-2 (IDX-1, IDX-6) EQUAL TO "II".
043400     IF ENTRY-HOLD EQUAL TO "II"
043500         PERFORM PASS
043600         GO TO IDX-WRITE-F2-4
043700     ELSE
043800         GO TO IDX-FAIL-F2-4.
043900 IDX-DELETE-F2-4.
044000     PERFORM DE-LETE.
044100     GO TO IDX-WRITE-F2-4.
044200 IDX-FAIL-F2-4.
044300     MOVE ENTRY-HOLD TO COMPUTED-A.
044400     MOVE "II" TO CORRECT-A.
044500 IDX-WRITE-F2-4.
044600     PERFORM PRINT-DETAIL.
044700*
044800 IDX-INIT-F2-5.
044900     MOVE "IDX-TEST-F2-5" TO PAR-NAME.
045000     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
045100     MOVE "PFM VARYNG COMP ITEM" TO FEATURE.
045200     MOVE SPACES TO ENTRY-HOLD.
045300     GO TO IDX-TEST-F2-5.
045400 TEST-5.
045500     SET IDX-3 TO SUB-COMP2.
045600     SET IDX-14 TO SUB-COMP5.
045700     MOVE ENTRY-2 (IDX-3, IDX-14) TO ENTRY-HOLD.
045800 IDX-TEST-F2-5.
045900     SET IDX-3, IDX-14 TO 01.
046000     PERFORM TEST-5
046100             VARYING SUB-COMP5 FROM 1 BY SUB-8
046200             UNTIL ENTRY-2 (IDX-3, IDX-14) EQUAL TO "JJ"
046300                OR IDX-14 EQUAL TO 10
046400             AFTER SUB-COMP2 FROM 1 BY 1
046500             UNTIL ENTRY-1 (IDX-3) EQUAL TO 46.
046600     IF ENTRY-HOLD EQUAL TO "JJ"
046700         PERFORM PASS
046800         GO TO IDX-WRITE-F2-5
046900     ELSE
047000         GO TO IDX-FAIL-F2-5.
047100 IDX-DELETE-F2-5.
047200     PERFORM DE-LETE.
047300     MOVE "IDX-TEST-F2-5" TO PAR-NAME.
047400     MOVE  "PFM VARYING COMP ITEM" TO FEATURE.
047500     PERFORM PRINT-DETAIL.
047600*    NOTE IF THIS TEST IS DELETED TEST-6 WILL ALSO BE DELETED.
047700     PERFORM DE-LETE.
047800     MOVE "IDX-TEST-F2-6" TO PAR-NAME.
047900     PERFORM PRINT-DETAIL.
048000     GO TO CLOSE-FILES.
048100 IDX-FAIL-F2-5.
048200     MOVE "JJ" TO CORRECT-A.
048300     MOVE ENTRY-HOLD TO COMPUTED-A.
048400     PERFORM FAIL.
048500 IDX-WRITE-F2-5.
048600     PERFORM PRINT-DETAIL.
048700*
048800 IDX-INIT-F2-6.
048900     MOVE "IDX-TEST-F2-6" TO PAR-NAME.
049000     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
049100 IDX-TEST-F2-6.
049200     IF IDX-3 EQUAL TO 46 AND IDX-14 EQUAL TO 01
049300         PERFORM PASS
049400         GO TO IDX-WRITE-F2-6
049500     ELSE
049600         GO TO IDX-FAIL-F2-6.
049700 IDX-DELETE-F2-6.
049800     PERFORM DE-LETE.
049900     GO TO IDX-WRITE-F2-6.
050000 IDX-FAIL-F2-6.
050100     SET IDX-3HOLD TO IDX-3.
050200     SET IDX-14HOLD TO IDX-14.
050300     MOVE IDX-HOLD TO COMPUTED-A.
050400     PERFORM FAIL.
050500     MOVE "000046        000001" TO CORRECT-A.
050600     MOVE "COMPARE INDEXES OF TEST-5" TO RE-MARK.
050700 IDX-WRITE-F2-6.
050800     PERFORM PRINT-DETAIL.
050900 CCVS-EXIT SECTION.
051000 CCVS-999999.
051100     GO TO CLOSE-FILES.
