000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC247A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*
002300*    PROGRAM NC247A TESTS FORMAT2 OF THE "OCCURS" CLAUSE TO    *
002400*    VERIFY THAT THE NUMBER OF TABLE OCCURRENCES CARIES        *
002500*    ACCORDING TO THE CURRENT VALUE OF THE IDENTIDIER ON WHICH *
002600*    IT DEPENDS.                                               *
002700*                                                              *
002800****************************************************************
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.
003200     XXXXX082.
003300 OBJECT-COMPUTER.
003400     XXXXX083.
003500 INPUT-OUTPUT SECTION.
003600 FILE-CONTROL.
003700     SELECT PRINT-FILE ASSIGN TO
003800     XXXXX055.
003900 DATA DIVISION.
004000 FILE SECTION.
004100 FD  PRINT-FILE.
004200 01  PRINT-REC PICTURE X(120).
004300 01  DUMMY-RECORD PICTURE X(120).
004400 WORKING-STORAGE SECTION.
004500 01  ODO-RECORD.
004600     02  FILLER PIC X(120).
004700     02  GRP-ODO.
004800         03  DOI-DU-01V00 PIC 9.
004900         03  ODO-XN-00009 PIC X(9).
005000         03  ODO-GRP-00009.
005100         04  ODO-XN-00001-O009D OCCURS 0 TO 9 TIMES DEPENDING ON
005200                 DOI-DU-01V00 ASCENDING KEY ODO-XN-00001-O009D
005300                 INDEXED BY ODO-IX PIC X.
005400 01  NEW-RECORD.
005500     02  FILLER PIC X(120).
005600     02  NEW-ODO.
005700         03  NEW-DU-01V00 PIC 9.
005800         03  NEW-XN-00009 PIC X(9).
005900         03  NEW-GRP-00009.
006000         04  NEW-XN-00001-O009D OCCURS 0 TO 9 TIMES DEPENDING ON
006100                 NEW-DU-01V00 ASCENDING KEY NEW-XN-00001-O009D
006200                 INDEXED BY NEW-IX PIC X.
006300 01  STATIC-VALUE.
006400     02  FILLER PIC 9 VALUE 9.
006500     02  FILLER PIC X(18) VALUE " ACTIVE: 123456789".
006600 01  WRK-GRP-00019.
006700     02  WRK-DU-01V00 PIC 9.
006800     02  WRK-XN-00009-1 PIC X(9).
006900     02  WRK-XN-00009-2 PIC X(9).
007000 01  WRK-DU-05V00 PIC 9(5).
007100 01  WRK-XN-00020 PIC X(20).
007200 01  WRK-XN-00010 PIC X(10).
007300 01  WRK-XN-00001 PIC X.
007400 01  TEST-RESULTS.
007500     02 FILLER                   PIC X      VALUE SPACE.
007600     02 FEATURE                  PIC X(20)  VALUE SPACE.
007700     02 FILLER                   PIC X      VALUE SPACE.
007800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
007900     02 FILLER                   PIC X      VALUE SPACE.
008000     02  PAR-NAME.
008100       03 FILLER                 PIC X(19)  VALUE SPACE.
008200       03  PARDOT-X              PIC X      VALUE SPACE.
008300       03 DOTVALUE               PIC 99     VALUE ZERO.
008400     02 FILLER                   PIC X(8)   VALUE SPACE.
008500     02 RE-MARK                  PIC X(61).
008600 01  TEST-COMPUTED.
008700     02 FILLER                   PIC X(30)  VALUE SPACE.
008800     02 FILLER                   PIC X(17)  VALUE
008900            "       COMPUTED=".
009000     02 COMPUTED-X.
009100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009200     03 COMPUTED-N               REDEFINES COMPUTED-A
009300                                 PIC -9(9).9(9).
009400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
009500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
009600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
009700     03       CM-18V0 REDEFINES COMPUTED-A.
009800         04 COMPUTED-18V0                    PIC -9(18).
009900         04 FILLER                           PIC X.
010000     03 FILLER PIC X(50) VALUE SPACE.
010100 01  TEST-CORRECT.
010200     02 FILLER PIC X(30) VALUE SPACE.
010300     02 FILLER PIC X(17) VALUE "       CORRECT =".
010400     02 CORRECT-X.
010500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
010600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
010700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
010800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
010900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
011000     03      CR-18V0 REDEFINES CORRECT-A.
011100         04 CORRECT-18V0                     PIC -9(18).
011200         04 FILLER                           PIC X.
011300     03 FILLER PIC X(2) VALUE SPACE.
011400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011500 01  CCVS-C-1.
011600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011700-    "SS  PARAGRAPH-NAME
011800-    "       REMARKS".
011900     02 FILLER                     PIC X(20)    VALUE SPACE.
012000 01  CCVS-C-2.
012100     02 FILLER                     PIC X        VALUE SPACE.
012200     02 FILLER                     PIC X(6)     VALUE "TESTED".
012300     02 FILLER                     PIC X(15)    VALUE SPACE.
012400     02 FILLER                     PIC X(4)     VALUE "FAIL".
012500     02 FILLER                     PIC X(94)    VALUE SPACE.
012600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012700 01  REC-CT                        PIC 99       VALUE ZERO.
012800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
013000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
013100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013700 01  CCVS-H-1.
013800     02  FILLER                    PIC X(39)    VALUE SPACES.
013900     02  FILLER                    PIC X(42)    VALUE
014000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
014100     02  FILLER                    PIC X(39)    VALUE SPACES.
014200 01  CCVS-H-2A.
014300   02  FILLER                        PIC X(40)  VALUE SPACE.
014400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014500   02  FILLER                        PIC XXXX   VALUE
014600     "4.2 ".
014700   02  FILLER                        PIC X(28)  VALUE
014800            " COPY - NOT FOR DISTRIBUTION".
014900   02  FILLER                        PIC X(41)  VALUE SPACE.
015000
015100 01  CCVS-H-2B.
015200   02  FILLER                        PIC X(15)  VALUE
015300            "TEST RESULT OF ".
015400   02  TEST-ID                       PIC X(9).
015500   02  FILLER                        PIC X(4)   VALUE
015600            " IN ".
015700   02  FILLER                        PIC X(12)  VALUE
015800     " HIGH       ".
015900   02  FILLER                        PIC X(22)  VALUE
016000            " LEVEL VALIDATION FOR ".
016100   02  FILLER                        PIC X(58)  VALUE
016200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016300 01  CCVS-H-3.
016400     02  FILLER                      PIC X(34)  VALUE
016500            " FOR OFFICIAL USE ONLY    ".
016600     02  FILLER                      PIC X(58)  VALUE
016700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016800     02  FILLER                      PIC X(28)  VALUE
016900            "  COPYRIGHT   1985 ".
017000 01  CCVS-E-1.
017100     02 FILLER                       PIC X(52)  VALUE SPACE.
017200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017300     02 ID-AGAIN                     PIC X(9).
017400     02 FILLER                       PIC X(45)  VALUE SPACES.
017500 01  CCVS-E-2.
017600     02  FILLER                      PIC X(31)  VALUE SPACE.
017700     02  FILLER                      PIC X(21)  VALUE SPACE.
017800     02 CCVS-E-2-2.
017900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
018000         03 FILLER                   PIC X      VALUE SPACE.
018100         03 ENDER-DESC               PIC X(44)  VALUE
018200            "ERRORS ENCOUNTERED".
018300 01  CCVS-E-3.
018400     02  FILLER                      PIC X(22)  VALUE
018500            " FOR OFFICIAL USE ONLY".
018600     02  FILLER                      PIC X(12)  VALUE SPACE.
018700     02  FILLER                      PIC X(58)  VALUE
018800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018900     02  FILLER                      PIC X(13)  VALUE SPACE.
019000     02 FILLER                       PIC X(15)  VALUE
019100             " COPYRIGHT 1985".
019200 01  CCVS-E-4.
019300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019400     02 FILLER                       PIC X(4)   VALUE " OF ".
019500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019600     02 FILLER                       PIC X(40)  VALUE
019700      "  TESTS WERE EXECUTED SUCCESSFULLY".
019800 01  XXINFO.
019900     02 FILLER                       PIC X(19)  VALUE
020000            "*** INFORMATION ***".
020100     02 INFO-TEXT.
020200       04 FILLER                     PIC X(8)   VALUE SPACE.
020300       04 XXCOMPUTED                 PIC X(20).
020400       04 FILLER                     PIC X(5)   VALUE SPACE.
020500       04 XXCORRECT                  PIC X(20).
020600     02 INF-ANSI-REFERENCE           PIC X(48).
020700 01  HYPHEN-LINE.
020800     02 FILLER  PIC IS X VALUE IS SPACE.
020900     02 FILLER  PIC IS X(65)    VALUE IS "************************
021000-    "*****************************************".
021100     02 FILLER  PIC IS X(54)    VALUE IS "************************
021200-    "******************************".
021300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021400     "NC247A".
021500 PROCEDURE DIVISION.
021600 CCVS1 SECTION.
021700 OPEN-FILES.
021800     OPEN     OUTPUT PRINT-FILE.
021900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022000     MOVE    SPACE TO TEST-RESULTS.
022100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022200     GO TO CCVS1-EXIT.
022300 CLOSE-FILES.
022400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022500 TERMINATE-CCVS.
022600S    EXIT PROGRAM.
022700STERMINATE-CALL.
022800     STOP     RUN.
022900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
023000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
023100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023300     MOVE "****TEST DELETED****" TO RE-MARK.
023400 PRINT-DETAIL.
023500     IF REC-CT NOT EQUAL TO ZERO
023600             MOVE "." TO PARDOT-X
023700             MOVE REC-CT TO DOTVALUE.
023800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
024000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
024100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024300     MOVE SPACE TO CORRECT-X.
024400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024500     MOVE     SPACE TO RE-MARK.
024600 HEAD-ROUTINE.
024700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
025100 COLUMN-NAMES-ROUTINE.
025200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025500 END-ROUTINE.
025600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025700 END-RTN-EXIT.
025800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025900 END-ROUTINE-1.
026000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
026100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026200      ADD PASS-COUNTER TO ERROR-HOLD.
026300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
026400      MOVE PASS-COUNTER TO CCVS-E-4-1.
026500      MOVE ERROR-HOLD TO CCVS-E-4-2.
026600      MOVE CCVS-E-4 TO CCVS-E-2-2.
026700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026800  END-ROUTINE-12.
026900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
027000     IF       ERROR-COUNTER IS EQUAL TO ZERO
027100         MOVE "NO " TO ERROR-TOTAL
027200         ELSE
027300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027500     PERFORM WRITE-LINE.
027600 END-ROUTINE-13.
027700     IF DELETE-COUNTER IS EQUAL TO ZERO
027800         MOVE "NO " TO ERROR-TOTAL  ELSE
027900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
028000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
028100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028200      IF   INSPECT-COUNTER EQUAL TO ZERO
028300          MOVE "NO " TO ERROR-TOTAL
028400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028800 WRITE-LINE.
028900     ADD 1 TO RECORD-COUNT.
029000Y    IF RECORD-COUNT GREATER 50
029100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029200Y        MOVE SPACE TO DUMMY-RECORD
029300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029400Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
029500Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
029600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029800Y        MOVE ZERO TO RECORD-COUNT.
029900     PERFORM WRT-LN.
030000 WRT-LN.
030100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030200     MOVE SPACE TO DUMMY-RECORD.
030300 BLANK-LINE-PRINT.
030400     PERFORM WRT-LN.
030500 FAIL-ROUTINE.
030600     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
031000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031100     MOVE   SPACES TO INF-ANSI-REFERENCE.
031200     GO TO  FAIL-ROUTINE-EX.
031300 FAIL-ROUTINE-WRITE.
031400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
031500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
031600     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
031700     MOVE   SPACES TO COR-ANSI-REFERENCE.
031800 FAIL-ROUTINE-EX. EXIT.
031900 BAIL-OUT.
032000     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
032100     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032200 BAIL-OUT-WRITE.
032300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
032400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032600     MOVE   SPACES TO INF-ANSI-REFERENCE.
032700 BAIL-OUT-EX. EXIT.
032800 CCVS1-EXIT.
032900     EXIT.
033000 SECT-NC247A-001 SECTION.
033100 INIT-WRK-AREA.
033200     MOVE STATIC-VALUE TO WRK-GRP-00019.
033300     MOVE 9 TO DOI-DU-01V00.
033400     MOVE " ACTIVE: " TO ODO-XN-00009.
033500     MOVE "1" TO ODO-XN-00001-O009D (1).
033600     MOVE "2" TO ODO-XN-00001-O009D (2).
033700     MOVE "3" TO ODO-XN-00001-O009D (3).
033800     MOVE "4" TO ODO-XN-00001-O009D (4).
033900     MOVE "5" TO ODO-XN-00001-O009D (5).
034000     MOVE "6" TO ODO-XN-00001-O009D (6).
034100     MOVE "7" TO ODO-XN-00001-O009D (7).
034200     MOVE "8" TO ODO-XN-00001-O009D (8).
034300     MOVE "9" TO ODO-XN-00001-O009D (9).
034400*
034500 IF-INIT-GF-1.
034600     MOVE "IF-TEST-GF-1" TO PAR-NAME.
034700     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
034800     MOVE "OCCURS DEPENDING ON" TO FEATURE.
034900     MOVE STATIC-VALUE TO RE-MARK.
035000 IF-TEST-GF-1.
035100     IF STATIC-VALUE IS EQUAL TO GRP-ODO
035200         PERFORM PASS
035300         GO TO IF-WRITE-GF-1
035400     ELSE
035500         GO TO IF-FAIL-GF-1.
035600 IF-DELETE-GF-1.
035700     PERFORM DE-LETE.
035800     GO TO IF-WRITE-GF-1.
035900 IF-FAIL-GF-1.
036000     PERFORM FAIL
036100     MOVE "CONDITION WAS EQUAL" TO CORRECT-A
036200     MOVE "CONDITION NOT EQUAL" TO COMPUTED-A.
036300 IF-WRITE-GF-1.
036400     PERFORM PRINT-DETAIL.
036500*
036600 IF-INIT-GF-2.
036700     MOVE WRK-GRP-00019 TO RE-MARK.
036800     MOVE "IF-TEST-GF-2" TO PAR-NAME.
036900     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
037000     PERFORM INIT-WRK-AREA.
037100     MOVE 3 TO WRK-DU-01V00  DOI-DU-01V00
037200     MOVE "123      " TO WRK-XN-00009-2.
037300 IF-TEST-GF-2.
037400     IF GRP-ODO IS EQUAL TO WRK-GRP-00019
037500         PERFORM PASS
037600         GO TO IF-WRITE-GF-2
037700     ELSE
037800         GO TO IF-FAIL-GF-2.
037900 IF-DELETE-GF-2.
038000     PERFORM DE-LETE.
038100     GO TO IF-WRITE-GF-2.
038200 IF-FAIL-GF-2.
038300     PERFORM FAIL
038400     MOVE "CONDITION WAS EQUAL" TO CORRECT-A
038500     MOVE "CONDITION NOT EQUAL" TO COMPUTED-A.
038600 IF-WRITE-GF-2.
038700     PERFORM PRINT-DETAIL.
038800*
038900 INS-INIT-F1-1.
039000     MOVE "INS-TEST-F1-1" TO PAR-NAME.
039100     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
039200     MOVE STATIC-VALUE TO RE-MARK.
039300     PERFORM INIT-WRK-AREA.
039400     MOVE 0 TO WRK-DU-05V00.
039500 INS-TEST-F1-1.
039600     INSPECT ODO-GRP-00009 TALLYING WRK-DU-05V00 FOR ALL "7".
039700     IF WRK-DU-05V00 IS EQUAL TO 1
039800         PERFORM PASS
039900         GO TO INS-WRITE-F1-1
040000     ELSE
040100         GO TO INS-FAIL-F1-1.
040200 INS-DELETE-F1-1.
040300     PERFORM DE-LETE.
040400     GO TO INS-WRITE-F1-1.
040500 INS-FAIL-F1-1.
040600     PERFORM FAIL
040700     MOVE 1 TO  CORRECT-18V0
040800     MOVE WRK-DU-05V00 TO COMPUTED-18V0.
040900 INS-WRITE-F1-1.
041000     PERFORM PRINT-DETAIL.
041100*
041200 INS-INIT-F1-2.
041300     MOVE "INS-TEST-F1-2" TO PAR-NAME.
041400     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
041500     PERFORM INIT-WRK-AREA.
041600     MOVE 3 TO DOI-DU-01V00  WRK-DU-01V00 WRK-DU-05V00.
041700     MOVE "123      " TO WRK-XN-00009-2.
041800     MOVE 0 TO WRK-DU-05V00.
041900     MOVE WRK-GRP-00019 TO RE-MARK.
042000 INS-TEST-F1-2.
042100     INSPECT ODO-GRP-00009 TALLYING WRK-DU-05V00 FOR ALL "7".
042200     IF WRK-DU-05V00 IS EQUAL TO 0
042300         PERFORM PASS
042400         GO TO INS-WRITE-F1-2
042500     ELSE
042600         GO TO INS-FAIL-F1-2.
042700 INS-DELETE-F1-2.
042800     PERFORM DE-LETE.
042900     GO TO INS-WRITE-F1-2.
043000 INS-FAIL-F1-2.
043100     PERFORM FAIL
043200     MOVE 0 TO CORRECT-18V0
043300     MOVE WRK-DU-05V00 TO COMPUTED-18V0.
043400 INS-WRITE-F1-2.
043500     PERFORM PRINT-DETAIL.
043600*
043700 MOV-INIT-F1-1.
043800     MOVE "MOV-TEST-F1-1" TO PAR-NAME.
043900     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
044000     MOVE "FULL ODO + BASE SEGMENT SOURCE" TO RE-MARK.
044100     PERFORM INIT-WRK-AREA.
044200     MOVE SPACES TO WRK-GRP-00019.
044300     MOVE GRP-ODO TO WRK-GRP-00019.
044400 MOV-TEST-F1-1.
044500     IF WRK-GRP-00019 IS EQUAL TO STATIC-VALUE
044600         PERFORM PASS
044700         GO TO MOV-WRITE-F1-1
044800     ELSE
044900         GO TO MOV-FAIL-F1-1.
045000 MOV-DELETE-F1-1.
045100     PERFORM DE-LETE.
045200     GO TO MOV-WRITE-F1-1.
045300 MOV-FAIL-F1-1.
045400     PERFORM FAIL
045500     MOVE STATIC-VALUE TO CORRECT-A
045600     MOVE WRK-GRP-00019 TO COMPUTED-A.
045700 MOV-WRITE-F1-1.
045800     PERFORM PRINT-DETAIL.
045900*
046000 MOV-INIT-F1-2.
046100     MOVE "MOV-TEST-F1-2" TO PAR-NAME.
046200     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
046300     MOVE "PART ODO + BASE SEGMENT SOURCE" TO RE-MARK.
046400     PERFORM INIT-WRK-AREA.
046500     MOVE SPACES TO WRK-GRP-00019.
046600     MOVE 3 TO DOI-DU-01V00.
046700     MOVE GRP-ODO TO WRK-GRP-00019.
046800 MOV-TEST-F1-2.
046900     IF WRK-GRP-00019 IS EQUAL TO "3 ACTIVE: 123      "
047000         PERFORM PASS
047100         GO TO MOV-WRITE-F1-2
047200     ELSE
047300         GO TO MOV-FAIL-F1-2.
047400 MOV-DELETE-F1-2.
047500     PERFORM DE-LETE.
047600     GO TO MOV-WRITE-F1-2.
047700 MOV-FAIL-F1-2.
047800     PERFORM FAIL
047900     MOVE "3 ACTIVE: 123" TO CORRECT-A
048000     MOVE WRK-GRP-00019 TO COMPUTED-A.
048100 MOV-WRITE-F1-2.
048200     PERFORM PRINT-DETAIL.
048300*
048400 MOV-INIT-F1-3.
048500     MOVE "MOV-TEST-F1-3" TO PAR-NAME.
048600     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
048700     MOVE "FULL ODO +BASE SEG RECEIVING" TO RE-MARK.
048800     MOVE 9 TO DOI-DU-01V00.
048900     MOVE "F" TO  ODO-XN-00001-O009D (6).
049000     MOVE "A" TO  ODO-XN-00001-O009D (7).
049100     MOVE "I" TO  ODO-XN-00001-O009D (8).
049200     MOVE "L" TO  ODO-XN-00001-O009D (9).
049300     MOVE "3 ACTIVE: TEST PASS" TO GRP-ODO.
049400     MOVE 9 TO DOI-DU-01V00.
049500 MOV-TEST-F1-3.
049600     IF GRP-ODO IS EQUAL TO "9 ACTIVE: TEST PASS"
049700         PERFORM PASS
049800         GO TO MOV-WRITE-F1-3
049900     ELSE
050000         GO TO MOV-FAIL-F1-3.
050100 MOV-DELETE-F1-3.
050200     PERFORM DE-LETE.
050300     GO TO MOV-WRITE-F1-3.
050400 MOV-FAIL-F1-3.
050500     PERFORM FAIL
050600     MOVE "9 ACTIVE: TEST PASS" TO CORRECT-A
050700     MOVE GRP-ODO TO COMPUTED-A.
050800 MOV-WRITE-F1-3.
050900     PERFORM PRINT-DETAIL.
051000*
051100 MOV-INIT-F1-4.
051200     MOVE "MOV-TEST-F1-4" TO PAR-NAME.
051300     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
051400     MOVE "PART ODO + BASE SEG RECEIVING" TO RE-MARK.
051500     MOVE 9 TO DOI-DU-01V00.
051600     MOVE "F" TO ODO-XN-00001-O009D (6).
051700     MOVE "A" TO ODO-XN-00001-O009D (7).
051800     MOVE "I" TO ODO-XN-00001-O009D (8).
051900     MOVE "L" TO ODO-XN-00001-O009D (9).
052000     MOVE "9 ACTIVE: TEST PASS" TO GRP-ODO.
052100     MOVE 9 TO DOI-DU-01V00.
052200     MOVE GRP-ODO TO WRK-GRP-00019.
052300     MOVE 5 TO WRK-DU-01V00.
052400 MOV-TEST-F1-4.
052500     IF GRP-ODO IS EQUAL TO "9 ACTIVE: TEST PASS"
052600         PERFORM PASS
052700         GO TO MOV-WRITE-F1-4
052800     ELSE
052900         GO TO MOV-FAIL-F1-4.
053000 MOV-DELETE-F1-4.
053100     PERFORM DE-LETE.
053200     GO TO MOV-WRITE-F1-4.
053300 MOV-FAIL-F1-4.
053400     PERFORM FAIL
053500     MOVE WRK-GRP-00019 TO COMPUTED-A
053600     MOVE "9 ACTIVE: TEST PASS" TO CORRECT-A.
053700 MOV-WRITE-F1-4.
053800     PERFORM PRINT-DETAIL.
053900*
054000 MOV-INIT-F1-5.
054100     MOVE   "MOV-TEST-F1-5" TO PAR-NAME.
054200     MOVE   "VI-26 5.8.3 SR5" TO ANSI-REFERENCE.
054300*    MOVE    9  TO DOI-DU-01V00.
054400*    MOVE   "Z" TO ODO-XN-00001-O009D (1).
054500*    MOVE   "E" TO ODO-XN-00001-O009D (2).
054600*    MOVE   "R" TO ODO-XN-00001-O009D (3).
054700*    MOVE   "O" TO ODO-XN-00001-O009D (4).
054800*    MOVE   "*" TO WRK-XN-00001.
054900*    MOVE    ZERO TO DOI-DU-01V00.
055000*    MOVE    ODO-XN-00001-O009D (1) TO WRK-XN-00001.
055100*MOV-TEST-F1-5.
055200*    IF      WRK-XN-00001 = "*"
055300*            PERFORM PASS
055400*            GO TO MOV-WRITE-F1-5
055500*    ELSE
055600*            GO TO MOV-FAIL-F1-5.
055700 MOV-DELETE-F1-5.
055800     PERFORM DE-LETE.
055900     GO TO   MOV-WRITE-F1-5.
056000 MOV-FAIL-F1-5.
056100     MOVE    WRK-XN-00001 TO COMPUTED-A
056200     MOVE   "*"           TO CORRECT-A
056300     MOVE   "OCCURS ZERO TIMES - MOVE SHOULD HAVE FAILED"
056400            TO RE-MARK
056500     PERFORM FAIL.
056600 MOV-WRITE-F1-5.
056700     PERFORM PRINT-DETAIL.
056800*
056900 MOV-INIT-F1-6.
057000     MOVE   "MOV-TEST-F1-6" TO PAR-NAME.
057100     MOVE   "VI-26 5.8.3 SR5" TO ANSI-REFERENCE.
057200     MOVE    9  TO DOI-DU-01V00.
057300     MOVE   "P" TO ODO-XN-00001-O009D (1).
057400     MOVE   "Q" TO ODO-XN-00001-O009D (2).
057500     MOVE   "R" TO ODO-XN-00001-O009D (3).
057600     MOVE   "S" TO ODO-XN-00001-O009D (4).
057700     MOVE   "T" TO ODO-XN-00001-O009D (5).
057800     MOVE   "U" TO ODO-XN-00001-O009D (6).
057900     MOVE   "V" TO ODO-XN-00001-O009D (7).
058000     MOVE   "W" TO ODO-XN-00001-O009D (8).
058100     MOVE   "X" TO ODO-XN-00001-O009D (9).
058200     MOVE    3  TO NEW-DU-01V00.
058300     MOVE    ODO-RECORD TO NEW-RECORD.
058400 MOV-TEST-F1-6.
058500     IF      NEW-GRP-00009 = "PQRSTUVWX"
058600             PERFORM PASS
058700             GO TO MOV-WRITE-F1-6
058800     ELSE
058900             GO TO MOV-FAIL-F1-6.
059000 MOVE-DELETE-F1-6.
059100     PERFORM DE-LETE.
059200     GO TO   MOV-WRITE-F1-6.
059300 MOV-FAIL-F1-6.
059400     MOVE    NEW-GRP-00009 TO COMPUTED-A
059500     MOVE   "PQRSTUVWX"   TO CORRECT-A
059600     MOVE   "ALL 9 FIELDS SHOULD BE MOVED IN GROUP MOVE"
059700            TO RE-MARK
059800     PERFORM FAIL.
059900 MOV-WRITE-F1-6.
060000     PERFORM PRINT-DETAIL.
060100*
060200 SCH-INIT-F1-1.
060300     MOVE "SCH-TEST-F1-1" TO PAR-NAME.
060400     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
060500     MOVE "SEARCH FULL ODO TABLE" TO RE-MARK.
060600     PERFORM INIT-WRK-AREA.
060700     SET ODO-IX TO 1.
060800 SCH-TEST-F1-1.
060900     SEARCH ODO-XN-00001-O009D
061000         WHEN ODO-XN-00001-O009D (ODO-IX) IS EQUAL TO "7"
061100             PERFORM PASS
061200             GO TO SCH-WRITE-F1-1.
061300     GO TO SCH-FAIL-F1-1.
061400 SCH-DELETE-F1-1.
061500     PERFORM DE-LETE.
061600     GO TO SCH-WRITE-F1-1.
061700 SCH-FAIL-F1-1.
061800     PERFORM FAIL.
061900     MOVE "7 SHOULD BE FOUND" TO CORRECT-A
062000     MOVE "7 WAS NOT FOUND" TO COMPUTED-A.
062100 SCH-WRITE-F1-1.
062200     PERFORM PRINT-DETAIL.
062300*
062400 SCH-INIT-F1-2.
062500     MOVE "SCH-TEST-F1-2" TO PAR-NAME.
062600     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
062700     MOVE "SEARCH PARTIAL ODO TABLE" TO RE-MARK.
062800     PERFORM INIT-WRK-AREA.
062900     MOVE 3 TO DOI-DU-01V00.
063000     SET ODO-IX TO 1.
063100 SCH-TEST-F1-2.
063200     SEARCH ODO-XN-00001-O009D
063300         AT END
063400             PERFORM PASS
063500             GO TO SCH-WRITE-F1-2
063600         WHEN ODO-XN-00001-O009D (ODO-IX) IS EQUAL TO "7"
063700             GO TO SCH-FAIL-F1-2.
063800 SCH-DELETE-F1-2.
063900     PERFORM DE-LETE.
064000     GO TO SCH-WRITE-F1-2.
064100 SCH-FAIL-F1-2.
064200     PERFORM FAIL
064300     MOVE "7 SHOULDN""T BE FOUND" TO CORRECT-A
064400     MOVE "7 WAS FOUND" TO COMPUTED-A.
064500 SCH-WRITE-F1-2.
064600     PERFORM PRINT-DETAIL.
064700*
064800 SCH-INIT-F2-3.
064900     MOVE "SCH-TEST-F2-3" TO PAR-NAME.
065000     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
065100     MOVE "SEARCH ALL FULL ODO TABLE" TO RE-MARK.
065200     PERFORM INIT-WRK-AREA.
065300 SCH-TEST-F2-3.
065400     SEARCH ALL ODO-XN-00001-O009D
065500         WHEN ODO-XN-00001-O009D (ODO-IX) IS EQUAL TO "7"
065600             PERFORM PASS
065700             GO TO SCH-WRITE-F2-3.
065800     GO TO SCH-FAIL-F2-3.
065900 SCH-DELETE-F2-3.
066000     PERFORM DE-LETE.
066100     GO TO SCH-WRITE-F2-3.
066200 SCH-FAIL-F2-3.
066300     PERFORM FAIL
066400     MOVE "7 SHOULD BE FOUND" TO CORRECT-A
066500     MOVE "7 WAS NOT FOUND" TO COMPUTED-A.
066600 SCH-WRITE-F2-3.
066700     PERFORM PRINT-DETAIL.
066800*
066900 SCH-INIT-4.
067000     MOVE "SCH-TEST-4" TO PAR-NAME.
067100     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
067200     MOVE "SEARCH ALL PARTIAL ODO TABLE" TO RE-MARK.
067300     PERFORM INIT-WRK-AREA.
067400     MOVE 3 TO DOI-DU-01V00.
067500 SCH-TEST-4.
067600     SEARCH ALL ODO-XN-00001-O009D
067700         AT END
067800             PERFORM PASS
067900             GO TO SCH-WRITE-4
068000         WHEN ODO-XN-00001-O009D (ODO-IX) IS EQUAL TO "7"
068100             GO TO SCH-FAIL-4.
068200 SCH-DELETE-4.
068300     PERFORM DE-LETE.
068400     GO TO SCH-WRITE-4.
068500 SCH-FAIL-4.
068600     PERFORM FAIL
068700     MOVE "7 SHOULDN""T BE FOUND" TO CORRECT-A
068800     MOVE "7 WAS FOUND" TO COMPUTED-A.
068900 SCH-WRITE-4.
069000     PERFORM PRINT-DETAIL.
069100*
069200 STR-INIT-GF-1.
069300     MOVE "STR-TEST-GF-1" TO PAR-NAME.
069400     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
069500     MOVE "STRING FULL ODO AND LITERAL"  TO RE-MARK.
069600     PERFORM INIT-WRK-AREA.
069700     MOVE SPACES TO WRK-XN-00020.
069800 STR-TEST-GF-1.
069900     STRING ODO-GRP-00009  "-TRAILER" DELIMITED BY SIZE
070000         INTO WRK-XN-00020.
070100     IF WRK-XN-00020 IS EQUAL TO "123456789-TRAILER   "
070200         PERFORM PASS
070300         GO TO STR-WRITE-GF-1
070400     ELSE
070500         GO TO STR-FAIL-GF-1.
070600 STR-DELETE-GF-1.
070700     PERFORM DE-LETE.
070800     GO TO STR-WRITE-GF-1.
070900 STR-FAIL-GF-1.
071000     PERFORM FAIL
071100     MOVE "123456789-TRAILER" TO CORRECT-A
071200     MOVE WRK-XN-00020 TO COMPUTED-A.
071300 STR-WRITE-GF-1.
071400     PERFORM PRINT-DETAIL.
071500*
071600 STR-INIT-GF-2.
071700     MOVE "STR-TEST-GF-2" TO PAR-NAME.
071800     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
071900     MOVE "STRING PARTIAL ODO AND LITERAL" TO RE-MARK.
072000     PERFORM INIT-WRK-AREA.
072100     MOVE SPACES TO WRK-XN-00020.
072200     MOVE 3 TO DOI-DU-01V00.
072300 STR-TEST-GF-2.
072400     STRING ODO-GRP-00009 "-TRAILER" DELIMITED BY SIZE
072500         INTO WRK-XN-00020.
072600     IF WRK-XN-00020 IS EQUAL TO "123-TRAILER         "
072700         PERFORM PASS
072800         GO TO STR-WRITE-GF-2
072900     ELSE
073000         GO TO STR-FAIL-GF-2.
073100 STR-DELETE-GF-2.
073200     PERFORM DE-LETE.
073300     GO TO STR-WRITE-GF-2.
073400 STR-FAIL-GF-2.
073500     PERFORM FAIL
073600     MOVE "123-TRAILER" TO CORRECT-A
073700     MOVE WRK-XN-00020 TO COMPUTED-A.
073800 STR-WRITE-GF-2.
073900     PERFORM PRINT-DETAIL.
074000*
074100 STR-TEST-GF-3.
074200     PERFORM INIT-WRK-AREA.
074300     MOVE SPACES TO WRK-XN-00020.
074400     MOVE 3 TO DOI-DU-01V00.
074500     STRING "LEADER-" ODO-GRP-00009 DELIMITED BY SIZE
074600         INTO WRK-XN-00020.
074700     IF WRK-XN-00020 IS EQUAL TO "LEADER-123      "
074800         PERFORM PASS
074900         GO TO STR-WRITE-GF-3
075000         ELSE
075100         PERFORM FAIL
075200         MOVE "LEADER-123" TO CORRECT-A
075300         MOVE WRK-XN-00020 TO COMPUTED-A
075400         PERFORM STR-WRITE-GF-3
075500         GO TO STR-DELETE-GF-4.
075600 STR-DELETE-GF-3.
075700     PERFORM DE-LETE.
075800 STR-WRITE-GF-3.
075900     MOVE "STR-TEST-GF-3" TO PAR-NAME.
076000     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
076100     MOVE "STRING LITERAL AND PARTIAL ODO" TO RE-MARK.
076200     PERFORM PRINT-DETAIL.
076300*
076400 STR-INIT-GF-4.
076500     MOVE "STR-TEST-GF-4" TO PAR-NAME.
076600     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
076700     MOVE "PARTIAL ODO/UNNEEDED OVERFLOW" TO RE-MARK.
076800     PERFORM INIT-WRK-AREA
076900     MOVE SPACES TO WRK-XN-00010.
077000     MOVE 3 TO DOI-DU-01V00.
077100 STR-TEST-GF-4.
077200     STRING "LEADER-"  ODO-GRP-00009 DELIMITED BY SIZE
077300         INTO WRK-XN-00010
077400         ON OVERFLOW
077500             GO TO STR-FAIL-GF-4.
077600     PERFORM PASS.
077700     GO TO STR-WRITE-GF-4.
077800 STR-DELETE-GF-4.
077900     PERFORM DE-LETE.
078000     MOVE "STR-TEST-GF-4" TO PAR-NAME.
078100     MOVE "DELETE AUTOMATIC IF" TO COMPUTED-A.
078200     MOVE "STR-TEST-GF-3 FAILS" TO CORRECT-A.
078300     GO TO STR-WRITE-GF-4.
078400 STR-FAIL-GF-4.
078500     PERFORM FAIL
078600     MOVE "OVERFLOW EXIT TAKEN" TO COMPUTED-A
078700     MOVE "NO EXIT NECESSARY" TO CORRECT-A.
078800 STR-WRITE-GF-4.
078900     PERFORM PRINT-DETAIL.
079000*
079100 UST-INIT-GF-1.
079200     MOVE "UST-TEST-GF-1" TO PAR-NAME.
079300     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
079400     MOVE "UNSTRING FULL ODO" TO RE-MARK.
079500     PERFORM INIT-WRK-AREA.
079600     MOVE SPACES TO WRK-XN-00010 WRK-XN-00020.
079700 UST-TEST-GF-1.
079800     UNSTRING GRP-ODO INTO WRK-XN-00010 WRK-XN-00020.
079900     IF WRK-XN-00020 IS EQUAL TO "123456789           "
080000         PERFORM PASS
080100         GO TO UST-WRITE-GF-1
080200     ELSE
080300         GO TO UST-FAIL-GF-1.
080400 UST-DELETE-GF-1.
080500     PERFORM DE-LETE.
080600     GO TO UST-WRITE-GF-1.
080700 UST-FAIL-GF-1.
080800     PERFORM FAIL
080900     MOVE  WRK-XN-00020 TO COMPUTED-A
081000     MOVE "123456789" TO CORRECT-A.
081100 UST-WRITE-GF-1.
081200     PERFORM PRINT-DETAIL.
081300*
081400 UST-INIT-GF-2.
081500     MOVE "UST-TEST-GF-2" TO PAR-NAME.
081600     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
081700     MOVE "UNSTRING PARTIAL ODO" TO RE-MARK.
081800     PERFORM INIT-WRK-AREA.
081900     MOVE SPACES TO WRK-XN-00020  WRK-XN-00010.
082000     MOVE 3 TO DOI-DU-01V00.
082100 UST-TEST-GF-2.
082200     UNSTRING GRP-ODO INTO WRK-XN-00010  WRK-XN-00020.
082300     IF WRK-XN-00020 IS EQUAL TO "123                 "
082400         PERFORM PASS
082500         GO TO UST-WRITE-GF-2
082600     ELSE
082700         GO TO UST-FAIL-GF-2.
082800 UST-DELETE-GF-2.
082900     PERFORM DE-LETE.
083000     GO TO UST-WRITE-GF-2.
083100 UST-FAIL-GF-2.
083200     PERFORM FAIL
083300     MOVE WRK-XN-00020 TO COMPUTED-A
083400     MOVE "123" TO CORRECT-A.
083500 UST-WRITE-GF-2.
083600     PERFORM PRINT-DETAIL.
083700*
083800 UST-INIT-GF-3.
083900     MOVE "UST-TEST-GF-3" TO PAR-NAME.
084000     MOVE "VI-26 5.8" TO ANSI-REFERENCE.
084100     MOVE "UNSTRING DELIMITED PARTIAL ODO" TO RE-MARK.
084200     PERFORM INIT-WRK-AREA.
084300     MOVE SPACES TO WRK-XN-00020.
084400     MOVE 3 TO DOI-DU-01V00.
084500 UST-TEST-GF-3.
084600     UNSTRING GRP-ODO DELIMITED BY "7" INTO WRK-XN-00020.
084700     IF WRK-XN-00020 IS EQUAL TO "3 ACTIVE: 123       "
084800         PERFORM PASS
084900         GO TO UST-WRITE-GF-3
085000     ELSE
085100         GO TO UST-FAIL-GF-3.
085200 UST-DELETE-GF-3.
085300     PERFORM DE-LETE.
085400     GO TO UST-WRITE-GF-3.
085500 UST-FAIL-GF-3.
085600     PERFORM FAIL
085700     MOVE WRK-XN-00020 TO COMPUTED-A
085800     MOVE "3 ACTIVE: 123" TO CORRECT-A.
085900 UST-WRITE-GF-3.
086000     PERFORM PRINT-DETAIL.
086100*
086200 CCVS-EXIT SECTION.
086300 CCVS-999999.
086400     GO TO CLOSE-FILES.
