000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC248A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC248A TESTS FORMATS 1 AND 2 OF THE "SET"         *
002300*    STATEMENT USING QUALIFICATION WITH INDEXED AND            *
002400*    RELATIVE-INDEXED IDENTIFIERS.                             *
002500*    FORMAT 4 OF THE "SET" STATEMENT IS ALSO TESTED.           *
002600*                                                              *
002700****************************************************************
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 01  TEST-7-DATA.
004500   03  TEST-7-1                  PIC X.
004600               88 TEST-7-1-TRUE  VALUE "%".
004700 01  TEST-8-DATA.
004800   03  TEST-8-1                  PIC X.
004900               88 TEST-8-1-1-TRUE  VALUE "J".
005000               88 TEST-8-1-2-TRUE  VALUE "A".
005100               88 TEST-8-1-3-TRUE  VALUE "N".
005200 01  TEST-9-DATA.
005300   03  TEST-9-1                  PIC X.
005400               88 TEST-9-1-1-TRUE  VALUE "6".
005500               88 TEST-9-1-2-TRUE  VALUE "2".
005600   03  TEST-9-2                  PIC X.
005700               88 TEST-9-2-1-TRUE  VALUE "B".
005800               88 TEST-9-2-2-TRUE  VALUE "C".
005900   03  TEST-9-3                  PIC X.
006000               88 TEST-9-3-1-TRUE VALUE "*".
006100               88 TEST-9-3-2-TRUE VALUE "+".
006200
006300 01  TABLE1.
006400     02  TABLE1-REC              PICTURE 99
006500                                 OCCURS 100 TIMES
006600                                 INDEXED BY INDEX1.
006700 01  TABLE2.
006800     02  TABLE2-REC              PICTURE 99
006900                                 OCCURS 12 TIMES
007000                                 INDEXED BY INDEX2.
007100 01  INDEX-ID                    PIC 999         VALUE ZEROS.
007200 01  TEST-RESULTS.
007300     02 FILLER                   PIC X      VALUE SPACE.
007400     02 FEATURE                  PIC X(20)  VALUE SPACE.
007500     02 FILLER                   PIC X      VALUE SPACE.
007600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
007700     02 FILLER                   PIC X      VALUE SPACE.
007800     02  PAR-NAME.
007900       03 FILLER                 PIC X(19)  VALUE SPACE.
008000       03  PARDOT-X              PIC X      VALUE SPACE.
008100       03 DOTVALUE               PIC 99     VALUE ZERO.
008200     02 FILLER                   PIC X(8)   VALUE SPACE.
008300     02 RE-MARK                  PIC X(61).
008400 01  TEST-COMPUTED.
008500     02 FILLER                   PIC X(30)  VALUE SPACE.
008600     02 FILLER                   PIC X(17)  VALUE
008700            "       COMPUTED=".
008800     02 COMPUTED-X.
008900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
009000     03 COMPUTED-N               REDEFINES COMPUTED-A
009100                                 PIC -9(9).9(9).
009200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
009300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
009400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
009500     03       CM-18V0 REDEFINES COMPUTED-A.
009600         04 COMPUTED-18V0                    PIC -9(18).
009700         04 FILLER                           PIC X.
009800     03 FILLER PIC X(50) VALUE SPACE.
009900 01  TEST-CORRECT.
010000     02 FILLER PIC X(30) VALUE SPACE.
010100     02 FILLER PIC X(17) VALUE "       CORRECT =".
010200     02 CORRECT-X.
010300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
010400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
010500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
010600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
010700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
010800     03      CR-18V0 REDEFINES CORRECT-A.
010900         04 CORRECT-18V0                     PIC -9(18).
011000         04 FILLER                           PIC X.
011100     03 FILLER PIC X(2) VALUE SPACE.
011200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
011300 01  CCVS-C-1.
011400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
011500-    "SS  PARAGRAPH-NAME
011600-    "       REMARKS".
011700     02 FILLER                     PIC X(20)    VALUE SPACE.
011800 01  CCVS-C-2.
011900     02 FILLER                     PIC X        VALUE SPACE.
012000     02 FILLER                     PIC X(6)     VALUE "TESTED".
012100     02 FILLER                     PIC X(15)    VALUE SPACE.
012200     02 FILLER                     PIC X(4)     VALUE "FAIL".
012300     02 FILLER                     PIC X(94)    VALUE SPACE.
012400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
012500 01  REC-CT                        PIC 99       VALUE ZERO.
012600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
012700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
012800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
012900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
013000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
013100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
013200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
013300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
013400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
013500 01  CCVS-H-1.
013600     02  FILLER                    PIC X(39)    VALUE SPACES.
013700     02  FILLER                    PIC X(42)    VALUE
013800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
013900     02  FILLER                    PIC X(39)    VALUE SPACES.
014000 01  CCVS-H-2A.
014100   02  FILLER                        PIC X(40)  VALUE SPACE.
014200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
014300   02  FILLER                        PIC XXXX   VALUE
014400     "4.2 ".
014500   02  FILLER                        PIC X(28)  VALUE
014600            " COPY - NOT FOR DISTRIBUTION".
014700   02  FILLER                        PIC X(41)  VALUE SPACE.
014800
014900 01  CCVS-H-2B.
015000   02  FILLER                        PIC X(15)  VALUE
015100            "TEST RESULT OF ".
015200   02  TEST-ID                       PIC X(9).
015300   02  FILLER                        PIC X(4)   VALUE
015400            " IN ".
015500   02  FILLER                        PIC X(12)  VALUE
015600     " HIGH       ".
015700   02  FILLER                        PIC X(22)  VALUE
015800            " LEVEL VALIDATION FOR ".
015900   02  FILLER                        PIC X(58)  VALUE
016000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016100 01  CCVS-H-3.
016200     02  FILLER                      PIC X(34)  VALUE
016300            " FOR OFFICIAL USE ONLY    ".
016400     02  FILLER                      PIC X(58)  VALUE
016500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016600     02  FILLER                      PIC X(28)  VALUE
016700            "  COPYRIGHT   1985 ".
016800 01  CCVS-E-1.
016900     02 FILLER                       PIC X(52)  VALUE SPACE.
017000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
017100     02 ID-AGAIN                     PIC X(9).
017200     02 FILLER                       PIC X(45)  VALUE SPACES.
017300 01  CCVS-E-2.
017400     02  FILLER                      PIC X(31)  VALUE SPACE.
017500     02  FILLER                      PIC X(21)  VALUE SPACE.
017600     02 CCVS-E-2-2.
017700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
017800         03 FILLER                   PIC X      VALUE SPACE.
017900         03 ENDER-DESC               PIC X(44)  VALUE
018000            "ERRORS ENCOUNTERED".
018100 01  CCVS-E-3.
018200     02  FILLER                      PIC X(22)  VALUE
018300            " FOR OFFICIAL USE ONLY".
018400     02  FILLER                      PIC X(12)  VALUE SPACE.
018500     02  FILLER                      PIC X(58)  VALUE
018600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018700     02  FILLER                      PIC X(13)  VALUE SPACE.
018800     02 FILLER                       PIC X(15)  VALUE
018900             " COPYRIGHT 1985".
019000 01  CCVS-E-4.
019100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
019200     02 FILLER                       PIC X(4)   VALUE " OF ".
019300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
019400     02 FILLER                       PIC X(40)  VALUE
019500      "  TESTS WERE EXECUTED SUCCESSFULLY".
019600 01  XXINFO.
019700     02 FILLER                       PIC X(19)  VALUE
019800            "*** INFORMATION ***".
019900     02 INFO-TEXT.
020000       04 FILLER                     PIC X(8)   VALUE SPACE.
020100       04 XXCOMPUTED                 PIC X(20).
020200       04 FILLER                     PIC X(5)   VALUE SPACE.
020300       04 XXCORRECT                  PIC X(20).
020400     02 INF-ANSI-REFERENCE           PIC X(48).
020500 01  HYPHEN-LINE.
020600     02 FILLER  PIC IS X VALUE IS SPACE.
020700     02 FILLER  PIC IS X(65)    VALUE IS "************************
020800-    "*****************************************".
020900     02 FILLER  PIC IS X(54)    VALUE IS "************************
021000-    "******************************".
021100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
021200     "NC248A".
021300 PROCEDURE DIVISION.
021400 CCVS1 SECTION.
021500 OPEN-FILES.
021600     OPEN     OUTPUT PRINT-FILE.
021700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
021800     MOVE    SPACE TO TEST-RESULTS.
021900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022000     GO TO CCVS1-EXIT.
022100 CLOSE-FILES.
022200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022300 TERMINATE-CCVS.
022400S    EXIT PROGRAM.
022500STERMINATE-CALL.
022600     STOP     RUN.
022700 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
022800 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
022900 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
023000 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
023100     MOVE "****TEST DELETED****" TO RE-MARK.
023200 PRINT-DETAIL.
023300     IF REC-CT NOT EQUAL TO ZERO
023400             MOVE "." TO PARDOT-X
023500             MOVE REC-CT TO DOTVALUE.
023600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
023700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
023800        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
023900          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
024000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
024100     MOVE SPACE TO CORRECT-X.
024200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
024300     MOVE     SPACE TO RE-MARK.
024400 HEAD-ROUTINE.
024500     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024600     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024700     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024800     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
024900 COLUMN-NAMES-ROUTINE.
025000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
025300 END-ROUTINE.
025400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
025500 END-RTN-EXIT.
025600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
025700 END-ROUTINE-1.
025800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
025900      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
026000      ADD PASS-COUNTER TO ERROR-HOLD.
026100*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
026200      MOVE PASS-COUNTER TO CCVS-E-4-1.
026300      MOVE ERROR-HOLD TO CCVS-E-4-2.
026400      MOVE CCVS-E-4 TO CCVS-E-2-2.
026500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
026600  END-ROUTINE-12.
026700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
026800     IF       ERROR-COUNTER IS EQUAL TO ZERO
026900         MOVE "NO " TO ERROR-TOTAL
027000         ELSE
027100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
027200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
027300     PERFORM WRITE-LINE.
027400 END-ROUTINE-13.
027500     IF DELETE-COUNTER IS EQUAL TO ZERO
027600         MOVE "NO " TO ERROR-TOTAL  ELSE
027700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
027800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
027900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028000      IF   INSPECT-COUNTER EQUAL TO ZERO
028100          MOVE "NO " TO ERROR-TOTAL
028200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
028300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
028400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028600 WRITE-LINE.
028700     ADD 1 TO RECORD-COUNT.
028800Y    IF RECORD-COUNT GREATER 50
028900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
029000Y        MOVE SPACE TO DUMMY-RECORD
029100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
029200Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
029300Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
029400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
029500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
029600Y        MOVE ZERO TO RECORD-COUNT.
029700     PERFORM WRT-LN.
029800 WRT-LN.
029900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
030000     MOVE SPACE TO DUMMY-RECORD.
030100 BLANK-LINE-PRINT.
030200     PERFORM WRT-LN.
030300 FAIL-ROUTINE.
030400     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
030600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
030800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030900     MOVE   SPACES TO INF-ANSI-REFERENCE.
031000     GO TO  FAIL-ROUTINE-EX.
031100 FAIL-ROUTINE-WRITE.
031200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
031300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
031400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
031500     MOVE   SPACES TO COR-ANSI-REFERENCE.
031600 FAIL-ROUTINE-EX. EXIT.
031700 BAIL-OUT.
031800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
031900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
032000 BAIL-OUT-WRITE.
032100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
032200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032400     MOVE   SPACES TO INF-ANSI-REFERENCE.
032500 BAIL-OUT-EX. EXIT.
032600 CCVS1-EXIT.
032700     EXIT.
032800 BUILD-TABLE2.
032900     MOVE 21 TO TABLE2-REC (1).
033000     MOVE 02 TO TABLE2-REC (2).
033100     MOVE 03 TO TABLE2-REC (3).
033200     MOVE 11 TO TABLE2-REC (4).
033300     MOVE 05 TO TABLE2-REC (5).
033400     MOVE 10 TO TABLE2-REC (6).
033500     MOVE 26 TO TABLE2-REC (7).
033600     MOVE 02 TO TABLE2-REC (8).
033700     MOVE 16 TO TABLE2-REC (9).
033800     MOVE 62 TO TABLE2-REC (10).
033900     MOVE 10 TO TABLE2-REC (11).
034000     MOVE 04 TO TABLE2-REC (12).
034100*
034200 SET-INIT-F1-1.
034300     MOVE "SET-TEST-F1-1" TO PAR-NAME.
034400     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
034500     MOVE "SET ... TO" TO FEATURE.
034600 SET-TEST-F1-1.
034700     SET INDEX1 TO 1.
034800     SET INDEX2 TO 4.
034900     SET INDEX1 TO TABLE2-REC OF TABLE2 (INDEX2).
035000     IF INDEX1 EQUAL TO 11
035100        PERFORM PASS
035200        GO TO SET-WRITE-F1-1
035300     ELSE
035400        GO TO SET-FAIL-F1-1.
035500 SET-DELETE-F1-1.
035600     PERFORM DE-LETE.
035700     GO TO SET-WRITE-F1-1.
035800 SET-FAIL-F1-1.
035900     PERFORM FAIL.
036000     SET INDEX-ID TO INDEX1.
036100     MOVE INDEX-ID TO COMPUTED-18V0.
036200     MOVE 11 TO CORRECT-18V0.
036300 SET-WRITE-F1-1.
036400     PERFORM PRINT-DETAIL.
036500*
036600 SET-INIT-F2-2.
036700     MOVE "SET-TEST-F2-2" TO PAR-NAME.
036800     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
036900     MOVE "SET ... UP BY" TO FEATURE.
037000     PERFORM BUILD-TABLE2.
037100 SET-TEST-F2-2.
037200     SET INDEX1 TO 11.
037300     SET INDEX2 TO 5.
037400     SET INDEX1 UP BY TABLE2-REC OF TABLE2 (INDEX2).
037500     IF INDEX1 EQUAL TO 16
037600        PERFORM PASS
037700        GO TO SET-WRITE-F2-2
037800     ELSE
037900        GO TO SET-FAIL-F2-2.
038000 SET-DELETE-F2-2.
038100     PERFORM DE-LETE.
038200     GO TO SET-WRITE-F2-2.
038300 SET-FAIL-F2-2.
038400     PERFORM FAIL.
038500     SET INDEX-ID TO INDEX1.
038600     MOVE INDEX-ID TO COMPUTED-18V0.
038700     MOVE 16 TO CORRECT-18V0.
038800 SET-WRITE-F2-2.
038900     PERFORM PRINT-DETAIL.
039000*
039100 SET-INIT-F2-3.
039200     MOVE "SET-TEST-F2-3" TO PAR-NAME.
039300     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
039400     MOVE "SET ... DOWN BY" TO FEATURE.
039500     PERFORM BUILD-TABLE2.
039600 SET-TEST-F2-3.
039700     SET INDEX1 TO 16.
039800     SET INDEX2 TO 6.
039900     SET INDEX1 DOWN BY TABLE2-REC OF TABLE2 (INDEX2).
040000     IF INDEX1 EQUAL TO 06
040100        PERFORM PASS
040200        GO TO SET-WRITE-F2-3
040300     ELSE
040400        GO TO SET-FAIL-F2-3.
040500 SET-DELETE-F2-3.
040600     PERFORM DE-LETE.
040700     GO TO SET-WRITE-F2-3.
040800 SET-FAIL-F2-3.
040900     PERFORM FAIL.
041000     SET INDEX-ID TO INDEX1.
041100     MOVE INDEX-ID TO COMPUTED-18V0.
041200     MOVE 06 TO CORRECT-18V0.
041300 SET-WRITE-F2-3.
041400     PERFORM PRINT-DETAIL.
041500*
041600 SET-INIT-F1-4.
041700     MOVE "SET-TEST-F1-4" TO PAR-NAME.
041800     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
041900     MOVE "SET ... TO" TO FEATURE.
042000     PERFORM BUILD-TABLE2.
042100 SET-TEST-F1-4.
042200     SET INDEX1 TO 1.
042300     SET INDEX2 TO 11.
042400     SET INDEX1 TO TABLE2-REC OF TABLE2 (INDEX2 + 1).
042500     IF INDEX1 EQUAL TO 4
042600        PERFORM PASS
042700        GO TO SET-WRITE-F1-4
042800     ELSE
042900        GO TO SET-FAIL-F1-4.
043000 SET-DELETE-F1-4.
043100     PERFORM DE-LETE.
043200     GO TO SET-WRITE-F1-4.
043300 SET-FAIL-F1-4.
043400     PERFORM FAIL.
043500     SET INDEX-ID TO INDEX1.
043600     MOVE INDEX-ID TO COMPUTED-18V0.
043700     MOVE 4 TO CORRECT-18V0.
043800 SET-WRITE-F1-4.
043900     PERFORM PRINT-DETAIL.
044000*
044100 SET-INIT-F2-5.
044200     MOVE "SET-TEST-F2-5" TO PAR-NAME.
044300     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
044400     MOVE "SET ... UP BY" TO FEATURE.
044500     PERFORM BUILD-TABLE2.
044600 SET-TEST-F2-5.
044700     SET INDEX1 TO 1.
044800     SET INDEX2 TO 3.
044900     SET INDEX1 UP BY TABLE2-REC OF TABLE2 (INDEX2 - 2).
045000     IF INDEX1 EQUAL TO 22
045100        PERFORM PASS
045200        GO TO SET-WRITE-F2-5
045300     ELSE
045400        GO TO SET-FAIL-F2-5.
045500 SET-DELETE-F2-5.
045600     PERFORM DE-LETE.
045700     GO TO SET-WRITE-F2-5.
045800 SET-FAIL-F2-5.
045900     PERFORM FAIL.
046000     SET INDEX-ID TO INDEX1.
046100     MOVE INDEX-ID TO COMPUTED-18V0.
046200     MOVE 22 TO CORRECT-18V0.
046300 SET-WRITE-F2-5.
046400     PERFORM PRINT-DETAIL.
046500*
046600 SET-INIT-F2-6.
046700     MOVE "SET-TEST-F2-6" TO PAR-NAME.
046800     MOVE "VI-126 6.22.2" TO ANSI-REFERENCE.
046900     MOVE "SET ... DOWN BY" TO FEATURE.
047000     PERFORM BUILD-TABLE2.
047100 SET-TEST-F2-6.
047200     SET INDEX1 TO 16.
047300     SET INDEX2 TO 12.
047400     SET INDEX1 DOWN BY TABLE2-REC OF TABLE2 (INDEX2 - 6).
047500     IF INDEX1 EQUAL TO 06
047600        PERFORM PASS
047700        GO TO SET-WRITE-F2-6
047800     ELSE
047900        GO TO SET-FAIL-F2-6.
048000 SET-DELETE-F2-6.
048100     PERFORM DE-LETE.
048200     GO TO SET-WRITE-F2-6.
048300 SET-FAIL-F2-6.
048400     PERFORM FAIL.
048500     SET INDEX-ID TO INDEX1.
048600     MOVE INDEX-ID TO COMPUTED-18V0.
048700     MOVE 06 TO CORRECT-18V0.
048800 SET-WRITE-F2-6.
048900     PERFORM PRINT-DETAIL.
049000*
049100 SET-INIT-F2-7.
049200     MOVE   "SET-TEST-F2-7" TO PAR-NAME.
049300     MOVE   "VI-128 6.22.4 GR7" TO ANSI-REFERENCE.
049400     MOVE    SPACE TO TEST-7-1.
049500 SET-TEST-F2-7-0.
049600     SET     TEST-7-1-TRUE TO TRUE.
049700     GO TO   SET-TEST-F2-7-1.
049800 SET-DELETE-F2-7.
049900     PERFORM DE-LETE.
050000     GO TO   SET-WRITE-F2-7-1.
050100*
050200 SET-TEST-F2-7-1.
050300     IF      TEST-7-1 = "%"
050400             PERFORM PASS
050500             GO TO   SET-WRITE-F2-7-1
050600     ELSE
050700             GO TO   SET-FAIL-F2-7-1.
050800 SET-DELETE-F2-7-1.
050900     PERFORM DE-LETE.
051000     GO TO SET-WRITE-F2-7-1.
051100 SET-FAIL-F2-7-1.
051200     PERFORM FAIL.
051300     MOVE   "CONDITION VARIABLE NOT SET TO TRUE VALUE"
051400          TO RE-MARK.
051500     MOVE    TEST-7-1 TO COMPUTED-X.
051600     MOVE   "%"       TO CORRECT-X.
051700 SET-WRITE-F2-7-1.
051800     PERFORM PRINT-DETAIL.
051900*
052000 SET-INIT-F2-8.
052100     MOVE   "SET-TEST-F2-8" TO PAR-NAME.
052200     MOVE   "VI-128 6.22.4 GR7" TO ANSI-REFERENCE.
052300     MOVE    SPACE TO TEST-8-1.
052400 SET-TEST-F2-8-0.
052500     SET     TEST-8-1-1-TRUE TO TRUE.
052600     GO TO   SET-TEST-F2-8-1.
052700 SET-DELETE-F2-8.
052800     PERFORM DE-LETE.
052900     GO TO   SET-WRITE-F2-8-1.
053000*
053100 SET-TEST-F2-8-1.
053200     IF      TEST-8-1 = "J"
053300             PERFORM PASS
053400             GO TO   SET-WRITE-F2-8-1
053500     ELSE
053600             GO TO   SET-FAIL-F2-8-1.
053700 SET-DELETE-F2-8-1.
053800     PERFORM DE-LETE.
053900     GO TO SET-WRITE-F2-8-1.
054000 SET-FAIL-F2-8-1.
054100     PERFORM FAIL.
054200     MOVE   "CONDITION VARIABLE NOT SET TO FIRST TRUE VALUE"
054300          TO RE-MARK.
054400     MOVE    TEST-8-1 TO COMPUTED-X.
054500     MOVE   "J"       TO CORRECT-X.
054600 SET-WRITE-F2-8-1.
054700     PERFORM PRINT-DETAIL.
054800*
054900 SET-INIT-F2-9.
055000     MOVE   "SET-TEST-F2-9" TO PAR-NAME.
055100     MOVE   "VI-128 6.22.4 GR7" TO ANSI-REFERENCE.
055200     MOVE    SPACE TO TEST-8-1.
055300     MOVE    1 TO REC-CT.
055400 SET-TEST-F2-9-0.
055500     SET     TEST-9-1-1-TRUE
055600             TEST-9-2-1-TRUE
055700             TEST-9-3-1-TRUE TO TRUE.
055800     GO TO   SET-TEST-F2-9-1.
055900 SET-DELETE-F2-9.
056000     PERFORM DE-LETE.
056100     GO TO   SET-WRITE-F2-9-3.
056200*
056300 SET-TEST-F2-9-1.
056400     IF      TEST-9-1 = "6"
056500             PERFORM PASS
056600             GO TO   SET-WRITE-F2-9-1
056700     ELSE
056800             GO TO   SET-FAIL-F2-9-1.
056900 SET-DELETE-F2-9-1.
057000     PERFORM DE-LETE.
057100     GO TO SET-WRITE-F2-9-1.
057200 SET-FAIL-F2-9-1.
057300     PERFORM FAIL.
057400     MOVE   "CONDITION VARIABLE NOT SET TO FIRST TRUE VALUE"
057500          TO RE-MARK.
057600     MOVE    TEST-9-1 TO COMPUTED-X.
057700     MOVE   "6"       TO CORRECT-X.
057800 SET-WRITE-F2-9-1.
057900     PERFORM PRINT-DETAIL.
058000*
058100 SET-TEST-F2-9-2.
058200     ADD     1 TO REC-CT.
058300     IF      TEST-9-2 = "B"
058400             PERFORM PASS
058500             GO TO   SET-WRITE-F2-9-2
058600     ELSE
058700             GO TO   SET-FAIL-F2-9-2.
058800 SET-DELETE-F2-9-2.
058900     PERFORM DE-LETE.
059000     GO TO SET-WRITE-F2-9-2.
059100 SET-FAIL-F2-9-2.
059200     PERFORM FAIL.
059300     MOVE   "CONDITION VARIABLE NOT SET TO FIRST TRUE VALUE"
059400          TO RE-MARK.
059500     MOVE    TEST-9-2 TO COMPUTED-X.
059600     MOVE   "6"       TO CORRECT-X.
059700 SET-WRITE-F2-9-2.
059800     PERFORM PRINT-DETAIL.
059900*
060000 SET-TEST-F2-9-3.
060100     ADD     1 TO REC-CT.
060200     IF      TEST-9-3 = "*"
060300             PERFORM PASS
060400             GO TO   SET-WRITE-F2-9-3
060500     ELSE
060600             GO TO   SET-FAIL-F2-9-3.
060700 SET-DELETE-F2-9-3.
060800     PERFORM DE-LETE.
060900     GO TO SET-WRITE-F2-9-3.
061000 SET-FAIL-F2-9-3.
061100     PERFORM FAIL.
061200     MOVE   "CONDITION VARIABLE NOT SET TO FIRST TRUE VALUE"
061300          TO RE-MARK.
061400     MOVE    TEST-9-3 TO COMPUTED-X.
061500     MOVE   "*"       TO CORRECT-X.
061600 SET-WRITE-F2-9-3.
061700     PERFORM PRINT-DETAIL.
061800*
061900 CCVS-EXIT SECTION.
062000 CCVS-999999.
062100     GO TO CLOSE-FILES.
