000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC242A.
000400
000500****************************************************************
000600*                                                              *
000700*    VALIDATION FOR:-                                          *
000800*                                                              *
000900*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
001000*                                                              *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-82  - SOURCE COMPUTER NAME.                         *
001900*        X-83  - OBJECT COMPUTER NAME.                         *
002000*                                                              *
002100****************************************************************
002200*                                                              *
002300*    PROGRAM NC242A TESTS THE CONSTRUCTION AND ACCESS OF       *
002400*    THREE AND SEVEN-DIMENSIONAL TABLES.                       *
002500*    THE CONSTRUCTION IS BY MEANS OF A FORMAT 4 "PERFORM"      *
002600*    STATEMENT UTILIZING SUBSCRIPTS WHICH ARE CONVERTED TO     *
002700*    INDICES BY "SET".   ACCESS IS VIA "IF" STATEMENTS USING   *
002800*    SUBSCRIPTS OF NUMERIC LITERALS AND CONSTANTS.             *
002900*                                                              *
003000****************************************************************
003100 ENVIRONMENT DIVISION.
003200 CONFIGURATION SECTION.
003300 SOURCE-COMPUTER.
003400     XXXXX082.
003500 OBJECT-COMPUTER.
003600     XXXXX083.
003700 INPUT-OUTPUT SECTION.
003800 FILE-CONTROL.
003900     SELECT PRINT-FILE ASSIGN TO
004000     XXXXX055.
004100 DATA DIVISION.
004200 FILE SECTION.
004300 FD  PRINT-FILE.
004400 01  PRINT-REC PICTURE X(120).
004500 01  DUMMY-RECORD PICTURE X(120).
004600 WORKING-STORAGE SECTION.
004700 77  SUB-1              PICTURE S99  VALUE ZERO.
004800 77  SUB-2              PICTURE 99   VALUE ZERO.
004900 77  SUB-3              PICTURE 99   VALUE ZERO.
005000 77  CON-7              PICTURE 99   VALUE 07.
005100 77  CON-10             PICTURE 99  VALUE 10.
005200 77  CON-5              PICTURE 99  VALUE 05.
005300 77  CON-6              PICTURE 99  VALUE 06.
005400 77  N1                 PICTURE 99  VALUE ZERO.
005500 77  N2                 PICTURE 99  VALUE ZERO.
005600 77  N3                 PICTURE 99  VALUE ZERO.
005700 77  N4                 PICTURE 99  VALUE ZERO.
005800 77  N5                 PICTURE 99  VALUE ZERO.
005900 77  N6                 PICTURE 99  VALUE ZERO.
006000 77  N7                 PICTURE 99  VALUE ZERO.
006100
006200
006300
006400 01  GRP-NAME.
006500     02  FILLER              PICTURE XXX    VALUE "GRP".
006600     02  ADD-GRP             PICTURE 99     VALUE 01.
006700
006800 01  SEC-NAME.
006900     02  FILLER              PICTURE X(5)   VALUE "SEC (".
007000     02  SEC-GRP             PICTURE 99     VALUE 00.
007100     02  FILLER              PICTURE X      VALUE ",".
007200     02  ADD-SEC             PICTURE 99     VALUE 01.
007300     02  FILLER              PICTURE X      VALUE ")".
007400
007500 01  ELEM-NAME.
007600     02  FILLER              PICTURE X(6)   VALUE "ELEM (".
007700     02  ELEM-GRP            PICTURE 99     VALUE 00.
007800     02  FILLER              PICTURE X      VALUE ",".
007900     02  ELEM-SEC            PICTURE 99     VALUE 00.
008000     02  FILLER              PICTURE X      VALUE ",".
008100     02  ADD-ELEM            PICTURE 99     VALUE 01.
008200     02  FILLER              PICTURE X      VALUE ")".
008300
008400 01  3-DIMENSION-TBL.
008500     02  GRP-ENTRY OCCURS 10 TIMES INDEXED BY IDX-1.
008600         03  ENTRY-1         PICTURE X(5).
008700         03  GRP2-ENTRY OCCURS 10 TIMES INDEXED BY IDX-2.
008800             04  ENTRY-2     PICTURE X(11).
008900             04  GRP3-ENTRY OCCURS 10 TIMES INDEXED BY IDX-3.
009000                 05  ENTRY-3 PICTURE X(15).
009100
009200 01  7-DIMENSION-TBL.
009300   02  GRP-7-1-ENTRY             OCCURS 2 INDEXED BY IX-1.
009400     03  ENTRY-7-1               PIC XX.
009500     03  GRP-7-2-ENTRY           OCCURS 2 INDEXED BY IX-2.
009600       04  ENTRY-7-2             PIC XX.
009700       04  GRP-7-3-ENTRY         OCCURS 2 INDEXED BY IX-3.
009800         05  ENTRY-7-3           PIC XX.
009900         05  GRP-7-4-ENTRY       OCCURS 2 INDEXED BY IX-4.
010000           06  ENTRY-7-4         PIC XX.
010100           06  GRP-7-5-ENTRY     OCCURS 2 INDEXED BY IX-5.
010200             07  ENTRY-7-5       PIC XX.
010300             07  GRP-7-6-ENTRY   OCCURS 2 INDEXED BY IX-6.
010400               08  ENTRY-7-6     PIC XX.
010500               08  GRP-7-7-ENTRY OCCURS 2 INDEXED BY IX-7.
010600                 09  ENTRY-7-7   PIC XX.
010700
010800 77  L1-HOLD                     PIC XX.
010900 77  L2-HOLD                     PIC XX.
011000 77  L3-HOLD                     PIC XX.
011100 77  L4-HOLD                     PIC XX.
011200 77  L5-HOLD                     PIC XX.
011300 77  L6-HOLD                     PIC XX.
011400 77  L7-HOLD                     PIC XX.
011500 01  TEST-RESULTS.
011600     02 FILLER                   PIC X      VALUE SPACE.
011700     02 FEATURE                  PIC X(20)  VALUE SPACE.
011800     02 FILLER                   PIC X      VALUE SPACE.
011900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
012000     02 FILLER                   PIC X      VALUE SPACE.
012100     02  PAR-NAME.
012200       03 FILLER                 PIC X(19)  VALUE SPACE.
012300       03  PARDOT-X              PIC X      VALUE SPACE.
012400       03 DOTVALUE               PIC 99     VALUE ZERO.
012500     02 FILLER                   PIC X(8)   VALUE SPACE.
012600     02 RE-MARK                  PIC X(61).
012700 01  TEST-COMPUTED.
012800     02 FILLER                   PIC X(30)  VALUE SPACE.
012900     02 FILLER                   PIC X(17)  VALUE
013000            "       COMPUTED=".
013100     02 COMPUTED-X.
013200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
013300     03 COMPUTED-N               REDEFINES COMPUTED-A
013400                                 PIC -9(9).9(9).
013500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
013600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
013700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
013800     03       CM-18V0 REDEFINES COMPUTED-A.
013900         04 COMPUTED-18V0                    PIC -9(18).
014000         04 FILLER                           PIC X.
014100     03 FILLER PIC X(50) VALUE SPACE.
014200 01  TEST-CORRECT.
014300     02 FILLER PIC X(30) VALUE SPACE.
014400     02 FILLER PIC X(17) VALUE "       CORRECT =".
014500     02 CORRECT-X.
014600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
014700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
014800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
014900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
015000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
015100     03      CR-18V0 REDEFINES CORRECT-A.
015200         04 CORRECT-18V0                     PIC -9(18).
015300         04 FILLER                           PIC X.
015400     03 FILLER PIC X(2) VALUE SPACE.
015500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
015600 01  CCVS-C-1.
015700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
015800-    "SS  PARAGRAPH-NAME
015900-    "       REMARKS".
016000     02 FILLER                     PIC X(20)    VALUE SPACE.
016100 01  CCVS-C-2.
016200     02 FILLER                     PIC X        VALUE SPACE.
016300     02 FILLER                     PIC X(6)     VALUE "TESTED".
016400     02 FILLER                     PIC X(15)    VALUE SPACE.
016500     02 FILLER                     PIC X(4)     VALUE "FAIL".
016600     02 FILLER                     PIC X(94)    VALUE SPACE.
016700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
016800 01  REC-CT                        PIC 99       VALUE ZERO.
016900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
017000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
017100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
017200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
017300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
017400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
017500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
017600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
017700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
017800 01  CCVS-H-1.
017900     02  FILLER                    PIC X(39)    VALUE SPACES.
018000     02  FILLER                    PIC X(42)    VALUE
018100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
018200     02  FILLER                    PIC X(39)    VALUE SPACES.
018300 01  CCVS-H-2A.
018400   02  FILLER                        PIC X(40)  VALUE SPACE.
018500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
018600   02  FILLER                        PIC XXXX   VALUE
018700     "4.2 ".
018800   02  FILLER                        PIC X(28)  VALUE
018900            " COPY - NOT FOR DISTRIBUTION".
019000   02  FILLER                        PIC X(41)  VALUE SPACE.
019100
019200 01  CCVS-H-2B.
019300   02  FILLER                        PIC X(15)  VALUE
019400            "TEST RESULT OF ".
019500   02  TEST-ID                       PIC X(9).
019600   02  FILLER                        PIC X(4)   VALUE
019700            " IN ".
019800   02  FILLER                        PIC X(12)  VALUE
019900     " HIGH       ".
020000   02  FILLER                        PIC X(22)  VALUE
020100            " LEVEL VALIDATION FOR ".
020200   02  FILLER                        PIC X(58)  VALUE
020300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020400 01  CCVS-H-3.
020500     02  FILLER                      PIC X(34)  VALUE
020600            " FOR OFFICIAL USE ONLY    ".
020700     02  FILLER                      PIC X(58)  VALUE
020800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
020900     02  FILLER                      PIC X(28)  VALUE
021000            "  COPYRIGHT   1985 ".
021100 01  CCVS-E-1.
021200     02 FILLER                       PIC X(52)  VALUE SPACE.
021300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
021400     02 ID-AGAIN                     PIC X(9).
021500     02 FILLER                       PIC X(45)  VALUE SPACES.
021600 01  CCVS-E-2.
021700     02  FILLER                      PIC X(31)  VALUE SPACE.
021800     02  FILLER                      PIC X(21)  VALUE SPACE.
021900     02 CCVS-E-2-2.
022000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
022100         03 FILLER                   PIC X      VALUE SPACE.
022200         03 ENDER-DESC               PIC X(44)  VALUE
022300            "ERRORS ENCOUNTERED".
022400 01  CCVS-E-3.
022500     02  FILLER                      PIC X(22)  VALUE
022600            " FOR OFFICIAL USE ONLY".
022700     02  FILLER                      PIC X(12)  VALUE SPACE.
022800     02  FILLER                      PIC X(58)  VALUE
022900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
023000     02  FILLER                      PIC X(13)  VALUE SPACE.
023100     02 FILLER                       PIC X(15)  VALUE
023200             " COPYRIGHT 1985".
023300 01  CCVS-E-4.
023400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
023500     02 FILLER                       PIC X(4)   VALUE " OF ".
023600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
023700     02 FILLER                       PIC X(40)  VALUE
023800      "  TESTS WERE EXECUTED SUCCESSFULLY".
023900 01  XXINFO.
024000     02 FILLER                       PIC X(19)  VALUE
024100            "*** INFORMATION ***".
024200     02 INFO-TEXT.
024300       04 FILLER                     PIC X(8)   VALUE SPACE.
024400       04 XXCOMPUTED                 PIC X(20).
024500       04 FILLER                     PIC X(5)   VALUE SPACE.
024600       04 XXCORRECT                  PIC X(20).
024700     02 INF-ANSI-REFERENCE           PIC X(48).
024800 01  HYPHEN-LINE.
024900     02 FILLER  PIC IS X VALUE IS SPACE.
025000     02 FILLER  PIC IS X(65)    VALUE IS "************************
025100-    "*****************************************".
025200     02 FILLER  PIC IS X(54)    VALUE IS "************************
025300-    "******************************".
025400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
025500     "NC242A".
025600 PROCEDURE DIVISION.
025700 CCVS1 SECTION.
025800 OPEN-FILES.
025900     OPEN     OUTPUT PRINT-FILE.
026000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
026100     MOVE    SPACE TO TEST-RESULTS.
026200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
026300     GO TO CCVS1-EXIT.
026400 CLOSE-FILES.
026500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
026600 TERMINATE-CCVS.
026700S    EXIT PROGRAM.
026800STERMINATE-CALL.
026900     STOP     RUN.
027000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
027100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
027200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
027300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
027400     MOVE "****TEST DELETED****" TO RE-MARK.
027500 PRINT-DETAIL.
027600     IF REC-CT NOT EQUAL TO ZERO
027700             MOVE "." TO PARDOT-X
027800             MOVE REC-CT TO DOTVALUE.
027900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
028000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
028100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
028200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
028300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
028400     MOVE SPACE TO CORRECT-X.
028500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
028600     MOVE     SPACE TO RE-MARK.
028700 HEAD-ROUTINE.
028800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
029100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
029200 COLUMN-NAMES-ROUTINE.
029300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
029600 END-ROUTINE.
029700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
029800 END-RTN-EXIT.
029900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030000 END-ROUTINE-1.
030100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
030200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
030300      ADD PASS-COUNTER TO ERROR-HOLD.
030400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
030500      MOVE PASS-COUNTER TO CCVS-E-4-1.
030600      MOVE ERROR-HOLD TO CCVS-E-4-2.
030700      MOVE CCVS-E-4 TO CCVS-E-2-2.
030800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
030900  END-ROUTINE-12.
031000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
031100     IF       ERROR-COUNTER IS EQUAL TO ZERO
031200         MOVE "NO " TO ERROR-TOTAL
031300         ELSE
031400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
031500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
031600     PERFORM WRITE-LINE.
031700 END-ROUTINE-13.
031800     IF DELETE-COUNTER IS EQUAL TO ZERO
031900         MOVE "NO " TO ERROR-TOTAL  ELSE
032000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
032100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
032200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032300      IF   INSPECT-COUNTER EQUAL TO ZERO
032400          MOVE "NO " TO ERROR-TOTAL
032500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
032600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
032700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032900 WRITE-LINE.
033000     ADD 1 TO RECORD-COUNT.
033100Y    IF RECORD-COUNT GREATER 50
033200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
033300Y        MOVE SPACE TO DUMMY-RECORD
033400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
033500Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
033600Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
033700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
033800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
033900Y        MOVE ZERO TO RECORD-COUNT.
034000     PERFORM WRT-LN.
034100 WRT-LN.
034200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
034300     MOVE SPACE TO DUMMY-RECORD.
034400 BLANK-LINE-PRINT.
034500     PERFORM WRT-LN.
034600 FAIL-ROUTINE.
034700     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
034800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
034900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
035000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
035100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035200     MOVE   SPACES TO INF-ANSI-REFERENCE.
035300     GO TO  FAIL-ROUTINE-EX.
035400 FAIL-ROUTINE-WRITE.
035500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
035600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
035700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
035800     MOVE   SPACES TO COR-ANSI-REFERENCE.
035900 FAIL-ROUTINE-EX. EXIT.
036000 BAIL-OUT.
036100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
036200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
036300 BAIL-OUT-WRITE.
036400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
036500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
036600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036700     MOVE   SPACES TO INF-ANSI-REFERENCE.
036800 BAIL-OUT-EX. EXIT.
036900 CCVS1-EXIT.
037000     EXIT.
037100 SECT-NC242A-001 SECTION.
037200 TH-16-001.
037300     PERFORM PARA-1 VARYING SUB-1 FROM 1 BY 1
037400         UNTIL SUB-1 EQUAL TO 11
037500         AFTER SUB-2 FROM 1 BY 1 UNTIL SUB-2 EQUAL TO 11
037600         AFTER SUB-3 FROM 1 BY 1 UNTIL SUB-3 EQUAL TO 11
037700     GO TO CHECK-ENTRIES.
037800
037900 PARA-1.
038000     SET IDX-1 TO SUB-1.
038100     SET IDX-2 TO SUB-2.
038200     SET IDX-3 TO SUB-3.
038300     SET ADD-GRP, SEC-GRP, ELEM-GRP TO IDX-1.
038400     MOVE GRP-NAME TO ENTRY-1 (IDX-1).
038500     SET ADD-SEC, ELEM-SEC TO IDX-2.
038600     MOVE SEC-NAME TO ENTRY-2 (IDX-1, IDX-2).
038700     SET ADD-ELEM TO IDX-3.
038800     MOVE ELEM-NAME TO ENTRY-3 (IDX-1, IDX-2, IDX-3).
038900
039000 CHECK-ENTRIES.
039100     MOVE "LEVEL 1 TBL SUBSCRPT" TO FEATURE.
039200     MOVE "CHECK-ENTRIES       " TO PAR-NAME.
039300     IF ENTRY-1 (5) IS NOT EQUAL TO "GRP05"
039400         MOVE "GRP05" TO CORRECT-A
039500         MOVE ENTRY-1 (5) TO COMPUTED-A
039600
039700         MOVE "NUMERIC LITERAL SUBSCRIPT  " TO RE-MARK
039800         PERFORM FAIL
039900         GO TO TEST-1-WRITE.
040000
040100     PERFORM PASS.
040200 TEST-1-WRITE.
040300     PERFORM PRINT-DETAIL.
040400
040500 TEST-1-2.
040600     MOVE "TEST-1-2" TO PAR-NAME.
040700     IF ENTRY-1 (CON-5) IS NOT EQUAL TO "GRP05"
040800         MOVE "GRP05" TO CORRECT-A
040900         MOVE ENTRY-1 (CON-5) TO COMPUTED-A
041000
041100         MOVE "NUMERIC CONSTANT SUBSCRIPT " TO RE-MARK
041200         PERFORM FAIL
041300          GO TO TEST-1-2-WRITE.
041400
041500     PERFORM PASS.
041600 TEST-1-2-WRITE.
041700     PERFORM PRINT-DETAIL.
041800
041900 TEST-2.
042000     MOVE "LEVEL 2 TBL SUBSCRPT" TO FEATURE.
042100     MOVE "TEST-2              " TO PAR-NAME.
042200     IF ENTRY-2 (5, 6) IS NOT EQUAL TO "SEC (05,06)"
042300         MOVE "SEC (05,06)" TO CORRECT-A
042400         MOVE ENTRY-2 (5, 6) TO COMPUTED-A
042500
042600         MOVE "NUMERIC LITERAL SUBSCRIPT  " TO RE-MARK
042700         PERFORM FAIL
042800         GO TO TEST-2-WRITE.
042900
043000     PERFORM PASS.
043100 TEST-2-WRITE.
043200     PERFORM PRINT-DETAIL.
043300
043400 TEST-2-2.
043500     MOVE "TEST-2-2            " TO PAR-NAME.
043600     IF ENTRY-2 (05, CON-6) IS NOT EQUAL TO "SEC (05,06)"
043700         MOVE "SEC (05,06)" TO CORRECT-A
043800         MOVE ENTRY-2 (05, CON-6) TO COMPUTED-A
043900
044000         MOVE "NUM LITRL/CONSTANT SUBSCRPT" TO RE-MARK
044100         PERFORM FAIL
044200         GO TO TEST-2-2-WRITE.
044300
044400     PERFORM PASS.
044500 TEST-2-2-WRITE.
044600     PERFORM PRINT-DETAIL.
044700
044800 TEST-2-3.
044900     MOVE "TEST-2-3            " TO PAR-NAME.
045000     IF ENTRY-2 (CON-5, CON-6) IS NOT EQUAL TO "SEC (05,06)"
045100         MOVE "SEC (05,06)" TO CORRECT-A
045200         MOVE ENTRY-2 (CON-5, CON-6) TO COMPUTED-A
045300
045400         MOVE "2 NUMERIC CONSTANT SUBSCRPT" TO RE-MARK
045500         PERFORM FAIL
045600         GO TO TEST-2-3-WRITE.
045700
045800     PERFORM PASS.
045900 TEST-2-3-WRITE.
046000     PERFORM PRINT-DETAIL.
046100
046200 TEST-3.
046300     MOVE "LEVEL 3 TBL SUBSCRPT" TO FEATURE.
046400     MOVE "TEST-3              " TO PAR-NAME.
046500     IF ENTRY-3 (10, 05, 06) IS NOT EQUAL TO "ELEM (10,05,06)"
046600         MOVE "ELEM (10,05,06)" TO CORRECT-A
046700         MOVE ENTRY-3 (10, 05, 06) TO COMPUTED-A
046800
046900         MOVE "3 NUMERIC LITERAL SUBSCRPTS" TO RE-MARK
047000         PERFORM FAIL
047100         GO TO TEST-3-WRITE.
047200
047300     PERFORM PASS.
047400 TEST-3-WRITE.
047500     PERFORM PRINT-DETAIL.
047600
047700 TEST-3-2.
047800     MOVE "TEST-3-2            " TO PAR-NAME.
047900     IF ENTRY-3 (10, CON-5, CON-6) IS NOT EQUAL TO
048000         "ELEM (10,05,06)"
048100         MOVE "ELEM (10,05,06)" TO CORRECT-A
048200         MOVE ENTRY-3 (10, CON-5, CON-6) TO COMPUTED-A
048300
048400         MOVE "1 NUM LTRL/2 CONSTANT SUBS " TO RE-MARK
048500         PERFORM FAIL
048600         GO TO TEST-3-2-WRITE.
048700
048800     PERFORM PASS.
048900 TEST-3-2-WRITE.
049000     PERFORM PRINT-DETAIL.
049100
049200 TEST-3-3.
049300     MOVE "TEST-3-3            " TO PAR-NAME.
049400     IF ENTRY-3 (CON-10, CON-5, CON-6) IS NOT EQUAL TO
049500         "ELEM (10,05,06)" MOVE "ELEM (10,05,06)" TO CORRECT-A
049600         MOVE ENTRY-3 (CON-10, CON-5, CON-6) TO COMPUTED-A
049700
049800         MOVE "3 NUMERIC CONSTANT SUBSCRPT" TO RE-MARK
049900         PERFORM FAIL
050000         GO TO END-3LEVEL-SUBSCRPT-TEST.
050100
050200     PERFORM PASS.
050300     GO TO END-3LEVEL-SUBSCRPT-TEST.
050400
050500 END-3LEVEL-SUBSCRPT-TEST.
050600     PERFORM PRINT-DETAIL.
050700*
050800 TH7-INIT.
050900     MOVE   "TH7-TEST"   TO PAR-NAME.
051000     MOVE   "VI-2 1.3.4" TO ANSI-REFERENCE.
051100     MOVE    ALL "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO 7-DIMENSION-TBL.
051200     MOVE   "KL" TO L4-HOLD.
051300     MOVE   "AB" TO L5-HOLD.
051400     MOVE   "CD" TO L6-HOLD.
051500     MOVE   "GH" TO L7-HOLD.
051600     MOVE    1 TO REC-CT.
051700     SET     IX-1 IX-2 IX-3 IX-4 IX-5 IX-6 IX-7 TO 1.
051800     MOVE    2 TO N1 N3 N5 N7.
051900     GO TO   TH7-TEST-1.
052000 TH7-DELETE-1.
052100     PERFORM DE-LETE.
052200     PERFORM PRINT-DETAIL.
052300     GO TO   CCVS-999999.
052400 TH7-TEST-1.
052500     MOVE   "TH7-TEST-1" TO PAR-NAME.
052600     IF      ENTRY-7-4 (N1 1 N3 1) = L4-HOLD
052700             PERFORM PASS
052800             PERFORM PRINT-DETAIL
052900     ELSE
053000             MOVE    ENTRY-7-4 (N1 1 N3 1) TO COMPUTED-A
053100             MOVE    L4-HOLD TO CORRECT-A
053200             MOVE   "TABLE INCORRECT" TO RE-MARK
053300             PERFORM FAIL
053400             PERFORM PRINT-DETAIL.
053500     ADD     1 TO REC-CT.
053600 TH7-TEST-2.
053700     MOVE   "TH7-TEST-2" TO PAR-NAME.
053800     IF      ENTRY-7-5 (N1 1 N3 1 N5) = L5-HOLD
053900             PERFORM PASS
054000             PERFORM PRINT-DETAIL
054100     ELSE
054200             MOVE    ENTRY-7-5 (N1 1 N3 1 N5) TO COMPUTED-A
054300             MOVE    L5-HOLD TO CORRECT-A
054400             MOVE   "TABLE INCORRECT" TO RE-MARK
054500             PERFORM FAIL
054600             PERFORM PRINT-DETAIL.
054700     ADD     1 TO REC-CT.
054800 TH7-TEST-3.
054900     MOVE   "TH7-TEST-3" TO PAR-NAME.
055000     IF      ENTRY-7-6 (N1 1 N3 1 N5 1) = L6-HOLD
055100             PERFORM PASS
055200             PERFORM PRINT-DETAIL
055300     ELSE
055400             MOVE    ENTRY-7-6 (N1 1 N3 1 N5 1) TO COMPUTED-A
055500             MOVE    L6-HOLD TO CORRECT-A
055600             MOVE   "TABLE INCORRECT" TO RE-MARK
055700             PERFORM FAIL
055800             PERFORM PRINT-DETAIL.
055900     ADD     1 TO REC-CT.
056000 TH7-TEST-4.
056100     MOVE   "TH7-TEST-4" TO PAR-NAME.
056200     IF      ENTRY-7-7 (N1 1 N3 1 N5 1 N7) = L7-HOLD
056300             PERFORM PASS
056400             PERFORM PRINT-DETAIL
056500     ELSE
056600             MOVE    ENTRY-7-7 (N1 1 N3 1 N5 1 N7) TO COMPUTED-A
056700             MOVE    L7-HOLD TO CORRECT-A
056800             MOVE   "TABLE INCORRECT" TO RE-MARK
056900             PERFORM FAIL
057000             PERFORM PRINT-DETAIL.
057100
057200*
057300 CCVS-EXIT SECTION.
057400 CCVS-999999.
057500     GO TO CLOSE-FILES.
