000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC253A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100
002200*
002300*    PROGRAM NC202A TESTS FORMAT3 OF THE SUBTRACT STATEMENT.
002400*
002500*
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE.
003900 01  PRINT-REC PICTURE X(120).
004000 01  DUMMY-RECORD PICTURE X(120).
004100 WORKING-STORAGE SECTION.
004200 01  TABLE1.
004300     02  RECORD1                 PICTURE 99.
004400     02  RECORD2                 PICTURE 99
004500                                 OCCURS 2 TIMES
004600                                 INDEXED BY INDEX1.
004700     02  RECORD3                 PICTURE 99.
004800 01  TABLE2.
004900     02  RECORD1                 PICTURE 99.
005000     02  RECORD2                 PICTURE 99
005100                                 OCCURS 2 TIMES
005200                                 INDEXED BY INDEX2.
005300     02  RECORD3                 PICTURE 99.
005400 77  WRK-AN-00001                PICTURE A.
005500 77  WRK-XN-00001                PICTURE X.
005600 77  WRK-DS-01V00                PICTURE S9.
005700 77  WRK-DS-02V00                PICTURE S99.
005800 77  WRK-DS-06V06                PICTURE S9(6)V9(6).
005900 77  WRK-DS-05V00                PICTURE S9(5).
006000 77  AZERO-DS-05V05              PICTURE S9(5)V9(5) VALUE ZERO.
006100 77  WRK-DS-09V09                PICTURE S9(9)V9(9).
006200 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09 PICTURE S9(18).
006300 77  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
006400                                 VALUE 111111111.111111111.
006500 77  WRK-DS-18V00       PICTURE S9(18) VALUE 111111111111111111.
006600 77  A05ONES-DS-05V00            PICTURE S9(5) VALUE 11111.
006700 77  A99-DS-02V00                PICTURE S99   VALUE 99.
006800 77  WRK-DS-03V00                PICTURE S999.
006900 77  WRK-DS-06V00                PICTURE S9(6).
007000 77  WRK-DS-0201P                PICTURE S99P.
007100 77  WRK-DS-03V10                PICTURE S9(3)V9(10).
007200 77  ADD-1                   PICTURE S9(8)V99  VALUE 1.
007300 77  ADD-2                   PICTURE S9(6)V9(4) VALUE 1.
007400 77  ADD-3                   PICTURE S9(5)     VALUE -1.
007500 77  ADD-4                   PICTURE 9         VALUE 9.
007600 77  ADD-5                   PICTURE 9         VALUE 9.
007700 77  ADD-6                   PICTURE 9(5)      VALUE 99999.
007800 77  ADD-7                   PICTURE 9         VALUE 1.
007900 77  ADD-8                   PICTURE 9.
008000 77  ADD-9                   PICTURE S9(8)V99  VALUE 5.9.
008100 77  ADD-10                  PICTURE 9(5)      VALUE 52800.
008200 77  ADD-11                  PICTURE 99999.
008300 77  ADD-12                  PICTURE PP9       VALUE .001.
008400 77  ADD-13                  PICTURE 9PP       VALUE 100.
008500 77  ADD-14                  PICTURE 999V999.
008600 77  W-1                     PICTURE IS 9.
008700 77  W-2                     PICTURE IS 99.
008800 77  W-3                     PICTURE IS 999.
008900 77  W-4                PICTURE 9  VALUE 0.
009000 77  W-6                     PICTURE IS 999    VALUE IS ZERO.
009100 77  W-9                     PICTURE 999.
009200 77  D-5                PICTURE S999  VALUE -1.
009300 77  D-9                PICTURE 9(4)V9(4)  VALUE 111.1189.
009400 77  ONE                PICTURE 9  VALUE 1.
009500 77  TWO                PICTURE S9  VALUE 2.
009600 77  THREE              PICTURE S9  VALUE 3.
009700 77  FOUR               PICTURE S9  VALUE 4.
009800 77  FIVE               PICTURE S9  VALUE 5.
009900 77  SIX                PICTURE S9  VALUE 6.
010000 77  SEVEN              PICTURE S9  VALUE 7.
010100 77  EIGHT              PICTURE 9  VALUE 8.
010200 77  NINE               PICTURE S9  VALUE 9.
010300 77  TEN                PICTURE S99  VALUE 10.
010400 77  FIFTEEN            PICTURE S99  VALUE 15.
010500 77  TWENTY             PICTURE S99  VALUE 20.
010600 77  TWENTY-5           PICTURE S99  VALUE 25.
010700 01  WRK-DS-09V00                 PICTURE S9(9)  VALUE ZERO.
010800 01  GRP-FOR-ADD-CORR-1.
010900     02  GRP-SUBTRACT-CORR-1.
011000     03  FILLER                  PICTURE S99  VALUE 91.
011100     03  ADD-CORR-2              PICTURE S99  VALUE 22.
011200     03  ADD-CORR-1              PICTURE S99 VALUE 11.
011300     03  ADD-CORR-A              PICTURE S99 VALUE 93.
011400     03  ADD-CORR-4              PICTURE S99 VALUE 44.
011500     03  ADD-CORR-3              PICTURE S99 VALUE 33.
011600     03  ADD-CORR-6              PICTURE S99 VALUE 66.
011700     03  ADD-CORR-5              PICTURE S99 VALUE 55.
011800     03  ADD-CORR-8              PICTURE S99 VALUE 88.
011900     03  ADD-CORR-7              PICTURE S99 VALUE 77.
012000     03  ADD-CORR-9              PICTURE S99 VALUE 99.
012100 01  GRP-FOR-ADD-CORR-R.
012200     02  GRP-SUBTRACT-CORR-1.
012300     05  ADD-CORR-1              PICTURE 99.
012400     05  ADD-CORR-2              PICTURE 99.
012500     05  ADD-CORR-3              PICTURE 99.
012600     05  ADD-CORR-4              PICTURE 99.
012700     05  ADD-CORR-5              PICTURE 9P.
012800     05  ADD-CORR-6              PICTURE 999.
012900     05  ADD-CORR-7              PICTURE 99.
013000     05  ADD-CORR-8              PICTURE 99.
013100     05  ADD-CORR-9              PICTURE 99.
013200     05  FILLER                  PICTURE 99.
013300 01  GRP-FOR-ADD-CORR-2.
013400     02  GRP-ADD-SUB-CORR.
013500     03  GRP-SUBTRACT-CORR-1.
013600     04  ADD-CORR-1              PICTURE S99  VALUE 11.
013700     04  ADD-CORR-2              PICTURE S99  VALUE 22.
013800     04  ADD-CORR-5              PICTURE S99  VALUE 55.
013900     04  ADD-CORR-4              PICTURE S99  VALUE 44.
014000     04  ADD-CORR-3              PICTURE S99  VALUE 33.
014100     04  ADD-CORR-6              PICTURE S99  VALUE 66.
014200     04  ADD-CORR-7              PICTURE S99  VALUE 77.
014300     04  ADD-CORR-8              PICTURE S99  VALUE 88.
014400     04  ADD-CORR-9              PICTURE S99  VALUE 99.
014500     04  ADD-CORR-B              PICTURE S99  VALUE 92.
014600     04  ADD-CORR-0              PICTURE S99  VALUE 00.
014700 01  GRP-FOR-ADD-CORR-A.
014800     02  GRP-SUBTRACT-CORR-3.
014900         03  GRP-SUBTRACT-CORR-1.
015000             05  ADD-CORR-4      PICTURE S999   VALUE 044.
015100             05  ADD-CORR-3      PICTURE S999   VALUE 033.
015200             05  ADD-CORR-2      PICTURE S999   VALUE 022.
015300             05  ADD-CORR-1      PICTURE S999   VALUE 111.
015400 01  ADD-15.
015500     02 FIELD1               PICTURE 99999     VALUE 1.
015600     02 FIELD2               PICTURE 999V99    VALUE 32.1.
015700     02 FIELD3               PICTURE 999V9     VALUE 123.4.
015800 01  ADD-16.
015900     02 FIELD1               PICTURE 99999     VALUE 99999.
016000     02 FIELD2               PICTURE 999V99    VALUE 745.67.
016100     02 FIELD3               PICTURE 999V9     VALUE 432.1.
016200 01  SUBTRACT-DATA.
016300     02 SUBTR-1              PICTURE 9         VALUE 1.
016400     02 SUBTR-2              PICTURE S99       VALUE 99.
016500     02 SUBTR-3              PICTURE S9V99     VALUE -1.
016600     02 SUBTR-4              PICTURE SPP9      VALUE .001.
016700     02 SUBTR-5              PICTURE S9PP      VALUE 100.
016800     02  SUBTR-6                  PICTURE 9 VALUE 1.
016900     02  SUBTR-7                  PICTURE S99  VALUE 99.
017000     02  SUBTR-8                  PICTURE S9V99  VALUE -9.99.
017100     02 SUBTR-9              PICTURE SV999.
017200     02  SUBTR-10                 PICTURE S999  VALUE 100.
017300     02 SUBTR-11             PICTURE S999V999.
017400     02 SUBTR-12.
017500     03 SUBTR-13             PICTURE 9         VALUE 1.
017600     03 SUBTR-14             PICTURE S9V999    VALUE -1.725.
017700     03 SUBTR-15             PICTURE S99V99    VALUE 76.76.
017800     02 SUBTR-16.
017900     03 SUBTR-13             PICTURE 9         VALUE 2.
018000     03 SUBTR-14             PICTURE S9V99     VALUE .23.
018100     03 SUBTR-15             PICTURE S9V99     VALUE 1.
018200 01  CORR-DATA-1.
018300     03 XYZ-1                PICTURE IS 99     VALUE IS ZERO.
018400     03 XYZ-2                PICTURE IS 99     VALUE IS ZERO.
018500     03 XYZ-3                PICTURE IS 99     VALUE IS ZERO.
018600     03 XYZ-4                PICTURE IS 99     VALUE IS ZERO.
018700     03 XYZ-5                PICTURE IS 99     VALUE IS ZERO.
018800     03 XYZ-6                PICTURE IS 99     VALUE IS ZERO.
018900 01  CORR-DATA-2.
019000     03 XYZ-1                PICTURE IS 99     VALUE IS ZERO.
019100     03 XYZ-2                PICTURE IS 99     VALUE IS ZERO.
019200     03 XYZ-3                PICTURE IS 99     VALUE IS ZERO.
019300     03 XYZ-4                PICTURE IS 99     VALUE IS ZERO.
019400     03 XYZ-5                PICTURE IS 99     VALUE IS ZERO.
019500     03 XYZ-6                PICTURE IS 99     VALUE IS ZERO.
019600 01  CORR-DATA-3.
019700     03 XYZ-4                PICTURE IS 99     VALUE IS ZERO.
019800     03 XYZ-3                PICTURE IS 99     VALUE IS ZERO.
019900     03 XYZ-6                PICTURE IS 99     VALUE IS ZERO.
020000     03 XYZ-5                PICTURE IS 99     VALUE IS ZERO.
020100     03 XYZ-2                PICTURE IS 99     VALUE IS ZERO.
020200     03 XYZ-1                PICTURE IS 99     VALUE IS ZERO.
020300 01  CORR-DATA-4.
020400     03 XYZ-11               PICTURE IS 99.
020500     03 XYZ-12               PICTURE IS 99.
020600     03 XYZ-13               PICTURE IS 99.
020700     03 XYZ-14               PICTURE IS 99.
020800     03 XYZ-15               PICTURE IS 99.
020900     03 XYZ-16               PICTURE IS 99.
021000 01  CORR-DATA-5.
021100     03 XYZ-1                PICTURE 99.
021200     03 XYZ-2                PICTURE 99.
021300     03 XYZ-13               PICTURE IS 99.
021400     03 XYZ-14               PICTURE IS 99.
021500     03 FILLER               PICTURE IS 99.
021600     03 XYZ-11               PICTURE IS 99.
021700     03 XYZ-12               PICTURE IS 99.
021800 01  CORR-DATA-6.
021900     03 XYZ-11               PICTURE IS 99.
022000     03 XYZ-12               PICTURE IS 99.
022100     03 FILLER               PICTURE IS 99.
022200     03 XYZ-1                PICTURE IS 99.
022300     03 XYZ-2                PICTURE IS 9(2).
022400     03 FILLER               PICTURE IS 99.
022500 01  CORR-DATA-7.
022600     02 XYZ-1                PICTURE 99V99     VALUE 10.45.
022700     02 XYZ-6                PICTURE 999V9     VALUE 100.5.
022800     02 XYZ-11               PICTURE 99V9      VALUE ZERO.
022900     02 XYZ-2                PICTURE 99V9      VALUE 0.9.
023000 01  42-DATANAMES.
023100     02  DNAME1   PICTURE 9      VALUE 1        COMPUTATIONAL.
023200     02  DNAME2   PICTURE 99      VALUE 1  COMPUTATIONAL.
023300     02  DNAME3   PICTURE 999     VALUE 1  COMPUTATIONAL.
023400     02  DNAME4   PICTURE 9(4)    VALUE 1  COMPUTATIONAL.
023500     02  DNAME5   PICTURE 9(5)    VALUE 1  COMPUTATIONAL.
023600     02  DNAME6   PICTURE 9(6)    VALUE 1  COMPUTATIONAL.
023700     02  DNAME7   PICTURE 9(7)    VALUE 1  COMPUTATIONAL.
023800     02  DNAME8   PICTURE 9(8)    VALUE 1  COMPUTATIONAL.
023900     02  DNAME9   PICTURE 9(9)    VALUE 1  COMPUTATIONAL.
024000     02  DNAME10  PICTURE 9(10)   VALUE 1.
024100     02  DNAME11  PICTURE 9(11)   VALUE 1.
024200     02  DNAME12  PICTURE 9(12)   VALUE 1.
024300     02  DNAME13  PICTURE 9(13)   VALUE 1.
024400     02  DNAME14  PICTURE 9(14)   VALUE 1.
024500     02  DNAME15  PICTURE 9(15)   VALUE 1.
024600     02  DNAME16  PICTURE 9(16)   VALUE 1.
024700     02  DNAME17  PICTURE 9(17)   VALUE 1.
024800     02  DNAME18  PICTURE 9(18)   VALUE 1.
024900     02  DNAME19  PICTURE 9       VALUE 1.
025000     02  DNAME20  PICTURE 99      VALUE 1.
025100     02  DNAME21  PICTURE 999     VALUE 1.
025200     02  DNAME22  PICTURE 9(18)  VALUE ZERO.
025300     02  DNAME23  PICTURE 9(18)  VALUE ZERO.
025400     02  DNAME24  PICTURE 9(18)  VALUE ZERO.
025500     02  DNAME25  PICTURE 9(18)  VALUE ZERO.
025600     02  DNAME26  PICTURE 9(18)  VALUE ZERO.
025700     02  DNAME27  PICTURE 9(18)  VALUE ZERO.
025800     02  DNAME28  PICTURE 9(18)  VALUE ZERO.
025900     02  DNAME29  PICTURE 9(18)  VALUE ZERO.
026000     02  DNAME30   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026100     02  DNAME31   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026200     02  DNAME32   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026300     02  DNAME33   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026400     02  DNAME34   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026500     02  DNAME35   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026600     02  DNAME36   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026700     02  DNAME37   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026800     02  DNAME38   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
026900     02  DNAME39   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
027000     02  DNAME40   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
027100     02  DNAME41   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
027200     02  DNAME42   PICTURE 9(18)  VALUE ZERO COMPUTATIONAL.
027300 01  TEST-RESULTS.
027400     02 FILLER                   PIC X      VALUE SPACE.
027500     02 FEATURE                  PIC X(20)  VALUE SPACE.
027600     02 FILLER                   PIC X      VALUE SPACE.
027700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
027800     02 FILLER                   PIC X      VALUE SPACE.
027900     02  PAR-NAME.
028000       03 FILLER                 PIC X(19)  VALUE SPACE.
028100       03  PARDOT-X              PIC X      VALUE SPACE.
028200       03 DOTVALUE               PIC 99     VALUE ZERO.
028300     02 FILLER                   PIC X(8)   VALUE SPACE.
028400     02 RE-MARK                  PIC X(61).
028500 01  TEST-COMPUTED.
028600     02 FILLER                   PIC X(30)  VALUE SPACE.
028700     02 FILLER                   PIC X(17)  VALUE
028800            "       COMPUTED=".
028900     02 COMPUTED-X.
029000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
029100     03 COMPUTED-N               REDEFINES COMPUTED-A
029200                                 PIC -9(9).9(9).
029300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
029400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
029500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
029600     03       CM-18V0 REDEFINES COMPUTED-A.
029700         04 COMPUTED-18V0                    PIC -9(18).
029800         04 FILLER                           PIC X.
029900     03 FILLER PIC X(50) VALUE SPACE.
030000 01  TEST-CORRECT.
030100     02 FILLER PIC X(30) VALUE SPACE.
030200     02 FILLER PIC X(17) VALUE "       CORRECT =".
030300     02 CORRECT-X.
030400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
030500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
030600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
030700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
030800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
030900     03      CR-18V0 REDEFINES CORRECT-A.
031000         04 CORRECT-18V0                     PIC -9(18).
031100         04 FILLER                           PIC X.
031200     03 FILLER PIC X(2) VALUE SPACE.
031300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
031400 01  CCVS-C-1.
031500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
031600-    "SS  PARAGRAPH-NAME
031700-    "       REMARKS".
031800     02 FILLER                     PIC X(20)    VALUE SPACE.
031900 01  CCVS-C-2.
032000     02 FILLER                     PIC X        VALUE SPACE.
032100     02 FILLER                     PIC X(6)     VALUE "TESTED".
032200     02 FILLER                     PIC X(15)    VALUE SPACE.
032300     02 FILLER                     PIC X(4)     VALUE "FAIL".
032400     02 FILLER                     PIC X(94)    VALUE SPACE.
032500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
032600 01  REC-CT                        PIC 99       VALUE ZERO.
032700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
032800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
032900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
033000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
033100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
033200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
033300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
033400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
033500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
033600 01  CCVS-H-1.
033700     02  FILLER                    PIC X(39)    VALUE SPACES.
033800     02  FILLER                    PIC X(42)    VALUE
033900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
034000     02  FILLER                    PIC X(39)    VALUE SPACES.
034100 01  CCVS-H-2A.
034200   02  FILLER                        PIC X(40)  VALUE SPACE.
034300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
034400   02  FILLER                        PIC XXXX   VALUE
034500     "4.2 ".
034600   02  FILLER                        PIC X(28)  VALUE
034700            " COPY - NOT FOR DISTRIBUTION".
034800   02  FILLER                        PIC X(41)  VALUE SPACE.
034900
035000 01  CCVS-H-2B.
035100   02  FILLER                        PIC X(15)  VALUE
035200            "TEST RESULT OF ".
035300   02  TEST-ID                       PIC X(9).
035400   02  FILLER                        PIC X(4)   VALUE
035500            " IN ".
035600   02  FILLER                        PIC X(12)  VALUE
035700     " HIGH       ".
035800   02  FILLER                        PIC X(22)  VALUE
035900            " LEVEL VALIDATION FOR ".
036000   02  FILLER                        PIC X(58)  VALUE
036100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
036200 01  CCVS-H-3.
036300     02  FILLER                      PIC X(34)  VALUE
036400            " FOR OFFICIAL USE ONLY    ".
036500     02  FILLER                      PIC X(58)  VALUE
036600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
036700     02  FILLER                      PIC X(28)  VALUE
036800            "  COPYRIGHT   1985 ".
036900 01  CCVS-E-1.
037000     02 FILLER                       PIC X(52)  VALUE SPACE.
037100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
037200     02 ID-AGAIN                     PIC X(9).
037300     02 FILLER                       PIC X(45)  VALUE SPACES.
037400 01  CCVS-E-2.
037500     02  FILLER                      PIC X(31)  VALUE SPACE.
037600     02  FILLER                      PIC X(21)  VALUE SPACE.
037700     02 CCVS-E-2-2.
037800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
037900         03 FILLER                   PIC X      VALUE SPACE.
038000         03 ENDER-DESC               PIC X(44)  VALUE
038100            "ERRORS ENCOUNTERED".
038200 01  CCVS-E-3.
038300     02  FILLER                      PIC X(22)  VALUE
038400            " FOR OFFICIAL USE ONLY".
038500     02  FILLER                      PIC X(12)  VALUE SPACE.
038600     02  FILLER                      PIC X(58)  VALUE
038700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
038800     02  FILLER                      PIC X(13)  VALUE SPACE.
038900     02 FILLER                       PIC X(15)  VALUE
039000             " COPYRIGHT 1985".
039100 01  CCVS-E-4.
039200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
039300     02 FILLER                       PIC X(4)   VALUE " OF ".
039400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
039500     02 FILLER                       PIC X(40)  VALUE
039600      "  TESTS WERE EXECUTED SUCCESSFULLY".
039700 01  XXINFO.
039800     02 FILLER                       PIC X(19)  VALUE
039900            "*** INFORMATION ***".
040000     02 INFO-TEXT.
040100       04 FILLER                     PIC X(8)   VALUE SPACE.
040200       04 XXCOMPUTED                 PIC X(20).
040300       04 FILLER                     PIC X(5)   VALUE SPACE.
040400       04 XXCORRECT                  PIC X(20).
040500     02 INF-ANSI-REFERENCE           PIC X(48).
040600 01  HYPHEN-LINE.
040700     02 FILLER  PIC IS X VALUE IS SPACE.
040800     02 FILLER  PIC IS X(65)    VALUE IS "************************
040900-    "*****************************************".
041000     02 FILLER  PIC IS X(54)    VALUE IS "************************
041100-    "******************************".
041200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
041300     "NC253A".
041400 PROCEDURE DIVISION.
041500 CCVS1 SECTION.
041600 OPEN-FILES.
041700     OPEN     OUTPUT PRINT-FILE.
041800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
041900     MOVE    SPACE TO TEST-RESULTS.
042000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
042100     GO TO CCVS1-EXIT.
042200 CLOSE-FILES.
042300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
042400 TERMINATE-CCVS.
042500S    EXIT PROGRAM.
042600STERMINATE-CALL.
042700     STOP     RUN.
042800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
042900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
043000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
043100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
043200     MOVE "****TEST DELETED****" TO RE-MARK.
043300 PRINT-DETAIL.
043400     IF REC-CT NOT EQUAL TO ZERO
043500             MOVE "." TO PARDOT-X
043600             MOVE REC-CT TO DOTVALUE.
043700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
043800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
043900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
044000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
044100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
044200     MOVE SPACE TO CORRECT-X.
044300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
044400     MOVE     SPACE TO RE-MARK.
044500 HEAD-ROUTINE.
044600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
044900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
045000 COLUMN-NAMES-ROUTINE.
045100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
045200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
045400 END-ROUTINE.
045500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
045600 END-RTN-EXIT.
045700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045800 END-ROUTINE-1.
045900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
046000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
046100      ADD PASS-COUNTER TO ERROR-HOLD.
046200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
046300      MOVE PASS-COUNTER TO CCVS-E-4-1.
046400      MOVE ERROR-HOLD TO CCVS-E-4-2.
046500      MOVE CCVS-E-4 TO CCVS-E-2-2.
046600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
046700  END-ROUTINE-12.
046800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
046900     IF       ERROR-COUNTER IS EQUAL TO ZERO
047000         MOVE "NO " TO ERROR-TOTAL
047100         ELSE
047200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
047300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
047400     PERFORM WRITE-LINE.
047500 END-ROUTINE-13.
047600     IF DELETE-COUNTER IS EQUAL TO ZERO
047700         MOVE "NO " TO ERROR-TOTAL  ELSE
047800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
047900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
048000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
048100      IF   INSPECT-COUNTER EQUAL TO ZERO
048200          MOVE "NO " TO ERROR-TOTAL
048300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
048400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
048500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
048600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
048700 WRITE-LINE.
048800     ADD 1 TO RECORD-COUNT.
048900Y    IF RECORD-COUNT GREATER 50
049000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
049100Y        MOVE SPACE TO DUMMY-RECORD
049200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
049300Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
049400Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
049500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
049600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
049700Y        MOVE ZERO TO RECORD-COUNT.
049800     PERFORM WRT-LN.
049900 WRT-LN.
050000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
050100     MOVE SPACE TO DUMMY-RECORD.
050200 BLANK-LINE-PRINT.
050300     PERFORM WRT-LN.
050400 FAIL-ROUTINE.
050500     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
050600     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
050700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
050800     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
050900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051000     MOVE   SPACES TO INF-ANSI-REFERENCE.
051100     GO TO  FAIL-ROUTINE-EX.
051200 FAIL-ROUTINE-WRITE.
051300     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
051400     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
051500     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
051600     MOVE   SPACES TO COR-ANSI-REFERENCE.
051700 FAIL-ROUTINE-EX. EXIT.
051800 BAIL-OUT.
051900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
052000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
052100 BAIL-OUT-WRITE.
052200     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
052300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
052400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052500     MOVE   SPACES TO INF-ANSI-REFERENCE.
052600 BAIL-OUT-EX. EXIT.
052700 CCVS1-EXIT.
052800     EXIT.
052900*
053000 SECT-NC253A-001 SECTION.
053100 BUILD-TABLE1.
053200     MOVE 06 TO RECORD1 OF TABLE1.
053300     MOVE 01 TO RECORD2 OF TABLE1 (1).
053400     MOVE 02 TO RECORD2 OF TABLE1 (2).
053500     MOVE 07 TO RECORD3 OF TABLE1.
053600 BUILD-TABLE2.
053700     MOVE 08 TO RECORD1 OF TABLE2.
053800     MOVE 03 TO RECORD2 OF TABLE2 (1).
053900     MOVE 04 TO RECORD2 OF TABLE2 (2).
054000     MOVE 09 TO RECORD3 OF TABLE2.
054100*
054200 SUB-INIT-F3-1.
054300     PERFORM END-ROUTINE.
054400     MOVE "SUB-TEST-F3-1" TO PAR-NAME.
054500     MOVE   "VI-134 6.25.4 GR3" TO ANSI-REFERENCE.
054600     MOVE   "SUBTRACT SERIES " TO FEATURE.
054700     MOVE ZERO TO GRP-FOR-ADD-CORR-R.
054800     MOVE   11  TO  ADD-CORR-1 OF GRP-FOR-ADD-CORR-1.
054900     MOVE   22  TO  ADD-CORR-2 OF GRP-FOR-ADD-CORR-1.
055000     MOVE   33  TO  ADD-CORR-3 OF GRP-FOR-ADD-CORR-1.
055100     MOVE   44  TO  ADD-CORR-4 OF GRP-FOR-ADD-CORR-1.
055200     MOVE   55  TO  ADD-CORR-5 OF GRP-FOR-ADD-CORR-1.
055300     MOVE   66  TO  ADD-CORR-6 OF GRP-FOR-ADD-CORR-1.
055400     MOVE   77  TO  ADD-CORR-7 OF GRP-FOR-ADD-CORR-1.
055500     MOVE   88  TO  ADD-CORR-8 OF GRP-FOR-ADD-CORR-1.
055600     MOVE   99  TO  ADD-CORR-9 OF GRP-FOR-ADD-CORR-1.
055700 SUB-TEST-F3-1.
055800     SUBTRACT CORRESPONDING GRP-FOR-ADD-CORR-1 FROM
055900         GRP-FOR-ADD-CORR-R.
056000     IF GRP-FOR-ADD-CORR-R EQUAL TO "11223344506677889900"
056100         PERFORM PASS
056200         GO TO SUB-WRITE-F3-1.
056300     GO TO SUB-FAIL-F3-1.
056400 SUB-DELETE-F3-1.
056500     PERFORM DE-LETE.
056600     GO TO SUB-WRITE-F3-1.
056700 SUB-FAIL-F3-1.
056800     MOVE GRP-FOR-ADD-CORR-R TO COMPUTED-A.
056900     MOVE "11223344506677889900" TO CORRECT-A.
057000     PERFORM FAIL.
057100 SUB-WRITE-F3-1.
057200     PERFORM PRINT-DETAIL.
057300*
057400 SUB-INIT-F3-2.
057500     MOVE "SUB-TEST-F3-2" TO PAR-NAME.
057600     MOVE ZERO TO GRP-FOR-ADD-CORR-R.
057700 SUB-TEST-F3-2.
057800     SUBTRACT CORRESPONDING GRP-ADD-SUB-CORR FROM
057900         GRP-FOR-ADD-CORR-R ROUNDED.
058000     IF GRP-FOR-ADD-CORR-R EQUAL TO "11223344606677889900"
058100         PERFORM PASS
058200         GO TO SUB-WRITE-F3-2.
058300     GO TO SUB-FAIL-F3-2.
058400 SUB-DELETE-F3-2.
058500     PERFORM DE-LETE.
058600     GO TO SUB-WRITE-F3-2.
058700 SUB-FAIL-F3-2.
058800     MOVE GRP-FOR-ADD-CORR-R TO COMPUTED-A.
058900     MOVE "11223344606677889900" TO CORRECT-A.
059000     PERFORM FAIL.
059100 SUB-WRITE-F3-2.
059200     PERFORM PRINT-DETAIL.
059300*
059400 SUB-INIT-F3-3.
059500     MOVE  1      TO SUBTR-13 OF SUBTR-12.
059600     MOVE -1.725  TO SUBTR-14 OF SUBTR-12.
059700     MOVE 76.76   TO SUBTR-15 OF SUBTR-12.
059800     MOVE  2      TO SUBTR-13 OF SUBTR-16.
059900     MOVE  0.23   TO SUBTR-14 OF SUBTR-16.
060000     MOVE  1      TO SUBTR-15 OF SUBTR-16.
060100 SUB-INIT-F3-3-1.
060200     MOVE "SUB-TEST-F3-3-1" TO PAR-NAME.
060300     MOVE SPACE TO WRK-AN-00001.
060400 SUB-TEST-F3-3-1.
060500     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED ON
060600     SIZE ERROR
060700           MOVE "G" TO WRK-AN-00001.
060800     IF WRK-AN-00001 EQUAL TO "G"
060900           PERFORM PASS
061000           GO TO SUB-WRITE-F3-3-1.
061100     GO TO SUB-FAIL-F3-3-1.
061200 SUB-DELETE-F3-3-1.
061300     PERFORM DE-LETE.
061400     GO TO SUB-WRITE-F3-3-1.
061500 SUB-FAIL-F3-3-1.
061600     PERFORM FAIL.
061700     MOVE "ON SIZE ERROR SHOULD BE EXECUTED" TO RE-MARK.
061800 SUB-WRITE-F3-3-1.
061900     PERFORM PRINT-DETAIL.
062000*
062100 SUB-INIT-F3-3-2.
062200     MOVE "SUB-TEST-F3-3-2" TO PAR-NAME.
062300 SUB-TEST-F3-3-2.
062400     IF SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
062500             GO TO SUB-FAIL-F3-3-2.
062600     PERFORM PASS.
062700     GO TO SUB-WRITE-F3-3-2.
062800 SUB-DELETE-F3-3-2.
062900     PERFORM DE-LETE.
063000     GO TO SUB-WRITE-F3-3-2.
063100 SUB-FAIL-F3-3-2.
063200     PERFORM FAIL.
063300     MOVE SUBTR-13 OF SUBTR-16 TO COMPUTED-N.
063400     MOVE "+1" TO CORRECT-A.
063500     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
063600        TO RE-MARK.
063700 SUB-WRITE-F3-3-2.
063800     PERFORM PRINT-DETAIL.
063900*
064000 SUB-INIT-F3-3-3.
064100     MOVE "SUB-TEST-F3-3-3" TO PAR-NAME.
064200 SUB-TEST-F3-3-3.
064300     IF SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
064400             GO TO SUB-FAIL-F3-3-3.
064500     PERFORM PASS.
064600     GO TO SUB-WRITE-F3-3-3.
064700 SUB-DELETE-F3-3-3.
064800     PERFORM DE-LETE.
064900     GO TO SUB-WRITE-F3-3-3.
065000 SUB-FAIL-F3-3-3.
065100     PERFORM FAIL.
065200     MOVE SUBTR-14 OF SUBTR-16 TO COMPUTED-N.
065300     MOVE "+1.96" TO CORRECT-A.
065400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
065500        TO RE-MARK.
065600 SUB-WRITE-F3-3-3.
065700     PERFORM PRINT-DETAIL.
065800*
065900 SUB-INIT-3-3-4.
066000     MOVE "SUB-TEST-3-3-4" TO PAR-NAME.
066100 SUB-TEST-3-3-4.
066200     IF SUBTR-15 OF SUBTR-16 NOT EQUAL TO 1
066300            GO TO SUB-FAIL-3-3-4.
066400     PERFORM PASS
066500     GO TO SUB-WRITE-3-3-4.
066600 SUB-DELETE-3-3-4.
066700     PERFORM DE-LETE.
066800     GO TO SUB-WRITE-3-3-4.
066900 SUB-FAIL-3-3-4.
067000     PERFORM FAIL.
067100     MOVE SUBTR-15 OF SUBTR-16 TO COMPUTED-N.
067200     MOVE "+1" TO CORRECT-A.
067300     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK.
067400 SUB-WRITE-3-3-4.
067500     PERFORM PRINT-DETAIL.
067600*
067700 SUB-INIT-F3-4.
067800     MOVE "SUB-TEST-F3-4" TO PAR-NAME.
067900     MOVE "050506060000" TO CORR-DATA-2.
068000     MOVE "999999999999" TO CORR-DATA-3.
068100 SUB-TEST-F3-4.
068200     SUBTRACT CORRESPONDING CORR-DATA-2 FROM CORR-DATA-3.
068300     IF CORR-DATA-3 EQUAL TO "939399999494"
068400         PERFORM PASS
068500         GO TO SUB-WRITE-F3-4.
068600     GO TO SUB-FAIL-F3-4.
068700 SUB-DELETE-F3-4.
068800     PERFORM DE-LETE.
068900     GO TO SUB-WRITE-F3-4.
069000 SUB-FAIL-F3-4.
069100     MOVE 939399999494 TO CORRECT-A.
069200     MOVE CORR-DATA-3 TO COMPUTED-A.
069300     PERFORM FAIL.
069400 SUB-WRITE-F3-4.
069500     PERFORM PRINT-DETAIL.
069600*
069700 SUB-INIT-F3-5.
069800     MOVE "SUB-TEST-F3-5" TO PAR-NAME.
069900     MOVE 999955995511 TO CORR-DATA-1.
070000     MOVE 123456107890 TO CORR-DATA-6.
070100 SUB-TEST-F3-5.
070200     SUBTRACT CORRESPONDING CORR-DATA-6 FROM CORR-DATA-1.
070300     IF CORR-DATA-1 EQUAL TO "892155995511"
070400         PERFORM PASS
070500         GO TO SUB-WRITE-F3-5.
070600     GO TO SUB-FAIL-F3-5.
070700 SUB-DELETE-F3-5.
070800     PERFORM DE-LETE.
070900     GO TO SUB-WRITE-F3-5.
071000 SUB-FAIL-F3-5.
071100     MOVE 892155995511 TO CORRECT-A.
071200     MOVE CORR-DATA-1 TO COMPUTED-A.
071300     PERFORM FAIL.
071400 SUB-WRITE-F3-5.
071500     PERFORM PRINT-DETAIL.
071600*
071700 SUB-INIT-F3-6.
071800     MOVE "555555000055" TO CORR-DATA-6.
071900     MOVE "SUB-TEST-F3-6" TO PAR-NAME.
072000 SUB-TEST-F3-6.
072100     SUBTRACT CORRESPONDING CORR-DATA-6 FROM CORR-DATA-1
072200     IF CORR-DATA-1 EQUAL TO 892155995511
072300         PERFORM PASS
072400         GO TO SUB-WRITE-F3-6.
072500     GO TO SUB-FAIL-F3-6.
072600 SUB-DELETE-F3-6.
072700     PERFORM DE-LETE.
072800     GO TO SUB-WRITE-F3-6.
072900 SUB-FAIL-F3-6.
073000     MOVE 892155995511 TO CORRECT-A.
073100     MOVE CORR-DATA-1 TO COMPUTED-A.
073200     PERFORM FAIL.
073300 SUB-WRITE-F3-6.
073400     PERFORM PRINT-DETAIL.
073500*
073600 SUB-INIT-F3-7.
073700     MOVE "SUB-TEST-F3-7" TO PAR-NAME.
073800     MOVE 99999999999999 TO CORR-DATA-5.
073900     MOVE 111111111111 TO CORR-DATA-1.
074000 SUB-TEST-F3-7.
074100     SUBTRACT CORRESPONDING CORR-DATA-1 FROM CORR-DATA-5.
074200     IF CORR-DATA-5 EQUAL TO "88889999999999"
074300         PERFORM PASS
074400         GO TO SUB-WRITE-F3-7.
074500     GO TO SUB-FAIL-F3-7.
074600 SUB-DELETE-F3-7.
074700     PERFORM DE-LETE.
074800     GO TO SUB-WRITE-F3-7.
074900 SUB-FAIL-F3-7.
075000     PERFORM FAIL.
075100     MOVE CORR-DATA-5 TO COMPUTED-A.
075200     MOVE "88889999999999" TO CORRECT-A.
075300 SUB-WRITE-F3-7.
075400     PERFORM PRINT-DETAIL.
075500*
075600 SUB-INIT-F3-8.
075700     MOVE   "SUB-TEST-F3-8" TO PAR-NAME.
075800     MOVE   "VI-134 6.25.4 GR3" TO ANSI-REFERENCE.
075900     PERFORM BUILD-TABLE1.
076000     PERFORM BUILD-TABLE2.
076100 SUB-TEST-F3-8-0.
076200     SUBTRACT CORRESPONDING TABLE1 FROM TABLE2.
076300 SUB-TEST-F3-8-1.
076400     IF      RECORD1 OF TABLE2 = 02
076500         AND RECORD2 OF TABLE2 (1) = 03
076600         AND RECORD2 OF TABLE2 (2) = 04
076700         AND RECORD3 OF TABLE2 = 02
076800             PERFORM PASS
076900             GO TO  SUB-WRITE-F3-8.
077000     GO TO   SUB-FAIL-F3-8.
077100 SUB-DELETE-F3-8.
077200     PERFORM DE-LETE.
077300     GO TO   SUB-WRITE-F3-8.
077400 SUB-FAIL-F3-8.
077500     PERFORM FAIL.
077600     MOVE    TABLE2 TO COMPUTED-A.
077700     MOVE  "02030402" TO CORRECT-A.
077800 SUB-WRITE-F3-8.
077900     PERFORM PRINT-DETAIL.
078000*
078100 SUB-INIT-F3-9.
078200*    ===-->  NO SIZE ERROR  <--===
078300     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
078400     MOVE    SPACE  TO WRK-AN-00001.
078500     MOVE    0      TO REC-CT.
078600     MOVE    1      TO SUBTR-13 OF SUBTR-12.
078700     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
078800     MOVE    6.76   TO SUBTR-15 OF SUBTR-12.
078900     MOVE    2      TO SUBTR-13 OF SUBTR-16.
079000     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
079100     MOVE    1      TO SUBTR-15 OF SUBTR-16.
079200 SUB-TEST-F3-9-0.
079300     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
079400             ON SIZE ERROR
079500             MOVE   "G" TO WRK-AN-00001.
079600*
079700 SUB-INIT-F3-9-1.
079800     MOVE   "SUB-TEST-F3-9-1" TO PAR-NAME.
079900     ADD     1 TO REC-CT.
080000 SUB-TEST-F3-9-1.
080100     IF      WRK-AN-00001    NOT = SPACE
080200             GO TO SUB-FAIL-F3-9-1.
080300     PERFORM PASS
080400     GO TO SUB-WRITE-F3-9-1.
080500 SUB-DELETE-F3-9-1.
080600     PERFORM DE-LETE.
080700     GO TO SUB-WRITE-F3-9-1.
080800 SUB-FAIL-F3-9-1.
080900     MOVE   "SUBTRACT CORRESPONDING FAILED"
081000          TO RE-MARK
081100     MOVE    WRK-AN-00001  TO COMPUTED-X
081200     MOVE    SPACE TO CORRECT-X
081300     PERFORM FAIL.
081400 SUB-WRITE-F3-9-1.
081500     PERFORM PRINT-DETAIL.
081600*
081700 SUB-INIT-F3-9-2.
081800     MOVE  "SUB-TEST-F3-9-2" TO PAR-NAME.
081900     ADD    1 TO REC-CT.
082000 SUB-TEST-F3-9-2.
082100     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
082200            GO TO SUB-FAIL-F3-9-2.
082300     PERFORM PASS
082400     GO TO SUB-WRITE-F3-9-2.
082500 SUB-DELETE-F3-9-2.
082600     PERFORM DE-LETE.
082700     GO TO SUB-WRITE-F3-9-2.
082800 SUB-FAIL-F3-9-2.
082900     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
083000     MOVE   "+1" TO CORRECT-A
083100     MOVE "SUBTRACT CORRESPONDING FAILED"
083200           TO RE-MARK
083300     PERFORM FAIL.
083400 SUB-WRITE-F3-9-2.
083500     PERFORM PRINT-DETAIL.
083600*
083700 SUB-INIT-F3-9-3.
083800     MOVE  "SUB-TEST-F3-9-3" TO PAR-NAME.
083900     ADD    1 TO REC-CT.
084000 SUB-TEST-F3-9-3.
084100     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
084200            GO TO SUB-FAIL-F3-9-3.
084300     PERFORM PASS
084400     GO TO SUB-WRITE-F3-9-3.
084500 SUB-DELETE-F3-9-3.
084600     PERFORM DE-LETE.
084700     GO TO SUB-WRITE-F3-9-3.
084800 SUB-FAIL-F3-9-3.
084900     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
085000     MOVE   "+1.96" TO CORRECT-A
085100     MOVE "SUBTRACT CORRESPONDING FAILED"
085200          TO RE-MARK
085300     PERFORM FAIL.
085400 SUB-WRITE-F3-9-3.
085500     PERFORM PRINT-DETAIL.
085600*
085700 SUB-INIT-F3-9-4.
085800     MOVE  "SUB-TEST-F3-9-4" TO PAR-NAME.
085900     ADD    1 TO REC-CT.
086000 SUB-TEST-F3-9-4.
086100     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO -5.76
086200            GO TO SUB-FAIL-F3-9-4.
086300     PERFORM PASS
086400     GO TO SUB-WRITE-F3-9-4.
086500 SUB-DELETE-F3-9-4.
086600     PERFORM DE-LETE.
086700     GO TO SUB-WRITE-F3-9-4.
086800 SUB-FAIL-F3-9-4.
086900     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
087000     MOVE   "-5.76" TO CORRECT-A
087100     MOVE "SUBRACT CORRESPONDING FAILED"
087200          TO RE-MARK
087300     PERFORM FAIL.
087400 SUB-WRITE-F3-9-4.
087500     PERFORM PRINT-DETAIL.
087600*
087700 SUB-INIT-F3-10.
087800*    ===-->  NEW SIZE ERROR TESTS  <--===
087900*    ===-->      SIZE ERROR        <--===
088000     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
088100     MOVE    SPACE  TO WRK-AN-00001.
088200     MOVE    0      TO REC-CT.
088300     MOVE    1      TO SUBTR-13 OF SUBTR-12.
088400     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
088500     MOVE   76.76   TO SUBTR-15 OF SUBTR-12.
088600     MOVE    2      TO SUBTR-13 OF SUBTR-16.
088700     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
088800     MOVE    1      TO SUBTR-15 OF SUBTR-16.
088900 SUB-TEST-F3-10-0.
089000     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
089100         NOT ON SIZE ERROR
089200             MOVE   "G" TO WRK-AN-00001.
089300*
089400 SUB-INIT-F3-10-1.
089500     MOVE   "SUB-TEST-F3-10-1" TO PAR-NAME.
089600     ADD     1 TO REC-CT.
089700 SUB-TEST-F3-10-1.
089800     IF      WRK-AN-00001 EQUAL TO "G"
089900             GO TO SUB-FAIL-F3-10-1.
090000     PERFORM PASS
090100     GO TO SUB-WRITE-F3-10-1.
090200 SUB-DELETE-F3-10-1.
090300     PERFORM DE-LETE.
090400     GO TO SUB-WRITE-F3-10-1.
090500 SUB-FAIL-F3-10-1.
090600     MOVE   "NOT ON SIZE ERROR SHOULD NOT BE EXECUTED"
090700          TO RE-MARK
090800     MOVE    WRK-AN-00001  TO COMPUTED-X
090900     MOVE    SPACE TO CORRECT-X
091000     PERFORM FAIL.
091100 SUB-WRITE-F3-10-1.
091200     PERFORM PRINT-DETAIL.
091300*
091400 SUB-INIT-F3-10-2.
091500     MOVE  "SUB-TEST-F3-10-2" TO PAR-NAME.
091600     ADD    1 TO REC-CT.
091700 SUB-TEST-F3-10-2.
091800     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
091900            GO TO SUB-FAIL-F3-10-2.
092000     PERFORM PASS
092100     GO TO SUB-WRITE-F3-10-2.
092200 SUB-DELETE-F3-10-2.
092300     PERFORM DE-LETE.
092400     GO TO SUB-WRITE-F3-10-2.
092500 SUB-FAIL-F3-10-2.
092600     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
092700     MOVE   "+1" TO CORRECT-A
092800     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
092900          TO RE-MARK
093000     PERFORM FAIL.
093100 SUB-WRITE-F3-10-2.
093200     PERFORM PRINT-DETAIL.
093300*
093400 SUB-INIT-F3-10-3.
093500     MOVE  "SUB-TEST-F3-10-3" TO PAR-NAME.
093600     ADD    1 TO REC-CT.
093700 SUB-TEST-F3-10-3.
093800     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
093900            GO TO SUB-FAIL-F3-10-3.
094000     PERFORM PASS
094100     GO TO SUB-WRITE-F3-10-3.
094200 SUB-DELETE-F3-10-3.
094300     PERFORM DE-LETE.
094400     GO TO SUB-WRITE-F3-10-3.
094500 SUB-FAIL-F3-10-3.
094600     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
094700     MOVE   "+1.96" TO CORRECT-A
094800     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
094900          TO RE-MARK
095000     PERFORM FAIL.
095100 SUB-WRITE-F3-10-3.
095200     PERFORM PRINT-DETAIL.
095300*
095400 SUB-INIT-F3-10-4.
095500     MOVE  "SUB-TEST-F3-10-4" TO PAR-NAME.
095600     ADD    1 TO REC-CT.
095700 SUB-TEST-F3-10-4.
095800     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO 1
095900            GO TO SUB-FAIL-F3-10-4.
096000     PERFORM PASS
096100     GO TO SUB-WRITE-F3-10-4.
096200 SUB-DELETE-F3-10-4.
096300     PERFORM DE-LETE.
096400     GO TO SUB-WRITE-F3-10-4.
096500 SUB-FAIL-F3-10-4.
096600     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
096700     MOVE   "+1" TO CORRECT-A
096800     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
096900     PERFORM FAIL.
097000 SUB-WRITE-F3-10-4.
097100     PERFORM PRINT-DETAIL.
097200*
097300 SUB-INIT-F3-11.
097400*    ===-->  NEW SIZE ERROR TESTS  <--===
097500*    ===-->   NO SIZE ERROR        <--===
097600     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
097700     MOVE    SPACE  TO WRK-AN-00001.
097800     MOVE    0      TO REC-CT.
097900     MOVE    1      TO SUBTR-13 OF SUBTR-12.
098000     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
098100     MOVE    6.76   TO SUBTR-15 OF SUBTR-12.
098200     MOVE    2      TO SUBTR-13 OF SUBTR-16.
098300     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
098400     MOVE    1      TO SUBTR-15 OF SUBTR-16.
098500 SUB-TEST-F3-11-0.
098600     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
098700         NOT ON SIZE ERROR
098800             MOVE   "G" TO WRK-AN-00001.
098900*
099000 SUB-INIT-F3-11-1.
099100     MOVE   "SUB-TEST-F3-11-1" TO PAR-NAME.
099200     ADD     1 TO REC-CT.
099300 SUB-TEST-F3-11-1.
099400     IF      WRK-AN-00001 EQUAL TO SPACE
099500             GO TO SUB-FAIL-F3-11-1.
099600     PERFORM PASS
099700     GO TO SUB-WRITE-F3-11-1.
099800 SUB-DELETE-F3-11-1.
099900     PERFORM DE-LETE.
100000     GO TO SUB-WRITE-F3-11-1.
100100 SUB-FAIL-F3-11-1.
100200     MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
100300           TO RE-MARK
100400     MOVE    WRK-AN-00001  TO COMPUTED-X
100500     MOVE   "G"    TO CORRECT-X
100600     PERFORM FAIL.
100700 SUB-WRITE-F3-11-1.
100800     PERFORM PRINT-DETAIL.
100900*
101000 SUB-INIT-F3-11-2.
101100     MOVE  "SUB-TEST-F3-11-1" TO PAR-NAME.
101200     ADD    1 TO REC-CT.
101300 SUB-TEST-F3-11-2.
101400     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
101500            GO TO SUB-FAIL-F3-11-2.
101600     PERFORM PASS
101700     GO TO SUB-WRITE-F3-11-2.
101800 SUB-DELETE-F3-11-2.
101900     PERFORM DE-LETE.
102000     GO TO SUB-WRITE-F3-11-2.
102100 SUB-FAIL-F3-11-2.
102200     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
102300     MOVE   "+1" TO CORRECT-A
102400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
102500          TO RE-MARK
102600     PERFORM FAIL.
102700 SUB-WRITE-F3-11-2.
102800     PERFORM PRINT-DETAIL.
102900*
103000 SUB-INIT-F3-11-3.
103100     MOVE  "SUB-TEST-F3-11-3" TO PAR-NAME.
103200     ADD    1 TO REC-CT.
103300 SUB-TEST-F3-11-3.
103400     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
103500            GO TO SUB-FAIL-F3-11-3.
103600     PERFORM PASS
103700     GO TO SUB-WRITE-F3-11-3.
103800 SUB-DELETE-F3-11-3.
103900     PERFORM DE-LETE.
104000     GO TO SUB-WRITE-F3-11-3.
104100 SUB-FAIL-F3-11-3.
104200     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
104300     MOVE   "+1.96" TO CORRECT-A
104400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
104500          TO RE-MARK
104600     PERFORM FAIL.
104700 SUB-WRITE-F3-11-3.
104800     PERFORM PRINT-DETAIL.
104900*
105000 SUB-INIT-F3-11-4.
105100     MOVE  "SUB-TEST-F3-11-4" TO PAR-NAME.
105200     ADD    1 TO REC-CT.
105300 SUB-TEST-F3-11-4.
105400     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO -5.76
105500            GO TO SUB-FAIL-F3-11-4.
105600     PERFORM PASS
105700     GO TO SUB-WRITE-F3-11-4.
105800 SUB-DELETE-F3-11-4.
105900     PERFORM DE-LETE.
106000     GO TO SUB-WRITE-F3-11-4.
106100 SUB-FAIL-F3-11-4.
106200     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
106300     MOVE   "-5.76" TO CORRECT-A
106400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
106500          TO RE-MARK
106600     PERFORM FAIL.
106700 SUB-WRITE-F3-11-4.
106800     PERFORM PRINT-DETAIL.
106900*
107000 SUB-INIT-F3-12.
107100*    ===-->  NEW SIZE ERROR TESTS  <--===
107200*    ===-->      SIZE ERROR        <--===
107300     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
107400     MOVE    SPACE  TO WRK-AN-00001.
107500     MOVE    0      TO REC-CT.
107600     MOVE    1      TO SUBTR-13 OF SUBTR-12.
107700     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
107800     MOVE   76.76   TO SUBTR-15 OF SUBTR-12.
107900     MOVE    2      TO SUBTR-13 OF SUBTR-16.
108000     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
108100     MOVE    1      TO SUBTR-15 OF SUBTR-16.
108200 SUB-TEST-F3-12-0.
108300     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
108400             ON SIZE ERROR
108500             MOVE   "A" TO WRK-AN-00001
108600         NOT ON SIZE ERROR
108700             MOVE   "B" TO WRK-AN-00001.
108800*
108900 SUB-INIT-F3-12-1.
109000     MOVE   "SUB-TEST-F3-12-1" TO PAR-NAME.
109100     ADD     1 TO REC-CT.
109200 SUB-TEST-F3-12-1.
109300     IF      WRK-AN-00001    NOT = "A"
109400             GO TO SUB-FAIL-F3-12-1.
109500     PERFORM PASS
109600     GO TO SUB-WRITE-F3-12-1.
109700 SUB-DELETE-F3-12-1.
109800     PERFORM DE-LETE.
109900     GO TO SUB-WRITE-F3-12-1.
110000 SUB-FAIL-F3-12-1.
110100     MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
110200          TO RE-MARK
110300     MOVE    WRK-AN-00001  TO COMPUTED-X
110400     MOVE   "A"    TO CORRECT-X
110500     PERFORM FAIL.
110600 SUB-WRITE-F3-12-1.
110700     PERFORM PRINT-DETAIL.
110800*
110900 SUB-INIT-F3-12-2.
111000     MOVE  "SUB-TEST-F3-12-2" TO PAR-NAME.
111100     ADD    1 TO REC-CT.
111200 SUB-TEST-F3-12-2.
111300     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
111400            GO TO SUB-FAIL-F3-12-2.
111500     PERFORM PASS
111600     GO TO SUB-WRITE-F3-12-2.
111700 SUB-DELETE-F3-12-2.
111800     PERFORM DE-LETE.
111900     GO TO SUB-WRITE-F3-12-2.
112000 SUB-FAIL-F3-12-2.
112100     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
112200     MOVE   "+1" TO CORRECT-A
112300     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
112400          TO RE-MARK
112500     PERFORM FAIL.
112600 SUB-WRITE-F3-12-2.
112700     PERFORM PRINT-DETAIL.
112800*
112900 SUB-INIT-F3-12-3.
113000     MOVE  "SUB-TEST-F3-12-3" TO PAR-NAME.
113100     ADD    1 TO REC-CT.
113200 SUB-TEST-F3-12-3.
113300     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
113400            GO TO SUB-FAIL-F3-12-3.
113500     PERFORM PASS
113600     GO TO SUB-WRITE-F3-12-3.
113700 SUB-DELETE-F3-12-3.
113800     PERFORM DE-LETE.
113900     GO TO SUB-WRITE-F3-12-3.
114000 SUB-FAIL-F3-12-3.
114100     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
114200     MOVE   "+1.96" TO CORRECT-A
114300     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
114400          TO RE-MARK
114500     PERFORM FAIL.
114600 SUB-WRITE-F3-12-3.
114700     PERFORM PRINT-DETAIL.
114800*
114900 SUB-INIT-F3-12-4.
115000     MOVE  "SUB-TEST-F3-12-4" TO PAR-NAME.
115100     ADD    1 TO REC-CT.
115200 SUB-TEST-F3-12-4.
115300     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO 1
115400            GO TO SUB-FAIL-F3-12-4.
115500     PERFORM PASS
115600     GO TO SUB-WRITE-F3-12-4.
115700 SUB-DELETE-F3-12-4.
115800     PERFORM DE-LETE.
115900     GO TO SUB-WRITE-F3-12-4.
116000 SUB-FAIL-F3-12-4.
116100     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
116200     MOVE   "+1" TO CORRECT-A
116300     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
116400     PERFORM FAIL.
116500 SUB-WRITE-F3-12-4.
116600     PERFORM PRINT-DETAIL.
116700*
116800 SUB-INIT-F3-13.
116900*    ===-->  NEW SIZE ERROR TESTS  <--===
117000*    ===-->   NO SIZE ERROR        <--===
117100     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
117200     MOVE    SPACE  TO WRK-AN-00001.
117300     MOVE    0      TO REC-CT.
117400     MOVE    1      TO SUBTR-13 OF SUBTR-12.
117500     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
117600     MOVE    6.76   TO SUBTR-15 OF SUBTR-12.
117700     MOVE    2      TO SUBTR-13 OF SUBTR-16.
117800     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
117900     MOVE    1      TO SUBTR-15 OF SUBTR-16.
118000 SUB-TEST-F3-13-0.
118100     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
118200             ON SIZE ERROR
118300             MOVE   "A" TO WRK-AN-00001
118400         NOT ON SIZE ERROR
118500             MOVE   "B" TO WRK-AN-00001.
118600*
118700 SUB-INIT-F3-13-1.
118800     MOVE   "SUB-TEST-F3-13-1" TO PAR-NAME.
118900     ADD     1 TO REC-CT.
119000 SUB-TEST-F3-13-1.
119100     IF      WRK-AN-00001    NOT = "B"
119200             GO TO SUB-FAIL-F3-13-1.
119300     PERFORM PASS
119400     GO TO SUB-WRITE-F3-13-1.
119500 SUB-DELETE-F3-13-1.
119600     PERFORM DE-LETE.
119700     GO TO SUB-WRITE-F3-13-1.
119800 SUB-FAIL-F3-13-1.
119900     MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
120000           TO RE-MARK
120100     MOVE    WRK-AN-00001  TO COMPUTED-X
120200     MOVE   "B"    TO CORRECT-X
120300     PERFORM FAIL.
120400 SUB-WRITE-F3-13-1.
120500     PERFORM PRINT-DETAIL.
120600*
120700 SUB-INIT-F3-13-2.
120800     MOVE  "SUB-TEST-F3-13-2" TO PAR-NAME.
120900     ADD    1 TO REC-CT.
121000 SUB-TEST-F3-13-2.
121100     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
121200            GO TO SUB-FAIL-F3-13-2.
121300     PERFORM PASS
121400     GO TO SUB-WRITE-F3-13-2.
121500 SUB-DELETE-F3-13-2.
121600     PERFORM DE-LETE.
121700     GO TO SUB-WRITE-F3-13-2.
121800 SUB-FAIL-F3-13-2.
121900            MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
122000            MOVE   "+1" TO CORRECT-A
122100            MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
122200                 TO RE-MARK
122300            PERFORM FAIL.
122400 SUB-WRITE-F3-13-2.
122500            PERFORM PRINT-DETAIL.
122600*
122700 SUB-INIT-F3-13-3.
122800     MOVE  "SUB-TEST-F3-13-3" TO PAR-NAME.
122900     ADD    1 TO REC-CT.
123000 SUB-TEST-F3-13-3.
123100     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
123200            GO TO SUB-FAIL-F3-13-3.
123300     PERFORM PASS
123400     GO TO SUB-WRITE-F3-13-3.
123500 SUB-DELETE-F3-13-3.
123600     PERFORM DE-LETE.
123700     GO TO SUB-WRITE-F3-13-3.
123800 SUB-FAIL-F3-13-3.
123900     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
124000     MOVE   "+1.96" TO CORRECT-A
124100     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
124200          TO RE-MARK
124300     PERFORM FAIL.
124400 SUB-WRITE-F3-13-3.
124500     PERFORM PRINT-DETAIL.
124600*
124700 SUB-INIT-F3-13-4.
124800     MOVE  "SUB-TEST-F3-13-4" TO PAR-NAME.
124900     ADD    1 TO REC-CT.
125000 SUB-TEST-F3-13-4.
125100     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO -5.76
125200            GO TO SUB-FAIL-F3-13-4.
125300     PERFORM PASS
125400     GO TO SUB-WRITE-F3-13-4.
125500 SUB-FAIL-F3-13-4.
125600     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
125700     MOVE   "-5.76" TO CORRECT-A
125800     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
125900        TO RE-MARK
126000     PERFORM FAIL.
126100 SUB-WRITE-F3-13-4.
126200     PERFORM PRINT-DETAIL.
126300*
126400 SUB-INIT-F3-14.
126500*    ===-->  NEW SIZE ERROR TESTS  <--===
126600*    ===-->      SIZE ERROR        <--===
126700     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
126800     MOVE    SPACE  TO WRK-AN-00001.
126900     MOVE    SPACE  TO WRK-XN-00001.
127000     MOVE    0      TO REC-CT.
127100     MOVE    1      TO SUBTR-13 OF SUBTR-12.
127200     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
127300     MOVE   76.76   TO SUBTR-15 OF SUBTR-12.
127400     MOVE    2      TO SUBTR-13 OF SUBTR-16.
127500     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
127600     MOVE    1      TO SUBTR-15 OF SUBTR-16.
127700 SUB-TEST-F3-14-0.
127800     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
127900             ON SIZE ERROR
128000             MOVE   "A" TO WRK-AN-00001
128100     END-SUBTRACT
128200     MOVE   "Z"  TO WRK-XN-00001.
128300*
128400 SUB-INIT-F3-14-1.
128500     MOVE   "SUB-TEST-F3-14-1" TO PAR-NAME.
128600     ADD     1 TO REC-CT.
128700 SUB-TEST-F3-14-1.
128800     IF      WRK-AN-00001    NOT = "A"
128900             GO TO SUB-FAIL-F3-14-1.
129000     PERFORM PASS
129100     GO TO SUB-WRITE-F3-14-1.
129200 SUB-DELETE-F3-14-1.
129300     PERFORM DE-LETE.
129400     GO TO SUB-WRITE-F3-14-1.
129500 SUB-FAIL-F3-14-1.
129600     MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
129700          TO RE-MARK
129800     MOVE    WRK-AN-00001  TO COMPUTED-X
129900     MOVE   "A"    TO CORRECT-X
130000     PERFORM FAIL.
130100 SUB-WRITE-F3-14-1.
130200     PERFORM PRINT-DETAIL.
130300*
130400 SUB-INIT-F3-14-2.
130500     MOVE  "SUB-TEST-F3-14-2" TO PAR-NAME.
130600     ADD    1 TO REC-CT.
130700 SUB-TEST-F3-14-2.
130800     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
130900            GO TO SUB-FAIL-F3-14-2.
131000     PERFORM PASS
131100     GO TO SUB-WRITE-F3-14-2.
131200 SUB-DELETE-F3-14-2.
131300     PERFORM DE-LETE.
131400     GO TO SUB-WRITE-F3-14-2.
131500 SUB-FAIL-F3-14-2.
131600     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
131700     MOVE   "+1" TO CORRECT-A
131800     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
131900          TO RE-MARK
132000     PERFORM FAIL.
132100 SUB-WRITE-F3-14-2.
132200     PERFORM PRINT-DETAIL.
132300*
132400 SUB-INIT-F3-14-3.
132500     MOVE  "SUB-TEST-F3-14-3" TO PAR-NAME.
132600     ADD    1 TO REC-CT.
132700 SUB-TEST-F3-14-3.
132800     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
132900            GO TO SUB-FAIL-F3-14-3.
133000     PERFORM PASS
133100     GO TO SUB-WRITE-F3-14-3.
133200 SUB-DELETE-F3-14-3.
133300     PERFORM DE-LETE.
133400     GO TO SUB-WRITE-F3-14-3.
133500 SUB-FAIL-F3-14-3.
133600     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
133700     MOVE   "+1.96" TO CORRECT-A
133800     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
133900          TO RE-MARK
134000     PERFORM FAIL.
134100 SUB-WRITE-F3-14-3.
134200     PERFORM PRINT-DETAIL.
134300*
134400 SUB-INIT-F3-14-4.
134500     MOVE  "SUB-TEST-F3-14-4" TO PAR-NAME.
134600     ADD     1 TO REC-CT.
134700 SUB-TEST-F3-14-4.
134800     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO 1
134900            GO TO SUB-FAIL-F3-14-4.
135000     PERFORM PASS
135100     GO TO SUB-WRITE-F3-14-4.
135200 SUB-DELETE-F3-14-4.
135300     PERFORM DE-LETE.
135400     GO TO SUB-WRITE-F3-14-4.
135500 SUB-FAIL-F3-14-4.
135600     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
135700     MOVE   "+1" TO CORRECT-A
135800     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
135900     PERFORM FAIL.
136000 SUB-WRITE-F3-14-4.
136100     PERFORM PRINT-DETAIL.
136200*
136300 SUB-INIT-F3-14-5.
136400     MOVE   "SUB-TEST-F3-14-5" TO PAR-NAME.
136500     ADD     1 TO REC-CT.
136600 SUB-TEST-F3-14-5.
136700     IF      WRK-XN-00001 NOT = "Z"
136800             GO TO SUB-FAIL-F3-14-5.
136900     PERFORM PASS
137000     GO TO SUB-WRITE-F3-14-5.
137100 SUB-DELETE-F3-14-5.
137200     PERFORM DE-LETE.
137300     GO TO SUB-WRITE-F3-14-5.
137400 SUB-FAIL-F3-14-5.
137500     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
137600     MOVE   "Z"   TO COMPUTED-X
137700     MOVE    WRK-AN-00001 TO CORRECT-X
137800     PERFORM FAIL.
137900 SUB-WRITE-F3-14-5.
138000     PERFORM PRINT-DETAIL.
138100*
138200 SUB-INIT-F3-15.
138300*    ===-->  NEW SIZE ERROR TESTS  <--===
138400*    ===-->   NO SIZE ERROR        <--===
138500     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
138600     MOVE    SPACE  TO WRK-AN-00001.
138700     MOVE    SPACE  TO WRK-XN-00001.
138800     MOVE    0      TO REC-CT.
138900     MOVE    1      TO SUBTR-13 OF SUBTR-12.
139000     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
139100     MOVE    6.76   TO SUBTR-15 OF SUBTR-12.
139200     MOVE    2      TO SUBTR-13 OF SUBTR-16.
139300     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
139400     MOVE    1      TO SUBTR-15 OF SUBTR-16.
139500 SUB-TEST-F3-15-0.
139600     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
139700             ON SIZE ERROR
139800             MOVE   "A" TO WRK-AN-00001
139900     END-SUBTRACT
140000     MOVE   "Z"  TO WRK-XN-00001.
140100*
140200 SUB-INIT-F3-15-1.
140300     MOVE   "SUB-TEST-F3-15-1" TO PAR-NAME.
140400     ADD     1 TO REC-CT.
140500 SUB-TEST-F3-15-1.
140600     IF      WRK-AN-00001    = "A"
140700             GO TO SUB-FAIL-F3-15-1.
140800     PERFORM PASS
140900     GO TO SUB-WRITE-F3-15-1.
141000 SUB-FAIL-F3-15-1.
141100     MOVE   "ON SIZE ERROR SHOULD NOT BE EXECUTED"
141200          TO RE-MARK
141300     MOVE    WRK-AN-00001  TO COMPUTED-X
141400     MOVE    SPACE TO CORRECT-X
141500     PERFORM FAIL.
141600 SUB-WRITE-F3-15-1.
141700     PERFORM PRINT-DETAIL.
141800*
141900 SUB-INIT-F3-15-2.
142000     MOVE  "SUB-TEST-F3-15-2" TO PAR-NAME.
142100     ADD    1 TO REC-CT.
142200 SUB-TEST-F3-15-2.
142300     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
142400            GO TO SUB-FAIL-F3-15-2.
142500     PERFORM PASS
142600     GO TO SUB-WRITE-F3-15-2.
142700 SUB-DELETE-F3-15-2.
142800     PERFORM DE-LETE.
142900     GO TO SUB-WRITE-F3-15-2.
143000 SUB-FAIL-F3-15-2.
143100     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
143200     MOVE   "+1" TO CORRECT-A
143300     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
143400          TO RE-MARK
143500     PERFORM FAIL.
143600 SUB-WRITE-F3-15-2.
143700     PERFORM PRINT-DETAIL.
143800*
143900 SUB-INIT-F3-15-3.
144000     MOVE  "SUB-TEST-F3-15-3" TO PAR-NAME.
144100     ADD    1 TO REC-CT.
144200 SUB-TEST-F3-15-3.
144300     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
144400            GO TO SUB-FAIL-F3-15-3.
144500     PERFORM PASS
144600     GO TO SUB-WRITE-F3-15-3.
144700 SUB-DELETE-F3-15-3.
144800     PERFORM DE-LETE.
144900     GO TO SUB-WRITE-F3-15-3.
145000 SUB-FAIL-F3-15-3.
145100     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
145200     MOVE   "+1.96" TO CORRECT-A
145300     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
145400          TO RE-MARK
145500     PERFORM FAIL.
145600 SUB-WRITE-F3-15-3.
145700     PERFORM PRINT-DETAIL.
145800*
145900 SUB-INIT-F3-15-4.
146000     MOVE  "SUB-TEST-F3-15-4" TO PAR-NAME.
146100     ADD     1 TO REC-CT.
146200 SUB-TEST-F3-15-4.
146300     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO -5.76
146400            GO TO SUB-FAIL-F3-15-4.
146500     PERFORM PASS
146600     GO TO SUB-WRITE-F3-15-4.
146700 SUB-DELETE-F3-15-4.
146800     PERFORM DE-LETE.
146900     GO TO SUB-WRITE-F3-15-4.
147000 SUB-FAIL-F3-15-4.
147100     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
147200     MOVE   "-5.76" TO CORRECT-A
147300     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
147400          TO RE-MARK
147500     PERFORM FAIL.
147600 SUB-WRITE-F3-15-4.
147700     PERFORM PRINT-DETAIL.
147800*
147900 SUB-INIT-F3-15-5.
148000     MOVE   "SUB-TEST-F3-15-5" TO PAR-NAME.
148100     ADD     1 TO REC-CT.
148200 SUB-TEST-F3-15-5.
148300     IF      WRK-XN-00001 NOT = "Z"
148400             GO TO SUB-FAIL-F3-15-5.
148500     PERFORM PASS
148600     GO TO SUB-WRITE-F3-15-5.
148700 SUB-DELETE-F3-15-5.
148800     PERFORM DE-LETE.
148900     GO TO SUB-WRITE-F3-15-5.
149000 SUB-FAIL-F3-15-5.
149100     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
149200     MOVE   "Z"   TO COMPUTED-X
149300     MOVE    WRK-AN-00001 TO CORRECT-X
149400     PERFORM FAIL.
149500 SUB-WRITE-F3-15-5.
149600     PERFORM PRINT-DETAIL.
149700*
149800 SUB-INIT-F3-16.
149900*    ===-->  NEW SIZE ERROR TESTS  <--===
150000*    ===-->      SIZE ERROR        <--===
150100     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
150200     MOVE    SPACE  TO WRK-AN-00001.
150300     MOVE    SPACE  TO WRK-XN-00001.
150400     MOVE    0      TO REC-CT.
150500     MOVE    1      TO SUBTR-13 OF SUBTR-12.
150600     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
150700     MOVE   76.76   TO SUBTR-15 OF SUBTR-12.
150800     MOVE    2      TO SUBTR-13 OF SUBTR-16.
150900     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
151000     MOVE    1      TO SUBTR-15 OF SUBTR-16.
151100 SUB-TEST-F3-16-0.
151200     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
151300             ON SIZE ERROR
151400             MOVE   "A" TO WRK-AN-00001
151500         NOT ON SIZE ERROR
151600             MOVE   "B" TO WRK-AN-00001
151700     END-SUBTRACT
151800     MOVE   "Z" TO WRK-XN-00001.
151900*
152000 SUB-INIT-F3-16-1.
152100     MOVE   "SUB-TEST-F3-16-1" TO PAR-NAME.
152200     ADD     1 TO REC-CT.
152300 SUB-TEST-F3-16-1.
152400     IF      WRK-AN-00001    NOT = "A"
152500             GO TO SUB-FAIL-F3-16-1.
152600     PERFORM PASS
152700     GO TO SUB-WRITE-F3-16-1.
152800 SUB-DELETE-F3-16-1.
152900     PERFORM DE-LETE.
153000     GO TO SUB-WRITE-F3-16-1.
153100 SUB-FAIL-F3-16-1.
153200     MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
153300          TO RE-MARK
153400     MOVE    WRK-AN-00001  TO COMPUTED-X
153500     MOVE   "A"    TO CORRECT-X
153600     PERFORM FAIL.
153700 SUB-WRITE-F3-16-1.
153800     PERFORM PRINT-DETAIL.
153900*
154000 SUB-INIT-F3-16-2.
154100     MOVE  "SUB-TEST-F3-16-2" TO PAR-NAME.
154200     ADD    1 TO REC-CT.
154300 SUB-TEST-F3-16-2.
154400     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
154500            GO TO SUB-FAIL-F3-16-2.
154600     PERFORM PASS
154700     GO TO SUB-WRITE-F3-16-2.
154800 SUB-DELETE-F3-16-2.
154900     PERFORM DE-LETE.
155000     GO TO SUB-WRITE-F3-16-2.
155100 SUB-FAIL-F3-16-2.
155200     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
155300     MOVE   "+1" TO CORRECT-A
155400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
155500          TO RE-MARK
155600     PERFORM FAIL.
155700 SUB-WRITE-F3-16-2.
155800     PERFORM PRINT-DETAIL.
155900*
156000 SUB-INIT-F3-16-3.
156100     MOVE  "SUB-TEST-F3-16-3" TO PAR-NAME.
156200     ADD    1 TO REC-CT.
156300 SUB-TEST-F3-16-3.
156400     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
156500            GO TO SUB-FAIL-F3-16-3.
156600     PERFORM PASS
156700     GO TO SUB-WRITE-F3-16-3.
156800 SUB-DELETE-F3-16-3.
156900     PERFORM DE-LETE.
157000     GO TO SUB-WRITE-F3-16-3.
157100 SUB-FAIL-F3-16-3.
157200     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
157300     MOVE   "+1.96" TO CORRECT-A
157400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
157500          TO RE-MARK
157600     PERFORM FAIL.
157700 SUB-WRITE-F3-16-3.
157800     PERFORM PRINT-DETAIL.
157900*
158000 SUB-INIT-F3-16-4.
158100     MOVE  "SUB-TEST-F3-16-4" TO PAR-NAME.
158200     ADD     1 TO REC-CT.
158300 SUB-TEST-F3-16-4.
158400     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO 1
158500            GO TO SUB-FAIL-F3-16-4.
158600     PERFORM PASS
158700     GO TO SUB-WRITE-F3-16-4.
158800 SUB-DELETE-F3-16-4.
158900     PERFORM DE-LETE.
159000     GO TO SUB-WRITE-F3-16-4.
159100 SUB-FAIL-F3-16-4.
159200     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
159300     MOVE   "+1" TO CORRECT-A
159400     MOVE   "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
159500     PERFORM FAIL.
159600 SUB-WRITE-F3-16-4.
159700     PERFORM PRINT-DETAIL.
159800*
159900 SUB-INIT-F3-16-5.
160000     MOVE   "SUB-TEST-F3-16-5" TO PAR-NAME.
160100     ADD     1 TO REC-CT.
160200 SUB-TEST-F3-16-5.
160300     IF      WRK-XN-00001 NOT = "Z"
160400             GO TO SUB-FAIL-F3-16-5.
160500     PERFORM PASS
160600     GO TO SUB-WRITE-F3-16-5.
160700 SUB-DELETE-F3-16-5.
160800     PERFORM DE-LETE.
160900     GO TO SUB-WRITE-F3-16-5.
161000 SUB-FAIL-F3-16-5.
161100     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
161200     MOVE   "Z"   TO COMPUTED-X
161300     MOVE    WRK-AN-00001 TO CORRECT-X
161400     PERFORM FAIL.
161500 SUB-WRITE-F3-16-5.
161600     PERFORM PRINT-DETAIL.
161700*
161800 SUB-INIT-F3-17.
161900*    ===-->  NEW SIZE ERROR TESTS  <--===
162000*    ===-->   NO SIZE ERROR        <--===
162100     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
162200     MOVE    SPACE  TO WRK-AN-00001.
162300     MOVE    SPACE  TO WRK-XN-00001.
162400     MOVE    0      TO REC-CT.
162500     MOVE    1      TO SUBTR-13 OF SUBTR-12.
162600     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
162700     MOVE    6.76   TO SUBTR-15 OF SUBTR-12.
162800     MOVE    2      TO SUBTR-13 OF SUBTR-16.
162900     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
163000     MOVE    1      TO SUBTR-15 OF SUBTR-16.
163100 SUB-TEST-F3-17-0.
163200     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
163300             ON SIZE ERROR
163400             MOVE   "A" TO WRK-AN-00001
163500         NOT ON SIZE ERROR
163600             MOVE   "B" TO WRK-AN-00001
163700     END-SUBTRACT
163800     MOVE   "Z" TO WRK-XN-00001.
163900*
164000 SUB-INIT-F3-17-1.
164100     MOVE   "SUB-TEST-F3-17-1" TO PAR-NAME.
164200     ADD     1 TO REC-CT.
164300 SUB-TEST-F3-17-1.
164400     IF      WRK-AN-00001    NOT = "B"
164500             GO TO SUB-FAIL-F3-17-1.
164600     PERFORM PASS
164700     GO TO SUB-WRITE-F3-17-1.
164800 SUB-DELETE-F3-17-1.
164900     PERFORM DE-LETE.
165000     GO TO SUB-WRITE-F3-17-1.
165100 SUB-FAIL-F3-17-1.
165200     MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
165300           TO RE-MARK
165400     MOVE    WRK-AN-00001  TO COMPUTED-X
165500     MOVE   "B"    TO CORRECT-X
165600     PERFORM FAIL.
165700 SUB-WRITE-F3-17-1.
165800     PERFORM PRINT-DETAIL.
165900*
166000 SUB-INIT-F3-17-2.
166100     MOVE  "SUB-TEST-F3-17-2" TO PAR-NAME.
166200     ADD    1 TO REC-CT.
166300 SUB-TEST-F3-17-2.
166400     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
166500            GO TO SUB-FAIL-F3-17-2.
166600     PERFORM PASS
166700     GO TO SUB-WRITE-F3-17-2.
166800 SUB-DELETE-F3-17-2.
166900     PERFORM DE-LETE.
167000     GO TO SUB-WRITE-F3-17-2.
167100 SUB-FAIL-F3-17-2.
167200     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
167300     MOVE   "+1" TO CORRECT-A
167400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
167500          TO RE-MARK
167600     PERFORM FAIL.
167700 SUB-WRITE-F3-17-2.
167800     PERFORM PRINT-DETAIL.
167900*
168000 SUB-INIT-F3-17-3.
168100     MOVE  "SUB-TEST-F3-17-3" TO PAR-NAME.
168200     ADD    1 TO REC-CT.
168300 SUB-TEST-F3-17-3.
168400     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
168500            GO TO SUB-FAIL-F3-17-3.
168600     PERFORM PASS
168700     GO TO SUB-WRITE-F3-17-3.
168800 SUB-DELETE-F3-17-3.
168900     PERFORM DE-LETE.
169000     GO TO SUB-WRITE-F3-17-3.
169100 SUB-FAIL-F3-17-3.
169200     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
169300     MOVE   "+1.96" TO CORRECT-A
169400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
169500          TO RE-MARK
169600     PERFORM FAIL.
169700 SUB-WRITE-F3-17-3.
169800     PERFORM PRINT-DETAIL.
169900*
170000 SUB-INIT-F3-17-4.
170100     MOVE  "SUB-TEST-F3-17-4" TO PAR-NAME.
170200     ADD     1 TO REC-CT.
170300 SUB-TEST-F3-17-4.
170400     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO -5.76
170500            GO TO SUB-FAIL-F3-17-4.
170600     PERFORM PASS
170700     GO TO SUB-WRITE-F3-17-4.
170800 SUB-DELETE-F3-17-4.
170900     PERFORM DE-LETE.
171000     GO TO SUB-WRITE-F3-17-4.
171100 SUB-FAIL-F3-17-4.
171200     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
171300     MOVE   "-5.76" TO CORRECT-A
171400     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
171500          TO RE-MARK
171600     PERFORM FAIL.
171700 SUB-WRITE-F3-17-4.
171800     PERFORM PRINT-DETAIL.
171900*
172000 SUB-INIT-F3-17-5.
172100     MOVE   "SUB-TEST-F3-17-5" TO PAR-NAME.
172200     ADD     1 TO REC-CT.
172300 SUB-TEST-F3-17-5.
172400     IF      WRK-XN-00001 NOT = "Z"
172500             GO TO SUB-FAIL-F3-17-5.
172600     PERFORM PASS
172700     GO TO SUB-WRITE-F3-17-5.
172800 SUB-DELETE-F3-17-5.
172900     PERFORM DE-LETE.
173000     GO TO SUB-WRITE-F3-17-5.
173100 SUB-FAIL-F3-17-5.
173200     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
173300     MOVE   "Z"   TO COMPUTED-X
173400     MOVE    WRK-AN-00001 TO CORRECT-X
173500     PERFORM FAIL.
173600 SUB-WRITE-F3-17-5.
173700     PERFORM PRINT-DETAIL.
173800*
173900 SUB-INIT-F3-18.
174000*    ===-->  NEW SIZE ERROR TESTS  <--===
174100*    ===-->      SIZE ERROR        <--===
174200     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
174300     MOVE    SPACE  TO WRK-AN-00001.
174400     MOVE    SPACE  TO WRK-XN-00001.
174500     MOVE    0      TO REC-CT.
174600     MOVE    1      TO SUBTR-13 OF SUBTR-12.
174700     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
174800     MOVE   76.76   TO SUBTR-15 OF SUBTR-12.
174900     MOVE    2      TO SUBTR-13 OF SUBTR-16.
175000     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
175100     MOVE    1      TO SUBTR-15 OF SUBTR-16.
175200 SUB-TEST-F3-18-0.
175300     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
175400             ON SIZE ERROR
175500             MOVE   "A" TO WRK-AN-00001
175600         NOT ON SIZE ERROR
175700             MOVE   "B" TO WRK-AN-00001
175800     END-SUBTRACT
175900     MOVE   "Z" TO WRK-XN-00001.
176000*
176100 SUB-INIT-F3-18-1.
176200     MOVE   "SUB-TEST-F3-18-1" TO PAR-NAME.
176300     ADD     1 TO REC-CT.
176400 SUB-TEST-F3-18-1.
176500     IF      WRK-AN-00001    NOT = "A"
176600             GO TO SUB-FAIL-F3-18-1.
176700     PERFORM PASS
176800     GO TO SUB-WRITE-F3-18-1.
176900 SUB-DELETE-F3-18-1.
177000     PERFORM DE-LETE.
177100     GO TO SUB-WRITE-F3-18-1.
177200 SUB-FAIL-F3-18-1.
177300     MOVE   "ON SIZE ERROR SHOULD BE EXECUTED"
177400          TO RE-MARK
177500     MOVE    WRK-AN-00001  TO COMPUTED-X
177600     MOVE   "A"    TO CORRECT-X
177700     PERFORM FAIL.
177800 SUB-WRITE-F3-18-1.
177900     PERFORM PRINT-DETAIL.
178000*
178100 SUB-INIT-F3-18-2.
178200     MOVE  "SUB-TEST-F3-18-2" TO PAR-NAME.
178300     ADD    1 TO REC-CT.
178400 SUB-TEST-F3-18-2.
178500     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
178600            GO TO SUB-FAIL-F3-18-2.
178700     PERFORM PASS
178800     GO TO SUB-WRITE-F3-18-2.
178900 SUB-FAIL-F3-18-2.
179000     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
179100     MOVE   "+1" TO CORRECT-A
179200     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
179300          TO RE-MARK
179400     PERFORM FAIL.
179500 SUB-WRITE-F3-18-2.
179600     PERFORM PRINT-DETAIL.
179700*
179800 SUB-INIT-F3-18-3.
179900     MOVE  "SUB-TEST-F3-18-3" TO PAR-NAME.
180000     ADD    1 TO REC-CT.
180100 SUB-TEST-F3-18-3.
180200     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
180300            GO TO SUB-FAIL-F3-18-3.
180400     PERFORM PASS
180500     GO TO SUB-WRITE-F3-18-3.
180600 SUB-DELETE-F3-18-3.
180700     PERFORM DE-LETE.
180800     GO TO SUB-WRITE-F3-18-3.
180900 SUB-FAIL-F3-18-3.
181000     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
181100     MOVE   "+1.96" TO CORRECT-A
181200     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
181300          TO RE-MARK
181400     PERFORM FAIL.
181500 SUB-WRITE-F3-18-3.
181600     PERFORM PRINT-DETAIL.
181700*
181800 SUB-INIT-F3-18-4.
181900     MOVE  "SUB-TEST-F3-18-4" TO PAR-NAME.
182000     ADD     1 TO REC-CT.
182100 SUB-TEST-F3-18-4.
182200     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO 1
182300            GO TO SUB-FAIL-F3-18-4.
182400     PERFORM PASS
182500     GO TO SUB-WRITE-F3-18-4.
182600 SUB-DELETE-F3-18-4.
182700     PERFORM DE-LETE.
182800     GO TO SUB-WRITE-F3-18-4.
182900 SUB-FAIL-F3-18-4.
183000     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
183100     MOVE   "+1" TO CORRECT-A
183200     MOVE "WRONGLY AFFECTED BY SIZE ERROR" TO RE-MARK
183300     PERFORM FAIL.
183400 SUB-WRITE-F3-18-4.
183500     PERFORM PRINT-DETAIL.
183600*
183700 SUB-INIT-F3-18-5.
183800     MOVE   "SUB-TEST-F3-18-5" TO PAR-NAME.
183900     ADD     1 TO REC-CT.
184000 SUB-TEST-F3-18-5.
184100     IF      WRK-XN-00001 NOT = "Z"
184200             GO TO SUB-FAIL-F3-18-5.
184300     PERFORM PASS
184400     GO TO SUB-WRITE-F3-18-5.
184500 SUB-DELETE-F3-18-5.
184600     PERFORM DE-LETE.
184700     GO TO SUB-WRITE-F3-18-5.
184800 SUB-FAIL-F3-18-5.
184900     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
185000     MOVE   "Z"   TO COMPUTED-X
185100     MOVE    WRK-AN-00001 TO CORRECT-X
185200     PERFORM FAIL.
185300 SUB-WRITE-F3-18-5.
185400     PERFORM PRINT-DETAIL.
185500*
185600 SUB-INIT-F3-19.
185700*    ===-->  NEW SIZE ERROR TESTS  <--===
185800*    ===-->   NO SIZE ERROR        <--===
185900     MOVE   "VI-133 6.25" TO ANSI-REFERENCE.
186000     MOVE    SPACE  TO WRK-AN-00001.
186100     MOVE    0      TO REC-CT.
186200     MOVE    1      TO SUBTR-13 OF SUBTR-12.
186300     MOVE   -1.725  TO SUBTR-14 OF SUBTR-12.
186400     MOVE    6.76   TO SUBTR-15 OF SUBTR-12.
186500     MOVE    2      TO SUBTR-13 OF SUBTR-16.
186600     MOVE     .23   TO SUBTR-14 OF SUBTR-16.
186700     MOVE    1      TO SUBTR-15 OF SUBTR-16.
186800 SUB-TEST-F3-19-0.
186900     SUBTRACT CORRESPONDING SUBTR-12 FROM SUBTR-16 ROUNDED
187000             ON SIZE ERROR
187100             MOVE   "A" TO WRK-AN-00001
187200         NOT ON SIZE ERROR
187300             MOVE   "B" TO WRK-AN-00001
187400     END-SUBTRACT
187500     MOVE   "Z" TO WRK-XN-00001.
187600*
187700 SUB-INIT-F3-19-1.
187800     MOVE   "SUB-TEST-F3-19-1" TO PAR-NAME.
187900     ADD     1 TO REC-CT.
188000 SUB-TEST-F3-19-1.
188100     IF      WRK-AN-00001    NOT = "B"
188200             GO TO SUB-FAIL-F3-19-1.
188300     PERFORM PASS
188400     GO TO SUB-WRITE-F3-19-1.
188500 SUB-DELETE-F3-19-1.
188600     PERFORM DE-LETE.
188700     GO TO SUB-WRITE-F3-19-1.
188800 SUB-FAIL-F3-19-1.
188900     MOVE   "NOT ON SIZE ERROR SHOULD BE EXECUTED"
189000                TO RE-MARK
189100     MOVE    WRK-AN-00001  TO COMPUTED-X
189200     MOVE   "B"    TO CORRECT-X
189300     PERFORM FAIL.
189400 SUB-WRITE-F3-19-1.
189500     PERFORM PRINT-DETAIL.
189600*
189700 SUB-INIT-F3-19-2.
189800     MOVE  "SUB-TEST-F3-19-2" TO PAR-NAME.
189900     ADD    1 TO REC-CT.
190000 SUB-TEST-F3-19-2.
190100     IF     SUBTR-13 OF SUBTR-16 NOT EQUAL TO 1
190200            GO TO SUB-FAIL-F3-19-2.
190300     PERFORM PASS
190400     GO TO SUB-WRITE-F3-19-2.
190500 SUB-DELETE-F3-19-2.
190600     PERFORM DE-LETE.
190700     GO TO SUB-WRITE-F3-19-2.
190800 SUB-FAIL-F3-19-2.
190900     MOVE    SUBTR-13 OF SUBTR-16 TO COMPUTED-N
191000     MOVE   "+1" TO CORRECT-A
191100     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
191200          TO RE-MARK
191300     PERFORM FAIL.
191400 SUB-WRITE-F3-19-2.
191500     PERFORM PRINT-DETAIL.
191600*
191700 SUB-INIT-F3-19-3.
191800     MOVE  "SUB-TEST-F3-19-3" TO PAR-NAME.
191900     ADD    1 TO REC-CT.
192000 SUB-TEST-F3-19-3.
192100     IF     SUBTR-14 OF SUBTR-16 IS NOT EQUAL TO 1.96
192200            GO TO SUB-FAIL-F3-19-3.
192300     PERFORM PASS
192400     GO TO SUB-WRITE-F3-19-3.
192500 SUB-DELETE-F3-19-3.
192600     PERFORM DE-LETE.
192700     GO TO SUB-WRITE-F3-19-3.
192800 SUB-FAIL-F3-19-3.
192900     MOVE   SUBTR-14 OF SUBTR-16 TO COMPUTED-N
193000     MOVE   "+1.96" TO CORRECT-A
193100     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
193200          TO RE-MARK
193300     PERFORM FAIL.
193400 SUB-WRITE-F3-19-3.
193500     PERFORM PRINT-DETAIL.
193600*
193700 SUB-INIT-F3-19-4.
193800     MOVE  "SUB-TEST-F3-19-4" TO PAR-NAME.
193900     ADD     1 TO REC-CT.
194000 SUB-TEST-F3-19-4.
194100     IF     SUBTR-15 OF SUBTR-16 NOT EQUAL TO -5.76
194200            GO TO SUB-FAIL-F3-19-4.
194300     PERFORM PASS
194400     GO TO SUB-WRITE-F3-19-4.
194500 SUB-DELETE-F3-19-4.
194600     PERFORM DE-LETE.
194700     GO TO SUB-WRITE-F3-19-4.
194800 SUB-FAIL-F3-19-4.
194900     MOVE    SUBTR-15 OF SUBTR-16 TO COMPUTED-N
195000     MOVE   "-5.76" TO CORRECT-A
195100     MOVE "WRONGLY AFFECTED BY SIZE ERROR ON OTHER OPERAND"
195200          TO RE-MARK
195300     PERFORM FAIL.
195400 SUB-WRITE-F3-19-4.
195500     PERFORM PRINT-DETAIL.
195600*
195700 SUB-INIT-F3-19-5.
195800     MOVE   "SUB-TEST-F3-19-5" TO PAR-NAME.
195900     ADD     1 TO REC-CT.
196000 SUB-TEST-F3-19-5.
196100     IF      WRK-XN-00001 NOT = "Z"
196200             GO TO SUB-FAIL-F3-19-5.
196300     PERFORM PASS
196400     GO TO SUB-WRITE-F3-19-5.
196500 SUB-DELETE-F3-19-5.
196600     PERFORM DE-LETE.
196700     GO TO SUB-WRITE-F3-19-5.
196800 SUB-FAIL-F3-19-5.
196900     MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
197000     MOVE   "Z"   TO COMPUTED-X
197100     MOVE    WRK-AN-00001 TO CORRECT-X
197200     PERFORM FAIL.
197300 SUB-WRITE-F3-19-5.
197400     PERFORM PRINT-DETAIL.
197500*
197600 CCVS-EXIT SECTION.
197700 CCVS-999999.
197800     GO TO CLOSE-FILES.
