000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC250A.
000400
000500****************************************************************
000600*                                                              *
000700*    VALIDATION FOR:-                                          *
000800*                                                              *
000900*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
001000*                                                              *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-82  - SOURCE COMPUTER NAME.                         *
001900*        X-83  - OBJECT COMPUTER NAME.                         *
002000*                                                              *
002100****************************************************************
002200*
002300*    PROGRAM NC250A TESTS THE GENERAL FORMAT OF THE "IF" STATEMENT
002400*    A VARIETY OF QUALIFIED DATA-NAMES AND CONDITION-NAMES
002500*    ARE USED.
002600*
002700
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE.
004100 01  PRINT-REC PICTURE X(120).
004200 01  DUMMY-RECORD PICTURE X(120).
004300 WORKING-STORAGE SECTION.
004400 01  WRK-DU-1V0-1 PIC 9 VALUE 1.
004500 01  WRK-DU-1V0-2 PIC 9 VALUE 2.
004600 01  WRK-DU-1V0-3 PIC 9 VALUE 3.
004700 01  WRK-DU-1V0-4 PIC 9 VALUE ZERO.
004800 01  WRK-DU-2V0-1 PIC 99 VALUE 10.
004900 01  WRK-DU-2V0-2 PIC 99 VALUE 11.
005000 01  WRK-DU-2V0-3 PIC 99 VALUE 12.
005100 77  SMALL-VALU   PICTURE 99 VALUE 7.
005200 77  SMALLER-VALU PICTURE 99 VALUE 6.
005300 77  SMALLEST-VALU   PICTURE 99 VALUE 5.
005400 77  EVEN-SMALLER PICTURE 99 VALUE 1.
005500 77  WRK-DS-02V00                 PICTURE S99.
005600     88 TEST-2NUC-COND-99         VALUE 99.
005700 77  WRK-DS-06V06     PICTURE S9(6)V9(6).
005800 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06
005900                                  PICTURE S9(12).
006000 77  A02TWOS-DS-02V00             PICTURE S99    VALUE 22.
006100 77  WRK-DS-01V00                 PICTURE S9.
006200 77  A02TWOS-DS-03V02             PICTURE S999V99 VALUE +022.00.
006300 77  A990-DS-0201P                PICTURE S99P   VALUE 990.
006400 77  A02ONES-DS-02V00             PICTURE S99    VALUE 11.
006500 77  A01ONE-DS-P0801              PICTURE SP(8)9 VALUE .000000001.
006600 77  ATWO-DS-01V00                PICTURE S9     VALUE 2.
006700 77  WRK-XN-00001                 PICTURE X.
006800 77  WRK-XN-00005                 PICTURE X(5).
006900 77  TWO  PICTURE 9 VALUE 2.
007000 77  THREE PICTURE 9 VALUE 3.
007100 77  SEVEN PICTURE 9 VALUE 7.
007200 77  EIGHT PICTURE 9 VALUE 8.
007300 77  NINE  PICTURE 9 VALUE 9.
007400 77  TEN  PICTURE 99 VALUE 10.
007500 77  TWENTY PICTURE 99 VALUE 20.
007600 77  ALTERCOUNT PICTURE 999 VALUE ZERO.
007700 77  XRAY PICTURE IS X.
007800 77  IF-D1 PICTURE S9(4)V9(2) VALUE 0.
007900 77  IF-D2 PICTURE S9(4)V9(2) VALUE ZERO.
008000 77  IF-D3 PICTURE X(10) VALUE "0000000000".
008100 77  IF-D4 PICTURE X(15) VALUE "               ".
008200 77  IF-D5 PICTURE X(10) VALUE ALL QUOTE.
008300 77  IF-D6 PICTURE A(10) VALUE "BABABABABA".
008400 77  IF-D7 PICTURE S9(6)V9(4) VALUE +123.45.
008500 77  IF-D8 PICTURE 9(6)V9(4) VALUE 12300.
008600 77  IF-D9 PICTURE X(3) VALUE "123".
008700 77  IF-D11 PICTURE X(6) VALUE "ABCDEF".
008800 77  IF-D13 PICTURE 9(6)V9(4) VALUE 12300.
008900 77  IF-D14 PICTURE S9(4)V9(2) VALUE +123.45.
009000 77  IF-D15 PICTURE S999PP VALUE 12300.
009100 77  IF-D16 PICTURE PP99 VALUE .0012.
009200 77  IF-D17 PICTURE SV9(4) VALUE .0012.
009300 77  IF-D18 PICTURE X(10) VALUE "BABABABABA".
009400 77  IF-D19 PICTURE X(10) VALUE "ABCDEF    ".
009500 77  IF-D23 PICTURE $9,9B9.90+.
009600 77  IF-D24 PICTURE X(10) VALUE "$1,2 3.40+".
009700 77  IF-D25 PICTURE ABABX0A.
009800 77  IF-D26 PICTURE X(8) VALUE "A C D0E".
009900 77  IF-D27 PICTURE IS 9(6)V9(4) VALUE IS 2137.45
010000     USAGE IS COMPUTATIONAL.
010100 77  IF-D28 PICTURE IS 999999V9999 VALUE IS 2137.45.
010200 77  IF-D31 PICTURE S9(6) VALUE -123.
010300 77  IF-D32 PICTURE S9(4)V99.
010400     88  A  VALUE 1.
010500     88  B VALUES ARE 2 THRU 4.
010600     88  C VALUE IS ZERO.
010700     88  D VALUE IS +12.34.
010800     88  E  VALUE IS .01, .11, .21 .81.
010900     88  F  VALUE IS 100 THRU 128 1000 THRU 1280 -9 THRU -2.
011000     88  G  VALUE IS 8765.43 1234 THRU 5678 5 -9999 THRU 10.
011100 77  IF-D33 PICTURE X(4).
011200     88  B   VALUE QUOTE.
011300     88  C   VALUE SPACE.
011400     88 D VALUE ALL "BAC".
011500 77  IF-D34 PICTURE A(4).
011600     88  B VALUE "A A ".
011700 77  IF-D37 PICTURE 9(5) VALUE 12345.
011800 77  IF-D38 PICTURE X(9) VALUE "12345    ".
011900 77  CCON-1 PICTURE 99 VALUE 11.
012000 77  CCON-2 PICTURE 99 VALUE 12.
012100 77  CCON-3 PICTURE 99 VALUE 13.
012200 77  COMP-SGN1  PICTURE S9(1) VALUE +9 COMPUTATIONAL.
012300 77  COMP-SGN2  PICTURE S9(18) VALUE +3 COMPUTATIONAL.
012400 77  COMP-SGN3  PICTURE S9(1) VALUE -5 COMPUTATIONAL.
012500 77  COMP-SGN4  PICTURE S9(18) VALUE -3167598765431 COMPUTATIONAL.
012600 77  START-POINT        PICTURE 9(6) COMPUTATIONAL.
012700 77  INC-VALUE          PICTURE 9(6) COMPUTATIONAL.
012800 77  SWITCH-PFM-1 PICTURE 9 VALUE ZERO.
012900 77  SWITCH-PFM-2 PICTURE 9 VALUE ZERO.
013000 77  PFM-11-COUNTER PICTURE 999 VALUE ZERO.
013100 77  PFM-12-COUNTER  PICTURE 999 VALUE 100.
013200 77  PFM-12-ANS1  PICTURE 999 VALUE ZERO.
013300 77  PFM-12-ANS2  PICTURE 999 VALUE ZERO.
013400 01  SUBSCRIPT-6 PICTURE 99999 VALUE ZERO.
013500 01  IF-TABLE.
013600     02 IF-ELEM PICTURE X OCCURS 12 TIMES.
013700 01  QUOTE-DATA.
013800     02 QU-1 PICTURE X(3) VALUE "123".
013900     02 QU-2 PICTURE X VALUE QUOTE.
014000     02 QU-3 PICTURE X(6) VALUE "ABC456".
014100 01  IF-D10.
014200     02  D1 PICTURE X(2) VALUE "01".
014300     02  D2 PICTURE X(2) VALUE "23".
014400     02  D3.
014500     03  D4 PICTURE X(4) VALUE "4567".
014600     03 D5 PICTURE X(4) VALUE "8912".
014700 01  IF-D12.
014800     02  D1 PICTURE X(3) VALUE "ABC".
014900     02  D2.
015000     03  D3.
015100     04  D4      PICTURE XX     VALUE "DE".
015200     04  D5 PICTURE X VALUE "F".
015300 01  IF-D20.
015400     02  FILLER    PICTURE 9(5)   VALUE ZERO.
015500     02  D1 PICTURE 9(2) VALUE 12.
015600     02  D2 PICTURE 9 VALUE 3.
015700     02  D3 PICTURE 9(2) VALUE 45.
015800 01  IF-D21.
015900     02  D1 PICTURE 9(5) VALUE ZEROS.
016000     02  D2 PICTURE 9(5) VALUE 12345.
016100 01  IF-D22.
016200     02  D1 PICTURE A(2) VALUE "AB".
016300     02  D2 PICTURE A(4) VALUE "CDEF".
016400 01  IF-D35.
016500     02  AA PICTURE X(2).
016600     88  A1 VALUE "AA".
016700     88  A2 VALUE "AB".
016800     02  BB PICTURE IS X(2).
016900     88  B1 VALUE "CC".
017000     88  B2 VALUE "CD".
017100     02 BB-2 REDEFINES BB.
017200     03  AAA PICTURE X.
017300     88  AA1 VALUE "A".
017400     88  AA2 VALUE "C".
017500     03  BBB PICTURE X.
017600     88  BB1    VALUE "B".
017700     88  BB2 VALUE "D".
017800 01  IF-D36  PICTURE X(120) VALUE IS    "ABCDEFGHIJKLMNOPQRSTUVWXY
017900-    "Z1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLM
018000-    "NOPQRSTUVWXYZ1234567890ABCDEFGHIJKL".
018100 01  IF-D40 PICTURE 9(5) VALUE 12345
018200              COMPUTATIONAL SYNCHRONIZED RIGHT.
018300     88 IF-D40A VALUE ZERO THRU 10000.
018400     88 IF-D40B VALUE 10001 THRU 99999.
018500     88 IF-D40C VALUE 99999.
018600 01  PERFORM1  PICTURE XXX  VALUE SPACES.
018700 01  PERFORM2  PICTURE S999 VALUE 20.
018800 01  PERFORM3  PICTURE  9  VALUE  5.
018900 01  PERFORM4  PICTURE S99V9.
019000 01  PERFORM5  PICTURE S99V9  VALUE 10.0.
019100 01  PERFORM6  PICTURE  99V9.
019200 01  PERFORM7.
019300     02  PERFORM8  OCCURS 7 TIMES  PICTURE  99V9.
019400 01  PERFORM9  PICTURE 9   VALUE 3.
019500 01  PERFORM10  PICTURE  S9  VALUE -1.
019600 01  PERFORM11  PICTURE  99  VALUE 6.
019700 01  PERFORM12.
019800     02 PERFORM13  OCCURS 4 TIMES.
019900         03 PERFORM14  OCCURS 20 TIMES  PICTURE  99V9.
020000         03 PERFORM15  OCCURS 10 TIMES.
020100             04 PERFORM16  OCCURS 5 TIMES  PICTURE 99V9.
020200 01  PERFORM17          PICTURE 9(6) COMPUTATIONAL.
020300 01  PERFORM18          PICTURE 9(6) COMPUTATIONAL.
020400 01  PERFORM-KEY  PICTURE 9.
020500 01  PERFORM-SEVEN-LEVEL-TABLE.
020600   03   PFM71                OCCURS 2.
020700     05  PFM72               OCCURS 2.
020800       07  PFM73             OCCURS 2.
020900         09  PFM74           OCCURS 2.
021000           11  PFM75         OCCURS 2.
021100             13  PFM76       OCCURS 2.
021200               15  PFM77     OCCURS 2.
021300                 17  PFM77-1 PIC X.
021400 01  S1                      PIC S9(3) COMP.
021500 01  S2                      PIC S9(3) COMP.
021600 01  S3                      PIC S9(3) COMP.
021700 01  S4                      PIC S9(3) COMP.
021800 01  S5                      PIC S9(3) COMP.
021900 01  S6                      PIC S9(3) COMP.
022000 01  S7                      PIC S9(3) COMP.
022100 01  PFM-7-TOT               PIC S9(3) COMP.
022200 01  PFM-F4-24-TOT           PIC S9(3) COMP.
022300 01  PFM-A                   PIC S9(3) COMP.
022400 01  PFM-B                   PIC S9(3) COMP.
022500 01  FILLER-A.
022600   03  PFM-F4-25-A           PIC S9(3) COMP OCCURS 10.
022700 01  FILLER-B.
022800   03  PFM-F4-25-B           PIC S9(3) COMP OCCURS 10.
022900 01  FILLER-C.
023000   03  PFM-F4-25-C           PIC S9(3) COMP OCCURS 10.
023100 01  RECEIVING-TABLE.
023200     03 TBL-ELEMEN-A.
023300         05 TBL-ELEMEN-B          PICTURE X(18).
023400         05 TBL-ELEMEN-C          PICTURE X(18).
023500     03  TBL-ELEMEN-D.
023600         05 TBL-ELEMEN-E          PICTURE X OCCURS 36 TIMES.
023700 01  LITERAL-SPLITTER.
023800     02 PART1                     PICTURE X(20).
023900     02 PART2                     PICTURE X(20).
024000     02 PART3                     PICTURE X(20).
024100     02 PART4                     PICTURE X(20).
024200 01  LITERAL-TABLE REDEFINES LITERAL-SPLITTER.
024300     02 80PARTS                   PICTURE X      OCCURS 80 TIMES.
024400 01  GRP-FOR-88-LEVELS.
024500     03 WRK-DS-02V00-COND         PICTURE 99.
024600         88 COND-1                VALUE IS 01 THRU 05.
024700         88 COND-2                VALUES ARE 06 THRU 10
024800                                           16 THRU 20  00.
024900         88 COND-3                VALUES 11 THRU 15.
025000 01  GRP-MOVE-CONSTANTS.
025100     03 GRP-GROUP-MOVE-FROM.
025200         04 GRP-ALPHABETIC.
025300             05 ALPHABET-AN-00026 PICTURE A(26)
025400                        VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
025500         04 GRP-NUMERIC.
025600             05 DIGITS-DV-10V00   PICTURE 9(10) VALUE 0123456789.
025700         05 DIGITS-DU-06V04-S REDEFINES DIGITS-DV-10V00
025800                                  PICTURE 9(6)V9999.
025900         04 GRP-ALPHANUMERIC.
026000             05 ALPHANUMERIC-XN-00049 PICTURE X(50)
026100     VALUE  "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-><=$,;.()/* 0123456789".
026200             05 FILLER                PICTURE X  VALUE QUOTE.
026300 01  GRP-FOR-2N058.
026400     02 SUB-GRP-FOR-2N058-A.
026500         03 ELEM-FOR-2N058-A PICTURE 999  VALUE ZEROES.
026600         03 ELEM-FOR-2N058-B PICTURE XXX  VALUE ZEROS.
026700         03 ELEM-FOR-2N058-C PICTURE XXX  VALUE SPACES.
026800         03 ELEM-FOR-2N058-D PICTURE X(6) VALUE ALL "ABC".
026900         03 ELEM-FOR-2N058-E PICTURE XXX  VALUE ALL "Z".
027000         03 ELEM-FOR-2N058-F PICTURE XXX  VALUE ALL SPACES.
027100         03 ELEM-FOR-2N058-G PICTURE XXX  VALUE ALL ZEROES.
027200         03 ELEM-FOR-2N058-H PICTURE 999  VALUE ALL ZEROS.
027300         03 ELEM-FOR-2N058-I PICTURE XXX  VALUE QUOTES.
027400         03 ELEM-FOR-2N058-J PICTURE XXX  VALUE ALL QUOTES.
027500         03 ELEM-FOR-2N058-K PICTURE XXX  VALUE ALL HIGH-VALUES.
027600         03 ELEM-FOR-2N058-L PICTURE XXX  VALUE ALL LOW-VALUES.
027700         03 ELEM-FOR-2N058-M PICTURE XXX  VALUE HIGH-VALUES.
027800         03 ELEM-FOR-2N058-N PICTURE XXX  VALUE LOW-VALUES.
027900     02 SUB-GRP-FOR-2N058-B.
028000         03 SUB-SUB-BA.
028100             04 ELEM-FOR-2N058-A  PICTURE 999.
028200             04 ELEM-FOR-2N058-B  PICTURE XXX.
028300             04 ELEM-FOR-2N058-C  PICTURE XXX.
028400             04 ELEM-FOR-2N058-D  PICTURE X(6).
028500         03 SUB-SUB-BB.
028600             04 ELEM-FOR-2N058-E  PICTURE XXX.
028700             04 ELEM-FOR-2N058-F  PICTURE XXX.
028800             04 ELEM-FOR-2N058-G  PICTURE XXX.
028900             04 ELEM-FOR-2N058-H  PICTURE 999.
029000         03 SUB-SUB-BC.
029100             04 ELEM-FOR-2N058-I  PICTURE XXX.
029200             04 ELEM-FOR-2N058-J  PICTURE XXX.
029300             04 ELEM-FOR-2N058-K  PICTURE XXX.
029400             04 ELEM-FOR-2N058-L  PICTURE XXX.
029500             04 ELEM-FOR-2N058-M  PICTURE XXX.
029600             04 ELEM-FOR-2N058-N  PICTURE XXX.
029700 01  CHARACTER-BREAKDOWN-S.
029800     02   FIRST-20S PICTURE X(20).
029900     02  SECOND-20S PICTURE X(20).
030000     02   THIRD-20S PICTURE X(20).
030100     02  FOURTH-20S PICTURE X(20).
030200     02   FIFTH-20S PICTURE X(20).
030300     02   SIXTH-20S PICTURE X(20).
030400     02 SEVENTH-20S PICTURE X(20).
030500     02  EIGHTH-20S PICTURE X(20).
030600     02   NINTH-20S PICTURE X(20).
030700     02   TENTH-20S PICTURE X(20).
030800 01  CHARACTER-BREAKDOWN-R.
030900     02   FIRST-20R PICTURE X(20).
031000     02  SECOND-20R PICTURE X(20).
031100     02   THIRD-20R PICTURE X(20).
031200     02  FOURTH-20R PICTURE X(20).
031300     02   FIFTH-20R PICTURE X(20).
031400     02   SIXTH-20R PICTURE X(20).
031500     02 SEVENTH-20R PICTURE X(20).
031600     02  EIGHTH-20R PICTURE X(20).
031700     02   NINTH-20R PICTURE X(20).
031800     02   TENTH-20R PICTURE X(20).
031900 01  TABLE-80.
032000     02  ELMT OCCURS 3 TIMES PIC 9.
032100     88  A80  VALUES ARE ZERO THRU 7.
032200     88  B80  VALUE 8.
032300     88  C80  VALUES ARE 7, 8 THROUGH 9.
032400
032500 01  TABLE-86.
032600     88  A86  VALUE "ABC".
032700     88  B86  VALUE "ABCABC".
032800     88  C86  VALUE "   ABC".
032900     02  DATANAME-86  PIC XXX  VALUE "ABC".
033000     02  DNAME-86.
033100         03  FILLER  PIC X  VALUE "A".
033200         03  FILLER  PIC X  VALUE "B".
033300         03  FILLER  PIC X   VALUE "C".
033400 01  FIGCON-DATA.
033500     02 SPACE-X         PICTURE X(10) VALUE "          ".
033600     02 QUOTE-X         PICTURE X(5)  VALUE QUOTE.
033700     02 LOW-VAL         PICTURE X(5)  VALUE LOW-VALUE.
033800     02 ABC PICTURE XXX VALUE "ABC".
033900     02 ONE23           PICTURE 9999  VALUE 123.
034000     02 ZERO-C          PICTURE 9(10) VALUE 0 COMPUTATIONAL.
034100     02 ZERO-D          PICTURE 9     VALUE ZERO USAGE DISPLAY.
034200 01  TEST-RESULTS.
034300     02 FILLER                   PIC X      VALUE SPACE.
034400     02 FEATURE                  PIC X(20)  VALUE SPACE.
034500     02 FILLER                   PIC X      VALUE SPACE.
034600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
034700     02 FILLER                   PIC X      VALUE SPACE.
034800     02  PAR-NAME.
034900       03 FILLER                 PIC X(19)  VALUE SPACE.
035000       03  PARDOT-X              PIC X      VALUE SPACE.
035100       03 DOTVALUE               PIC 99     VALUE ZERO.
035200     02 FILLER                   PIC X(8)   VALUE SPACE.
035300     02 RE-MARK                  PIC X(61).
035400 01  TEST-COMPUTED.
035500     02 FILLER                   PIC X(30)  VALUE SPACE.
035600     02 FILLER                   PIC X(17)  VALUE
035700            "       COMPUTED=".
035800     02 COMPUTED-X.
035900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
036000     03 COMPUTED-N               REDEFINES COMPUTED-A
036100                                 PIC -9(9).9(9).
036200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
036300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
036400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
036500     03       CM-18V0 REDEFINES COMPUTED-A.
036600         04 COMPUTED-18V0                    PIC -9(18).
036700         04 FILLER                           PIC X.
036800     03 FILLER PIC X(50) VALUE SPACE.
036900 01  TEST-CORRECT.
037000     02 FILLER PIC X(30) VALUE SPACE.
037100     02 FILLER PIC X(17) VALUE "       CORRECT =".
037200     02 CORRECT-X.
037300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
037400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
037500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
037600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
037700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
037800     03      CR-18V0 REDEFINES CORRECT-A.
037900         04 CORRECT-18V0                     PIC -9(18).
038000         04 FILLER                           PIC X.
038100     03 FILLER PIC X(2) VALUE SPACE.
038200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
038300 01  CCVS-C-1.
038400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
038500-    "SS  PARAGRAPH-NAME
038600-    "       REMARKS".
038700     02 FILLER                     PIC X(20)    VALUE SPACE.
038800 01  CCVS-C-2.
038900     02 FILLER                     PIC X        VALUE SPACE.
039000     02 FILLER                     PIC X(6)     VALUE "TESTED".
039100     02 FILLER                     PIC X(15)    VALUE SPACE.
039200     02 FILLER                     PIC X(4)     VALUE "FAIL".
039300     02 FILLER                     PIC X(94)    VALUE SPACE.
039400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
039500 01  REC-CT                        PIC 99       VALUE ZERO.
039600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
039700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
039800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
039900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
040000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
040100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
040200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
040300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
040400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
040500 01  CCVS-H-1.
040600     02  FILLER                    PIC X(39)    VALUE SPACES.
040700     02  FILLER                    PIC X(42)    VALUE
040800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
040900     02  FILLER                    PIC X(39)    VALUE SPACES.
041000 01  CCVS-H-2A.
041100   02  FILLER                        PIC X(40)  VALUE SPACE.
041200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
041300   02  FILLER                        PIC XXXX   VALUE
041400     "4.2 ".
041500   02  FILLER                        PIC X(28)  VALUE
041600            " COPY - NOT FOR DISTRIBUTION".
041700   02  FILLER                        PIC X(41)  VALUE SPACE.
041800
041900 01  CCVS-H-2B.
042000   02  FILLER                        PIC X(15)  VALUE
042100            "TEST RESULT OF ".
042200   02  TEST-ID                       PIC X(9).
042300   02  FILLER                        PIC X(4)   VALUE
042400            " IN ".
042500   02  FILLER                        PIC X(12)  VALUE
042600     " HIGH       ".
042700   02  FILLER                        PIC X(22)  VALUE
042800            " LEVEL VALIDATION FOR ".
042900   02  FILLER                        PIC X(58)  VALUE
043000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
043100 01  CCVS-H-3.
043200     02  FILLER                      PIC X(34)  VALUE
043300            " FOR OFFICIAL USE ONLY    ".
043400     02  FILLER                      PIC X(58)  VALUE
043500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
043600     02  FILLER                      PIC X(28)  VALUE
043700            "  COPYRIGHT   1985 ".
043800 01  CCVS-E-1.
043900     02 FILLER                       PIC X(52)  VALUE SPACE.
044000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
044100     02 ID-AGAIN                     PIC X(9).
044200     02 FILLER                       PIC X(45)  VALUE SPACES.
044300 01  CCVS-E-2.
044400     02  FILLER                      PIC X(31)  VALUE SPACE.
044500     02  FILLER                      PIC X(21)  VALUE SPACE.
044600     02 CCVS-E-2-2.
044700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
044800         03 FILLER                   PIC X      VALUE SPACE.
044900         03 ENDER-DESC               PIC X(44)  VALUE
045000            "ERRORS ENCOUNTERED".
045100 01  CCVS-E-3.
045200     02  FILLER                      PIC X(22)  VALUE
045300            " FOR OFFICIAL USE ONLY".
045400     02  FILLER                      PIC X(12)  VALUE SPACE.
045500     02  FILLER                      PIC X(58)  VALUE
045600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
045700     02  FILLER                      PIC X(13)  VALUE SPACE.
045800     02 FILLER                       PIC X(15)  VALUE
045900             " COPYRIGHT 1985".
046000 01  CCVS-E-4.
046100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
046200     02 FILLER                       PIC X(4)   VALUE " OF ".
046300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
046400     02 FILLER                       PIC X(40)  VALUE
046500      "  TESTS WERE EXECUTED SUCCESSFULLY".
046600 01  XXINFO.
046700     02 FILLER                       PIC X(19)  VALUE
046800            "*** INFORMATION ***".
046900     02 INFO-TEXT.
047000       04 FILLER                     PIC X(8)   VALUE SPACE.
047100       04 XXCOMPUTED                 PIC X(20).
047200       04 FILLER                     PIC X(5)   VALUE SPACE.
047300       04 XXCORRECT                  PIC X(20).
047400     02 INF-ANSI-REFERENCE           PIC X(48).
047500 01  HYPHEN-LINE.
047600     02 FILLER  PIC IS X VALUE IS SPACE.
047700     02 FILLER  PIC IS X(65)    VALUE IS "************************
047800-    "*****************************************".
047900     02 FILLER  PIC IS X(54)    VALUE IS "************************
048000-    "******************************".
048100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
048200     "NC250A".
048300 PROCEDURE DIVISION.
048400 CCVS1 SECTION.
048500 OPEN-FILES.
048600     OPEN     OUTPUT PRINT-FILE.
048700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
048800     MOVE    SPACE TO TEST-RESULTS.
048900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
049000     GO TO CCVS1-EXIT.
049100 CLOSE-FILES.
049200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
049300 TERMINATE-CCVS.
049400     STOP     RUN.
049500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
049600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
049700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
049800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
049900     MOVE "****TEST DELETED****" TO RE-MARK.
050000 PRINT-DETAIL.
050100     IF REC-CT NOT EQUAL TO ZERO
050200             MOVE "." TO PARDOT-X
050300             MOVE REC-CT TO DOTVALUE.
050400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
050500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
050600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
050700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
050800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
050900     MOVE SPACE TO CORRECT-X.
051000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
051100     MOVE     SPACE TO RE-MARK.
051200 HEAD-ROUTINE.
051300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
051600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
051700 COLUMN-NAMES-ROUTINE.
051800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
051900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
052100 END-ROUTINE.
052200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
052300 END-RTN-EXIT.
052400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052500 END-ROUTINE-1.
052600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
052700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
052800      ADD PASS-COUNTER TO ERROR-HOLD.
052900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
053000      MOVE PASS-COUNTER TO CCVS-E-4-1.
053100      MOVE ERROR-HOLD TO CCVS-E-4-2.
053200      MOVE CCVS-E-4 TO CCVS-E-2-2.
053300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
053400  END-ROUTINE-12.
053500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
053600     IF       ERROR-COUNTER IS EQUAL TO ZERO
053700         MOVE "NO " TO ERROR-TOTAL
053800         ELSE
053900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
054000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
054100     PERFORM WRITE-LINE.
054200 END-ROUTINE-13.
054300     IF DELETE-COUNTER IS EQUAL TO ZERO
054400         MOVE "NO " TO ERROR-TOTAL  ELSE
054500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
054600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
054700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054800      IF   INSPECT-COUNTER EQUAL TO ZERO
054900          MOVE "NO " TO ERROR-TOTAL
055000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
055100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
055200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055400 WRITE-LINE.
055500     ADD 1 TO RECORD-COUNT.
055600Y    IF RECORD-COUNT GREATER 50
055700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
055800Y        MOVE SPACE TO DUMMY-RECORD
055900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
056000Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
056100Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
056200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
056300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
056400Y        MOVE ZERO TO RECORD-COUNT.
056500     PERFORM WRT-LN.
056600 WRT-LN.
056700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
056800     MOVE SPACE TO DUMMY-RECORD.
056900 BLANK-LINE-PRINT.
057000     PERFORM WRT-LN.
057100 FAIL-ROUTINE.
057200     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
057500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
057600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
057700     MOVE   SPACES TO INF-ANSI-REFERENCE.
057800     GO TO  FAIL-ROUTINE-EX.
057900 FAIL-ROUTINE-WRITE.
058000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
058100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
058200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
058300     MOVE   SPACES TO COR-ANSI-REFERENCE.
058400 FAIL-ROUTINE-EX. EXIT.
058500 BAIL-OUT.
058600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
058700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
058800 BAIL-OUT-WRITE.
058900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
059000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
059100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
059200     MOVE   SPACES TO INF-ANSI-REFERENCE.
059300 BAIL-OUT-EX. EXIT.
059400 CCVS1-EXIT.
059500     EXIT.
059600 SECT-NC201A-001 SECTION.
059700*
059800 IF--INIT-A.
059900     MOVE   "VI-89 6.15" TO ANSI-REFERENCE.
060000     PERFORM END-ROUTINE.
060100     MOVE SPACE TO TEST-RESULTS.
060200     MOVE "THE FOLLOWING TESTS        " TO RE-MARK.
060300     PERFORM PRINT-DETAIL.
060400     MOVE "COMPARE FIGURATIVE         " TO RE-MARK.
060500     PERFORM PRINT-DETAIL.
060600     MOVE "CONSTANTS, SIGN OF DATA,   " TO RE-MARK.
060700     PERFORM PRINT-DETAIL.
060800     MOVE "AND CONDITION-NAMES        " TO RE-MARK.
060900     PERFORM PRINT-DETAIL.
061000     MOVE "IN VARYING COMBINATIONS.   " TO RE-MARK.
061100     PERFORM PRINT-DETAIL.
061200     MOVE "COMPARE--           " TO FEATURE.
061300     PERFORM PRINT-DETAIL.
061400     MOVE "  FIG. CONSTANTS    " TO FEATURE.
061500 IF--TEST-1.
061600     IF ZEROES IS EQUAL TO IF-D3 PERFORM PASS ELSE PERFORM FAIL.
061700*        NOTE FIGURATIVE ZEROES VS ALPHANUMERIC FIELD.
061800     GO TO IF--WRITE-1.
061900 IF--DELETE-1.
062000     PERFORM DE-LETE.
062100 IF--WRITE-1.
062200     MOVE "IF--TEST-1 " TO PAR-NAME.
062300     PERFORM PRINT-DETAIL.
062400 IF--TEST-2.
062500     IF SPACES EQUAL TO IF-D4 PERFORM PASS ELSE PERFORM FAIL.
062600*        NOTE FIGURATIVE SPACES VS ALPHANUMERIC FIELD.
062700     GO TO IF--WRITE-2.
062800 IF--DELETE-2.
062900     PERFORM DE-LETE.
063000 IF--WRITE-2.
063100     MOVE "IF--TEST-2 " TO PAR-NAME.
063200     PERFORM PRINT-DETAIL.
063300 IF--TEST-3.
063400     IF QUOTES EQUAL TO IF-D5 PERFORM PASS ELSE PERFORM FAIL.
063500*        NOTE FIGURATIVE QUOTES VS ALPHANUMERIC FIELD.
063600     GO TO IF--WRITE-3.
063700 IF--DELETE-3.
063800     PERFORM DE-LETE.
063900 IF--WRITE-3.
064000     MOVE "IF--TEST-3 " TO PAR-NAME.
064100     PERFORM PRINT-DETAIL.
064200 IF--TEST-4.
064300     IF IF-D6 EQUAL TO ALL "BA" PERFORM PASS ELSE PERFORM FAIL.
064400*        NOTE ALL ANY LITERAL VS ALPHANUMERIC FIELD.
064500     GO TO IF--WRITE-4.
064600 IF--DELETE-4.
064700     PERFORM DE-LETE.
064800 IF--WRITE-4.
064900     MOVE "IF--TEST-4 " TO PAR-NAME.
065000     PERFORM PRINT-DETAIL.
065100 IF--TEST-5.
065200     IF IF-D4 GREATER THAN SPACES PERFORM FAIL ELSE
065300     PERFORM PASS.
065400*        NOTE FIG-SPACES VS ALPHANUMERIC FIELD.
065500     GO TO IF--WRITE-5.
065600 IF--DELETE-5.
065700     PERFORM DE-LETE.
065800 IF--WRITE-5.
065900     MOVE "IF--TEST-5 " TO PAR-NAME.
066000     PERFORM PRINT-DETAIL.
066100 IF--TEST-6.
066200     IF QUOTES GREATER THAN IF-D5 PERFORM FAIL ELSE PERFORM PASS.
066300*        NOTE FIG-QUOTES VS ALPHANUMERIC FIELD.
066400     GO TO IF--WRITE-6.
066500 IF--DELETE-6.
066600     PERFORM DE-LETE.
066700 IF--WRITE-6.
066800     MOVE "IF--TEST-6 " TO PAR-NAME.
066900     PERFORM PRINT-DETAIL.
067000 IF--TEST-7.
067100     IF ALL "BA" GREATER THAN IF-D6 PERFORM FAIL
067200     ELSE PERFORM PASS.
067300*    NOTE ALL ANY LITERAL VS ALPHA FIELD.
067400     GO TO IF--WRITE-7.
067500 IF--DELETE-7.
067600     PERFORM DE-LETE.
067700 IF--WRITE-7.
067800     MOVE "IF--TEST-7 " TO PAR-NAME.
067900     PERFORM PRINT-DETAIL.
068000 IF--INIT-B.
068100     MOVE "  UNEQUAL LENGTHS   " TO FEATURE.
068200 IF--TEST-8.
068300     IF IF-D22 GREATER THAN IF-D19 PERFORM FAIL ELSE PERFORM PASS.
068400*        NOTE ALPHANUMERIC GROUP VS ALPHANUMERIC FIELD.
068500*    NOTE UNEQUAL LENGTHS.
068600     GO TO IF--WRITE-8.
068700 IF--DELETE-8.
068800     PERFORM DE-LETE.
068900 IF--WRITE-8.
069000     MOVE "IF--TEST-8 " TO PAR-NAME.
069100     PERFORM PRINT-DETAIL.
069200 IF--INIT-C.
069300     MOVE "  POSITIVE          " TO FEATURE.
069400 IF--TEST-9.
069500     IF IF-D1 IS NOT POSITIVE PERFORM PASS ELSE PERFORM FAIL.
069600*        NOTE POSITIVE TEST ON ZERO VALUE.
069700     GO TO IF--WRITE-9.
069800 IF--DELETE-9.
069900     PERFORM DE-LETE.
070000 IF--WRITE-9.
070100     MOVE "IF--TEST-9 " TO PAR-NAME.
070200     PERFORM PRINT-DETAIL.
070300 IF--TEST-10.
070400     IF IF-D8 POSITIVE PERFORM PASS ELSE      PERFORM FAIL.
070500*        NOTE POSITIVE TEST ON UNSIGNED VALUE.
070600     GO TO IF--WRITE-10.
070700 IF--DELETE-10.
070800     PERFORM DE-LETE.
070900 IF--WRITE-10.
071000     MOVE "IF--TEST-10" TO PAR-NAME.
071100     PERFORM PRINT-DETAIL.
071200 IF--TEST-11.
071300     IF IF-D16 POSITIVE PERFORM PASS ELSE PERFORM FAIL.
071400*        NOTE POSITIVE TEST ON SCALED VALUE.
071500     GO TO IF--WRITE-11.
071600 IF--DELETE-11.
071700     PERFORM DE-LETE.
071800 IF--WRITE-11.
071900     MOVE "IF--TEST-11" TO PAR-NAME.
072000     PERFORM PRINT-DETAIL.
072100 IF--TEST-12.
072200     IF IF-D27 POSITIVE PERFORM PASS ELSE PERFORM FAIL.
072300*        NOTE POSITIVE TEST ON COMPUTATIONAL FIELD.
072400     GO TO IF--WRITE-12.
072500 IF--DELETE-12.
072600     PERFORM DE-LETE.
072700 IF--WRITE-12.
072800     MOVE "IF--TEST-12" TO PAR-NAME.
072900     PERFORM PRINT-DETAIL.
073000 IF--TEST-13.
073100     IF IF-D28 POSITIVE PERFORM PASS ELSE PERFORM FAIL.
073200*        NOTE POSITIVE TEST ON NUMERIC DISPLAY IFELD.
073300     GO TO IF--WRITE-13.
073400 IF--DELETE-13.
073500     PERFORM DE-LETE.
073600 IF--WRITE-13.
073700     MOVE "IF--TEST-13" TO PAR-NAME.
073800     PERFORM PRINT-DETAIL.
073900 IF--TEST-14.
074000     IF IF-D31 IS POSITIVE PERFORM FAIL ELSE PERFORM PASS.
074100*        NOTE POSITIVE TEST ON NEGATIVE FIELD.
074200     GO TO IF--WRITE-14.
074300 IF--DELETE-14.
074400     PERFORM DE-LETE.
074500 IF--WRITE-14.
074600     MOVE "IF--TEST-14" TO PAR-NAME.
074700     PERFORM PRINT-DETAIL.
074800 IF--TEST-15.
074900     IF IF-D31 IS NOT POSITIVE PERFORM PASS ELSE PERFORM FAIL.
075000*        NOTE NOT POSITIVE TEST ON NEGATIVE VALUE.
075100     GO TO IF--WRITE-15.
075200 IF--DELETE-15.
075300     PERFORM DE-LETE.
075400 IF--WRITE-15.
075500     MOVE "IF--TEST-15" TO PAR-NAME.
075600     PERFORM PRINT-DETAIL.
075700 IF--TEST-16.
075800     IF IF-D28 IS NOT POSITIVE PERFORM FAIL ELSE PERFORM PASS.
075900*        NOTE NOT POSITIVE TEST ON UNSIGNED FIELD.
076000     GO TO IF--WRITE-16.
076100 IF--DELETE-16.
076200     PERFORM DE-LETE.
076300 IF--WRITE-16.
076400     MOVE "IF--TEST-16" TO PAR-NAME.
076500     PERFORM PRINT-DETAIL.
076600 IF--INIT-D.
076700     MOVE "  NEGATIVE          " TO FEATURE.
076800 IF--TEST-17.
076900     IF IF-D31 IS NEGATIVE PERFORM PASS ELSE PERFORM FAIL.
077000*        NOTE NEGATIVE TEST ON NEGATIVE VALUE.
077100     GO TO IF--WRITE-17.
077200 IF--DELETE-17.
077300     PERFORM DE-LETE.
077400 IF--WRITE-17.
077500     MOVE "IF--TEST-17" TO PAR-NAME.
077600     PERFORM PRINT-DETAIL.
077700 IF--TEST-18.
077800     IF IF-D31 IS NOT NEGATIVE PERFORM FAIL ELSE PERFORM PASS.
077900*        NOTE NOT NEGATIVE TEST ON NEGATIVE VALUE.
078000     GO TO IF--WRITE-18.
078100 IF--DELETE-18.
078200     PERFORM DE-LETE.
078300 IF--WRITE-18.
078400     MOVE "IF--TEST-18" TO PAR-NAME.
078500     PERFORM PRINT-DETAIL.
078600 IF--TEST-19.
078700     IF IF-D16 NOT NEGATIVE PERFORM PASS ELSE PERFORM FAIL.
078800*        NOTE NOT NEGATIVE TEST ON UNSIGNED FIELD.
078900     GO TO IF--WRITE-19.
079000 IF--DELETE-19.
079100     PERFORM DE-LETE.
079200 IF--WRITE-19.
079300     MOVE "IF--TEST-19" TO PAR-NAME.
079400     PERFORM PRINT-DETAIL.
079500 IF--INIT-E.
079600     MOVE "  ZERO              " TO FEATURE.
079700 IF--TEST-20.
079800     IF IF-D1 IS ZERO PERFORM PASS ELSE PERFORM FAIL.
079900*        NOTE ZERO TEST ON ZERO VALUE.
080000     GO TO IF--WRITE-20.
080100 IF--DELETE-20.
080200     PERFORM DE-LETE.
080300 IF--WRITE-20.
080400     MOVE "IF--TEST-20" TO PAR-NAME.
080500     PERFORM PRINT-DETAIL.
080600 IF--TEST-21.
080700     IF IF-D10 NOT EQUAL TO ZERO
080800         PERFORM PASS  ELSE
080900     MOVE IF-D10 TO COMPUTED-A
081000     MOVE ZERO TO CORRECT-N
081100     PERFORM FAIL.
081200*    NOTE NOT EQUAL TO ZERO TEST ON NON-ZERO VALUE.
081300     GO TO IF--WRITE-21.
081400 IF--DELETE-21.
081500     PERFORM DE-LETE.
081600 IF--WRITE-21.
081700     MOVE "IF--TEST-21" TO PAR-NAME.
081800     PERFORM PRINT-DETAIL.
081900 IF--INIT-F.
082000     MOVE "  CONDITION-NAMES   " TO FEATURE.
082100 IF--TEST-22.
082200     MOVE 1 TO IF-D32. IF A OF IF-D32 PERFORM PASS
082300     ELSE PERFORM FAIL.
082400*        NOTE TEST OF SIGNED NUMERIC FIELD FOR SINGLE VALUE.
082500     GO TO IF--WRITE-22.
082600 IF--DELETE-22.
082700     PERFORM DE-LETE.
082800 IF--WRITE-22.
082900     MOVE "IF--TEST-22" TO PAR-NAME.
083000     PERFORM PRINT-DETAIL.
083100 IF--TEST-23.
083200     MOVE 3 TO IF-D32. IF B OF IF-D32 PERFORM PASS
083300     ELSE PERFORM FAIL.
083400*        NOTE TEST OF SIGNED NUMERIC FIELD FOR MULTIPLE VALUES.
083500     GO TO IF--WRITE-23.
083600 IF--DELETE-23.
083700     PERFORM DE-LETE.
083800 IF--WRITE-23.
083900     MOVE "IF--TEST-23" TO PAR-NAME.
084000     PERFORM PRINT-DETAIL.
084100 IF--TEST-24.
084200             MOVE ZERO   TO IF-D32. IF C OF IF-D32 PERFORM PASS
084300     ELSE PERFORM FAIL.
084400*        NOTE TEST OF SIGNED NUMERIC FIELD FOR FIG-ZERO.
084500     GO TO IF--WRITE-24.
084600 IF--DELETE-24.
084700     PERFORM DE-LETE.
084800 IF--WRITE-24.
084900     MOVE "IF--TEST-24" TO PAR-NAME.
085000     PERFORM PRINT-DETAIL.
085100 IF--TEST-25.
085200     MOVE +12.34 TO IF-D32.
085300     IF D OF IF-D32 PERFORM PASS ELSE PERFORM FAIL.
085400*    NOTE SIGNED CONDITION-NAME.
085500     GO TO IF--WRITE-25.
085600 IF--DELETE-25.
085700     PERFORM DE-LETE.
085800 IF--WRITE-25.
085900     MOVE "IF--TEST-25" TO PAR-NAME.
086000     PERFORM PRINT-DETAIL.
086100 IF--TEST-26.
086200     MOVE QUOTE  TO IF-D33. IF B OF IF-D33 AND NOT B OF IF-D32
086300     PERFORM PASS ELSE PERFORM FAIL.
086400*        NOTE TEST OF ALPHANUMERIC FIELD FOR FIG-QUOTES.
086500     GO TO IF--WRITE-26.
086600 IF--DELETE-26.
086700     PERFORM DE-LETE.
086800 IF--WRITE-26.
086900     MOVE "IF--TEST-26" TO PAR-NAME.
087000     PERFORM PRINT-DETAIL.
087100 IF--TEST-27.
087200     MOVE SPACE TO IF-D33. IF C OF IF-D33 PERFORM PASS
087300     ELSE PERFORM FAIL.
087400*        NOTE TEST OF ALPHANUMERIC FIELD FOR FIG-SPACES.
087500     GO TO IF--WRITE-27.
087600 IF--DELETE-27.
087700     PERFORM DE-LETE.
087800 IF--WRITE-27.
087900     MOVE "IF--TEST-27" TO PAR-NAME.
088000     PERFORM PRINT-DETAIL.
088100 IF--TEST-28.
088200     MOVE "BACB" TO IF-D33. IF D OF IF-D33 PERFORM PASS
088300     ELSE PERFORM FAIL.
088400*        NOTE TEST OF ALPHANUMERIC FIELD FOR ALL ANY LITERAL.
088500     GO TO IF--WRITE-28.
088600 IF--DELETE-28.
088700     PERFORM DE-LETE.
088800 IF--WRITE-28.
088900     MOVE "IF--TEST-28" TO PAR-NAME.
089000     PERFORM PRINT-DETAIL.
089100 IF--TEST-29.
089200     IF NOT B OF IF-D34 PERFORM PASS ELSE PERFORM FAIL.
089300     GO TO IF--WRITE-29.
089400 IF--DELETE-29.
089500     PERFORM DE-LETE.
089600 IF--WRITE-29.
089700     MOVE "IF--TEST-29" TO PAR-NAME.
089800     PERFORM PRINT-DETAIL.
089900 IF--TEST-30.
090000     MOVE "ABCD" TO IF-D35.
090100     IF A2 AND B2 PERFORM PASS ELSE PERFORM FAIL.
090200     GO TO IF--WRITE-30.
090300 IF--DELETE-30.
090400     PERFORM DE-LETE.
090500 IF--WRITE-30.
090600     MOVE "IF--TEST-30" TO PAR-NAME.
090700     PERFORM PRINT-DETAIL.
090800 IF--TEST-31.
090900     MOVE .21 TO IF-D32.
091000     IF E PERFORM PASS ELSE PERFORM FAIL.
091100*    NOTE TESTS VALUE SERIES.
091200     GO TO IF--WRITE-31.
091300 IF--DELETE-31.
091400     PERFORM DE-LETE.
091500 IF--WRITE-31.
091600     MOVE "IF--TEST-31" TO PAR-NAME.
091700     PERFORM PRINT-DETAIL.
091800 IF--TEST-32.
091900     MOVE 1279.99 TO IF-D32.
092000     IF F PERFORM PASS ELSE PERFORM FAIL.
092100*    NOTE TESTS VALUE RANGE SERIES.
092200     GO TO IF--WRITE-32.
092300 IF--DELETE-32.
092400     PERFORM DE-LETE.
092500 IF--WRITE-32.
092600     MOVE "IF--TEST-32" TO PAR-NAME.
092700     PERFORM PRINT-DETAIL.
092800 IF--TEST-33.
092900     MOVE -4321.88 TO IF-D32.
093000     IF G PERFORM PASS ELSE PERFORM FAIL.
093100*    NOTE TESTS VALUE SERIES RANGE SERIES.
093200     GO TO IF--WRITE-33.
093300 IF--DELETE-33.
093400     PERFORM DE-LETE.
093500 IF--WRITE-33.
093600     MOVE "IF--TEST-33" TO PAR-NAME.
093700     PERFORM PRINT-DETAIL.
093800 IF--INIT-G.
093900     PERFORM END-ROUTINE.
094000     MOVE SPACES TO FEATURE.
094100     MOVE "THE FOLLOWING TESTS USE ARITHMETIC-EXPRESSIONS"
094200     TO RE-MARK.
094300     PERFORM PRINT-DETAIL.
094400     MOVE "IN RELATION OR SIGN CONDITIONS."
094500     TO RE-MARK.
094600     PERFORM PRINT-DETAIL.
094700     MOVE "  EQUAL             " TO FEATURE.
094800 IF--TEST-34.
094900     IF  1 + (TWO * 3) EQUAL TO (TWO * 3) + 1
095000               PERFORM PASS
095100     ELSE
095200               PERFORM FAIL.
095300     GO TO IF--WRITE-34.
095400 IF--DELETE-34.
095500     PERFORM DE-LETE.
095600 IF--WRITE-34.
095700     MOVE "IF--TEST-34" TO PAR-NAME.
095800     PERFORM PRINT-DETAIL.
095900 IF--TEST-35.
096000     IF 9 + TWO + 2 * 3 EQUAL TO 2 * 3 + TWO + 9
096100         PERFORM PASS
096200     ELSE
096300         PERFORM FAIL.
096400     GO TO IF--WRITE-35.
096500 IF--DELETE-35.
096600     PERFORM DE-LETE.
096700 IF--WRITE-35.
096800     MOVE "IF--TEST-35" TO PAR-NAME.
096900     PERFORM PRINT-DETAIL.
097000 IF--TEST-36.
097100     IF  NINE ** 2 EQUAL TO 9 ** 2
097200              PERFORM PASS
097300     ELSE
097400              PERFORM FAIL.
097500     GO TO IF--WRITE-36.
097600 IF--DELETE-36.
097700     PERFORM DE-LETE.
097800 IF--WRITE-36.
097900     MOVE "IF--TEST-36" TO PAR-NAME.
098000     PERFORM PRINT-DETAIL.
098100 IF--TEST-37.
098200     IF 100 + (TWENTY + 3.4) + .05 EQUAL TO
098300        .05 + (100 + TWENTY) + 3.4
098400            PERFORM PASS
098500     ELSE
098600            PERFORM FAIL.
098700     GO TO IF--WRITE-37.
098800 IF--DELETE-37.
098900     PERFORM DE-LETE.
099000 IF--WRITE-37.
099100     MOVE "IF--TEST-37" TO PAR-NAME.
099200     PERFORM PRINT-DETAIL.
099300 IF--INIT-H.
099400     MOVE "  GREATER           " TO FEATURE.
099500 IF--TEST-38.
099600     IF NINE * 8 IS GREATER THAN  9 * 7 + 8 PERFORM PASS
099700     ELSE PERFORM FAIL.
099800     GO TO IF--WRITE-38.
099900 IF--DELETE-38.
100000     PERFORM DE-LETE.
100100 IF--WRITE-38.
100200     MOVE "IF--TEST-38" TO PAR-NAME.
100300     PERFORM PRINT-DETAIL.
100400 IF--TEST-39.
100500     IF  10 ** 2 + 25 GREATER THAN IF-D14 PERFORM PASS ELSE
100600     PERFORM FAIL.
100700     GO TO IF--WRITE-39.
100800 IF--DELETE-39.
100900     PERFORM DE-LETE.
101000 IF--WRITE-39.
101100     MOVE "IF--TEST-39" TO PAR-NAME.
101200     PERFORM PRINT-DETAIL.
101300 IF--TEST-40.
101400     IF 1000 GREATER THAN TEN ** 3 - 1 PERFORM PASS ELSE PERFORM
101500     FAIL.
101600     GO TO IF--WRITE-40.
101700 IF--DELETE-40.
101800     PERFORM DE-LETE.
101900 IF--WRITE-40.
102000     MOVE "IF--TEST-40" TO PAR-NAME.
102100     PERFORM PRINT-DETAIL.
102200 IF--INIT-I.
102300     MOVE "  LESS              " TO FEATURE.
102400 IF--TEST-41.
102500     IF 1000 LESS THAN 10 ** THREE + 1 PERFORM PASS ELSE
102600     PERFORM FAIL.
102700     GO TO IF--WRITE-41.
102800 IF--DELETE-41.
102900     PERFORM DE-LETE.
103000 IF--WRITE-41.
103100     MOVE "IF--TEST-41" TO PAR-NAME.
103200     PERFORM PRINT-DETAIL.
103300 IF--TEST-42.
103400     IF 10 ** 2 + 20 LESS THAN IF-D14 PERFORM PASS ELSE
103500     PERFORM FAIL.
103600     GO TO IF--WRITE-42.
103700 IF--DELETE-42.
103800     PERFORM DE-LETE.
103900 IF--WRITE-42.
104000     MOVE "IF--TEST-42" TO PAR-NAME.
104100     PERFORM PRINT-DETAIL.
104200 IF--TEST-43.
104300     IF 9 * 8 LESS THAN 9 * 7 + TEN PERFORM PASS ELSE PERFORM
104400     FAIL.
104500     GO TO IF--WRITE-43.
104600 IF--DELETE-43.
104700     PERFORM DE-LETE.
104800 IF--WRITE-43.
104900     MOVE "IF--TEST-43" TO PAR-NAME.
105000     PERFORM PRINT-DETAIL.
105100 IF--TEST-44-45.
105200     MOVE SPACES TO TEST-RESULTS.
105300     MOVE "NOT USED" TO RE-MARK.
105400     MOVE "IF--TEST-44" TO PAR-NAME.
105500     PERFORM PRINT-DETAIL.
105600     MOVE "NOT USED" TO RE-MARK.
105700     MOVE "IF--TEST-45" TO PAR-NAME.
105800     PERFORM PRINT-DETAIL.
105900 IF--INIT-J.
106000     MOVE "  NOT EQUAL          " TO FEATURE.
106100     PERFORM PRINT-DETAIL.
106200 IF--TEST-46.
106300     IF NINE * 9 - 7 * SEVEN NOT EQUAL - (SEVEN * 7) + 9 * NINE
106400                PERFORM FAIL
106500     ELSE
106600                PERFORM PASS.
106700
106800     GO TO IF--WRITE-46.
106900 IF--DELETE-46.
107000     PERFORM DE-LETE.
107100 IF--WRITE-46.
107200     MOVE "IF--TEST-46" TO PAR-NAME.
107300     PERFORM PRINT-DETAIL.
107400 IF--TEST-47.
107500     IF IF-D14 - IF-D7 NOT EQUAL - IF-D7 + IF-D14
107600     PERFORM FAIL ELSE PERFORM PASS.
107700     GO TO IF--WRITE-47.
107800 IF--DELETE-47.
107900     PERFORM DE-LETE.
108000 IF--WRITE-47.
108100     MOVE "IF--TEST-47" TO PAR-NAME.
108200     PERFORM PRINT-DETAIL.
108300 IF--INIT-K.
108400     MOVE "  NOT GREATER       " TO FEATURE.
108500 IF--TEST-48.
108600     IF NINE * 8 IS NOT GREATER THAN 9 * SEVEN + 8 THEN
108700                   PERFORM FAIL
108800     ELSE
108900                   PERFORM PASS.
109000     GO TO IF--WRITE-48.
109100 IF--DELETE-48.
109200     PERFORM DE-LETE.
109300 IF--WRITE-48.
109400     MOVE "IF--TEST-48" TO PAR-NAME.
109500     PERFORM PRINT-DETAIL.
109600 IF--TEST-49.
109700     IF 10 ** 2 + 25 NOT GREATER THAN IF-D14 PERFORM FAIL ELSE
109800     PERFORM PASS.
109900     GO TO IF--WRITE-49.
110000 IF--DELETE-49.
110100     PERFORM DE-LETE.
110200 IF--WRITE-49.
110300     MOVE "IF--TEST-49" TO PAR-NAME.
110400     PERFORM PRINT-DETAIL.
110500 IF--TEST-50.
110600     IF 1000 NOT GREATER THAN 10 ** THREE - 1 PERFORM FAIL ELSE
110700     PERFORM PASS.
110800     GO TO IF--WRITE-50.
110900 IF--DELETE-50.
111000     PERFORM DE-LETE.
111100 IF--WRITE-50.
111200     MOVE "IF--TEST-50" TO PAR-NAME.
111300     PERFORM PRINT-DETAIL.
111400 IF--INIT-L.
111500     MOVE "  NOT LESS          " TO FEATURE.
111600 IF--TEST-51.
111700     IF 1000 NOT LESS THAN TEN ** 3 + 1 PERFORM FAIL ELSE
111800     PERFORM PASS.
111900     GO TO IF--WRITE-51.
112000 IF--DELETE-51.
112100     PERFORM DE-LETE.
112200 IF--WRITE-51.
112300     MOVE "IF--TEST-51" TO PAR-NAME.
112400     PERFORM PRINT-DETAIL.
112500 IF--TEST-52.
112600     IF 10 ** 2 + 20 NOT LESS THAN IF-D14 PERFORM FAIL ELSE
112700     PERFORM PASS.
112800     GO TO IF--WRITE-52.
112900 IF--DELETE-52.
113000     PERFORM DE-LETE.
113100 IF--WRITE-52.
113200     MOVE "IF--TEST-52" TO PAR-NAME.
113300     PERFORM PRINT-DETAIL.
113400 IF--TEST-53.
113500     IF NINE * 8 NOT LESS THAN 9 * 7 + TEN PERFORM FAIL ELSE
113600     PERFORM PASS.
113700     GO TO IF--WRITE-53.
113800 IF--DELETE-53.
113900     PERFORM DE-LETE.
114000 IF--WRITE-53.
114100     MOVE "IF--TEST-53" TO PAR-NAME.
114200     PERFORM PRINT-DETAIL.
114300 IF--INIT-M.
114400     MOVE "  POS, NEG, ZERO    " TO FEATURE.
114500 IF--TEST-54.
114600     IF 9 ** TWO + (180 - 90) IS NOT POSITIVE PERFORM FAIL ELSE
114700     PERFORM PASS.
114800     GO TO IF--WRITE-54.
114900 IF--DELETE-54.
115000     PERFORM DE-LETE.
115100 IF--WRITE-54.
115200     MOVE "IF--TEST-54" TO PAR-NAME.
115300     PERFORM PRINT-DETAIL.
115400 IF--TEST-55.
115500     IF NINE ** 2 + (90 - 180) IS POSITIVE PERFORM FAIL ELSE
115600     PERFORM PASS.
115700     GO TO IF--WRITE-55.
115800 IF--DELETE-55.
115900     PERFORM DE-LETE.
116000 IF--WRITE-55.
116100     MOVE "IF--TEST-55" TO PAR-NAME.
116200     PERFORM PRINT-DETAIL.
116300 IF--TEST-56.
116400     IF 8 * EIGHT - 8 * 8 NOT ZERO
116500             PERFORM FAIL ELSE PERFORM PASS.
116600     GO TO IF--WRITE-56.
116700 IF--DELETE-56.
116800     PERFORM DE-LETE.
116900 IF--WRITE-56.
117000     MOVE "IF--TEST-56" TO PAR-NAME.
117100     PERFORM PRINT-DETAIL.
117200 IF--TEST-57-58.
117300     MOVE SPACES TO TEST-RESULTS.
117400     MOVE "NOT USED" TO RE-MARK.
117500     MOVE "IF--TEST-57" TO PAR-NAME.
117600     PERFORM PRINT-DETAIL.
117700     MOVE "NOT USED" TO RE-MARK.
117800     MOVE "IF--TEST-58" TO PAR-NAME.
117900     PERFORM PRINT-DETAIL.
118000     MOVE "  POS, NEG, ZERO     " TO FEATURE.
118100 IF--TEST-59.
118200     IF 10 ** THREE + 99 - (1500 - 400) IS NEGATIVE PERFORM PASS
118300     ELSE PERFORM FAIL.
118400     GO TO IF--WRITE-59.
118500 IF--DELETE-59.
118600     PERFORM DE-LETE.
118700 IF--WRITE-59.
118800     MOVE "IF--TEST-59" TO PAR-NAME.
118900     PERFORM PRINT-DETAIL.
119000 IF--TEST-60.
119100     IF TEN ** 3 + 99 - (1500 - 400) IS NOT POSITIVE PERFORM PASS
119200     ELSE PERFORM FAIL.
119300     GO TO IF--WRITE-60.
119400 IF--DELETE-60.
119500     PERFORM DE-LETE.
119600 IF--WRITE-60.
119700     MOVE "IF--TEST-60" TO PAR-NAME.
119800     PERFORM PRINT-DETAIL.
119900 IF--TEST-61.
120000     IF 8 * EIGHT - 8 * 8 IS ZERO
120100             PERFORM PASS ELSE PERFORM FAIL.
120200     GO TO IF--WRITE-61.
120300 IF--DELETE-61.
120400     PERFORM DE-LETE.
120500 IF--WRITE-61.
120600     MOVE "IF--TEST-61" TO PAR-NAME.
120700     PERFORM PRINT-DETAIL.
120800 IF--TEST-62.
120900     MOVE SPACES TO TEST-RESULTS.
121000     MOVE "NOT USED" TO RE-MARK.
121100     MOVE "IF--TEST-62" TO PAR-NAME.
121200     PERFORM PRINT-DETAIL.
121300     MOVE "POS, NEG, ZERO      " TO FEATURE.
121400 IF--TEST-63.
121500     IF 10 ** THREE + 99 - (1500 - 400) IS NOT NEGATIVE
121600              PERFORM FAIL ELSE PERFORM PASS.
121700     GO TO IF--WRITE-63.
121800 IF--DELETE-63.
121900     PERFORM DE-LETE.
122000 IF--WRITE-63.
122100     MOVE "IF--TEST-63" TO PAR-NAME.
122200     PERFORM PRINT-DETAIL.
122300 IF--INIT-N.
122400     MOVE "  SYMBOLS > < =     " TO FEATURE.
122500 IF--TEST-64.
122600     IF TEN * 10 - 10 * 10 = - TEN * 10 + 10 * 10
122700               PERFORM PASS
122800     ELSE
122900               PERFORM FAIL.
123000     GO TO IF--WRITE-64.
123100 IF--DELETE-64.
123200     PERFORM DE-LETE.
123300 IF--WRITE-64.
123400     MOVE "IF--TEST-64" TO PAR-NAME.
123500     PERFORM PRINT-DETAIL.
123600 IF--TEST-65.
123700     IF NINE * 8 > 9 * 7 + 8 PERFORM PASS ELSE PERFORM FAIL.
123800     GO TO IF--WRITE-65.
123900 IF--DELETE-65.
124000     PERFORM DE-LETE.
124100 IF--WRITE-65.
124200     MOVE "IF--TEST-65" TO PAR-NAME.
124300     PERFORM PRINT-DETAIL.
124400 IF--TEST-66.
124500     IF 1000 < 10 ** THREE + 1 PERFORM PASS ELSE PERFORM FAIL.
124600     GO TO IF--WRITE-66.
124700 IF--DELETE-66.
124800     PERFORM DE-LETE.
124900 IF--WRITE-66.
125000     MOVE "IF--TEST-66" TO PAR-NAME.
125100     PERFORM PRINT-DETAIL.
125200 IF--TEST-67.
125300     IF 100 + TWENTY + 3.4 + .05 NOT = 100 + TWENTY + 3.4 + 0.6
125400          PERFORM PASS
125500     ELSE
125600          PERFORM FAIL.
125700     GO TO IF--WRITE-67.
125800 IF--DELETE-67.
125900     PERFORM DE-LETE.
126000 IF--WRITE-67.
126100     MOVE "IF--TEST-67" TO PAR-NAME.
126200     PERFORM PRINT-DETAIL.
126300 IF--TEST-68.
126400     IF NINE * 8 NOT > 9 * 7 + 8 PERFORM FAIL ELSE PERFORM PASS.
126500     GO TO IF--WRITE-68.
126600 IF--DELETE-68.
126700     PERFORM DE-LETE.
126800 IF--WRITE-68.
126900     MOVE "IF--TEST-68" TO PAR-NAME.
127000     PERFORM PRINT-DETAIL.
127100 IF--TEST-69.
127200     IF 1000 NOT < 10 ** THREE + 1 PERFORM FAIL ELSE PERFORM PASS.
127300     GO TO IF--WRITE-69.
127400 IF--DELETE-69.
127500     PERFORM DE-LETE.
127600 IF--WRITE-69.
127700     MOVE "IF--TEST-69" TO PAR-NAME.
127800     PERFORM PRINT-DETAIL.
127900 IF--TEST-70.
128000     MOVE SPACES TO TEST-RESULTS.
128100     MOVE "NOT USED" TO RE-MARK.
128200     MOVE "IF--TEST-70" TO PAR-NAME.
128300     PERFORM PRINT-DETAIL.
128400 IF--INIT-N1.
128500     PERFORM END-ROUTINE.
128600     MOVE SPACES TO FEATURE.
128700     MOVE "THE FOLLOWING TESTS COMBINATIONS OF"
128800             TO RE-MARK.
128900     PERFORM PRINT-DETAIL.
129000     MOVE "RELATIONAL AND SIZE ERROR CONDITIONS."
129100             TO RE-MARK.
129200     PERFORM PRINT-DETAIL.
129300 IF--TEST-71.
129400     MOVE     "X" TO WRK-XN-00001.
129500     MOVE     ZERO TO WRK-DS-01V00.
129600     IF       WRK-XN-00001 IS EQUAL TO "X"
129700              MOVE "Z" TO WRK-XN-00001
129800              ADD 1 TO WRK-DS-01V00 ON SIZE ERROR
129900              MOVE "Y" TO WRK-XN-00001
130000              ELSE
130100              ADD 2 TO WRK-DS-01V00 ON SIZE ERROR
130200              MOVE "W" TO WRK-XN-00001.
130300     IF  WRK-XN-00001 EQUAL TO "Z" AND
130400              WRK-DS-01V00 EQUAL TO 1
130500              PERFORM PASS ELSE PERFORM FAIL.
130600*    NOTE     COMBINATION OF RELATIONAL AND SIZE ERROR CONDITIONS.
130700     GO       TO IF--WRITE-71.
130800 IF--DELETE-71.
130900     PERFORM  DE-LETE.
131000 IF--WRITE-71.
131100     MOVE     "  INCL SIZE ERROR" TO FEATURE.
131200     MOVE     "IF--TEST-71" TO PAR-NAME.
131300     PERFORM  PRINT-DETAIL.
131400 IF--INIT-O.
131500     MOVE     "  UNEQUAL LENGTHS" TO FEATURE.
131600 IF--TEST-73.
131700     MOVE     "X" TO WRK-XN-00001.
131800     MOVE     "X    " TO WRK-XN-00005.
131900     IF       WRK-XN-00001 IS EQUAL TO WRK-XN-00005
132000              PERFORM PASS ELSE PERFORM FAIL.
132100*    NOTE     EQUAL QUANTITIES IN UNEQUAL LENGTH FIELDS.
132200     GO       TO IF--WRITE-73.
132300 IF--DELETE-73.
132400     PERFORM  DE-LETE.
132500 IF--WRITE-73.
132600     MOVE     "IF--TEST-73" TO PAR-NAME.
132700     PERFORM  PRINT-DETAIL.
132800 IF--TEST-74.
132900     MOVE     "X" TO WRK-XN-00001.
133000     MOVE     "Y    " TO WRK-XN-00005.
133100     IF       WRK-XN-00001 IS NOT EQUAL TO WRK-XN-00005
133200              PERFORM PASS ELSE PERFORM FAIL.
133300*    NOTE     UNEQUAL QUANTITIES IN UNEQUAL LENGTH FIELDS.
133400     GO       TO IF--WRITE-74.
133500 IF--DELETE-74.
133600     PERFORM  DE-LETE.
133700 IF--WRITE-74.
133800     MOVE     "IF--TEST-74" TO PAR-NAME.
133900     PERFORM  PRINT-DETAIL.
134000 IF--TEST-75.
134100     MOVE     "X" TO WRK-XN-00001.
134200     MOVE     "X   X" TO WRK-XN-00005.
134300     IF       WRK-XN-00001 IS NOT EQUAL TO WRK-XN-00005
134400              PERFORM PASS ELSE PERFORM FAIL.
134500*    NOTE     UNEQUAL QUANTITIES IN UNEQUAL LENGTH FIELDS.
134600     GO       TO IF--WRITE-75.
134700 IF--DELETE-75.
134800     PERFORM  DE-LETE.
134900 IF--WRITE-75.
135000     MOVE     "IF--TEST-75" TO PAR-NAME.
135100     PERFORM PRINT-DETAIL.
135200 IF--INIT-P.
135300     MOVE     "  UNEQUAL LENGTHS" TO FEATURE.
135400 IF--TEST-77.
135500     IF       IF-D37 NOT EQUAL TO IF-D21
135600              PERFORM PASS GO TO IF--WRITE-77.
135700*    NOTE     NUMERIC VS GROUP COMPARISON, UNEQUAL LENGTHS.
135800     GO       TO IF--FAIL-77.
135900 IF--DELETE-77.
136000     PERFORM DE-LETE.
136100     GO       TO IF--WRITE-11.
136200 IF--FAIL-77.
136300     PERFORM  FAIL.
136400     MOVE     "IF-D37 SHOULD PAD ON RIGHT" TO RE-MARK.
136500 IF--WRITE-77.
136600     MOVE     "IF--TEST-77" TO PAR-NAME.
136700     PERFORM  PRINT-DETAIL.
136800 IF--TEST-78.
136900     IF       IF-D37 EQUAL TO IF-D38
137000              PERFORM PASS GO TO IF--WRITE-78.
137100*    NOTE     NUMERIC VS ALPHANUMERIC COMPARISON, UNEQUAL LENGTHS.
137200     GO       TO IF--FAIL-78.
137300 IF--DELETE-78.
137400     PERFORM  DE-LETE.
137500     GO       TO IF--WRITE-78.
137600 IF--FAIL-78.
137700     PERFORM  FAIL.
137800     MOVE     "IF-D37 SHOULD PAD ON RIGHT" TO RE-MARK.
137900 IF--WRITE-78.
138000     MOVE     "IF--TEST-78" TO PAR-NAME.
138100     PERFORM  PRINT-DETAIL.
138200 IF--TEST-79.
138300     MOVE ZERO TO IF-D10.
138400     IF D3 OF IF-D10 EQUAL TO "00000000"
138500         PERFORM PASS
138600         GO TO IF-WRITE-79.
138700     MOVE D3 IN IF-D10 TO COMPUTED-A.
138800     MOVE "00000000" TO CORRECT-A.
138900     PERFORM FAIL.
139000     GO TO IF-WRITE-79.
139100 IF-DELETE-79.
139200     PERFORM DE-LETE.
139300 IF-WRITE-79.
139400     MOVE "QUALIFIED GROUP   " TO FEATURE.
139500     MOVE "IF--TEST-79 " TO PAR-NAME.
139600     PERFORM PRINT-DETAIL.
139700 IF--INIT-80.
139800     PERFORM END-ROUTINE.
139900     MOVE SPACES TO FEATURE.
140000     MOVE "THESE SPECIAL CONDITION-   " TO RE-MARK.
140100     PERFORM PRINT-DETAIL.
140200     MOVE "NAME TESTS VERIFY THE    " TO RE-MARK.
140300     PERFORM PRINT-DETAIL.
140400     MOVE "ABILITY OF THE COMPILER TO " TO RE-MARK.
140500     PERFORM PRINT-DETAIL.
140600     MOVE "ACCEPT SUBSCRIPTED 88 LEVEL" TO RE-MARK.
140700     PERFORM PRINT-DETAIL.
140800*    NOTE *******                  ******                *********
140900*        *****  A NOTE AS THE FIRST STATEMENT IN THIS ******
141000*               PARAGRAPH WILL BYPASS ALL THE SPECIAL *****
141100*               CONDITION-NAME TESTS, BUT A NOTE STATEMENT
141200*               MIGHT NEED TO BE INSERTED IN EACH TEST
141300*               SO THE SYNTAX WOULD BE IGNORED BY THE COMPILER.
141400     MOVE "OCCURS WITH 88 LEVEL" TO FEATURE.
141500     MOVE 123 TO TABLE-80.
141600     GO TO IF--TEST-80.
141700 IF-DELETE-80.
141800     PERFORM DE-LETE.
141900     MOVE "IF--TEST-80" TO PAR-NAME.
142000     MOVE "TEST-80 THRU 85 DELETED  " TO RE-MARK.
142100     PERFORM PRINT-DETAIL.
142200     ADD 5 TO DELETE-COUNTER.
142300     GO TO IF--TEST-86.
142400 IF--TEST-80.
142500     IF A80 (2)
142600         PERFORM PASS ELSE
142700     PERFORM FAIL.
142800*    NOTE ELMT(2) SHOULD CONTAIN A 2 WHICH IS CONTAINED IN
142900*        THE VALUE OF THE A80 88 LEVEL.
143000     GO TO IF-WRITE-80.
143100 IF--DELETE-80.
143200     PERFORM DE-LETE.
143300 IF-WRITE-80.
143400     MOVE "IF--TEST-80" TO PAR-NAME.
143500     PERFORM PRINT-DETAIL.
143600 IF--TEST-81.
143700     IF C80 (1)
143800         PERFORM FAIL ELSE
143900     PERFORM PASS.
144000*    NOTE ELMT(1) SHOULD CONTAIN A 1 WHICH IS NOT CONTAINED
144100*        IN THE VALUE OF THE C80 88 LEVEL.
144200     GO TO IF-WRITE-81.
144300 IF-DELETE-81.
144400     PERFORM DE-LETE.
144500 IF-WRITE-81.
144600     MOVE "IF--TEST-81" TO PAR-NAME.
144700     PERFORM PRINT-DETAIL.
144800 IF--TEST-82.
144900     IF B80 (3)
145000         PERFORM FAIL ELSE
145100     PERFORM PASS.
145200*    NOTE ELMT(3) SHOULD CONTAIN A 3 WHICH IS NOT CONTAINED
145300*        IN THE VALUE OF THE B80 88 LEVEL.
145400     GO TO IF-WRITE-82.
145500 IF-DELETE-82.
145600     PERFORM DE-LETE.
145700 IF-WRITE-82.
145800     MOVE "IF--TEST-82" TO PAR-NAME.
145900     PERFORM PRINT-DETAIL.
146000 IF--TEST-83.
146100     IF NOT A80 OF TABLE-80 (3)
146200         PERFORM FAIL ELSE
146300     PERFORM PASS.
146400*    NOTE ELMT(3) SHOULD CONTAIN A 3 BUT THE NOT CONDITION
146500*        SHOULD CAUSE THE TEST TO FAIL EVEN THOUGH THE A80
146600*        VALUE INCLUDES THE VALUE 3.
146700     GO TO IF-WRITE-83.
146800 IF-DELETE-83.
146900     PERFORM DE-LETE.
147000 IF-WRITE-83.
147100     MOVE "IF--TEST-83" TO PAR-NAME.
147200     PERFORM PRINT-DETAIL.
147300 IF--TEST-84.
147400     IF NOT B80 (1)
147500         PERFORM PASS ELSE
147600     PERFORM FAIL.
147700*    NOTE ELMT(1) CONTAINS A 1 AND THE VALUE OF B80 IS 8
147800*        SO, SAYING NOT 8 IS TRUE.
147900     GO TO IF-WRITE-84.
148000 IF-DELETE-84.
148100     PERFORM DE-LETE.
148200 IF-WRITE-84.
148300     MOVE "IF--TEST-84" TO PAR-NAME.
148400     PERFORM PRINT-DETAIL.
148500 IF--TEST-85.
148600     IF C80 OF TABLE-80 (2)
148700         PERFORM FAIL ELSE
148800     PERFORM PASS.
148900*    NOTE ELMT(2) IS 2 AND THE VALUES OF C80 DO NOT CONTAIN A 2.
149000     GO TO IF-WRITE-85.
149100 IF-DELETE-85.
149200     PERFORM DE-LETE.
149300 IF-WRITE-85.
149400     MOVE "IF--TEST-85" TO PAR-NAME.
149500     PERFORM PRINT-DETAIL.
149600 IF--TEST-86.
149700     IF A86
149800         PERFORM FAIL ELSE
149900     PERFORM PASS.
150000*    NOTE A86 (ABC   ) SHOULD NOT EQUAL TABLE-86 (ABCABC).
150100     GO TO IF-WRITE-86.
150200 IF-DELETE-86.
150300     PERFORM DE-LETE.
150400 IF-WRITE-86.
150500     MOVE "IF--TEST-86" TO PAR-NAME.
150600     PERFORM PRINT-DETAIL.
150700 IF--TEST-87.
150800     IF NOT B86
150900         PERFORM FAIL ELSE
151000     PERFORM PASS.
151100*    NOTE B86 (ABCABC) SHOULD EQUAL TABLE-86 (ABCABC) THUS
151200*        FAILING THE TEST.
151300     GO TO IF-WRITE-87.
151400 IF-DELETE-87.
151500     PERFORM DE-LETE.
151600 IF-WRITE-87.
151700     MOVE "IF--TEST-87" TO PAR-NAME.
151800     PERFORM PRINT-DETAIL.
151900 IF--TEST-88.
152000     MOVE SPACES TO DATANAME-86.
152100     IF C86
152200         PERFORM PASS ELSE
152300     PERFORM FAIL.
152400*    NOTE TABLE-86 (   ABC) SHOULD EQUAL C86 (   ABC).
152500     GO TO IF-WRITE-88.
152600 IF-DELETE-88.
152700     PERFORM DE-LETE.
152800 IF-WRITE-88.
152900     MOVE "IF--TEST-88" TO PAR-NAME.
153000     PERFORM PRINT-DETAIL.
153100 IF--INIT-R.
153200     MOVE     "FIGCON < = > D-NAME" TO FEATURE.
153300 IF--TEST-89.
153400     IF       ZEROS NOT < LOW-VAL
153500              PERFORM PASS ELSE PERFORM FAIL.
153600     GO       TO IF--WRITE-89.
153700 IF--DELETE-89.
153800     PERFORM DE-LETE.
153900 IF--WRITE-89.
154000     MOVE     "IF--TEST-89 " TO PAR-NAME.
154100     PERFORM  PRINT-DETAIL.
154200 IF--TEST-90.
154300     IF       ZEROS < ONE23
154400              PERFORM PASS ELSE PERFORM FAIL.
154500     GO       TO IF--WRITE-90.
154600 IF--DELETE-90.
154700     PERFORM DE-LETE.
154800 IF--WRITE-90.
154900     MOVE     "IF--TEST-90 " TO PAR-NAME.
155000     PERFORM  PRINT-DETAIL.
155100 IF--TEST-91.
155200     IF       ZEROS = ZERO-C
155300              PERFORM PASS ELSE PERFORM FAIL.
155400     GO       TO IF--WRITE-91.
155500 IF--DELETE-91.
155600     PERFORM DE-LETE.
155700 IF--WRITE-91.
155800     MOVE     "IF--TEST-91 " TO PAR-NAME.
155900     PERFORM PRINT-DETAIL.
156000 IF--TEST-92.
156100     IF       ZEROS NOT = ZERO-D
156200              PERFORM FAIL ELSE PERFORM PASS.
156300     GO       TO IF--WRITE-92.
156400 IF--DELETE-92.
156500     PERFORM DE-LETE.
156600 IF--WRITE-92.
156700     MOVE     "IF--TEST-92 " TO PAR-NAME.
156800     PERFORM  PRINT-DETAIL.
156900 IF--TEST-93.
157000     IF       SPACES = SPACE-X
157100              PERFORM PASS ELSE PERFORM FAIL.
157200     GO       TO IF--WRITE-93.
157300 IF--DELETE-93.
157400     PERFORM DE-LETE.
157500 IF--WRITE-93.
157600     MOVE     "IF--TEST-93 " TO PAR-NAME.
157700     PERFORM  PRINT-DETAIL.
157800 IF--TEST-94.
157900     IF       SPACES NOT = QUOTE-X
158000              PERFORM PASS ELSE PERFORM FAIL.
158100     GO       TO IF--WRITE-94.
158200 IF--DELETE-94.
158300     PERFORM DE-LETE.
158400 IF--WRITE-94.
158500     MOVE     "IF--TEST-94 " TO PAR-NAME.
158600     PERFORM  PRINT-DETAIL.
158700 IF--TEST-95.
158800     IF       SPACES > ABC OR < ABC
158900              PERFORM PASS ELSE PERFORM FAIL.
159000     GO       TO IF--WRITE-95.
159100 IF--DELETE-95.
159200     PERFORM DE-LETE.
159300 IF--WRITE-95.
159400     MOVE     "IF--TEST-95 " TO PAR-NAME.
159500     PERFORM  PRINT-DETAIL.
159600 IF--TEST-96.
159700     IF       QUOTES NOT > QUOTE-X
159800              PERFORM PASS ELSE PERFORM FAIL.
159900     GO       TO IF--WRITE-96.
160000 IF--DELETE-96.
160100     PERFORM DE-LETE.
160200 IF--WRITE-96.
160300     MOVE     "IF--TEST-96 " TO PAR-NAME.
160400     PERFORM  PRINT-DETAIL.
160500 IF--TEST-97.
160600     IF       QUOTES NOT = ZERO-D
160700              PERFORM PASS ELSE PERFORM FAIL.
160800     GO       TO IF--WRITE-97.
160900 IF--DELETE-97.
161000     PERFORM DE-LETE.
161100 IF--WRITE-97.
161200     MOVE     "IF--TEST-97 " TO PAR-NAME.
161300     PERFORM  PRINT-DETAIL.
161400 IF--TEST-98.
161500     IF       HIGH-VALUES > LOW-VAL
161600              PERFORM PASS ELSE PERFORM FAIL.
161700     GO       TO IF--WRITE-98.
161800 IF--DELETE-98.
161900     PERFORM DE-LETE.
162000 IF--WRITE-98.
162100     MOVE     "IF--TEST-98 " TO PAR-NAME.
162200     PERFORM  PRINT-DETAIL.
162300 IF--TEST-99.
162400     IF       HIGH-VALUES > ABC
162500              PERFORM PASS ELSE PERFORM FAIL.
162600     GO       TO IF--WRITE-99.
162700 IF--DELETE-99.
162800     PERFORM DE-LETE.
162900 IF--WRITE-99.
163000     MOVE     "IF--TEST-99 " TO PAR-NAME.
163100     PERFORM  PRINT-DETAIL.
163200 IF--TEST-100.
163300     IF       HIGH-VALUES NOT > ONE23
163400              PERFORM FAIL ELSE PERFORM PASS.
163500     GO       TO IF--WRITE-100.
163600 IF--DELETE-100.
163700     PERFORM DE-LETE.
163800 IF--WRITE-100.
163900     MOVE     "IF--TEST-100" TO PAR-NAME.
164000     PERFORM  PRINT-DETAIL.
164100 IF--TEST-101.
164200     IF       HIGH-VALUES = ZERO-D
164300              PERFORM FAIL ELSE PERFORM PASS.
164400     GO       TO IF--WRITE-101.
164500 IF--DELETE-101.
164600     PERFORM DE-LETE.
164700 IF--WRITE-101.
164800     MOVE     "IF--TEST-101" TO PAR-NAME.
164900     PERFORM  PRINT-DETAIL.
165000 IF--TEST-102.
165100     IF       LOW-VALUES = LOW-VAL
165200              PERFORM PASS ELSE PERFORM FAIL.
165300     GO       TO IF--WRITE-102.
165400 IF--DELETE-102.
165500     PERFORM DE-LETE.
165600 IF--WRITE-102.
165700     MOVE     "IF--TEST-102" TO PAR-NAME.
165800     PERFORM  PRINT-DETAIL.
165900 IF--TEST-103.
166000     IF       LOW-VALUES < ABC
166100              PERFORM PASS ELSE PERFORM FAIL.
166200     GO       TO IF--WRITE-103.
166300 IF--DELETE-103.
166400     PERFORM DE-LETE.
166500 IF--WRITE-103.
166600     MOVE     "IF--TEST-103" TO PAR-NAME.
166700     PERFORM  PRINT-DETAIL.
166800 IF--TEST-104.
166900     IF       ALL "00" < ONE23
167000              PERFORM PASS ELSE PERFORM FAIL.
167100     GO       TO IF--WRITE-104.
167200 IF--DELETE-104.
167300     PERFORM DE-LETE.
167400 IF--WRITE-104.
167500     MOVE     "IF--TEST-104" TO PAR-NAME.
167600     PERFORM  PRINT-DETAIL.
167700 IF--TEST-105.
167800     IF       ALL ZEROES = ZERO-D
167900              PERFORM PASS ELSE PERFORM FAIL.
168000     GO       TO IF--WRITE-105.
168100 IF--DELETE-105.
168200     PERFORM DE-LETE.
168300 IF--WRITE-105.
168400     MOVE     "IF--TEST-105" TO PAR-NAME.
168500     PERFORM  PRINT-DETAIL.
168600 IF--TEST-106.
168700     IF       ALL "00" NOT > ZERO-D
168800              PERFORM PASS ELSE PERFORM FAIL.
168900     GO       TO IF--WRITE-106.
169000 IF--DELETE-106.
169100     PERFORM DE-LETE.
169200 IF--WRITE-106.
169300     MOVE     "IF--TEST-106" TO PAR-NAME.
169400     PERFORM  PRINT-DETAIL.
169500 IF--TEST-107.
169600     IF       ALL "A" = SPACE-X
169700              PERFORM FAIL ELSE PERFORM PASS.
169800     GO       TO IF--WRITE-107.
169900 IF--DELETE-107.
170000     PERFORM DE-LETE.
170100 IF--WRITE-107.
170200     MOVE     "IF--TEST-107" TO PAR-NAME.
170300     PERFORM  PRINT-DETAIL.
170400 IF--TEST-108.
170500     IF       ALL "A" > ABC
170600              PERFORM FAIL ELSE PERFORM PASS.
170700     GO       TO IF--WRITE-108.
170800 IF--DELETE-108.
170900     PERFORM DE-LETE.
171000 IF--WRITE-108.
171100     MOVE     "IF--TEST-108" TO PAR-NAME.
171200     PERFORM  PRINT-DETAIL.
171300 IF--TEST-109.
171400     IF       IF-D4 ALPHABETIC
171500              PERFORM PASS ELSE PERFORM FAIL.
171600     GO       TO IF--WRITE-109.
171700 IF--DELETE-109.
171800     PERFORM  DE-LETE.
171900 IF--WRITE-109.
172000     MOVE     "CLASS --- ALPHABETIC" TO FEATURE.
172100     MOVE     "IF--TEST-109" TO PAR-NAME.
172200     PERFORM  PRINT-DETAIL.
172300 IF--INIT-S.
172400     MOVE     "SIGN --- ZERO" TO FEATURE.
172500 IF--TEST-110.
172600     IF      SMALLEST-VALU GREATER THAN SMALL-VALU
172700         AND IS NOT LESS THAN EVEN-SMALLER OR SMALLER-VALU
172800             MOVE "CONDITION FALSE" TO CORRECT-A
172900             MOVE "CONDITION TRUE " TO COMPUTED-A
173000             PERFORM FAIL
173100             GO TO IF--WRITE-110.
173200     PERFORM PASS.
173300     GO TO IF--WRITE-110.
173400 IF--DELETE-110.
173500     PERFORM  DE-LETE.
173600 IF--WRITE-110.
173700     MOVE     "IF--TEST-110" TO PAR-NAME.
173800     MOVE "ABBREV CONDITIONS" TO FEATURE.
173900     PERFORM  PRINT-DETAIL.
174000 IF--TEST-111.
174100     IF SMALLEST-VALU LESS THAN SMALL-VALU AND
174200     (SMALLEST-VALU GREATER THAN EVEN-SMALLER OR SMALLER-VALU)
174300              PERFORM PASS GO TO IF--WRITE-111.
174400     MOVE "CONDITION TRUE" TO CORRECT-A.
174500     MOVE "CONDITION FALSE" TO COMPUTED-A.
174600     PERFORM  FAIL.
174700     GO       TO IF--WRITE-111.
174800 IF--DELETE-111.
174900     PERFORM  DE-LETE.
175000 IF--WRITE-111.
175100     MOVE     "IF--TEST-111" TO PAR-NAME.
175200     PERFORM  PRINT-DETAIL.
175300 IF--TEST-112.
175400     IF       IF-D40B
175500              PERFORM PASS ELSE PERFORM FAIL.
175600     GO       TO IF--WRITE-112.
175700 IF--DELETE-112.
175800     PERFORM  DE-LETE.
175900 IF--WRITE-112.
176000     MOVE "CONDITION---NAME" TO FEATURE.
176100     MOVE     "IF--TEST-112" TO PAR-NAME.
176200     PERFORM  PRINT-DETAIL.
176300 IF--INIT-T.
176400     MOVE "ABBREV---CONDITION" TO FEATURE.
176500 IF--TEST-113.
176600     IF SMALLEST-VALU LESS THAN SMALL-VALU AND (SMALLEST-VALU NOT
176700     GREATER THAN EVEN-SMALLER OR SMALLER-VALU)
176800             PERFORM PASS
176900         GO TO IF--WRITE-113.
177000     MOVE "CONDITION TRUE" TO CORRECT-A.
177100     MOVE "CONDITION FALSE" TO COMPUTED-A.
177200     PERFORM FAIL.
177300     GO TO IF--WRITE-113.
177400 IF--DELETE-113.
177500     PERFORM  DE-LETE.
177600 IF--WRITE-113.
177700     MOVE     "IF--TEST-113" TO PAR-NAME.
177800     PERFORM  PRINT-DETAIL.
177900 IF--TEST-114.
178000     IF      SMALLEST-VALU LESS THAN SMALL-VALU
178100             AND NOT EVEN-SMALLER OR SMALLER-VALU
178200             PERFORM PASS
178300             GO TO IF--WRITE-114
178400             ELSE
178500             PERFORM FAIL
178600             MOVE "CONDITION FALSE" TO CORRECT-A
178700             MOVE "CONDITION TRUE" TO COMPUTED-A
178800             GO TO IF--WRITE-114.
178900 IF--DELETE-114.
179000     PERFORM  DE-LETE.
179100 IF--WRITE-114.
179200     MOVE     "IF--TEST-114" TO PAR-NAME.
179300     PERFORM  PRINT-DETAIL.
179400 IF--TEST-115.
179500     IF COMP-SGN1 IS POSITIVE
179600         PERFORM PASS
179700         GO TO IF--WRITE-115.
179800     MOVE "POSITIVE EXPECTED" TO CORRECT-A.
179900     MOVE COMP-SGN1 TO COMPUTED-14V4.
180000     PERFORM FAIL.
180100     GO TO IF--WRITE-115.
180200 IF--DELETE-115.
180300     PERFORM DE-LETE.
180400 IF--WRITE-115.
180500     MOVE "POS/NEG SIGN TEST" TO FEATURE.
180600     MOVE "IF--TEST-115" TO PAR-NAME.
180700     PERFORM PRINT-DETAIL.
180800 IF--TEST-116.
180900     IF COMP-SGN2 NOT POSITIVE
181000         MOVE COMP-SGN2 TO COMPUTED-14V4
181100         MOVE "POSITIVE EXPECTED" TO CORRECT-A
181200         PERFORM FAIL
181300         GO TO IF--WRITE-116.
181400     PERFORM PASS.
181500     GO TO IF--WRITE-116.
181600 IF--DELETE-116.
181700     PERFORM DE-LETE.
181800 IF--WRITE-116.
181900     MOVE "IF--TEST-116" TO PAR-NAME.
182000     PERFORM PRINT-DETAIL.
182100 IF--TEST-117.
182200     IF COMP-SGN3 NOT NEGATIVE
182300         MOVE COMP-SGN3 TO COMPUTED-14V4
182400         MOVE "NEGATIVE EXPECTED" TO CORRECT-A
182500         PERFORM FAIL
182600         GO TO IF--WRITE-117.
182700     PERFORM PASS.
182800     GO TO IF--WRITE-117.
182900 IF--DELETE-117.
183000     PERFORM DE-LETE.
183100 IF--WRITE-117.
183200     MOVE "IF--TEST-117" TO PAR-NAME.
183300     PERFORM PRINT-DETAIL.
183400 IF--TEST-118.
183500     IF COMP-SGN4 NOT POSITIVE
183600         PERFORM PASS
183700         GO TO IF--WRITE-118.
183800     MOVE COMP-SGN4 TO COMPUTED-14V4.
183900     MOVE "NEGATIVE EXPECTED" TO CORRECT-A.
184000     PERFORM FAIL.
184100     GO TO IF--WRITE-118.
184200 IF--DELETE-118.
184300     PERFORM DE-LETE.
184400 IF--WRITE-118.
184500     MOVE "IF--TEST-118" TO PAR-NAME.
184600     PERFORM PRINT-DETAIL.
184700 IF--TEST-119.
184800     MOVE SPACES TO TEST-RESULTS.
184900     MOVE "NOT USED" TO RE-MARK.
185000     MOVE "IF--TEST-119" TO PAR-NAME.
185100     PERFORM PRINT-DETAIL.
185200 IF--TEST-120.
185300     MOVE     -10 TO WRK-DS-06V06.
185400     ADD      +10 TO WRK-DS-06V06.
185500     IF       WRK-DS-06V06 NEGATIVE
185600              PERFORM FAIL-120-121
185700              MOVE "NEGATIVE ZERO DETECTED" TO RE-MARK
185800              GO TO IF--WRITE-120.
185900     IF       WRK-DS-06V06 POSITIVE
186000              PERFORM FAIL-120-121
186100              MOVE "POSITIVE ZERO DETECTED" TO RE-MARK
186200              GO TO IF--WRITE-120.
186300     IF       WRK-DS-06V06 ZERO
186400              PERFORM PASS GO TO IF--WRITE-120.
186500     PERFORM  FAIL-120-121.
186600     MOVE     "NEITHER POS, NEG, NOR ZERO" TO RE-MARK.
186700     GO       TO IF--WRITE-120.
186800 IF--DELETE-120.
186900     PERFORM  DE-LETE.
187000 IF--WRITE-120.
187100     MOVE     "SIGN TEST ON ZERO" TO FEATURE.
187200     MOVE     "IF--TEST-120" TO PAR-NAME.
187300     PERFORM  PRINT-DETAIL.
187400     GO       TO IF--EXIT-120.
187500 FAIL-120-121.
187600     PERFORM  FAIL.
187700     MOVE     WRK-DS-06V06 TO COMPUTED-N.
187800     MOVE     ZERO TO CORRECT-N.
187900 IF--EXIT-120.
188000     EXIT.
188100 IF--TEST-121.
188200     MOVE     10 TO WRK-DS-06V06.
188300     SUBTRACT 10 FROM WRK-DS-06V06.
188400     IF       WRK-DS-06V06 NEGATIVE
188500              PERFORM FAIL-120-121
188600              MOVE "NEGATIVE ZERO DETECTED" TO RE-MARK
188700              GO TO IF--WRITE-121.
188800     IF       WRK-DS-06V06 POSITIVE
188900              PERFORM FAIL-120-121
189000              MOVE "POSITIVE ZERO DETECTED" TO RE-MARK
189100              GO TO IF--WRITE-121.
189200
189300     IF       WRK-DS-06V06 ZERO
189400              PERFORM PASS GO TO IF--WRITE-121.
189500     PERFORM  FAIL-120-121.
189600     MOVE     "NEITHER POS, NEG, NOR ZERO" TO RE-MARK.
189700     GO       TO IF--WRITE-120.
189800 IF--DELETE-121.
189900     PERFORM  DE-LETE.
190000 IF--WRITE-121.
190100     MOVE     "IF--TEST-121" TO PAR-NAME.
190200     PERFORM  PRINT-DETAIL.
190300 IF-INIT-122.
190400     MOVE   "VI-89 6.15" TO ANSI-REFERENCE.
190500     MOVE    1 TO WRK-DU-1V0-1.
190600     MOVE    2 TO WRK-DU-1V0-2.
190700     MOVE    3 TO WRK-DU-1V0-3.
190800     MOVE    0 TO WRK-DU-1V0-4.
190900 IF-TEST-122.
191000     IF NOT (WRK-DU-1V0-1 NOT GREATER WRK-DU-1V0-2 AND
191100         WRK-DU-1V0-3 AND NOT WRK-DU-1V0-4) GO TO BUMMER-122
191200         ELSE NEXT SENTENCE.
191300     PERFORM PASS.
191400     GO TO IF-WRITE-122.
191500 IF-DELETE-122.
191600     PERFORM DE-LETE.
191700     GO TO IF-WRITE-122.
191800 BUMMER-122.
191900     PERFORM FAIL.
192000     MOVE "RESULT TRUE" TO COMPUTED-A.
192100     MOVE "SHOULD BE FALSE" TO CORRECT-A.
192200 IF-WRITE-122.
192300     MOVE "IF-TEST-122" TO PAR-NAME.
192400     MOVE "ABR. COM. REL. CONDT" TO FEATURE.
192500     PERFORM PRINT-DETAIL.
192600 IF-INIT-123.
192700     MOVE   "VI-89 6.15" TO ANSI-REFERENCE.
192800     MOVE 9 TO WRK-DU-1V0-1.
192900     MOVE 8 TO WRK-DU-1V0-2.
193000     MOVE 7 TO WRK-DU-1V0-3.
193100 IF-LOGICAL-CONN-TEST-123.
193200     IF WRK-DU-1V0-1 > WRK-DU-1V0-2 AND NOT < WRK-DU-2V0-1 OR
193300             WRK-DU-2V0-2 OR NOT WRK-DU-2V0-3 AND WRK-DU-1V0-3
193400             PERFORM PASS
193500     ELSE
193600             PERFORM FAIL MOVE "FALSE RESULT FOUND" TO COMPUTED-A
193700             MOVE "SHOULD BE TRUE" TO CORRECT-A.
193800     GO TO IF-WRITE-123.
193900 IF-DELETE-123.
194000     PERFORM DE-LETE.
194100 IF-WRITE-123.
194200     MOVE "IF-TEST-123" TO PAR-NAME.
194300     MOVE "LOGICAL CONNECTIVES" TO FEATURE.
194400     PERFORM PRINT-DETAIL.
194500     PERFORM END-ROUTINE.
194600     MOVE    " COLLATING-AND-ALPHABET-TEST-9  SYNTAX CHECK IN OBJE
194700-    "CT-COMPUTER AND SPECIAL-NAMES" TO TEST-RESULTS.
194800     PERFORM PRINT-DETAIL.
194900     MOVE SPACE TO TEST-RESULTS.
195000 IF-INIT-124.
195100*    ===-->  ARITHMETIC EXPRESSION CONTAINING ZERO  <--===
195200     MOVE   "VI-58 6.3.1.5 AND VI-51 6.2" TO ANSI-REFERENCE.
195300     MOVE    4 TO WRK-DU-1V0-1.
195400     MOVE   "IF-TEST-124" TO PAR-NAME.
195500 IF-TEST-124.
195600     IF      ZERO - WRK-DU-1V0-1 IS NEGATIVE
195700             PERFORM PASS
195800     ELSE
195900             PERFORM FAIL
196000             MOVE "POSITIVE RESULT FOUND" TO COMPUTED-A
196100             MOVE "SHOULD BE NEGATIVE" TO CORRECT-A.
196200     GO TO IF-WRITE-124.
196300 IF-DELETE-124.
196400     PERFORM DE-LETE.
196500 IF-WRITE-124.
196600     MOVE "IF-TEST-124" TO PAR-NAME.
196700     MOVE "LOGICAL CONNECTIVES" TO FEATURE.
196800     PERFORM PRINT-DETAIL.
196900 CCVS-EXIT SECTION.
197000 CCVS-999999.
197100     GO TO CLOSE-FILES.
