000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC254A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    PROGRAM NC254A TESTS SWITCH SETTINGS USING LEVEL 2 FEATURES
002300*    LOGICAL OPERATORS AND, OR, NOT.
002400*
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.
002800     XXXXX082.
002900 OBJECT-COMPUTER.
003000     XXXXX083.
003100ASPECIAL-NAMES.
003200A    XXXXX051
003300A    IS SW-1
003400A        ON STATUS IS ON-SWITCH-1
003500A        OFF STATUS IS OFF-SWITCH-1
003600A    XXXXX052
003700A    IS SW-2
003800A          ON IS ON-SWITCH-2
003900A          OFF IS OFF-SWITCH-2
004000     CLASS   ORDINAL-A-ONLY IS
004100     XXXXX090
004200     CLASS   ORDINAL-A-THROUGH-D IS
004300     XXXXX090
004400     THROUGH
004500     XXXXX091
004600     CLASS   ORDINAL-D-THRU-A
004700     XXXXX091
004800     THRU
004900     XXXXX090
005000     CLASS   ACTUAL-A-ONLY "A"
005100     CLASS   ACTUAL-A-THRU-D IS "A" THRU "D"
005200     CLASS   ACTUAL-D-THROUGH-A IS "D" THROUGH "A"
005300     CLASS   ACTUAL-ABCD "ABCD".
005400 INPUT-OUTPUT SECTION.
005500 FILE-CONTROL.
005600     SELECT PRINT-FILE ASSIGN TO
005700     XXXXX055.
005800 DATA DIVISION.
005900 FILE SECTION.
006000 FD  PRINT-FILE.
006100 01  PRINT-REC PICTURE X(120).
006200 01  DUMMY-RECORD PICTURE X(120).
006300 WORKING-STORAGE SECTION.
006400 01  WS-A                        PIC X.
006500 01  WS-B                        PIC X(5).
006600 01  IF-D1                              PICTURE IS S9(4)V9(2)
006700     VALUE IS 0.
006800 01  IF-D2                              PICTURE IS S9(4)V9(2)
006900     VALUE IS ZERO.
007000 01  IF-D3                              PICTURE IS X(10)
007100     VALUE IS "0000000000".
007200 01  IF-D4                              PICTURE IS X(15)
007300     VALUE IS "               ".
007400 01  IF-D6                              PICTURE IS A(10)
007500     VALUE IS "BABABABABA".
007600 01  IF-D7                              PICTURE IS S9(6)V9(4)
007700     VALUE IS +123.45.
007800 01  IF-D8                              PICTURE IS 9(6)V9(4)
007900     VALUE IS 12300.
008000 01  IF-D9                              PICTURE IS X(3)
008100     VALUE IS "123".
008200 01  IF-D11                             PICTURE IS X(6)
008300     VALUE IS "ABCDEF".
008400 01  IF-D13                             PICTURE IS 9(6)V9(4)
008500     VALUE IS 12300.
008600 01  IF-D14                             PICTURE IS S9(4)V9(2)
008700     VALUE IS +123.45.
008800 01  IF-D15                             PICTURE IS S999PP
008900     VALUE IS 12300.
009000 01  IF-D16                             PICTURE IS PP99
009100     VALUE IS .0012.
009200 01  IF-D17                             PICTURE IS SV9(4)
009300     VALUE IS .0012.
009400 01  IF-D18                             PICTURE IS X(10)
009500     VALUE IS "BABABABABA".
009600 01  IF-D19                             PICTURE IS X(10)
009700     VALUE IS "ABCDEF    ".
009800 01  IF-D23                             PICTURE IS $9,9B9.90+.
009900 01  IF-D24                             PICTURE IS X(10)
010000     VALUE IS "$1,2 3.40+".
010100 01  IF-D25                             PICTURE IS ABABX0A.
010200 01  IF-D26  PIC X(7)
010300     VALUE IS "A C D0E".
010400 01  IF-D27             PICTURE 9(6)V9(4)  VALUE 2137.45
010500     USAGE IS COMPUTATIONAL.
010600 01  IF-D28                             PICTURE IS 999999V9999
010700     VALUE IS 2137.45.
010800 01  IF-D32                             PICTURE IS 9 VALUE IS 0.
010900 01  IF-D33 PICTURE S9 VALUE -0.
011000 01  IF-D34 PICTURE S9 VALUE +0.
011100 01  IF-D37             PICTURE 9(5)  VALUE 0001234.
011200 01  IF-D38             PICTURE X(20) VALUE " BABBAGE".
011300 01  ALPHA-UPPER        PIC X(20)     VALUE " UPPERCASE CHARS".
011400 01  ALPHA-LOWER        PIC X(20)     VALUE " lowercase chars".
011500 01  NON-COBOL-CHARACTERS  PICTURE X(8) VALUE
011600     XXXXX081.
011700 01  AZERO-DS-05V05              PICTURE S9(5)V9(5) VALUE ZERO.
011800 01  A18ONES-DS-18V00            PICTURE S9(18)
011900                                 VALUE 111111111111111111.
012000 01  ONES-XN-00018               PICTURE X(18)
012100     VALUE "111111111111111111".
012200 01  A99-DS-02V00                PICTURE S99  VALUE 99.
012300 01  WRK-DU-02V00                PICTURE 99.
012400 01  TWOS-XN-00002               PICTURE XX   VALUE "22".
012500 01  A18ONES-DS-09V09            PICTURE S9(9)V9(9)
012600                                 VALUE 111111111.111111111.
012700 01  ONES-XN-00002               PICTURE XX   VALUE "11".
012800 01  A02TWOS-DU-02V00            PICTURE 99   VALUE 22.
012900 01  A01ONE-DS-P0801             PICTURE SP(8)9 VALUE .000000001.
013000 01  A990-DS-0201P               PICTURE S99P  VALUE +990.
013100 01  XDATA-XN-00018              PICTURE X(18)
013200                                 VALUE "00ABCDEFGHI  4321 ".
013300 01  XDATA-DS-18V00-S REDEFINES XDATA-XN-00018 PICTURE S9(18).
013400 01  YADATA-XN-00010             PICTURE X(10) VALUE "ABCDEFGHIJ".
013500 01  YADATA-XN-00010-U-AND-L     PICTURE X(10) VALUE "AbCdEfGhIj".
013600 01  DUMMY-DS-00001     PICTURE S9 VALUE -1.
013700 01  A02TWOS-DS-03V02            PICTURE S999V99  VALUE +022.00.
013800 01  WRK-DS-18V0-1               PIC S9(18)     VALUE
013900            -123456789012345678.
014000 01  WRK-XN-18-2                 PIC  X(18)     VALUE
014100            "123456789012345678".
014200
014300 01  IF-D10.
014400     02 FILLER          PICTURE XX VALUE "01".
014500     02 FILLER          PICTURE XX VALUE "23".
014600     02 IF-D10A.
014700       03 FILLER        PICTURE XXXX VALUE "4567".
014800       03 FILLER        PICTURE XXXX VALUE "8912".
014900 01  IF-D12.
015000     02 FILLER          PICTURE XXX VALUE "ABC".
015100     02 IF-D12A.
015200       03 IF-D12B.
015300         04 FILLER      PICTURE XX VALUE "DE".
015400         04 FILLER      PICTURE X  VALUE "F".
015500 01  IF-D20.
015600     02 FILLER          PICTURE 9(5) VALUE ZERO.
015700     02 FILLER          PICTURE 99   VALUE 12.
015800     02 FILLER          PICTURE 9    VALUE 3.
015900     02 FILLER          PICTURE 99   VALUE 45.
016000 01  IF-D21.
016100     02 FILLER          PICTURE 9(5) VALUE ZERO.
016200     02 FILLER          PICTURE 9(5) VALUE 12345.
016300 01  IF-D22.
016400     02 FILLER          PICTURE AA   VALUE "AB".
016500     02 FILLER          PICTURE AAAA VALUE "CDEF".
016600 01  IF-D35.
016700     02 IF-D35A                             VALUE "*ASTERISK".
016800       03 FILLER        PICTURE A(6).
016900       03 FILLER        PICTURE AAA.
017000     02 IF-D35B                            VALUE "/SLASH".
017100       03 FILLER        PICTURE 9(6).
017200 01  IF-D36 REDEFINES IF-D35.
017300     02 IF-D36A         PICTURE X(6).
017400     02 IF-D36B         PICTURE XXX.
017500     02 IF-D36C         PICTURE X(6).
017600 01  IF-D39.
017700     02  FILLER   PICTURE A(6) VALUE "ABCDEF".
017800     02  FILLER  PICTURE A(4) VALUE SPACE.
017900 01  LEVEL-01.
018000     02 LEVEL-02.
018100     03 LEVEL-03.
018200     04 LEVEL-04.
018300     05 LEVEL-05.
018400     06 LEVEL-06.
018500     07 LEVEL-07.
018600     08 LEVEL-08.
018700     09 LEVEL-09.
018800     10 LEVEL-10                        PICTURE IS X VALUE IS "R".
018900 01  LEVEL-RECEIVER                     PICTURE IS X VALUE IS
019000     SPACE.
019100 01  LEVEL-SENDER PICTURE X VALUE "S".
019200 01  VAL                                PICTURE IS 9 VALUE IS 0.
019300 01  A-2                                PICTURE IS A VALUE IS "A".
019400 01  N-27                               PICTURE IS 9999V9
019500     VALUE IS 9999.9.
019600 01  N-30                               PICTURE IS 9V9
019700     VALUE IS 2.
019800 01  N-31                               PICTURE IS 9(6).
019900 01  X-32 REDEFINES N-31                PICTURE IS X(6).
020000 01  N-33                               PICTURE IS 9(5)
020100     VALUE IS 29.
020200 01  A-37                               PICTURE IS A VALUE IS "X".
020300 01  X-38 REDEFINES A-37                PICTURE IS X.
020400 01  X-43 PIC X(10) VALUE "    l75.63".
020500 01  N-84                               PICTURE IS 9999999999.
020600 01  NUMERIC-GRP-TEST.
020700     02  NUMERIC-1                PICTURE 9 VALUE 0.
020800     02  NUMERIC-2.
020900         03  NUMERIC-3            PICTURE 9(1)V9(1) VALUE ZERO.
021000         03  NUMERIC-4.
021100             04  NUMERIC-5       PICTURE 9(18) VALUE 1.
021200     02  NUMERIC-6.
021300         03  NUMERIC-7            PICTURE X VALUE "7".
021400         03  NUMERIC-8            PICTURE 9  VALUE 8.
021500 01  NUM-GRP.
021600     02  NUM-SUB-GRP  PIC 9.
021700 01  GROUP-1000.
021800     02  FILLER  PIC X.
021900     02  GROUP-X1000.
022000         03  GROUP-1000-1 PIC X(500) VALUE ZERO.
022100         03  XNAME        PICTURE X(100) VALUE QUOTE.
022200         03  GROUP-1000-2 PICTURE X(399) VALUE SPACE.
022300         03  GROUP-1000-3 PICTURE X VALUE ".".
022400     02  GROUP-X500-2.
022500         03  GROUP-X500-A        PICTURE X(500) VALUE ZERO.
022600         03  GROUP-X500-1.
022700             04  GROUP-X500-1-1  PICTURE X(50) VALUE QUOTE.
022800             04  GROUP-X500-1-2  PICTURE X(50) VALUE QUOTE.
022900             04  GROUP-X500-1-3  PICTURE X(398) VALUE SPACE.
023000             04  GROUP-X500-1-4  PICTURE XX VALUE " .".
023100 01  HI-LO-VALUES.
023200     02  LOW-VAL  PIC X VALUE LOW-VALUE.
023300     02 ZERO-01  PICTURE 9(18) VALUE 1.
023400     02  ABC      PICTURE XXX VALUE "ABC".
023500     02  NINE-17-8 PICTURE 9(18) VALUE 999999999999999998.
023600     02  ZERO-NULL PIC 9(9) VALUE 0.
023700     02  ZERO-ZERO PICTURE 9(9)V9(9) VALUE 0.0.
023800 01  COMP-DATA.
023900     02  COMP-DATA1 PICTURE 9(18) COMPUTATIONAL VALUE 300.
024000     02  COMP-DATA2  PICTURE 9(10) COMPUTATIONAL VALUE  100000.
024100     02  COMP-DATA3  PICTURE 9     COMPUTATIONAL VALUE 9.
024200     02  COMP-DATA4  PICTURE 9(9)V9(7) COMPUTATIONAL VALUE 3.3.
024300     02  COMP-DATA5  PICTURE 9(5)V9(2) COMPUTATIONAL VALUE 52.25.
024400     02  COMP-DATA6  PICTURE 9V9       COMPUTATIONAL VALUE 8.8.
024500     02  COMP-DATA7  PICTURE 9(3)V9(2) COMPUTATIONAL VALUE 300.00.
024600     02  COMP-DATA8  PICTURE 9V9(9) COMPUTATIONAL VALUE 3.3000000.
024700     02  COMP-DATA9  PICTURE 9(8)  COMPUTATIONAL VALUE 100000.
024800 01  DISP-DATA.
024900     02  DISP-DATA1  PICTURE 9(18) VALUE 300.
025000     02  DISP-DATA2  PICTURE 9(8)  VALUE 100000.
025100     02  DISP-DATA3  PICTURE 9     VALUE 9.
025200     02  DISP-DATA4  PICTURE 9(7)V9(9) VALUE 3.3.
025300     02  DISP-DATA5  PICTURE 9(2)V9(2) VALUE 52.25.
025400     02  DISP-DATA6  PICTURE 9V9   VALUE 8.8.
025500 01  DATA-5          PICTURE 9     VALUE 5.
025600 01  DATA-99999      PICTURE S9(5) VALUE +99999.
025700 01  DATA-Z          PICTURE X     VALUE "Z".
025800 01  DATA-4          PICTURE 9     VALUE 4.
025900 01  DATA-Y          PICTURE X     VALUE "Y".
026000 01  DATA-VWXYZ      PICTURE X(5)  VALUE "VWXYZ".
026100 01  DATA-ADCBA      PICTURE X(5)  VALUE "ADCBA".
026200 01  TEST-RESULTS.
026300     02 FILLER                   PIC X      VALUE SPACE.
026400     02 FEATURE                  PIC X(20)  VALUE SPACE.
026500     02 FILLER                   PIC X      VALUE SPACE.
026600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
026700     02 FILLER                   PIC X      VALUE SPACE.
026800     02  PAR-NAME.
026900       03 FILLER                 PIC X(19)  VALUE SPACE.
027000       03  PARDOT-X              PIC X      VALUE SPACE.
027100       03 DOTVALUE               PIC 99     VALUE ZERO.
027200     02 FILLER                   PIC X(8)   VALUE SPACE.
027300     02 RE-MARK                  PIC X(61).
027400 01  TEST-COMPUTED.
027500     02 FILLER                   PIC X(30)  VALUE SPACE.
027600     02 FILLER                   PIC X(17)  VALUE
027700            "       COMPUTED=".
027800     02 COMPUTED-X.
027900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
028000     03 COMPUTED-N               REDEFINES COMPUTED-A
028100                                 PIC -9(9).9(9).
028200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
028300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
028400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
028500     03       CM-18V0 REDEFINES COMPUTED-A.
028600         04 COMPUTED-18V0                    PIC -9(18).
028700         04 FILLER                           PIC X.
028800     03 FILLER PIC X(50) VALUE SPACE.
028900 01  TEST-CORRECT.
029000     02 FILLER PIC X(30) VALUE SPACE.
029100     02 FILLER PIC X(17) VALUE "       CORRECT =".
029200     02 CORRECT-X.
029300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
029400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
029500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
029600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
029700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
029800     03      CR-18V0 REDEFINES CORRECT-A.
029900         04 CORRECT-18V0                     PIC -9(18).
030000         04 FILLER                           PIC X.
030100     03 FILLER PIC X(2) VALUE SPACE.
030200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
030300 01  CCVS-C-1.
030400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
030500-    "SS  PARAGRAPH-NAME
030600-    "       REMARKS".
030700     02 FILLER                     PIC X(20)    VALUE SPACE.
030800 01  CCVS-C-2.
030900     02 FILLER                     PIC X        VALUE SPACE.
031000     02 FILLER                     PIC X(6)     VALUE "TESTED".
031100     02 FILLER                     PIC X(15)    VALUE SPACE.
031200     02 FILLER                     PIC X(4)     VALUE "FAIL".
031300     02 FILLER                     PIC X(94)    VALUE SPACE.
031400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
031500 01  REC-CT                        PIC 99       VALUE ZERO.
031600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
031700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
031800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
031900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
032000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
032100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
032200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
032300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
032400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
032500 01  CCVS-H-1.
032600     02  FILLER                    PIC X(39)    VALUE SPACES.
032700     02  FILLER                    PIC X(42)    VALUE
032800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
032900     02  FILLER                    PIC X(39)    VALUE SPACES.
033000 01  CCVS-H-2A.
033100   02  FILLER                        PIC X(40)  VALUE SPACE.
033200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
033300   02  FILLER                        PIC XXXX   VALUE
033400     "4.2 ".
033500   02  FILLER                        PIC X(28)  VALUE
033600            " COPY - NOT FOR DISTRIBUTION".
033700   02  FILLER                        PIC X(41)  VALUE SPACE.
033800
033900 01  CCVS-H-2B.
034000   02  FILLER                        PIC X(15)  VALUE
034100            "TEST RESULT OF ".
034200   02  TEST-ID                       PIC X(9).
034300   02  FILLER                        PIC X(4)   VALUE
034400            " IN ".
034500   02  FILLER                        PIC X(12)  VALUE
034600     " HIGH       ".
034700   02  FILLER                        PIC X(22)  VALUE
034800            " LEVEL VALIDATION FOR ".
034900   02  FILLER                        PIC X(58)  VALUE
035000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
035100 01  CCVS-H-3.
035200     02  FILLER                      PIC X(34)  VALUE
035300            " FOR OFFICIAL USE ONLY    ".
035400     02  FILLER                      PIC X(58)  VALUE
035500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
035600     02  FILLER                      PIC X(28)  VALUE
035700            "  COPYRIGHT   1985 ".
035800 01  CCVS-E-1.
035900     02 FILLER                       PIC X(52)  VALUE SPACE.
036000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
036100     02 ID-AGAIN                     PIC X(9).
036200     02 FILLER                       PIC X(45)  VALUE SPACES.
036300 01  CCVS-E-2.
036400     02  FILLER                      PIC X(31)  VALUE SPACE.
036500     02  FILLER                      PIC X(21)  VALUE SPACE.
036600     02 CCVS-E-2-2.
036700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
036800         03 FILLER                   PIC X      VALUE SPACE.
036900         03 ENDER-DESC               PIC X(44)  VALUE
037000            "ERRORS ENCOUNTERED".
037100 01  CCVS-E-3.
037200     02  FILLER                      PIC X(22)  VALUE
037300            " FOR OFFICIAL USE ONLY".
037400     02  FILLER                      PIC X(12)  VALUE SPACE.
037500     02  FILLER                      PIC X(58)  VALUE
037600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
037700     02  FILLER                      PIC X(13)  VALUE SPACE.
037800     02 FILLER                       PIC X(15)  VALUE
037900             " COPYRIGHT 1985".
038000 01  CCVS-E-4.
038100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
038200     02 FILLER                       PIC X(4)   VALUE " OF ".
038300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
038400     02 FILLER                       PIC X(40)  VALUE
038500      "  TESTS WERE EXECUTED SUCCESSFULLY".
038600 01  XXINFO.
038700     02 FILLER                       PIC X(19)  VALUE
038800            "*** INFORMATION ***".
038900     02 INFO-TEXT.
039000       04 FILLER                     PIC X(8)   VALUE SPACE.
039100       04 XXCOMPUTED                 PIC X(20).
039200       04 FILLER                     PIC X(5)   VALUE SPACE.
039300       04 XXCORRECT                  PIC X(20).
039400     02 INF-ANSI-REFERENCE           PIC X(48).
039500 01  HYPHEN-LINE.
039600     02 FILLER  PIC IS X VALUE IS SPACE.
039700     02 FILLER  PIC IS X(65)    VALUE IS "************************
039800-    "*****************************************".
039900     02 FILLER  PIC IS X(54)    VALUE IS "************************
040000-    "******************************".
040100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
040200     "NC254A".
040300 PROCEDURE DIVISION.
040400 CCVS1 SECTION.
040500 OPEN-FILES.
040600     OPEN     OUTPUT PRINT-FILE.
040700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
040800     MOVE    SPACE TO TEST-RESULTS.
040900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
041000     GO TO CCVS1-EXIT.
041100 CLOSE-FILES.
041200     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
041300 TERMINATE-CCVS.
041400S    EXIT PROGRAM.
041500STERMINATE-CALL.
041600     STOP     RUN.
041700 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
041800 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
041900 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
042000 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
042100     MOVE "****TEST DELETED****" TO RE-MARK.
042200 PRINT-DETAIL.
042300     IF REC-CT NOT EQUAL TO ZERO
042400             MOVE "." TO PARDOT-X
042500             MOVE REC-CT TO DOTVALUE.
042600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
042700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
042800        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
042900          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
043000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
043100     MOVE SPACE TO CORRECT-X.
043200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
043300     MOVE     SPACE TO RE-MARK.
043400 HEAD-ROUTINE.
043500     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043600     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043700     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
043800     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
043900 COLUMN-NAMES-ROUTINE.
044000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
044100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
044300 END-ROUTINE.
044400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
044500 END-RTN-EXIT.
044600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
044700 END-ROUTINE-1.
044800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
044900      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
045000      ADD PASS-COUNTER TO ERROR-HOLD.
045100*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
045200      MOVE PASS-COUNTER TO CCVS-E-4-1.
045300      MOVE ERROR-HOLD TO CCVS-E-4-2.
045400      MOVE CCVS-E-4 TO CCVS-E-2-2.
045500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
045600  END-ROUTINE-12.
045700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
045800     IF       ERROR-COUNTER IS EQUAL TO ZERO
045900         MOVE "NO " TO ERROR-TOTAL
046000         ELSE
046100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
046200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
046300     PERFORM WRITE-LINE.
046400 END-ROUTINE-13.
046500     IF DELETE-COUNTER IS EQUAL TO ZERO
046600         MOVE "NO " TO ERROR-TOTAL  ELSE
046700         MOVE DELETE-COUNTER TO ERROR-TOTAL.
046800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
046900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
047000      IF   INSPECT-COUNTER EQUAL TO ZERO
047100          MOVE "NO " TO ERROR-TOTAL
047200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
047300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
047400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
047500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
047600 WRITE-LINE.
047700     ADD 1 TO RECORD-COUNT.
047800Y    IF RECORD-COUNT GREATER 42
047900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
048000Y        MOVE SPACE TO DUMMY-RECORD
048100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
048200Y        MOVE CCVS-H-1  TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
048300Y        MOVE CCVS-H-2A TO DUMMY-RECORD  PERFORM WRT-LN 2 TIMES
048400Y        MOVE CCVS-H-2B TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
048500Y        MOVE CCVS-H-3  TO DUMMY-RECORD  PERFORM WRT-LN 3 TIMES
048600Y        MOVE CCVS-C-1  TO DUMMY-RECORD  PERFORM WRT-LN
048700Y        MOVE CCVS-C-2  TO DUMMY-RECORD  PERFORM WRT-LN
048800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
048900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
049000Y        MOVE ZERO TO RECORD-COUNT.
049100     PERFORM WRT-LN.
049200 WRT-LN.
049300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
049400     MOVE SPACE TO DUMMY-RECORD.
049500 BLANK-LINE-PRINT.
049600     PERFORM WRT-LN.
049700 FAIL-ROUTINE.
049800     IF     COMPUTED-X NOT EQUAL TO SPACE
049900            GO TO FAIL-ROUTINE-WRITE.
050000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
050100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
050200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
050300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050400     MOVE   SPACES TO INF-ANSI-REFERENCE.
050500     GO TO  FAIL-ROUTINE-EX.
050600 FAIL-ROUTINE-WRITE.
050700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
050800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
050900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
051000     MOVE   SPACES TO COR-ANSI-REFERENCE.
051100 FAIL-ROUTINE-EX. EXIT.
051200 BAIL-OUT.
051300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
051400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
051500 BAIL-OUT-WRITE.
051600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
051700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
051800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051900     MOVE   SPACES TO INF-ANSI-REFERENCE.
052000 BAIL-OUT-EX. EXIT.
052100 CCVS1-EXIT.
052200     EXIT.
052300 SECT-NC254A-001 SECTION.
052400*
052500*
052600 NEXT-INIT-GF-1.
052700*    ==-->     NEXT SENTENCE           <--==
052800     MOVE   "V1-89 6.15.4 GR2 " TO ANSI-REFERENCE.
052900     MOVE    "A" TO A-2.
053000 NEXT-TEST-GF-1.
053100     IF       A-2 EQUAL TO "A"
053200              NEXT SENTENCE
053300              ELSE
053400              NEXT SENTENCE.
053500     PERFORM  PASS.
053600     GO TO    NEXT-WRITE-GF-1.
053700 NEXT-DELETE-GF-1.
053800     PERFORM  DE-LETE.
053900 NEXT-WRITE-GF-1.
054000     MOVE "NEXT-TEST-1" TO PAR-NAME.
054100     PERFORM  PRINT-DETAIL.
054200*
054300*
054400 ANOTHER-REMARK.
054500     MOVE     SPACE TO TEST-RESULTS.
054600     MOVE "THE FOLLOWING TESTS        " TO RE-MARK.
054700     PERFORM  PRINT-DETAIL.
054800     MOVE "TEST THE COMPARISONS IN    " TO RE-MARK.
054900     PERFORM  PRINT-DETAIL.
055000     MOVE "SWITCH-STATUS, RELATION    " TO RE-MARK.
055100     PERFORM  PRINT-DETAIL.
055200     MOVE "AND CLASS CONDITIONALS.    " TO RE-MARK.
055300     PERFORM  PRINT-DETAIL.
055400 SWH-INIT-GF-1.
055500     MOVE   "V1-13 4.5.2" TO ANSI-REFERENCE.
055600     MOVE "SWITCH-STATUS" TO FEATURE.
055700 SWH-TEST-GF-1.
055800A    IF      ON-SWITCH-1
055900A            PERFORM PASS
056000A    ELSE
056100A            PERFORM FAIL.
056200A    GO TO   SWH-WRITE-GF-1.
056300 SWH-DELETE-GF-1.
056400B    MOVE "SWITCHES NOT IMPLEMENTED" TO RE-MARK.
056500     PERFORM  DE-LETE.
056600 SWH-WRITE-GF-1.
056700     MOVE "SWH-TEST-GF-1" TO PAR-NAME.
056800     PERFORM  PRINT-DETAIL.
056900 SWH-INIT-GF-2.
057000     MOVE   "V1-13 4.5.2" TO ANSI-REFERENCE.
057100 SWH-TEST-GF-2.
057200A    IF       OFF-SWITCH-1
057300A             PERFORM FAIL
057400A             ELSE
057500A             PERFORM PASS.
057600A    GO TO    SWH-WRITE-GF-2.
057700 SWH-DELETE-GF-2.
057800B    MOVE "SWITCHES NOT IMPLEMENTED" TO RE-MARK.
057900     PERFORM  DE-LETE.
058000 SWH-WRITE-GF-2.
058100     MOVE "SWH-TEST-GF-2" TO PAR-NAME.
058200     PERFORM  PRINT-DETAIL.
058300 SWH-INIT-GF-3.
058400     MOVE   "V1-13 4.5.2" TO ANSI-REFERENCE.
058500 SWH-TEST-GF-3.
058600A    IF       OFF-SWITCH-2
058700A             PERFORM PASS
058800A             ELSE
058900A             PERFORM FAIL.
059000A    GO TO    SWH-WRITE-GF-3.
059100 SWH-DELETE-GF-3.
059200B    MOVE "SWITCHES NOT IMPLEMENTED" TO RE-MARK.
059300     PERFORM  DE-LETE.
059400 SWH-WRITE-GF-3.
059500     MOVE "SWH-TEST-GF-3" TO PAR-NAME.
059600     PERFORM  PRINT-DETAIL.
059700 SWH-INIT-GF-4.
059800     MOVE   "V1-13 4.5.2" TO ANSI-REFERENCE.
059900 SWH-TEST-GF-4.
060000A    IF       ON-SWITCH-2
060100A             PERFORM FAIL
060200A             ELSE
060300A             PERFORM PASS.
060400A    GO TO    SWH-WRITE-GF-4.
060500 SWH-DELETE-GF-4.
060600B    MOVE "SWITCHES NOT IMPLEMENTED" TO RE-MARK.
060700     PERFORM  DE-LETE.
060800 SWH-WRITE-GF-4.
060900     MOVE "SWH-TEST-GF-4" TO PAR-NAME.
061000     PERFORM  PRINT-DETAIL.
061100 SWH-TEST-5.
061200A    IF NOT ON-SWITCH-1
061300A        MOVE "SWITCH-1  OFF " TO COMPUTED-A
061400A        MOVE "SWITCH-1 EXPECTED ON" TO CORRECT-A
061500A        PERFORM FAIL
061600A        GO TO SWH-WRITE-5.
061700A    PERFORM PASS.
061800A    GO TO SWH-WRITE-5.
061900 SWH-DELETE-5.
062000B    MOVE "SWITCHES NOT IMPLEMENTED" TO RE-MARK.
062100     PERFORM DE-LETE.
062200 SWH-WRITE-5.
062300     MOVE "SWH-TEST-5" TO PAR-NAME.
062400     PERFORM PRINT-DETAIL.
062500 SWH-TEST-6.
062600A    IF NOT OFF-SWITCH-1
062700A        PERFORM PASS
062800A        GO TO SWH-WRITE-6.
062900A    MOVE "SWITCH-1  OFF " TO COMPUTED-A.
063000A    MOVE "SWITCH-1 EXPECTED ON" TO CORRECT-A.
063100A    PERFORM FAIL.
063200A    GO TO SWH-WRITE-6.
063300 SWH-DELETE-6.
063400B    MOVE "SWITCHES NOT IMPLEMENTED" TO RE-MARK.
063500     PERFORM DE-LETE.
063600 SWH-WRITE-6.
063700     MOVE "SWH-TEST-6" TO PAR-NAME.
063800     PERFORM PRINT-DETAIL.
063900 SWH-TEST-7.
064000A    IF NOT ON-SWITCH-2
064100A        PERFORM PASS
064200A        GO TO SWH-WRITE-7.
064300A    MOVE "SWITCH-2  ON " TO COMPUTED-A.
064400A    MOVE "SWITCH2 EXPECTED OFF" TO CORRECT-A.
064500A    PERFORM FAIL.
064600A    GO TO SWH-WRITE-7.
064700 SWH-DELETE-7.
064800B    MOVE "SWITCHES NOT IMPLEMENTED" TO RE-MARK.
064900     PERFORM DE-LETE.
065000 SWH-WRITE-7.
065100     MOVE "SWH-TEST-7" TO PAR-NAME.
065200     PERFORM PRINT-DETAIL.
065300 SWH-TEST-8.
065400A    IF NOT OFF-SWITCH-2
065500A        MOVE "SWITCH-2  ON " TO COMPUTED-A
065600A        MOVE "SWITCH2 EXPECTED OFF" TO CORRECT-A
065700A        PERFORM FAIL
065800A        GO TO SWH-WRITE-8.
065900A    PERFORM PASS.
066000A    GO TO  SWH-WRITE-8.
066100 SWH-DELETE-8.
066200B    MOVE  "SWITCHES NOT IMPLEMENTED" TO RE-MARK.
066300     PERFORM DE-LETE.
066400 SWH-WRITE-8.
066500     MOVE  "SWH-TEST-8" TO PAR-NAME.
066600     PERFORM PRINT-DETAIL.
066700*
066800*
066900 CCVS-EXIT SECTION.
067000 CCVS-999999.
067100     GO TO CLOSE-FILES.
