000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC251A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    THIS PROGRAM TESTS FORMAT 5 OF THE DIVIDE STATEMENT.      *
002300*                                                              *
002400****************************************************************
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.
002800     XXXXX082.
002900 OBJECT-COMPUTER.
003000     XXXXX083.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300     SELECT PRINT-FILE ASSIGN TO
003400     XXXXX055.
003500 DATA DIVISION.
003600 FILE SECTION.
003700 FD  PRINT-FILE.
003800 01  PRINT-REC PICTURE X(120).
003900 01  DUMMY-RECORD PICTURE X(120).
004000 WORKING-STORAGE SECTION.
004100 01  WRK-DU-1V17-1 PIC 9V9(17) VALUE 3.14159265358979323.
004200 01  WRK-DU-1V5-1 PIC 9V9(5).
004300 01  WRK-NE-1 PIC .9999/99999,99999,99.
004400 01  WS-REMAINDERS.
004500   03  WS-REM                    PIC 99 OCCURS 20.
004600 01  WRK-XN-00001-1              PIC X.
004700 01  WRK-XN-00001-2              PIC X.
004800 01  WS-46.
004900   03  WS-1-20                   PIC X(20).
005000   03  WS-21-40                  PIC X(20).
005100   03  WS-41-46                  PIC X(6).
005200 77  11A                PICTURE 9999  VALUE 9.
005300 77  11B   PICTURE 99; VALUE 8.
005400 77  1111C PICTURE 99 VALUE 9.
005500 77  WRK-DS-02V00                 PICTURE S99.
005600     88 TEST-2NUC-COND-99         VALUE 99.
005700 77  A99-DS-02V00                 PICTURE S99    VALUE 99.
005800 77  WRK-DS-18V00                 PICTURE S9(18).
005900 77  WRK-DU-2V1-1                 PICTURE S99V9.
006000 77  A18ONES-DS-18V00             PICTURE S9(18)
006100                                  VALUE 111111111111111111.
006200 77  A18TWOS-DS-18V00             PICTURE S9(18)
006300                                  VALUE 222222222222222222.
006400 77  WRK-DS-05V00                 PICTURE S9(5).
006500 77  A02TWOS-DU-02V00             PICTURE 99     VALUE 22.
006600 77  A02TWOS-DS-03V02             PICTURE S999V99 VALUE +022.00.
006700 77  ATWO-DS-01V00                PICTURE S9     VALUE 2.
006800 77  AZERO-DS-05V05               PICTURE S9(5)V9(5) VALUE ZERO.
006900 77  WRK-DS-06V06                 PICTURE S9(6)V9(6).
007000 77  WRK-DS-0201P                 PICTURE S99P.
007100 77  A05ONES-DS-05V00             PICTURE S9(5)  VALUE 11111.
007200 77  WRK-DS-09V00                 PICTURE S9(9).
007300 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
007400 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09
007500                                  PICTURE S9(18).
007600 77  XRAY                    PICTURE IS X.
007700 77  W-1                     PICTURE IS 9.
007800 77  W-2                     PICTURE IS 99.
007900 77  W-3                     PICTURE IS 999.
008000 77  W-5                PICTURE 99  VALUE ZERO.
008100 77  W-9                     PICTURE 999.
008200 77  W-11               PICTURE S99V9.
008300 77  D-1                PICTURE S9V99  VALUE 1.06.
008400 77  D-7                PICTURE S99V99  VALUE 1.09.
008500 77  ONE                     PICTURE IS 9      VALUE IS 1.
008600 77  TWO                     PICTURE IS S9     VALUE IS 2.
008700 77  THREE                   PICTURE IS S9     VALUE IS 3.
008800 77  FOUR                    PICTURE IS S9     VALUE IS 4.
008900 77  FIVE                    PICTURE IS S9     VALUE IS 5.
009000 77  SIX                     PICTURE IS S9     VALUE IS 6.
009100 77  SEVEN                   PICTURE IS S9     VALUE IS 7.
009200 77  EIGHT                   PICTURE IS 9      VALUE IS 8.
009300 77  NINE                    PICTURE IS S9     VALUE IS 9.
009400 77  TEN                     PICTURE IS S99    VALUE IS 10.
009500 77  FIFTEEN                 PICTURE IS S99    VALUE IS 15.
009600 77  TWENTY                  PICTURE IS S99    VALUE IS 20.
009700 77  TWENTY-5                PICTURE IS S99    VALUE IS 25.
009800 77  25COUNT PICTURE 999 VALUE ZERO.
009900 77  25ANS PICTURE  99 VALUE ZERO.
010000 77  25REM PICTURE 99 VALUE ZERO.
010100 77  DIV-30-Y1 PICTURE 999 USAGE COMP SYNC RIGHT VALUE 31.
010200 77  DIV-30-Y2 PICTURE 999 USAGE COMP VALUE 54.
010300 77  DIV-30-Y3 PICTURE 999 VALUE 151.
010400 77  DIV-30-Y4         PICTURE 9(4) SYNC RIGHT VALUE 1010.
010500 77  DIV-Z1-30 PICTURE 999 USAGE COMP VALUE ZERO.
010600 77  DIV-Z2-30 PICTURE 999 SYNC RIGHT VALUE ZERO.
010700 77  DIV-Z3-30 PICTURE 999 USAGE COMP SYNC RIGHT VALUE ZERO.
010800 77  DIV-Z4-30 PICTURE 999 VALUE ZERO.
010900 77  DIV-30-A1 PICTURE 999 SYNC RIGHT VALUE ZERO.
011000 77  DIV-30-A2 PICTURE 999 VALUE ZERO.
011100 77  DIV-30-A3 PICTURE 999 USAGE COMP SYNC RIGHT VALUE ZERO.
011200 77  DIV-30-A4 PICTURE 999 USAGE COMP VALUE ZERO.
011300 01  DIV-ENTRIES.
011400     02 DIV11                PICTURE 999       VALUE 105.
011500     02 DIV12                PICTURE 9999      VALUE 1000.
011600     02 DIV13                PICTURE 999.
011700     02 DIV14                PICTURE 99.
011800     02 DIV15                PICTURE 9V9       VALUE 1.1.
011900     02 DIV16                PICTURE 99V99     VALUE 89.10.
012000     02 DIV17                PICTURE 99V99.
012100     02 DIV18                PICTURE 9999.
012200     02 DIV19                PICTURE 99        VALUE 14.
012300     02 DIV20                PICTURE 9999      VALUE 2147.
012400     02 DIV21                PICTURE 999.
012500     02 DIV22                     PICTURE 99.
012600 01  WRK-DU-05V00-0001            PIC 9(5).
012700 01  WRK-DS-05V00-0002            PIC S9(5).
012800 01  WRK-CS-05V00-0003            PIC S9(5) COMP.
012900 01  WRK-DU-04V02-0004            PIC 9(4)V9(2).
013000 01  WRK-DS-04V01-0005            PIC S9(4)V9.
013100 01  NE-0008                      PIC $9(4).99-.
013200 01  NE-0009                      PIC ***99.
013300 01  NE-04V01-0006     PIC ****.9.
013400 01  GRP-0010.
013500     02 WRK-DU-03V00-L-0011       PIC 9(03) SYNC LEFT.
013600     02 WRK-O005F-0012        OCCURS   5  TIMES.
013700        03 WRK-O003F-0013     OCCURS   3  TIMES.
013800           05 WRK-DS-03V04-O003F-0014 PIC S9(3)V9999
013900                                            OCCURS 3 TIMES.
014000 01  DS-02V00-0001                PIC S99  VALUE  16.
014100 01  DS-03V00-0002                PIC S999 VALUE  174.
014200 01  CS-05V00-0003                PIC S9(5) COMP  VALUE 10.
014300 01    TA--X           PIC 9(5)  COMP VALUE ZERO.
014400 01  MINUS-NAMES.
014500     02  WHOLE-FIELD              PICTURE S9(18).
014600     02  PLUS-NAME1  PICTURE S9(18) VALUE +333333333333333333.
014700     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
014800     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
014900     02  ALPHA-LIT                PICTURE X(5)  VALUE SPACE.
015000     02  SNEG-LIT2                PICTURE S9(5)  VALUE -70718.
015100 01  TEST-RESULTS.
015200     02 FILLER                   PIC X      VALUE SPACE.
015300     02 FEATURE                  PIC X(20)  VALUE SPACE.
015400     02 FILLER                   PIC X      VALUE SPACE.
015500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
015600     02 FILLER                   PIC X      VALUE SPACE.
015700     02  PAR-NAME.
015800       03 FILLER                 PIC X(19)  VALUE SPACE.
015900       03  PARDOT-X              PIC X      VALUE SPACE.
016000       03 DOTVALUE               PIC 99     VALUE ZERO.
016100     02 FILLER                   PIC X(8)   VALUE SPACE.
016200     02 RE-MARK                  PIC X(61).
016300 01  TEST-COMPUTED.
016400     02 FILLER                   PIC X(30)  VALUE SPACE.
016500     02 FILLER                   PIC X(17)  VALUE
016600            "       COMPUTED=".
016700     02 COMPUTED-X.
016800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
016900     03 COMPUTED-N               REDEFINES COMPUTED-A
017000                                 PIC -9(9).9(9).
017100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
017200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
017300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
017400     03       CM-18V0 REDEFINES COMPUTED-A.
017500         04 COMPUTED-18V0                    PIC -9(18).
017600         04 FILLER                           PIC X.
017700     03 FILLER PIC X(50) VALUE SPACE.
017800 01  TEST-CORRECT.
017900     02 FILLER PIC X(30) VALUE SPACE.
018000     02 FILLER PIC X(17) VALUE "       CORRECT =".
018100     02 CORRECT-X.
018200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
018300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
018400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
018500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
018600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
018700     03      CR-18V0 REDEFINES CORRECT-A.
018800         04 CORRECT-18V0                     PIC -9(18).
018900         04 FILLER                           PIC X.
019000     03 FILLER PIC X(2) VALUE SPACE.
019100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
019200 01  CCVS-C-1.
019300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
019400-    "SS  PARAGRAPH-NAME
019500-    "       REMARKS".
019600     02 FILLER                     PIC X(20)    VALUE SPACE.
019700 01  CCVS-C-2.
019800     02 FILLER                     PIC X        VALUE SPACE.
019900     02 FILLER                     PIC X(6)     VALUE "TESTED".
020000     02 FILLER                     PIC X(15)    VALUE SPACE.
020100     02 FILLER                     PIC X(4)     VALUE "FAIL".
020200     02 FILLER                     PIC X(94)    VALUE SPACE.
020300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
020400 01  REC-CT                        PIC 99       VALUE ZERO.
020500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
020600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
020700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
020800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
020900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
021000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
021100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
021200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
021300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
021400 01  CCVS-H-1.
021500     02  FILLER                    PIC X(39)    VALUE SPACES.
021600     02  FILLER                    PIC X(42)    VALUE
021700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
021800     02  FILLER                    PIC X(39)    VALUE SPACES.
021900 01  CCVS-H-2A.
022000   02  FILLER                        PIC X(40)  VALUE SPACE.
022100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
022200   02  FILLER                        PIC XXXX   VALUE
022300     "4.2 ".
022400   02  FILLER                        PIC X(28)  VALUE
022500            " COPY - NOT FOR DISTRIBUTION".
022600   02  FILLER                        PIC X(41)  VALUE SPACE.
022700
022800 01  CCVS-H-2B.
022900   02  FILLER                        PIC X(15)  VALUE
023000            "TEST RESULT OF ".
023100   02  TEST-ID                       PIC X(9).
023200   02  FILLER                        PIC X(4)   VALUE
023300            " IN ".
023400   02  FILLER                        PIC X(12)  VALUE
023500     " HIGH       ".
023600   02  FILLER                        PIC X(22)  VALUE
023700            " LEVEL VALIDATION FOR ".
023800   02  FILLER                        PIC X(58)  VALUE
023900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024000 01  CCVS-H-3.
024100     02  FILLER                      PIC X(34)  VALUE
024200            " FOR OFFICIAL USE ONLY    ".
024300     02  FILLER                      PIC X(58)  VALUE
024400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
024500     02  FILLER                      PIC X(28)  VALUE
024600            "  COPYRIGHT   1985 ".
024700 01  CCVS-E-1.
024800     02 FILLER                       PIC X(52)  VALUE SPACE.
024900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
025000     02 ID-AGAIN                     PIC X(9).
025100     02 FILLER                       PIC X(45)  VALUE SPACES.
025200 01  CCVS-E-2.
025300     02  FILLER                      PIC X(31)  VALUE SPACE.
025400     02  FILLER                      PIC X(21)  VALUE SPACE.
025500     02 CCVS-E-2-2.
025600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
025700         03 FILLER                   PIC X      VALUE SPACE.
025800         03 ENDER-DESC               PIC X(44)  VALUE
025900            "ERRORS ENCOUNTERED".
026000 01  CCVS-E-3.
026100     02  FILLER                      PIC X(22)  VALUE
026200            " FOR OFFICIAL USE ONLY".
026300     02  FILLER                      PIC X(12)  VALUE SPACE.
026400     02  FILLER                      PIC X(58)  VALUE
026500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026600     02  FILLER                      PIC X(13)  VALUE SPACE.
026700     02 FILLER                       PIC X(15)  VALUE
026800             " COPYRIGHT 1985".
026900 01  CCVS-E-4.
027000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
027100     02 FILLER                       PIC X(4)   VALUE " OF ".
027200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
027300     02 FILLER                       PIC X(40)  VALUE
027400      "  TESTS WERE EXECUTED SUCCESSFULLY".
027500 01  XXINFO.
027600     02 FILLER                       PIC X(19)  VALUE
027700            "*** INFORMATION ***".
027800     02 INFO-TEXT.
027900       04 FILLER                     PIC X(8)   VALUE SPACE.
028000       04 XXCOMPUTED                 PIC X(20).
028100       04 FILLER                     PIC X(5)   VALUE SPACE.
028200       04 XXCORRECT                  PIC X(20).
028300     02 INF-ANSI-REFERENCE           PIC X(48).
028400 01  HYPHEN-LINE.
028500     02 FILLER  PIC IS X VALUE IS SPACE.
028600     02 FILLER  PIC IS X(65)    VALUE IS "************************
028700-    "*****************************************".
028800     02 FILLER  PIC IS X(54)    VALUE IS "************************
028900-    "******************************".
029000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
029100     "NC251A".
029200 PROCEDURE DIVISION.
029300 CCVS1 SECTION.
029400 OPEN-FILES.
029500     OPEN     OUTPUT PRINT-FILE.
029600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
029700     MOVE    SPACE TO TEST-RESULTS.
029800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
029900     GO TO CCVS1-EXIT.
030000 CLOSE-FILES.
030100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
030200 TERMINATE-CCVS.
030300S    EXIT PROGRAM.
030400STERMINATE-CALL.
030500     STOP     RUN.
030600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
030700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
030800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
030900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
031000     MOVE "****TEST DELETED****" TO RE-MARK.
031100 PRINT-DETAIL.
031200     IF REC-CT NOT EQUAL TO ZERO
031300             MOVE "." TO PARDOT-X
031400             MOVE REC-CT TO DOTVALUE.
031500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
031600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
031700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
031800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
031900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
032000     MOVE SPACE TO CORRECT-X.
032100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
032200     MOVE     SPACE TO RE-MARK.
032300 HEAD-ROUTINE.
032400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
032700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
032800 COLUMN-NAMES-ROUTINE.
032900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
033200 END-ROUTINE.
033300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
033400 END-RTN-EXIT.
033500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033600 END-ROUTINE-1.
033700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
033800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
033900      ADD PASS-COUNTER TO ERROR-HOLD.
034000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
034100      MOVE PASS-COUNTER TO CCVS-E-4-1.
034200      MOVE ERROR-HOLD TO CCVS-E-4-2.
034300      MOVE CCVS-E-4 TO CCVS-E-2-2.
034400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
034500  END-ROUTINE-12.
034600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
034700     IF       ERROR-COUNTER IS EQUAL TO ZERO
034800         MOVE "NO " TO ERROR-TOTAL
034900         ELSE
035000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
035100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
035200     PERFORM WRITE-LINE.
035300 END-ROUTINE-13.
035400     IF DELETE-COUNTER IS EQUAL TO ZERO
035500         MOVE "NO " TO ERROR-TOTAL  ELSE
035600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
035700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
035800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035900      IF   INSPECT-COUNTER EQUAL TO ZERO
036000          MOVE "NO " TO ERROR-TOTAL
036100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
036200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
036300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036500 WRITE-LINE.
036600     ADD 1 TO RECORD-COUNT.
036700Y    IF RECORD-COUNT GREATER 50
036800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
036900Y        MOVE SPACE TO DUMMY-RECORD
037000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
037100Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
037200Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
037300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
037400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
037500Y        MOVE ZERO TO RECORD-COUNT.
037600     PERFORM WRT-LN.
037700 WRT-LN.
037800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
037900     MOVE SPACE TO DUMMY-RECORD.
038000 BLANK-LINE-PRINT.
038100     PERFORM WRT-LN.
038200 FAIL-ROUTINE.
038300     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038400     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038600     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
038700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038800     MOVE   SPACES TO INF-ANSI-REFERENCE.
038900     GO TO  FAIL-ROUTINE-EX.
039000 FAIL-ROUTINE-WRITE.
039100     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
039200     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
039300     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
039400     MOVE   SPACES TO COR-ANSI-REFERENCE.
039500 FAIL-ROUTINE-EX. EXIT.
039600 BAIL-OUT.
039700     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
039800     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
039900 BAIL-OUT-WRITE.
040000     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
040100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
040200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040300     MOVE   SPACES TO INF-ANSI-REFERENCE.
040400 BAIL-OUT-EX. EXIT.
040500 CCVS1-EXIT.
040600     EXIT.
040700 SECT-NC251A-001 SECTION.
040800 DIV-TEST-4.
040900     DIVIDE DIV16 BY DIV15 GIVING DIV17 REMAINDER DIV18.
041000     IF DIV18 IS EQUAL TO ZERO
041100              PERFORM PASS
041200              GO TO DIV-WRITE-4.
041300     PERFORM FAIL.
041400     MOVE DIV18 TO COMPUTED-N.
041500     MOVE "0000" TO CORRECT-A.
041600     GO TO DIV-WRITE-4.
041700 DIV-DELETE-4.
041800     PERFORM DE-LETE.
041900 DIV-WRITE-4.
042000     MOVE "DIV-TEST-4" TO PAR-NAME.
042100     PERFORM PRINT-DETAIL.
042200 DIV-TEST-5.
042300     MOVE ZERO TO DIV21.
042400     MOVE ZERO TO DIV22.
042500     DIVIDE DIV20 BY DIV19 GIVING DIV21 ROUNDED REMAINDER
042600     DIV22.
042700     IF DIV22 IS EQUAL TO 05
042800              PERFORM PASS
042900              GO TO DIV-WRITE-5.
043000     PERFORM FAIL.
043100     MOVE DIV22 TO COMPUTED-N.
043200     MOVE "+05" TO CORRECT-A.
043300     GO TO DIV-WRITE-5.
043400 DIV-DELETE-5.
043500     PERFORM DE-LETE.
043600 DIV-WRITE-5.
043700     MOVE "DIV-TEST-5" TO PAR-NAME.
043800     PERFORM PRINT-DETAIL.
043900*
044000 DIV-INIT-F5-3.
044100     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
044200     MOVE   "DIV-TEST-F5-3-0"  TO PAR-NAME.
044300     MOVE    40   TO 25COUNT.
044400     MOVE    ZERO TO 25ANS.
044500     MOVE    ZERO TO 25REM.
044600     MOVE    1    TO REC-CT.
044700 DIV-TEST-F5-3-0.
044800     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
044900             ON SIZE ERROR
045000             MOVE   "SIZE ERROR SHOULD NOT HAVE OCCURED"
045100                  TO RE-MARK
045200             PERFORM FAIL
045300             PERFORM PRINT-DETAIL
045400             GO TO   DIV-TEST-F5-3-1.
045500     PERFORM PASS.
045600     PERFORM PRINT-DETAIL.
045700     GO TO   DIV-TEST-F5-3-1.
045800 DIV-DELETE-F5-3.
045900     PERFORM DE-LETE.
046000     PERFORM PRINT-DETAIL.
046100     GO TO   DIV-INIT-F5-4.
046200 DIV-TEST-F5-3-1.
046300     MOVE   "DIV-TEST-F5-3-1" TO PAR-NAME.
046400     ADD     1 TO REC-CT.
046500     IF      25ANS NOT = 2
046600             MOVE    2 TO CORRECT-N
046700             MOVE    25ANS TO COMPUTED-N
046800             MOVE   "INVALID QUOTIENT" TO RE-MARK
046900             PERFORM FAIL
047000             PERFORM PRINT-DETAIL
047100     ELSE
047200             PERFORM PASS
047300             PERFORM PRINT-DETAIL.
047400 DIV-TEST-F5-3-2.
047500     MOVE   "DIV-TEST-F5-3-2" TO PAR-NAME.
047600     ADD     1 TO REC-CT.
047700     IF      25REM NOT = 20
047800             MOVE    25REM TO COMPUTED-N
047900             MOVE    20    TO CORRECT-N
048000             MOVE   "INVALID REMAINDER" TO RE-MARK
048100             PERFORM FAIL
048200             PERFORM PRINT-DETAIL
048300     ELSE
048400             PERFORM PASS
048500             PERFORM PRINT-DETAIL.
048600*
048700 DIV-INIT-F5-4.
048800     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
048900     MOVE   "DIV-TEST-F5-4-0"  TO PAR-NAME.
049000     MOVE    ZERO TO 25COUNT.
049100     MOVE    ZERO TO 25ANS.
049200     MOVE    ZERO TO 25REM.
049300     MOVE    1    TO REC-CT.
049400 DIV-TEST-F5-4-0.
049500     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
049600             ON SIZE ERROR
049700             PERFORM PASS
049800             PERFORM PRINT-DETAIL
049900             GO TO   DIV-TEST-F5-4-1.
050000     MOVE   "ON SIZE ERROR SHOULD HAVE OCCURRED" TO RE-MARK.
050100     PERFORM FAIL.
050200     PERFORM PRINT-DETAIL.
050300     GO TO   DIV-TEST-F5-4-1.
050400 DIV-DELETE-F5-4.
050500     PERFORM DE-LETE.
050600     PERFORM PRINT-DETAIL.
050700     GO TO   DIV-INIT-F5-5.
050800 DIV-TEST-F5-4-1.
050900     MOVE   "DIV-TEST-F5-4-1" TO PAR-NAME.
051000     ADD     1 TO REC-CT.
051100     IF      25ANS NOT = 0
051200             MOVE    0 TO CORRECT-N
051300             MOVE    25ANS TO COMPUTED-N
051400             MOVE   "INVALID QUOTIENT" TO RE-MARK
051500             PERFORM FAIL
051600             PERFORM PRINT-DETAIL
051700     ELSE
051800             PERFORM PASS
051900             PERFORM PRINT-DETAIL.
052000 DIV-TEST-F5-4-2.
052100     MOVE   "DIV-TEST-F5-4-2" TO PAR-NAME.
052200     ADD     1 TO REC-CT.
052300     IF      25REM NOT = ZERO
052400             MOVE    25REM TO COMPUTED-N
052500             MOVE    ZERO  TO CORRECT-N
052600             MOVE   "INVALID REMAINDER" TO RE-MARK
052700             PERFORM FAIL
052800             PERFORM PRINT-DETAIL
052900     ELSE
053000             PERFORM PASS
053100             PERFORM PRINT-DETAIL.
053200*
053300 DIV-INIT-F5-5.
053400     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
053500     MOVE   "DIV-TEST-F5-5-0"  TO PAR-NAME.
053600     MOVE    3    TO 25COUNT.
053700     MOVE    ZERO TO 25ANS.
053800     MOVE    ZERO TO 25REM.
053900     MOVE    1    TO REC-CT.
054000 DIV-TEST-F5-5-0.
054100     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
054200             ON SIZE ERROR
054300             MOVE   "SIZE ERROR SHOULD NOT HAVE OCCURED"
054400                  TO RE-MARK
054500             PERFORM FAIL
054600             PERFORM PRINT-DETAIL
054700             GO TO   DIV-TEST-F5-5-1.
054800     PERFORM PASS.
054900     PERFORM PRINT-DETAIL.
055000     GO TO   DIV-TEST-F5-5-1.
055100 DIV-DELETE-F5-5.
055200     PERFORM DE-LETE.
055300     PERFORM PRINT-DETAIL.
055400     GO TO   DIV-TEST-12.
055500 DIV-TEST-F5-5-1.
055600     MOVE   "DIV-TEST-F5-5-1" TO PAR-NAME.
055700     ADD     1 TO REC-CT.
055800     IF      25ANS NOT = 33
055900             MOVE    33    TO CORRECT-N
056000             MOVE    25ANS TO COMPUTED-N
056100             MOVE   "INVALID QUOTIENT" TO RE-MARK
056200             PERFORM FAIL
056300             PERFORM PRINT-DETAIL
056400     ELSE
056500             PERFORM PASS
056600             PERFORM PRINT-DETAIL.
056700 DIV-TEST-F5-5-2.
056800     MOVE   "DIV-TEST-F5-5-2" TO PAR-NAME.
056900     ADD     1 TO REC-CT.
057000     IF      25REM NOT = 1
057100             MOVE    25REM TO COMPUTED-N
057200             MOVE    1     TO CORRECT-N
057300             MOVE   "INVALID REMAINDER" TO RE-MARK
057400             PERFORM FAIL
057500             PERFORM PRINT-DETAIL
057600     ELSE
057700             PERFORM PASS
057800             PERFORM PRINT-DETAIL.
057900*
058000 DIV-TEST-12.
058100     DIVIDE 230 BY DIV-30-Y2 GIVING DIV-Z2-30 REMAINDER
058200     DIV-30-A2.
058300     IF DIV-Z2-30 EQUAL TO 4 AND DIV-30-A2 EQUAL TO 14
058400              PERFORM PASS
058500              GO TO DIV-WRITE-12.
058600     PERFORM FAIL.
058700     MOVE   4 TO CORRECT-N.
058800     MOVE DIV-30-A3 TO COMPUTED-N.
058900     GO TO DIV-WRITE-12.
059000 DIV-DELETE-12.
059100     PERFORM DE-LETE.
059200 DIV-WRITE-12.
059300     MOVE "DIV-TEST-12" TO PAR-NAME.
059400     PERFORM PRINT-DETAIL.
059500*
059600 DIV-INIT-F5-7.
059700     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
059800     MOVE   "DIV-TEST-F5-7-0"  TO PAR-NAME.
059900     MOVE    151  TO DIV-30-Y3.
060000     MOVE    ZERO TO DIV-Z3-30.
060100     MOVE    ZERO TO DIV-30-A3.
060200     MOVE    1    TO REC-CT.
060300 DIV-TEST-F5-7-0.
060400     DIVIDE 681 BY DIV-30-Y3 GIVING DIV-Z3-30 REMAINDER
060500     DIV-30-A3.
060600     GO TO   DIV-TEST-F5-7-1.
060700 DIV-DELETE-F5-7.
060800     PERFORM DE-LETE.
060900     PERFORM PRINT-DETAIL.
061000     GO TO   DIV-INIT-F5-8.
061100 DIV-TEST-F5-7-1.
061200     MOVE   "DIV-TEST-F5-7-1" TO PAR-NAME.
061300     ADD     1 TO REC-CT.
061400     IF      DIV-Z3-30 NOT EQUAL TO 4
061500             MOVE    4     TO CORRECT-N
061600             MOVE    DIV-Z3-30 TO COMPUTED-N
061700             MOVE   "INVALID QUOTIENT" TO RE-MARK
061800             PERFORM FAIL
061900             PERFORM PRINT-DETAIL
062000     ELSE
062100             PERFORM PASS
062200             PERFORM PRINT-DETAIL.
062300 DIV-TEST-F5-7-2.
062400     MOVE   "DIV-TEST-F5-7-2" TO PAR-NAME.
062500     ADD     1 TO REC-CT.
062600     IF      DIV-30-A3 NOT EQUAL TO 77
062700             MOVE    DIV-30-A3 TO COMPUTED-N
062800             MOVE    77    TO CORRECT-N
062900             MOVE   "INVALID REMAINDER" TO RE-MARK
063000             PERFORM FAIL
063100             PERFORM PRINT-DETAIL
063200     ELSE
063300             PERFORM PASS
063400             PERFORM PRINT-DETAIL.
063500*
063600 DIV-INIT-F5-8.
063700     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
063800     MOVE   "DIV-TEST-F5-8-0"  TO PAR-NAME.
063900     MOVE    1010 TO DIV-30-Y4.
064000     MOVE    ZERO TO DIV-Z4-30.
064100     MOVE    ZERO TO DIV-30-A4.
064200     MOVE    1    TO REC-CT.
064300 DIV-TEST-F5-8-0.
064400     DIVIDE  4150 BY DIV-30-Y4 GIVING DIV-Z4-30 REMAINDER
064500     DIV-30-A4.
064600     GO TO   DIV-TEST-F5-8-1.
064700 DIV-DELETE-F5-8.
064800     PERFORM DE-LETE.
064900     PERFORM PRINT-DETAIL.
065000     GO TO   DIV-INIT-F5-9.
065100 DIV-TEST-F5-8-1.
065200     MOVE   "DIV-TEST-F5-8-1" TO PAR-NAME.
065300     ADD     1 TO REC-CT.
065400     IF      DIV-Z4-30 NOT EQUAL TO 4
065500             MOVE    4     TO CORRECT-N
065600             MOVE    DIV-Z4-30 TO COMPUTED-N
065700             MOVE   "INVALID QUOTIENT" TO RE-MARK
065800             PERFORM FAIL
065900             PERFORM PRINT-DETAIL
066000     ELSE
066100             PERFORM PASS
066200             PERFORM PRINT-DETAIL.
066300 DIV-TEST-F5-8-2.
066400     MOVE   "DIV-TEST-F5-8-2" TO PAR-NAME.
066500     ADD     1 TO REC-CT.
066600     IF      DIV-30-A4 NOT EQUAL TO 110
066700             MOVE    DIV-30-A4 TO COMPUTED-N
066800             MOVE    110   TO CORRECT-N
066900             MOVE   "INVALID REMAINDER" TO RE-MARK
067000             PERFORM FAIL
067100             PERFORM PRINT-DETAIL
067200     ELSE
067300             PERFORM PASS
067400             PERFORM PRINT-DETAIL.
067500*
067600*
067700 DIV-INIT-F5-9.
067800     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
067900     MOVE   "DIV-TEST-F5-9-0"  TO PAR-NAME.
068000     MOVE    31   TO DIV-30-Y1.
068100     MOVE    ZERO TO DIV-Z1-30.
068200     MOVE    ZERO TO DIV-30-A1.
068300     MOVE    1    TO REC-CT.
068400 DIV-TEST-F5-9-0.
068500     DIVIDE 150 BY DIV-30-Y1 GIVING DIV-Z1-30 REMAINDER DIV-30-A1.
068600     GO TO   DIV-TEST-F5-9-1.
068700 DIV-DELETE-F5-9.
068800     PERFORM DE-LETE.
068900     PERFORM PRINT-DETAIL.
069000     GO TO   DIV-INIT-F5-10.
069100 DIV-TEST-F5-9-1.
069200     MOVE   "DIV-TEST-F5-9-1" TO PAR-NAME.
069300     ADD     1 TO REC-CT.
069400     IF      DIV-Z1-30 NOT EQUAL TO 4
069500             MOVE    4     TO CORRECT-N
069600             MOVE    DIV-Z1-30 TO COMPUTED-N
069700             MOVE   "INVALID QUOTIENT" TO RE-MARK
069800             PERFORM FAIL
069900             PERFORM PRINT-DETAIL
070000     ELSE
070100             PERFORM PASS
070200             PERFORM PRINT-DETAIL.
070300 DIV-TEST-F5-9-2.
070400     MOVE   "DIV-TEST-F5-9-2" TO PAR-NAME.
070500     ADD     1 TO REC-CT.
070600     IF      DIV-30-A1 NOT EQUAL TO 26
070700             MOVE    DIV-30-A4 TO COMPUTED-N
070800             MOVE    26    TO CORRECT-N
070900             MOVE   "INVALID REMAINDER" TO RE-MARK
071000             PERFORM FAIL
071100             PERFORM PRINT-DETAIL
071200     ELSE
071300             PERFORM PASS
071400             PERFORM PRINT-DETAIL.
071500*
071600 DIV-INIT-F5-10.
071700     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
071800     MOVE   "DIV-TEST-F5-10-0" TO PAR-NAME.
071900     MOVE    40   TO 25COUNT.
072000     MOVE    ZERO TO 25ANS.
072100     MOVE    ZERO TO 25REM.
072200     MOVE    1    TO REC-CT.
072300 DIV-TEST-F5-10-0.
072400     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
072500         NOT ON SIZE ERROR
072600             PERFORM PASS
072700             PERFORM PRINT-DETAIL
072800             GO TO   DIV-TEST-F5-10-1.
072900     MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED" TO RE-MARK.
073000     PERFORM FAIL.
073100     PERFORM PRINT-DETAIL.
073200     GO TO   DIV-TEST-F5-10-1.
073300 DIV-DELETE-F5-10.
073400     PERFORM DE-LETE.
073500     PERFORM PRINT-DETAIL.
073600     GO TO   DIV-INIT-F5-11.
073700 DIV-TEST-F5-10-1.
073800     MOVE   "DIV-TEST-F5-10-1" TO PAR-NAME.
073900     ADD     1 TO REC-CT.
074000     IF      25ANS NOT = 2
074100             MOVE    2 TO CORRECT-N
074200             MOVE    25ANS TO COMPUTED-N
074300             MOVE   "INVALID QUOTIENT" TO RE-MARK
074400             PERFORM FAIL
074500             PERFORM PRINT-DETAIL
074600     ELSE
074700             PERFORM PASS
074800             PERFORM PRINT-DETAIL.
074900 DIV-TEST-F5-10-2.
075000     MOVE   "DIV-TEST-F5-10-2" TO PAR-NAME.
075100     ADD     1 TO REC-CT.
075200     IF      25REM NOT = 20
075300             MOVE    25REM TO COMPUTED-N
075400             MOVE    20    TO CORRECT-N
075500             MOVE   "INVALID REMAINDER" TO RE-MARK
075600             PERFORM FAIL
075700             PERFORM PRINT-DETAIL
075800     ELSE
075900             PERFORM PASS
076000             PERFORM PRINT-DETAIL.
076100*
076200 DIV-INIT-F5-11.
076300     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
076400     MOVE   "DIV-TEST-F5-11-0"  TO PAR-NAME.
076500     MOVE    ZERO TO 25COUNT.
076600     MOVE    ZERO TO 25ANS.
076700     MOVE    ZERO TO 25REM.
076800     MOVE    1    TO REC-CT.
076900 DIV-TEST-F5-11-0.
077000     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
077100         NOT ON SIZE ERROR
077200             MOVE   "NOT ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
077300                  TO RE-MARK
077400             PERFORM FAIL
077500             PERFORM PRINT-DETAIL
077600             GO TO   DIV-TEST-F5-11-1.
077700     PERFORM PASS.
077800     PERFORM PRINT-DETAIL.
077900     GO TO   DIV-TEST-F5-11-1.
078000 DIV-DELETE-F5-11.
078100     PERFORM DE-LETE.
078200     PERFORM PRINT-DETAIL.
078300     GO TO   DIV-INIT-F5-12.
078400 DIV-TEST-F5-11-1.
078500     MOVE   "DIV-TEST-F5-11-1" TO PAR-NAME.
078600     ADD     1 TO REC-CT.
078700     IF      25ANS NOT = 0
078800             MOVE    0 TO CORRECT-N
078900             MOVE    25ANS TO COMPUTED-N
079000             MOVE   "INVALID QUOTIENT" TO RE-MARK
079100             PERFORM FAIL
079200             PERFORM PRINT-DETAIL
079300     ELSE
079400             PERFORM PASS
079500             PERFORM PRINT-DETAIL.
079600 DIV-TEST-F5-11-2.
079700     MOVE   "DIV-TEST-F5-11-2" TO PAR-NAME.
079800     ADD     1 TO REC-CT.
079900     IF      25REM NOT = ZERO
080000             MOVE    25REM TO COMPUTED-N
080100             MOVE    ZERO  TO CORRECT-N
080200             MOVE   "INVALID REMAINDER" TO RE-MARK
080300             PERFORM FAIL
080400             PERFORM PRINT-DETAIL
080500     ELSE
080600             PERFORM PASS
080700             PERFORM PRINT-DETAIL.
080800*
080900 DIV-INIT-F5-12.
081000     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
081100     MOVE   "DIV-TEST-F5-12-0" TO PAR-NAME.
081200     MOVE    40   TO 25COUNT.
081300     MOVE    ZERO TO 25ANS.
081400     MOVE    ZERO TO 25REM.
081500     MOVE    1    TO REC-CT.
081600 DIV-TEST-F5-12-0.
081700     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
081800             ON SIZE ERROR
081900             MOVE   "ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
082000                  TO RE-MARK
082100             PERFORM FAIL
082200             PERFORM PRINT-DETAIL
082300             GO TO   DIV-TEST-F5-12-1
082400         NOT ON SIZE ERROR
082500             PERFORM PASS
082600             PERFORM PRINT-DETAIL
082700             GO TO   DIV-TEST-F5-12-1.
082800 DIV-DELETE-F5-12.
082900     PERFORM DE-LETE.
083000     PERFORM PRINT-DETAIL.
083100     GO TO   DIV-INIT-F5-13.
083200 DIV-TEST-F5-12-1.
083300     MOVE   "DIV-TEST-F5-12-1" TO PAR-NAME.
083400     ADD     1 TO REC-CT.
083500     IF      25ANS NOT = 2
083600             MOVE    2 TO CORRECT-N
083700             MOVE    25ANS TO COMPUTED-N
083800             MOVE   "INVALID QUOTIENT" TO RE-MARK
083900             PERFORM FAIL
084000             PERFORM PRINT-DETAIL
084100     ELSE
084200             PERFORM PASS
084300             PERFORM PRINT-DETAIL.
084400 DIV-TEST-F5-12-2.
084500     MOVE   "DIV-TEST-F5-12-2" TO PAR-NAME.
084600     ADD     1 TO REC-CT.
084700     IF      25REM NOT = 20
084800             MOVE    25REM TO COMPUTED-N
084900             MOVE    20    TO CORRECT-N
085000             MOVE   "INVALID REMAINDER" TO RE-MARK
085100             PERFORM FAIL
085200             PERFORM PRINT-DETAIL
085300     ELSE
085400             PERFORM PASS
085500             PERFORM PRINT-DETAIL.
085600*
085700 DIV-INIT-F5-13.
085800     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
085900     MOVE   "DIV-TEST-F5-13-0"  TO PAR-NAME.
086000     MOVE    ZERO TO 25COUNT.
086100     MOVE    ZERO TO 25ANS.
086200     MOVE    ZERO TO 25REM.
086300     MOVE    1    TO REC-CT.
086400 DIV-TEST-F5-13-0.
086500     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
086600             ON SIZE ERROR
086700             PERFORM PASS
086800             PERFORM PRINT-DETAIL
086900             GO TO   DIV-TEST-F5-13-1
087000         NOT ON SIZE ERROR
087100             MOVE   "NOT ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
087200                  TO RE-MARK
087300             PERFORM FAIL
087400             PERFORM PRINT-DETAIL
087500             GO TO   DIV-TEST-F5-13-1.
087600 DIV-DELETE-F5-13.
087700     PERFORM DE-LETE.
087800     PERFORM PRINT-DETAIL.
087900     GO TO   DIV-INIT-F5-14.
088000 DIV-TEST-F5-13-1.
088100     MOVE   "DIV-TEST-F5-13-1" TO PAR-NAME.
088200     ADD     1 TO REC-CT.
088300     IF      25ANS NOT = 0
088400             MOVE    0 TO CORRECT-N
088500             MOVE    25ANS TO COMPUTED-N
088600             MOVE   "INVALID QUOTIENT" TO RE-MARK
088700             PERFORM FAIL
088800             PERFORM PRINT-DETAIL
088900     ELSE
089000             PERFORM PASS
089100             PERFORM PRINT-DETAIL.
089200 DIV-TEST-F5-13-2.
089300     MOVE   "DIV-TEST-F5-13-2" TO PAR-NAME.
089400     ADD     1 TO REC-CT.
089500     IF      25REM NOT = ZERO
089600             MOVE    25REM TO COMPUTED-N
089700             MOVE    ZERO  TO CORRECT-N
089800             MOVE   "INVALID REMAINDER" TO RE-MARK
089900             PERFORM FAIL
090000             PERFORM PRINT-DETAIL
090100     ELSE
090200             PERFORM PASS
090300             PERFORM PRINT-DETAIL.
090400*
090500 DIV-INIT-F5-14.
090600     MOVE   "VI-82 6.11.4 GR9" TO ANSI-REFERENCE.
090700     MOVE   "DIV-TEST-F5-14-0" TO PAR-NAME.
090800     MOVE    40    TO 25COUNT.
090900     MOVE    ZERO  TO 25ANS.
091000     MOVE    ZERO  TO 25REM.
091100     MOVE    1     TO REC-CT.
091200     MOVE    SPACE TO WRK-XN-00001-1.
091300     MOVE    SPACE TO WRK-XN-00001-2.
091400 DIV-TEST-F5-14-0.
091500     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
091600             ON SIZE ERROR
091700             MOVE   "A" TO WRK-XN-00001-1
091800     END-DIVIDE
091900     MOVE   "B" TO WRK-XN-00001-2.
092000     GO TO   DIV-TEST-F5-14-1.
092100 DIV-DELETE-F5-14.
092200     PERFORM DE-LETE.
092300     PERFORM PRINT-DETAIL.
092400     GO TO   DIV-INIT-F5-15.
092500 DIV-TEST-F5-14-1.
092600     MOVE   "DIV-TEST-F5-14-1" TO PAR-NAME.
092700     ADD     1 TO REC-CT.
092800     IF      25ANS NOT = 2
092900             MOVE    2 TO CORRECT-N
093000             MOVE    25ANS TO COMPUTED-N
093100             MOVE   "INVALID QUOTIENT" TO RE-MARK
093200             PERFORM FAIL
093300             PERFORM PRINT-DETAIL
093400     ELSE
093500             PERFORM PASS
093600             PERFORM PRINT-DETAIL.
093700 DIV-TEST-F5-14-2.
093800     MOVE   "DIV-TEST-F5-14-2" TO PAR-NAME.
093900     ADD     1 TO REC-CT.
094000     IF      25REM NOT = 20
094100             MOVE    25REM TO COMPUTED-N
094200             MOVE    20    TO CORRECT-N
094300             MOVE   "INVALID REMAINDER" TO RE-MARK
094400             PERFORM FAIL
094500             PERFORM PRINT-DETAIL
094600     ELSE
094700             PERFORM PASS
094800             PERFORM PRINT-DETAIL.
094900 DIV-TEST-F5-14-3.
095000     MOVE   "DIV-TEST-F5-14-3" TO PAR-NAME.
095100     ADD     1 TO REC-CT.
095200     IF      WRK-XN-00001-1 = SPACE
095300             PERFORM PASS
095400             PERFORM PRINT-DETAIL
095500     ELSE
095600             MOVE   "ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
095700                  TO RE-MARK
095800             MOVE    SPACE TO CORRECT-A
095900             MOVE    WRK-XN-00001-1 TO COMPUTED-A
096000             PERFORM FAIL
096100             PERFORM PRINT-DETAIL.
096200 DIV-TEST-F5-14-4.
096300     MOVE   "DIV-TEST-F5-14-4" TO PAR-NAME.
096400     ADD     1 TO REC-CT.
096500     IF      WRK-XN-00001-2 = "B"
096600             PERFORM PASS
096700             PERFORM PRINT-DETAIL
096800     ELSE
096900             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
097000             MOVE   "B" TO CORRECT-A
097100             MOVE    WRK-XN-00001-2 TO COMPUTED-A
097200             PERFORM FAIL
097300             PERFORM PRINT-DETAIL.
097400*
097500 DIV-INIT-F5-15.
097600     MOVE   "VI-82 6.11.4 GR9" TO ANSI-REFERENCE.
097700     MOVE   "DIV-TEST-F5-15-0"  TO PAR-NAME.
097800     MOVE    ZERO  TO 25COUNT.
097900     MOVE    ZERO  TO 25ANS.
098000     MOVE    ZERO  TO 25REM.
098100     MOVE    SPACE TO WRK-XN-00001-1.
098200     MOVE    SPACE TO WRK-XN-00001-2.
098300     MOVE    1     TO REC-CT.
098400 DIV-TEST-F5-15-0.
098500     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
098600             ON SIZE ERROR
098700             MOVE   "A" TO WRK-XN-00001-1
098800     END-DIVIDE
098900     MOVE   "B" TO WRK-XN-00001-2.
099000     GO TO   DIV-TEST-F5-15-1.
099100 DIV-DELETE-F5-15.
099200     PERFORM DE-LETE.
099300     PERFORM PRINT-DETAIL.
099400     GO TO   DIV-INIT-F5-16.
099500 DIV-TEST-F5-15-1.
099600     MOVE   "DIV-TEST-F5-15-1" TO PAR-NAME.
099700     ADD     1 TO REC-CT.
099800     IF      25ANS NOT = 0
099900             MOVE    0 TO CORRECT-N
100000             MOVE    25ANS TO COMPUTED-N
100100             MOVE   "INVALID QUOTIENT" TO RE-MARK
100200             PERFORM FAIL
100300             PERFORM PRINT-DETAIL
100400     ELSE
100500             PERFORM PASS
100600             PERFORM PRINT-DETAIL.
100700 DIV-TEST-F5-15-2.
100800     MOVE   "DIV-TEST-F5-15-2" TO PAR-NAME.
100900     ADD     1 TO REC-CT.
101000     IF      25REM NOT = ZERO
101100             MOVE    25REM TO COMPUTED-N
101200             MOVE    ZERO  TO CORRECT-N
101300             MOVE   "INVALID REMAINDER" TO RE-MARK
101400             PERFORM FAIL
101500             PERFORM PRINT-DETAIL
101600     ELSE
101700             PERFORM PASS
101800             PERFORM PRINT-DETAIL.
101900 DIV-TEST-F5-15-3.
102000     MOVE   "DIV-TEST-F5-15-3" TO PAR-NAME.
102100     ADD     1 TO REC-CT.
102200     IF      WRK-XN-00001-1 = "A"
102300             PERFORM PASS
102400             PERFORM PRINT-DETAIL
102500     ELSE
102600             MOVE   "ON SIZE ERROR SHOULD HAVE EXECUTED"
102700                  TO RE-MARK
102800             MOVE   "A" TO CORRECT-A
102900             MOVE    WRK-XN-00001-1 TO COMPUTED-A
103000             PERFORM FAIL
103100             PERFORM PRINT-DETAIL.
103200 DIV-TEST-F5-15-4.
103300     MOVE   "DIV-TEST-F5-15-4" TO PAR-NAME.
103400     ADD     1 TO REC-CT.
103500     IF      WRK-XN-00001-2 = "B"
103600             PERFORM PASS
103700             PERFORM PRINT-DETAIL
103800     ELSE
103900             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
104000             MOVE    SPACE TO CORRECT-A
104100             MOVE    WRK-XN-00001-1 TO COMPUTED-A
104200             PERFORM FAIL
104300             PERFORM PRINT-DETAIL.
104400*
104500 DIV-INIT-F5-16.
104600     MOVE   "VI-82 6.11.4 GR9" TO ANSI-REFERENCE.
104700     MOVE   "DIV-TEST-F5-16-0" TO PAR-NAME.
104800     MOVE    40    TO 25COUNT.
104900     MOVE    ZERO  TO 25ANS.
105000     MOVE    ZERO  TO 25REM.
105100     MOVE    1     TO REC-CT.
105200     MOVE    SPACE TO WRK-XN-00001-1.
105300     MOVE    SPACE TO WRK-XN-00001-2.
105400 DIV-TEST-F5-16-0.
105500     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
105600         NOT ON SIZE ERROR
105700             MOVE   "A" TO WRK-XN-00001-1
105800     END-DIVIDE
105900     MOVE   "B" TO WRK-XN-00001-2.
106000     GO TO   DIV-TEST-F5-16-1.
106100 DIV-DELETE-F5-16.
106200     PERFORM DE-LETE.
106300     PERFORM PRINT-DETAIL.
106400     GO TO   DIV-INIT-F5-17.
106500 DIV-TEST-F5-16-1.
106600     MOVE   "DIV-TEST-F5-16-1" TO PAR-NAME.
106700     ADD     1 TO REC-CT.
106800     IF      25ANS NOT = 2
106900             MOVE    2 TO CORRECT-N
107000             MOVE    25ANS TO COMPUTED-N
107100             MOVE   "INVALID QUOTIENT" TO RE-MARK
107200             PERFORM FAIL
107300             PERFORM PRINT-DETAIL
107400     ELSE
107500             PERFORM PASS
107600             PERFORM PRINT-DETAIL.
107700 DIV-TEST-F5-16-2.
107800     MOVE   "DIV-TEST-F5-16-2" TO PAR-NAME.
107900     ADD     1 TO REC-CT.
108000     IF      25REM NOT = 20
108100             MOVE    25REM TO COMPUTED-N
108200             MOVE    20    TO CORRECT-N
108300             MOVE   "INVALID REMAINDER" TO RE-MARK
108400             PERFORM FAIL
108500             PERFORM PRINT-DETAIL
108600     ELSE
108700             PERFORM PASS
108800             PERFORM PRINT-DETAIL.
108900 DIV-TEST-F5-16-3.
109000     MOVE   "DIV-TEST-F5-16-3" TO PAR-NAME.
109100     ADD     1 TO REC-CT.
109200     IF      WRK-XN-00001-1 = "A"
109300             PERFORM PASS
109400             PERFORM PRINT-DETAIL
109500     ELSE
109600             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
109700                  TO RE-MARK
109800             MOVE   "A" TO CORRECT-A
109900             MOVE    WRK-XN-00001-1 TO COMPUTED-A
110000             PERFORM FAIL
110100             PERFORM PRINT-DETAIL.
110200 DIV-TEST-F5-16-4.
110300     MOVE   "DIV-TEST-F5-16-4" TO PAR-NAME.
110400     ADD     1 TO REC-CT.
110500     IF      WRK-XN-00001-2 = "B"
110600             PERFORM PASS
110700             PERFORM PRINT-DETAIL
110800     ELSE
110900             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
111000             MOVE   "B" TO CORRECT-A
111100             MOVE    WRK-XN-00001-2 TO COMPUTED-A
111200             PERFORM FAIL
111300             PERFORM PRINT-DETAIL.
111400*
111500 DIV-INIT-F5-17.
111600     MOVE   "VI-82 6.11.4 GR9" TO ANSI-REFERENCE.
111700     MOVE   "DIV-TEST-F5-17-0"  TO PAR-NAME.
111800     MOVE    ZERO  TO 25COUNT.
111900     MOVE    ZERO  TO 25ANS.
112000     MOVE    ZERO  TO 25REM.
112100     MOVE    SPACE TO WRK-XN-00001-1.
112200     MOVE    SPACE TO WRK-XN-00001-2.
112300     MOVE    1     TO REC-CT.
112400 DIV-TEST-F5-17-0.
112500     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
112600         NOT ON SIZE ERROR
112700             MOVE   "A" TO WRK-XN-00001-1
112800     END-DIVIDE
112900     MOVE   "B" TO WRK-XN-00001-2.
113000     GO TO   DIV-TEST-F5-17-1.
113100 DIV-DELETE-F5-17.
113200     PERFORM DE-LETE.
113300     PERFORM PRINT-DETAIL.
113400     GO TO   DIV-INIT-F5-18.
113500 DIV-TEST-F5-17-1.
113600     MOVE   "DIV-TEST-F5-17-1" TO PAR-NAME.
113700     ADD     1 TO REC-CT.
113800     IF      25ANS NOT = 0
113900             MOVE    0 TO CORRECT-N
114000             MOVE    25ANS TO COMPUTED-N
114100             MOVE   "INVALID QUOTIENT" TO RE-MARK
114200             PERFORM FAIL
114300             PERFORM PRINT-DETAIL
114400     ELSE
114500             PERFORM PASS
114600             PERFORM PRINT-DETAIL.
114700 DIV-TEST-F5-17-2.
114800     MOVE   "DIV-TEST-F5-17-2" TO PAR-NAME.
114900     ADD     1 TO REC-CT.
115000     IF      25REM NOT = ZERO
115100             MOVE    25REM TO COMPUTED-N
115200             MOVE    ZERO  TO CORRECT-N
115300             MOVE   "INVALID REMAINDER" TO RE-MARK
115400             PERFORM FAIL
115500             PERFORM PRINT-DETAIL
115600     ELSE
115700             PERFORM PASS
115800             PERFORM PRINT-DETAIL.
115900 DIV-TEST-F5-17-3.
116000     MOVE   "DIV-TEST-F5-17-3" TO PAR-NAME.
116100     ADD     1 TO REC-CT.
116200     IF      WRK-XN-00001-1 = SPACE
116300             PERFORM PASS
116400             PERFORM PRINT-DETAIL
116500     ELSE
116600             MOVE   "NOT ON SIZE ERROR SHOULD NOT HAVE EXECUTED"
116700                  TO RE-MARK
116800             MOVE    SPACE TO CORRECT-A
116900             MOVE    WRK-XN-00001-1 TO COMPUTED-A
117000             PERFORM FAIL
117100             PERFORM PRINT-DETAIL.
117200 DIV-TEST-F5-17-4.
117300     MOVE   "DIV-TEST-F5-17-4" TO PAR-NAME.
117400     ADD     1 TO REC-CT.
117500     IF      WRK-XN-00001-2 = "B"
117600             PERFORM PASS
117700             PERFORM PRINT-DETAIL
117800     ELSE
117900             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
118000             MOVE   "B" TO CORRECT-A
118100             MOVE    WRK-XN-00001-2 TO COMPUTED-A
118200             PERFORM FAIL
118300             PERFORM PRINT-DETAIL.
118400*
118500 DIV-INIT-F5-18.
118600     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
118700     MOVE   "DIV-TEST-F5-18-0" TO PAR-NAME.
118800     MOVE    40   TO 25COUNT.
118900     MOVE    ZERO  TO 25ANS.
119000     MOVE    ZERO  TO 25REM.
119100     MOVE    1     TO REC-CT.
119200     MOVE    SPACE TO WRK-XN-00001-1.
119300     MOVE    SPACE TO WRK-XN-00001-2.
119400 DIV-TEST-F5-18-0.
119500     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
119600             ON SIZE ERROR
119700             MOVE   "A" TO WRK-XN-00001-1
119800         NOT ON SIZE ERROR
119900             MOVE   "B" TO WRK-XN-00001-1
120000     END-DIVIDE
120100     MOVE   "C" TO WRK-XN-00001-2.
120200     GO TO   DIV-TEST-F5-18-1.
120300 DIV-DELETE-F5-18.
120400     PERFORM DE-LETE.
120500     PERFORM PRINT-DETAIL.
120600     GO TO   DIV-INIT-F5-19.
120700 DIV-TEST-F5-18-1.
120800     MOVE   "DIV-TEST-F5-18-1" TO PAR-NAME.
120900     ADD     1 TO REC-CT.
121000     IF      25ANS NOT = 2
121100             MOVE    2 TO CORRECT-N
121200             MOVE    25ANS TO COMPUTED-N
121300             MOVE   "INVALID QUOTIENT" TO RE-MARK
121400             PERFORM FAIL
121500             PERFORM PRINT-DETAIL
121600     ELSE
121700             PERFORM PASS
121800             PERFORM PRINT-DETAIL.
121900 DIV-TEST-F5-18-2.
122000     MOVE   "DIV-TEST-F5-18-2" TO PAR-NAME.
122100     ADD     1 TO REC-CT.
122200     IF      25REM NOT = 20
122300             MOVE    25REM TO COMPUTED-N
122400             MOVE    20    TO CORRECT-N
122500             MOVE   "INVALID REMAINDER" TO RE-MARK
122600             PERFORM FAIL
122700             PERFORM PRINT-DETAIL
122800     ELSE
122900             PERFORM PASS
123000             PERFORM PRINT-DETAIL.
123100 DIV-TEST-F5-18-3.
123200     MOVE   "DIV-TEST-F5-18-3" TO PAR-NAME.
123300     ADD     1 TO REC-CT.
123400     IF      WRK-XN-00001-1 = "B"
123500             PERFORM PASS
123600             PERFORM PRINT-DETAIL
123700     ELSE
123800             MOVE   "NOT ON SIZE ERROR SHOULD HAVE EXECUTED"
123900                  TO RE-MARK
124000             MOVE   "B" TO CORRECT-A
124100             MOVE    WRK-XN-00001-1 TO COMPUTED-A
124200             PERFORM FAIL
124300             PERFORM PRINT-DETAIL.
124400 DIV-TEST-F5-18-4.
124500     MOVE   "DIV-TEST-F5-18-4" TO PAR-NAME.
124600     ADD     1 TO REC-CT.
124700     IF      WRK-XN-00001-2 = "C"
124800             PERFORM PASS
124900             PERFORM PRINT-DETAIL
125000     ELSE
125100             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
125200             MOVE   "C"    TO CORRECT-A
125300             MOVE    WRK-XN-00001-2 TO COMPUTED-A
125400             PERFORM FAIL
125500             PERFORM PRINT-DETAIL.
125600*
125700 DIV-INIT-F5-19.
125800     MOVE   "VI-82 6.11.4 GR8" TO ANSI-REFERENCE.
125900     MOVE   "DIV-TEST-F5-19-0"  TO PAR-NAME.
126000     MOVE    ZERO  TO 25COUNT.
126100     MOVE    ZERO  TO 25ANS.
126200     MOVE    ZERO  TO 25REM.
126300     MOVE    1     TO REC-CT.
126400     MOVE    SPACE TO WRK-XN-00001-1.
126500     MOVE    SPACE TO WRK-XN-00001-2.
126600 DIV-TEST-F5-19-0.
126700     DIVIDE  100 BY 25COUNT GIVING 25ANS REMAINDER 25REM
126800             ON SIZE ERROR
126900             MOVE   "A" TO WRK-XN-00001-1
127000         NOT ON SIZE ERROR
127100             MOVE   "B" TO WRK-XN-00001-1
127200     END-DIVIDE
127300     MOVE   "C" TO WRK-XN-00001-2.
127400     GO TO   DIV-TEST-F5-19-1.
127500 DIV-DELETE-F5-19.
127600     PERFORM DE-LETE.
127700     PERFORM PRINT-DETAIL.
127800     GO TO   DIV-INIT-F5-20.
127900 DIV-TEST-F5-19-1.
128000     MOVE   "DIV-TEST-F5-19-1" TO PAR-NAME.
128100     ADD     1 TO REC-CT.
128200     IF      25ANS NOT = 0
128300             MOVE    0 TO CORRECT-N
128400             MOVE    25ANS TO COMPUTED-N
128500             MOVE   "INVALID QUOTIENT" TO RE-MARK
128600             PERFORM FAIL
128700             PERFORM PRINT-DETAIL
128800     ELSE
128900             PERFORM PASS
129000             PERFORM PRINT-DETAIL.
129100 DIV-TEST-F5-19-2.
129200     MOVE   "DIV-TEST-F5-19-2" TO PAR-NAME.
129300     ADD     1 TO REC-CT.
129400     IF      25REM NOT = ZERO
129500             MOVE    25REM TO COMPUTED-N
129600             MOVE    ZERO  TO CORRECT-N
129700             MOVE   "INVALID REMAINDER" TO RE-MARK
129800             PERFORM FAIL
129900             PERFORM PRINT-DETAIL
130000     ELSE
130100             PERFORM PASS
130200             PERFORM PRINT-DETAIL.
130300 DIV-TEST-F5-19-3.
130400     MOVE   "DIV-TEST-F5-19-3" TO PAR-NAME.
130500     ADD     1 TO REC-CT.
130600     IF      WRK-XN-00001-1 = "A"
130700             PERFORM PASS
130800             PERFORM PRINT-DETAIL
130900     ELSE
131000             MOVE   "ON SIZE ERROR SHOULD HAVE EXECUTED"
131100                  TO RE-MARK
131200             MOVE   "A" TO CORRECT-A
131300             MOVE    WRK-XN-00001-1 TO COMPUTED-A
131400             PERFORM FAIL
131500             PERFORM PRINT-DETAIL.
131600 DIV-TEST-F5-19-4.
131700     MOVE   "DIV-TEST-F5-19-4" TO PAR-NAME.
131800     ADD     1 TO REC-CT.
131900     IF      WRK-XN-00001-2 = "C"
132000             PERFORM PASS
132100             PERFORM PRINT-DETAIL
132200     ELSE
132300             MOVE   "SCOPE TERMINATOR IGNORED" TO RE-MARK
132400             MOVE   "C"    TO CORRECT-A
132500             MOVE    WRK-XN-00001-2 TO COMPUTED-A
132600             PERFORM FAIL
132700             PERFORM PRINT-DETAIL.
132800*
132900 DIV-INIT-F5-20.
133000     MOVE   "VI-82 6.11.4 GR4" TO ANSI-REFERENCE.
133100     MOVE   "DIV-TEST-F5-20-0"  TO PAR-NAME.
133200     MOVE ZERO TO 25ANS.
133300     MOVE ZERO TO 25REM.
133400     MOVE ZERO TO WS-REMAINDERS.
133500     MOVE 6    TO 25COUNT.
133600     MOVE 1    TO REC-CT.
133700 DIV-TEST-F5-20-0.
133800     DIVIDE  100 BY 25COUNT GIVING 25ANS
133900             REMAINDER WS-REM (25ANS)
134000             ON SIZE ERROR
134100             MOVE   "SIZE ERROR SHOULD NOT HAVE OCCURED"
134200                  TO RE-MARK
134300             PERFORM FAIL
134400             PERFORM PRINT-DETAIL
134500             GO TO   DIV-TEST-F5-20-1.
134600     PERFORM PASS.
134700     PERFORM PRINT-DETAIL.
134800     GO TO   DIV-TEST-F5-20-1.
134900 DIV-DELETE-F5-20.
135000     PERFORM DE-LETE.
135100     PERFORM PRINT-DETAIL.
135200     GO TO   CCVS-EXIT.
135300 DIV-TEST-F5-20-1.
135400     MOVE   "DIV-TEST-F5-20-1" TO PAR-NAME.
135500     ADD     1 TO REC-CT.
135600     IF      25ANS NOT = 16
135700             MOVE    16 TO CORRECT-N
135800             MOVE    25ANS TO COMPUTED-N
135900             MOVE   "INVALID QUOTIENT" TO RE-MARK
136000             PERFORM FAIL
136100             PERFORM PRINT-DETAIL
136200     ELSE
136300             PERFORM PASS
136400             PERFORM PRINT-DETAIL.
136500 DIV-TEST-F5-20-2.
136600     MOVE   "DIV-TEST-F5-20-2" TO PAR-NAME.
136700     ADD     1 TO REC-CT.
136800     IF      WS-REM (25ANS) NOT = 4
136900             MOVE    WS-REM (25ANS) TO COMPUTED-N
137000             MOVE    4     TO CORRECT-N
137100             MOVE   "INVALID REMAINDER" TO RE-MARK
137200             PERFORM FAIL
137300             PERFORM PRINT-DETAIL
137400             ADD     1 TO REC-CT
137500             MOVE    25ANS TO COMPUTED-N
137600             MOVE    16    TO CORRECT-N
137700             MOVE   "INVALID SUBSCRIPT FOR REMAINDER" TO RE-MARK
137800             PERFORM FAIL
137900             PERFORM PRINT-DETAIL
138000     ELSE
138100             PERFORM PASS
138200             PERFORM PRINT-DETAIL.
138300*
138400 DIV-INIT-F5-21.
138500     MOVE "DIV-TEST-F5-21" TO PAR-NAME.
138600     MOVE 10.0 TO WRK-DU-2V1-1.
138700     MOVE    ZERO TO REC-CT.
138800 DIVIDE-REMAINDER-TEST-7.
138900     DIVIDE WRK-DU-1V17-1 BY WRK-DU-2V1-1 GIVING WRK-DU-1V5-1
139000     REMAINDER WRK-NE-1 ON SIZE ERROR GO TO DIV-FAIL-F5-21.
139100     GO TO DIV-TEST-F5-21-1.
139200 DIV-DELETE-F5-21.
139300     PERFORM DE-LETE.
139400     PERFORM PRINT-DETAIL.
139500     GO TO CCVS-EXIT.
139600 DIV-FAIL-F5-21.
139700     PERFORM FAIL.
139800     MOVE "SIZE ERROR BAD" TO RE-MARK.
139900     PERFORM PRINT-DETAIL.
140000 DIV-TEST-F5-21-1.
140100     MOVE "DIV-TEST-F5-21-1" TO ANSI-REFERENCE.
140200     MOVE 1 TO REC-CT.
140300     IF WRK-DU-1V5-1 = 0.31415 PERFORM PASS PERFORM PRINT-DETAIL
140400     ELSE
140500     PERFORM FAIL MOVE WRK-DU-1V5-1 TO COMPUTED-N MOVE 0.31415
140600     TO CORRECT-N PERFORM PRINT-DETAIL.
140700     ADD 1 TO REC-CT.
140800 DIV-TEST-F5-21-2.
140900     MOVE "DIV-TEST-F5-21-2" TO ANSI-REFERENCE.
141000     IF WRK-NE-1 = ".0000/92653,58979,32"  PERFORM PASS
141100     PERFORM PRINT-DETAIL ELSE
141200     PERFORM FAIL MOVE WRK-NE-1 TO COMPUTED-A MOVE
141300     ".0000/92653,58979,32"  TO CORRECT-A PERFORM PRINT-DETAIL.
141400*
141500 CCVS-EXIT SECTION.
141600 CCVS-999999.
141700     GO TO CLOSE-FILES.
