000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     NC252A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    THIS PROGRAM TESTS THE "REDEFINES" AND "RENAMES" CLAUSES. *
002300*                                                              *
002400****************************************************************
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.
002800     XXXXX082.
002900 OBJECT-COMPUTER.
003000     XXXXX083.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300     SELECT PRINT-FILE ASSIGN TO
003400     XXXXX055.
003500 DATA DIVISION.
003600 FILE SECTION.
003700 FD  PRINT-FILE.
003800 01  PRINT-REC PICTURE X(120).
003900 01  DUMMY-RECORD PICTURE X(120).
004000 WORKING-STORAGE SECTION.
004100 01  WS-REMAINDERS.
004200   03  WS-REM                    PIC 99 OCCURS 20.
004300 01  WRK-XN-00001-1              PIC X.
004400 01  WRK-XN-00001-2              PIC X.
004500 01  WS-46.
004600   03  WS-1-20                   PIC X(20).
004700   03  WS-21-40                  PIC X(20).
004800   03  WS-41-46                  PIC X(6).
004900 77  11A                PICTURE 9999  VALUE 9.
005000 77  11B   PICTURE 99; VALUE 8.
005100 77  1111C PICTURE 99 VALUE 9.
005200 77  WRK-DS-02V00                 PICTURE S99.
005300     88 TEST-2NUC-COND-99         VALUE 99.
005400 77  A99-DS-02V00                 PICTURE S99    VALUE 99.
005500 77  WRK-DS-18V00                 PICTURE S9(18).
005600 77  A18ONES-DS-18V00             PICTURE S9(18)
005700                                  VALUE 111111111111111111.
005800 77  A18TWOS-DS-18V00             PICTURE S9(18)
005900                                  VALUE 222222222222222222.
006000 77  WRK-DS-05V00                 PICTURE S9(5).
006100 77  A02TWOS-DU-02V00             PICTURE 99     VALUE 22.
006200 77  A02TWOS-DS-03V02             PICTURE S999V99 VALUE +022.00.
006300 77  ATWO-DS-01V00                PICTURE S9     VALUE 2.
006400 77  AZERO-DS-05V05               PICTURE S9(5)V9(5) VALUE ZERO.
006500 77  WRK-DS-06V06                 PICTURE S9(6)V9(6).
006600 77  WRK-DS-0201P                 PICTURE S99P.
006700 77  A05ONES-DS-05V00             PICTURE S9(5)  VALUE 11111.
006800 77  WRK-DS-09V00                 PICTURE S9(9).
006900 77  WRK-DS-09V09                 PICTURE S9(9)V9(9).
007000 77  WRK-DS-18V00-S REDEFINES WRK-DS-09V09
007100                                  PICTURE S9(18).
007200 77  XRAY                    PICTURE IS X.
007300 77  W-1                     PICTURE IS 9.
007400 77  W-2                     PICTURE IS 99.
007500 77  W-3                     PICTURE IS 999.
007600 77  W-5                PICTURE 99  VALUE ZERO.
007700 77  W-9                     PICTURE 999.
007800 77  W-11               PICTURE S99V9.
007900 77  D-1                PICTURE S9V99  VALUE 1.06.
008000 77  D-7                PICTURE S99V99  VALUE 1.09.
008100 77  ONE                     PICTURE IS 9      VALUE IS 1.
008200 77  TWO                     PICTURE IS S9     VALUE IS 2.
008300 77  THREE                   PICTURE IS S9     VALUE IS 3.
008400 77  FOUR                    PICTURE IS S9     VALUE IS 4.
008500 77  FIVE                    PICTURE IS S9     VALUE IS 5.
008600 77  SIX                     PICTURE IS S9     VALUE IS 6.
008700 77  SEVEN                   PICTURE IS S9     VALUE IS 7.
008800 77  EIGHT                   PICTURE IS 9      VALUE IS 8.
008900 77  NINE                    PICTURE IS S9     VALUE IS 9.
009000 77  TEN                     PICTURE IS S99    VALUE IS 10.
009100 77  FIFTEEN                 PICTURE IS S99    VALUE IS 15.
009200 77  TWENTY                  PICTURE IS S99    VALUE IS 20.
009300 77  TWENTY-5                PICTURE IS S99    VALUE IS 25.
009400    1 COMPUTE-DATA.
009500                                                                02
009600     COMPUTE-1                    PICTURE 999V9999  VALUE ZERO.
009700     2 COMPUTE-1A            PICTURE 9(3)V9(4) VALUE 654.1873.
009800     2 COMPUTE-2             PICTURE 9999V9    VALUE ZERO.
009900     02 COMPUTE-3            PICTURE 999V99    VALUE ZERO.
010000     2 COMPUTE-3A            PICTURE 999V99    VALUE 86.14.
010100     2 COMPUTE-3B            PICTURE 999V99    VALUE 33.75.
010200     2 COMPUTE-4             PICTURE 999       VALUE ZERO.
010300     2 COMPUTE-4A            PICTURE 999       VALUE 124.
010400     2 COMPUTE-4B            PICTURE 999       VALUE 217.
010500     2 COMPUTE-5             PICTURE 9999V99   VALUE ZERO.
010600     02 COMPUTE-5A           PICTURE 999V9     VALUE 11.1.
010700     2 COMPUTE-6             PICTURE 999V9     VALUE ZERO.
010800     2 COMPUTE-6A            PICTURE 999V9     VALUE 374.4.
010900     2 COMPUTE-7             PICTURE 999       VALUE ZERO.
011000     2 COMPUTE-8             PICTURE 999       VALUE ZERO.
011100     02 COMPUTE-9            PICTURE 9999      VALUE ZERO.
011200     2 COMPUTE-10            PICTURE 999V9999  VALUE ZERO.
011300     2 COMPUTE-11            PICTURE 999V9     VALUE ZERO.
011400     2 COMPUTE-11A           PICTURE 999V9     VALUE 371.2.
011500     2 COMPUTE-11B           PICTURE 999V9     VALUE 468.9.
011600     2 COMPUTE-12            PICTURE 99V99     VALUE ZERO.
011700     2 COMPUTE-12A           PICTURE 999V9     VALUE 336.4.
011800     2 COMPUTE-12B           PICTURE 999V9     VALUE 281.7.
011900 01  RENAMES-DATA.
012000     02  NAME1.
012100         03 NAME1A PICTURE XX VALUE SPACE.
012200         03 NAME1B PICTURE XXX VALUE SPACE.
012300     02  NAME2 PICTURE X(10) VALUE SPACE.
012400     02  NAME3.
012500         09 NAME3A PICTURE XXX VALUE SPACE.
012600         09 NAME3B PICTURE XX VALUE SPACE.
012700 66  RENAME1 RENAMES NAME1 THRU NAME3.
012800 66  RENAME2 RENAMES NAME1A THRU NAME1B.
012900 66  RENAME3 RENAMES NAME2.
013000 66  RENAME4 RENAMES NAME1.
013100 01  GRP-FOR-RENAMES.
013200     03  SUB-GRP-FOR-RENAMES-1.
013300     05  ELEM-FOR-RENAMES-1      PICTURE X    VALUE "X".
013400     05  FILLER                  PICTURE XX   VALUE SPACE.
013500     03  SUB-GRP-FOR-RENAMES-2.
013600     49  ELEM-FOR-RENAMES-2      PICTURE 999  VALUE 123.
013700     49  FILLER                  PICTURE 9    VALUE ZERO.
013800     49  ELEM-FOR-RENAMES-3      PICTURE XXXX VALUE ZERO.
013900     66  RENAMES-TEST-1 RENAMES ELEM-FOR-RENAMES-2.
014000     66  RENAMES-TEST-2 RENAMES SUB-GRP-FOR-RENAMES-1
014100         OF GRP-FOR-RENAMES.
014200     66  RENAMES-TEST-3 RENAMES SUB-GRP-FOR-RENAMES-1
014300         THRU ELEM-FOR-RENAMES-2.
014400     66  RENAMES-TEST-4 RENAMES ELEM-FOR-RENAMES-1
014500         THRU ELEM-FOR-RENAMES-2 IN GRP-FOR-RENAMES.
014600 01  T-RENAMES-DATA.
014700     02 TAG-1.
014800        03 TAG-1A       PICTURE XXXX.
014900         03 TAG-1B      PICTURE XXXXXX.
015000     02 NAME-2          PICTURE XXXXXXX.
015100 66  RENAME-5 RENAMES TAG-1A THRU TAG-1B.
015200 66  RENAME-6 RENAMES TAG-1A THRU NAME-2 OF T-RENAMES-DATA.
015300 01  U-RENAMES-DATA.
015400     02 UNIT-1.
015500         03 UNIT-1A     PICTURE XXXXXXX VALUE "VERMONT".
015600         03 UNIT-1B     PICTURE XXXX    VALUE "OHIO".
015700     02 NAME-2          PICTURE XXXXX   VALUE "MAINE".
015800 66  RENAME-5 RENAMES UNIT-1A THROUGH UNIT-1B.
015900 66  RENAME-6 RENAMES UNIT-1A THRU NAME-2 OF U-RENAMES-DATA.
016000 01  V-RENAMES-DATA.
016100     02 ITEM-1          PICTURE X(5).
016200     02 TABLE-2.
016300         03 TABLE-ITEM-2 PICTURE XXX OCCURS 5 TIMES.
016400 66  RENAME-7 RENAMES ITEM-1 THRU TABLE-2.
016500 01  W-RENAMES-DATA.
016600     02 WIDGET-1        PICTURE 99V9.
016700     02 WIDGET-2        PICTURE ***,***.**.
016800     02 WIDGET-3        PICTURE XXXX.
016900     02 WIDGET-4        PICTURE 9(4).
017000     02 WIDGET-5        PICTURE 9(4).
017100 66  RENAME-8  RENAMES WIDGET-1 THRU WIDGET-3.
017200 66  RENAME-9  RENAMES WIDGET-3 THRU WIDGET-5.
017300 66  RENAME-10 RENAMES WIDGET-4 THRU WIDGET-5.
017400 66  RENAME-11 RENAMES WIDGET-2.
017500 66  RENAME-12 RENAMES WIDGET-4.
017600 01  REDEF10.
017700     02  RDFDATA1                PICTURE X(10) VALUE "ABC98765DE".
017800     02  RDFDATA2                PICTURE 9(4)V99 VALUE 9116.44.
017900     02  RDFDATA3.
018000         08  RDFDATA4            PICTURE X(6)  VALUE "ALLDON".
018100         08  RDFDATA5            PICTURE XX99  VALUE "XX66".
018200     02  RDF3 REDEFINES RDFDATA3.
018300         03  RDF3-4              PICTURE X(8).
018400         03  RDF3-5              PIC 99.
018500         03  RDF3-5-1 REDEFINES RDF3-5.
018600             04  RDF3-5-14  PIC 9.
018700             04  RDF3-5-15  PIC 9.
018800                 88  HARD  VALUE 0.
018900                 88 SOFT  VALUE 1.
019000     02  RDFDATA6                PICTURE A(20) VALUE
019100     "ZYXWVUTSRQPONMLKJIHG".
019200     66  RDF3-5-16 RENAMES RDF3-5.
019300 01  REDEF11 REDEFINES REDEF10.
019400     02  RDFDATA7                PICTURE X(20).
019500     02  RDF8.
019600         03   RDFDATA8 OCCURS 36 TIMES PICTURE XX.
019700     02  RDEF8 REDEFINES RDF8.
019800         03  RDF8-1              PICTURE X(50).
019900         03  RDF8-2              PIC X(9).
020000         03  RDF8-3 REDEFINES RDF8-2.
020100             04  RDF8-4          PIC X(5).
020200             04  RDF8-5          PICTURE XX.
020300             04  RDF8-6  PIC XX.
020400         03  RDF8-8              PIC X(13).
020500     66  RDF8-7 RENAMES RDF8-5 THRU RDF8-6.
020600 01  REDEF12 REDEFINES REDEF10.
020700     02  RDFDATA9                PICTURE A(3).
020800     02  RDFDATA10     PIC 9(5).
020900     02  RDFDATA11.
021000         03  RDFDATA12.
021100             04  RDFDATA13       PICTURE XX.
021200             04  RDFDATA14 OCCURS 6 TIMES PICTURE 9.
021300         03  RDFDATA15           PICTURE X(8).
021400     02  RDFDATA16               PICTURE 99.
021500     02  RDFDATA17               PICTURE X(80).
021600     02  RDFDATA18               PICTURE X(14).
021700 01  GRP-REDEF125   REDEFINES REDEF10.
021800     02 AN0020-X-0001             PIC X(26).
021900     02 AN0002-O036F-X-0002       PIC XX  OCCURS 36 TIMES.
022000 01  WRK-DU-05V00-0001            PIC 9(5).
022100 01  WRK-DS-05V00-0002            PIC S9(5).
022200 01  WRK-CS-05V00-0003            PIC S9(5) COMP.
022300 01  WRK-DU-04V02-0004            PIC 9(4)V9(2).
022400 01  WRK-DS-04V01-0005            PIC S9(4)V9.
022500 01  NE-0008                      PIC $9(4).99-.
022600 01  NE-0009                      PIC ***99.
022700 01  NE-04V01-0006     PIC ****.9.
022800 01  GRP-0010.
022900     02 WRK-DU-03V00-L-0011       PIC 9(03) SYNC LEFT.
023000     02 WRK-O005F-0012        OCCURS   5  TIMES.
023100        03 WRK-O003F-0013     OCCURS   3  TIMES.
023200           05 WRK-DS-03V04-0003F-0014 PIC S9(3)V9999
023300                                            OCCURS 3 TIMES.
023400 01  DS-02V00-0001                PIC S99  VALUE  16.
023500 01  DS-03V00-0002                PIC S999 VALUE  174.
023600 01  CS-05V00-0003                PIC S9(5) COMP  VALUE 10.
023700 01    TA--X           PIC 9(5)  COMP VALUE ZERO.
023800 01  REDEF13.
023900     02  FILLER                  PICTURE X(57)   VALUE
024000     "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA".
024100     02  FILLER                  PICTURE X(57)   VALUE
024200     "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA".
024300     02  FILLER                  PICTURE X(6)    VALUE "AAAAAA".
024400 01  MINUS-NAMES.
024500     02  WHOLE-FIELD              PICTURE S9(18).
024600     02  PLUS-NAME1  PICTURE S9(18) VALUE +333333333333333333.
024700     02  EVEN-NAME1  PICTURE S9(18) VALUE +1.
024800     02  PLUS-NAME2  PICTURE S9(18) VALUE +999999999999999999.
024900     02  ALPHA-LIT                PICTURE X(5)  VALUE SPACE.
025000     02  SNEG-LIT2                PICTURE S9(5)  VALUE -70718.
025100 01  TEST-RESULTS.
025200     02 FILLER                   PIC X      VALUE SPACE.
025300     02 FEATURE                  PIC X(20)  VALUE SPACE.
025400     02 FILLER                   PIC X      VALUE SPACE.
025500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
025600     02 FILLER                   PIC X      VALUE SPACE.
025700     02  PAR-NAME.
025800       03 FILLER                 PIC X(19)  VALUE SPACE.
025900       03  PARDOT-X              PIC X      VALUE SPACE.
026000       03 DOTVALUE               PIC 99     VALUE ZERO.
026100     02 FILLER                   PIC X(8)   VALUE SPACE.
026200     02 RE-MARK                  PIC X(61).
026300 01  TEST-COMPUTED.
026400     02 FILLER                   PIC X(30)  VALUE SPACE.
026500     02 FILLER                   PIC X(17)  VALUE
026600            "       COMPUTED=".
026700     02 COMPUTED-X.
026800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
026900     03 COMPUTED-N               REDEFINES COMPUTED-A
027000                                 PIC -9(9).9(9).
027100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
027200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
027300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
027400     03       CM-18V0 REDEFINES COMPUTED-A.
027500         04 COMPUTED-18V0                    PIC -9(18).
027600         04 FILLER                           PIC X.
027700     03 FILLER PIC X(50) VALUE SPACE.
027800 01  TEST-CORRECT.
027900     02 FILLER PIC X(30) VALUE SPACE.
028000     02 FILLER PIC X(17) VALUE "       CORRECT =".
028100     02 CORRECT-X.
028200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
028300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
028400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
028500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
028600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
028700     03      CR-18V0 REDEFINES CORRECT-A.
028800         04 CORRECT-18V0                     PIC -9(18).
028900         04 FILLER                           PIC X.
029000     03 FILLER PIC X(2) VALUE SPACE.
029100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
029200 01  CCVS-C-1.
029300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
029400-    "SS  PARAGRAPH-NAME
029500-    "       REMARKS".
029600     02 FILLER                     PIC X(20)    VALUE SPACE.
029700 01  CCVS-C-2.
029800     02 FILLER                     PIC X        VALUE SPACE.
029900     02 FILLER                     PIC X(6)     VALUE "TESTED".
030000     02 FILLER                     PIC X(15)    VALUE SPACE.
030100     02 FILLER                     PIC X(4)     VALUE "FAIL".
030200     02 FILLER                     PIC X(94)    VALUE SPACE.
030300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
030400 01  REC-CT                        PIC 99       VALUE ZERO.
030500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
030600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
030700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
030800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
030900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
031000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
031100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
031200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
031300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
031400 01  CCVS-H-1.
031500     02  FILLER                    PIC X(39)    VALUE SPACES.
031600     02  FILLER                    PIC X(42)    VALUE
031700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
031800     02  FILLER                    PIC X(39)    VALUE SPACES.
031900 01  CCVS-H-2A.
032000   02  FILLER                        PIC X(40)  VALUE SPACE.
032100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
032200   02  FILLER                        PIC XXXX   VALUE
032300     "4.2 ".
032400   02  FILLER                        PIC X(28)  VALUE
032500            " COPY - NOT FOR DISTRIBUTION".
032600   02  FILLER                        PIC X(41)  VALUE SPACE.
032700
032800 01  CCVS-H-2B.
032900   02  FILLER                        PIC X(15)  VALUE
033000            "TEST RESULT OF ".
033100   02  TEST-ID                       PIC X(9).
033200   02  FILLER                        PIC X(4)   VALUE
033300            " IN ".
033400   02  FILLER                        PIC X(12)  VALUE
033500     " HIGH       ".
033600   02  FILLER                        PIC X(22)  VALUE
033700            " LEVEL VALIDATION FOR ".
033800   02  FILLER                        PIC X(58)  VALUE
033900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
034000 01  CCVS-H-3.
034100     02  FILLER                      PIC X(34)  VALUE
034200            " FOR OFFICIAL USE ONLY    ".
034300     02  FILLER                      PIC X(58)  VALUE
034400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
034500     02  FILLER                      PIC X(28)  VALUE
034600            "  COPYRIGHT   1985 ".
034700 01  CCVS-E-1.
034800     02 FILLER                       PIC X(52)  VALUE SPACE.
034900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
035000     02 ID-AGAIN                     PIC X(9).
035100     02 FILLER                       PIC X(45)  VALUE SPACES.
035200 01  CCVS-E-2.
035300     02  FILLER                      PIC X(31)  VALUE SPACE.
035400     02  FILLER                      PIC X(21)  VALUE SPACE.
035500     02 CCVS-E-2-2.
035600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
035700         03 FILLER                   PIC X      VALUE SPACE.
035800         03 ENDER-DESC               PIC X(44)  VALUE
035900            "ERRORS ENCOUNTERED".
036000 01  CCVS-E-3.
036100     02  FILLER                      PIC X(22)  VALUE
036200            " FOR OFFICIAL USE ONLY".
036300     02  FILLER                      PIC X(12)  VALUE SPACE.
036400     02  FILLER                      PIC X(58)  VALUE
036500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
036600     02  FILLER                      PIC X(13)  VALUE SPACE.
036700     02 FILLER                       PIC X(15)  VALUE
036800             " COPYRIGHT 1985".
036900 01  CCVS-E-4.
037000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
037100     02 FILLER                       PIC X(4)   VALUE " OF ".
037200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
037300     02 FILLER                       PIC X(40)  VALUE
037400      "  TESTS WERE EXECUTED SUCCESSFULLY".
037500 01  XXINFO.
037600     02 FILLER                       PIC X(19)  VALUE
037700            "*** INFORMATION ***".
037800     02 INFO-TEXT.
037900       04 FILLER                     PIC X(8)   VALUE SPACE.
038000       04 XXCOMPUTED                 PIC X(20).
038100       04 FILLER                     PIC X(5)   VALUE SPACE.
038200       04 XXCORRECT                  PIC X(20).
038300     02 INF-ANSI-REFERENCE           PIC X(48).
038400 01  HYPHEN-LINE.
038500     02 FILLER  PIC IS X VALUE IS SPACE.
038600     02 FILLER  PIC IS X(65)    VALUE IS "************************
038700-    "*****************************************".
038800     02 FILLER  PIC IS X(54)    VALUE IS "************************
038900-    "******************************".
039000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
039100     "NC252A".
039200 PROCEDURE DIVISION.
039300 CCVS1 SECTION.
039400 OPEN-FILES.
039500     OPEN     OUTPUT PRINT-FILE.
039600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
039700     MOVE    SPACE TO TEST-RESULTS.
039800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
039900     GO TO CCVS1-EXIT.
040000 CLOSE-FILES.
040100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
040200 TERMINATE-CCVS.
040300     STOP     RUN.
040400 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
040500 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
040600 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
040700 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
040800     MOVE "****TEST DELETED****" TO RE-MARK.
040900 PRINT-DETAIL.
041000     IF REC-CT NOT EQUAL TO ZERO
041100             MOVE "." TO PARDOT-X
041200             MOVE REC-CT TO DOTVALUE.
041300     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
041400     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
041500        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
041600          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
041700     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
041800     MOVE SPACE TO CORRECT-X.
041900     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
042000     MOVE     SPACE TO RE-MARK.
042100 HEAD-ROUTINE.
042200     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042300     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042400     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
042500     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
042600 COLUMN-NAMES-ROUTINE.
042700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
042800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
043000 END-ROUTINE.
043100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
043200 END-RTN-EXIT.
043300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043400 END-ROUTINE-1.
043500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
043600      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
043700      ADD PASS-COUNTER TO ERROR-HOLD.
043800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
043900      MOVE PASS-COUNTER TO CCVS-E-4-1.
044000      MOVE ERROR-HOLD TO CCVS-E-4-2.
044100      MOVE CCVS-E-4 TO CCVS-E-2-2.
044200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
044300  END-ROUTINE-12.
044400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
044500     IF       ERROR-COUNTER IS EQUAL TO ZERO
044600         MOVE "NO " TO ERROR-TOTAL
044700         ELSE
044800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
044900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
045000     PERFORM WRITE-LINE.
045100 END-ROUTINE-13.
045200     IF DELETE-COUNTER IS EQUAL TO ZERO
045300         MOVE "NO " TO ERROR-TOTAL  ELSE
045400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
045500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
045600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
045700      IF   INSPECT-COUNTER EQUAL TO ZERO
045800          MOVE "NO " TO ERROR-TOTAL
045900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
046000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
046100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046300 WRITE-LINE.
046400     ADD 1 TO RECORD-COUNT.
046500Y    IF RECORD-COUNT GREATER 50
046600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
046700Y        MOVE SPACE TO DUMMY-RECORD
046800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
046900Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
047000Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
047100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
047200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
047300Y        MOVE ZERO TO RECORD-COUNT.
047400     PERFORM WRT-LN.
047500 WRT-LN.
047600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
047700     MOVE SPACE TO DUMMY-RECORD.
047800 BLANK-LINE-PRINT.
047900     PERFORM WRT-LN.
048000 FAIL-ROUTINE.
048100     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
048200     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
048300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
048400     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
048500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
048600     MOVE   SPACES TO INF-ANSI-REFERENCE.
048700     GO TO  FAIL-ROUTINE-EX.
048800 FAIL-ROUTINE-WRITE.
048900     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
049000     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
049100     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
049200     MOVE   SPACES TO COR-ANSI-REFERENCE.
049300 FAIL-ROUTINE-EX. EXIT.
049400 BAIL-OUT.
049500     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
049600     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
049700 BAIL-OUT-WRITE.
049800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
049900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
050000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050100     MOVE   SPACES TO INF-ANSI-REFERENCE.
050200 BAIL-OUT-EX. EXIT.
050300 CCVS1-EXIT.
050400     EXIT.
050500 SECT-NC252A-001 SECTION.
050600 RDF-INIT.
050700     MOVE "REDEFINES " TO FEATURE.
050800 RDF-TEST-1.
050900     IF HARD
051000         MOVE RDF3-5-15 TO COMPUTED-A
051100         MOVE 6 TO CORRECT-A
051200         PERFORM FAIL
051300         GO TO RDF-WRITE-1.
051400*    NOTE 88 LEVEL CONDITION TEST ON REDEFINED FIELD.
051500     PERFORM PASS.
051600     GO TO RDF-WRITE-1.
051700 RDF-DELETE-1.
051800     PERFORM DE-LETE.
051900 RDF-WRITE-1.
052000     MOVE "RDF-TEST-1 " TO PAR-NAME.
052100     PERFORM PRINT-DETAIL.
052200 RDF-TEST-2.
052300     IF RDF3-5-16 EQUAL TO 66
052400         PERFORM PASS
052500         GO TO RDF-WRITE-2.
052600*    NOTE USING A RENAMES DATANAME THAT IS ALSO REDEFINED.
052700     MOVE RDF3-5-16 TO COMPUTED-A.
052800     MOVE 66 TO CORRECT-A.
052900     PERFORM FAIL.
053000     GO TO RDF-WRITE-2.
053100 RDF-DELETE-2.
053200     PERFORM DE-LETE.
053300 RDF-WRITE-2.
053400     MOVE "RDF-TEST-2 " TO PAR-NAME.
053500     PERFORM PRINT-DETAIL.
053600 RDF-TEST-003.
053700     IF   AN0002-O036F-X-0002  (8)  EQUAL TO  "LK"
053800          PERFORM  PASS
053900          GO TO   RDF-WRITE-003.
054000*
054100*    NOTE  REFERENCING    SUBSCRIPTED DATA ITEM WHICH IS
054200*          SUBORDINATE TO A REDEFINES CLAUSE.
054300*
054400     MOVE  AN0002-O036F-X-0002 (8) TO  COMPUTED-A.
054500     MOVE   "LK"  TO CORRECT-A.
054600     PERFORM  FAIL.
054700     GO TO    RDF-WRITE-003.
054800 RDF-DELETE-003.
054900     PERFORM  DE-LETE.
055000 RDF-WRITE-003.
055100     MOVE     "RDF-TEST-003"  TO  PAR-NAME.
055200     PERFORM  PRINT-DETAIL.
055300 RDF-TEST-4.
055400     IF RDFDATA7 EQUAL TO "ABC98765DE911644ALLD"
055500         PERFORM PASS
055600         GO TO RDF-WRITE-4.
055700*    NOTE THIS IS THE FIRST REFERENCE TO THESE REDEFINED
055800*        DATANAMES, SO, THE FIELDS CONTAIN THE WORKING-STORAGE
055900*        ASSIGNED VALUES.
056000     MOVE RDFDATA7 TO COMPUTED-A.
056100     MOVE "ABC98765DE911644ALLD" TO CORRECT-A.
056200     PERFORM FAIL.
056300     GO TO RDF-WRITE-4.
056400 RDF-DELETE-4.
056500     PERFORM DE-LETE.
056600 RDF-WRITE-4.
056700     MOVE "RDF-TEST-4 " TO PAR-NAME.
056800     PERFORM PRINT-DETAIL.
056900 RDF-TEST-5.
057000     IF RDFDATA8 (13) EQUAL TO "HG"
057100         PERFORM PASS
057200         GO TO RDF-WRITE-5.
057300     MOVE "HG" TO CORRECT-A.
057400     MOVE RDFDATA8 (13) TO COMPUTED-A.
057500     PERFORM FAIL.
057600     GO TO RDF-WRITE-5.
057700 RDF-DELETE-5.
057800     PERFORM DE-LETE.
057900 RDF-WRITE-5.
058000     MOVE "RDF-TEST-5 " TO PAR-NAME.
058100     PERFORM PRINT-DETAIL.
058200 RDF-TEST-6.
058300     IF RDFDATA2 EQUAL TO 9116.44
058400         PERFORM PASS
058500         GO TO RDF-WRITE-6.
058600     MOVE 9116.44 TO COMPUTED-N.
058700     MOVE RDFDATA2 TO CORRECT-N.
058800     PERFORM FAIL.
058900     GO TO RDF-WRITE-6.
059000 RDF-DELETE-6.
059100     PERFORM DE-LETE.
059200 RDF-WRITE-6.
059300     MOVE "RDF-TEST-6 " TO PAR-NAME.
059400     PERFORM PRINT-DETAIL.
059500 RDF-TEST-7.
059600     IF RDFDATA16 EQUAL TO 66
059700         PERFORM PASS
059800         GO TO RDF-WRITE-7.
059900     MOVE RDFDATA16 TO COMPUTED-A.
060000     MOVE 66 TO CORRECT-A.
060100     PERFORM FAIL.
060200     GO TO RDF-WRITE-7.
060300 RDF-DELETE-7.
060400     PERFORM DE-LETE.
060500 RDF-WRITE-7.
060600     MOVE "RDF-TEST-7 " TO PAR-NAME.
060700     PERFORM PRINT-DETAIL.
060800 RDF-TEST-8.
060900     MOVE SPACE TO REDEF12.
061000     IF REDEF11 EQUAL TO SPACE
061100         PERFORM PASS
061200         GO TO RDF-WRITE-8.
061300     MOVE "SPACE EXPECTED " TO CORRECT-A.
061400     MOVE "NON BLANK CHARACTERS" TO COMPUTED-A.
061500     MOVE "REDEF11 CONTAINS NON BLANKS" TO RE-MARK.
061600     PERFORM FAIL.
061700     GO TO RDF-WRITE-8.
061800 RDF-DELETE-8.
061900     PERFORM DE-LETE.
062000 RDF-WRITE-8.
062100     MOVE "RDF-TEST-8 " TO PAR-NAME.
062200     PERFORM PRINT-DETAIL.
062300 RDF-TEST-9.
062400     MOVE ZERO TO REDEF12.
062500     MOVE SPACE TO REDEF11.
062600*    NOTE  CHECKS RDFDATA18 WHICH SHOULD NOT BE DISTURBED BY THE
062700*        MOVE SPACE STATEMENT TO A SHORTER REDEFINED AREA.
062800     IF RDFDATA18 EQUAL TO ZERO
062900         PERFORM PASS
063000         GO TO RDF-WRITE-9.
063100     MOVE "00000000000000" TO CORRECT-A.
063200     MOVE RDFDATA18 TO COMPUTED-A.
063300     PERFORM FAIL.
063400     GO TO RDF-WRITE-9.
063500 RDF-DELETE-9.
063600     PERFORM DE-LETE.
063700 RDF-WRITE-9.
063800     MOVE "RDF-TEST-9 " TO PAR-NAME.
063900     PERFORM PRINT-DETAIL.
064000 RDF-TEST-10.
064100     MOVE ZERO TO REDEF12.
064200     MOVE "MOVING DATA TO A REDEFINED FIELD CAN BE RISKY "
064300         TO REDEF10.
064400     IF RDFDATA8 (14) EQUAL TO "00"
064500         PERFORM PASS
064600         GO TO RDF-WRITE-10.
064700     MOVE 00 TO CORRECT-A.
064800     MOVE RDFDATA8 (14) TO COMPUTED-A.
064900     PERFORM FAIL.
065000     GO TO RDF-WRITE-10.
065100 RDF-DELETE-10.
065200     PERFORM DE-LETE.
065300 RDF-WRITE-10.
065400     MOVE "RDF-TEST-10 " TO PAR-NAME.
065500     PERFORM PRINT-DETAIL.
065600 RDF-INIT-11.
065700     MOVE REDEF13 TO REDEF12.
065800     MOVE "RDF-TEST-11 " TO PAR-NAME.
065900 RDF-TEST-11.
066000     IF REDEF10 EQUAL TO
066100         "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"
066200         PERFORM PASS
066300         PERFORM PRINT-DETAIL
066400         GO TO   RDF-TEST-12.
066500     MOVE    1 TO REC-CT.
066600     MOVE    REDEF10 TO WS-46.
066700     MOVE   "AAAAAAAAAAAAAAAAAAAA" TO CORRECT-A.
066800     MOVE    WS-1-20 TO COMPUTED-A.
066900     MOVE   "FIELDS DIDNT COMPARE EQUAL " TO RE-MARK.
067000     PERFORM FAIL.
067100     PERFORM PRINT-DETAIL.
067200     ADD     1 TO REC-CT.
067300     MOVE   "AAAAAAAAAAAAAAAAAAAA" TO CORRECT-A.
067400     MOVE    WS-21-40 TO COMPUTED-A.
067500     MOVE   "FIELDS DIDNT COMPARE EQUAL " TO RE-MARK.
067600     PERFORM FAIL.
067700     PERFORM PRINT-DETAIL.
067800     ADD     1 TO REC-CT.
067900     MOVE   "AAAAAA"  TO CORRECT-A.
068000     MOVE    WS-41-46 TO COMPUTED-A.
068100     MOVE   "FIELDS DIDNT COMPARE EQUAL " TO RE-MARK.
068200     PERFORM FAIL.
068300     PERFORM PRINT-DETAIL.
068400     GO TO   RDF-TEST-12.
068500 RDF-DELETE-11.
068600     PERFORM DE-LETE.
068700 RDF-TEST-12.
068800     MOVE 11 TO RDFDATA16.
068900*    NOTE 88 LEVEL TEST ON REDEFINED AREA.
069000     IF  SOFT
069100         PERFORM PASS
069200     ELSE
069300         MOVE "CONDITION-NAME TEST" TO RE-MARK
069400         PERFORM FAIL.
069500     GO TO RDF-WRITE-12.
069600 RDF-DELETE-12.
069700     PERFORM DE-LETE.
069800 RDF-WRITE-12.
069900     MOVE "RDF-TEST-12" TO PAR-NAME.
070000     PERFORM PRINT-DETAIL.
070100 RDF-TEST-13.
070200     MOVE REDEF13 TO REDEF12.
070300     MOVE SPACE TO REDEF10.
070400     IF RDF8-7 EQUAL TO SPACE
070500         MOVE RDF8-7 TO COMPUTED-A
070600         MOVE "AAAA" TO CORRECT-A
070700         PERFORM FAIL
070800         GO TO RDF-WRITE-13.
070900     PERFORM PASS.
071000     GO TO RDF-WRITE-13.
071100 RDF-DELETE-13.
071200     PERFORM DE-LETE.
071300 RDF-WRITE-13.
071400     MOVE "RDF-TEST-13 " TO PAR-NAME.
071500     PERFORM PRINT-DETAIL.
071600 RDF-TEST-14.
071700     MOVE SPACE TO REDEF12.
071800     MOVE REDEF13 TO REDEF10.
071900     IF RDF8-3 EQUAL TO "AAAAAAAAA"
072000         MOVE RDF8-3 TO COMPUTED-A
072100         MOVE SPACE TO CORRECT-A
072200         PERFORM FAIL
072300         GO TO RDF-WRITE-14.
072400     PERFORM PASS.
072500     GO TO RDF-WRITE-14.
072600 RDF-DELETE-14.
072700     PERFORM DE-LETE.
072800 RDF-WRITE-14.
072900     MOVE "RDF-TEST-14 " TO PAR-NAME.
073000     PERFORM PRINT-DETAIL.
073100 RNM-INIT.
073200     PERFORM END-ROUTINE.
073300     MOVE "RENAMES" TO FEATURE.
073400 RENAM-TEST-1.
073500     MOVE "AB" TO NAME1A.
073600     MOVE "CD" TO NAME1B.
073700     IF RENAME4 EQUAL TO "ABCD "
073800              PERFORM PASS
073900              GO TO RNM-WRITE-1.
074000     MOVE RENAME4 TO COMPUTED-A.
074100     MOVE "ABCD" TO CORRECT-A.
074200*    NOTE  CORRECT ANSWER IS   ABCD-BLANK.
074300     PERFORM FAIL.
074400     GO TO RNM-WRITE-1.
074500 RNM-DELETE-1.
074600     PERFORM DE-LETE.
074700 RNM-WRITE-1.
074800     MOVE "RENAM-TEST-1" TO PAR-NAME.
074900     PERFORM PRINT-DETAIL.
075000 RENAM-TEST-2.
075100     MOVE ALL "A" TO RENAMES-DATA.
075200     IF RENAME3 EQUAL TO "AAAAAAAAAA"
075300              PERFORM PASS
075400              GO TO RNM-WRITE-2.
075500     MOVE RENAME3 TO COMPUTED-A.
075600     MOVE "AAAAAAAAAA" TO CORRECT-A.
075700     PERFORM FAIL.
075800     GO TO RNM-WRITE-2.
075900 RNM-DELETE-2.
076000     PERFORM DE-LETE.
076100 RNM-WRITE-2.
076200     MOVE "RENAM-TEST-2" TO PAR-NAME.
076300     PERFORM PRINT-DETAIL.
076400 RENAM-TEST-3.
076500     MOVE ALL "A" TO RENAMES-DATA.
076600     MOVE ALL "X" TO RENAME1.
076700     IF NAME1 NOT EQUAL TO "XXXXX" GO TO RNM-FAIL-3.
076800     IF NAME2 NOT EQUAL TO "XXXXXXXXXX" GO TO RNM-FAIL-3.
076900     IF NAME3 NOT EQUAL TO "XXXXX" GO TO RNM-FAIL-3.
077000     PERFORM PASS.
077100     GO TO RNM-WRITE-3.
077200 RNM-DELETE-3.
077300     PERFORM DE-LETE.
077400     GO TO RNM-WRITE-3.
077500 RNM-FAIL-3.
077600     MOVE RENAMES-DATA TO COMPUTED-A.
077700     MOVE "XXXXXXXXXXXXXXXXXXXX" TO CORRECT-A.
077800     PERFORM FAIL.
077900 RNM-WRITE-3.
078000     MOVE "RENAM-TEST-3" TO PAR-NAME.
078100     PERFORM PRINT-DETAIL.
078200 RENAM-TEST-4.
078300     IF RENAMES-TEST-1 EQUAL TO 123
078400         PERFORM PASS
078500         GO TO RENAM-WRITE-4.
078600     MOVE RENAMES-TEST-1 TO COMPUTED-A.
078700     MOVE 123 TO CORRECT-A.
078800     PERFORM FAIL.
078900     GO TO RENAM-WRITE-4.
079000 RENAM-DELETE-4.
079100     PERFORM DE-LETE.
079200 RENAM-WRITE-4.
079300     MOVE "RENAM-TEST-4" TO PAR-NAME.
079400     PERFORM PRINT-DETAIL.
079500 RENAM-TEST-5.
079600     IF RENAMES-TEST-3 EQUAL TO "X  123"
079700         PERFORM PASS
079800         GO TO RENAM-WRITE-5.
079900     MOVE RENAMES-TEST-3 TO COMPUTED-A.
080000     MOVE "X  123" TO CORRECT-A.
080100     PERFORM FAIL.
080200     GO TO RENAM-WRITE-5.
080300 RENAM-DELETE-5.
080400     PERFORM DE-LETE.
080500 RENAM-WRITE-5.
080600     MOVE "RENAM-TEST-5" TO PAR-NAME.
080700     PERFORM PRINT-DETAIL.
080800 RENAM-TEST-6.
080900     IF RENAMES-TEST-4 EQUAL TO "X  123"
081000         PERFORM PASS
081100         GO TO RENAM-WRITE-6.
081200     MOVE RENAMES-TEST-4 TO COMPUTED-A.
081300     MOVE "X  123" TO CORRECT-A.
081400     PERFORM FAIL.
081500     GO TO RENAM-WRITE-6.
081600 RENAM-DELETE-6.
081700     PERFORM DE-LETE.
081800 RENAM-WRITE-6.
081900     MOVE "RENAM-TEST-6" TO PAR-NAME.
082000     PERFORM PRINT-DETAIL.
082100 RENAM-TEST-7.
082200     IF RENAMES-TEST-2 EQUAL TO "X  "
082300         PERFORM PASS
082400         GO TO RENAM-WRITE-7.
082500     MOVE RENAMES-TEST-2 TO COMPUTED-A.
082600     MOVE "X  " TO CORRECT-A.
082700     PERFORM FAIL.
082800     GO TO RENAM-WRITE-7.
082900 RENAM-DELETE-7.
083000     PERFORM DE-LETE.
083100 RENAM-WRITE-7.
083200     MOVE "RENAM-TEST-7" TO PAR-NAME.
083300     PERFORM PRINT-DETAIL.
083400 RENAM-INIT-C.
083500     MOVE     "QUALIFIED RENAMES" TO FEATURE.
083600 RENAM-TEST-8.
083700     MOVE     "IOWA" TO TAG-1A.
083800     MOVE     "OREGON" TO TAG-1B.
083900     MOVE     "CALIFORNIA" TO RENAME-5 OF T-RENAMES-DATA.
084000     IF       TAG-1 EQUAL TO "CALIFORNIA"
084100              PERFORM PASS GO TO RENAM-WRITE-8.
084200     GO       TO RENAM-FAIL-8.
084300 RENAM-DELETE-8.
084400     PERFORM  DE-LETE.
084500     GO       TO RENAM-WRITE-8.
084600 RENAM-FAIL-8.
084700     PERFORM FAIL.
084800     MOVE     TAG-1 TO COMPUTED-A.
084900     MOVE     "CALIFORNIA" TO CORRECT-A.
085000 RENAM-WRITE-8.
085100     MOVE     "RENAM-TEST-8 " TO PAR-NAME.
085200     PERFORM  PRINT-DETAIL.
085300 RENAM-TEST-9.
085400     IF       UNIT-1 EQUAL TO "VERMONTOHIO"
085500              PERFORM PASS GO TO RENAM-WRITE-9.
085600*        NOTE THIS TEST FURTHER CHECKS THE RESULTS OF
085700*             THE PREVIOUS TEST - THIS ITEM SHOULD BE UNCHANGED.
085800     GO       TO RENAM-FAIL-9.
085900 RENAM-DELETE-9.
086000     PERFORM  DE-LETE.
086100     GO       TO RENAM-WRITE-9.
086200 RENAM-FAIL-9.
086300     PERFORM FAIL.
086400     MOVE     UNIT-1 TO COMPUTED-A.
086500     MOVE     "VERMONTOHIO" TO CORRECT-A.
086600 RENAM-WRITE-9.
086700     MOVE     "RENAM-TEST-9 " TO PAR-NAME.
086800     PERFORM  PRINT-DETAIL.
086900 RENAM-TEST-10.
087000     MOVE     "IOWAOREGONFLORIDA" TO T-RENAMES-DATA.
087100     IF       RENAME-6 IN T-RENAMES-DATA EQUAL TO
087200              "IOWAOREGONFLORIDA"
087300              PERFORM PASS GO TO RENAM-WRITE-10.
087400     GO       TO RENAM-FAIL-10.
087500 RENAM-DELETE-10.
087600     PERFORM  DE-LETE.
087700     GO       TO RENAM-WRITE-10.
087800 RENAM-FAIL-10.
087900     PERFORM FAIL.
088000     MOVE    RENAME-6 IN T-RENAMES-DATA TO COMPUTED-A.
088100     MOVE   "IOWAOREGONFLORIDA" TO CORRECT-A.
088200 RENAM-WRITE-10.
088300     MOVE   "RENAM-TEST-10" TO PAR-NAME.
088400     PERFORM PRINT-DETAIL.
088500 RENAM-TEST-11.
088600     MOVE   "BOSTO" TO ITEM-1.
088700     MOVE   "N M" TO TABLE-ITEM-2 (1).
088800     MOVE   "ASS" TO TABLE-ITEM-2 (2).
088900     MOVE   "ACH" TO TABLE-ITEM-2 (3).
089000     MOVE   "USE" TO TABLE-ITEM-2 (4).
089100     MOVE   "TTS" TO TABLE-ITEM-2 (5).
089200     IF      RENAME-7 EQUAL TO "BOSTON MASSACHUSETTS"
089300             PERFORM PASS GO TO RENAM-WRITE-11.
089400     GO      TO RENAM-FAIL-11.
089500 RENAM-DELETE-11.
089600     PERFORM  DE-LETE.
089700     GO       TO RENAM-WRITE-11.
089800 RENAM-FAIL-11.
089900     PERFORM FAIL.
090000     MOVE     RENAME-7 TO COMPUTED-A.
090100     MOVE     "BOSTON MASSACHUSETTS" TO CORRECT-A.
090200 RENAM-WRITE-11.
090300     MOVE     "RENAMES A TABLE" TO FEATURE.
090400     MOVE     "RENAM-TEST-11" TO PAR-NAME.
090500     PERFORM  PRINT-DETAIL.
090600 RENAM-INIT-D.
090700     MOVE     "RENAMED DATA ---" TO FEATURE.
090800     PERFORM  PRINT-DETAIL.
090900 RENAM-TEST-12.
091000     MOVE     SPACE TO W-RENAMES-DATA.
091100     MOVE     12.3 TO WIDGET-1.
091200     MOVE     45678.9 TO WIDGET-2.
091300     MOVE     ZERO TO WIDGET-3.
091400     IF       RENAME-8 EQUAL TO "123*45,678.900000"
091500              PERFORM PASS GO TO RENAM-WRITE-12.
091600     GO       TO RENAM-FAIL-12.
091700 RENAM-DELETE-12.
091800     PERFORM  DE-LETE.
091900     GO       TO RENAM-WRITE-12.
092000 RENAM-FAIL-12.
092100     PERFORM FAIL.
092200     MOVE     RENAME-8 TO COMPUTED-A.
092300     MOVE     "123*45,678.900000" TO CORRECT-A.
092400 RENAM-WRITE-12.
092500     MOVE     "  GROUP COMPARISON" TO FEATURE
092600     MOVE     "RENAM-TEST-12" TO PAR-NAME.
092700     PERFORM  PRINT-DETAIL.
092800 RENAM-TEST-13.
092900     MOVE     SPACE TO W-RENAMES-DATA.
093000     MOVE     "123456789" TO RENAME-10.
093100     IF       RENAME-9 EQUAL TO "    12345678"
093200              PERFORM PASS GO TO RENAM-WRITE-13.
093300     GO       TO RENAM-FAIL-13.
093400 RENAM-DELETE-13.
093500     PERFORM  DE-LETE.
093600     GO       TO RENAM-WRITE-13.
093700 RENAM-FAIL-13.
093800     PERFORM FAIL.
093900     MOVE     RENAME-9 TO COMPUTED-A
094000     MOVE     "    12345678" TO CORRECT-A.
094100 RENAM-WRITE-13.
094200     MOVE     "  GRP MOVE, COMPARE" TO FEATURE.
094300     MOVE     "RENAM-TEST-13" TO PAR-NAME.
094400     PERFORM  PRINT-DETAIL.
094500 RENAM-TEST-14.
094600     MOVE     SPACE TO W-RENAMES-DATA.
094700     MOVE     123456 TO RENAME-10
094800     IF       WIDGET-4 EQUAL TO 1234
094900              PERFORM PASS GO TO RENAM-WRITE-14.
095000     GO       TO RENAM-FAIL-14.
095100 RENAM-DELETE-14.
095200     PERFORM  DE-LETE.
095300     GO       TO RENAM-WRITE-14.
095400 RENAM-FAIL-14.
095500     PERFORM FAIL.
095600     MOVE     WIDGET-4 TO COMPUTED-N.
095700     MOVE     1234 TO CORRECT-N.
095800 RENAM-WRITE-14.
095900     MOVE     "  GROUP MOVE" TO FEATURE.
096000     MOVE     "RENAM-TEST-14" TO PAR-NAME.
096100     PERFORM  PRINT-DETAIL.
096200 RENAM-TEST-15.
096300     MOVE     SPACE TO W-RENAMES-DATA.
096400     MOVE     234.5 TO RENAME-11.
096500     IF       WIDGET-2 EQUAL TO "****234.50"
096600              PERFORM PASS GO TO RENAM-WRITE-15.
096700     GO       TO RENAM-FAIL-15.
096800 RENAM-DELETE-15.
096900     PERFORM  DE-LETE.
097000     GO       TO RENAM-WRITE-15.
097100 RENAM-FAIL-15.
097200     PERFORM FAIL.
097300     MOVE     WIDGET-2 TO COMPUTED-A.
097400     MOVE     "****234.50" TO CORRECT-A.
097500 RENAM-WRITE-15.
097600     MOVE     "  EDITED MOVE" TO FEATURE.
097700     MOVE     "RENAM-TEST-15" TO PAR-NAME.
097800     PERFORM  PRINT-DETAIL.
097900 RENAM-INIT-E.
098000     MOVE     "  ADD, SIZE ERROR" TO FEATURE.
098100*        NOTE THE NEXT TWO TESTS ARE INTERRELATED.
098200 RENAM-TEST-16.
098300     MOVE     8000 TO WIDGET-4.
098400     ADD      3500 TO RENAME-12 ON SIZE ERROR
098500              PERFORM PASS GO TO RENAM-WRITE-16.
098600     GO       TO RENAM-FAIL-16.
098700 RENAM-DELETE-16.
098800     PERFORM  DE-LETE.
098900     GO       TO RENAM-WRITE-16.
099000 RENAM-FAIL-16.
099100     PERFORM FAIL.
099200     MOVE     "SIZE ERROR DID NOT OCCUR" TO RE-MARK.
099300 RENAM-WRITE-16.
099400     MOVE     "RENAM-TEST-16" TO PAR-NAME.
099500     PERFORM  PRINT-DETAIL.
099600 RENAM-TEST-17.
099700     IF       RENAME-12 EQUAL TO 8000
099800              PERFORM PASS GO TO RENAM-WRITE-17.
099900     GO       TO RENAM-FAIL-17.
100000 RENAM-DELETE-17.
100100     PERFORM  DE-LETE.
100200     GO       TO RENAM-WRITE-17.
100300 RENAM-FAIL-17.
100400     PERFORM FAIL.
100500     MOVE     RENAME-12 TO COMPUTED-N.
100600     MOVE     8000 TO CORRECT-N.
100700 RENAM-WRITE-17.
100800     MOVE     "RENAM-TEST-17" TO PAR-NAME.
100900     PERFORM  PRINT-DETAIL.
101000 RENAM-TEST-18.
101100     MOVE     SPACE TO U-RENAMES-DATA.
101200     MOVE     "CHICAGO ILLINOIS" TO RENAME-5 OF U-RENAMES-DATA.
101300     IF       U-RENAMES-DATA EQUAL TO "CHICAGO ILL     "
101400              PERFORM PASS GO TO RENAM-WRITE-18.
101500     PERFORM  FAIL.
101600     GO       TO RENAM-FAIL-18.
101700 RENAM-DELETE-18.
101800     PERFORM  DE-LETE.
101900     GO       TO RENAM-WRITE-18.
102000 RENAM-FAIL-18.
102100     PERFORM  FAIL.
102200     MOVE     U-RENAMES-DATA TO COMPUTED-A.
102300     MOVE     "CHICAGO ILL     " TO CORRECT-A.
102400 RENAM-WRITE-18.
102500     MOVE     "  THROUGH" TO FEATURE.
102600     MOVE     "RENAM-TEST-18" TO PAR-NAME.
102700     PERFORM  PRINT-DETAIL.
102800*
102900 COMPUTING SECTION.
103000 COMPUTE-INIT.
103100     MOVE SPACES TO TEST-RESULTS.
103200     PERFORM END-ROUTINE.
103300     MOVE "THE COMPUTED RESULT FOR THE FOLLOWING TESTS"
103400             TO RE-MARK.
103500     PERFORM PRINT-DETAIL.
103600     MOVE "IS ALLOWED TO DEVIATE FROM THE INDICATED"
103700             TO RE-MARK.
103800     PERFORM PRINT-DETAIL.
103900     MOVE "CORRECT RESULT BY" TO RE-MARK.
104000     PERFORM PRINT-DETAIL.
104100     MOVE "+ OR - (CORRECT RESULT * (.2 ** 5))."
104200             TO RE-MARK.
104300     PERFORM PRINT-DETAIL.
104400     MOVE "COMPUTE        " TO FEATURE.
104500 COMP-TEST-1.
104600     COMPUTE COMPUTE-1 = COMPUTE-1A.
104700     IF ( COMPUTE-1 < 654.20038) AND
104800        ( COMPUTE-1 > 654.17422) THEN
104900              PERFORM PASS
105000              GO TO COMP-WRITE-1.
105100     PERFORM FAIL.
105200     MOVE COMPUTE-1 TO COMPUTED-N.
105300     MOVE "+654.1873" TO CORRECT-A.
105400     GO TO COMP-WRITE-1.
105500 COMP-DELETE-1.
105600     PERFORM DE-LETE.
105700 COMP-WRITE-1.
105800     MOVE "COMP-TEST-1" TO PAR-NAME.
105900     PERFORM PRINT-DETAIL.
106000 COMP-TEST-2.
106100     COMPUTE COMPUTE-2 = 2233.9
106200     IF ( COMPUTE-2 < 2233.94468) AND
106300         ( COMPUTE-2 > 2233.85532) THEN
106400              PERFORM PASS
106500              GO TO COMP-WRITE-2.
106600     PERFORM FAIL.
106700     MOVE COMPUTE-2 TO COMPUTED-N.
106800     MOVE "+2233.9" TO CORRECT-A.
106900     GO TO COMP-WRITE-2.
107000 COMP-DELETE-2.
107100     PERFORM DE-LETE.
107200 COMP-WRITE-2.
107300     MOVE "COMP-TEST-2" TO PAR-NAME.
107400     PERFORM PRINT-DETAIL.
107500 COMP-TEST-3.
107600     COMPUTE COMPUTE-3 = COMPUTE-3A - COMPUTE-3B.
107700     IF ( COMPUTE-3 NOT < 52.39105) AND
107800        ( COMPUTE-3 NOT > 52.38895) THEN
107900              PERFORM FAIL
108000               MOVE COMPUTE-3 TO COMPUTED-N
108100              MOVE "+52.39" TO CORRECT-A
108200              GO TO COMP-WRITE-3.
108300     PERFORM PASS.
108400     GO TO COMP-WRITE-3.
108500 COMP-DELETE-3.
108600     PERFORM DE-LETE.
108700 COMP-WRITE-3.
108800     MOVE "COMP-TEST-3" TO PAR-NAME.
108900     PERFORM PRINT-DETAIL.
109000 COMP-TEST-4.
109100     COMPUTE COMPUTE-4 = COMPUTE-4A + COMPUTE-4B.
109200        IF COMPUTE-4 NOT = 341
109300              PERFORM FAIL
109400              MOVE COMPUTE-4 TO COMPUTED-N
109500              MOVE "+341" TO CORRECT-A
109600              GO TO COMP-WRITE-4.
109700     PERFORM PASS.
109800     GO TO COMP-WRITE-4.
109900 COMP-DELETE-4.
110000     PERFORM DE-LETE.
110100 COMP-WRITE-4.
110200     MOVE "COMP-TEST-4" TO PAR-NAME.
110300     PERFORM PRINT-DETAIL.
110400 COMP-TEST-5.
110500     COMPUTE COMPUTE-5 = COMPUTE-5A * 36.1
110600     IF ( COMPUTE-5 > 400.71801) OR
110700        ( COMPUTE-5 < 400.70199) THEN
110800              PERFORM FAIL
110900              MOVE COMPUTE-5 TO COMPUTED-N
111000              MOVE "+400.71" TO CORRECT-A
111100              GO TO COMP-WRITE-5.
111200     PERFORM PASS.
111300     GO TO COMP-WRITE-5.
111400 COMP-DELETE-5.
111500     PERFORM DE-LETE.
111600 COMP-WRITE-5.
111700     MOVE "COMP-TEST-5" TO PAR-NAME.
111800     PERFORM PRINT-DETAIL.
111900 COMP-TEST-6.
112000     COMPUTE COMPUTE-6 = COMPUTE-6A / 6.0
112100     IF ( COMPUTE-6 > 62.40125) OR
112200        ( COMPUTE-6 < 62.39875) THEN
112300              PERFORM FAIL
112400              MOVE COMPUTE-6 TO COMPUTED-N
112500              MOVE "+062.40" TO CORRECT-A
112600              GO TO COMP-WRITE-6.
112700     PERFORM PASS.
112800     GO TO COMP-WRITE-6.
112900 COMP-DELETE-6.
113000     PERFORM DE-LETE.
113100 COMP-WRITE-6.
113200     MOVE "COMP-TEST-6" TO PAR-NAME.
113300     PERFORM PRINT-DETAIL.
113400 COMP-TEST-7.
113500     COMPUTE COMPUTE-7 = 2.0 ** 4.
113600        IF COMPUTE-7 = 16
113700              PERFORM PASS
113800              GO TO COMP-WRITE-7.
113900     PERFORM FAIL.
114000     MOVE COMPUTE-7 TO COMPUTED-N.
114100     MOVE "+16" TO CORRECT-A.
114200     GO TO COMP-WRITE-7.
114300 COMP-DELETE-7.
114400     PERFORM DE-LETE.
114500 COMP-WRITE-7.
114600     MOVE "COMP-TEST-7" TO PAR-NAME.
114700     PERFORM PRINT-DETAIL.
114800 COMP-TEST-8.
114900     COMPUTE COMPUTE-8 = (((24.0 + 1) * (60 - 10)) / 125) ** 2.
115000             IF COMPUTE-8 = 100
115100          PERFORM PASS
115200          GO TO COMP-WRITE-8.
115300     PERFORM FAIL.
115400     MOVE COMPUTE-8 TO COMPUTED-N.
115500     MOVE "+100" TO CORRECT-A.
115600     GO TO COMP-WRITE-8.
115700 COMP-DELETE-8.
115800     PERFORM DE-LETE.
115900 COMP-WRITE-8.
116000     MOVE "COMP-TEST-8" TO PAR-NAME.
116100     PERFORM PRINT-DETAIL.
116200 COMP-TEST-9.
116300     COMPUTE COMPUTE-9 ROUNDED = COMPUTE-6A * 7.0
116400     IF (COMPUTE-9 > 2621.05242) OR
116500        (COMPUTE-9 < 2620.94758) THEN
116600              PERFORM FAIL
116700              MOVE COMPUTE-9 TO COMPUTED-N
116800              MOVE "+2621" TO CORRECT-A
116900              GO TO COMP-WRITE-9.
117000     PERFORM PASS.
117100     GO TO COMP-WRITE-9.
117200 COMP-DELETE-9.
117300     PERFORM DE-LETE.
117400 COMP-WRITE-9.
117500     MOVE "COMP-TEST-9" TO PAR-NAME.
117600     PERFORM PRINT-DETAIL.
117700 COMP-TEST-10.
117800     COMPUTE COMPUTE-10 = COMPUTE-1A + COMPUTE-6A ON SIZE ERROR
117900     MOVE "R" TO XRAY.
118000     IF XRAY EQUAL TO "R"
118100              PERFORM PASS
118200              GO TO COMP-WRITE-10.
118300     PERFORM FAIL.
118400     MOVE "OSE NOT EXECUTED" TO RE-MARK.
118500     GO TO COMP-WRITE-10.
118600 COMP-DELETE-10.
118700     PERFORM DE-LETE.
118800 COMP-WRITE-10.
118900     MOVE "COMP-TEST-10" TO PAR-NAME.
119000     PERFORM PRINT-DETAIL.
119100 COMP-TEST-11.
119200     IF (COMPUTE-10 > 0.00002) OR
119300        (COMPUTE-10 < -0.00002)
119400              PERFORM FAIL
119500              MOVE COMPUTE-10 TO COMPUTED-N
119600              MOVE ZERO TO CORRECT-N
119700              GO TO COMP-WRITE-11.
119800     PERFORM PASS.
119900     GO TO COMP-WRITE-11.
120000 COMP-DELETE-11.
120100     PERFORM DE-LETE.
120200 COMP-WRITE-11.
120300     MOVE "COMP-TEST-11" TO PAR-NAME.
120400     PERFORM PRINT-DETAIL.
120500 COMP-TEST-12.
120600     COMPUTE COMPUTE-11 = COMPUTE-11A + COMPUTE-11B - 121.6
120700     IF ( COMPUTE-11 < 718.51437) AND
120800        ( COMPUTE-11 > 718.48563) THEN
120900              PERFORM PASS
121000              GO TO COMP-WRITE-12.
121100     PERFORM FAIL.
121200     MOVE COMPUTE-11 TO COMPUTED-N.
121300     MOVE "+718.5" TO CORRECT-A.
121400     GO TO COMP-WRITE-12.
121500 COMP-DELETE-12.
121600     PERFORM DE-LETE.
121700 COMP-WRITE-12.
121800     MOVE "COMP-TEST-12" TO PAR-NAME.
121900     PERFORM PRINT-DETAIL.
122000 COMP-TEST-13.
122100     COMPUTE COMPUTE-12 = COMPUTE-12A * 5.1 / 281.7.
122200     IF (COMPUTE-12 < 6.09012) AND
122300        (COMPUTE-12 > 6.08988) THEN
122400              PERFORM PASS
122500              GO TO COMP-WRITE-13.
122600     PERFORM FAIL.
122700     MOVE COMPUTE-12 TO COMPUTED-N.
122800     MOVE "+6.09" TO CORRECT-A.
122900     GO TO COMP-WRITE-13.
123000 COMP-DELETE-13.
123100     PERFORM DE-LETE.
123200 COMP-WRITE-13.
123300     MOVE "COMP-TEST-13" TO PAR-NAME.
123400     PERFORM PRINT-DETAIL.
123500 COMPUTE-ROUTINE SECTION.
123600 COMPUTE-TEST.
123700     MOVE "COMPUTE" TO FEATURE.
123800     MOVE ZERO TO W-1.
123900     MOVE ZERO TO W-2.
124000 COMP-TEST-14.
124100     COMPUTE W-1 = NINE.
124200        IF W-1 = 9
124300              PERFORM PASS
124400              GO TO COMP-WRITE-14.
124500     PERFORM FAIL.
124600     MOVE W-1 TO COMPUTED-A.
124700     MOVE 9 TO W-1.
124800     MOVE 9 TO CORRECT-A.
124900     GO TO COMP-WRITE-14.
125000 COMP-DELETE-14.
125100     PERFORM DE-LETE.
125200 COMP-WRITE-14.
125300     MOVE "COMP-TEST-14" TO PAR-NAME.
125400     PERFORM PRINT-DETAIL.
125500 COMP-TEST-15.
125600     COMPUTE W-2 = W-1 + 20.
125700        IF W-2 = 29
125800              PERFORM PASS
125900              GO TO COMP-WRITE-15.
126000     PERFORM FAIL.
126100     MOVE W-2 TO COMPUTED-N.
126200     MOVE "+29" TO CORRECT-A.
126300     MOVE 29 TO W-2.
126400     GO TO COMP-WRITE-15.
126500 COMP-DELETE-15.
126600     PERFORM DE-LETE.
126700 COMP-WRITE-15.
126800     MOVE "COMP-TEST-15" TO PAR-NAME.
126900     PERFORM PRINT-DETAIL.
127000 COMP-TEST-16.
127100     MOVE ZERO TO W-11.
127200     COMPUTE W-11 = W-1 - W-2.
127300     IF ( W-11 > -20.00040) AND
127400        ( W-11 < -19.99960) THEN
127500              PERFORM PASS
127600              GO TO COMP-WRITE-16.
127700     PERFORM FAIL.
127800     MOVE W-11 TO COMPUTED-N.
127900     MOVE "-20" TO CORRECT-A.
128000     GO TO COMP-WRITE-16.
128100 COMP-DELETE-16.
128200     PERFORM DE-LETE.
128300 COMP-WRITE-16.
128400     MOVE "COMP-TEST-16" TO PAR-NAME.
128500     PERFORM PRINT-DETAIL.
128600 COMP-TEST-17.
128700     MOVE ZERO TO W-3.
128800     COMPUTE W-3 = TEN * 30.
128900        IF W-3 = 300
129000              PERFORM PASS
129100              GO TO COMP-WRITE-17.
129200     PERFORM FAIL.
129300     MOVE W-3 TO COMPUTED-N.
129400     MOVE "+300" TO CORRECT-A.
129500     GO TO COMP-WRITE-17.
129600 COMP-DELETE-17.
129700     PERFORM DE-LETE.
129800 COMP-WRITE-17.
129900     MOVE "COMP-TEST-17" TO PAR-NAME.
130000     PERFORM PRINT-DETAIL.
130100 COMP-TEST-18.
130200     MOVE ZERO TO W-5.
130300     COMPUTE W-5 = 42 / SEVEN.
130400        IF W-5 = 6
130500              PERFORM PASS
130600              GO TO COMP-WRITE-18.
130700     PERFORM FAIL.
130800     MOVE W-5 TO COMPUTED-N.
130900     MOVE "+6" TO CORRECT-A.
131000     GO TO COMP-WRITE-18.
131100 COMP-DELETE-18.
131200     PERFORM DE-LETE.
131300 COMP-WRITE-18.
131400     MOVE "COMP-TEST-18" TO PAR-NAME.
131500     PERFORM PRINT-DETAIL.
131600 COMP-TEST-19.
131700     MOVE ZERO TO W-2.
131800     COMPUTE W-2 = FOUR ** 3.
131900        IF W-2 = 64
132000              PERFORM PASS
132100              GO TO COMP-WRITE-19.
132200     PERFORM FAIL.
132300     MOVE W-2 TO COMPUTED-N.
132400     MOVE "+64" TO CORRECT-A.
132500     GO TO COMP-WRITE-19.
132600 COMP-DELETE-19.
132700     PERFORM DE-LETE.
132800 COMP-WRITE-19.
132900     MOVE "COMP-TEST-19" TO PAR-NAME.
133000     PERFORM PRINT-DETAIL.
133100 COMP-TEST-20.
133200     MOVE 555 TO W-3.
133300     COMPUTE W-3 = TWENTY-5 + 101 + 222.
133400        IF W-3 = 348
133500              PERFORM PASS
133600              GO TO COMP-WRITE-20.
133700              PERFORM FAIL.
133800              MOVE W-3 TO COMPUTED-N.
133900              MOVE "+348" TO CORRECT-A.
134000     GO TO COMP-WRITE-20.
134100 COMP-DELETE-20.
134200     PERFORM DE-LETE.
134300 COMP-WRITE-20.
134400     MOVE "COMP-TEST-20" TO PAR-NAME.
134500     PERFORM PRINT-DETAIL.
134600 COMP-TEST-21.
134700     MOVE ZERO TO W-9.
134800     COMPUTE W-9 = TWO * (3 + 4).
134900        IF W-9 = 14
135000              PERFORM PASS
135100              GO TO COMP-WRITE-21.
135200     PERFORM FAIL.
135300     MOVE W-9 TO COMPUTED-N.
135400     MOVE "+14" TO CORRECT-A.
135500     GO TO COMP-WRITE-21.
135600 COMP-DELETE-21.
135700     PERFORM DE-LETE.
135800 COMP-WRITE-21.
135900     MOVE "COMP-TEST-21" TO PAR-NAME.
136000     PERFORM PRINT-DETAIL.
136100  COMP-TEST-22.
136200     MOVE ZERO TO W-9.
136300     COMPUTE W-9 = (TWO + (3 * FOUR) / (2 * THREE)) ** 2 - 1.
136400             IF W-9 = 15     PERFORM PASS
136500         GO TO COMP-WRITE-22.
136600     PERFORM FAIL.
136700     MOVE W-9 TO COMPUTED-N.
136800     MOVE "+15" TO CORRECT-A.
136900     GO TO COMP-WRITE-22.
137000 COMP-DELETE-22.
137100     PERFORM DE-LETE.
137200 COMP-WRITE-22.
137300     MOVE "COMP-TEST-22" TO PAR-NAME.
137400     PERFORM PRINT-DETAIL.
137500 COMP-TEST-23.
137600     MOVE ZERO TO XRAY.
137700     MOVE 10 TO W-2.
137800     COMPUTE W-2 = 96 + TWENTY ON SIZE ERROR
137900     MOVE 8 TO XRAY.
138000     IF XRAY IS EQUAL TO "8"
138100              PERFORM PASS
138200              GO TO COMP-WRITE-23.
138300     PERFORM FAIL.
138400     MOVE "8" TO CORRECT-A.
138500     MOVE XRAY TO COMPUTED-A.
138600     MOVE "OSE NOT EXECUTED" TO RE-MARK.
138700     GO TO COMP-WRITE-23.
138800 COMP-DELETE-23.
138900     PERFORM DE-LETE.
139000 COMP-WRITE-23.
139100     MOVE "COMP-TEST-23" TO PAR-NAME.
139200     PERFORM PRINT-DETAIL.
139300 COMP-TEST-24.
139400        IF W-2 = 10
139500              PERFORM PASS
139600              GO TO COMP-WRITE-24.
139700     PERFORM FAIL.
139800     MOVE W-2 TO COMPUTED-A.
139900     MOVE "10" TO CORRECT-A.
140000     MOVE "NOT PROTECTED BY OES" TO RE-MARK.
140100     GO TO COMP-WRITE-24.
140200 COMP-DELETE-24.
140300     PERFORM DE-LETE.
140400 COMP-WRITE-24.
140500     MOVE "COMP-TEST-24" TO PAR-NAME.
140600     PERFORM PRINT-DETAIL.
140700 COMP-TEST-25.
140800     MOVE ZERO TO W-11.
140900     COMPUTE W-11 ROUNDED = D-1 + D-7.
141000     IF ( W-11 < 2.20004) AND
141100        ( W-11 > 2.19996) THEN
141200              PERFORM PASS
141300              GO TO COMP-WRITE-25.
141400     PERFORM FAIL.
141500     MOVE W-11 TO COMPUTED-N.
141600     MOVE "+2.2" TO CORRECT-A.
141700     GO TO COMP-WRITE-25.
141800 COMP-DELETE-25.
141900     PERFORM DE-LETE.
142000 COMP-WRITE-25.
142100     MOVE "COMP-TEST-25" TO PAR-NAME.
142200     PERFORM PRINT-DETAIL.
142300 COMP-TEST-26.
142400     MOVE ZERO TO W-11.
142500     COMPUTE W-11 ROUNDED = 25 / 10.
142600     IF ( W-11 < 2.50005) AND
142700        ( W-11 > 2.49995) THEN
142800              PERFORM PASS
142900              GO TO COMP-WRITE-26.
143000     PERFORM FAIL.
143100     MOVE W-11 TO COMPUTED-N.
143200     MOVE "+2.5" TO CORRECT-A.
143300     GO TO COMP-WRITE-26.
143400 COMP-DELETE-26.
143500     PERFORM DE-LETE.
143600 COMP-WRITE-26.
143700     MOVE "COMP-TEST-26" TO PAR-NAME.
143800     PERFORM PRINT-DETAIL.
143900 CTST-END.
144000     EXIT.
144100 COMP-INIT-A.
144200     MOVE     "COMPUTE" TO FEATURE.
144300 COMP-TEST-27.
144400     MOVE     ZERO TO WRK-DS-02V00.
144500     COMPUTE  WRK-DS-02V00 = -9.
144600        IF WRK-DS-02V00 = -9
144700              PERFORM PASS
144800              GO TO COMP-WRITE-27.
144900     MOVE     WRK-DS-02V00 TO COMPUTED-N.
145000     MOVE     -9 TO CORRECT-N.
145100     PERFORM  FAIL.
145200     GO TO COMP-WRITE-27.
145300 COMP-DELETE-27.
145400     PERFORM DE-LETE.
145500 COMP-WRITE-27.
145600     MOVE     "COMP-TEST-27" TO PAR-NAME.
145700     PERFORM  PRINT-DETAIL.
145800 COMP-TEST-28.
145900     MOVE     ZERO TO WRK-DS-02V00.
146000     COMPUTE  WRK-DS-02V00 = A99-DS-02V00.
146100        IF WRK-DS-02V00 = 99
146200              PERFORM PASS
146300              GO TO COMP-WRITE-28.
146400     MOVE     WRK-DS-02V00 TO COMPUTED-N.
146500     MOVE     99 TO CORRECT-N.
146600     PERFORM  FAIL.
146700     GO TO COMP-WRITE-28.
146800 COMP-DELETE-28.
146900     PERFORM DE-LETE.
147000 COMP-WRITE-28.
147100     MOVE     "COMP-TEST-28" TO PAR-NAME.
147200     PERFORM  PRINT-DETAIL.
147300 COMP-TEST-29.
147400     MOVE     ZERO TO WRK-DS-18V00.
147500     COMPUTE  WRK-DS-18V00 = A18ONES-DS-18V00 + A18ONES-DS-18V00.
147600     IF       WRK-DS-18V00 = 222222222222222222
147700              PERFORM PASS
147800              GO TO COMP-WRITE-29.
147900     MOVE     WRK-DS-18V00 TO COMPUTED-18V0.
148000     MOVE     222222222222222222 TO CORRECT-18V0.
148100     PERFORM  FAIL.
148200     GO TO COMP-WRITE-29.
148300 COMP-DELETE-29.
148400     PERFORM DE-LETE.
148500 COMP-WRITE-29.
148600     MOVE     "COMP-TEST-29" TO PAR-NAME.
148700     PERFORM  PRINT-DETAIL.
148800 COMP-TEST-30.
148900     MOVE     ZERO TO WRK-DS-18V00.
149000     COMPUTE  WRK-DS-18V00 = A18TWOS-DS-18V00 - A18ONES-DS-18V00.
149100     IF       WRK-DS-18V00 = 111111111111111111
149200              PERFORM PASS
149300              GO TO COMP-WRITE-30.
149400     MOVE     WRK-DS-18V00 TO COMPUTED-18V0.
149500     MOVE     111111111111111111 TO CORRECT-18V0.
149600     PERFORM  FAIL.
149700     GO TO COMP-WRITE-30.
149800 COMP-DELETE-30.
149900     PERFORM DE-LETE.
150000 COMP-WRITE-30.
150100     MOVE     "COMP-TEST-30" TO PAR-NAME.
150200     PERFORM  PRINT-DETAIL.
150300 COMP-TEST-31.
150400     MOVE   ZERO TO   TA--X.
150500     COMPUTE     TA--X  =  3 * A02TWOS-DU-02V00.
150600        IF TA--X = 66
150700              PERFORM PASS
150800              GO TO COMP-WRITE-31.
150900     MOVE       TA--X TO COMPUTED-N
151000     MOVE     66 TO CORRECT-N.
151100     PERFORM  FAIL.
151200     GO TO COMP-WRITE-31.
151300 COMP-DELETE-31.
151400     PERFORM DE-LETE.
151500 COMP-WRITE-31.
151600     MOVE     "COMP-TEST-31" TO PAR-NAME.
151700     PERFORM  PRINT-DETAIL.
151800 COMP-TEST-32.
151900     MOVE     ZERO TO WRK-DS-05V00.
152000     COMPUTE  WRK-DS-05V00 = A02TWOS-DU-02V00 / A02TWOS-DS-03V02.
152100        IF WRK-DS-05V00 = 1
152200              PERFORM PASS
152300              GO TO COMP-WRITE-32.
152400     MOVE     WRK-DS-05V00 TO COMPUTED-N.
152500     MOVE     1 TO CORRECT-N.
152600     PERFORM  FAIL.
152700     GO TO COMP-WRITE-32.
152800 COMP-DELETE-32.
152900     PERFORM DE-LETE.
153000 COMP-WRITE-32.
153100     MOVE     "COMP-TEST-32" TO PAR-NAME.
153200     PERFORM  PRINT-DETAIL.
153300 COMP-TEST-33.
153400     MOVE     ZERO TO WRK-DS-05V00.
153500     COMPUTE  WRK-DS-05V00 = 3 ** ATWO-DS-01V00.
153600        IF WRK-DS-05V00 = 9
153700              PERFORM PASS
153800              GO TO COMP-WRITE-33.
153900     MOVE     WRK-DS-05V00 TO COMPUTED-N.
154000     MOVE     9 TO CORRECT-N.
154100     PERFORM  FAIL.
154200     GO TO COMP-WRITE-33.
154300 COMP-DELETE-33.
154400              PERFORM DE-LETE.
154500 COMP-WRITE-33.
154600     MOVE     "COMP-TEST-33" TO PAR-NAME.
154700     PERFORM  PRINT-DETAIL.
154800 COMP-TEST-34.
154900     MOVE     ZERO TO WRK-DS-02V00.
155000     COMPUTE  WRK-DS-02V00 ROUNDED  = A99-DS-02V00
155100              +   AZERO-DS-05V05 - 2.5.
155200        IF WRK-DS-02V00 = 97
155300              PERFORM PASS
155400              GO TO COMP-WRITE-34.
155500     MOVE     WRK-DS-02V00 TO COMPUTED-N.
155600     MOVE     97 TO CORRECT-N.
155700     PERFORM  FAIL.
155800     GO TO COMP-WRITE-34.
155900 COMP-DELETE-34.
156000     PERFORM DE-LETE.
156100 COMP-WRITE-34.
156200     MOVE     "COMP-TEST-34" TO PAR-NAME.
156300     PERFORM  PRINT-DETAIL.
156400 COMP-TEST-35.
156500     MOVE     ZERO TO WRK-DS-02V00.
156600     COMPUTE  WRK-DS-02V00 = A99-DS-02V00 + AZERO-DS-05V05
156700              ON SIZE ERROR
156800              MOVE "SIZE ERR SHOULD NOT EXCUTE" TO RE-MARK
156900              PERFORM FAIL
157000              GO TO COMP-WRITE-35.
157100     PERFORM  PASS.
157200     GO       TO COMP-WRITE-35.
157300 COMP-DELETE-35.
157400     PERFORM  DE-LETE.
157500 COMP-WRITE-35.
157600     MOVE     "COMP-TEST-35" TO PAR-NAME.
157700     PERFORM  PRINT-DETAIL.
157800 COMP-TEST-36.
157900     IF       TEST-2NUC-COND-99
158000              PERFORM PASS
158100              GO TO COMP-WRITE-36.
158200*    NOTE     THIS TEST DEPENDS UPON THE RESULT OF COMP-TEST-35.
158300     MOVE     WRK-DS-02V00 TO COMPUTED-N.
158400     MOVE     99 TO CORRECT-N.
158500     PERFORM  FAIL.
158600     GO TO COMP-WRITE-36.
158700 COMP-DELETE-36.
158800     PERFORM DE-LETE.
158900 COMP-WRITE-36.
159000     MOVE     "COMP-TEST-36" TO PAR-NAME.
159100     PERFORM  PRINT-DETAIL.
159200 COMP-TEST-37.
159300     MOVE     ZERO TO WRK-DS-0201P.
159400     COMPUTE  WRK-DS-0201P ROUNDED = A05ONES-DS-05V00 / 5
159500              ON SIZE ERROR
159600              PERFORM PASS
159700              GO TO COMP-WRITE-37.
159800     MOVE     "ON SIZE ERROR NOT EXECUTED" TO RE-MARK.
159900     PERFORM  FAIL.
160000     GO TO COMP-WRITE-37.
160100 COMP-DELETE-37.
160200     PERFORM DE-LETE.
160300 COMP-WRITE-37.
160400     MOVE     "COMP-TEST-37" TO PAR-NAME.
160500     PERFORM  PRINT-DETAIL.
160600 COMP-TEST-38.
160700        IF WRK-DS-0201P = ZERO
160800              PERFORM PASS
160900              GO TO COMP-WRITE-38.
161000*    NOTE     THIS TEST DEPENDS UPON THE RESULT OF COMP-TEST-37.
161100     MOVE     WRK-DS-0201P TO COMPUTED-N.
161200     MOVE     ZERO TO CORRECT-N.
161300     PERFORM  FAIL.
161400     GO TO COMP-WRITE-38.
161500 COMP-DELETE-38.
161600     PERFORM DE-LETE.
161700 COMP-WRITE-38.
161800     MOVE     "COMP-TEST-38" TO PAR-NAME.
161900     PERFORM  PRINT-DETAIL.
162000 COMP-TEST-39-42.
162100     MOVE SPACES TO TEST-RESULTS.
162200     MOVE "NOT USED" TO RE-MARK.
162300     MOVE "COMP-TEST-39" TO PAR-NAME.
162400     PERFORM PRINT-DETAIL.
162500     MOVE "NOT USED" TO RE-MARK.
162600     MOVE "COMP-TEST-40" TO PAR-NAME.
162700     PERFORM PRINT-DETAIL.
162800     MOVE "NOT USED" TO RE-MARK.
162900     MOVE "COMP-TEST-41" TO PAR-NAME.
163000     PERFORM PRINT-DETAIL.
163100     MOVE "NOT USED" TO RE-MARK.
163200     MOVE "COMP-TEST-42" TO PAR-NAME.
163300     PERFORM PRINT-DETAIL.
163400     MOVE "COMPUTE" TO FEATURE.
163500 COMP-TEST-43.
163600     MOVE    ZEROS TO WHOLE-FIELD.
163700     COMPUTE WHOLE-FIELD =
163800     (1 + (2 - (3 + (4 - (5 + (6 - (7 + (8 - (9 + (10 -
163900     EVEN-NAME1)))))))))).
164000     IF (WHOLE-FIELD < 10.0002) AND
164100        (WHOLE-FIELD > 9.9998) PERFORM PASS
164200         GO TO COMP-WRITE-43.
164300     MOVE WHOLE-FIELD TO COMPUTED-18V0.
164400     MOVE 10 TO CORRECT-18V0.
164500     PERFORM FAIL.
164600     GO TO COMP-WRITE-43.
164700 COMP-DELETE-43.
164800     PERFORM DE-LETE.
164900 COMP-WRITE-43.
165000     MOVE "COMP-TEST-43" TO PAR-NAME.
165100     PERFORM PRINT-DETAIL.
165200 COMP-TEST-44.
165300     MOVE    ZEROS TO WHOLE-FIELD.
165400     COMPUTE  WHOLE-FIELD =
165500     (ONE + (TWO - (THREE + (FOUR - (FIVE + (SIX - (SEVEN +
165600         (EIGHT - (NINE + (TEN - EVEN-NAME1)))))))))).
165700        IF WHOLE-FIELD = 10    PERFORM PASS
165800         GO TO COMP-WRITE-44.
165900     MOVE WHOLE-FIELD TO COMPUTED-18V0.
166000     MOVE 10 TO CORRECT-18V0.
166100     PERFORM FAIL.
166200     GO TO COMP-WRITE-44.
166300 COMP-DELETE-44.
166400     PERFORM DE-LETE.
166500 COMP-WRITE-44.
166600     MOVE "COMP-TEST-44" TO PAR-NAME.
166700     PERFORM PRINT-DETAIL.
166800 COMP-INT-045.
166900     MOVE    "COMPUTE SERIES"  TO FEATURE.
167000     MOVE    "COMP-TEST-045"  TO PAR-NAME.
167100 COMP-TEST-045.
167200     COMPUTE  WRK-DS-05V00-0002
167300              WRK-DS-04V01-0005   ROUNDED
167400              WRK-DS-03V04-0003F-0014  (2, 2, 2) =  174 / 16.
167500*
167600*    IDENTIFIER SERIES  -  WITH AND WITHOUT ROUNDED  -
167700*             SUBSCRIPTED DATA ITEM.
167800*
167900     MOVE "COMP-TEST-045-1" TO PAR-NAME.
168000        IF WRK-DS-05V00-0002 NOT = 10
168100              MOVE      +00010  TO  CORRECT-N
168200              MOVE     WRK-DS-05V00-0002   TO COMPUTED-N
168300              PERFORM COMP-WRITE-045 GO TO COMP-TEST-045-2.
168400     PERFORM PASS.  PERFORM COMP-WRITE-045.
168500 COMP-TEST-045-2.
168600     MOVE "COMP-TEST-045-2" TO PAR-NAME.
168700     IF (WRK-DS-04V01-0005 > 10.9002180) OR
168800        (WRK-DS-04V01-0005 < 10.8997820) PERFORM FAIL
168900              MOVE +10.9 TO CORRECT-N
169000              MOVE WRK-DS-04V01-0005 TO COMPUTED-N
169100              PERFORM COMP-WRITE-045 GO TO COMP-TEST-045-3.
169200     PERFORM PASS.  PERFORM COMP-WRITE-045.
169300 COMP-TEST-045-3.
169400     MOVE "COMP-TEST-045-3" TO PAR-NAME.
169500     IF (WRK-DS-03V04-0003F-0014 (2, 2, 2) > 10.87521750) OR
169600        (WRK-DS-03V04-0003F-0014 (2, 2, 2) < 10.87479250)
169700             PERFORM FAIL MOVE +010.8750 TO CORRECT-N
169800             MOVE WRK-DS-03V04-0003F-0014 (2, 2, 2) TO COMPUTED-N
169900             GO TO COMP-WRITE-045.
170000     PERFORM PASS.
170100     GO TO      COMP-WRITE-045.
170200 COMP-DELETE-045.
170300     PERFORM  DE-LETE.
170400 COMP-WRITE-045.
170500     PERFORM  PRINT-DETAIL.
170600 COMP-TEST-045-EXIT.
170700     EXIT.
170800 CCVS-EXIT SECTION.
170900 CCVS-999999.
171000     GO TO CLOSE-FILES.
