000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     OBIC1A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*        THE MAIN PROGRAM IC218 CALLS THE SUBPROGRAM IC219 WHICH
002300*    CONTAINS A SORT STATEMENT AND A STOP RUN STATEMENT.  THE
002400*    PURPOSE OF THESE PROGRAMS IS TO VERIFY THAT A SORT STATEMENT
002500*    FUNCTIONS CORRECTLY IN A SUBPROGRAM.  THE FIRST NON-DECLARA-
002600*    TIVE PORTION OF THE SUBPROGRAM, THE SORT INPUT PROCEDURE AND
002700*    THE SORT OUTPUT PROCEDURE ARE CONTAINED IN DIFFERENT SUBPRO-
002800*    GRAM SEGMENTS.
002900*
003000*        A CALL IS MADE TO THE SUBPROGRAM IC219.  CONTROL SHOULD
003100*    NOT BE RETURNED TO THIS PROGRAM SINCE IC219 CONTAINS A STOP
003200*    RUN STATEMENT.  THE SUBPROGRAM IC220 CONTAINS THE PRINTER FD
003300*    AND PRINTS OUT THE REPORT SHOWING THE TEST RESULTS.
003400*
003500*    REFERENCE - AMERICAN NATIONAL STANDARD PROGRAMMING LANGUAGE
003600*                COBOL, X3.23-1985
003700*
003800******************************************************************
003900 ENVIRONMENT DIVISION.
004000 CONFIGURATION SECTION.
004100 SOURCE-COMPUTER.
004200     XXXXX082.
004300 OBJECT-COMPUTER.
004400     XXXXX083.
004500 DATA DIVISION.
004600 WORKING-STORAGE SECTION.
004700 01  SORT-LINK               PICTURE 9.
004800 01  PRINT-LINE-VALUES.
004900     02  PASS-OR-FAIL        PICTURE X(5).
005000     02  R-COUNT             PICTURE 99.
005100     02  FEATURE-TESTED      PICTURE X(20).
005200     02  COMPUTED-SORT-KEY   PICTURE X(20).
005300     02  CORRECT-SORT-KEY    PICTURE X(20).
005400     02  PARAGRAPH-NAME      PICTURE X(12).
005500 01  PRINT-FLAG              PICTURE 9.
005600 PROCEDURE DIVISION.
005700 SECT-IC218-0001 SECTION.
005800 CALL-IC219.
005900     MOVE 0 TO SORT-LINK.
006000     CALL "OBIC2A" USING SORT-LINK.
006100 CALL-FAIL.
006200*
006300*    CONTROL SHOULD NOT RETURN TO THE MAIN PROGRAM FROM THE SUB-
006400*    PROGRAM SINCE THE SUBPROGRAM CONTAINS A STOP RUN STATEMENT.
006500*
006600     MOVE 2 TO PRINT-FLAG.
006700     MOVE "CALL-MAIN-IC" TO PARAGRAPH-NAME.
006800     MOVE "CONTROL RETURNED" TO FEATURE-TESTED.
006900     MOVE "FAIL " TO PASS-OR-FAIL.
007000     MOVE 0 TO R-COUNT.
007100     MOVE SORT-LINK TO COMPUTED-SORT-KEY.
007200     MOVE SPACE TO CORRECT-SORT-KEY.
007300     CALL "OBIC3A" USING PRINT-LINE-VALUES  PRINT-FLAG.
007400     MOVE 3 TO PRINT-FLAG.
007500     CALL "OBIC3A" USING PRINT-LINE-VALUES  PRINT-FLAG.
007600*
007700*        NO STOP RUN STATEMENT APPEARS IN THIS PROGRAM.
007800*
007900 END-OF-PROGRAM.
008000     EXIT PROGRAM.
