000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     OBNC2M.
000400
000500****************************************************************
000600*                                                              *
000700*    VALIDATION FOR:-                                          *
000800*                                                              *
000900*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
001000*                                                              *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-82  - SOURCE COMPUTER NAME.                         *
001900*        X-83  - OBJECT COMPUTER NAME.                         *
002000*                                                              *
002100****************************************************************
002200*    PROGRAM OBNC2M CONTAINS CCVS74 TESTS OF LANGUAGE ELEMENTS *
002300*    DEFINED AS OBSOLETE IN THE 198X STANDARDS.                *
002400****************************************************************
002500 DATE-COMPILED.
002600*    THIS COMMENT LINE SHOULD NOT BE REPLACED
002700*    THIS COMMENT ENTRY SHOULD APPEAR AS THE LAST LINE BEFORE
002800*    THE ENVIRONMENT DIVISION.
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.
003200     XXXXX082.
003300 OBJECT-COMPUTER.
003400     XXXXX083.
003500 INPUT-OUTPUT SECTION.
003600 FILE-CONTROL.
003700     SELECT PRINT-FILE ASSIGN TO
003800     XXXXX055.
003900 DATA DIVISION.
004000 FILE SECTION.
004100 FD  PRINT-FILE.
004200 01  PRINT-REC PICTURE X(120).
004300 01  DUMMY-RECORD PICTURE X(120).
004400 WORKING-STORAGE SECTION.
004500 77  SMALL-VALU   PICTURE 99 VALUE 7.
004600 77  SMALLER-VALU PICTURE 99 VALUE 6.
004700 77  SMALLEST-VALU   PICTURE 99 VALUE 5.
004800 77  EVEN-SMALLER PICTURE 99 VALUE 1.
004900 77  WRK-DS-02V00                 PICTURE S99.
005000     88 TEST-2NUC-COND-99         VALUE 99.
005100 77  WRK-DS-06V06     PICTURE S9(6)V9(6).
005200 77  WRK-DS-12V00-S REDEFINES WRK-DS-06V06
005300                                  PICTURE S9(12).
005400 77  A02TWOS-DS-02V00             PICTURE S99    VALUE 22.
005500 77  WRK-DS-01V00                 PICTURE S9.
005600 77  A02TWOS-DS-03V02             PICTURE S999V99 VALUE +022.00.
005700 77  A990-DS-0201P                PICTURE S99P   VALUE 990.
005800 77  A02ONES-DS-02V00             PICTURE S99    VALUE 11.
005900 77  A01ONE-DS-P0801              PICTURE SP(8)9 VALUE .000000001.
006000 77  ATWO-DS-01V00                PICTURE S9     VALUE 2.
006100 77  WRK-XN-00001                 PICTURE X.
006200 77  WRK-XN-00005                 PICTURE X(5).
006300 77  TWO  PICTURE 9 VALUE 2.
006400 77  THREE PICTURE 9 VALUE 3.
006500 77  SEVEN PICTURE 9 VALUE 7.
006600 77  NINE  PICTURE 9 VALUE 9.
006700 77  TEN  PICTURE 99 VALUE 10.
006800 77  ALTERCOUNT PICTURE 999 VALUE ZERO.
006900 77  QT5    PIC X(4) VALUE SPACE.
007000 77  XRAY PICTURE IS X.
007100 77  IF-D1 PICTURE S9(4)V9(2) VALUE 0.
007200 77  IF-D2 PICTURE S9(4)V9(2) VALUE ZERO.
007300 77  IF-D3 PICTURE X(10) VALUE "0000000000".
007400 77  IF-D4 PICTURE X(15) VALUE "               ".
007500 77  IF-D5 PICTURE X(10) VALUE ALL QUOTE.
007600 77  IF-D6 PICTURE A(10) VALUE "BABABABABA".
007700 77  IF-D7 PICTURE S9(6)V9(4) VALUE +123.45.
007800 77  IF-D8 PICTURE 9(6)V9(4) VALUE 12300.
007900 77  IF-D9 PICTURE X(3) VALUE "123".
008000 77  IF-D11 PICTURE X(6) VALUE "ABCDEF".
008100 77  IF-D13 PICTURE 9(6)V9(4) VALUE 12300.
008200 77  IF-D14 PICTURE S9(4)V9(2) VALUE +123.45.
008300 77  IF-D15 PICTURE S999PP VALUE 12300.
008400 77  IF-D16 PICTURE PP99 VALUE .0012.
008500 77  IF-D17 PICTURE SV9(4) VALUE .0012.
008600 77  IF-D18 PICTURE X(10) VALUE "BABABABABA".
008700 77  IF-D19 PICTURE X(10) VALUE "ABCDEF    ".
008800 77  IF-D23 PICTURE $9,9B9.90+.
008900 77  IF-D24 PICTURE X(10) VALUE "$1,2 3.40+".
009000 77  IF-D25 PICTURE ABABX0A.
009100 77  IF-D26 PICTURE X(8) VALUE "A C D0E".
009200 77  IF-D27 PICTURE IS 9(6)V9(4) VALUE IS 2137.45
009300     USAGE IS COMPUTATIONAL.
009400 77  IF-D28 PICTURE IS 999999V9999 VALUE IS 2137.45.
009500 77  IF-D31 PICTURE S9(6) VALUE -123.
009600 77  IF-D32 PICTURE S9(4)V99.
009700     88  A  VALUE 1.
009800     88  B VALUES ARE 2 THRU 4.
009900     88  C VALUE IS ZERO.
010000     88  D VALUE IS +12.34.
010100     88  E  VALUE IS .01, .11, .21 .81.
010200     88  F  VALUE IS 100 THRU 128 1000 THRU 1280 -9 THRU -2.
010300     88  G  VALUE IS 8765.43 1234 THRU 5678 5 -9999 THRU 10.
010400 77  IF-D33 PICTURE X(4).
010500     88  B   VALUE QUOTE.
010600     88  C   VALUE SPACE.
010700     88 D VALUE ALL "BAC".
010800 77  IF-D34 PICTURE A(4).
010900     88  B VALUE "A A ".
011000 77  IF-D37 PICTURE 9(5) VALUE 12345.
011100 77  IF-D38 PICTURE X(9) VALUE "12345    ".
011200 77  CCON-1 PICTURE 99 VALUE 11.
011300 77  CCON-2 PICTURE 99 VALUE 12.
011400 77  CCON-3 PICTURE 99 VALUE 13.
011500 77  COMP-SGN1  PICTURE S9(1) VALUE +9 COMPUTATIONAL.
011600 77  COMP-SGN2  PICTURE S9(18) VALUE +3 COMPUTATIONAL.
011700 77  COMP-SGN3  PICTURE S9(1) VALUE -5 COMPUTATIONAL.
011800 77  COMP-SGN4  PICTURE S9(18) VALUE -3167598765431 COMPUTATIONAL.
011900 77  START-POINT        PICTURE 9(6) COMPUTATIONAL.
012000 77  INC-VALUE          PICTURE 9(6) COMPUTATIONAL.
012100 77  SWITCH-PFM-1 PICTURE 9 VALUE ZERO.
012200 77  SWITCH-PFM-2 PICTURE 9 VALUE ZERO.
012300 77  PFM-11-COUNTER PICTURE 999 VALUE ZERO.
012400 77  PFM-12-COUNTER  PICTURE 999 VALUE 100.
012500 77  PFM-12-ANS1  PICTURE 999 VALUE ZERO.
012600 77  PFM-12-ANS2  PICTURE 999 VALUE ZERO.
012700 01  SUBSCRIPT-6 PICTURE 99999 VALUE ZERO.
012800 01  IF-TABLE.
012900     02 IF-ELEM PICTURE X OCCURS 12 TIMES.
013000 01  QUOTE-DATA.
013100     02 QU-1 PICTURE X(3) VALUE "123".
013200     02 QU-2 PICTURE X VALUE QUOTE.
013300     02 QU-3 PICTURE X(6) VALUE "ABC456".
013400 01  IF-D10.
013500     02  D1 PICTURE X(2) VALUE "01".
013600     02  D2 PICTURE X(2) VALUE "23".
013700     02  D3.
013800     03  D4 PICTURE X(4) VALUE "4567".
013900     03 D5 PICTURE X(4) VALUE "8912".
014000 01  IF-D12.
014100     02  D1 PICTURE X(3) VALUE "ABC".
014200     02  D2.
014300     03  D3.
014400     04  D4      PICTURE XX     VALUE "DE".
014500     04  D5 PICTURE X VALUE "F".
014600 01  IF-D20.
014700     02  FILLER    PICTURE 9(5)   VALUE ZERO.
014800     02  D1 PICTURE 9(2) VALUE 12.
014900     02  D2 PICTURE 9 VALUE 3.
015000     02  D3 PICTURE 9(2) VALUE 45.
015100 01  IF-D21.
015200     02  D1 PICTURE 9(5) VALUE ZEROS.
015300     02  D2 PICTURE 9(5) VALUE 12345.
015400 01  IF-D22.
015500     02  D1 PICTURE A(2) VALUE "AB".
015600     02  D2 PICTURE A(4) VALUE "CDEF".
015700 01  IF-D35.
015800     02  AA PICTURE X(2).
015900     88  A1 VALUE "AA".
016000     88  A2 VALUE "AB".
016100     02  BB PICTURE IS X(2).
016200     88  B1 VALUE "CC".
016300     88  B2 VALUE "CD".
016400     02 BB-2 REDEFINES BB.
016500     03  AAA PICTURE X.
016600     88  AA1 VALUE "A".
016700     88  AA2 VALUE "C".
016800     03  BBB PICTURE X.
016900     88  BB1    VALUE "B".
017000     88  BB2 VALUE "D".
017100 01  IF-D36  PICTURE X(120) VALUE IS    "ABCDEFGHIJKLMNOPQRSTUVWXY
017200-    "Z1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLM
017300-    "NOPQRSTUVWXYZ1234567890ABCDEFGHIJKL".
017400 01  IF-D40 PICTURE 9(5) VALUE 12345
017500              COMPUTATIONAL SYNCHRONIZED RIGHT.
017600     88 IF-D40A VALUE ZERO THRU 10000.
017700     88 IF-D40B VALUE 10001 THRU 99999.
017800     88 IF-D40C VALUE 99999.
017900 01  PERFORM1  PICTURE XXX  VALUE SPACES.
018000 01  PERFORM2  PICTURE S999 VALUE 20.
018100 01  PERFORM3  PICTURE  9  VALUE  5.
018200 01  PERFORM4  PICTURE S99V9.
018300 01  PERFORM5  PICTURE S99V9  VALUE 10.0.
018400 01  PERFORM6  PICTURE  99V9.
018500 01  PERFORM7.
018600     02  PERFORM8  OCCURS 7 TIMES  PICTURE  99V9.
018700 01  PERFORM9  PICTURE 9   VALUE 3.
018800 01  PERFORM10  PICTURE  S9  VALUE -1.
018900 01  PERFORM11  PICTURE  99  VALUE 6.
019000 01  PERFORM12.
019100     02 PERFORM13  OCCURS 4 TIMES.
019200         03 PERFORM14  OCCURS 20 TIMES  PICTURE  99V9.
019300         03 PERFORM15  OCCURS 10 TIMES.
019400             04 PERFORM16  OCCURS 5 TIMES  PICTURE 99V9.
019500 01  PERFORM17          PICTURE 9(6) COMPUTATIONAL.
019600 01  PERFORM18          PICTURE 9(6) COMPUTATIONAL.
019700 01  PERFORM-KEY  PICTURE 9.
019800 01  PERFORM-SEVEN-LEVEL-TABLE.
019900   03   PFM71                OCCURS 2.
020000     05  PFM72               OCCURS 2.
020100       07  PFM73             OCCURS 2.
020200         09  PFM74           OCCURS 2.
020300           11  PFM75         OCCURS 2.
020400             13  PFM76       OCCURS 2.
020500               15  PFM77     OCCURS 2.
020600                 17  PFM77-1 PIC X.
020700 01  S1                      PIC S9(3) COMP.
020800 01  S2                      PIC S9(3) COMP.
020900 01  S3                      PIC S9(3) COMP.
021000 01  S4                      PIC S9(3) COMP.
021100 01  S5                      PIC S9(3) COMP.
021200 01  S6                      PIC S9(3) COMP.
021300 01  S7                      PIC S9(3) COMP.
021400 01  PFM-7-TOT               PIC S9(3) COMP.
021500 01  PFM-F4-24-TOT           PIC S9(3) COMP.
021600 01  PFM-A                   PIC S9(3) COMP.
021700 01  PFM-B                   PIC S9(3) COMP.
021800 01  FILLER-A.
021900   03  PFM-F4-25-A           PIC S9(3) COMP OCCURS 10.
022000 01  FILLER-B.
022100   03  PFM-F4-25-B           PIC S9(3) COMP OCCURS 10.
022200 01  FILLER-C.
022300   03  PFM-F4-25-C           PIC S9(3) COMP OCCURS 10.
022400 01  RECEIVING-TABLE.
022500     03 TBL-ELEMEN-A.
022600         05 TBL-ELEMEN-B          PICTURE X(18).
022700         05 TBL-ELEMEN-C          PICTURE X(18).
022800     03  TBL-ELEMEN-D.
022900         05 TBL-ELEMEN-E          PICTURE X OCCURS 36 TIMES.
023000 01  LITERAL-SPLITTER.
023100     02 PART1                     PICTURE X(20).
023200     02 PART2                     PICTURE X(20).
023300     02 PART3                     PICTURE X(20).
023400     02 PART4                     PICTURE X(20).
023500 01  LITERAL-TABLE REDEFINES LITERAL-SPLITTER.
023600     02 80PARTS                   PICTURE X      OCCURS 80 TIMES.
023700 01  GRP-FOR-88-LEVELS.
023800     03 WRK-DS-02V00-COND         PICTURE 99.
023900         88 COND-1                VALUE IS 01 THRU 05.
024000         88 COND-2                VALUES ARE 06 THRU 10
024100                                           16 THRU 20  00.
024200         88 COND-3                VALUES 11 THRU 15.
024300 01  GRP-MOVE-CONSTANTS.
024400     03 GRP-GROUP-MOVE-FROM.
024500         04 GRP-ALPHABETIC.
024600             05 ALPHABET-AN-00026 PICTURE A(26)
024700                        VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
024800         04 GRP-NUMERIC.
024900             05 DIGITS-DV-10V00   PICTURE 9(10) VALUE 0123456789.
025000         05 DIGITS-DU-06V04-S REDEFINES DIGITS-DV-10V00
025100                                  PICTURE 9(6)V9999.
025200         04 GRP-ALPHANUMERIC.
025300             05 ALPHANUMERIC-XN-00049 PICTURE X(50)
025400     VALUE  "ABCDEFGHIJKLMNOPQRSTUVWXYZ+-><=l,;.()/* 0123456789".
025500             05 FILLER                PICTURE X  VALUE QUOTE.
025600 01  GRP-FOR-2N058.
025700     02 SUB-GRP-FOR-2N058-A.
025800         03 ELEM-FOR-2N058-A PICTURE 999  VALUE ZEROES.
025900         03 ELEM-FOR-2N058-B PICTURE XXX  VALUE ZEROS.
026000         03 ELEM-FOR-2N058-C PICTURE XXX  VALUE SPACES.
026100         03 ELEM-FOR-2N058-D PICTURE X(6) VALUE ALL "ABC".
026200         03 ELEM-FOR-2N058-E PICTURE XXX  VALUE ALL "Z".
026300         03 ELEM-FOR-2N058-F PICTURE XXX  VALUE ALL SPACES.
026400         03 ELEM-FOR-2N058-G PICTURE XXX  VALUE ALL ZEROES.
026500         03 ELEM-FOR-2N058-H PICTURE 999  VALUE ALL ZEROS.
026600         03 ELEM-FOR-2N058-I PICTURE XXX  VALUE QUOTES.
026700         03 ELEM-FOR-2N058-J PICTURE XXX  VALUE ALL QUOTES.
026800         03 ELEM-FOR-2N058-K PICTURE XXX  VALUE ALL HIGH-VALUES.
026900         03 ELEM-FOR-2N058-L PICTURE XXX  VALUE ALL LOW-VALUES.
027000         03 ELEM-FOR-2N058-M PICTURE XXX  VALUE HIGH-VALUES.
027100         03 ELEM-FOR-2N058-N PICTURE XXX  VALUE LOW-VALUES.
027200     02 SUB-GRP-FOR-2N058-B.
027300         03 SUB-SUB-BA.
027400             04 ELEM-FOR-2N058-A  PICTURE 999.
027500             04 ELEM-FOR-2N058-B  PICTURE XXX.
027600             04 ELEM-FOR-2N058-C  PICTURE XXX.
027700             04 ELEM-FOR-2N058-D  PICTURE X(6).
027800         03 SUB-SUB-BB.
027900             04 ELEM-FOR-2N058-E  PICTURE XXX.
028000             04 ELEM-FOR-2N058-F  PICTURE XXX.
028100             04 ELEM-FOR-2N058-G  PICTURE XXX.
028200             04 ELEM-FOR-2N058-H  PICTURE 999.
028300         03 SUB-SUB-BC.
028400             04 ELEM-FOR-2N058-I  PICTURE XXX.
028500             04 ELEM-FOR-2N058-J  PICTURE XXX.
028600             04 ELEM-FOR-2N058-K  PICTURE XXX.
028700             04 ELEM-FOR-2N058-L  PICTURE XXX.
028800             04 ELEM-FOR-2N058-M  PICTURE XXX.
028900             04 ELEM-FOR-2N058-N  PICTURE XXX.
029000 01  CHARACTER-BREAKDOWN-S.
029100     02   FIRST-20S PICTURE X(20).
029200     02  SECOND-20S PICTURE X(20).
029300     02   THIRD-20S PICTURE X(20).
029400     02  FOURTH-20S PICTURE X(20).
029500     02   FIFTH-20S PICTURE X(20).
029600     02   SIXTH-20S PICTURE X(20).
029700     02 SEVENTH-20S PICTURE X(20).
029800     02  EIGHTH-20S PICTURE X(20).
029900     02   NINTH-20S PICTURE X(20).
030000     02   TENTH-20S PICTURE X(20).
030100 01  CHARACTER-BREAKDOWN-R.
030200     02   FIRST-20R PICTURE X(20).
030300     02  SECOND-20R PICTURE X(20).
030400     02   THIRD-20R PICTURE X(20).
030500     02  FOURTH-20R PICTURE X(20).
030600     02   FIFTH-20R PICTURE X(20).
030700     02   SIXTH-20R PICTURE X(20).
030800     02 SEVENTH-20R PICTURE X(20).
030900     02  EIGHTH-20R PICTURE X(20).
031000     02   NINTH-20R PICTURE X(20).
031100     02   TENTH-20R PICTURE X(20).
031200 01  TABLE-80.
031300     02  ELMT OCCURS 3 TIMES PIC 9.
031400     88  A80  VALUES ARE ZERO THRU 7.
031500     88  B80  VALUE 8.
031600     88  C80  VALUES ARE 7, 8 THROUGH 9.
031700
031800 01  TABLE-86.
031900     88  A86  VALUE "ABC".
032000     88  B86  VALUE "ABCABC".
032100     88  C86  VALUE "   ABC".
032200     02  DATANAME-86  PIC XXX  VALUE "ABC".
032300     02  DNAME-86.
032400         03  FILLER  PIC X  VALUE "A".
032500         03  FILLER  PIC X  VALUE "B".
032600         03  FILLER  PIC X   VALUE "C".
032700 01  FIGCON-DATA.
032800     02 SPACE-X         PICTURE X(10) VALUE "          ".
032900     02 QUOTE-X         PICTURE X(5)  VALUE QUOTE.
033000     02 LOW-VAL         PICTURE X(5)  VALUE LOW-VALUE.
033100     02 ABC PICTURE XXX VALUE "ABC".
033200     02 ONE23           PICTURE 9999  VALUE 123.
033300     02 ZERO-C          PICTURE 9(10) VALUE 0 COMPUTATIONAL.
033400     02 ZERO-D          PICTURE 9     VALUE ZERO USAGE DISPLAY.
033500 01  TEST-RESULTS.
033600     02 FILLER                   PIC X      VALUE SPACE.
033700     02 FEATURE                  PIC X(20)  VALUE SPACE.
033800     02 FILLER                   PIC X      VALUE SPACE.
033900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
034000     02 FILLER                   PIC X      VALUE SPACE.
034100     02  PAR-NAME.
034200       03 FILLER                 PIC X(19)  VALUE SPACE.
034300       03  PARDOT-X              PIC X      VALUE SPACE.
034400       03 DOTVALUE               PIC 99     VALUE ZERO.
034500     02 FILLER                   PIC X(8)   VALUE SPACE.
034600     02 RE-MARK                  PIC X(61).
034700 01  TEST-COMPUTED.
034800     02 FILLER                   PIC X(30)  VALUE SPACE.
034900     02 FILLER                   PIC X(17)  VALUE
035000            "       COMPUTED=".
035100     02 COMPUTED-X.
035200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
035300     03 COMPUTED-N               REDEFINES COMPUTED-A
035400                                 PIC -9(9).9(9).
035500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
035600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
035700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
035800     03       CM-18V0 REDEFINES COMPUTED-A.
035900         04 COMPUTED-18V0                    PIC -9(18).
036000         04 FILLER                           PIC X.
036100     03 FILLER PIC X(50) VALUE SPACE.
036200 01  TEST-CORRECT.
036300     02 FILLER PIC X(30) VALUE SPACE.
036400     02 FILLER PIC X(17) VALUE "       CORRECT =".
036500     02 CORRECT-X.
036600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
036700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
036800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
036900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
037000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
037100     03      CR-18V0 REDEFINES CORRECT-A.
037200         04 CORRECT-18V0                     PIC -9(18).
037300         04 FILLER                           PIC X.
037400     03 FILLER PIC X(2) VALUE SPACE.
037500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
037600 01  CCVS-C-1.
037700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
037800-    "SS  PARAGRAPH-NAME
037900-    "       REMARKS".
038000     02 FILLER                     PIC X(20)    VALUE SPACE.
038100 01  CCVS-C-2.
038200     02 FILLER                     PIC X        VALUE SPACE.
038300     02 FILLER                     PIC X(6)     VALUE "TESTED".
038400     02 FILLER                     PIC X(15)    VALUE SPACE.
038500     02 FILLER                     PIC X(4)     VALUE "FAIL".
038600     02 FILLER                     PIC X(94)    VALUE SPACE.
038700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
038800 01  REC-CT                        PIC 99       VALUE ZERO.
038900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
039000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
039100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
039200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
039300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
039400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
039500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
039600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
039700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
039800 01  CCVS-H-1.
039900     02  FILLER                    PIC X(39)    VALUE SPACES.
040000     02  FILLER                    PIC X(42)    VALUE
040100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
040200     02  FILLER                    PIC X(39)    VALUE SPACES.
040300 01  CCVS-H-2A.
040400   02  FILLER                        PIC X(40)  VALUE SPACE.
040500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
040600   02  FILLER                        PIC XXXX   VALUE
040700     "4.2 ".
040800   02  FILLER                        PIC X(28)  VALUE
040900            " COPY - NOT FOR DISTRIBUTION".
041000   02  FILLER                        PIC X(41)  VALUE SPACE.
041100
041200 01  CCVS-H-2B.
041300   02  FILLER                        PIC X(15)  VALUE
041400            "TEST RESULT OF ".
041500   02  TEST-ID                       PIC X(9).
041600   02  FILLER                        PIC X(4)   VALUE
041700            " IN ".
041800   02  FILLER                        PIC X(12)  VALUE
041900     " HIGH       ".
042000   02  FILLER                        PIC X(22)  VALUE
042100            " LEVEL VALIDATION FOR ".
042200   02  FILLER                        PIC X(58)  VALUE
042300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
042400 01  CCVS-H-3.
042500     02  FILLER                      PIC X(34)  VALUE
042600            " FOR OFFICIAL USE ONLY    ".
042700     02  FILLER                      PIC X(58)  VALUE
042800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
042900     02  FILLER                      PIC X(28)  VALUE
043000            "  COPYRIGHT   1985 ".
043100 01  CCVS-E-1.
043200     02 FILLER                       PIC X(52)  VALUE SPACE.
043300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
043400     02 ID-AGAIN                     PIC X(9).
043500     02 FILLER                       PIC X(45)  VALUE SPACES.
043600 01  CCVS-E-2.
043700     02  FILLER                      PIC X(31)  VALUE SPACE.
043800     02  FILLER                      PIC X(21)  VALUE SPACE.
043900     02 CCVS-E-2-2.
044000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
044100         03 FILLER                   PIC X      VALUE SPACE.
044200         03 ENDER-DESC               PIC X(44)  VALUE
044300            "ERRORS ENCOUNTERED".
044400 01  CCVS-E-3.
044500     02  FILLER                      PIC X(22)  VALUE
044600            " FOR OFFICIAL USE ONLY".
044700     02  FILLER                      PIC X(12)  VALUE SPACE.
044800     02  FILLER                      PIC X(58)  VALUE
044900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
045000     02  FILLER                      PIC X(13)  VALUE SPACE.
045100     02 FILLER                       PIC X(15)  VALUE
045200             " COPYRIGHT 1985".
045300 01  CCVS-E-4.
045400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
045500     02 FILLER                       PIC X(4)   VALUE " OF ".
045600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
045700     02 FILLER                       PIC X(40)  VALUE
045800      "  TESTS WERE EXECUTED SUCCESSFULLY".
045900 01  XXINFO.
046000     02 FILLER                       PIC X(19)  VALUE
046100            "*** INFORMATION ***".
046200     02 INFO-TEXT.
046300       04 FILLER                     PIC X(8)   VALUE SPACE.
046400       04 XXCOMPUTED                 PIC X(20).
046500       04 FILLER                     PIC X(5)   VALUE SPACE.
046600       04 XXCORRECT                  PIC X(20).
046700     02 INF-ANSI-REFERENCE           PIC X(48).
046800 01  HYPHEN-LINE.
046900     02 FILLER  PIC IS X VALUE IS SPACE.
047000     02 FILLER  PIC IS X(65)    VALUE IS "************************
047100-    "*****************************************".
047200     02 FILLER  PIC IS X(54)    VALUE IS "************************
047300-    "******************************".
047400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
047500     "OBNC2M".
047600 PROCEDURE DIVISION.
047700 CCVS1 SECTION.
047800 OPEN-FILES.
047900     OPEN     OUTPUT PRINT-FILE.
048000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
048100     MOVE    SPACE TO TEST-RESULTS.
048200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
048300     GO TO CCVS1-EXIT.
048400 CLOSE-FILES.
048500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
048600 TERMINATE-CCVS.
048700S    EXIT PROGRAM.
048800STERMINATE-CALL.
048900     STOP     RUN.
049000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
049100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
049200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
049300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
049400     MOVE "****TEST DELETED****" TO RE-MARK.
049500 PRINT-DETAIL.
049600     IF REC-CT NOT EQUAL TO ZERO
049700             MOVE "." TO PARDOT-X
049800             MOVE REC-CT TO DOTVALUE.
049900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
050000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
050100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
050200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
050300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
050400     MOVE SPACE TO CORRECT-X.
050500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
050600     MOVE     SPACE TO RE-MARK.
050700 HEAD-ROUTINE.
050800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
051100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
051200 COLUMN-NAMES-ROUTINE.
051300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
051400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
051600 END-ROUTINE.
051700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
051800 END-RTN-EXIT.
051900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052000 END-ROUTINE-1.
052100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
052200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
052300      ADD PASS-COUNTER TO ERROR-HOLD.
052400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
052500      MOVE PASS-COUNTER TO CCVS-E-4-1.
052600      MOVE ERROR-HOLD TO CCVS-E-4-2.
052700      MOVE CCVS-E-4 TO CCVS-E-2-2.
052800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
052900  END-ROUTINE-12.
053000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
053100     IF       ERROR-COUNTER IS EQUAL TO ZERO
053200         MOVE "NO " TO ERROR-TOTAL
053300         ELSE
053400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
053500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
053600     PERFORM WRITE-LINE.
053700 END-ROUTINE-13.
053800     IF DELETE-COUNTER IS EQUAL TO ZERO
053900         MOVE "NO " TO ERROR-TOTAL  ELSE
054000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
054100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
054200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054300      IF   INSPECT-COUNTER EQUAL TO ZERO
054400          MOVE "NO " TO ERROR-TOTAL
054500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
054600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
054700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054900 WRITE-LINE.
055000     ADD 1 TO RECORD-COUNT.
055100Y    IF RECORD-COUNT GREATER 50
055200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
055300Y        MOVE SPACE TO DUMMY-RECORD
055400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
055500Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
055600Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
055700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
055800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
055900Y        MOVE ZERO TO RECORD-COUNT.
056000     PERFORM WRT-LN.
056100 WRT-LN.
056200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
056300     MOVE SPACE TO DUMMY-RECORD.
056400 BLANK-LINE-PRINT.
056500     PERFORM WRT-LN.
056600 FAIL-ROUTINE.
056700     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
056800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
056900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
057000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
057100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
057200     MOVE   SPACES TO INF-ANSI-REFERENCE.
057300     GO TO  FAIL-ROUTINE-EX.
057400 FAIL-ROUTINE-WRITE.
057500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
057600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
057700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
057800     MOVE   SPACES TO COR-ANSI-REFERENCE.
057900 FAIL-ROUTINE-EX. EXIT.
058000 BAIL-OUT.
058100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
058200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
058300 BAIL-OUT-WRITE.
058400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
058500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
058600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
058700     MOVE   SPACES TO INF-ANSI-REFERENCE.
058800 BAIL-OUT-EX. EXIT.
058900 CCVS1-EXIT.
059000     EXIT.
059100 SECT-OBNC2M-001 SECTION.
059200*
059300 GO--TEST-1.
059400     ALTER GO--A TO PROCEED TO GO--C.
059500*    NOTE THE GO STATEMENT IN GO--A IS NOT LEGAL UNLESS IT IS
059600*        ALTERED AS SHOWN ABOVE BEFORE CONTROL PASSES TO IT.
059700     GO TO GO--A.
059800 GO--DELETE-1.
059900     PERFORM DE-LETE.
060000     GO TO GO--WRITE-1.
060100 GO--A.
060200     GO TO.
060300 GO--B.
060400     PERFORM FAIL.
060500     GO TO GO--WRITE-1.
060600 GO--C.
060700     PERFORM PASS.
060800 GO--WRITE-1.
060900     PERFORM END-ROUTINE.
061000     MOVE "UNFINISHED GO TO" TO FEATURE.
061100     MOVE "GO--TEST-1" TO PAR-NAME.
061200     PERFORM PRINT-DETAIL.
061300 ALTER-TEST-1.
061400     ALTER ALTER-A TO PROCEED TO ALTER-C
061500           ALTER-D TO PROCEED TO ALTER-F
061600           ALTER-F TO PROCEED TO ALTER-H.
061700     GO TO ALTER-A.
061800 ALTER-DELETE-1.
061900     PERFORM DE-LETE.
062000     GO TO ALTER-WRITE-1.
062100 ALTER-A.
062200     GO TO ALTER-B.
062300 ALTER-B.
062400     ADD 1 TO ALTERCOUNT.
062500     GO TO ALTER-FAIL-1.
062600 ALTER-C.
062700     PERFORM PASS.
062800 ALTER-D.
062900     GO TO ALTER-E.
063000 ALTER-E.
063100     ADD 10 TO ALTERCOUNT.
063200     GO TO ALTER-FAIL-1.
063300 ALTER-F.
063400     GO TO ALTER-G.
063500 ALTER-G.
063600     ADD 100 TO ALTERCOUNT.
063700     GO TO ALTER-FAIL-1.
063800 ALTER-H.
063900     GO TO ALTER-WRITE-1.
064000 ALTER-FAIL-1.
064100     MOVE ALTERCOUNT TO COMPUTED-N.
064200     MOVE ZERO TO CORRECT-N.
064300     PERFORM FAIL.
064400 ALTER-WRITE-1.
064500     PERFORM END-ROUTINE.
064600     MOVE "SERIES ALTER" TO FEATURE.
064700     MOVE "ALTER-TEST-1" TO PAR-NAME.
064800     PERFORM PRINT-DETAIL.
064900 ALTER-INIT-B.
065000     MOVE     "SERIES ALTER" TO FEATURE.
065100 ALTER-TEST-2.
065200     MOVE     ZERO TO SUBSCRIPT-6.
065300     MOVE     SPACE TO RECEIVING-TABLE.
065400 ALTER-TESTT-2.
065500     GO       TO ALTER-TESTTT-2.
065600 ALTER-A-2.
065700     GO       TO ALTER-C-2.
065800 ALTER-B-2.
065900     MOVE     "M" TO WRK-XN-00001.
066000     PERFORM  ALTER-G-2.
066100 ALTER-C-2.
066200     MOVE     "N" TO WRK-XN-00001.
066300     PERFORM  ALTER-G-2.
066400     MOVE     " " TO WRK-XN-00001.
066500     PERFORM  ALTER-G-2.
066600 ALTER-D-2.
066700     GO       TO ALTER-F-2.
066800 ALTER-E-2.
066900     MOVE     "O" TO WRK-XN-00001.
067000     PERFORM  ALTER-G-2.
067100 ALTER-F-2.
067200     MOVE     "P" TO WRK-XN-00001.
067300     PERFORM  ALTER-G-2.
067400     MOVE     " " TO WRK-XN-00001.
067500     PERFORM  ALTER-G-2.
067600 ALTER-G-2.
067700     ADD      1 TO SUBSCRIPT-6.
067800     MOVE     WRK-XN-00001 TO TBL-ELEMEN-E (SUBSCRIPT-6).
067900 ALTER-TESTTT-2.
068000     PERFORM  ALTER-A-2 THRU ALTER-F-2.
068100     ALTER    ALTER-A-2 TO PROCEED TO ALTER-B-2
068200              ALTER-TESTT-2 TO PROCEED TO ALTER-TESTT-2
068300              ALTER-D-2 TO PROCEED TO ALTER-E-2.
068400     PERFORM  ALTER-A-2 THRU ALTER-F-2.
068500     PERFORM  ALTER-A-2 THRU ALTER-F-2.
068600     MOVE     TBL-ELEMEN-D TO TBL-ELEMEN-B.
068700     IF       TBL-ELEMEN-B EQUAL TO "N P MN OP MN OP "
068800              PERFORM PASS GO TO ALTER-WRITE-2.
068900     GO       TO ALTER-FAIL-2.
069000 ALTER-DELETE-2.
069100     PERFORM  DE-LETE.
069200     GO       TO ALTER-WRITE-2.
069300 ALTER-FAIL-2.
069400     MOVE     TBL-ELEMEN-B TO COMPUTED-A.
069500     MOVE     "N P MN OP MN OP " TO CORRECT-A.
069600     PERFORM  FAIL.
069700 ALTER-WRITE-2.
069800     MOVE     "ALTER-TEST-2" TO PAR-NAME.
069900     PERFORM  PRINT-DETAIL.
070000 ALTER-INIT-3.
070100*    NOTE  THE FOLLOWING TESTS UTILIZE THE ALTER STATEMENT WITH
070200*          11 OPERANDS  A DELETE IN ALTER-TEST-3 WILL CAUSE THE
070300*         REST OF THE ALTER TESTS TO BE BYPASSED.
070400 ALTER-TEST-3.
070500     ALTER TEST-3A TO PROCEED TO TEST-3C  TEST-4A TO TEST-4C
070600         TEST-5A TO TEST-5B  TEST-6A TO TEST-6C  TEST-7A TO
070700         TEST-7B  TEST-8B TO PROCEED TO TEST-8C  TEST-9A TO
070800         TEST-9C  TEST-10A TO TEST-10C  TEST-11A TO TEST-11C
070900         TEST-12B TO PROCEED TO TEST-12C  TEST-13A TO TEST-13B.
071000     GO TO TEST-3A.
071100 ALTER-DELETE-3.
071200     PERFORM DE-LETE.
071300     MOVE "ALTER-TEST-3 THRU 13" TO PAR-NAME.
071400     PERFORM PRINT-DETAIL.
071500     GO TO ALTER-EXIT.
071600 TEST-3A.
071700     GO TO TEST-3B.
071800 TEST-3B.
071900     MOVE "TEST-3C " TO CORRECT-A.
072000     MOVE "TEST-3B " TO COMPUTED-A.
072100     PERFORM FAIL.
072200     GO TO ALTER-WRITE-3.
072300 TEST-3C.
072400     PERFORM PASS.
072500 ALTER-WRITE-3.
072600     MOVE "ALTER-TEST-3 " TO PAR-NAME.
072700     PERFORM PRINT-DETAIL.
072800 ALTER-TEST-4.
072900     GO TO TEST-4A.
073000 TEST-4A.
073100     GO TO TEST-4B.
073200 TEST-4B.
073300     MOVE "TEST-4B " TO COMPUTED-A.
073400     MOVE "TEST-4C " TO CORRECT-A.
073500     PERFORM FAIL.
073600     GO TO ALTER-WRITE-4.
073700 TEST-4C.
073800     PERFORM PASS.
073900 ALTER-WRITE-4.
074000     MOVE "ALTER-TEST-4 " TO PAR-NAME.
074100     PERFORM PRINT-DETAIL.
074200 ALTER-TEST-5.
074300     GO TO TEST-5A.
074400 TEST-5B.
074500     PERFORM PASS
074600     GO TO ALTER-WRITE-5.
074700 TEST-5A.
074800     GO TO TEST-5C.
074900 TEST-5C.
075000     MOVE "TEST-5C " TO COMPUTED-A.
075100     MOVE "TEST-5B " TO CORRECT-A.
075200     PERFORM FAIL.
075300 ALTER-WRITE-5.
075400     MOVE "ALTER-TEST-5 " TO PAR-NAME.
075500     PERFORM PRINT-DETAIL.
075600 ALTER-TEST-6.
075700     GO TO TEST-6A.
075800 TEST-6B.
075900     MOVE "TEST-6B " TO COMPUTED-A.
076000     MOVE "TEST-6C " TO CORRECT-A.
076100     PERFORM FAIL.
076200     GO TO ALTER-WRITE-6.
076300 TEST-6A.
076400     GO TO TEST-6B.
076500 TEST-6C.
076600     PERFORM PASS.
076700 ALTER-WRITE-6.
076800     MOVE "ALTER-TEST-6 " TO PAR-NAME.
076900     PERFORM PRINT-DETAIL.
077000 ALTER-TEST-7.
077100     GO TO TEST-7A.
077200 TEST-7B.
077300     PERFORM PASS.
077400     GO TO ALTER-WRITE-7.
077500 TEST-7A.
077600     GO TO TEST-7C.
077700 TEST-7C.
077800     MOVE "TEST-7C " TO COMPUTED-A.
077900     MOVE "TEST-7B " TO CORRECT-A.
078000     PERFORM FAIL.
078100 ALTER-WRITE-7.
078200     MOVE "ALTER-TEST-7 " TO PAR-NAME.
078300     PERFORM PRINT-DETAIL.
078400 ALTER-TEST-8.
078500     GO TO TEST-8B.
078600 TEST-8B.
078700     GO TO TEST-8A.
078800 TEST-8C.
078900     PERFORM PASS.
079000     GO TO ALTER-WRITE-8.
079100 TEST-8A.
079200     MOVE "TEST-8A " TO COMPUTED-A.
079300     MOVE "TEST-8C " TO CORRECT-A.
079400     PERFORM FAIL.
079500 ALTER-WRITE-8.
079600     MOVE "ALTER-TEST-8 " TO PAR-NAME.
079700     PERFORM PRINT-DETAIL.
079800 ALTER-TEST-9.
079900     GO TO TEST-9A.
080000 TEST-9B.
080100     MOVE "TEST-9B " TO COMPUTED-A.
080200     MOVE "TEST-9C " TO CORRECT-A.
080300     PERFORM FAIL.
080400     GO TO ALTER-WRITE-9.
080500 TEST-9A.
080600     GO TO TEST-9B.
080700 TEST-9C.
080800     PERFORM PASS.
080900 ALTER-WRITE-9.
081000     MOVE "ALTER-TEST-9 " TO PAR-NAME.
081100     PERFORM PRINT-DETAIL.
081200 ALTER-TEST-10.
081300     GO TO TEST-10A.
081400 TEST-10B.
081500     MOVE "TEST-10B " TO COMPUTED-A.
081600     MOVE "TEST-10C " TO CORRECT-A.
081700     PERFORM FAIL.
081800 ALTER-WRITE-10.
081900     MOVE "ALTER-TEST-10 " TO PAR-NAME.
082000     PERFORM PRINT-DETAIL.
082100 ALTER-TEST-11.
082200     GO TO TEST-11A.
082300 TEST-10A.
082400     GO TO TEST-10B.
082500 TEST-10C.
082600     PERFORM PASS.
082700     GO TO ALTER-WRITE-10.
082800 TEST-11A.
082900     GO TO TEST-11B.
083000 TEST-11B.
083100     MOVE "TEST-11B " TO COMPUTED-A.
083200     MOVE "TEST-11C " TO CORRECT-A.
083300     PERFORM FAIL.
083400     GO TO ALTER-WRITE-11.
083500 TEST-11C.
083600     PERFORM PASS.
083700 ALTER-WRITE-11.
083800     MOVE "ALTER-TEST-11 " TO PAR-NAME.
083900     PERFORM PRINT-DETAIL.
084000 ALTER-TEST-12.
084100     GO TO TEST-12B.
084200 TEST-12A.
084300     MOVE "TEST-12A " TO COMPUTED-A.
084400     MOVE "TEST-12C " TO CORRECT-A.
084500     PERFORM FAIL.
084600     GO TO ALTER-WRITE-12.
084700 TEST-12B.
084800     GO TO TEST-12A.
084900 TEST-12C.
085000     PERFORM PASS.
085100 ALTER-WRITE-12.
085200     MOVE "ALTER-TEST-12 " TO PAR-NAME.
085300     PERFORM PRINT-DETAIL.
085400 ALTER-TEST-13.
085500     GO TO TEST-13A.
085600 TEST-13C.
085700     MOVE "TEST-13C " TO COMPUTED-A.
085800     MOVE "TEST-13B " TO CORRECT-A.
085900     PERFORM FAIL.
086000     GO TO ALTER-WRITE-13.
086100 TEST-13A.
086200     GO TO TEST-13C.
086300 TEST-13B.
086400     PERFORM PASS.
086500 ALTER-WRITE-13.
086600     MOVE "ALTER-TEST-13 " TO PAR-NAME.
086700     PERFORM PRINT-DETAIL.
086800 ALTER-EXIT.
086900     EXIT.
087000 DATE-TEST-1.
087100     MOVE     "DATE-COMPILED" TO FEATURE, PAR-NAME.
087200     MOVE     "SEE SOURCE LISTING" TO COMPUTED-A.
087300     MOVE     "COMMENT SHOULD BE DELETED" TO RE-MARK.
087400     PERFORM  PRINT-DETAIL.
087500 QUAL-SECTION-1 SECTION.
087600 PARA-TEST-5.
087700     ALTER PARA-5A IN QUAL-SECTION-1 TO PROCEED TO PARA-5C OF
087800     QUAL-SECTION-2.
087900 PARA-5A.
088000     GO TO PARA-5C OF QUAL-SECTION-1.
088100 PARA-5B.
088200     MOVE "FAIL" TO QT5.
088300     GO TO PARA-5D.
088400 PARA-5C.
088500     MOVE "FAIL" TO QT5.
088600 PARA-5D.
088700                   IF QT5 EQUAL TO "PASS"
088800     PERFORM PASS ELSE
088900     PERFORM FAIL.
089000     MOVE "PARA-TEST-5" TO PAR-NAME.
089100     PERFORM PRINT-DETAIL.
089200 PARA-5-EXIT.
089300     EXIT.
089400 PARA-TEST-6.
089500     ALTER PARA-6B IN QUAL-SECTION-2 TO PROCEED TO PARA-6C OF
089600     QUAL-SECTION-1.
089700 PARA-6A.
089800     GO TO PARA-6B OF QUAL-SECTION-2.
089900 PARA-6B.
090000     PERFORM FAIL
090100     GO TO PARA-6-EXIT.
090200 PARA-6C.
090300     PERFORM PASS.
090400     GO TO   PARA-6-EXIT.
090500 PARA-6D.
090600     PERFORM FAIL.
090700 PARA-6-EXIT.
090800     EXIT.
090900 PARA-6-LAST.
091000     GO TO   CCVS-EXIT.
091100 PARA-TEST-FINISH.
091200     MOVE   "PARA-TEST-6" TO PAR-NAME.
091300     PERFORM PRINT-DETAIL.
091400 QUAL-SECTION-2 SECTION.
091500 PARA-5C.
091600     MOVE   "PASS" TO QT5.
091700     GO TO   PARA-5D.
091800 PARA-6B.
091900     GO TO   PARA-6D OF QUAL-SECTION-2.
092000 PARA-6C.
092100     PERFORM FAIL.
092200     GO TO   PARA-6-EXIT.
092300 PARA-6D.
092400     GO TO   PARA-6D IN QUAL-SECTION-1.
092500 QUAL-EXIT.
092600     EXIT.
092700 CCVS-EXIT SECTION.
092800 CCVS-999999.
092900     GO TO CLOSE-FILES.
