000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     OBSQ4A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    " HIGH       ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                                                              *
001000*    CREATION DATE     /     VALIDATION DATE                   *
001100*    "4.2 ".
001200*                                                              *
001300*         THE ROUTINE OBSQ4A READS AND VALIDATES THE MULTIPLE
001400*    FILE TAPE CREATED IN OBSQ3A. THE FOUR FILES CONTAINED ON
001500*    THIS TAPE ARE SQ-FS1, SQ-FS2, SQ-FS3, AND SQ-FS4.  BOTH
001600*    MULTIPLE FILE TAPES ONE AND TWO ARE THEN PASSED ON TO OBSQ5A.
001700*    OBSQ4A USES A MULTIPLE FILE CLAUSE WITH THE POSITION PHRASE
001800*    TO PROCESS TAPE ONE.  THIS TAPE WAS CREATED USING OPEN AND
001900*    CLOSE STATEMENTS WITH NO REWIND.
002000 ENVIRONMENT DIVISION.
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.
002300     XXXXX082.
002400 OBJECT-COMPUTER.
002500     XXXXX083.
002600 INPUT-OUTPUT SECTION.
002700 FILE-CONTROL.
002800P    SELECT RAW-DATA   ASSIGN TO
002900P    XXXXX062
003000P           ORGANIZATION IS INDEXED
003100P           ACCESS MODE IS RANDOM
003200P           RECORD KEY IS RAW-DATA-KEY.
003300     SELECT PRINT-FILE ASSIGN TO
003400     XXXXX055.
003500     SELECT SQ-FS1 ASSIGN TO
003600     XXXXP004.
003700     SELECT SQ-FS2 ASSIGN TO
003800     XXXXP008.
003900     SELECT SQ-FS3 ASSIGN TO
004000     XXXXP009.
004100     SELECT SQ-FS4 ASSIGN TO
004200     XXXXP010.
004300 I-O-CONTROL.
004400     MULTIPLE FILE CONTAINS SQ-FS1 POSITION 1,
004500                            SQ-FS4 POSITION 4,
004600                            SQ-FS3 POSITION 3,
004700                            SQ-FS2 POSITION 2.
004800 DATA DIVISION.
004900 FILE SECTION.
005000P
005100PFD  RAW-DATA.
005200P
005300P01  RAW-DATA-SATZ.
005400P    05  RAW-DATA-KEY        PIC X(6).
005500P    05  C-DATE              PIC 9(6).
005600P    05  C-TIME              PIC 9(8).
005700P    05  C-NO-OF-TESTS       PIC 99.
005800P    05  C-OK                PIC 999.
005900P    05  C-ALL               PIC 999.
006000P    05  C-FAIL              PIC 999.
006100P    05  C-DELETED           PIC 999.
006200P    05  C-INSPECT           PIC 999.
006300P    05  C-NOTE              PIC X(13).
006400P    05  C-INDENT            PIC X.
006500P    05  C-ABORT             PIC X(8).
006600 FD  PRINT-FILE.
006700 01  PRINT-REC PICTURE X(120).
006800 01  DUMMY-RECORD PICTURE X(120).
006900 FD  SQ-FS1
007000     LABEL RECORD STANDARD
007100                 .
007200 01  SQ-FS1R1-F-G-120   PIC X(120).
007300 FD  SQ-FS2
007400     LABEL RECORD STANDARD
007500     BLOCK 5 RECORDS.
007600 01  SQ-FS2R1-F-G-120   PIC X(120).
007700 FD  SQ-FS3
007800     LABEL RECORD STANDARD
007900     RECORD CONTAINS 120 CHARACTERS
008000     BLOCK CONTAINS 1200 CHARACTERS.
008100 01  SQ-FS3R1-F-G-120   PIC X(120).
008200 FD  SQ-FS4
008300     LABEL RECORD IS STANDARD
008400     RECORD          120 CHARACTERS
008500     BLOCK CONTAINS 10 RECORDS.
008600 01  SQ-FS4R1-F-G-120   PIC X(120).
008700 WORKING-STORAGE SECTION.
008800 77  RECORDS-COUNT       PIC 999   VALUE 0.
008900 77  RECORDS-IN-ERROR   PIC 999   VALUE 0.
009000 01  FILE-RECORD-INFORMATION-REC.
009100     03 FILE-RECORD-INFO-SKELETON.
009200        05 FILLER                 PICTURE X(48)       VALUE
009300             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
009400        05 FILLER                 PICTURE X(46)       VALUE
009500             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
009600        05 FILLER                 PICTURE X(26)       VALUE
009700             ",LFIL=000000,ORG=  ,LBLR= ".
009800        05 FILLER                 PICTURE X(37)       VALUE
009900             ",RECKEY=                             ".
010000        05 FILLER                 PICTURE X(38)       VALUE
010100             ",ALTKEY1=                             ".
010200        05 FILLER                 PICTURE X(38)       VALUE
010300             ",ALTKEY2=                             ".
010400        05 FILLER                 PICTURE X(7)        VALUE SPACE.
010500     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
010600        05 FILE-RECORD-INFO-P1-120.
010700           07 FILLER              PIC X(5).
010800           07 XFILE-NAME           PIC X(6).
010900           07 FILLER              PIC X(8).
011000           07 XRECORD-NAME         PIC X(6).
011100           07 FILLER              PIC X(1).
011200           07 REELUNIT-NUMBER     PIC 9(1).
011300           07 FILLER              PIC X(7).
011400           07 XRECORD-NUMBER       PIC 9(6).
011500           07 FILLER              PIC X(6).
011600           07 UPDATE-NUMBER       PIC 9(2).
011700           07 FILLER              PIC X(5).
011800           07 ODO-NUMBER          PIC 9(4).
011900           07 FILLER              PIC X(5).
012000           07 XPROGRAM-NAME        PIC X(5).
012100           07 FILLER              PIC X(7).
012200           07 XRECORD-LENGTH       PIC 9(6).
012300           07 FILLER              PIC X(7).
012400           07 CHARS-OR-RECORDS    PIC X(2).
012500           07 FILLER              PIC X(1).
012600           07 XBLOCK-SIZE          PIC 9(4).
012700           07 FILLER              PIC X(6).
012800           07 RECORDS-IN-FILE     PIC 9(6).
012900           07 FILLER              PIC X(5).
013000           07 XFILE-ORGANIZATION   PIC X(2).
013100           07 FILLER              PIC X(6).
013200           07 XLABEL-TYPE          PIC X(1).
013300        05 FILE-RECORD-INFO-P121-240.
013400           07 FILLER              PIC X(8).
013500           07 XRECORD-KEY          PIC X(29).
013600           07 FILLER              PIC X(9).
013700           07 ALTERNATE-KEY1      PIC X(29).
013800           07 FILLER              PIC X(9).
013900           07 ALTERNATE-KEY2      PIC X(29).
014000           07 FILLER              PIC X(7).
014100 01  TEST-RESULTS.
014200     02 FILLER                    PICTURE X VALUE SPACE.
014300     02 FEATURE                   PICTURE X(20) VALUE SPACE.
014400     02 FILLER                    PICTURE X VALUE SPACE.
014500     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
014600     02 FILLER                    PICTURE X  VALUE SPACE.
014700     02  PAR-NAME.
014800       03 FILLER PICTURE X(12) VALUE SPACE.
014900       03  PARDOT-X PICTURE X  VALUE SPACE.
015000       03 DOTVALUE PICTURE 99  VALUE ZERO.
015100       03 FILLER PIC X(5) VALUE SPACE.
015200     02 FILLER PIC X(10) VALUE SPACE.
015300     02 RE-MARK PIC X(61).
015400 01  TEST-COMPUTED.
015500     02 FILLER PIC X(30) VALUE SPACE.
015600     02 FILLER PIC X(17) VALUE "       COMPUTED=".
015700     02 COMPUTED-X.
015800     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
015900     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
016000     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
016100     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
016200     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
016300     03       CM-18V0 REDEFINES COMPUTED-A.
016400         04 COMPUTED-18V0                   PICTURE -9(18).
016500         04 FILLER                          PICTURE X.
016600     03 FILLER PIC X(50) VALUE SPACE.
016700 01  TEST-CORRECT.
016800     02 FILLER PIC X(30) VALUE SPACE.
016900     02 FILLER PIC X(17) VALUE "       CORRECT =".
017000     02 CORRECT-X.
017100     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
017200     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
017300     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
017400     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
017500     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
017600     03      CR-18V0 REDEFINES CORRECT-A.
017700         04 CORRECT-18V0                    PICTURE -9(18).
017800         04 FILLER                          PICTURE X.
017900     03 FILLER PIC X(50) VALUE SPACE.
018000 01  CCVS-C-1.
018100     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
018200-    "SS  PARAGRAPH-NAME
018300-    "        REMARKS".
018400     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
018500 01  CCVS-C-2.
018600     02 FILLER PICTURE IS X VALUE IS SPACE.
018700     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
018800     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
018900     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
019000     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
019100 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
019200 01  REC-CT PICTURE 99 VALUE ZERO.
019300 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
019400 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
019500 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
019600 01  PASS-COUNTER PIC 999 VALUE ZERO.
019700 01  TOTAL-ERROR PIC 999 VALUE ZERO.
019800 01  ERROR-HOLD PIC 999 VALUE ZERO.
019900 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
020000 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
020100 01  CCVS-H-1.
020200     02  FILLER   PICTURE X(27)  VALUE SPACE.
020300     02 FILLER PICTURE X(67) VALUE
020400     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
020500-    " SYSTEM".
020600     02  FILLER     PICTURE X(26)  VALUE SPACE.
020700 01  CCVS-H-2.
020800     02 FILLER PICTURE X(52) VALUE IS
020900     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
021000     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
021100     02 TEST-ID PICTURE IS X(9).
021200     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
021300 01  CCVS-H-3.
021400     02  FILLER PICTURE X(34) VALUE
021500     " FOR OFFICIAL USE ONLY    ".
021600     02  FILLER PICTURE X(58) VALUE
021700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
021800     02  FILLER PICTURE X(28) VALUE
021900     "  COPYRIGHT   1985 ".
022000 01  CCVS-E-1.
022100     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
022200     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
022300     02 ID-AGAIN PICTURE IS X(9).
022400     02 FILLER PICTURE X(45) VALUE IS
022500     " NTIS DISTRIBUTION COBOL 85".
022600 01  CCVS-E-2.
022700     02  FILLER                   PICTURE X(31)  VALUE
022800     SPACE.
022900     02  FILLER                   PICTURE X(21)  VALUE SPACE.
023000     02 CCVS-E-2-2.
023100         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
023200         03 FILLER PICTURE IS X VALUE IS SPACE.
023300         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
023400 01  CCVS-E-3.
023500     02  FILLER PICTURE X(22) VALUE
023600     " FOR OFFICIAL USE ONLY".
023700     02  FILLER PICTURE X(12) VALUE SPACE.
023800     02  FILLER PICTURE X(58) VALUE
023900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024000     02  FILLER PICTURE X(13) VALUE SPACE.
024100     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
024200 01  CCVS-E-4.
024300     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
024400     02 FILLER PIC XXXX VALUE " OF ".
024500     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
024600     02 FILLER PIC X(40) VALUE
024700      "  TESTS WERE EXECUTED SUCCESSFULLY".
024800 01  XXINFO.
024900     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
025000     02 INFO-TEXT.
025100     04 FILLER PIC X(20) VALUE SPACE.
025200     04 XXCOMPUTED PIC X(20).
025300     04 FILLER PIC X(5) VALUE SPACE.
025400     04 XXCORRECT PIC X(20).
025500 01  HYPHEN-LINE.
025600     02 FILLER PICTURE IS X VALUE IS SPACE.
025700     02 FILLER PICTURE IS X(65) VALUE IS "************************
025800-    "*****************************************".
025900     02 FILLER PICTURE IS X(54) VALUE IS "************************
026000-    "******************************".
026100 01  CCVS-PGM-ID PIC X(6) VALUE
026200     "OBSQ4A".
026300 PROCEDURE DIVISION.
026400 CCVS1 SECTION.
026500 OPEN-FILES.
026600P    OPEN I-O RAW-DATA.
026700P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
026800P    READ RAW-DATA INVALID KEY GO TO END-E-1.
026900P    MOVE "ABORTED " TO C-ABORT.
027000P    ADD 1 TO C-NO-OF-TESTS.
027100P    ACCEPT C-DATE  FROM DATE.
027200P    ACCEPT C-TIME  FROM TIME.
027300P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
027400PEND-E-1.
027500P    CLOSE RAW-DATA.
027600     OPEN     OUTPUT PRINT-FILE.
027700     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027800     MOVE    SPACE TO TEST-RESULTS.
027900     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028000     MOVE ZERO TO REC-SKL-SUB.
028100     PERFORM CCVS-INIT-FILE 9 TIMES.
028200 CCVS-INIT-FILE.
028300     ADD 1 TO REC-SKL-SUB.
028400     MOVE FILE-RECORD-INFO-SKELETON TO
028500                  FILE-RECORD-INFO (REC-SKL-SUB).
028600 CCVS-INIT-EXIT.
028700     GO TO CCVS1-EXIT.
028800 CLOSE-FILES.
028900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029000P    OPEN I-O RAW-DATA.
029100P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
029200P    READ RAW-DATA INVALID KEY GO TO END-E-2.
029300P    MOVE "OK.     " TO C-ABORT.
029400P    MOVE PASS-COUNTER TO C-OK.
029500P    MOVE ERROR-HOLD   TO C-ALL.
029600P    MOVE ERROR-COUNTER TO C-FAIL.
029700P    MOVE DELETE-CNT TO C-DELETED.
029800P    MOVE INSPECT-COUNTER TO C-INSPECT.
029900P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
030000PEND-E-2.
030100P    CLOSE RAW-DATA.
030200 TERMINATE-CCVS.
030300S    EXIT PROGRAM.
030400STERMINATE-CALL.
030500     STOP     RUN.
030600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
030700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
030800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
030900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
031000     MOVE "****TEST DELETED****" TO RE-MARK.
031100 PRINT-DETAIL.
031200     IF REC-CT NOT EQUAL TO ZERO
031300             MOVE "." TO PARDOT-X
031400             MOVE REC-CT TO DOTVALUE.
031500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
031600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
031700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
031800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
031900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
032000     MOVE SPACE TO CORRECT-X.
032100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
032200     MOVE     SPACE TO RE-MARK.
032300 HEAD-ROUTINE.
032400     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032500     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
032600     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
032700 COLUMN-NAMES-ROUTINE.
032800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
033100 END-ROUTINE.
033200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
033300 END-RTN-EXIT.
033400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033500 END-ROUTINE-1.
033600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
033700      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
033800      ADD PASS-COUNTER TO ERROR-HOLD.
033900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
034000      MOVE PASS-COUNTER TO CCVS-E-4-1.
034100      MOVE ERROR-HOLD TO CCVS-E-4-2.
034200      MOVE CCVS-E-4 TO CCVS-E-2-2.
034300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
034400  END-ROUTINE-12.
034500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
034600     IF       ERROR-COUNTER IS EQUAL TO ZERO
034700         MOVE "NO " TO ERROR-TOTAL
034800         ELSE
034900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
035000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
035100     PERFORM WRITE-LINE.
035200 END-ROUTINE-13.
035300     IF DELETE-CNT IS EQUAL TO ZERO
035400         MOVE "NO " TO ERROR-TOTAL  ELSE
035500         MOVE DELETE-CNT TO ERROR-TOTAL.
035600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
035700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035800      IF   INSPECT-COUNTER EQUAL TO ZERO
035900          MOVE "NO " TO ERROR-TOTAL
036000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
036100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
036200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036400 WRITE-LINE.
036500     ADD 1 TO RECORD-COUNT.
036600Y    IF RECORD-COUNT GREATER 50
036700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
036800Y        MOVE SPACE TO DUMMY-RECORD
036900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
037000Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
037100Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
037200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
037300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
037400Y        MOVE ZERO TO RECORD-COUNT.
037500     PERFORM WRT-LN.
037600 WRT-LN.
037700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
037800     MOVE SPACE TO DUMMY-RECORD.
037900 BLANK-LINE-PRINT.
038000     PERFORM WRT-LN.
038100 FAIL-ROUTINE.
038200     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038300     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038400     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
038500     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038600     GO TO FAIL-ROUTINE-EX.
038700 FAIL-ROUTINE-WRITE.
038800     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
038900     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
039000 FAIL-ROUTINE-EX. EXIT.
039100 BAIL-OUT.
039200     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
039300     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
039400 BAIL-OUT-WRITE.
039500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
039600     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039700 BAIL-OUT-EX. EXIT.
039800 CCVS1-EXIT.
039900     EXIT.
040000 SECT-OBSQ4A-0001 SECTION.
040100 SEQ-INIT-001.
040200     MOVE 0 TO RECORDS-COUNT, RECORDS-IN-ERROR.
040300     OPEN INPUT SQ-FS1.
040400 SEQ-TEST-001.
040500     READ SQ-FS1 AT END GO TO SEQ-TEST-001-01.
040600     MOVE SQ-FS1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
040700     ADD 1 TO RECORDS-COUNT.
040800     IF RECORDS-COUNT GREATER THAN 750
040900              MOVE "MORE THAN 750 RECORDS" TO RE-MARK
041000              GO TO SEQ-FAIL-001.
041100     IF RECORDS-COUNT NOT EQUAL TO XRECORD-NUMBER (1)
041200              ADD 1 TO RECORDS-IN-ERROR
041300              GO TO SEQ-TEST-001.
041400     IF XFILE-NAME (1) NOT EQUAL TO "SQ-FS1"
041500              ADD 1 TO RECORDS-IN-ERROR
041600              GO TO SEQ-TEST-001.
041700     IF CHARS-OR-RECORDS (1) NOT EQUAL TO "RC"
041800              ADD 1 TO RECORDS-IN-ERROR
041900              GO TO SEQ-TEST-001.
042000     IF XBLOCK-SIZE (1) NOT EQUAL TO 1
042100              ADD 1 TO RECORDS-IN-ERROR.
042200     GO TO SEQ-TEST-001.
042300 SEQ-TEST-001-01.
042400     IF RECORDS-IN-ERROR EQUAL TO ZERO
042500              GO TO SEQ-PASS-001.
042600     MOVE "ERRORS IN READING SQ-FS1" TO RE-MARK.
042700 SEQ-FAIL-001.
042800     MOVE "RECORDS IN ERROR" TO COMPUTED-A.
042900     MOVE RECORDS-IN-ERROR TO CORRECT-18V0.
043000     PERFORM FAIL.
043100     GO TO SEQ-WRITE-001.
043200 SEQ-PASS-001.
043300     PERFORM PASS.
043400     MOVE "FILE VERIFIED RECS =" TO COMPUTED-A.
043500     MOVE RECORDS-COUNT TO CORRECT-18V0.
043600 SEQ-WRITE-001.
043700     MOVE "SEQ-TEST-001" TO PAR-NAME.
043800     MOVE "VERIFY FILE SQ-FS1" TO FEATURE.
043900     PERFORM PRINT-DETAIL.
044000 SEQ-CLOSE-001.
044100     CLOSE SQ-FS1.
044200 SEQ-INIT-002.
044300*             THIS TEST READS AND VALIDATES FILE SQ-FS3.
044400     MOVE 0 TO RECORDS-COUNT, RECORDS-IN-ERROR.
044500     OPEN INPUT SQ-FS3.
044600 SEQ-TEST-002.
044700     READ SQ-FS3 AT END GO TO SEQ-TEST-002-01.
044800     MOVE SQ-FS3R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
044900     ADD 1 TO RECORDS-COUNT.
045000     IF RECORDS-COUNT GREATER THAN 750
045100              MOVE "MORE THAN 750 RECORDS" TO RE-MARK
045200              GO TO SEQ-FAIL-002.
045300     IF RECORDS-COUNT NOT EQUAL TO XRECORD-NUMBER (1)
045400              ADD 1 TO RECORDS-IN-ERROR
045500              GO TO SEQ-TEST-002.
045600     IF XFILE-NAME (1) NOT EQUAL TO "SQ-FS3"
045700              ADD 1 TO RECORDS-IN-ERROR
045800              GO TO SEQ-TEST-002.
045900     IF CHARS-OR-RECORDS (1) NOT EQUAL TO "CH"
046000              ADD 1 TO RECORDS-IN-ERROR
046100              GO TO SEQ-TEST-002.
046200     IF XBLOCK-SIZE (1) NOT EQUAL TO 1200
046300              ADD 1 TO RECORDS-IN-ERROR.
046400     GO TO SEQ-TEST-002.
046500 SEQ-TEST-002-01.
046600     IF RECORDS-IN-ERROR EQUAL TO ZERO
046700              GO TO SEQ-PASS-002.
046800     MOVE "ERRORS IN READING SQ-FS3" TO RE-MARK.
046900 SEQ-FAIL-002.
047000     MOVE "RECORDS IN ERROR" TO COMPUTED-A.
047100     MOVE RECORDS-IN-ERROR TO CORRECT-18V0.
047200     PERFORM FAIL.
047300     GO TO SEQ-WRITE-002.
047400 SEQ-PASS-002.
047500     PERFORM PASS.
047600     MOVE "FILE VERIFIED RECS =" TO COMPUTED-A.
047700     MOVE RECORDS-COUNT TO CORRECT-18V0.
047800 SEQ-WRITE-002.
047900     MOVE "SEQ-TEST-002" TO PAR-NAME.
048000     MOVE "VERIFY FILE SQ-FS3" TO FEATURE.
048100     PERFORM PRINT-DETAIL.
048200 SEQ-CLOSE-002.
048300     CLOSE SQ-FS3.
048400 SEQ-INIT-003.
048500*             THIS TEST READS AND VALIDATES FILE SQ-FS2.
048600     MOVE 0 TO RECORDS-COUNT, RECORDS-IN-ERROR.
048700     OPEN INPUT SQ-FS2.
048800 SEQ-TEST-003.
048900     READ SQ-FS2 AT END GO TO SEQ-TEST-003-01.
049000     MOVE SQ-FS2R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
049100     ADD 1 TO RECORDS-COUNT.
049200     IF RECORDS-COUNT GREATER THAN 750
049300              MOVE "MORE THAN 750 RECORDS" TO RE-MARK
049400              GO TO SEQ-FAIL-003.
049500     IF RECORDS-COUNT NOT EQUAL TO XRECORD-NUMBER (1)
049600              ADD 1 TO RECORDS-IN-ERROR
049700              GO TO SEQ-TEST-003.
049800     IF XFILE-NAME (1) NOT EQUAL TO "SQ-FS2"
049900              ADD 1 TO RECORDS-IN-ERROR
050000              GO TO SEQ-TEST-003.
050100     IF CHARS-OR-RECORDS (1) NOT EQUAL TO "RC"
050200              ADD 1 TO RECORDS-IN-ERROR
050300              GO TO SEQ-TEST-003.
050400     IF XBLOCK-SIZE (1) NOT EQUAL TO 5
050500              ADD 1 TO RECORDS-IN-ERROR.
050600     GO TO SEQ-TEST-003.
050700 SEQ-TEST-003-01.
050800     IF RECORDS-IN-ERROR EQUAL TO ZERO
050900              GO TO SEQ-PASS-003.
051000     MOVE "ERRORS IN READING SQ-FS2" TO RE-MARK.
051100 SEQ-FAIL-003.
051200     MOVE "RECORDS IN ERROR" TO COMPUTED-A.
051300     MOVE RECORDS-IN-ERROR TO CORRECT-18V0.
051400     PERFORM FAIL.
051500     GO TO SEQ-WRITE-003.
051600 SEQ-PASS-003.
051700     PERFORM PASS.
051800     MOVE "FILE VERIFIED RECS =" TO COMPUTED-A.
051900     MOVE RECORDS-COUNT TO CORRECT-18V0.
052000 SEQ-WRITE-003.
052100     MOVE "SEQ-TEST-003" TO PAR-NAME.
052200     MOVE "VERIFY FILE SQ-FS2" TO FEATURE.
052300     PERFORM PRINT-DETAIL.
052400 SEQ-CLOSE-003.
052500     CLOSE SQ-FS2.
052600 SEQ-INIT-004.
052700*             THIS TEST READS AND VALIDATES FILE SQ-FS4.
052800     MOVE 0 TO RECORDS-COUNT, RECORDS-IN-ERROR.
052900     OPEN INPUT SQ-FS4.
053000 SEQ-TEST-004.
053100     READ SQ-FS4 AT END GO TO SEQ-TEST-004-01.
053200     MOVE SQ-FS4R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
053300     ADD 1 TO RECORDS-COUNT.
053400     IF RECORDS-COUNT GREATER THAN 750
053500              MOVE "MORE THAN 750 RECORDS" TO RE-MARK
053600              GO TO SEQ-FAIL-004.
053700     IF RECORDS-COUNT NOT EQUAL TO XRECORD-NUMBER (1)
053800              ADD 1 TO RECORDS-IN-ERROR
053900              GO TO SEQ-TEST-004.
054000     IF XFILE-NAME (1) NOT EQUAL TO "SQ-FS4"
054100              ADD 1 TO RECORDS-IN-ERROR
054200              GO TO SEQ-TEST-004.
054300     IF CHARS-OR-RECORDS (1) NOT EQUAL TO "RC"
054400              ADD 1 TO RECORDS-IN-ERROR
054500              GO TO SEQ-TEST-004.
054600     IF XBLOCK-SIZE (1) NOT EQUAL TO 10
054700              ADD 1 TO RECORDS-IN-ERROR.
054800     GO TO SEQ-TEST-004.
054900 SEQ-TEST-004-01.
055000     IF RECORDS-IN-ERROR EQUAL TO ZERO
055100              GO TO SEQ-PASS-004.
055200     MOVE "ERRORS IN READING SQ-FS4" TO RE-MARK.
055300 SEQ-FAIL-004.
055400     MOVE "RECORDS IN ERROR" TO COMPUTED-A.
055500     MOVE RECORDS-IN-ERROR TO CORRECT-18V0.
055600     PERFORM FAIL.
055700     GO TO SEQ-WRITE-004.
055800 SEQ-PASS-004.
055900     PERFORM PASS.
056000     MOVE "FILE VERIFIED RECS =" TO COMPUTED-A.
056100     MOVE RECORDS-COUNT TO CORRECT-18V0.
056200 SEQ-WRITE-004.
056300     MOVE "SEQ-TEST-004" TO PAR-NAME.
056400     MOVE "VERIFY FILE SQ-FS4" TO FEATURE.
056500     PERFORM PRINT-DETAIL.
056600 SEQ-CLOSE-004.
056700     CLOSE SQ-FS4.
056800 OBSQ4A-END-ROUTINE.
056900     MOVE "END OF OBSQ4A VALIDATION TESTS" TO PRINT-REC.
057000     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
057100     GO TO CCVS-EXIT.
057200 CCVS-EXIT SECTION.
057300 CCVS-999999.
057400     GO TO CLOSE-FILES.
