000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     OBSQ3A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    " HIGH       ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                                                              *
001000*    CREATION DATE     /     VALIDATION DATE                   *
001100*    "4.2 ".
001200*                                                              *
001300*    THIS ROUTINE TESTS THE USE OF MULTIPLE FILE CLAUSE
001400*    OF THE I-O-CONTROL PARAGRAPH.  TWO TAPES ARE CREATED
001500*    CONTAINING 4 FILES EACH.  TAPE ONE IS CREATED WITHOUT THE
001600*    USE OF THE NO REWIND OPTION WITH THE OPEN AND CLOSE
001700*   STATEMENTS. IT IS THEN PASSED ON TO OBSQ4A AND OBSQ5A WHERE IT
001800*    IS READ AND VALIDATED.  TAPE TWO IS CREATED USING THE
001900*    POSITION PHRASE OF THE MULTIPLE FILE CLAUSE AND WITH THE USE
002000*    OF THE NO REWIND OPTION WITH THE OPEN AND CLOSE STATEMENT.
002100*    TAPE TWO IS THEN PASSED ON TO OBSQ5A WHERE IT IS READ AND
002200*    VALIDATED.
002300 ENVIRONMENT DIVISION.
002400 CONFIGURATION SECTION.
002500 SOURCE-COMPUTER.
002600     XXXXX082.
002700 OBJECT-COMPUTER.
002800     XXXXX083.
002900 INPUT-OUTPUT SECTION.
003000 FILE-CONTROL.
003100P    SELECT RAW-DATA   ASSIGN TO
003200P    XXXXX062
003300P           ORGANIZATION IS INDEXED
003400P           ACCESS MODE IS RANDOM
003500P           RECORD KEY IS RAW-DATA-KEY.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800     SELECT SQ-FS1 ASSIGN TO
003900     XXXXP004
004000     ORGANIZATION IS SEQUENTIAL.
004100     SELECT SQ-FS2 ASSIGN TO
004200     XXXXP008
004300     ACCESS MODE IS SEQUENTIAL.
004400     SELECT SQ-FS3 ASSIGN
004500     XXXXP009
004600     ORGANIZATION IS SEQUENTIAL.
004700     SELECT SQ-FS4 ASSIGN
004800     XXXXP010
004900     ACCESS MODE SEQUENTIAL.
005000     SELECT SQ-FS5 ASSIGN
005100     XXXXP005.
005200     SELECT SQ-FS6 ASSIGN
005300     XXXXP011
005400     ORGANIZATION IS SEQUENTIAL.
005500     SELECT SQ-FS7 ASSIGN TO
005600     XXXXP012
005700     ORGANIZATION IS SEQUENTIAL
005800     ACCESS MODE IS SEQUENTIAL.
005900     SELECT SQ-FS8 ASSIGN TO
006000     XXXXP013
006100     ACCESS MODE IS SEQUENTIAL.
006200 I-O-CONTROL.
006300     MULTIPLE FILE TAPE CONTAINS SQ-FS1,
006400                                 SQ-FS2,
006500                                 SQ-FS3,
006600                                 SQ-FS4;
006700     MULTIPLE FILE TAPE SQ-FS8 POSITION 4,
006800                        SQ-FS7 POSITION 3,
006900                        SQ-FS6 POSITION 2,
007000                        SQ-FS5 POSITION 1.
007100 DATA DIVISION.
007200 FILE SECTION.
007300P
007400PFD  RAW-DATA.
007500P
007600P01  RAW-DATA-SATZ.
007700P    05  RAW-DATA-KEY        PIC X(6).
007800P    05  C-DATE              PIC 9(6).
007900P    05  C-TIME              PIC 9(8).
008000P    05  C-NO-OF-TESTS       PIC 99.
008100P    05  C-OK                PIC 999.
008200P    05  C-ALL               PIC 999.
008300P    05  C-FAIL              PIC 999.
008400P    05  C-DELETED           PIC 999.
008500P    05  C-INSPECT           PIC 999.
008600P    05  C-NOTE              PIC X(13).
008700P    05  C-INDENT            PIC X.
008800P    05  C-ABORT             PIC X(8).
008900 FD  PRINT-FILE.
009000 01  PRINT-REC PICTURE X(120).
009100 01  DUMMY-RECORD PICTURE X(120).
009200 FD  SQ-FS1
009300     LABEL RECORD IS STANDARD
009400          .
009500 01  SQ-FS1R1-F-G-120   PIC X(120).
009600 FD  SQ-FS2
009700     LABEL RECORD STANDARD
009800     BLOCK CONTAINS 5 RECORDS.
009900 01  SQ-FS2R1-F-G-120   PIC X(120).
010000 FD  SQ-FS3
010100     LABEL RECORD STANDARD
010200     BLOCK CONTAINS 1200 CHARACTERS
010300     RECORD CONTAINS 120 CHARACTERS.
010400 01  SQ-FS3R1-F-G-120   PIC X(120).
010500 FD  SQ-FS4
010600     LABEL RECORDS STANDARD
010700     BLOCK 10 RECORDS
010800     RECORD 120 CHARACTERS.
010900 01  SQ-FS4R1-F-G-120   PIC X(120).
011000 FD  SQ-FS5
011100     LABEL RECORDS ARE STANDARD
011200     BLOCK CONTAINS 5 RECORDS.
011300 01  SQ-FS5R1-F-G-120   PIC X(120).
011400 FD  SQ-FS6
011500     LABEL RECORD IS STANDARD
011600     BLOCK CONTAINS 10 RECORDS.
011700 01  SQ-FS6R1-F-G-120   PIC X(120).
011800 FD  SQ-FS7
011900     LABEL RECORD STANDARD
012000     BLOCK CONTAINS 2400 CHARACTERS.
012100 01  SQ-FS7R1-F-G-120   PIC X(120).
012200 FD  SQ-FS8
012300     LABEL RECORDS ARE STANDARD
012400     BLOCK 120 CHARACTERS
012500     RECORD 120.
012600 01  SQ-FS8R1-F-G-120   PIC X(120).
012700 WORKING-STORAGE SECTION.
012800 01  COUNT-OF-RECS PIC 9999.
012900 01  FILE-RECORD-INFORMATION-REC.
013000     03 FILE-RECORD-INFO-SKELETON.
013100        05 FILLER                 PICTURE X(48)       VALUE
013200             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
013300        05 FILLER                 PICTURE X(46)       VALUE
013400             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
013500        05 FILLER                 PICTURE X(26)       VALUE
013600             ",LFIL=000000,ORG=  ,LBLR= ".
013700        05 FILLER                 PICTURE X(37)       VALUE
013800             ",RECKEY=                             ".
013900        05 FILLER                 PICTURE X(38)       VALUE
014000             ",ALTKEY1=                             ".
014100        05 FILLER                 PICTURE X(38)       VALUE
014200             ",ALTKEY2=                             ".
014300        05 FILLER                 PICTURE X(7)        VALUE SPACE.
014400     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
014500        05 FILE-RECORD-INFO-P1-120.
014600           07 FILLER              PIC X(5).
014700           07 XFILE-NAME           PIC X(6).
014800           07 FILLER              PIC X(8).
014900           07 XRECORD-NAME         PIC X(6).
015000           07 FILLER              PIC X(1).
015100           07 REELUNIT-NUMBER     PIC 9(1).
015200           07 FILLER              PIC X(7).
015300           07 XRECORD-NUMBER       PIC 9(6).
015400           07 FILLER              PIC X(6).
015500           07 UPDATE-NUMBER       PIC 9(2).
015600           07 FILLER              PIC X(5).
015700           07 ODO-NUMBER          PIC 9(4).
015800           07 FILLER              PIC X(5).
015900           07 XPROGRAM-NAME        PIC X(5).
016000           07 FILLER              PIC X(7).
016100           07 XRECORD-LENGTH       PIC 9(6).
016200           07 FILLER              PIC X(7).
016300           07 CHARS-OR-RECORDS    PIC X(2).
016400           07 FILLER              PIC X(1).
016500           07 XBLOCK-SIZE          PIC 9(4).
016600           07 FILLER              PIC X(6).
016700           07 RECORDS-IN-FILE     PIC 9(6).
016800           07 FILLER              PIC X(5).
016900           07 XFILE-ORGANIZATION   PIC X(2).
017000           07 FILLER              PIC X(6).
017100           07 XLABEL-TYPE          PIC X(1).
017200        05 FILE-RECORD-INFO-P121-240.
017300           07 FILLER              PIC X(8).
017400           07 XRECORD-KEY          PIC X(29).
017500           07 FILLER              PIC X(9).
017600           07 ALTERNATE-KEY1      PIC X(29).
017700           07 FILLER              PIC X(9).
017800           07 ALTERNATE-KEY2      PIC X(29).
017900           07 FILLER              PIC X(7).
018000 01  TEST-RESULTS.
018100     02 FILLER                    PICTURE X VALUE SPACE.
018200     02 FEATURE                   PICTURE X(20) VALUE SPACE.
018300     02 FILLER                    PICTURE X VALUE SPACE.
018400     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
018500     02 FILLER                    PICTURE X  VALUE SPACE.
018600     02  PAR-NAME.
018700       03 FILLER PICTURE X(12) VALUE SPACE.
018800       03  PARDOT-X PICTURE X  VALUE SPACE.
018900       03 DOTVALUE PICTURE 99  VALUE ZERO.
019000       03 FILLER PIC X(5) VALUE SPACE.
019100     02 FILLER PIC X(10) VALUE SPACE.
019200     02 RE-MARK PIC X(61).
019300 01  TEST-COMPUTED.
019400     02 FILLER PIC X(30) VALUE SPACE.
019500     02 FILLER PIC X(17) VALUE "       COMPUTED=".
019600     02 COMPUTED-X.
019700     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
019800     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
019900     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
020000     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
020100     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
020200     03       CM-18V0 REDEFINES COMPUTED-A.
020300         04 COMPUTED-18V0                   PICTURE -9(18).
020400         04 FILLER                          PICTURE X.
020500     03 FILLER PIC X(50) VALUE SPACE.
020600 01  TEST-CORRECT.
020700     02 FILLER PIC X(30) VALUE SPACE.
020800     02 FILLER PIC X(17) VALUE "       CORRECT =".
020900     02 CORRECT-X.
021000     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
021100     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
021200     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
021300     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
021400     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
021500     03      CR-18V0 REDEFINES CORRECT-A.
021600         04 CORRECT-18V0                    PICTURE -9(18).
021700         04 FILLER                          PICTURE X.
021800     03 FILLER PIC X(50) VALUE SPACE.
021900 01  CCVS-C-1.
022000     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
022100-    "SS  PARAGRAPH-NAME
022200-    "        REMARKS".
022300     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
022400 01  CCVS-C-2.
022500     02 FILLER PICTURE IS X VALUE IS SPACE.
022600     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
022700     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
022800     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
022900     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
023000 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
023100 01  REC-CT PICTURE 99 VALUE ZERO.
023200 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
023300 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
023400 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
023500 01  PASS-COUNTER PIC 999 VALUE ZERO.
023600 01  TOTAL-ERROR PIC 999 VALUE ZERO.
023700 01  ERROR-HOLD PIC 999 VALUE ZERO.
023800 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
023900 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
024000 01  CCVS-H-1.
024100     02  FILLER   PICTURE X(27)  VALUE SPACE.
024200     02 FILLER PICTURE X(67) VALUE
024300     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
024400-    " SYSTEM".
024500     02  FILLER     PICTURE X(26)  VALUE SPACE.
024600 01  CCVS-H-2.
024700     02 FILLER PICTURE X(52) VALUE IS
024800     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
024900     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
025000     02 TEST-ID PICTURE IS X(9).
025100     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
025200 01  CCVS-H-3.
025300     02  FILLER PICTURE X(34) VALUE
025400     " FOR OFFICIAL USE ONLY    ".
025500     02  FILLER PICTURE X(58) VALUE
025600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
025700     02  FILLER PICTURE X(28) VALUE
025800     "  COPYRIGHT   1985 ".
025900 01  CCVS-E-1.
026000     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
026100     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
026200     02 ID-AGAIN PICTURE IS X(9).
026300     02 FILLER PICTURE X(45) VALUE IS
026400     " NTIS DISTRIBUTION COBOL 85".
026500 01  CCVS-E-2.
026600     02  FILLER                   PICTURE X(31)  VALUE
026700     SPACE.
026800     02  FILLER                   PICTURE X(21)  VALUE SPACE.
026900     02 CCVS-E-2-2.
027000         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
027100         03 FILLER PICTURE IS X VALUE IS SPACE.
027200         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
027300 01  CCVS-E-3.
027400     02  FILLER PICTURE X(22) VALUE
027500     " FOR OFFICIAL USE ONLY".
027600     02  FILLER PICTURE X(12) VALUE SPACE.
027700     02  FILLER PICTURE X(58) VALUE
027800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027900     02  FILLER PICTURE X(13) VALUE SPACE.
028000     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
028100 01  CCVS-E-4.
028200     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
028300     02 FILLER PIC XXXX VALUE " OF ".
028400     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
028500     02 FILLER PIC X(40) VALUE
028600      "  TESTS WERE EXECUTED SUCCESSFULLY".
028700 01  XXINFO.
028800     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
028900     02 INFO-TEXT.
029000     04 FILLER PIC X(20) VALUE SPACE.
029100     04 XXCOMPUTED PIC X(20).
029200     04 FILLER PIC X(5) VALUE SPACE.
029300     04 XXCORRECT PIC X(20).
029400 01  HYPHEN-LINE.
029500     02 FILLER PICTURE IS X VALUE IS SPACE.
029600     02 FILLER PICTURE IS X(65) VALUE IS "************************
029700-    "*****************************************".
029800     02 FILLER PICTURE IS X(54) VALUE IS "************************
029900-    "******************************".
030000 01  CCVS-PGM-ID PIC X(6) VALUE
030100     "OBSQ3A".
030200 PROCEDURE DIVISION.
030300 CCVS1 SECTION.
030400 OPEN-FILES.
030500P    OPEN I-O RAW-DATA.
030600P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
030700P    READ RAW-DATA INVALID KEY GO TO END-E-1.
030800P    MOVE "ABORTED " TO C-ABORT.
030900P    ADD 1 TO C-NO-OF-TESTS.
031000P    ACCEPT C-DATE  FROM DATE.
031100P    ACCEPT C-TIME  FROM TIME.
031200P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
031300PEND-E-1.
031400P    CLOSE RAW-DATA.
031500     OPEN     OUTPUT PRINT-FILE.
031600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
031700     MOVE    SPACE TO TEST-RESULTS.
031800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
031900     MOVE ZERO TO REC-SKL-SUB.
032000     PERFORM CCVS-INIT-FILE 9 TIMES.
032100 CCVS-INIT-FILE.
032200     ADD 1 TO REC-SKL-SUB.
032300     MOVE FILE-RECORD-INFO-SKELETON TO
032400                  FILE-RECORD-INFO (REC-SKL-SUB).
032500 CCVS-INIT-EXIT.
032600     GO TO CCVS1-EXIT.
032700 CLOSE-FILES.
032800     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
032900P    OPEN I-O RAW-DATA.
033000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
033100P    READ RAW-DATA INVALID KEY GO TO END-E-2.
033200P    MOVE "OK.     " TO C-ABORT.
033300P    MOVE PASS-COUNTER TO C-OK.
033400P    MOVE ERROR-HOLD   TO C-ALL.
033500P    MOVE ERROR-COUNTER TO C-FAIL.
033600P    MOVE DELETE-CNT TO C-DELETED.
033700P    MOVE INSPECT-COUNTER TO C-INSPECT.
033800P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
033900PEND-E-2.
034000P    CLOSE RAW-DATA.
034100 TERMINATE-CCVS.
034200S    EXIT PROGRAM.
034300STERMINATE-CALL.
034400     STOP     RUN.
034500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
034600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
034700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
034800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
034900     MOVE "****TEST DELETED****" TO RE-MARK.
035000 PRINT-DETAIL.
035100     IF REC-CT NOT EQUAL TO ZERO
035200             MOVE "." TO PARDOT-X
035300             MOVE REC-CT TO DOTVALUE.
035400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
035500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
035600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
035700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
035800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
035900     MOVE SPACE TO CORRECT-X.
036000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
036100     MOVE     SPACE TO RE-MARK.
036200 HEAD-ROUTINE.
036300     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036400     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
036500     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
036600 COLUMN-NAMES-ROUTINE.
036700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
037000 END-ROUTINE.
037100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
037200 END-RTN-EXIT.
037300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037400 END-ROUTINE-1.
037500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
037600      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
037700      ADD PASS-COUNTER TO ERROR-HOLD.
037800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
037900      MOVE PASS-COUNTER TO CCVS-E-4-1.
038000      MOVE ERROR-HOLD TO CCVS-E-4-2.
038100      MOVE CCVS-E-4 TO CCVS-E-2-2.
038200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
038300  END-ROUTINE-12.
038400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
038500     IF       ERROR-COUNTER IS EQUAL TO ZERO
038600         MOVE "NO " TO ERROR-TOTAL
038700         ELSE
038800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
038900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
039000     PERFORM WRITE-LINE.
039100 END-ROUTINE-13.
039200     IF DELETE-CNT IS EQUAL TO ZERO
039300         MOVE "NO " TO ERROR-TOTAL  ELSE
039400         MOVE DELETE-CNT TO ERROR-TOTAL.
039500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
039600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
039700      IF   INSPECT-COUNTER EQUAL TO ZERO
039800          MOVE "NO " TO ERROR-TOTAL
039900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
040000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
040100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
040200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
040300 WRITE-LINE.
040400     ADD 1 TO RECORD-COUNT.
040500Y    IF RECORD-COUNT GREATER 50
040600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
040700Y        MOVE SPACE TO DUMMY-RECORD
040800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
040900Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
041000Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
041100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
041200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
041300Y        MOVE ZERO TO RECORD-COUNT.
041400     PERFORM WRT-LN.
041500 WRT-LN.
041600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
041700     MOVE SPACE TO DUMMY-RECORD.
041800 BLANK-LINE-PRINT.
041900     PERFORM WRT-LN.
042000 FAIL-ROUTINE.
042100     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
042200     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
042300     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
042400     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042500     GO TO FAIL-ROUTINE-EX.
042600 FAIL-ROUTINE-WRITE.
042700     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
042800     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
042900 FAIL-ROUTINE-EX. EXIT.
043000 BAIL-OUT.
043100     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
043200     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
043300 BAIL-OUT-WRITE.
043400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
043500     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043600 BAIL-OUT-EX. EXIT.
043700 CCVS1-EXIT.
043800     EXIT.
043900 SECT-OBSQ3A-0001 SECTION.
044000 SEQ-INIT-001.
044100*             THIS TEST CREATES FILE SQ-FS1 AS THE FIRST FILE
044200*             ON MULTIPLE FILE TAPE ONE.  THIS FILE IS CLOSED
044300*             WITH NO REWIND.
044400     PERFORM BUILD-RECORD.
044500     MOVE "SQ-FS1" TO XFILE-NAME (1).
044600     MOVE "RC"    TO CHARS-OR-RECORDS (1).
044700     MOVE 1        TO XBLOCK-SIZE (1).
044800     OPEN OUTPUT SQ-FS1.
044900 SEQ-TEST-001.
045000     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS1R1-F-G-120.
045100     WRITE SQ-FS1R1-F-G-120.
045200     IF XRECORD-NUMBER (1) EQUAL TO 750
045300              GO TO SEQ-WRITE-001.
045400     ADD 1 TO XRECORD-NUMBER (1).
045500     GO TO SEQ-TEST-001.
045600 SEQ-WRITE-001.
045700     MOVE "CREATE FILE SQ-FS1" TO FEATURE.
045800     MOVE "SEQ-TEST-001" TO PAR-NAME.
045900     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
046000     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
046100     PERFORM PRINT-DETAIL.
046200 SEQ-CLOSE-001.
046300     CLOSE SQ-FS1 WITH NO REWIND.
046400 SEQ-INIT-002.
046500*             THIS TEST CREATES FILE SQ-FS2 AS THE SECOND FILE
046600*             ON MULTIPLE FILE TAPE ONE.  THIS FILE IS OPENED
046700*             AND CLOSED WITH NO REWIND.
046800     PERFORM BUILD-RECORD.
046900     MOVE "SQ-FS2" TO XFILE-NAME (1).
047000     MOVE "RC"     TO CHARS-OR-RECORDS (1).
047100     MOVE 5        TO XBLOCK-SIZE (1).
047200     OPEN OUTPUT SQ-FS2 WITH NO REWIND.
047300 SEQ-TEST-002.
047400     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS2R1-F-G-120.
047500     WRITE SQ-FS2R1-F-G-120.
047600     IF XRECORD-NUMBER (1) EQUAL TO 750
047700              GO TO SEQ-WRITE-002.
047800     ADD 1 TO XRECORD-NUMBER (1).
047900     GO TO SEQ-TEST-002.
048000 SEQ-WRITE-002.
048100     MOVE "CREATE FILE SQ-FS2" TO FEATURE.
048200     MOVE "SEQ-TEST-002" TO PAR-NAME.
048300     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
048400     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
048500     PERFORM PRINT-DETAIL.
048600 SEQ-CLOSE-002.
048700     CLOSE SQ-FS2 WITH NO REWIND.
048800 SEQ-INIT-003.
048900*             THIS TEST CREATES FILE SQ-FS3 AS THE THIRD FILE
049000*             ON MULTIPLE FILE TAPE ONE.  THIS FILE IS OPENED
049100*             AND CLOSED WITH NO REWIND.
049200     PERFORM BUILD-RECORD.
049300     MOVE "SQ-FS3" TO XFILE-NAME (1).
049400     MOVE "CH"     TO CHARS-OR-RECORDS (1).
049500     MOVE 1200     TO XBLOCK-SIZE (1).
049600     OPEN OUTPUT SQ-FS3 NO REWIND.
049700 SEQ-TEST-003.
049800     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS3R1-F-G-120.
049900     WRITE SQ-FS3R1-F-G-120.
050000     IF XRECORD-NUMBER (1) EQUAL TO 750
050100              GO TO SEQ-WRITE-003.
050200     ADD 1 TO XRECORD-NUMBER (1).
050300     GO TO SEQ-TEST-003.
050400 SEQ-WRITE-003.
050500     MOVE "CREATE FILE SQ-FS3" TO FEATURE.
050600     MOVE "SEQ-TEST-003" TO PAR-NAME.
050700     MOVE "FILE CREATED, RECS=" TO COMPUTED-A.
050800     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
050900     PERFORM PRINT-DETAIL.
051000 SEQ-CLOSE-003.
051100     CLOSE SQ-FS3 WITH NO REWIND.
051200 SEQ-INIT-004.
051300*             THIS TEST CREATES FILE SQ-FS4 AS THE FOURTH AND LAST
051400*             FILE ON MULTIPLE FILE TAPE ONE.  THIS FILE IS OPENED
051500*             WITH NO REWIND.
051600     PERFORM BUILD-RECORD.
051700     MOVE "SQ-FS4" TO XFILE-NAME (1).
051800     MOVE "RC"     TO CHARS-OR-RECORDS (1).
051900     MOVE 10       TO XBLOCK-SIZE (1).
052000     OPEN OUTPUT SQ-FS4 WITH NO REWIND.
052100 SEQ-TEST-004.
052200     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS4R1-F-G-120.
052300     WRITE SQ-FS4R1-F-G-120.
052400     IF XRECORD-NUMBER (1) EQUAL TO 750
052500              GO TO SEQ-WRITE-004.
052600     ADD 1 TO XRECORD-NUMBER (1).
052700     GO TO SEQ-TEST-004.
052800 SEQ-WRITE-004.
052900     MOVE "CREATE FILE SQ-FS4" TO FEATURE.
053000     MOVE "SEQ-TEST-004" TO PAR-NAME.
053100     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
053200     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
053300     PERFORM PRINT-DETAIL.
053400 SEQ-CLOSE-004.
053500     CLOSE SQ-FS4.
053600 SEQ-INIT-005.
053700*             THIS TEST CREATES FILE SQ-FS5 AS THE FIRST FILE ON
053800*             MULTIPLE FILE TAPE TWO.  THE POSITION PHRASE IS
053900*             USED IN THE MULTIPLE FILE CLAUSE.
054000     PERFORM BUILD-RECORD.
054100     MOVE "SQ-FS5" TO XFILE-NAME (1).
054200     MOVE "RC"     TO CHARS-OR-RECORDS (1).
054300     MOVE 5        TO XBLOCK-SIZE (1).
054400     OPEN OUTPUT SQ-FS5.
054500 SEQ-TEST-005.
054600     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS5R1-F-G-120.
054700     WRITE SQ-FS5R1-F-G-120.
054800     IF XRECORD-NUMBER (1) EQUAL TO 750
054900              GO TO SEQ-WRITE-005.
055000     ADD 1 TO XRECORD-NUMBER (1).
055100     GO TO SEQ-TEST-005.
055200 SEQ-WRITE-005.
055300     MOVE "CREATE FILE SQ-FS5" TO FEATURE.
055400     MOVE "SEQ-TEST-005" TO PAR-NAME.
055500     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
055600     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
055700     PERFORM PRINT-DETAIL.
055800 SEQ-CLOSE-005.
055900     CLOSE SQ-FS5.
056000 SEQ-INIT-006.
056100*             THIS  TEST CREATES FILE SQ-FS6 AS THE SECOND FILE
056200*             ON MULTIPLE FILE TAPE TWO.  THE POSITION PHRASE IS
056300*             USED IN THE MULTIPLE FILE CLAUSE.
056400     PERFORM BUILD-RECORD.
056500     MOVE "SQ-FS6" TO XFILE-NAME (1).
056600     MOVE "RC"     TO CHARS-OR-RECORDS (1).
056700     MOVE 10       TO XBLOCK-SIZE (1).
056800     OPEN OUTPUT SQ-FS6.
056900 SEQ-TEST-006.
057000     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS6R1-F-G-120.
057100     WRITE SQ-FS6R1-F-G-120.
057200     IF XRECORD-NUMBER (1) EQUAL TO 750
057300              GO TO SEQ-WRITE-006.
057400     ADD 1 TO XRECORD-NUMBER (1).
057500     GO TO SEQ-TEST-006.
057600 SEQ-WRITE-006.
057700     MOVE "CREATE FILE SQ-FS6" TO FEATURE.
057800     MOVE "SEQ-TEST-006" TO PAR-NAME.
057900     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
058000     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
058100     PERFORM PRINT-DETAIL.
058200 SEQ-CLOSE-006.
058300     CLOSE SQ-FS6.
058400 SEQ-INIT-007.
058500*             THIS TEST CREATES FILE SQ-FS7 AS THE THIRD FILE
058600*             ON MULTIPLE FILE TAPE TWO.  THE POSITION PHRASE IS
058700*             USED IN THE MULTIPLE FILE CLAUSE.
058800     PERFORM BUILD-RECORD.
058900     MOVE "SQ-FS7" TO XFILE-NAME (1).
059000     MOVE "CH"     TO CHARS-OR-RECORDS (1).
059100     MOVE 2400     TO XBLOCK-SIZE (1).
059200     OPEN OUTPUT SQ-FS7.
059300 SEQ-TEST-007.
059400     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS7R1-F-G-120.
059500     WRITE SQ-FS7R1-F-G-120.
059600     IF XRECORD-NUMBER (1) EQUAL TO 750
059700              GO TO SEQ-WRITE-007.
059800     ADD 1 TO XRECORD-NUMBER (1).
059900     GO TO SEQ-TEST-007.
060000 SEQ-WRITE-007.
060100     MOVE "CREATE FILE SQ-FS7" TO FEATURE.
060200     MOVE "SEQ-TEST-007" TO PAR-NAME.
060300     MOVE "FILE CREATED, RECS-=" TO COMPUTED-A.
060400     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
060500     PERFORM PRINT-DETAIL.
060600 SEQ-CLOSE-007.
060700     CLOSE SQ-FS7.
060800 SEQ-INIT-008.
060900*             THIS TEST CREATES FILE SQ-FS8 AS THE FOURTH AND LAST
061000*             FILE ON MULTIPLE FILE TAPE TWO.  THE POSITION PHRASE
061100*             IS USED IN THE MULTIPLE FILE CLAUSE.
061200     PERFORM BUILD-RECORD.
061300     MOVE "SQ-FS8" TO XFILE-NAME (1).
061400     MOVE "CH"     TO CHARS-OR-RECORDS (1).
061500     MOVE 120      TO XBLOCK-SIZE (1).
061600     OPEN OUTPUT SQ-FS8.
061700 SEQ-TEST-008.
061800     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS8R1-F-G-120.
061900     WRITE SQ-FS8R1-F-G-120.
062000     IF XRECORD-NUMBER (1) EQUAL 750
062100              GO TO SEQ-WRITE-008.
062200     ADD 1 TO XRECORD-NUMBER (1).
062300     GO TO SEQ-TEST-008.
062400 SEQ-WRITE-008.
062500     MOVE "CREATE FILE SQ-FS8" TO FEATURE.
062600     MOVE "SEQ-TEST-008" TO PAR-NAME.
062700     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
062800     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
062900     PERFORM PRINT-DETAIL.
063000 SEQ-CLOSE-008.
063100     CLOSE SQ-FS8.
063200 OBSQ3A-END-ROUTINE.
063300     MOVE "END OF OBSQ3A VALIDATION TESTS" TO PRINT-REC.
063400     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
063500 TERMINATE-OBSQ3A.
063600     GO TO CCVS-EXIT.
063700 BUILD-RECORD.
063800     MOVE "R1-F-G" TO XRECORD-NAME (1).
063900     MOVE "OBSQ3A" TO XPROGRAM-NAME (1).
064000     MOVE 120      TO XRECORD-LENGTH (1).
064100     MOVE 750      TO RECORDS-IN-FILE (1).
064200     MOVE "SQ"     TO XFILE-ORGANIZATION (1).
064300     MOVE "S"      TO XLABEL-TYPE (1).
064400     MOVE 1        TO XRECORD-NUMBER (1).
064500 CCVS-EXIT SECTION.
064600 CCVS-999999.
064700     GO TO CLOSE-FILES.
