000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL108A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-61  - "LITERAL" IN "ASSIGN TO" CLAUSE FOR           *
001800*                RELATIVE I-O DATA FILE.                       *
001900*        X-69  - ADDITIONAL "VALUE OF" CLAUSE.                 *
002000*        X-74  - VALUE OF IMPLEMENTOR-NAME.                    *
002100*        X-75  - OBJECT OF "VALUE" CLAUSE.                     *
002200*        X-82  - SOURCE COMPUTER NAME.                         *
002300*        X-83  - OBJECT COMPUTER NAME.                         *
002400*                                                              *
002500****************************************************************
002600*RL108A *
002700***************************************************
002800*GENERAL:    THIS RUN UNIT IS THE FIRST OF A SERIES WHICH
002900*            PROCESSES A RELATIVE I-O FILE.  THE FUNCTION OF THIS
003000*            PROGRAM IS TO CREATE A RELATIVE FILE SEQUENTIALLY
003100*            (ACCESS MODE SEQUENTIAL) AND VERIFY THAT IT WAS
003200*            CREATED CORRECTLY.  THE FILE IS IDENTIFED AS "RL-FS1"
003300*            AND IS PASSED TO SUBSEQUENT RUN UNITS FOR PROCESSING.
003400*
003500*    THIS PROGRAM TESTS THE NEW SYNTACTICAL CONSTRUCTS AND
003600*    SEMANTIC ACTIONS OF THE FOLLOWING ELEMENTS:
003700*        - ASSIGN
003800*        - ORGANIZATION
003900*        - ACCESS
004000*        - READ
004100*        - WRITE
004200****************************************************************
004300 ENVIRONMENT DIVISION.
004400 CONFIGURATION SECTION.
004500 SOURCE-COMPUTER.
004600     XXXXX082.
004700 OBJECT-COMPUTER.
004800     XXXXX083.
004900 INPUT-OUTPUT SECTION.
005000 FILE-CONTROL.
005100     SELECT PRINT-FILE ASSIGN TO
005200     XXXXX055.
005300     SELECT   RL-FS1 ASSIGN TO
005400     XXXXX061
005500             ORGANIZATION RELATIVE
005600             ACCESS SEQUENTIAL.
005700*
005800 DATA DIVISION.
005900 FILE SECTION.
006000 FD  PRINT-FILE.
006100 01  PRINT-REC PICTURE X(120).
006200 01  DUMMY-RECORD PICTURE X(120).
006300 FD  RL-FS1
006400     LABEL RECORDS STANDARD
006500C    VALUE OF
006600C    XXXXX074
006700C    IS
006800C    XXXXX075
006900G    XXXXX069
007000     BLOCK CONTAINS 1 RECORDS
007100     RECORD CONTAINS 120 CHARACTERS.
007200 01  RL-FS1R1-F-G-120.
007300     02 FILLER PIC X(120).
007400 WORKING-STORAGE SECTION.
007500 01  WRK-CS-09V00 PIC S9(9) USAGE COMP VALUE ZERO.
007600 01  FILE-RECORD-INFORMATION-REC.
007700     03 FILE-RECORD-INFO-SKELETON.
007800        05 FILLER                 PICTURE X(48)       VALUE
007900             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
008000        05 FILLER                 PICTURE X(46)       VALUE
008100             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
008200        05 FILLER                 PICTURE X(26)       VALUE
008300             ",LFIL=000000,ORG=  ,LBLR= ".
008400        05 FILLER                 PICTURE X(37)       VALUE
008500             ",RECKEY=                             ".
008600        05 FILLER                 PICTURE X(38)       VALUE
008700             ",ALTKEY1=                             ".
008800        05 FILLER                 PICTURE X(38)       VALUE
008900             ",ALTKEY2=                             ".
009000        05 FILLER                 PICTURE X(7)        VALUE SPACE.
009100     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
009200        05 FILE-RECORD-INFO-P1-120.
009300           07 FILLER              PIC X(5).
009400           07 XFILE-NAME           PIC X(6).
009500           07 FILLER              PIC X(8).
009600           07 XRECORD-NAME         PIC X(6).
009700           07 FILLER              PIC X(1).
009800           07 REELUNIT-NUMBER     PIC 9(1).
009900           07 FILLER              PIC X(7).
010000           07 XRECORD-NUMBER       PIC 9(6).
010100           07 FILLER              PIC X(6).
010200           07 UPDATE-NUMBER       PIC 9(2).
010300           07 FILLER              PIC X(5).
010400           07 ODO-NUMBER          PIC 9(4).
010500           07 FILLER              PIC X(5).
010600           07 XPROGRAM-NAME        PIC X(5).
010700           07 FILLER              PIC X(7).
010800           07 XRECORD-LENGTH       PIC 9(6).
010900           07 FILLER              PIC X(7).
011000           07 CHARS-OR-RECORDS    PIC X(2).
011100           07 FILLER              PIC X(1).
011200           07 XBLOCK-SIZE          PIC 9(4).
011300           07 FILLER              PIC X(6).
011400           07 RECORDS-IN-FILE     PIC 9(6).
011500           07 FILLER              PIC X(5).
011600           07 XFILE-ORGANIZATION   PIC X(2).
011700           07 FILLER              PIC X(6).
011800           07 XLABEL-TYPE          PIC X(1).
011900        05 FILE-RECORD-INFO-P121-240.
012000           07 FILLER              PIC X(8).
012100           07 XRECORD-KEY          PIC X(29).
012200           07 FILLER              PIC X(9).
012300           07 ALTERNATE-KEY1      PIC X(29).
012400           07 FILLER              PIC X(9).
012500           07 ALTERNATE-KEY2      PIC X(29).
012600           07 FILLER              PIC X(7).
012700 01  TEST-RESULTS.
012800     02 FILLER                   PIC X      VALUE SPACE.
012900     02 FEATURE                  PIC X(20)  VALUE SPACE.
013000     02 FILLER                   PIC X      VALUE SPACE.
013100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
013200     02 FILLER                   PIC X      VALUE SPACE.
013300     02  PAR-NAME.
013400       03 FILLER                 PIC X(19)  VALUE SPACE.
013500       03  PARDOT-X              PIC X      VALUE SPACE.
013600       03 DOTVALUE               PIC 99     VALUE ZERO.
013700     02 FILLER                   PIC X(8)   VALUE SPACE.
013800     02 RE-MARK                  PIC X(61).
013900 01  TEST-COMPUTED.
014000     02 FILLER                   PIC X(30)  VALUE SPACE.
014100     02 FILLER                   PIC X(17)  VALUE
014200            "       COMPUTED=".
014300     02 COMPUTED-X.
014400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
014500     03 COMPUTED-N               REDEFINES COMPUTED-A
014600                                 PIC -9(9).9(9).
014700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
014800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
014900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015000     03       CM-18V0 REDEFINES COMPUTED-A.
015100         04 COMPUTED-18V0                    PIC -9(18).
015200         04 FILLER                           PIC X.
015300     03 FILLER PIC X(50) VALUE SPACE.
015400 01  TEST-CORRECT.
015500     02 FILLER PIC X(30) VALUE SPACE.
015600     02 FILLER PIC X(17) VALUE "       CORRECT =".
015700     02 CORRECT-X.
015800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
015900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
016100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
016200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
016300     03      CR-18V0 REDEFINES CORRECT-A.
016400         04 CORRECT-18V0                     PIC -9(18).
016500         04 FILLER                           PIC X.
016600     03 FILLER PIC X(2) VALUE SPACE.
016700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
016800 01  CCVS-C-1.
016900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017000-    "SS  PARAGRAPH-NAME
017100-    "       REMARKS".
017200     02 FILLER                     PIC X(20)    VALUE SPACE.
017300 01  CCVS-C-2.
017400     02 FILLER                     PIC X        VALUE SPACE.
017500     02 FILLER                     PIC X(6)     VALUE "TESTED".
017600     02 FILLER                     PIC X(15)    VALUE SPACE.
017700     02 FILLER                     PIC X(4)     VALUE "FAIL".
017800     02 FILLER                     PIC X(94)    VALUE SPACE.
017900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018000 01  REC-CT                        PIC 99       VALUE ZERO.
018100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
018200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
018300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
018400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
018500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
018600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
018700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
018800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
018900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019000 01  CCVS-H-1.
019100     02  FILLER                    PIC X(39)    VALUE SPACES.
019200     02  FILLER                    PIC X(42)    VALUE
019300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
019400     02  FILLER                    PIC X(39)    VALUE SPACES.
019500 01  CCVS-H-2A.
019600   02  FILLER                        PIC X(40)  VALUE SPACE.
019700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
019800   02  FILLER                        PIC XXXX   VALUE
019900     "4.2 ".
020000   02  FILLER                        PIC X(28)  VALUE
020100            " COPY - NOT FOR DISTRIBUTION".
020200   02  FILLER                        PIC X(41)  VALUE SPACE.
020300
020400 01  CCVS-H-2B.
020500   02  FILLER                        PIC X(15)  VALUE
020600            "TEST RESULT OF ".
020700   02  TEST-ID                       PIC X(9).
020800   02  FILLER                        PIC X(4)   VALUE
020900            " IN ".
021000   02  FILLER                        PIC X(12)  VALUE
021100     " HIGH       ".
021200   02  FILLER                        PIC X(22)  VALUE
021300            " LEVEL VALIDATION FOR ".
021400   02  FILLER                        PIC X(58)  VALUE
021500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021600 01  CCVS-H-3.
021700     02  FILLER                      PIC X(34)  VALUE
021800            " FOR OFFICIAL USE ONLY    ".
021900     02  FILLER                      PIC X(58)  VALUE
022000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022100     02  FILLER                      PIC X(28)  VALUE
022200            "  COPYRIGHT   1985 ".
022300 01  CCVS-E-1.
022400     02 FILLER                       PIC X(52)  VALUE SPACE.
022500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
022600     02 ID-AGAIN                     PIC X(9).
022700     02 FILLER                       PIC X(45)  VALUE SPACES.
022800 01  CCVS-E-2.
022900     02  FILLER                      PIC X(31)  VALUE SPACE.
023000     02  FILLER                      PIC X(21)  VALUE SPACE.
023100     02 CCVS-E-2-2.
023200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
023300         03 FILLER                   PIC X      VALUE SPACE.
023400         03 ENDER-DESC               PIC X(44)  VALUE
023500            "ERRORS ENCOUNTERED".
023600 01  CCVS-E-3.
023700     02  FILLER                      PIC X(22)  VALUE
023800            " FOR OFFICIAL USE ONLY".
023900     02  FILLER                      PIC X(12)  VALUE SPACE.
024000     02  FILLER                      PIC X(58)  VALUE
024100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024200     02  FILLER                      PIC X(13)  VALUE SPACE.
024300     02 FILLER                       PIC X(15)  VALUE
024400             " COPYRIGHT 1985".
024500 01  CCVS-E-4.
024600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
024700     02 FILLER                       PIC X(4)   VALUE " OF ".
024800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
024900     02 FILLER                       PIC X(40)  VALUE
025000      "  TESTS WERE EXECUTED SUCCESSFULLY".
025100 01  XXINFO.
025200     02 FILLER                       PIC X(19)  VALUE
025300            "*** INFORMATION ***".
025400     02 INFO-TEXT.
025500       04 FILLER                     PIC X(8)   VALUE SPACE.
025600       04 XXCOMPUTED                 PIC X(20).
025700       04 FILLER                     PIC X(5)   VALUE SPACE.
025800       04 XXCORRECT                  PIC X(20).
025900     02 INF-ANSI-REFERENCE           PIC X(48).
026000 01  HYPHEN-LINE.
026100     02 FILLER  PIC IS X VALUE IS SPACE.
026200     02 FILLER  PIC IS X(65)    VALUE IS "************************
026300-    "*****************************************".
026400     02 FILLER  PIC IS X(54)    VALUE IS "************************
026500-    "******************************".
026600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
026700     "RL108A".
026800 PROCEDURE DIVISION.
026900 CCVS1 SECTION.
027000 OPEN-FILES.
027100     OPEN    OUTPUT PRINT-FILE.
027200     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027300     MOVE    SPACE TO TEST-RESULTS.
027400     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
027500     MOVE    ZERO TO REC-SKL-SUB.
027600     PERFORM CCVS-INIT-FILE 9 TIMES.
027700 CCVS-INIT-FILE.
027800     ADD     1 TO REC-SKL-SUB.
027900     MOVE    FILE-RECORD-INFO-SKELETON
028000          TO FILE-RECORD-INFO (REC-SKL-SUB).
028100 CCVS-INIT-EXIT.
028200     GO TO CCVS1-EXIT.
028300 CLOSE-FILES.
028400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028500 TERMINATE-CCVS.
028600S    EXIT PROGRAM.
028700STERMINATE-CALL.
028800     STOP     RUN.
028900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029300     MOVE "****TEST DELETED****" TO RE-MARK.
029400 PRINT-DETAIL.
029500     IF REC-CT NOT EQUAL TO ZERO
029600             MOVE "." TO PARDOT-X
029700             MOVE REC-CT TO DOTVALUE.
029800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
029900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030300     MOVE SPACE TO CORRECT-X.
030400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030500     MOVE     SPACE TO RE-MARK.
030600 HEAD-ROUTINE.
030700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031100 COLUMN-NAMES-ROUTINE.
031200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031500 END-ROUTINE.
031600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031700 END-RTN-EXIT.
031800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031900 END-ROUTINE-1.
032000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032200      ADD PASS-COUNTER TO ERROR-HOLD.
032300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032400      MOVE PASS-COUNTER TO CCVS-E-4-1.
032500      MOVE ERROR-HOLD TO CCVS-E-4-2.
032600      MOVE CCVS-E-4 TO CCVS-E-2-2.
032700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
032800  END-ROUTINE-12.
032900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033000     IF       ERROR-COUNTER IS EQUAL TO ZERO
033100         MOVE "NO " TO ERROR-TOTAL
033200         ELSE
033300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033500     PERFORM WRITE-LINE.
033600 END-ROUTINE-13.
033700     IF DELETE-COUNTER IS EQUAL TO ZERO
033800         MOVE "NO " TO ERROR-TOTAL  ELSE
033900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034200      IF   INSPECT-COUNTER EQUAL TO ZERO
034300          MOVE "NO " TO ERROR-TOTAL
034400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034800 WRITE-LINE.
034900     ADD 1 TO RECORD-COUNT.
035000Y    IF RECORD-COUNT GREATER 50
035100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035200Y        MOVE SPACE TO DUMMY-RECORD
035300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035400Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
035500Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
035600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
035700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
035800Y        MOVE ZERO TO RECORD-COUNT.
035900     PERFORM WRT-LN.
036000 WRT-LN.
036100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036200     MOVE SPACE TO DUMMY-RECORD.
036300 BLANK-LINE-PRINT.
036400     PERFORM WRT-LN.
036500 FAIL-ROUTINE.
036600     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
036900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037100     MOVE   SPACES TO INF-ANSI-REFERENCE.
037200     GO TO  FAIL-ROUTINE-EX.
037300 FAIL-ROUTINE-WRITE.
037400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
037600     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
037700     MOVE   SPACES TO COR-ANSI-REFERENCE.
037800 FAIL-ROUTINE-EX. EXIT.
037900 BAIL-OUT.
038000     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038100     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038200 BAIL-OUT-WRITE.
038300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038600     MOVE   SPACES TO INF-ANSI-REFERENCE.
038700 BAIL-OUT-EX. EXIT.
038800 CCVS1-EXIT.
038900     EXIT.
039000 SECT-RL108A-001 SECTION.
039100 REL-INIT-001.
039200     MOVE     "FILE CREATE RL-FS1" TO FEATURE.
039300     OPEN     OUTPUT    RL-FS1.
039400     MOVE     "RL-FS1" TO XFILE-NAME (1).
039500     MOVE     "R1-F-G" TO XRECORD-NAME (1).
039600     MOVE CCVS-PGM-ID  TO XPROGRAM-NAME (1).
039700     MOVE     000120   TO XRECORD-LENGTH (1).
039800     MOVE     "RC"     TO CHARS-OR-RECORDS (1).
039900     MOVE     0001     TO XBLOCK-SIZE (1).
040000     MOVE     000500   TO RECORDS-IN-FILE (1).
040100     MOVE     "RL"     TO XFILE-ORGANIZATION (1).
040200     MOVE     "S"      TO XLABEL-TYPE (1).
040300     MOVE     000001   TO XRECORD-NUMBER (1).
040400 REL-TEST-001.
040500     MOVE    FILE-RECORD-INFO-P1-120 (1) TO RL-FS1R1-F-G-120.
040600     WRITE   RL-FS1R1-F-G-120
040700             INVALID KEY GO TO REL-FAIL-001
040800         NOT INVALID KEY GO TO REL-TEST-001-A
040900     END-WRITE.
041000 REL-TEST-001-A.
041100     IF      XRECORD-NUMBER (1) EQUAL TO 500
041200             GO TO REL-WRITE-001.
041300     ADD     000001 TO XRECORD-NUMBER (1).
041400     GO      TO REL-TEST-001.
041500 REL-DELETE-001.
041600     PERFORM DE-LETE.
041700     GO TO   REL-WRITE-001.
041800 REL-FAIL-001.
041900     PERFORM FAIL.
042000     MOVE   "BOUNDARY VIOLATION"  TO RE-MARK.
042100 REL-WRITE-001.
042200     MOVE     "VIII-37 4.9.4(A)"   TO ANSI-REFERENCE.
042300     MOVE   "REL-TEST-001" TO   PAR-NAME
042400     MOVE   "FILE CREATED, LFILE "  TO COMPUTED-A.
042500     MOVE    XRECORD-NUMBER (1) TO CORRECT-18V0.
042600     PERFORM PRINT-DETAIL.
042700     CLOSE   RL-FS1.
042800 REL-INIT-002.
042900     OPEN    INPUT     RL-FS1.
043000     MOVE    ZERO      TO WRK-CS-09V00.
043100 REL-TEST-002.
043200     READ    RL-FS1
043300             AT END GO TO REL-TEST-002-1
043400         NOT AT END GO TO REL-TEST-002-A
043500     END-READ.
043600 REL-TEST-002-A.
043700     MOVE    RL-FS1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
043800     ADD     1 TO WRK-CS-09V00.
043900     IF      WRK-CS-09V00 GREATER 500
044000             MOVE "MORE THAN 500 RECORDS" TO RE-MARK
044100             GO TO REL-TEST-002-1.
044200     GO      TO REL-TEST-002.
044300 REL-DELETE-002.
044400     PERFORM DE-LETE.
044500     PERFORM PRINT-DETAIL.
044600     GO TO   CCVS-EXIT.
044700 REL-TEST-002-1.
044800     IF      XRECORD-NUMBER (1) NOT EQUAL TO 500
044900             PERFORM FAIL
045000     ELSE
045100             PERFORM PASS.
045200     GO      TO REL-WRITE-002.
045300 REL-WRITE-002.
045400     MOVE   "VIII-26 4.5.4" TO ANSI-REFERENCE.
045500     MOVE   "REL-TEST-002"  TO PAR-NAME.
045600     MOVE   "FILE VERIFIED, LFILE" TO COMPUTED-A.
045700     MOVE    XRECORD-NUMBER (1) TO CORRECT-18V0.
045800     PERFORM PRINT-DETAIL.
045900     CLOSE   RL-FS1.
046000 CCVS-EXIT SECTION.
046100 CCVS-999999.
046200     GO TO CLOSE-FILES.
