000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL113A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*            X-21   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR   *
001700*                    RELATIVE  I-O DATA FILE                   *
001800*            X-55   SYSTEM PRINTER                             *
001900*            X-69   ADDITIONAL VALUE OF CLAUSES                *
002000*            X-74   VALUE OF IMPLEMENTOR-NAME                  *
002100*            X-75   OBJECT OF VALUE OF CLAUSE                  *
002200*            X-82   SOURCE-COMPUTER                            *
002300*            X-83   OBJECT-COMPUTER.                           *
002400*                                                              *
002500****************************************************************
002600*    RL113A                                                    *
002700****************************************************************
002800*            THIS PROGRAM TESTS THE SYNTACTICAL CONSTRUCTS AND
002900*            SEMANTIC ACTIONS ASSOCIATED WITH THE "USE"
003000*            STATEMENT.
003100*
003200*
003300*            THIS PROGRAM CREATES A RELATIVE I-O FILE SEQUENTIALLY
003400*            (ACCESS MODE RANDOM)    AND THEN UPDATES SELECTIVE
003500*            RECORDS OF THE FILE.  THE FILE STATUS CONTENTS ARE
003600*            CAPTURED AND TESTED FOR ACCURACY FOR EACH OPEN, CLOSE
003700*            READ AND REWRITE STATEMENT USED.  THE READ, WRITE AND
003800*            REWRITE STATEMENTS ARE USED WITHOUT THE APPROPRIATE
003900*            AT END ON INVALID KEY PHRASES.  THE OMISSION OF THESE
004000*            PHRASES ARE PERMITTED IF AN APPLICABLE USE PROCEDURE
004100*            HAS BEEN SPECIFIED.
004200*
004300***************************************************
004400 ENVIRONMENT DIVISION.
004500 CONFIGURATION SECTION.
004600 SOURCE-COMPUTER.
004700     XXXXX082.
004800 OBJECT-COMPUTER.
004900     XXXXX083.
005000 INPUT-OUTPUT SECTION.
005100 FILE-CONTROL.
005200     SELECT PRINT-FILE ASSIGN TO
005300     XXXXX055.
005400     SELECT   RL-FD2 ASSIGN
005500     XXXXX022
005600              ORGANIZATION RELATIVE
005700              ACCESS  RANDOM
005800              RELATIVE  RL-FD2-KEY
005900         FILE STATUS IS RL-FD2-STATUS.
006000 DATA DIVISION.
006100 FILE SECTION.
006200 FD  PRINT-FILE.
006300 01  PRINT-REC PICTURE X(120).
006400 01  DUMMY-RECORD PICTURE X(120).
006500 FD  RL-FD2
006600C    VALUE OF
006700C    XXXXX074
006800C    IS
006900C    XXXXX076
007000G    XXXXX069
007100     LABEL RECORDS ARE STANDARD
007200     BLOCK CONTAINS 1 RECORDS
007300     DATA RECORD RL-FD2R1-F-G-240.
007400 01  RL-FD2R1-F-G-240.
007500     05 RL-FD2-WRK-120 PIC X(120).
007600     05 RL-FD2-GRP-120.
007700        10 RL-FD2-WRK-XN-0001-O120F
007800                        PICTURE X OCCURS 120 TIMES.
007900 WORKING-STORAGE SECTION.
008000 01  GRP-0001.
008100     05 RL-FD2-KEY   PIC 9(8)  VALUE ZERO.
008200     05 WRK-CS-09V00-012  PIC S9(9) USAGE COMP  VALUE ZERO.
008300     05 WRK-CS-09V00-013  PIC S9(9) USAGE COMP  VALUE ZERO.
008400     05 WRK-CS-09V00-014  PIC S9(9) USAGE COMP  VALUE ZERO.
008500     05 WRK-CS-09V00-015  PIC S9(9) USAGE COMP  VALUE ZERO.
008600     05 WRK-CS-09V00-016  PIC S9(9) USAGE COMP  VALUE ZERO.
008700     05 WRK-CS-09V00-017  PIC S9(9) USAGE COMP  VALUE ZERO.
008800     05 WRK-CS-09V00-018  PIC S9(9) USAGE COMP  VALUE ZERO.
008900     05 RL-FD2-STATUS     PIC  XX  VALUE  SPACE.
009000     05 WRK-XN-0002-001   PIC  X(2) VALUE  SPACE.
009100     05 WRK-XN-0002-002   PIC  X(2) VALUE  SPACE.
009200     05 WRK-XN-0002-003   PIC  X(2) VALUE  SPACE.
009300     05 WRK-XN-0002-004   PIC  X(2) VALUE  SPACE.
009400     05 WRK-XN-0002-005   PIC  X(2) VALUE  SPACE.
009500     05 WRK-XN-0002-006   PIC  X(2) VALUE  SPACE.
009600     05 WRK-XN-0002-007   PIC  X(2) VALUE  SPACE.
009700     05 WRK-XN-0002-008   PIC  X(2) VALUE  SPACE.
009800     05 WRK-XN-0002-009   PIC  X(2) VALUE  SPACE.
009900 01  FILE-RECORD-INFORMATION-REC.
010000     03 FILE-RECORD-INFO-SKELETON.
010100        05 FILLER                 PICTURE X(48)       VALUE
010200             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
010300        05 FILLER                 PICTURE X(46)       VALUE
010400             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
010500        05 FILLER                 PICTURE X(26)       VALUE
010600             ",LFIL=000000,ORG=  ,LBLR= ".
010700        05 FILLER                 PICTURE X(37)       VALUE
010800             ",RECKEY=                             ".
010900        05 FILLER                 PICTURE X(38)       VALUE
011000             ",ALTKEY1=                             ".
011100        05 FILLER                 PICTURE X(38)       VALUE
011200             ",ALTKEY2=                             ".
011300        05 FILLER                 PICTURE X(7)        VALUE SPACE.
011400     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
011500        05 FILE-RECORD-INFO-P1-120.
011600           07 FILLER              PIC X(5).
011700           07 XFILE-NAME           PIC X(6).
011800           07 FILLER              PIC X(8).
011900           07 XRECORD-NAME         PIC X(6).
012000           07 FILLER              PIC X(1).
012100           07 REELUNIT-NUMBER     PIC 9(1).
012200           07 FILLER              PIC X(7).
012300           07 XRECORD-NUMBER       PIC 9(6).
012400           07 FILLER              PIC X(6).
012500           07 UPDATE-NUMBER       PIC 9(2).
012600           07 FILLER              PIC X(5).
012700           07 ODO-NUMBER          PIC 9(4).
012800           07 FILLER              PIC X(5).
012900           07 XPROGRAM-NAME        PIC X(5).
013000           07 FILLER              PIC X(7).
013100           07 XRECORD-LENGTH       PIC 9(6).
013200           07 FILLER              PIC X(7).
013300           07 CHARS-OR-RECORDS    PIC X(2).
013400           07 FILLER              PIC X(1).
013500           07 XBLOCK-SIZE          PIC 9(4).
013600           07 FILLER              PIC X(6).
013700           07 RECORDS-IN-FILE     PIC 9(6).
013800           07 FILLER              PIC X(5).
013900           07 XFILE-ORGANIZATION   PIC X(2).
014000           07 FILLER              PIC X(6).
014100           07 XLABEL-TYPE          PIC X(1).
014200        05 FILE-RECORD-INFO-P121-240.
014300           07 FILLER              PIC X(8).
014400           07 XRECORD-KEY          PIC X(29).
014500           07 FILLER              PIC X(9).
014600           07 ALTERNATE-KEY1      PIC X(29).
014700           07 FILLER              PIC X(9).
014800           07 ALTERNATE-KEY2      PIC X(29).
014900           07 FILLER              PIC X(7).
015000 01  TEST-RESULTS.
015100     02 FILLER                   PIC X      VALUE SPACE.
015200     02 FEATURE                  PIC X(20)  VALUE SPACE.
015300     02 FILLER                   PIC X      VALUE SPACE.
015400     02 P-OR-F                   PIC X(5)   VALUE SPACE.
015500     02 FILLER                   PIC X      VALUE SPACE.
015600     02  PAR-NAME.
015700       03 FILLER                 PIC X(19)  VALUE SPACE.
015800       03  PARDOT-X              PIC X      VALUE SPACE.
015900       03 DOTVALUE               PIC 99     VALUE ZERO.
016000     02 FILLER                   PIC X(8)   VALUE SPACE.
016100     02 RE-MARK                  PIC X(61).
016200 01  TEST-COMPUTED.
016300     02 FILLER                   PIC X(30)  VALUE SPACE.
016400     02 FILLER                   PIC X(17)  VALUE
016500            "       COMPUTED=".
016600     02 COMPUTED-X.
016700     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
016800     03 COMPUTED-N               REDEFINES COMPUTED-A
016900                                 PIC -9(9).9(9).
017000     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
017100     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
017200     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
017300     03       CM-18V0 REDEFINES COMPUTED-A.
017400         04 COMPUTED-18V0                    PIC -9(18).
017500         04 FILLER                           PIC X.
017600     03 FILLER PIC X(50) VALUE SPACE.
017700 01  TEST-CORRECT.
017800     02 FILLER PIC X(30) VALUE SPACE.
017900     02 FILLER PIC X(17) VALUE "       CORRECT =".
018000     02 CORRECT-X.
018100     03 CORRECT-A                  PIC X(20) VALUE SPACE.
018200     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
018300     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
018400     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
018500     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
018600     03      CR-18V0 REDEFINES CORRECT-A.
018700         04 CORRECT-18V0                     PIC -9(18).
018800         04 FILLER                           PIC X.
018900     03 FILLER PIC X(2) VALUE SPACE.
019000     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
019100 01  CCVS-C-1.
019200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
019300-    "SS  PARAGRAPH-NAME
019400-    "       REMARKS".
019500     02 FILLER                     PIC X(20)    VALUE SPACE.
019600 01  CCVS-C-2.
019700     02 FILLER                     PIC X        VALUE SPACE.
019800     02 FILLER                     PIC X(6)     VALUE "TESTED".
019900     02 FILLER                     PIC X(15)    VALUE SPACE.
020000     02 FILLER                     PIC X(4)     VALUE "FAIL".
020100     02 FILLER                     PIC X(94)    VALUE SPACE.
020200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
020300 01  REC-CT                        PIC 99       VALUE ZERO.
020400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
020500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
020600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
020700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
020800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
020900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
021000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
021100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
021200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
021300 01  CCVS-H-1.
021400     02  FILLER                    PIC X(39)    VALUE SPACES.
021500     02  FILLER                    PIC X(42)    VALUE
021600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
021700     02  FILLER                    PIC X(39)    VALUE SPACES.
021800 01  CCVS-H-2A.
021900   02  FILLER                        PIC X(40)  VALUE SPACE.
022000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
022100   02  FILLER                        PIC XXXX   VALUE
022200     "4.2 ".
022300   02  FILLER                        PIC X(28)  VALUE
022400            " COPY - NOT FOR DISTRIBUTION".
022500   02  FILLER                        PIC X(41)  VALUE SPACE.
022600
022700 01  CCVS-H-2B.
022800   02  FILLER                        PIC X(15)  VALUE
022900            "TEST RESULT OF ".
023000   02  TEST-ID                       PIC X(9).
023100   02  FILLER                        PIC X(4)   VALUE
023200            " IN ".
023300   02  FILLER                        PIC X(12)  VALUE
023400     " HIGH       ".
023500   02  FILLER                        PIC X(22)  VALUE
023600            " LEVEL VALIDATION FOR ".
023700   02  FILLER                        PIC X(58)  VALUE
023800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
023900 01  CCVS-H-3.
024000     02  FILLER                      PIC X(34)  VALUE
024100            " FOR OFFICIAL USE ONLY    ".
024200     02  FILLER                      PIC X(58)  VALUE
024300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
024400     02  FILLER                      PIC X(28)  VALUE
024500            "  COPYRIGHT   1985 ".
024600 01  CCVS-E-1.
024700     02 FILLER                       PIC X(52)  VALUE SPACE.
024800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
024900     02 ID-AGAIN                     PIC X(9).
025000     02 FILLER                       PIC X(45)  VALUE SPACES.
025100 01  CCVS-E-2.
025200     02  FILLER                      PIC X(31)  VALUE SPACE.
025300     02  FILLER                      PIC X(21)  VALUE SPACE.
025400     02 CCVS-E-2-2.
025500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
025600         03 FILLER                   PIC X      VALUE SPACE.
025700         03 ENDER-DESC               PIC X(44)  VALUE
025800            "ERRORS ENCOUNTERED".
025900 01  CCVS-E-3.
026000     02  FILLER                      PIC X(22)  VALUE
026100            " FOR OFFICIAL USE ONLY".
026200     02  FILLER                      PIC X(12)  VALUE SPACE.
026300     02  FILLER                      PIC X(58)  VALUE
026400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026500     02  FILLER                      PIC X(13)  VALUE SPACE.
026600     02 FILLER                       PIC X(15)  VALUE
026700             " COPYRIGHT 1985".
026800 01  CCVS-E-4.
026900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
027000     02 FILLER                       PIC X(4)   VALUE " OF ".
027100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
027200     02 FILLER                       PIC X(40)  VALUE
027300      "  TESTS WERE EXECUTED SUCCESSFULLY".
027400 01  XXINFO.
027500     02 FILLER                       PIC X(19)  VALUE
027600            "*** INFORMATION ***".
027700     02 INFO-TEXT.
027800       04 FILLER                     PIC X(8)   VALUE SPACE.
027900       04 XXCOMPUTED                 PIC X(20).
028000       04 FILLER                     PIC X(5)   VALUE SPACE.
028100       04 XXCORRECT                  PIC X(20).
028200     02 INF-ANSI-REFERENCE           PIC X(48).
028300 01  HYPHEN-LINE.
028400     02 FILLER  PIC IS X VALUE IS SPACE.
028500     02 FILLER  PIC IS X(65)    VALUE IS "************************
028600-    "*****************************************".
028700     02 FILLER  PIC IS X(54)    VALUE IS "************************
028800-    "******************************".
028900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
029000     "RL113A".
029100 PROCEDURE DIVISION.
029200 DECLARATIVES.
029300 RL-FD2-01 SECTION.
029400     USE     AFTER ERROR PROCEDURE INPUT.
029500 RL-FD2-01-01.
029600     MOVE   "USE AFTER ERROR INPUT PROCEDURE SHOULD NOT BE OBEYED"
029700          TO RE-MARK.
029800     MOVE   "RL-FD2-01-01" TO PAR-NAME.
029900     MOVE   "FAIL*" TO P-OR-F.
030000     ADD     1 TO ERROR-COUNTER.
030100*
030200     IF      REC-CT NOT EQUAL TO ZERO
030300             MOVE "." TO PARDOT-X
030400             MOVE REC-CT TO DOTVALUE.
030500     MOVE    TEST-RESULTS TO PRINT-REC.
030600     PERFORM D1-WRITE-LINE THRU D1-WRITE-LINE-EXIT.
030700     IF      P-OR-F EQUAL TO "FAIL*"
030800             PERFORM D1-WRITE-LINE THRU D1-WRITE-LINE-EXIT
030900             PERFORM D1-FAIL-ROUTINE THRU D1-FAIL-ROUTINE-EX
031000      ELSE
031100             PERFORM D1-BAIL-OUT THRU D1-BAIL-OUT-EX.
031200     MOVE    SPACE TO P-OR-F.
031300     MOVE    SPACE TO COMPUTED-X.
031400     MOVE    SPACE TO CORRECT-X.
031500     IF      REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
031600     MOVE    SPACE TO RE-MARK.
031700     GO TO   RL-FD2-01-EXIT.
031800 D1-FAIL-ROUTINE.
031900     IF      COMPUTED-X NOT EQUAL TO SPACE
032000             GO TO   D1-FAIL-ROUTINE-WRITE.
032100     IF      CORRECT-X NOT EQUAL TO SPACE
032200             GO TO   D1-FAIL-ROUTINE-WRITE.
032300     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032400     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032500     MOVE    XXINFO TO DUMMY-RECORD.
032600     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
032700     MOVE    SPACE TO DUMMY-RECORD.
032800     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
032900     MOVE    SPACE TO DUMMY-RECORD.
033000     MOVE    SPACES TO INF-ANSI-REFERENCE.
033100     GO TO   D1-FAIL-ROUTINE-EX.
033200 D1-FAIL-ROUTINE-WRITE.
033300     MOVE    TEST-COMPUTED TO PRINT-REC.
033400     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
033500     MOVE    SPACE TO DUMMY-RECORD.
033600     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
033700     MOVE    TEST-CORRECT TO PRINT-REC.
033800     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
033900     MOVE    SPACE TO DUMMY-RECORD.
034000     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
034100     MOVE    SPACE TO DUMMY-RECORD.
034200     MOVE    SPACES TO COR-ANSI-REFERENCE.
034300 D1-FAIL-ROUTINE-EX.
034400     EXIT.
034500 D1-BAIL-OUT.
034600     IF      COMPUTED-A NOT EQUAL TO SPACE
034700             GO TO    D1-BAIL-OUT-WRITE.
034800     IF      CORRECT-A EQUAL TO SPACE
034900             GO TO    D1-BAIL-OUT-EX.
035000 D1-BAIL-OUT-WRITE.
035100     MOVE    CORRECT-A  TO XXCORRECT.
035200     MOVE    COMPUTED-A TO XXCOMPUTED.
035300     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
035400     MOVE    XXINFO TO DUMMY-RECORD.
035500     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
035600     MOVE    SPACE TO DUMMY-RECORD.
035700     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
035800     MOVE    SPACE TO DUMMY-RECORD.
035900     MOVE    SPACES TO INF-ANSI-REFERENCE.
036000 D1-BAIL-OUT-EX.
036100     EXIT.
036200 D1-WRITE-LINE.
036300     ADD     1 TO RECORD-COUNT.
036400Y    IF      RECORD-COUNT GREATER 50
036500Y            MOVE    DUMMY-RECORD TO DUMMY-HOLD
036600Y            MOVE    SPACE TO DUMMY-RECORD
036700Y            WRITE   DUMMY-RECORD AFTER ADVANCING PAGE
036800Y            MOVE    CCVS-C-1 TO DUMMY-RECORD
036900Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
037000Y            MOVE    SPACE TO DUMMY-RECORD
037100Y            MOVE    CCVS-C-2 TO DUMMY-RECORD
037200Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
037300Y            MOVE    SPACE TO DUMMY-RECORD
037400Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
037500Y            MOVE    SPACE TO DUMMY-RECORD
037600Y            MOVE    HYPHEN-LINE TO DUMMY-RECORD
037700Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
037800Y            MOVE    SPACE TO DUMMY-RECORD
037900Y            MOVE    DUMMY-HOLD TO DUMMY-RECORD
038000Y            MOVE    ZERO TO RECORD-COUNT.
038100     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
038200     MOVE    SPACE TO DUMMY-RECORD.
038300 D1-WRITE-LINE-EXIT.
038400     EXIT.
038500 RL-FD2-01-EXIT.
038600     EXIT.
038700*
038800 RL-FD2-02 SECTION.
038900     USE      AFTER STANDARD EXCEPTION PROCEDURE ON RL-FD2.
039000 RL-FD2-01-03.
039100     MOVE   "PASS " TO P-OR-F.
039200     ADD     1 TO PASS-COUNTER.
039300*
039400     IF      REC-CT NOT EQUAL TO ZERO
039500             MOVE "." TO PARDOT-X
039600             MOVE REC-CT TO DOTVALUE.
039700     MOVE    TEST-RESULTS TO PRINT-REC.
039800     PERFORM D2-WRITE-LINE THRU D2-WRITE-LINE-EXIT.
039900*
040000     IF      P-OR-F EQUAL TO "FAIL*"
040100             PERFORM D2-WRITE-LINE THRU D2-WRITE-LINE-EXIT
040200             PERFORM D2-FAIL-ROUTINE THRU D2-FAIL-ROUTINE-EX
040300      ELSE
040400             PERFORM D2-BAIL-OUT THRU D2-BAIL-OUT-EX.
040500     MOVE    SPACE TO P-OR-F.
040600     MOVE    SPACE TO COMPUTED-X.
040700     MOVE    SPACE TO CORRECT-X.
040800     IF      REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
040900     MOVE    SPACE TO RE-MARK.
041000     GO TO   RL-FD2-02-EXIT.
041100 D2-FAIL-ROUTINE.
041200     IF      COMPUTED-X NOT EQUAL TO SPACE
041300             GO TO   D2-FAIL-ROUTINE-WRITE.
041400     IF      CORRECT-X NOT EQUAL TO SPACE
041500             GO TO   D2-FAIL-ROUTINE-WRITE.
041600     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041700     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041800     MOVE    XXINFO TO DUMMY-RECORD.
041900     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
042000     MOVE    SPACE TO DUMMY-RECORD.
042100     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
042200     MOVE    SPACE TO DUMMY-RECORD.
042300     MOVE    SPACES TO INF-ANSI-REFERENCE.
042400     GO TO   D2-FAIL-ROUTINE-EX.
042500 D2-FAIL-ROUTINE-WRITE.
042600     MOVE    TEST-COMPUTED TO PRINT-REC.
042700     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
042800     MOVE    SPACE TO DUMMY-RECORD.
042900     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
043000     MOVE    TEST-CORRECT TO PRINT-REC.
043100     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
043200     MOVE    SPACE TO DUMMY-RECORD.
043300     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
043400     MOVE    SPACE TO DUMMY-RECORD.
043500     MOVE    SPACES TO COR-ANSI-REFERENCE.
043600 D2-FAIL-ROUTINE-EX.
043700     EXIT.
043800 D2-BAIL-OUT.
043900     IF      COMPUTED-A NOT EQUAL TO SPACE
044000             GO TO    D2-BAIL-OUT-WRITE.
044100     IF      CORRECT-A EQUAL TO SPACE
044200             GO TO    D2-BAIL-OUT-EX.
044300 D2-BAIL-OUT-WRITE.
044400     MOVE    CORRECT-A  TO XXCORRECT.
044500     MOVE    COMPUTED-A TO XXCOMPUTED.
044600     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
044700     MOVE    XXINFO TO DUMMY-RECORD.
044800     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
044900     MOVE    SPACE TO DUMMY-RECORD.
045000     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
045100     MOVE    SPACE TO DUMMY-RECORD.
045200     MOVE    SPACES TO INF-ANSI-REFERENCE.
045300 D2-BAIL-OUT-EX.
045400     EXIT.
045500 RL-FD2-02-EXIT.
045600     EXIT.
045700 D2-WRITE-LINE.
045800     ADD     1 TO RECORD-COUNT.
045900Y    IF      RECORD-COUNT GREATER 50
046000Y            MOVE    DUMMY-RECORD TO DUMMY-HOLD
046100Y            MOVE    SPACE TO DUMMY-RECORD
046200Y            WRITE   DUMMY-RECORD AFTER ADVANCING PAGE
046300Y            MOVE    CCVS-C-1 TO DUMMY-RECORD
046400Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
046500Y            MOVE    SPACE TO DUMMY-RECORD
046600Y            MOVE    CCVS-C-2 TO DUMMY-RECORD
046700Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
046800Y            MOVE    SPACE TO DUMMY-RECORD
046900Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
047000Y            MOVE    SPACE TO DUMMY-RECORD
047100Y            MOVE    HYPHEN-LINE TO DUMMY-RECORD
047200Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
047300Y            MOVE    SPACE TO DUMMY-RECORD
047400Y            MOVE    DUMMY-HOLD TO DUMMY-RECORD
047500Y            MOVE    ZERO TO RECORD-COUNT.
047600     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
047700     MOVE    SPACE TO DUMMY-RECORD.
047800 D2-WRITE-LINE-EXIT.
047900     EXIT.
048000 END DECLARATIVES.
048100 CCVS1 SECTION.
048200 OPEN-FILES.
048300     OPEN    OUTPUT PRINT-FILE.
048400     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
048500     MOVE    SPACE TO TEST-RESULTS.
048600     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
048700     MOVE    ZERO TO REC-SKL-SUB.
048800     PERFORM CCVS-INIT-FILE 9 TIMES.
048900 CCVS-INIT-FILE.
049000     ADD     1 TO REC-SKL-SUB.
049100     MOVE    FILE-RECORD-INFO-SKELETON
049200          TO FILE-RECORD-INFO (REC-SKL-SUB).
049300 CCVS-INIT-EXIT.
049400     GO TO CCVS1-EXIT.
049500 CLOSE-FILES.
049600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
049700 TERMINATE-CCVS.
049800S    EXIT PROGRAM.
049900STERMINATE-CALL.
050000     STOP     RUN.
050100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
050200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
050300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
050400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
050500     MOVE "****TEST DELETED****" TO RE-MARK.
050600 PRINT-DETAIL.
050700     IF REC-CT NOT EQUAL TO ZERO
050800             MOVE "." TO PARDOT-X
050900             MOVE REC-CT TO DOTVALUE.
051000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
051100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
051200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
051300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
051400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
051500     MOVE SPACE TO CORRECT-X.
051600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
051700     MOVE     SPACE TO RE-MARK.
051800 HEAD-ROUTINE.
051900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
052200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
052300 COLUMN-NAMES-ROUTINE.
052400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
052500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
052600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
052700 END-ROUTINE.
052800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
052900 END-RTN-EXIT.
053000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053100 END-ROUTINE-1.
053200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
053300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
053400      ADD PASS-COUNTER TO ERROR-HOLD.
053500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
053600      MOVE PASS-COUNTER TO CCVS-E-4-1.
053700      MOVE ERROR-HOLD TO CCVS-E-4-2.
053800      MOVE CCVS-E-4 TO CCVS-E-2-2.
053900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
054000  END-ROUTINE-12.
054100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
054200     IF       ERROR-COUNTER IS EQUAL TO ZERO
054300         MOVE "NO " TO ERROR-TOTAL
054400         ELSE
054500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
054600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
054700     PERFORM WRITE-LINE.
054800 END-ROUTINE-13.
054900     IF DELETE-COUNTER IS EQUAL TO ZERO
055000         MOVE "NO " TO ERROR-TOTAL  ELSE
055100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
055200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
055300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055400      IF   INSPECT-COUNTER EQUAL TO ZERO
055500          MOVE "NO " TO ERROR-TOTAL
055600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
055700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
055800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
056000 WRITE-LINE.
056100     ADD 1 TO RECORD-COUNT.
056200Y    IF RECORD-COUNT GREATER 50
056300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
056400Y        MOVE SPACE TO DUMMY-RECORD
056500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
056600Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
056700Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
056800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
056900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
057000Y        MOVE ZERO TO RECORD-COUNT.
057100     PERFORM WRT-LN.
057200 WRT-LN.
057300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
057400     MOVE SPACE TO DUMMY-RECORD.
057500 BLANK-LINE-PRINT.
057600     PERFORM WRT-LN.
057700 FAIL-ROUTINE.
057800     IF     COMPUTED-X NOT EQUAL TO SPACE
057900            GO TO   FAIL-ROUTINE-WRITE.
058000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
058100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
058200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
058300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
058400     MOVE   SPACES TO INF-ANSI-REFERENCE.
058500     GO TO  FAIL-ROUTINE-EX.
058600 FAIL-ROUTINE-WRITE.
058700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
058800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
058900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
059000     MOVE   SPACES TO COR-ANSI-REFERENCE.
059100 FAIL-ROUTINE-EX. EXIT.
059200 BAIL-OUT.
059300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
059400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
059500 BAIL-OUT-WRITE.
059600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
059700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
059800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
059900     MOVE   SPACES TO INF-ANSI-REFERENCE.
060000 BAIL-OUT-EX. EXIT.
060100 CCVS1-EXIT.
060200     EXIT.
060300 SECT-RL113A-001 SECTION.
060400 REL-INIT-009.
060500     MOVE    "VIII-36 4.8.4 GR4" TO ANSI-REFERENCE.
060600     MOVE    "REL-TEST-009" TO PAR-NAME.
060700     MOVE     "CREATE RL-FD2" TO  FEATURE
060800     MOVE     "RL-FD2"        TO  XFILE-NAME (2).
060900     MOVE     "R1-F-G"        TO  XRECORD-NAME (2).
061000     MOVE CCVS-PGM-ID             TO  XPROGRAM-NAME (2).
061100     MOVE     000240          TO  XRECORD-LENGTH (2).
061200     MOVE     "RC"            TO  CHARS-OR-RECORDS (2).
061300     MOVE     0001            TO  XBLOCK-SIZE       (2).
061400     MOVE     000500          TO  RECORDS-IN-FILE  (2).
061500     MOVE     "RL"            TO  XFILE-ORGANIZATION (2).
061600     MOVE     "S"             TO  XLABEL-TYPE        (2).
061700     MOVE     000001          TO  XRECORD-NUMBER     (2).
061800*INITIALIZE  RECORD WORK AREA NUMBER 2.
061900     MOVE     1         TO  WRK-CS-09V00-012.
062000     MOVE     ZERO      TO  WRK-CS-09V00-013 WRK-CS-09V00-014
062100                            WRK-CS-09V00-015 WRK-CS-09V00-016
062200                            WRK-CS-09V00-017 WRK-CS-09V00-018.
062300     MOVE     SPACE     TO  RL-FD2-STATUS.
062400     MOVE     90000002  TO  RL-FD2-KEY.
062500     MOVE     01 TO REC-CT.
062600     OPEN     OUTPUT    RL-FD2.
062700     MOVE     RL-FD2-STATUS TO WRK-XN-0002-001.
062800*CAPTURE STATUS KEY AFTER  OPEN STATEMENT IS EXECUTED.
062900 REL-TEST-009-R.
063000     MOVE XRECORD-NUMBER (2) TO RL-FD2-KEY.
063100     MOVE    "99"  TO RL-FD2-STATUS.
063200     MOVE     FILE-RECORD-INFO-P1-120 (2) TO RL-FD2-WRK-120.
063300     MOVE     FILE-RECORD-INFO-P1-120 (2) TO
063400               RL-FD2-GRP-120.
063500     WRITE    RL-FD2R1-F-G-240.
063600     IF        RL-FD2-STATUS NOT EQUAL TO "00"
063700              GO TO  REL-TEST-009-2.
063800     IF       XRECORD-NUMBER (2) EQUAL TO 500
063900             GO TO REL-TEST-009-2.
064000     ADD      01 TO  XRECORD-NUMBER (2).
064100     GO TO    REL-TEST-009-R.
064200 REL-TEST-009-2.
064300     IF       WRK-CS-09V00-014 NOT EQUAL TO ZERO
064400              MOVE "EXCEPTIONS/ERRORS" TO RE-MARK
064500              MOVE ZERO TO CORRECT-18V0
064600              MOVE WRK-CS-09V00-014 TO COMPUTED-18V0
064700              PERFORM   FAIL
064800              ELSE
064900              PERFORM   PASS.
065000     PERFORM  PRINT-DETAIL.
065100     ADD      01 TO REC-CT.
065200*    .01
065300     IF       XRECORD-NUMBER (2) NOT EQUAL TO 500
065400              MOVE "INCORRECT COUNT" TO RE-MARK
065500              MOVE  500 TO CORRECT-18V0
065600             MOVE    XRECORD-NUMBER (2)  TO COMPUTED-18V0
065700              PERFORM  FAIL
065800              ELSE
065900              PERFORM PASS.
066000     PERFORM  PRINT-DETAIL.
066100     ADD      01 TO REC-CT.
066200*    .02
066300     IF       WRK-XN-0002-001 NOT EQUAL TO  "00"
066400              MOVE "STATUS/OPEN" TO RE-MARK
066500              MOVE WRK-XN-0002-001 TO COMPUTED-A
066600              MOVE "00" TO CORRECT-A
066700              PERFORM  FAIL
066800              ELSE
066900              PERFORM  PASS.
067000     PERFORM  PRINT-DETAIL.
067100     ADD      01 TO REC-CT.
067200*    .03
067300     IF        RL-FD2-STATUS NOT EQUAL TO "00"
067400              MOVE "STATUS/WRITE" TO RE-MARK
067500              MOVE RL-FD2-STATUS TO COMPUTED-A
067600              MOVE "00" TO CORRECT-A
067700              PERFORM   FAIL
067800              ELSE
067900              PERFORM   PASS.
068000     PERFORM  PRINT-DETAIL.
068100     ADD      01 TO REC-CT.
068200*    .04
068300     MOVE     SPACE  TO  RL-FD2-STATUS.
068400     CLOSE    RL-FD2.
068500     IF        RL-FD2-STATUS NOT EQUAL TO "00"
068600              MOVE "CLOSE/STATUS" TO RE-MARK
068700              MOVE   RL-FD2-STATUS TO COMPUTED-A
068800              MOVE "00" TO CORRECT-A
068900              PERFORM FAIL
069000              ELSE
069100              PERFORM PASS.
069200     PERFORM  PRINT-DETAIL.
069300     ADD      01 TO REC-CT.
069400*    .05
069500 REL-INIT-010.
069600     MOVE    "REL-TEST-010" TO PAR-NAME.
069700     MOVE     2     TO  WRK-CS-09V00-012.
069800     MOVE     ZERO  TO  RL-FD2-KEY.
069900     MOVE     ZERO  TO  WRK-CS-09V00-013.
070000     MOVE     ZERO  TO  WRK-CS-09V00-014.
070100     MOVE     ZERO  TO  WRK-CS-09V00-015.
070200     MOVE     ZERO  TO  WRK-CS-09V00-016.
070300     MOVE     ZERO  TO  WRK-CS-09V00-017.
070400     MOVE     ZERO  TO  WRK-CS-09V00-018.
070500     MOVE     01 TO REC-CT.
070600     OPEN     I-O   RL-FD2.
070700     MOVE     SPACE     TO  WRK-XN-0002-002
070800     MOVE     SPACE     TO  WRK-XN-0002-003
070900     MOVE     SPACE     TO  WRK-XN-0002-004
071000     MOVE     RL-FD2-STATUS TO WRK-XN-0002-001
071100     MOVE     SPACE TO RL-FD2-STATUS.
071200*CAPTURE THE CONTENTS OF STATUS KEY AFTER OPEN IS EXECUTED.
071300     MOVE    "USE/FILE STATUS"  TO FEATURE.
071400 REL-TEST-010-R.
071500     ADD      1 TO RL-FD2-KEY.
071600     ADD      1 TO WRK-CS-09V00-014.
071700     ADD      1 TO WRK-CS-09V00-015.
071800     READ     RL-FD2 RECORD.
071900     IF       RL-FD2-STATUS EQUAL TO "23"
072000              GO TO  REL-TEST-010-3.
072100     MOVE     RL-FD2-WRK-120 TO FILE-RECORD-INFO-P1-120 (2).
072200     IF       WRK-CS-09V00-015 EQUAL TO 5
072300              ADD 01 TO UPDATE-NUMBER (2)
072400              MOVE FILE-RECORD-INFO-P1-120 (2) TO RL-FD2-WRK-120
072500              REWRITE RL-FD2R1-F-G-240
072600           MOVE ZERO TO WRK-CS-09V00-015
072700              GO TO  REL-TEST-010-2.
072800     IF       WRK-CS-09V00-014 GREATER 500
072900              MOVE 1 TO WRK-CS-09V00-013
073000              GO TO  REL-TEST-010-3.
073100     GO TO    REL-TEST-010-R.
073200 REL-TEST-010-2.
073300     IF        RL-FD2-STATUS NOT EQUAL TO "00"
073400              ADD 1 TO WRK-CS-09V00-016.
073500     MOVE    SPACE TO RL-FD2-STATUS.
073600     GO TO    REL-TEST-010-R.
073700 REL-TEST-010-3.
073800     IF       WRK-CS-09V00-013 NOT EQUAL TO 0
073900              MOVE  "EXCEPTIONS/ERRORS" TO RE-MARK
074000              MOVE WRK-CS-09V00-013 TO COMPUTED-18V0
074100              MOVE  0 TO CORRECT-18V0
074200              PERFORM FAIL
074300              ELSE
074400              PERFORM PASS.
074500     PERFORM  PRINT-DETAIL.
074600     ADD      01 TO REC-CT.
074700*    .01
074800     IF       WRK-CS-09V00-014 NOT EQUAL TO 501
074900              MOVE "INCORRECT COUNT" TO RE-MARK
075000              MOVE WRK-CS-09V00-014 TO COMPUTED-18V0
075100              MOVE 501 TO CORRECT-18V0
075200              PERFORM FAIL
075300              ELSE
075400             PERFORM PASS.
075500     PERFORM  PRINT-DETAIL.
075600     ADD      01 TO REC-CT.
075700*    .02
075800     IF       WRK-XN-0002-001 NOT EQUAL TO "00"
075900              MOVE "OPEN/STATUS"  TO  RE-MARK
076000              MOVE WRK-XN-0002-001 TO COMPUTED-A
076100              MOVE  "00" TO CORRECT-A
076200              PERFORM FAIL
076300              ELSE
076400              PERFORM PASS.
076500     PERFORM  PRINT-DETAIL.
076600     ADD      01 TO REC-CT.
076700*    .03
076800     IF        RL-FD2-STATUS NOT EQUAL  TO "23"
076900              MOVE "AT END/STATUS" TO RE-MARK
077000              MOVE  RL-FD2-STATUS TO COMPUTED-A
077100              MOVE "23" TO CORRECT-A
077200              PERFORM FAIL
077300              ELSE
077400              PERFORM PASS.
077500     PERFORM  PRINT-DETAIL.
077600     ADD      01 TO REC-CT.
077700*    .04
077800*    IF       WRK-XN-0002-002 NOT EQUAL TO "10"
077900*             MOVE  "EXCEPTION/STATUS" TO RE-MARK
078000*             MOVE  WRK-XN-0002-002 TO COMPUTED-A
078100*             MOVE  "10" TO CORRECT-A
078200*             PERFORM FAIL
078300*             ELSE
078400*             PERFORM PASS.
078500*    PERFORM  PRINT-DETAIL.
078600*    ADD      01 TO REC-CT.
078700*    .05
078800*    IF       WRK-XN-0002-003 NOT EQUAL TO "10"
078900*             MOVE "NO EXCEPTION" TO  RE-MARK
079000*             MOVE WRK-XN-0002-003 TO COMPUTED-A
079100*             MOVE "10" TO CORRECT-A
079200*             PERFORM FAIL
079300*             ELSE
079400*             PERFORM PASS.
079500*    PERFORM  PRINT-DETAIL
079600*    ADD      01 TO REC-CT.
079700*    .06
079800     MOVE     SPACE TO RL-FD2-STATUS.
079900     CLOSE    RL-FD2
080000     IF        RL-FD2-STATUS NOT EQUAL TO "00"
080100              MOVE "CLOSE/STATUS" TO RE-MARK
080200              MOVE  RL-FD2-STATUS TO  COMPUTED-A
080300              MOVE "00" TO CORRECT-A
080400              PERFORM FAIL
080500              ELSE
080600              PERFORM PASS.
080700     PERFORM  PRINT-DETAIL.
080800     ADD      01 TO REC-CT.
080900*    .07
081000 CCVS-EXIT SECTION.
081100 CCVS-999999.
081200     GO TO CLOSE-FILES.
