000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL115A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*            X-21   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR   *
001700*                    RELATIVE  I-O DATA FILE                   *
001800*            X-55   SYSTEM PRINTER                             *
001900*            X-69   ADDITIONAL VALUE OF CLAUSES                *
002000*            X-74   VALUE OF IMPLEMENTOR-NAME                  *
002100*            X-75   OBJECT OF VALUE OF CLAUSE                  *
002200*            X-82   SOURCE-COMPUTER                            *
002300*            X-83   OBJECT-COMPUTER.                           *
002400*                                                              *
002500****************************************************************
002600*    RL115A                                                    *
002700****************************************************************
002800*            THIS PROGRAM TESTS THE SYNTACTICAL CONSTRUCTS AND
002900*            SEMANTIC ACTIONS ASSOCIATED WITH THE "USE"
003000*            STATEMENT.
003100*
003200*
003300*            THIS PROGRAM CREATES A RELATIVE I-O FILE SEQUENTIALLY
003400*            (ACCESS MODE SEQUENTIAL) AND THEN UPDATES SELECTIVE
003500*            RECORDS OF THE FILE.  THE FILE STATUS CONTENTS ARE
003600*            CAPTURED AND TESTED FOR ACCURACY FOR EACH OPEN, CLOSE
003700*            READ AND REWRITE STATEMENT USED.  THE READ, WRITE AND
003800*            REWRITE STATEMENTS ARE USED WITHOUT THE APPROPRIATE
003900*            AT END ON INVALID KEY PHRASES.  THE OMISSION OF THESE
004000*            PHRASES ARE PERMITTED IF AN APPLICABLE USE PROCEDURE
004100*            HAS BEEN SPECIFIED.
004200*
004300***************************************************
004400 ENVIRONMENT DIVISION.
004500 CONFIGURATION SECTION.
004600 SOURCE-COMPUTER.
004700     XXXXX082.
004800 OBJECT-COMPUTER.
004900     XXXXX083.
005000 INPUT-OUTPUT SECTION.
005100 FILE-CONTROL.
005200     SELECT PRINT-FILE ASSIGN TO
005300     XXXXX055.
005400     SELECT   RL-FD2 ASSIGN
005500     XXXXX022
005600              ORGANIZATION RELATIVE
005700              ACCESS  SEQUENTIAL
005800              RELATIVE  RL-FD2-KEY
005900         FILE STATUS IS RL-FD2-STATUS.
006000 DATA DIVISION.
006100 FILE SECTION.
006200 FD  PRINT-FILE.
006300 01  PRINT-REC PICTURE X(120).
006400 01  DUMMY-RECORD PICTURE X(120).
006500 FD  RL-FD2
006600C    VALUE OF
006700C    XXXXX074
006800C    IS
006900C    XXXXX076
007000G    XXXXX069
007100     LABEL RECORDS ARE STANDARD
007200     BLOCK CONTAINS 1 RECORDS
007300     DATA RECORD RL-FD2R1-F-G-240.
007400 01  RL-FD2R1-F-G-240.
007500     05 RL-FD2-WRK-120 PIC X(120).
007600     05 RL-FD2-GRP-120.
007700        10 RL-FD2-WRK-XN-0001-O120F
007800                        PICTURE X OCCURS 120 TIMES.
007900 WORKING-STORAGE SECTION.
008000 01  GRP-0001.
008100     05 RL-FD2-KEY   PIC 9(8)  VALUE ZERO.
008200     05 WRK-CS-09V00-012  PIC S9(9) USAGE COMP  VALUE ZERO.
008300     05 WRK-CS-09V00-013  PIC S9(9) USAGE COMP  VALUE ZERO.
008400     05 WRK-CS-09V00-014  PIC S9(9) USAGE COMP  VALUE ZERO.
008500     05 WRK-CS-09V00-015  PIC S9(9) USAGE COMP  VALUE ZERO.
008600     05 WRK-CS-09V00-016  PIC S9(9) USAGE COMP  VALUE ZERO.
008700     05 WRK-CS-09V00-017  PIC S9(9) USAGE COMP  VALUE ZERO.
008800     05 WRK-CS-09V00-018  PIC S9(9) USAGE COMP  VALUE ZERO.
008900     05 RL-FD2-STATUS     PIC  XX  VALUE  SPACE.
009000     05 WRK-XN-0002-001   PIC  X(2) VALUE  SPACE.
009100     05 WRK-XN-0002-002   PIC  X(2) VALUE  SPACE.
009200     05 WRK-XN-0002-003   PIC  X(2) VALUE  SPACE.
009300     05 WRK-XN-0002-004   PIC  X(2) VALUE  SPACE.
009400     05 WRK-XN-0002-005   PIC  X(2) VALUE  SPACE.
009500     05 WRK-XN-0002-006   PIC  X(2) VALUE  SPACE.
009600     05 WRK-XN-0002-007   PIC  X(2) VALUE  SPACE.
009700     05 WRK-XN-0002-008   PIC  X(2) VALUE  SPACE.
009800     05 WRK-XN-0002-009   PIC  X(2) VALUE  SPACE.
009900 01  FILE-RECORD-INFORMATION-REC.
010000     03 FILE-RECORD-INFO-SKELETON.
010100        05 FILLER                 PICTURE X(48)       VALUE
010200             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
010300        05 FILLER                 PICTURE X(46)       VALUE
010400             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
010500        05 FILLER                 PICTURE X(26)       VALUE
010600             ",LFIL=000000,ORG=  ,LBLR= ".
010700        05 FILLER                 PICTURE X(37)       VALUE
010800             ",RECKEY=                             ".
010900        05 FILLER                 PICTURE X(38)       VALUE
011000             ",ALTKEY1=                             ".
011100        05 FILLER                 PICTURE X(38)       VALUE
011200             ",ALTKEY2=                             ".
011300        05 FILLER                 PICTURE X(7)        VALUE SPACE.
011400     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
011500        05 FILE-RECORD-INFO-P1-120.
011600           07 FILLER              PIC X(5).
011700           07 XFILE-NAME           PIC X(6).
011800           07 FILLER              PIC X(8).
011900           07 XRECORD-NAME         PIC X(6).
012000           07 FILLER              PIC X(1).
012100           07 REELUNIT-NUMBER     PIC 9(1).
012200           07 FILLER              PIC X(7).
012300           07 XRECORD-NUMBER       PIC 9(6).
012400           07 FILLER              PIC X(6).
012500           07 UPDATE-NUMBER       PIC 9(2).
012600           07 FILLER              PIC X(5).
012700           07 ODO-NUMBER          PIC 9(4).
012800           07 FILLER              PIC X(5).
012900           07 XPROGRAM-NAME        PIC X(5).
013000           07 FILLER              PIC X(7).
013100           07 XRECORD-LENGTH       PIC 9(6).
013200           07 FILLER              PIC X(7).
013300           07 CHARS-OR-RECORDS    PIC X(2).
013400           07 FILLER              PIC X(1).
013500           07 XBLOCK-SIZE          PIC 9(4).
013600           07 FILLER              PIC X(6).
013700           07 RECORDS-IN-FILE     PIC 9(6).
013800           07 FILLER              PIC X(5).
013900           07 XFILE-ORGANIZATION   PIC X(2).
014000           07 FILLER              PIC X(6).
014100           07 XLABEL-TYPE          PIC X(1).
014200        05 FILE-RECORD-INFO-P121-240.
014300           07 FILLER              PIC X(8).
014400           07 XRECORD-KEY          PIC X(29).
014500           07 FILLER              PIC X(9).
014600           07 ALTERNATE-KEY1      PIC X(29).
014700           07 FILLER              PIC X(9).
014800           07 ALTERNATE-KEY2      PIC X(29).
014900           07 FILLER              PIC X(7).
015000 01  TEST-RESULTS.
015100     02 FILLER                   PIC X      VALUE SPACE.
015200     02 FEATURE                  PIC X(20)  VALUE SPACE.
015300     02 FILLER                   PIC X      VALUE SPACE.
015400     02 P-OR-F                   PIC X(5)   VALUE SPACE.
015500     02 FILLER                   PIC X      VALUE SPACE.
015600     02  PAR-NAME.
015700       03 FILLER                 PIC X(19)  VALUE SPACE.
015800       03  PARDOT-X              PIC X      VALUE SPACE.
015900       03 DOTVALUE               PIC 99     VALUE ZERO.
016000     02 FILLER                   PIC X(8)   VALUE SPACE.
016100     02 RE-MARK                  PIC X(61).
016200 01  TEST-COMPUTED.
016300     02 FILLER                   PIC X(30)  VALUE SPACE.
016400     02 FILLER                   PIC X(17)  VALUE
016500            "       COMPUTED=".
016600     02 COMPUTED-X.
016700     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
016800     03 COMPUTED-N               REDEFINES COMPUTED-A
016900                                 PIC -9(9).9(9).
017000     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
017100     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
017200     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
017300     03       CM-18V0 REDEFINES COMPUTED-A.
017400         04 COMPUTED-18V0                    PIC -9(18).
017500         04 FILLER                           PIC X.
017600     03 FILLER PIC X(50) VALUE SPACE.
017700 01  TEST-CORRECT.
017800     02 FILLER PIC X(30) VALUE SPACE.
017900     02 FILLER PIC X(17) VALUE "       CORRECT =".
018000     02 CORRECT-X.
018100     03 CORRECT-A                  PIC X(20) VALUE SPACE.
018200     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
018300     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
018400     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
018500     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
018600     03      CR-18V0 REDEFINES CORRECT-A.
018700         04 CORRECT-18V0                     PIC -9(18).
018800         04 FILLER                           PIC X.
018900     03 FILLER PIC X(2) VALUE SPACE.
019000     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
019100 01  CCVS-C-1.
019200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
019300-    "SS  PARAGRAPH-NAME
019400-    "       REMARKS".
019500     02 FILLER                     PIC X(20)    VALUE SPACE.
019600 01  CCVS-C-2.
019700     02 FILLER                     PIC X        VALUE SPACE.
019800     02 FILLER                     PIC X(6)     VALUE "TESTED".
019900     02 FILLER                     PIC X(15)    VALUE SPACE.
020000     02 FILLER                     PIC X(4)     VALUE "FAIL".
020100     02 FILLER                     PIC X(94)    VALUE SPACE.
020200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
020300 01  REC-CT                        PIC 99       VALUE ZERO.
020400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
020500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
020600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
020700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
020800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
020900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
021000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
021100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
021200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
021300 01  CCVS-H-1.
021400     02  FILLER                    PIC X(39)    VALUE SPACES.
021500     02  FILLER                    PIC X(42)    VALUE
021600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
021700     02  FILLER                    PIC X(39)    VALUE SPACES.
021800 01  CCVS-H-2A.
021900   02  FILLER                        PIC X(40)  VALUE SPACE.
022000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
022100   02  FILLER                        PIC XXXX   VALUE
022200     "4.2 ".
022300   02  FILLER                        PIC X(28)  VALUE
022400            " COPY - NOT FOR DISTRIBUTION".
022500   02  FILLER                        PIC X(41)  VALUE SPACE.
022600
022700 01  CCVS-H-2B.
022800   02  FILLER                        PIC X(15)  VALUE
022900            "TEST RESULT OF ".
023000   02  TEST-ID                       PIC X(9).
023100   02  FILLER                        PIC X(4)   VALUE
023200            " IN ".
023300   02  FILLER                        PIC X(12)  VALUE
023400     " HIGH       ".
023500   02  FILLER                        PIC X(22)  VALUE
023600            " LEVEL VALIDATION FOR ".
023700   02  FILLER                        PIC X(58)  VALUE
023800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
023900 01  CCVS-H-3.
024000     02  FILLER                      PIC X(34)  VALUE
024100            " FOR OFFICIAL USE ONLY    ".
024200     02  FILLER                      PIC X(58)  VALUE
024300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
024400     02  FILLER                      PIC X(28)  VALUE
024500            "  COPYRIGHT   1985 ".
024600 01  CCVS-E-1.
024700     02 FILLER                       PIC X(52)  VALUE SPACE.
024800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
024900     02 ID-AGAIN                     PIC X(9).
025000     02 FILLER                       PIC X(45)  VALUE SPACES.
025100 01  CCVS-E-2.
025200     02  FILLER                      PIC X(31)  VALUE SPACE.
025300     02  FILLER                      PIC X(21)  VALUE SPACE.
025400     02 CCVS-E-2-2.
025500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
025600         03 FILLER                   PIC X      VALUE SPACE.
025700         03 ENDER-DESC               PIC X(44)  VALUE
025800            "ERRORS ENCOUNTERED".
025900 01  CCVS-E-3.
026000     02  FILLER                      PIC X(22)  VALUE
026100            " FOR OFFICIAL USE ONLY".
026200     02  FILLER                      PIC X(12)  VALUE SPACE.
026300     02  FILLER                      PIC X(58)  VALUE
026400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026500     02  FILLER                      PIC X(13)  VALUE SPACE.
026600     02 FILLER                       PIC X(15)  VALUE
026700             " COPYRIGHT 1985".
026800 01  CCVS-E-4.
026900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
027000     02 FILLER                       PIC X(4)   VALUE " OF ".
027100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
027200     02 FILLER                       PIC X(40)  VALUE
027300      "  TESTS WERE EXECUTED SUCCESSFULLY".
027400 01  XXINFO.
027500     02 FILLER                       PIC X(19)  VALUE
027600            "*** INFORMATION ***".
027700     02 INFO-TEXT.
027800       04 FILLER                     PIC X(8)   VALUE SPACE.
027900       04 XXCOMPUTED                 PIC X(20).
028000       04 FILLER                     PIC X(5)   VALUE SPACE.
028100       04 XXCORRECT                  PIC X(20).
028200     02 INF-ANSI-REFERENCE           PIC X(48).
028300 01  HYPHEN-LINE.
028400     02 FILLER  PIC IS X VALUE IS SPACE.
028500     02 FILLER  PIC IS X(65)    VALUE IS "************************
028600-    "*****************************************".
028700     02 FILLER  PIC IS X(54)    VALUE IS "************************
028800-    "******************************".
028900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
029000     "RL115A".
029100 PROCEDURE DIVISION.
029200 DECLARATIVES.
029300 RL-FD2-01 SECTION.
029400     USE     AFTER ERROR PROCEDURE I-O.
029500 RL-FD2-01-01.
029600     MOVE   "PASS " TO P-OR-F.
029700     ADD     1 TO PASS-COUNTER.
029800*
029900     IF      REC-CT NOT EQUAL TO ZERO
030000             MOVE "." TO PARDOT-X
030100             MOVE REC-CT TO DOTVALUE.
030200     MOVE    TEST-RESULTS TO PRINT-REC.
030300     PERFORM D1-WRITE-LINE THRU D1-WRITE-LINE-EXIT.
030400     IF      P-OR-F EQUAL TO "FAIL*"
030500             PERFORM D1-WRITE-LINE THRU D1-WRITE-LINE-EXIT
030600             PERFORM D1-FAIL-ROUTINE THRU D1-FAIL-ROUTINE-EX
030700      ELSE
030800             PERFORM D1-BAIL-OUT THRU D1-BAIL-OUT-EX.
030900     MOVE    SPACE TO P-OR-F.
031000     MOVE    SPACE TO COMPUTED-X.
031100     MOVE    SPACE TO CORRECT-X.
031200     IF      REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
031300     MOVE    SPACE TO RE-MARK.
031400     ADD     1 TO WRK-CS-09V00-013.
031500     MOVE    RL-FD2-STATUS TO WRK-XN-0002-002.
031600     MOVE    "10" TO WRK-XN-0002-003.
031700     GO TO   RL-FD2-01-EXIT.
031800 D1-FAIL-ROUTINE.
031900     IF      COMPUTED-X NOT EQUAL TO SPACE
032000             GO TO   D1-FAIL-ROUTINE-WRITE.
032100     IF      CORRECT-X NOT EQUAL TO SPACE
032200             GO TO   D1-FAIL-ROUTINE-WRITE.
032300     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
032400     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032500     MOVE    XXINFO TO DUMMY-RECORD.
032600     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
032700     MOVE    SPACE TO DUMMY-RECORD.
032800     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
032900     MOVE    SPACE TO DUMMY-RECORD.
033000     MOVE    SPACES TO INF-ANSI-REFERENCE.
033100     GO TO   D1-FAIL-ROUTINE-EX.
033200 D1-FAIL-ROUTINE-WRITE.
033300     MOVE    TEST-COMPUTED TO PRINT-REC.
033400     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
033500     MOVE    SPACE TO DUMMY-RECORD.
033600     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
033700     MOVE    TEST-CORRECT TO PRINT-REC.
033800     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
033900     MOVE    SPACE TO DUMMY-RECORD.
034000     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
034100     MOVE    SPACE TO DUMMY-RECORD.
034200     MOVE    SPACES TO COR-ANSI-REFERENCE.
034300 D1-FAIL-ROUTINE-EX.
034400     EXIT.
034500 D1-BAIL-OUT.
034600     IF      COMPUTED-A NOT EQUAL TO SPACE
034700             GO TO    D1-BAIL-OUT-WRITE.
034800     IF      CORRECT-A EQUAL TO SPACE
034900             GO TO    D1-BAIL-OUT-EX.
035000 D1-BAIL-OUT-WRITE.
035100     MOVE    CORRECT-A  TO XXCORRECT.
035200     MOVE    COMPUTED-A TO XXCOMPUTED.
035300     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
035400     MOVE    XXINFO TO DUMMY-RECORD.
035500     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
035600     MOVE    SPACE TO DUMMY-RECORD.
035700     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
035800     MOVE    SPACE TO DUMMY-RECORD.
035900     MOVE    SPACES TO INF-ANSI-REFERENCE.
036000 D1-BAIL-OUT-EX.
036100     EXIT.
036200 D1-WRITE-LINE.
036300     ADD     1 TO RECORD-COUNT.
036400Y    IF      RECORD-COUNT GREATER 50
036500Y            MOVE    DUMMY-RECORD TO DUMMY-HOLD
036600Y            MOVE    SPACE TO DUMMY-RECORD
036700Y            WRITE   DUMMY-RECORD AFTER ADVANCING PAGE
036800Y            MOVE    CCVS-C-1 TO DUMMY-RECORD
036900Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
037000Y            MOVE    SPACE TO DUMMY-RECORD
037100Y            MOVE    CCVS-C-2 TO DUMMY-RECORD
037200Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
037300Y            MOVE    SPACE TO DUMMY-RECORD
037400Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
037500Y            MOVE    SPACE TO DUMMY-RECORD
037600Y            MOVE    HYPHEN-LINE TO DUMMY-RECORD
037700Y            WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES
037800Y            MOVE    SPACE TO DUMMY-RECORD
037900Y            MOVE    DUMMY-HOLD TO DUMMY-RECORD
038000Y            MOVE    ZERO TO RECORD-COUNT.
038100     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
038200     MOVE    SPACE TO DUMMY-RECORD.
038300 D1-WRITE-LINE-EXIT.
038400     EXIT.
038500 RL-FD2-01-EXIT.
038600     EXIT.
038700 END DECLARATIVES.
038800 CCVS1 SECTION.
038900 OPEN-FILES.
039000     OPEN    OUTPUT PRINT-FILE.
039100     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
039200     MOVE    SPACE TO TEST-RESULTS.
039300     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
039400     MOVE    ZERO TO REC-SKL-SUB.
039500     PERFORM CCVS-INIT-FILE 9 TIMES.
039600 CCVS-INIT-FILE.
039700     ADD     1 TO REC-SKL-SUB.
039800     MOVE    FILE-RECORD-INFO-SKELETON
039900          TO FILE-RECORD-INFO (REC-SKL-SUB).
040000 CCVS-INIT-EXIT.
040100     GO TO CCVS1-EXIT.
040200 CLOSE-FILES.
040300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
040400 TERMINATE-CCVS.
040500S    EXIT PROGRAM.
040600STERMINATE-CALL.
040700     STOP     RUN.
040800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
040900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
041000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
041100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
041200     MOVE "****TEST DELETED****" TO RE-MARK.
041300 PRINT-DETAIL.
041400     IF REC-CT NOT EQUAL TO ZERO
041500             MOVE "." TO PARDOT-X
041600             MOVE REC-CT TO DOTVALUE.
041700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
041800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
041900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
042000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
042100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
042200     MOVE SPACE TO CORRECT-X.
042300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
042400     MOVE     SPACE TO RE-MARK.
042500 HEAD-ROUTINE.
042600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
042800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
042900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
043000 COLUMN-NAMES-ROUTINE.
043100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
043200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
043400 END-ROUTINE.
043500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
043600 END-RTN-EXIT.
043700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043800 END-ROUTINE-1.
043900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
044000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
044100      ADD PASS-COUNTER TO ERROR-HOLD.
044200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
044300      MOVE PASS-COUNTER TO CCVS-E-4-1.
044400      MOVE ERROR-HOLD TO CCVS-E-4-2.
044500      MOVE CCVS-E-4 TO CCVS-E-2-2.
044600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
044700  END-ROUTINE-12.
044800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
044900     IF       ERROR-COUNTER IS EQUAL TO ZERO
045000         MOVE "NO " TO ERROR-TOTAL
045100         ELSE
045200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
045300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
045400     PERFORM WRITE-LINE.
045500 END-ROUTINE-13.
045600     IF DELETE-COUNTER IS EQUAL TO ZERO
045700         MOVE "NO " TO ERROR-TOTAL  ELSE
045800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
045900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
046000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046100      IF   INSPECT-COUNTER EQUAL TO ZERO
046200          MOVE "NO " TO ERROR-TOTAL
046300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
046400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
046500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
046700 WRITE-LINE.
046800     ADD 1 TO RECORD-COUNT.
046900Y    IF RECORD-COUNT GREATER 50
047000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
047100Y        MOVE SPACE TO DUMMY-RECORD
047200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
047300Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
047400Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
047500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
047600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
047700Y        MOVE ZERO TO RECORD-COUNT.
047800     PERFORM WRT-LN.
047900 WRT-LN.
048000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
048100     MOVE SPACE TO DUMMY-RECORD.
048200 BLANK-LINE-PRINT.
048300     PERFORM WRT-LN.
048400 FAIL-ROUTINE.
048500     IF     COMPUTED-X NOT EQUAL TO SPACE
048600            GO TO   FAIL-ROUTINE-WRITE.
048700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
048800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
048900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
049000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049100     MOVE   SPACES TO INF-ANSI-REFERENCE.
049200     GO TO  FAIL-ROUTINE-EX.
049300 FAIL-ROUTINE-WRITE.
049400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
049500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
049600     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
049700     MOVE   SPACES TO COR-ANSI-REFERENCE.
049800 FAIL-ROUTINE-EX. EXIT.
049900 BAIL-OUT.
050000     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
050100     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
050200 BAIL-OUT-WRITE.
050300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
050400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
050500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050600     MOVE   SPACES TO INF-ANSI-REFERENCE.
050700 BAIL-OUT-EX. EXIT.
050800 CCVS1-EXIT.
050900     EXIT.
051000 SECT-RL115A-001 SECTION.
051100 REL-INIT-009.
051200     MOVE    "VIII-36 4.8.4 GR4" TO ANSI-REFERENCE.
051300     MOVE    "REL-TEST-009" TO PAR-NAME.
051400     MOVE     "CREATE RL-FD2" TO  FEATURE
051500     MOVE     "RL-FD2"        TO  XFILE-NAME (2).
051600     MOVE     "R1-F-G"        TO  XRECORD-NAME (2).
051700     MOVE CCVS-PGM-ID             TO  XPROGRAM-NAME (2).
051800     MOVE     000240          TO  XRECORD-LENGTH (2).
051900     MOVE     "RC"            TO  CHARS-OR-RECORDS (2).
052000     MOVE     0001            TO  XBLOCK-SIZE       (2).
052100     MOVE     000500          TO  RECORDS-IN-FILE  (2).
052200     MOVE     "RL"            TO  XFILE-ORGANIZATION (2).
052300     MOVE     "S"             TO  XLABEL-TYPE        (2).
052400     MOVE     000001          TO  XRECORD-NUMBER     (2).
052500*INITIALIZE  RECORD WORK AREA NUMBER 2.
052600     MOVE     1         TO  WRK-CS-09V00-012.
052700     MOVE     ZERO      TO  WRK-CS-09V00-013 WRK-CS-09V00-014
052800                            WRK-CS-09V00-015 WRK-CS-09V00-016
052900                            WRK-CS-09V00-017 WRK-CS-09V00-018.
053000     MOVE     SPACE     TO  RL-FD2-STATUS.
053100     MOVE     90000002  TO  RL-FD2-KEY.
053200     MOVE     01 TO REC-CT.
053300     OPEN     OUTPUT    RL-FD2.
053400     MOVE     RL-FD2-STATUS TO WRK-XN-0002-001.
053500*CAPTURE STATUS KEY AFTER  OPEN STATEMENT IS EXECUTED.
053600 REL-TEST-009-R.
053700     MOVE XRECORD-NUMBER (2) TO RL-FD2-KEY.
053800     MOVE    "99"  TO RL-FD2-STATUS.
053900     MOVE     FILE-RECORD-INFO-P1-120 (2) TO RL-FD2-WRK-120.
054000     MOVE     FILE-RECORD-INFO-P1-120 (2) TO
054100               RL-FD2-GRP-120.
054200     WRITE    RL-FD2R1-F-G-240 INVALID KEY
054300              GO TO REL-TEST-009-2.
054400     IF        RL-FD2-STATUS NOT EQUAL TO "00"
054500              GO TO  REL-TEST-009-2.
054600     IF       XRECORD-NUMBER (2) EQUAL TO 500
054700             GO TO REL-TEST-009-2.
054800     ADD      01 TO  XRECORD-NUMBER (2).
054900     GO TO    REL-TEST-009-R.
055000 REL-TEST-009-2.
055100     IF       WRK-CS-09V00-014 NOT EQUAL TO ZERO
055200              MOVE "EXCEPTIONS/ERRORS" TO RE-MARK
055300              MOVE ZERO TO CORRECT-18V0
055400              MOVE WRK-CS-09V00-014 TO COMPUTED-18V0
055500              PERFORM   FAIL
055600              ELSE
055700              PERFORM   PASS.
055800     PERFORM  PRINT-DETAIL.
055900     ADD      01 TO REC-CT.
056000*    .01
056100     IF       XRECORD-NUMBER (2) NOT EQUAL TO 500
056200              MOVE "INCORRECT COUNT" TO RE-MARK
056300              MOVE  500 TO CORRECT-18V0
056400             MOVE    XRECORD-NUMBER (2)  TO COMPUTED-18V0
056500              PERFORM  FAIL
056600              ELSE
056700              PERFORM PASS.
056800     PERFORM  PRINT-DETAIL.
056900     ADD      01 TO REC-CT.
057000*    .02
057100     IF       WRK-XN-0002-001 NOT EQUAL TO  "00"
057200              MOVE "STATUS/OPEN" TO RE-MARK
057300              MOVE WRK-XN-0002-001 TO COMPUTED-A
057400              MOVE "00" TO CORRECT-A
057500              PERFORM  FAIL
057600              ELSE
057700              PERFORM  PASS.
057800     PERFORM  PRINT-DETAIL.
057900     ADD      01 TO REC-CT.
058000*    .03
058100     IF        RL-FD2-STATUS NOT EQUAL TO "00"
058200              MOVE "STATUS/WRITE" TO RE-MARK
058300              MOVE RL-FD2-STATUS TO COMPUTED-A
058400              MOVE "00" TO CORRECT-A
058500              PERFORM   FAIL
058600              ELSE
058700              PERFORM   PASS.
058800     PERFORM  PRINT-DETAIL.
058900     ADD      01 TO REC-CT.
059000*    .04
059100     MOVE     SPACE  TO  RL-FD2-STATUS.
059200     CLOSE    RL-FD2.
059300     IF        RL-FD2-STATUS NOT EQUAL TO "00"
059400              MOVE "CLOSE/STATUS" TO RE-MARK
059500              MOVE   RL-FD2-STATUS TO COMPUTED-A
059600              MOVE "00" TO CORRECT-A
059700              PERFORM FAIL
059800              ELSE
059900              PERFORM PASS.
060000     PERFORM  PRINT-DETAIL.
060100     ADD      01 TO REC-CT.
060200*    .05
060300 REL-INIT-010.
060400     MOVE    "REL-TEST-010" TO PAR-NAME.
060500     MOVE     2     TO  WRK-CS-09V00-012.
060600     MOVE     ZERO  TO  RL-FD2-KEY.
060700     MOVE     ZERO  TO  WRK-CS-09V00-013.
060800     MOVE     ZERO  TO  WRK-CS-09V00-014.
060900     MOVE     ZERO  TO  WRK-CS-09V00-015.
061000     MOVE     ZERO  TO  WRK-CS-09V00-016.
061100     MOVE     ZERO  TO  WRK-CS-09V00-017.
061200     MOVE     ZERO  TO  WRK-CS-09V00-018.
061300     MOVE     01 TO REC-CT.
061400     OPEN     I-O  RL-FD2.
061500     MOVE     SPACE     TO  WRK-XN-0002-002
061600     MOVE     SPACE     TO  WRK-XN-0002-003
061700     MOVE     SPACE     TO  WRK-XN-0002-004
061800     MOVE      RL-FD2-STATUS TO WRK-XN-0002-001
061900     MOVE     SPACE TO RL-FD2-STATUS.
062000*CAPTURE THE CONTENTS OF STATUS KEY AFTER OPEN IS EXECUTED.
062100     MOVE    "USE/FILE STATUS"  TO FEATURE.
062200 REL-TEST-010-R.
062300     ADD      1 TO RL-FD2-KEY.
062400     ADD      1 TO WRK-CS-09V00-014.
062500     ADD      1 TO WRK-CS-09V00-015.
062600     READ     RL-FD2.
062700     IF       RL-FD2-STATUS EQUAL TO "10"
062800              GO TO  REL-TEST-010-3.
062900     MOVE     RL-FD2-WRK-120 TO FILE-RECORD-INFO-P1-120 (2).
063000     IF       WRK-CS-09V00-015 EQUAL TO 5
063100              ADD 01 TO UPDATE-NUMBER (2)
063200              MOVE FILE-RECORD-INFO-P1-120 (2) TO RL-FD2-WRK-120
063300              REWRITE RL-FD2R1-F-G-240
063400           MOVE ZERO TO WRK-CS-09V00-015
063500              GO TO  REL-TEST-010-2.
063600     IF       WRK-CS-09V00-014 GREATER 500
063700              GO TO  REL-TEST-010-3.
063800     GO TO    REL-TEST-010-R.
063900 REL-TEST-010-2.
064000     IF        RL-FD2-STATUS NOT EQUAL TO "00"
064100              ADD 1 TO WRK-CS-09V00-016.
064200     MOVE    SPACE TO RL-FD2-STATUS.
064300     GO TO    REL-TEST-010-R.
064400 REL-TEST-010-3.
064500     IF       WRK-CS-09V00-013 NOT EQUAL TO 1
064600              MOVE  "EXCEPTIONS/ERRORS" TO RE-MARK
064700              MOVE WRK-CS-09V00-013 TO COMPUTED-18V0
064800              MOVE  1 TO CORRECT-18V0
064900              PERFORM FAIL
065000              ELSE
065100              PERFORM PASS.
065200     PERFORM  PRINT-DETAIL.
065300     ADD      01 TO REC-CT.
065400*    .01
065500     IF       WRK-CS-09V00-014 NOT EQUAL TO 501
065600              MOVE "INCORRECT COUNT" TO RE-MARK
065700              MOVE WRK-CS-09V00-014 TO COMPUTED-18V0
065800              MOVE 501 TO CORRECT-18V0
065900              PERFORM FAIL
066000              ELSE
066100             PERFORM PASS.
066200     PERFORM  PRINT-DETAIL.
066300     ADD      01 TO REC-CT.
066400*    .02
066500     IF       WRK-XN-0002-001 NOT EQUAL TO "00"
066600              MOVE "OPEN/STATUS"  TO  RE-MARK
066700              MOVE WRK-XN-0002-001 TO COMPUTED-A
066800              MOVE  "00" TO CORRECT-A
066900              PERFORM FAIL
067000              ELSE
067100              PERFORM PASS.
067200     PERFORM  PRINT-DETAIL.
067300     ADD      01 TO REC-CT.
067400*    .03
067500     IF        RL-FD2-STATUS NOT EQUAL  TO "10"
067600              MOVE "ATEND/STATUS" TO RE-MARK
067700              MOVE  RL-FD2-STATUS TO COMPUTED-A
067800              MOVE "10" TO CORRECT-A
067900              PERFORM FAIL
068000              ELSE
068100              PERFORM PASS.
068200     PERFORM  PRINT-DETAIL.
068300     ADD      01 TO REC-CT.
068400*    .04
068500     IF       WRK-XN-0002-002 NOT EQUAL TO "10"
068600              MOVE  "EXCEPTIN/STATUS" TO RE-MARK
068700              MOVE  WRK-XN-0002-002 TO COMPUTED-A
068800              MOVE  "10" TO CORRECT-A
068900              PERFORM FAIL
069000              ELSE
069100              PERFORM PASS.
069200     PERFORM  PRINT-DETAIL.
069300     ADD      01 TO REC-CT.
069400*    .05
069500     IF       WRK-XN-0002-003 NOT EQUAL TO "10"
069600              MOVE "NO/EXCEPTION" TO  RE-MARK
069700              MOVE WRK-XN-0002-003 TO COMPUTED-A
069800              MOVE "10" TO CORRECT-A
069900              PERFORM FAIL
070000              ELSE
070100              PERFORM PASS.
070200     PERFORM  PRINT-DETAIL
070300     ADD      01 TO REC-CT.
070400*    .06
070500     MOVE     SPACE TO RL-FD2-STATUS.
070600     CLOSE    RL-FD2
070700     IF        RL-FD2-STATUS NOT EQUAL TO "00"
070800              MOVE "CLOSE/STATUS" TO RE-MARK
070900              MOVE  RL-FD2-STATUS TO  COMPUTED-A
071000              MOVE "00" TO CORRECT-A
071100              PERFORM FAIL
071200              ELSE
071300              PERFORM PASS.
071400     PERFORM  PRINT-DETAIL.
071500     ADD      01 TO REC-CT.
071600*    .07
071700 CCVS-EXIT SECTION.
071800 CCVS-999999.
071900     GO TO CLOSE-FILES.
