000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL110A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*GENERAL:    THIS PROGRAM IS THE THIRD OF A SERIES.  THE FUNCTION
001400*            OF THIS PROGRAM IS TO PROCESS THE FILE SEQUENTIALLY
001500*            (ACCESS MODE IS SEQUENTIAL). THE FILE USED IS THAT
001600*            RESULTING FROM RL109A.
001700*
001800*            FIRST, THE FILE IS VERIFIED FOR ACCURACY OF ITS 500
001900*            RECORDS.  SECONDLY, RECORDS OF THER FILE ARE
002000*            SELECTIVELY DELETED AND THIRDLY THE ACCURACY OF EACH
002100*            RECORD IN THE FILE IS AGAIN VERIFIED.
002200*
002300*            X-CARD PARAMETERS WHICH MUST BE SUPPLIED FOR THIS
002400*            PROGRAM ARE:
002500*
002600*
002700*                 X-21   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR
002800*                         RELATIVE  I-O DATA FILE
002900*                 X-55   SYSTEM PRINTER
003000*                 X-69   ADDITIONAL VALUE OF CLAUSES
003100*                 X-74   VALUE OF IMPLEMENTOR-NAME
003200*                 X-75   OBJECT OF VALUE OF CLAUSE
003300*                 X-82   SOURCE-COMPUTER
003400*                 X-83   OBJECT-COMPUTER.
003500*
003600***************************************************
003700 ENVIRONMENT DIVISION.
003800 CONFIGURATION SECTION.
003900 SOURCE-COMPUTER.
004000     XXXXX082.
004100 OBJECT-COMPUTER.
004200     XXXXX083.
004300 INPUT-OUTPUT SECTION.
004400 FILE-CONTROL.
004500     SELECT PRINT-FILE ASSIGN TO
004600     XXXXX055.
004700     SELECT   RL-FS1 ASSIGN TO
004800     XXXXX061
004900              ORGANIZATION IS RELATIVE
005000              ACCESS  MODE IS SEQUENTIAL
005100              RELATIVE KEY IS RL-FS1-KEY.
005200 DATA DIVISION.
005300 FILE SECTION.
005400 FD  PRINT-FILE.
005500 01  PRINT-REC PICTURE X(120).
005600 01  DUMMY-RECORD PICTURE X(120).
005700 FD  RL-FS1
005800     LABEL RECORDS STANDARD
005900C    VALUE OF
006000C    XXXXX074
006100C    IS
006200C    XXXXX075
006300G    XXXXX069
006400     BLOCK CONTAINS 01 RECORDS
006500     RECORD CONTAINS 120.
006600 01  RL-FS1R1-F-G-120.
006700     02 RL-WRK-120 PIC X(120).
006800 WORKING-STORAGE SECTION.
006900 01  RL-FS1-KEY        PIC 9(08) USAGE COMP VALUE ZERO.
007000 01  WRK-CS-09V00-006 PIC S9(09) USAGE COMP VALUE ZERO.
007100 01  WRK-CS-09V00-007 PIC S9(09) USAGE COMP VALUE ZERO.
007200 01  WRK-CS-09V00-008 PIC S9(09) USAGE COMP VALUE ZERO.
007300 01  WRK-CS-09V00-009 PIC S9(09) USAGE COMP VALUE ZERO.
007400 01  WRK-CS-09V00-010 PIC S9(09) USAGE COMP VALUE ZERO.
007500 01  WRK-CS-09V00-011 PIC S9(09) USAGE COMP VALUE ZERO.
007600 01  I-O-ERROR-RL-FS1 PIC X(3) VALUE "NO ".
007700 01  FILE-RECORD-INFORMATION-REC.
007800     03 FILE-RECORD-INFO-SKELETON.
007900        05 FILLER                 PICTURE X(48)       VALUE
008000             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
008100        05 FILLER                 PICTURE X(46)       VALUE
008200             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
008300        05 FILLER                 PICTURE X(26)       VALUE
008400             ",LFIL=000000,ORG=  ,LBLR= ".
008500        05 FILLER                 PICTURE X(37)       VALUE
008600             ",RECKEY=                             ".
008700        05 FILLER                 PICTURE X(38)       VALUE
008800             ",ALTKEY1=                             ".
008900        05 FILLER                 PICTURE X(38)       VALUE
009000             ",ALTKEY2=                             ".
009100        05 FILLER                 PICTURE X(7)        VALUE SPACE.
009200     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
009300        05 FILE-RECORD-INFO-P1-120.
009400           07 FILLER              PIC X(5).
009500           07 XFILE-NAME           PIC X(6).
009600           07 FILLER              PIC X(8).
009700           07 XRECORD-NAME         PIC X(6).
009800           07 FILLER              PIC X(1).
009900           07 REELUNIT-NUMBER     PIC 9(1).
010000           07 FILLER              PIC X(7).
010100           07 XRECORD-NUMBER       PIC 9(6).
010200           07 FILLER              PIC X(6).
010300           07 UPDATE-NUMBER       PIC 9(2).
010400           07 FILLER              PIC X(5).
010500           07 ODO-NUMBER          PIC 9(4).
010600           07 FILLER              PIC X(5).
010700           07 XPROGRAM-NAME        PIC X(5).
010800           07 FILLER              PIC X(7).
010900           07 XRECORD-LENGTH       PIC 9(6).
011000           07 FILLER              PIC X(7).
011100           07 CHARS-OR-RECORDS    PIC X(2).
011200           07 FILLER              PIC X(1).
011300           07 XBLOCK-SIZE          PIC 9(4).
011400           07 FILLER              PIC X(6).
011500           07 RECORDS-IN-FILE     PIC 9(6).
011600           07 FILLER              PIC X(5).
011700           07 XFILE-ORGANIZATION   PIC X(2).
011800           07 FILLER              PIC X(6).
011900           07 XLABEL-TYPE          PIC X(1).
012000        05 FILE-RECORD-INFO-P121-240.
012100           07 FILLER              PIC X(8).
012200           07 XRECORD-KEY          PIC X(29).
012300           07 FILLER              PIC X(9).
012400           07 ALTERNATE-KEY1      PIC X(29).
012500           07 FILLER              PIC X(9).
012600           07 ALTERNATE-KEY2      PIC X(29).
012700           07 FILLER              PIC X(7).
012800 01  TEST-RESULTS.
012900     02 FILLER                   PIC X      VALUE SPACE.
013000     02 FEATURE                  PIC X(20)  VALUE SPACE.
013100     02 FILLER                   PIC X      VALUE SPACE.
013200     02 P-OR-F                   PIC X(5)   VALUE SPACE.
013300     02 FILLER                   PIC X      VALUE SPACE.
013400     02  PAR-NAME.
013500       03 FILLER                 PIC X(19)  VALUE SPACE.
013600       03  PARDOT-X              PIC X      VALUE SPACE.
013700       03 DOTVALUE               PIC 99     VALUE ZERO.
013800     02 FILLER                   PIC X(8)   VALUE SPACE.
013900     02 RE-MARK                  PIC X(61).
014000 01  TEST-COMPUTED.
014100     02 FILLER                   PIC X(30)  VALUE SPACE.
014200     02 FILLER                   PIC X(17)  VALUE
014300            "       COMPUTED=".
014400     02 COMPUTED-X.
014500     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
014600     03 COMPUTED-N               REDEFINES COMPUTED-A
014700                                 PIC -9(9).9(9).
014800     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
014900     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
015000     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015100     03       CM-18V0 REDEFINES COMPUTED-A.
015200         04 COMPUTED-18V0                    PIC -9(18).
015300         04 FILLER                           PIC X.
015400     03 FILLER PIC X(50) VALUE SPACE.
015500 01  TEST-CORRECT.
015600     02 FILLER PIC X(30) VALUE SPACE.
015700     02 FILLER PIC X(17) VALUE "       CORRECT =".
015800     02 CORRECT-X.
015900     03 CORRECT-A                  PIC X(20) VALUE SPACE.
016000     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016100     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
016200     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
016300     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
016400     03      CR-18V0 REDEFINES CORRECT-A.
016500         04 CORRECT-18V0                     PIC -9(18).
016600         04 FILLER                           PIC X.
016700     03 FILLER PIC X(2) VALUE SPACE.
016800     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
016900 01  CCVS-C-1.
017000     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017100-    "SS  PARAGRAPH-NAME
017200-    "       REMARKS".
017300     02 FILLER                     PIC X(20)    VALUE SPACE.
017400 01  CCVS-C-2.
017500     02 FILLER                     PIC X        VALUE SPACE.
017600     02 FILLER                     PIC X(6)     VALUE "TESTED".
017700     02 FILLER                     PIC X(15)    VALUE SPACE.
017800     02 FILLER                     PIC X(4)     VALUE "FAIL".
017900     02 FILLER                     PIC X(94)    VALUE SPACE.
018000 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018100 01  REC-CT                        PIC 99       VALUE ZERO.
018200 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
018300 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
018400 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
018500 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
018600 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
018700 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
018800 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
018900 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
019000 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019100 01  CCVS-H-1.
019200     02  FILLER                    PIC X(39)    VALUE SPACES.
019300     02  FILLER                    PIC X(42)    VALUE
019400     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
019500     02  FILLER                    PIC X(39)    VALUE SPACES.
019600 01  CCVS-H-2A.
019700   02  FILLER                        PIC X(40)  VALUE SPACE.
019800   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
019900   02  FILLER                        PIC XXXX   VALUE
020000     "4.2 ".
020100   02  FILLER                        PIC X(28)  VALUE
020200            " COPY - NOT FOR DISTRIBUTION".
020300   02  FILLER                        PIC X(41)  VALUE SPACE.
020400
020500 01  CCVS-H-2B.
020600   02  FILLER                        PIC X(15)  VALUE
020700            "TEST RESULT OF ".
020800   02  TEST-ID                       PIC X(9).
020900   02  FILLER                        PIC X(4)   VALUE
021000            " IN ".
021100   02  FILLER                        PIC X(12)  VALUE
021200     " HIGH       ".
021300   02  FILLER                        PIC X(22)  VALUE
021400            " LEVEL VALIDATION FOR ".
021500   02  FILLER                        PIC X(58)  VALUE
021600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021700 01  CCVS-H-3.
021800     02  FILLER                      PIC X(34)  VALUE
021900            " FOR OFFICIAL USE ONLY    ".
022000     02  FILLER                      PIC X(58)  VALUE
022100     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022200     02  FILLER                      PIC X(28)  VALUE
022300            "  COPYRIGHT   1985 ".
022400 01  CCVS-E-1.
022500     02 FILLER                       PIC X(52)  VALUE SPACE.
022600     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
022700     02 ID-AGAIN                     PIC X(9).
022800     02 FILLER                       PIC X(45)  VALUE SPACES.
022900 01  CCVS-E-2.
023000     02  FILLER                      PIC X(31)  VALUE SPACE.
023100     02  FILLER                      PIC X(21)  VALUE SPACE.
023200     02 CCVS-E-2-2.
023300         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
023400         03 FILLER                   PIC X      VALUE SPACE.
023500         03 ENDER-DESC               PIC X(44)  VALUE
023600            "ERRORS ENCOUNTERED".
023700 01  CCVS-E-3.
023800     02  FILLER                      PIC X(22)  VALUE
023900            " FOR OFFICIAL USE ONLY".
024000     02  FILLER                      PIC X(12)  VALUE SPACE.
024100     02  FILLER                      PIC X(58)  VALUE
024200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024300     02  FILLER                      PIC X(13)  VALUE SPACE.
024400     02 FILLER                       PIC X(15)  VALUE
024500             " COPYRIGHT 1985".
024600 01  CCVS-E-4.
024700     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
024800     02 FILLER                       PIC X(4)   VALUE " OF ".
024900     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
025000     02 FILLER                       PIC X(40)  VALUE
025100      "  TESTS WERE EXECUTED SUCCESSFULLY".
025200 01  XXINFO.
025300     02 FILLER                       PIC X(19)  VALUE
025400            "*** INFORMATION ***".
025500     02 INFO-TEXT.
025600       04 FILLER                     PIC X(8)   VALUE SPACE.
025700       04 XXCOMPUTED                 PIC X(20).
025800       04 FILLER                     PIC X(5)   VALUE SPACE.
025900       04 XXCORRECT                  PIC X(20).
026000     02 INF-ANSI-REFERENCE           PIC X(48).
026100 01  HYPHEN-LINE.
026200     02 FILLER  PIC IS X VALUE IS SPACE.
026300     02 FILLER  PIC IS X(65)    VALUE IS "************************
026400-    "*****************************************".
026500     02 FILLER  PIC IS X(54)    VALUE IS "************************
026600-    "******************************".
026700 01  CCVS-PGM-ID                     PIC X(9)   VALUE
026800     "RL110A".
026900 PROCEDURE DIVISION.
027000 CCVS1 SECTION.
027100 OPEN-FILES.
027200     OPEN    OUTPUT PRINT-FILE.
027300     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027400     MOVE    SPACE TO TEST-RESULTS.
027500     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
027600     MOVE    ZERO TO REC-SKL-SUB.
027700     PERFORM CCVS-INIT-FILE 9 TIMES.
027800 CCVS-INIT-FILE.
027900     ADD     1 TO REC-SKL-SUB.
028000     MOVE    FILE-RECORD-INFO-SKELETON
028100          TO FILE-RECORD-INFO (REC-SKL-SUB).
028200 CCVS-INIT-EXIT.
028300     GO TO CCVS1-EXIT.
028400 CLOSE-FILES.
028500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028600 TERMINATE-CCVS.
028700S    EXIT PROGRAM.
028800STERMINATE-CALL.
028900     STOP     RUN.
029000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029400     MOVE "****TEST DELETED****" TO RE-MARK.
029500 PRINT-DETAIL.
029600     IF REC-CT NOT EQUAL TO ZERO
029700             MOVE "." TO PARDOT-X
029800             MOVE REC-CT TO DOTVALUE.
029900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030400     MOVE SPACE TO CORRECT-X.
030500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030600     MOVE     SPACE TO RE-MARK.
030700 HEAD-ROUTINE.
030800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031200 COLUMN-NAMES-ROUTINE.
031300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031600 END-ROUTINE.
031700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031800 END-RTN-EXIT.
031900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032000 END-ROUTINE-1.
032100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032300      ADD PASS-COUNTER TO ERROR-HOLD.
032400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032500      MOVE PASS-COUNTER TO CCVS-E-4-1.
032600      MOVE ERROR-HOLD TO CCVS-E-4-2.
032700      MOVE CCVS-E-4 TO CCVS-E-2-2.
032800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
032900  END-ROUTINE-12.
033000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033100     IF       ERROR-COUNTER IS EQUAL TO ZERO
033200         MOVE "NO " TO ERROR-TOTAL
033300         ELSE
033400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033600     PERFORM WRITE-LINE.
033700 END-ROUTINE-13.
033800     IF DELETE-COUNTER IS EQUAL TO ZERO
033900         MOVE "NO " TO ERROR-TOTAL  ELSE
034000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034300      IF   INSPECT-COUNTER EQUAL TO ZERO
034400          MOVE "NO " TO ERROR-TOTAL
034500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034900 WRITE-LINE.
035000     ADD 1 TO RECORD-COUNT.
035100Y    IF RECORD-COUNT GREATER 50
035200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035300Y        MOVE SPACE TO DUMMY-RECORD
035400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035500Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
035600Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
035700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
035800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
035900Y        MOVE ZERO TO RECORD-COUNT.
036000     PERFORM WRT-LN.
036100 WRT-LN.
036200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036300     MOVE SPACE TO DUMMY-RECORD.
036400 BLANK-LINE-PRINT.
036500     PERFORM WRT-LN.
036600 FAIL-ROUTINE.
036700     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037200     MOVE   SPACES TO INF-ANSI-REFERENCE.
037300     GO TO  FAIL-ROUTINE-EX.
037400 FAIL-ROUTINE-WRITE.
037500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
037700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
037800     MOVE   SPACES TO COR-ANSI-REFERENCE.
037900 FAIL-ROUTINE-EX. EXIT.
038000 BAIL-OUT.
038100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038300 BAIL-OUT-WRITE.
038400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038700     MOVE   SPACES TO INF-ANSI-REFERENCE.
038800 BAIL-OUT-EX. EXIT.
038900 CCVS1-EXIT.
039000     EXIT.
039100 SECT-RL110A-001 SECTION.
039200 REL-INIT-006.
039300     MOVE  99 TO RL-FS1-KEY.
039400*    THIS FILE "RL-FS1" IS ACCESSED SEQUENTIALLY AND HAS
039500*    ASSOCIATED WITH IT A RELATIVE KEY WHICH AT ALL TIMES SHOULD
039600*    CONTAIN THE NUMBER OF THE RECORD PREVIOUSLY READ.
039700     OPEN INPUT RL-FS1.
039800     MOVE   "REL-TEST-006" TO   PAR-NAME.
039900     MOVE   "VII-26 4.5.4" TO ANSI-REFERENCE.
040000     MOVE    ZERO TO             WRK-CS-09V00-006.
040100     MOVE    ZERO TO             WRK-CS-09V00-007.
040200     MOVE    ZERO TO             WRK-CS-09V00-008.
040300     MOVE    ZERO TO             WRK-CS-09V00-009.
040400     MOVE    ZERO TO             WRK-CS-09V00-010.
040500     MOVE    ZERO TO             WRK-CS-09V00-011.
040600     MOVE    SPACE TO  FILE-RECORD-INFO-P1-120 (1).
040700     MOVE    RL-FS1-KEY TO WRK-CS-09V00-011.
040800     MOVE    01 TO REC-CT.
040900     MOVE   "READ SEQUENTIAL"  TO FEATURE.
041000 REL-TEST-006-R.
041100     ADD     1 TO WRK-CS-09V00-006.
041200     READ    RL-FS1
041300                END GO TO REL-TEST-006-3
041400         NOT AT END GO TO REL-TEST-006-A
041500     END-READ.
041600 REL-TEST-006-A.
041700     MOVE     RL-FS1R1-F-G-120    TO FILE-RECORD-INFO-P1-120 (1).
041800     IF       UPDATE-NUMBER (1) EQUAL TO 00
041900             ADD 1 TO WRK-CS-09V00-007
042000             GO TO   REL-TEST-006-2.
042100     IF      UPDATE-NUMBER (1) EQUAL TO 01
042200             ADD 1 TO WRK-CS-09V00-008
042300             GO TO   REL-TEST-006-2.
042400     ADD     1 TO WRK-CS-09V00-009.
042500 REL-TEST-006-2.
042600     IF      RL-FS1-KEY NOT EQUAL TO XRECORD-NUMBER (1)
042700             ADD 1 TO  WRK-CS-09V00-010.
042800     IF      WRK-CS-09V00-006  GREATER 501
042900             GO TO   REL-TEST-006-3.
043000     GO TO   REL-TEST-006-R.
043100 REL-TEST-006-3.
043200     IF      WRK-CS-09V00-006 NOT EQUAL TO 501
043300             MOVE "INCORRECT RECORD COUNT"  TO RE-MARK
043400             MOVE  WRK-CS-09V00-006 TO COMPUTED-18V0
043500             MOVE  501  TO             CORRECT-18V0
043600             PERFORM FAIL
043700     ELSE
043800             PERFORM PASS.
043900     PERFORM PRINT-DETAIL.
044000*    .01
044100     ADD     1 TO REC-CT.
044200     IF      WRK-CS-09V00-007 EQUAL TO 400
044300             PERFORM PASS
044400     ELSE
044500             MOVE "NON-UPDATED RECORDS" TO COMPUTED-A
044600             MOVE  WRK-CS-09V00-007 TO CORRECT-18V0
044700             MOVE "SHOULD BE 400" TO RE-MARK
044800             PERFORM FAIL.
044900     PERFORM PRINT-DETAIL.
045000     ADD     1 TO REC-CT.
045100*    .02
045200     IF      WRK-CS-09V00-008 EQUAL TO 100
045300             PERFORM PASS
045400     ELSE
045500             MOVE WRK-CS-09V00-008 TO COMPUTED-18V0
045600             MOVE 100             TO  CORRECT-18V0
045700             MOVE "UPDATED RECORDS" TO RE-MARK
045800             PERFORM FAIL.
045900     PERFORM PRINT-DETAIL.
046000     ADD     1 TO REC-CT.
046100*    .03
046200     IF      WRK-CS-09V00-009 EQUAL TO ZERO
046300             PERFORM PASS
046400     ELSE
046500             MOVE WRK-CS-09V00-009 TO COMPUTED-18V0
046600             MOVE  ZERO            TO CORRECT-18V0
046700             MOVE "BAD-UPDATES" TO RE-MARK
046800             PERFORM FAIL.
046900     PERFORM PRINT-DETAIL.
047000     ADD     01 TO REC-CT.
047100*    .04
047200     IF      WRK-CS-09V00-010 EQUAL TO ZERO
047300             PERFORM PASS
047400     ELSE
047500             MOVE WRK-CS-09V00-010 TO COMPUTED-18V0
047600             MOVE ZERO             TO CORRECT-18V0
047700             MOVE "KEY VS RECORD" TO RE-MARK
047800             PERFORM FAIL.
047900     PERFORM PRINT-DETAIL.
048000     ADD     01 TO REC-CT.
048100*    .05
048200     MOVE    WRK-CS-09V00-011 TO RL-FS1-KEY.
048300     MOVE  RL-FS1-KEY TO COMPUTED-18V0.
048400     MOVE    "INFORMATION" TO CORRECT-A.
048500     MOVE    "STATUS AFTER OPEN" TO RE-MARK.
048600     PERFORM PRINT-DETAIL.
048700     ADD     01 TO REC-CT.
048800*    .06
048900     CLOSE    RL-FS1.
049000 REL-INIT-007.
049100     MOVE   "REL-TEST-007" TO PAR-NAME
049200     MOVE   "VII-26 4.5.4" TO ANSI-REFERENCE.
049300     OPEN    I-O RL-FS1.
049400     MOVE    ZERO TO WRK-CS-09V00-006
049500     MOVE    ZERO TO WRK-CS-09V00-007
049600     MOVE    ZERO TO WRK-CS-09V00-008
049700     MOVE    ZERO TO WRK-CS-09V00-009
049800     MOVE    ZERO TO WRK-CS-09V00-010
049900     MOVE    ZERO TO WRK-CS-09V00-011
050000     MOVE    01 TO REC-CT.
050100     MOVE    SPACE TO  FILE-RECORD-INFO-P1-120 (1).
050200     MOVE   "DELETE"  TO FEATURE.
050300 REL-TEST-007-R.
050400     ADD     1 TO WRK-CS-09V00-006
050500     ADD     1 TO WRK-CS-09V00-007.
050600     READ    RL-FS1
050700             AT END
050800             MOVE "AT END PATH TAKEN " TO RE-MARK
050900             GO TO  REL-TEST-007-3
051000         NOT AT END
051100             GO TO  REL-TEST-007-A
051200     END-READ.
051300 REL-TEST-007-A.
051400     MOVE    RL-FS1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
051500     IF      WRK-CS-09V00-007  EQUAL TO 4
051600             GO TO REL-TEST-007-2.
051700     IF      WRK-CS-09V00-006 GREATER 501
051800             MOVE  "AT END NOT TAKEN"  TO RE-MARK
051900             GO TO REL-TEST-007-3.
052000     GO TO   REL-TEST-007-R.
052100 REL-TEST-007-2.
052200     MOVE   "VII-19 4.3.4" TO ANSI-REFERENCE.
052300     MOVE    CCVS-PGM-ID   TO XPROGRAM-NAME (1).
052400     MOVE    99 TO UPDATE-NUMBER (1).
052500     MOVE    FILE-RECORD-INFO-P1-120 (1) TO RL-FS1R1-F-G-120.
052600     DELETE  RL-FS1
052700     END-DELETE.
052800 REL-TEST-007-2-A.
052900     MOVE    ZERO TO  WRK-CS-09V00-007.
053000     ADD     1 TO  WRK-CS-09V00-008.
053100     GO TO   REL-TEST-007-R.
053200 REL-TEST-007-3.
053300     IF      WRK-CS-09V00-006 NOT EQUAL TO 501
053400             MOVE WRK-CS-09V00-006 TO COMPUTED-18V0
053500             MOVE              501 TO CORRECT-18V0
053600             PERFORM FAIL
053700             ELSE
053800             PERFORM PASS.
053900     PERFORM PRINT-DETAIL.
054000     ADD     01 TO REC-CT.
054100     CLOSE   RL-FS1.
054200 REL-INIT-008.
054300     MOVE   "REL-TEST-008" TO PAR-NAME.
054400     MOVE   "VII-26 4.5.4" TO ANSI-REFERENCE.
054500     MOVE    ZERO TO   WRK-CS-09V00-006
054600     MOVE    ZERO TO   WRK-CS-09V00-007
054700     MOVE    ZERO TO   WRK-CS-09V00-008
054800     MOVE    ZERO TO   WRK-CS-09V00-009
054900     MOVE    ZERO TO   WRK-CS-09V00-010
055000     MOVE    ZERO TO   WRK-CS-09V00-011
055100     MOVE    01 TO REC-CT.
055200     MOVE    SPACE  TO  FILE-RECORD-INFO-P1-120 (1).
055300     MOVE    ZERO TO RL-FS1-KEY.
055400     OPEN    INPUT  RL-FS1.
055500     MOVE   "READ UPDATED FILE"  TO FEATURE.
055600 REL-TEST-008-R.
055700     ADD     1 TO WRK-CS-09V00-006.
055800     ADD     1 TO WRK-CS-09V00-007.
055900     ADD     1 TO WRK-CS-09V00-008.
056000     READ    RL-FS1
056100             AT END  GO TO REL-TEST-008-3
056200         NOT AT END  GO TO REL-TEST-008-A
056300     END-READ.
056400 REL-TEST-008-A.
056500     MOVE    RL-FS1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
056600     IF      UPDATE-NUMBER (1) EQUAL TO 99
056700             ADD  1 TO WRK-CS-09V00-009.
056800     IF      WRK-CS-09V00-007  EQUAL TO 4
056900             MOVE 01 TO WRK-CS-09V00-007
057000             ADD 1 TO WRK-CS-09V00-008.
057100     IF      RL-FS1-KEY EQUAL TO  XRECORD-NUMBER (1)
057200             ADD 1 TO  WRK-CS-09V00-010.
057300     IF      XRECORD-NUMBER (1) EQUAL TO  WRK-CS-09V00-008
057400             ADD 1 TO  WRK-CS-09V00-011.
057500     IF      WRK-CS-09V00-006 GREATER  501
057600             GO TO REL-TEST-008-3.
057700     GO TO   REL-TEST-008-R.
057800 REL-TEST-008-3.
057900     IF      WRK-CS-09V00-006 NOT EQUAL TO 376
058000             MOVE "INCORRECT RECORD COUNT"  TO RE-MARK
058100             MOVE WRK-CS-09V00-006 TO COMPUTED-18V0
058200             MOVE 376 TO CORRECT-18V0
058300             PERFORM  FAIL
058400     ELSE
058500             PERFORM  PASS.
058600     PERFORM PRINT-DETAIL.
058700     ADD     01 TO REC-CT.
058800*    .01
058900     IF      WRK-CS-09V00-009 NOT EQUAL TO ZERO
059000             MOVE WRK-CS-09V00-009 TO COMPUTED-18V0
059100             MOVE   ZERO TO CORRECT-18V0
059200             MOVE "DELETED RECORDS" TO RE-MARK
059300             PERFORM FAIL
059400     ELSE
059500             PERFORM PASS.
059600     PERFORM PRINT-DETAIL.
059700     ADD     01  TO  REC-CT.
059800*    .02
059900     IF      WRK-CS-09V00-010 NOT EQUAL TO 375
060000             MOVE "KEY MISMATCH" TO RE-MARK
060100             MOVE 375 TO CORRECT-18V0
060200             MOVE WRK-CS-09V00-010 TO COMPUTED-18V0
060300             PERFORM FAIL
060400     ELSE
060500             PERFORM PASS.
060600     PERFORM PRINT-DETAIL.
060700     ADD     01 TO REC-CT.
060800*    .03
060900     IF      WRK-CS-09V00-011  NOT EQUAL TO 375
061000             MOVE   375  TO CORRECT-18V0
061100             MOVE  "INCORRECT RECORD FOUND"  TO RE-MARK
061200             MOVE   WRK-CS-09V00-011 TO COMPUTED-18V0
061300             PERFORM   FAIL
061400     ELSE
061500             PERFORM  PASS.
061600     PERFORM PRINT-DETAIL.
061700     ADD     01 TO REC-CT.
061800*04
061900     CLOSE   RL-FS1.
062000 CCVS-EXIT SECTION.
062100 CCVS-999999.
062200     GO TO CLOSE-FILES.
