000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL202A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*GENERAL:    THE FUNCTION OF THIS PROGRAM IS TO PROCESS A RELATIVE
001400*            I-O FILE RANDOMLY (ACCESS MODE IS DYNAMIC). THE FILE
001500*            USED AS INPUT IS THAT FILE CREATED BY RL201.
001600*
001700*            FIRST THE FILE IS VERIFED AS TO THE EXISTANCE AND
001800*            ACCURACY OF THE 500  RECORDS CREATED IN THE FIRST
001900*            PROGRAM.  SECONDLY, RECORDS OF THE FILE ARE SEL-
002000*            ECTIVELY UPDATED; AND THIRDLY, THE ACCURACY OF EACH
002100*            RECORD IN THE FILE IS AGAIN VERIFIED.
002200*
002300*            X-CARD PARAMETERS WHICH MUST BE SUPPLIED FOR THIS
002400*            PROGRAM ARE:
002500*
002600*                 X-21   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR
002700*                         RELATIVE  I-O DATA FILE
002800*                 X-55   SYSTEM PRINTER
002900*                 X-69   ADDITIONAL VALUE OF CLAUSES
003000*                 X-74   VALUE OF IMPLEMENTOR-NAME
003100*                 X-75   OBJECT OF VALUE OF CLAUSE
003200*                 X-82   SOURCE-COMPUTER
003300*                 X-83   OBJECT-COMPUTER.
003400*
003500***************************************************
003600 ENVIRONMENT DIVISION.
003700 CONFIGURATION SECTION.
003800 SOURCE-COMPUTER.
003900     XXXXX082.
004000 OBJECT-COMPUTER.
004100     XXXXX083.
004200 INPUT-OUTPUT SECTION.
004300 FILE-CONTROL.
004400     SELECT PRINT-FILE ASSIGN TO
004500     XXXXX055.
004600     SELECT  RL-FD1 ASSIGN TO
004700     XXXXP021
004800             ORGANIZATION IS RELATIVE
004900             ACCESS  MODE IS DYNAMIC
005000             RELATIVE KEY RL-FD1-KEY.
005100 DATA DIVISION.
005200 FILE SECTION.
005300 FD  PRINT-FILE.
005400 01  PRINT-REC PICTURE X(120).
005500 01  DUMMY-RECORD PICTURE X(120).
005600 FD  RL-FD1
005700     LABEL RECORDS STANDARD
005800C    VALUE OF
005900C    XXXXX074
006000C    IS
006100C    XXXXX075
006200G    XXXXX069
006300     BLOCK CONTAINS 1 RECORDS
006400     RECORD CONTAINS 120 CHARACTERS.
006500 01  RL-FD1R1-F-G-120.
006600     02 FILLER PICTURE X(120).
006700 WORKING-STORAGE SECTION.
006800 01  WRK-CS-09V00 PIC S9(09)      USAGE COMP VALUE ZERO.
006900 01  RL-FD1-KEY        PIC 9(09)  USAGE COMP VALUE ZERO.
007000 01  WRK-DS-09V00-002 PIC S9(9) VALUE ZERO.
007100 01  WRK-CS-09V00-002 PIC S9(09)       USAGE COMP VALUE ZERO.
007200 01  WRK-CS-09V00-003 PIC S9(09)       USAGE COMP VALUE ZERO.
007300 01  I-O-ERROR-RL-FD1 PIC X(3) VALUE "NO ".
007400 01  WRK-CS-09V00-001 PIC S9(09)       USAGE COMP VALUE ZERO.
007500 01  WRK-CS-09V00-004 PIC S9(09)       USAGE COMP VALUE ZERO.
007600 01  WRK-CS-09V00-005 PIC S9(09)       USAGE COMP VALUE ZERO.
007700 01  WRK-DS-09V00-001 PIC S9(09)      VALUE ZERO.
007800 01  FILE-RECORD-INFORMATION-REC.
007900     03 FILE-RECORD-INFO-SKELETON.
008000        05 FILLER                 PICTURE X(48)       VALUE
008100             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
008200        05 FILLER                 PICTURE X(46)       VALUE
008300             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
008400        05 FILLER                 PICTURE X(26)       VALUE
008500             ",LFIL=000000,ORG=  ,LBLR= ".
008600        05 FILLER                 PICTURE X(37)       VALUE
008700             ",RECKEY=                             ".
008800        05 FILLER                 PICTURE X(38)       VALUE
008900             ",ALTKEY1=                             ".
009000        05 FILLER                 PICTURE X(38)       VALUE
009100             ",ALTKEY2=                             ".
009200        05 FILLER                 PICTURE X(7)        VALUE SPACE.
009300     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
009400        05 FILE-RECORD-INFO-P1-120.
009500           07 FILLER              PIC X(5).
009600           07 XFILE-NAME           PIC X(6).
009700           07 FILLER              PIC X(8).
009800           07 XRECORD-NAME         PIC X(6).
009900           07 FILLER              PIC X(1).
010000           07 REELUNIT-NUMBER     PIC 9(1).
010100           07 FILLER              PIC X(7).
010200           07 XRECORD-NUMBER       PIC 9(6).
010300           07 FILLER              PIC X(6).
010400           07 UPDATE-NUMBER       PIC 9(2).
010500           07 FILLER              PIC X(5).
010600           07 ODO-NUMBER          PIC 9(4).
010700           07 FILLER              PIC X(5).
010800           07 XPROGRAM-NAME        PIC X(5).
010900           07 FILLER              PIC X(7).
011000           07 XRECORD-LENGTH       PIC 9(6).
011100           07 FILLER              PIC X(7).
011200           07 CHARS-OR-RECORDS    PIC X(2).
011300           07 FILLER              PIC X(1).
011400           07 XBLOCK-SIZE          PIC 9(4).
011500           07 FILLER              PIC X(6).
011600           07 RECORDS-IN-FILE     PIC 9(6).
011700           07 FILLER              PIC X(5).
011800           07 XFILE-ORGANIZATION   PIC X(2).
011900           07 FILLER              PIC X(6).
012000           07 XLABEL-TYPE          PIC X(1).
012100        05 FILE-RECORD-INFO-P121-240.
012200           07 FILLER              PIC X(8).
012300           07 XRECORD-KEY          PIC X(29).
012400           07 FILLER              PIC X(9).
012500           07 ALTERNATE-KEY1      PIC X(29).
012600           07 FILLER              PIC X(9).
012700           07 ALTERNATE-KEY2      PIC X(29).
012800           07 FILLER              PIC X(7).
012900 01  TEST-RESULTS.
013000     02 FILLER                   PIC X      VALUE SPACE.
013100     02 FEATURE                  PIC X(20)  VALUE SPACE.
013200     02 FILLER                   PIC X      VALUE SPACE.
013300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
013400     02 FILLER                   PIC X      VALUE SPACE.
013500     02  PAR-NAME.
013600       03 FILLER                 PIC X(19)  VALUE SPACE.
013700       03  PARDOT-X              PIC X      VALUE SPACE.
013800       03 DOTVALUE               PIC 99     VALUE ZERO.
013900     02 FILLER                   PIC X(8)   VALUE SPACE.
014000     02 RE-MARK                  PIC X(61).
014100 01  TEST-COMPUTED.
014200     02 FILLER                   PIC X(30)  VALUE SPACE.
014300     02 FILLER                   PIC X(17)  VALUE
014400            "       COMPUTED=".
014500     02 COMPUTED-X.
014600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
014700     03 COMPUTED-N               REDEFINES COMPUTED-A
014800                                 PIC -9(9).9(9).
014900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
015000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
015100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015200     03       CM-18V0 REDEFINES COMPUTED-A.
015300         04 COMPUTED-18V0                    PIC -9(18).
015400         04 FILLER                           PIC X.
015500     03 FILLER PIC X(50) VALUE SPACE.
015600 01  TEST-CORRECT.
015700     02 FILLER PIC X(30) VALUE SPACE.
015800     02 FILLER PIC X(17) VALUE "       CORRECT =".
015900     02 CORRECT-X.
016000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
016100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
016300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
016400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
016500     03      CR-18V0 REDEFINES CORRECT-A.
016600         04 CORRECT-18V0                     PIC -9(18).
016700         04 FILLER                           PIC X.
016800     03 FILLER PIC X(2) VALUE SPACE.
016900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
017000 01  CCVS-C-1.
017100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017200-    "SS  PARAGRAPH-NAME
017300-    "       REMARKS".
017400     02 FILLER                     PIC X(20)    VALUE SPACE.
017500 01  CCVS-C-2.
017600     02 FILLER                     PIC X        VALUE SPACE.
017700     02 FILLER                     PIC X(6)     VALUE "TESTED".
017800     02 FILLER                     PIC X(15)    VALUE SPACE.
017900     02 FILLER                     PIC X(4)     VALUE "FAIL".
018000     02 FILLER                     PIC X(94)    VALUE SPACE.
018100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018200 01  REC-CT                        PIC 99       VALUE ZERO.
018300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
018400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
018500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
018600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
018700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
018800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
018900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
019000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
019100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019200 01  CCVS-H-1.
019300     02  FILLER                    PIC X(39)    VALUE SPACES.
019400     02  FILLER                    PIC X(42)    VALUE
019500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
019600     02  FILLER                    PIC X(39)    VALUE SPACES.
019700 01  CCVS-H-2A.
019800   02  FILLER                        PIC X(40)  VALUE SPACE.
019900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
020000   02  FILLER                        PIC XXXX   VALUE
020100     "4.2 ".
020200   02  FILLER                        PIC X(28)  VALUE
020300            " COPY - NOT FOR DISTRIBUTION".
020400   02  FILLER                        PIC X(41)  VALUE SPACE.
020500
020600 01  CCVS-H-2B.
020700   02  FILLER                        PIC X(15)  VALUE
020800            "TEST RESULT OF ".
020900   02  TEST-ID                       PIC X(9).
021000   02  FILLER                        PIC X(4)   VALUE
021100            " IN ".
021200   02  FILLER                        PIC X(12)  VALUE
021300     " HIGH       ".
021400   02  FILLER                        PIC X(22)  VALUE
021500            " LEVEL VALIDATION FOR ".
021600   02  FILLER                        PIC X(58)  VALUE
021700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021800 01  CCVS-H-3.
021900     02  FILLER                      PIC X(34)  VALUE
022000            " FOR OFFICIAL USE ONLY    ".
022100     02  FILLER                      PIC X(58)  VALUE
022200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022300     02  FILLER                      PIC X(28)  VALUE
022400            "  COPYRIGHT   1985 ".
022500 01  CCVS-E-1.
022600     02 FILLER                       PIC X(52)  VALUE SPACE.
022700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
022800     02 ID-AGAIN                     PIC X(9).
022900     02 FILLER                       PIC X(45)  VALUE SPACES.
023000 01  CCVS-E-2.
023100     02  FILLER                      PIC X(31)  VALUE SPACE.
023200     02  FILLER                      PIC X(21)  VALUE SPACE.
023300     02 CCVS-E-2-2.
023400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
023500         03 FILLER                   PIC X      VALUE SPACE.
023600         03 ENDER-DESC               PIC X(44)  VALUE
023700            "ERRORS ENCOUNTERED".
023800 01  CCVS-E-3.
023900     02  FILLER                      PIC X(22)  VALUE
024000            " FOR OFFICIAL USE ONLY".
024100     02  FILLER                      PIC X(12)  VALUE SPACE.
024200     02  FILLER                      PIC X(58)  VALUE
024300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024400     02  FILLER                      PIC X(13)  VALUE SPACE.
024500     02 FILLER                       PIC X(15)  VALUE
024600             " COPYRIGHT 1985".
024700 01  CCVS-E-4.
024800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
024900     02 FILLER                       PIC X(4)   VALUE " OF ".
025000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
025100     02 FILLER                       PIC X(40)  VALUE
025200      "  TESTS WERE EXECUTED SUCCESSFULLY".
025300 01  XXINFO.
025400     02 FILLER                       PIC X(19)  VALUE
025500            "*** INFORMATION ***".
025600     02 INFO-TEXT.
025700       04 FILLER                     PIC X(8)   VALUE SPACE.
025800       04 XXCOMPUTED                 PIC X(20).
025900       04 FILLER                     PIC X(5)   VALUE SPACE.
026000       04 XXCORRECT                  PIC X(20).
026100     02 INF-ANSI-REFERENCE           PIC X(48).
026200 01  HYPHEN-LINE.
026300     02 FILLER  PIC IS X VALUE IS SPACE.
026400     02 FILLER  PIC IS X(65)    VALUE IS "************************
026500-    "*****************************************".
026600     02 FILLER  PIC IS X(54)    VALUE IS "************************
026700-    "******************************".
026800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
026900     "RL202A".
027000 PROCEDURE DIVISION.
027100 CCVS1 SECTION.
027200 OPEN-FILES.
027300     OPEN    OUTPUT PRINT-FILE.
027400     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027500     MOVE    SPACE TO TEST-RESULTS.
027600     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
027700     MOVE    ZERO TO REC-SKL-SUB.
027800     PERFORM CCVS-INIT-FILE 9 TIMES.
027900 CCVS-INIT-FILE.
028000     ADD     1 TO REC-SKL-SUB.
028100     MOVE    FILE-RECORD-INFO-SKELETON
028200          TO FILE-RECORD-INFO (REC-SKL-SUB).
028300 CCVS-INIT-EXIT.
028400     GO TO CCVS1-EXIT.
028500 CLOSE-FILES.
028600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028700 TERMINATE-CCVS.
028800S    EXIT PROGRAM.
028900STERMINATE-CALL.
029000     STOP     RUN.
029100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029500     MOVE "****TEST DELETED****" TO RE-MARK.
029600 PRINT-DETAIL.
029700     IF REC-CT NOT EQUAL TO ZERO
029800             MOVE "." TO PARDOT-X
029900             MOVE REC-CT TO DOTVALUE.
030000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030500     MOVE SPACE TO CORRECT-X.
030600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030700     MOVE     SPACE TO RE-MARK.
030800 HEAD-ROUTINE.
030900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031300 COLUMN-NAMES-ROUTINE.
031400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031700 END-ROUTINE.
031800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031900 END-RTN-EXIT.
032000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032100 END-ROUTINE-1.
032200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032400      ADD PASS-COUNTER TO ERROR-HOLD.
032500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032600      MOVE PASS-COUNTER TO CCVS-E-4-1.
032700      MOVE ERROR-HOLD TO CCVS-E-4-2.
032800      MOVE CCVS-E-4 TO CCVS-E-2-2.
032900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033000  END-ROUTINE-12.
033100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033200     IF       ERROR-COUNTER IS EQUAL TO ZERO
033300         MOVE "NO " TO ERROR-TOTAL
033400         ELSE
033500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033700     PERFORM WRITE-LINE.
033800 END-ROUTINE-13.
033900     IF DELETE-COUNTER IS EQUAL TO ZERO
034000         MOVE "NO " TO ERROR-TOTAL  ELSE
034100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034400      IF   INSPECT-COUNTER EQUAL TO ZERO
034500          MOVE "NO " TO ERROR-TOTAL
034600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035000 WRITE-LINE.
035100     ADD 1 TO RECORD-COUNT.
035200Y    IF RECORD-COUNT GREATER 50
035300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035400Y        MOVE SPACE TO DUMMY-RECORD
035500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035600Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
035700Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
035800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
035900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036000Y        MOVE ZERO TO RECORD-COUNT.
036100     PERFORM WRT-LN.
036200 WRT-LN.
036300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036400     MOVE SPACE TO DUMMY-RECORD.
036500 BLANK-LINE-PRINT.
036600     PERFORM WRT-LN.
036700 FAIL-ROUTINE.
036800     IF     COMPUTED-X NOT EQUAL TO SPACE
036900            GO TO   FAIL-ROUTINE-WRITE.
037000     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037100     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037200     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037400     MOVE   SPACES TO INF-ANSI-REFERENCE.
037500     GO TO  FAIL-ROUTINE-EX.
037600 FAIL-ROUTINE-WRITE.
037700     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037800     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
037900     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038000     MOVE   SPACES TO COR-ANSI-REFERENCE.
038100 FAIL-ROUTINE-EX. EXIT.
038200 BAIL-OUT.
038300     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038400     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038500 BAIL-OUT-WRITE.
038600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038900     MOVE   SPACES TO INF-ANSI-REFERENCE.
039000 BAIL-OUT-EX. EXIT.
039100 CCVS1-EXIT.
039200     EXIT.
039300 SECT-RL202-001 SECTION.
039400 REL-INIT-003.
039500     OPEN     INPUT  RL-FD1.
039600     MOVE     "REL-TEST-003"   TO PAR-NAME.
039700     MOVE     ZERO TO   RL-FD1-KEY.
039800     MOVE     ZERO TO   WRK-CS-09V00-002
039900     MOVE     ZERO  TO  WRK-CS-09V00-003
040000*
040100     MOVE     01 TO REC-CT.
040200     MOVE    "READ RANDOM"  TO FEATURE.
040300 REL-TEST-003-R.
040400     ADD      1 TO WRK-CS-09V00-003
040500     MOVE     WRK-CS-09V00-003 TO RL-FD1-KEY.
040600     IF       RL-FD1-KEY GREATER +501
040700              MOVE "INVALID KEY NOT TAKEN" TO COMPUTED-A
040800              MOVE RL-FD1-KEY TO CORRECT-18V0
040900              PERFORM FAIL
041000              PERFORM PRINT-DETAIL
041100              ADD 1 TO REC-CT
041200              GO TO REL-WRITE-003.
041300     READ     RL-FD1
041400             INVALID KEY GO TO REL-WRITE-003.
041500     MOVE     RL-FD1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
041600     IF       XRECORD-NUMBER (1) EQUAL TO RL-FD1-KEY
041700              GO TO REL-TEST-003-R.
041800     MOVE    "YES" TO I-O-ERROR-RL-FD1.
041900     ADD      1 TO WRK-CS-09V00-002
042000     GO TO    REL-TEST-003-R.
042100 REL-WRITE-003.
042200     IF      RL-FD1-KEY NOT EQUAL TO 501
042300              MOVE "WRONG KEY/NOT 500" TO CORRECT-A
042400              MOVE  RL-FD1-KEY TO COMPUTED-18V0
042500              PERFORM FAIL
042600              ELSE
042700              PERFORM PASS.
042800     PERFORM PRINT-DETAIL.
042900*
043000*01
043100*
043200     ADD      1 TO REC-CT.
043300     IF       XRECORD-NUMBER (1) NOT EQUAL TO 500
043400              MOVE "WRONG RECORD/NOT 500" TO CORRECT-A
043500              MOVE  XRECORD-NUMBER (1) TO COMPUTED-18V0
043600              PERFORM FAIL
043700              ELSE
043800              PERFORM PASS.
043900     PERFORM PRINT-DETAIL.
044000*
044100*02
044200*
044300     ADD      1 TO REC-CT.
044400     IF      WRK-CS-09V00-003 NOT EQUAL TO 501
044500              MOVE "INCORRECT RECORD COUNT" TO RE-MARK
044600              MOVE  WRK-CS-09V00-003 TO COMPUTED-18V0
044700             MOVE 501  TO CORRECT-18V0
044800              PERFORM FAIL
044900              ELSE
045000              PERFORM PASS.
045100     PERFORM PRINT-DETAIL.
045200*
045300*03
045400*
045500     ADD      1 TO REC-CT.
045600     IF       I-O-ERROR-RL-FD1 EQUAL TO "YES"
045700              MOVE WRK-CS-09V00-002 TO COMPUTED-18V0
045800              MOVE "RECORDS DID NOT COMPARE" TO RE-MARK
045900              PERFORM FAIL
046000              ELSE
046100              PERFORM PASS.
046200     PERFORM PRINT-DETAIL.
046300*
046400*04
046500*
046600     ADD      1 TO REC-CT.
046700     CLOSE    RL-FD1.
046800 REL-INIT-004-R .
046900     MOVE     "REL-TEST-004" TO PAR-NAME.
047000     OPEN I-O RL-FD1.
047100     MOVE     ZERO TO RL-FD1-KEY.
047200     MOVE     ZERO TO WRK-CS-09V00-002.
047300     MOVE     ZERO TO WRK-CS-09V00-003.
047400      MOVE    ZERO TO WRK-CS-09V00-004.
047500      MOVE    ZERO TO WRK-CS-09V00-005.
047600*
047700     MOVE     01 TO REC-CT.
047800     MOVE     SPACE TO  FILE-RECORD-INFO-P1-120 (1).
047900     MOVE    "REWRITE"  TO FEATURE.
048000 REL-TEST-004-R.
048100     ADD      5 TO  WRK-CS-09V00-003.
048200     MOVE     WRK-CS-09V00-003 TO RL-FD1-KEY.
048300      IF     RL-FD1-KEY GREATER 505
048400              MOVE "INVALID KEY/NOT TAKEN" TO COMPUTED-A
048500              MOVE  RL-FD1-KEY TO CORRECT-18V0
048600              PERFORM FAIL
048700              PERFORM PRINT-DETAIL
048800              ADD 1 TO REC-CT
048900              GO TO REL-TEST-004-3.
049000     READ     RL-FD1
049100              INVALID KEY GO TO REL-TEST-004-1.
049200     MOVE    RL-FD1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1)
049300     ADD      01 TO UPDATE-NUMBER (1).
049400     MOVE CCVS-PGM-ID       TO XPROGRAM-NAME (1).
049500     MOVE     FILE-RECORD-INFO-P1-120 (1) TO RL-FD1R1-F-G-120.
049600     REWRITE    RL-FD1R1-F-G-120
049700              INVALID KEY GO TO REL-TEST-004-2.
049800     GO TO    REL-TEST-004-R.
049900 REL-TEST-004-1.
050000     IF       RL-FD1-KEY LESS THAN 501
050100              ADD 1 TO  WRK-CS-09V00-004
050200              GO TO REL-TEST-004-R.
050300     PERFORM   PASS.
050400     PERFORM   PRINT-DETAIL.
050500*
050600*01
050700*
050800     ADD     1  TO REC-CT.
050900     GO TO    REL-TEST-004-3.
051000 REL-TEST-004-2.
051100     ADD      1 TO WRK-CS-09V00-005.
051200     IF       RL-FD1-KEY LESS 501
051300              GO TO REL-TEST-004-R.
051400 REL-TEST-004-3.
051500     IF       WRK-CS-09V00-004 NOT EQUAL TO ZERO
051600              MOVE "INVALID KEY ON READ" TO COMPUTED-A
051700              MOVE WRK-CS-09V00-004 TO CORRECT-18V0
051800              PERFORM FAIL
051900              ELSE
052000              PERFORM PASS.
052100     PERFORM PRINT-DETAIL.
052200*
052300*02
052400*
052500     ADD      1 TO REC-CT.
052600     IF       WRK-CS-09V00-005 NOT EQUAL TO ZERO
052700              MOVE "INVALID KEY ON REWRITE" TO COMPUTED-A
052800              MOVE  WRK-CS-09V00-005 TO CORRECT-18V0
052900              PERFORM FAIL
053000              ELSE
053100              PERFORM PASS.
053200     PERFORM PRINT-DETAIL.
053300*
053400*03
053500*
053600     ADD      1 TO REC-CT.
053700     CLOSE    RL-FD1.
053800 REL-INIT-005.
053900     MOVE     "REL-TEST-005" TO PAR-NAME.
054000     OPEN     INPUT  RL-FD1.
054100     MOVE     501  TO WRK-CS-09V00-003.
054200     MOVE    ZERO TO WRK-CS-09V00-004.
054300     MOVE    ZERO TO WRK-CS-09V00-005.
054400     MOVE    ZERO TO WRK-CS-09V00-002.
054500     MOVE     SPACE TO  FILE-RECORD-INFO-P1-120 (1).
054600     MOVE     01 TO REC-CT.
054700*
054800     MOVE    "READ RANDOM"  TO FEATURE.
054900 REL-TEST-005-R.
055000     SUBTRACT 1 FROM    WRK-CS-09V00-003.
055100     MOVE     WRK-CS-09V00-003 TO RL-FD1-KEY.
055200     IF      WRK-CS-09V00-003 LESS THAN ZERO
055300             MOVE    "INVALID KEY/NOT TAKEN"  TO RE-MARK
055400             MOVE   WRK-CS-09V00-003  TO COMPUTED-18V0
055500             MOVE   ZERO TO CORRECT-18V0
055600              PERFORM FAIL
055700              PERFORM PRINT-DETAIL
055800              ADD 1 TO REC-CT
055900              GO TO REL-TEST-005-3.
056000     READ     RL-FD1
056100              INVALID KEY  GO TO REL-TEST-005-1.
056200     MOVE     RL-FD1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
056300     IF     UPDATE-NUMBER (1) EQUAL TO 00
056400              ADD 1 TO WRK-CS-09V00-004.
056500     IF     UPDATE-NUMBER (1) EQUAL TO 01
056600              ADD 1 TO WRK-CS-09V00-005.
056700     GO TO    REL-TEST-005-R.
056800 REL-TEST-005-1.
056900     IF       RL-FD1-KEY GREATER ZERO
057000             ADD 1 TO WRK-CS-09V00-002
057100              GO TO REL-TEST-005-R.
057200     PERFORM   PASS.
057300     PERFORM   PRINT-DETAIL.
057400     ADD      1  TO REC-CT.
057500*01
057600     GO TO    REL-TEST-005-3.
057700 REL-TEST-005-3.
057800     IF       WRK-CS-09V00-004 NOT EQUAL TO 400
057900              MOVE "NON-UPDATED RECORDS" TO COMPUTED-A
058000              MOVE WRK-CS-09V00-004 TO CORRECT-18V0
058100              MOVE "SHOULD BE 400" TO RE-MARK
058200              PERFORM FAIL
058300              ELSE
058400              PERFORM PASS.
058500     PERFORM PRINT-DETAIL.
058600*
058700*
058800*02
058900*
059000     ADD      1 TO REC-CT.
059100     IF       WRK-CS-09V00-005 NOT EQUAL TO 100
059200              MOVE "UPDATED RECORDS" TO COMPUTED-A
059300              MOVE WRK-CS-09V00-005 TO CORRECT-18V0
059400              MOVE "SHOULD BE 100" TO RE-MARK
059500              PERFORM FAIL
059600              ELSE
059700              PERFORM PASS.
059800     PERFORM PRINT-DETAIL.
059900*
060000*03
060100*
060200     ADD      1 TO REC-CT.
060300     IF      WRK-CS-09V00-002 GREATER 1
060400             MOVE WRK-CS-09V00-002 TO COMPUTED-N
060500             MOVE  "INVALID KEY/READS" TO CORRECT-A
060600             PERFORM FAIL
060700              ELSE
060800              PERFORM PASS.
060900     PERFORM PRINT-DETAIL.
061000*
061100*04
061200*
061300     ADD      1 TO REC-CT.
061400     CLOSE    RL-FD1.
061500 CCVS-EXIT SECTION.
061600 CCVS-999999.
061700     GO TO CLOSE-FILES.
