000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL208A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*GENERAL:    THIS PROGRAM IS THE THIRD OF A SERIES.  THE FUNCTION
001400*            OF THIS PROGRAM IS TO PROCESS THE FILE SEQUENTIALLY
001500*            (ACCESS MODE IS DYNAMIC).    THE FILE USED IS THAT
001600*            RESULTING FROM RL206A
001700*
001800*            FIRST, THE FILE IS VERIFIED FOR ACCURACY OF ITS 500
001900*            RECORDS.  SECONDLY, RECORDS OF THE FILE ARE
002000*            SELECTIVELY DELETED AND THIRDLY THE ACCURACY OF EACH
002100*            RECORD IN THE FILE IS AGAIN VERIFIED.
002200*
002300*            X-CARD PARAMETERS WHICH MUST BE SUPPLIED FOR THIS
002400*            PROGRAM ARE:
002500*
002600*                 X-21   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR
002700*                         RELATIVE  I-O DATA FILE
002800*                 X-55   SYSTEM PRINTER
002900*                 X-69   ADDITIONAL VALUE OF CLAUSES
003000*                 X-74   VALUE OF IMPLEMENTOR-NAME
003100*                 X-75   OBJECT OF VALUE OF CLAUSE
003200*                 X-82   SOURCE-COMPUTER
003300*                 X-83   OBJECT-COMPUTER.
003400*
003500****************************************************************
003600 ENVIRONMENT DIVISION.
003700 CONFIGURATION SECTION.
003800 SOURCE-COMPUTER.
003900     XXXXX082.
004000 OBJECT-COMPUTER.
004100     XXXXX083.
004200 INPUT-OUTPUT SECTION.
004300 FILE-CONTROL.
004400     SELECT PRINT-FILE ASSIGN TO
004500     XXXXX055.
004600     SELECT   RL-FD1 ASSIGN TO
004700     XXXXD021
004800       ACCESS MODE IS DYNAMIC
004900             RELATIVE KEY IS RL-FD1-KEY
005000       ORGANIZATION IS RELATIVE.
005100 DATA DIVISION.
005200 FILE SECTION.
005300 FD  PRINT-FILE.
005400 01  PRINT-REC PICTURE X(132).
005500 01  DUMMY-RECORD PICTURE X(132).
005600 FD  RL-FD1
005700     LABEL RECORDS STANDARD
005800C    VALUE OF
005900C    XXXXX074
006000C    IS
006100C    XXXXX075
006200G    XXXXX069
006300     BLOCK CONTAINS 01 RECORDS
006400     RECORD IS VARYING IN SIZE
006500         FROM 120 TO 140 CHARACTERS.
006600 01  RL-FD1R1-F-G-140.
006700     02 RL-WRK-120 PIC X(120).
006800     02 FILLER     PIC X(20).
006900 WORKING-STORAGE SECTION.
007000 01  RL-FD1-KEY        PIC 9(08)  USAGE COMP VALUE ZERO.
007100 01  WRK-CS-09V00-006 PIC S9(09) USAGE COMP VALUE ZERO.
007200 01  WRK-CS-09V00-007 PIC S9(09) USAGE COMP VALUE ZERO.
007300 01  WRK-CS-09V00-008 PIC S9(09) USAGE COMP VALUE ZERO.
007400 01  WRK-CS-09V00-009 PIC S9(09) USAGE COMP VALUE ZERO.
007500 01  WRK-CS-09V00-010 PIC S9(09) USAGE COMP VALUE ZERO.
007600 01  WRK-CS-09V00-011 PIC S9(09) USAGE COMP VALUE ZERO.
007700 01  I-O-ERROR-RL-FD1 PIC X(3) VALUE "NO ".
007800 01  FILE-RECORD-INFORMATION-REC.
007900     03 FILE-RECORD-INFO-SKELETON.
008000        05 FILLER                 PICTURE X(48)       VALUE
008100             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
008200        05 FILLER                 PICTURE X(46)       VALUE
008300             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
008400        05 FILLER                 PICTURE X(26)       VALUE
008500             ",LFIL=000000,ORG=  ,LBLR= ".
008600        05 FILLER                 PICTURE X(37)       VALUE
008700             ",RECKEY=                             ".
008800        05 FILLER                 PICTURE X(38)       VALUE
008900             ",ALTKEY1=                             ".
009000        05 FILLER                 PICTURE X(38)       VALUE
009100             ",ALTKEY2=                             ".
009200        05 FILLER                 PICTURE X(7)        VALUE SPACE.
009300     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
009400        05 FILE-RECORD-INFO-P1-120.
009500           07 FILLER              PIC X(5).
009600           07 XFILE-NAME           PIC X(6).
009700           07 FILLER              PIC X(8).
009800           07 XRECORD-NAME         PIC X(6).
009900           07 FILLER              PIC X(1).
010000           07 REELUNIT-NUMBER     PIC 9(1).
010100           07 FILLER              PIC X(7).
010200           07 XRECORD-NUMBER       PIC 9(6).
010300           07 FILLER              PIC X(6).
010400           07 UPDATE-NUMBER       PIC 9(2).
010500           07 FILLER              PIC X(5).
010600           07 ODO-NUMBER          PIC 9(4).
010700           07 FILLER              PIC X(5).
010800           07 XPROGRAM-NAME        PIC X(5).
010900           07 FILLER              PIC X(7).
011000           07 XRECORD-LENGTH       PIC 9(6).
011100           07 FILLER              PIC X(7).
011200           07 CHARS-OR-RECORDS    PIC X(2).
011300           07 FILLER              PIC X(1).
011400           07 XBLOCK-SIZE          PIC 9(4).
011500           07 FILLER              PIC X(6).
011600           07 RECORDS-IN-FILE     PIC 9(6).
011700           07 FILLER              PIC X(5).
011800           07 XFILE-ORGANIZATION   PIC X(2).
011900           07 FILLER              PIC X(6).
012000           07 XLABEL-TYPE          PIC X(1).
012100        05 FILE-RECORD-INFO-P121-240.
012200           07 FILLER              PIC X(8).
012300           07 XRECORD-KEY          PIC X(29).
012400           07 FILLER              PIC X(9).
012500           07 ALTERNATE-KEY1      PIC X(29).
012600           07 FILLER              PIC X(9).
012700           07 ALTERNATE-KEY2      PIC X(29).
012800           07 FILLER              PIC X(7).
012900 01  TEST-RESULTS.
013000     02 FILLER                   PIC X      VALUE SPACE.
013100     02 FEATURE                  PIC X(20)  VALUE SPACE.
013200     02 FILLER                   PIC X      VALUE SPACE.
013300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
013400     02 FILLER                   PIC X      VALUE SPACE.
013500     02  PAR-NAME.
013600       03 FILLER                 PIC X(19)  VALUE SPACE.
013700       03  PARDOT-X              PIC X      VALUE SPACE.
013800       03 DOTVALUE               PIC 99     VALUE ZERO.
013900     02 FILLER                   PIC X(8)   VALUE SPACE.
014000     02 RE-MARK                  PIC X(61).
014100 01  TEST-COMPUTED.
014200     02 FILLER                   PIC X(30)  VALUE SPACE.
014300     02 FILLER                   PIC X(17)  VALUE
014400            "       COMPUTED=".
014500     02 COMPUTED-X.
014600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
014700     03 COMPUTED-N               REDEFINES COMPUTED-A
014800                                 PIC -9(9).9(9).
014900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
015000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
015100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015200     03       CM-18V0 REDEFINES COMPUTED-A.
015300         04 COMPUTED-18V0                    PIC -9(18).
015400         04 FILLER                           PIC X.
015500     03 FILLER PIC X(50) VALUE SPACE.
015600 01  TEST-CORRECT.
015700     02 FILLER PIC X(30) VALUE SPACE.
015800     02 FILLER PIC X(17) VALUE "       CORRECT =".
015900     02 CORRECT-X.
016000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
016100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
016300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
016400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
016500     03      CR-18V0 REDEFINES CORRECT-A.
016600         04 CORRECT-18V0                     PIC -9(18).
016700         04 FILLER                           PIC X.
016800     03 FILLER PIC X(2) VALUE SPACE.
016900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
017000 01  CCVS-C-1.
017100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017200-    "SS  PARAGRAPH-NAME
017300-    "       REMARKS".
017400     02 FILLER                     PIC X(20)    VALUE SPACE.
017500 01  CCVS-C-2.
017600     02 FILLER                     PIC X        VALUE SPACE.
017700     02 FILLER                     PIC X(6)     VALUE "TESTED".
017800     02 FILLER                     PIC X(15)    VALUE SPACE.
017900     02 FILLER                     PIC X(4)     VALUE "FAIL".
018000     02 FILLER                     PIC X(94)    VALUE SPACE.
018100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018200 01  REC-CT                        PIC 99       VALUE ZERO.
018300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
018400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
018500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
018600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
018700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
018800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
018900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
019000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
019100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019200 01  CCVS-H-1.
019300     02  FILLER                    PIC X(39)    VALUE SPACES.
019400     02  FILLER                    PIC X(42)    VALUE
019500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
019600     02  FILLER                    PIC X(39)    VALUE SPACES.
019700 01  CCVS-H-2A.
019800   02  FILLER                        PIC X(40)  VALUE SPACE.
019900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
020000   02  FILLER                        PIC XXXX   VALUE
020100     "4.2 ".
020200   02  FILLER                        PIC X(28)  VALUE
020300            " COPY - NOT FOR DISTRIBUTION".
020400   02  FILLER                        PIC X(41)  VALUE SPACE.
020500
020600 01  CCVS-H-2B.
020700   02  FILLER                        PIC X(15)  VALUE
020800            "TEST RESULT OF ".
020900   02  TEST-ID                       PIC X(9).
021000   02  FILLER                        PIC X(4)   VALUE
021100            " IN ".
021200   02  FILLER                        PIC X(12)  VALUE
021300     " HIGH       ".
021400   02  FILLER                        PIC X(22)  VALUE
021500            " LEVEL VALIDATION FOR ".
021600   02  FILLER                        PIC X(58)  VALUE
021700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021800 01  CCVS-H-3.
021900     02  FILLER                      PIC X(34)  VALUE
022000            " FOR OFFICIAL USE ONLY    ".
022100     02  FILLER                      PIC X(58)  VALUE
022200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022300     02  FILLER                      PIC X(28)  VALUE
022400            "  COPYRIGHT   1985 ".
022500 01  CCVS-E-1.
022600     02 FILLER                       PIC X(52)  VALUE SPACE.
022700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
022800     02 ID-AGAIN                     PIC X(9).
022900     02 FILLER                       PIC X(45)  VALUE SPACES.
023000 01  CCVS-E-2.
023100     02  FILLER                      PIC X(31)  VALUE SPACE.
023200     02  FILLER                      PIC X(21)  VALUE SPACE.
023300     02 CCVS-E-2-2.
023400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
023500         03 FILLER                   PIC X      VALUE SPACE.
023600         03 ENDER-DESC               PIC X(44)  VALUE
023700            "ERRORS ENCOUNTERED".
023800 01  CCVS-E-3.
023900     02  FILLER                      PIC X(22)  VALUE
024000            " FOR OFFICIAL USE ONLY".
024100     02  FILLER                      PIC X(12)  VALUE SPACE.
024200     02  FILLER                      PIC X(58)  VALUE
024300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024400     02  FILLER                      PIC X(13)  VALUE SPACE.
024500     02 FILLER                       PIC X(15)  VALUE
024600             " COPYRIGHT 1985".
024700 01  CCVS-E-4.
024800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
024900     02 FILLER                       PIC X(4)   VALUE " OF ".
025000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
025100     02 FILLER                       PIC X(40)  VALUE
025200      "  TESTS WERE EXECUTED SUCCESSFULLY".
025300 01  XXINFO.
025400     02 FILLER                       PIC X(19)  VALUE
025500            "*** INFORMATION ***".
025600     02 INFO-TEXT.
025700       04 FILLER                     PIC X(8)   VALUE SPACE.
025800       04 XXCOMPUTED                 PIC X(20).
025900       04 FILLER                     PIC X(5)   VALUE SPACE.
026000       04 XXCORRECT                  PIC X(20).
026100     02 INF-ANSI-REFERENCE           PIC X(48).
026200 01  HYPHEN-LINE.
026300     02 FILLER  PIC IS X VALUE IS SPACE.
026400     02 FILLER  PIC IS X(65)    VALUE IS "************************
026500-    "*****************************************".
026600     02 FILLER  PIC IS X(54)    VALUE IS "************************
026700-    "******************************".
026800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
026900     "RL208A".
027000 PROCEDURE DIVISION.
027100 CCVS1 SECTION.
027200 OPEN-FILES.
027300     OPEN    OUTPUT PRINT-FILE.
027400     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027500     MOVE    SPACE TO TEST-RESULTS.
027600     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
027700     MOVE    ZERO TO REC-SKL-SUB.
027800     PERFORM CCVS-INIT-FILE 9 TIMES.
027900 CCVS-INIT-FILE.
028000     ADD     1 TO REC-SKL-SUB.
028100     MOVE    FILE-RECORD-INFO-SKELETON
028200          TO FILE-RECORD-INFO (REC-SKL-SUB).
028300 CCVS-INIT-EXIT.
028400     GO TO CCVS1-EXIT.
028500 CLOSE-FILES.
028600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028700 TERMINATE-CCVS.
028800S    EXIT PROGRAM.
028900STERMINATE-CALL.
029000     STOP     RUN.
029100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029500     MOVE "****TEST DELETED****" TO RE-MARK.
029600 PRINT-DETAIL.
029700     IF REC-CT NOT EQUAL TO ZERO
029800             MOVE "." TO PARDOT-X
029900             MOVE REC-CT TO DOTVALUE.
030000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030500     MOVE SPACE TO CORRECT-X.
030600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030700     MOVE     SPACE TO RE-MARK.
030800 HEAD-ROUTINE.
030900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031300 COLUMN-NAMES-ROUTINE.
031400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031700 END-ROUTINE.
031800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031900 END-RTN-EXIT.
032000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032100 END-ROUTINE-1.
032200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032400      ADD PASS-COUNTER TO ERROR-HOLD.
032500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032600      MOVE PASS-COUNTER TO CCVS-E-4-1.
032700      MOVE ERROR-HOLD TO CCVS-E-4-2.
032800      MOVE CCVS-E-4 TO CCVS-E-2-2.
032900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033000  END-ROUTINE-12.
033100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033200     IF       ERROR-COUNTER IS EQUAL TO ZERO
033300         MOVE "NO " TO ERROR-TOTAL
033400         ELSE
033500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033700     PERFORM WRITE-LINE.
033800 END-ROUTINE-13.
033900     IF DELETE-COUNTER IS EQUAL TO ZERO
034000         MOVE "NO " TO ERROR-TOTAL  ELSE
034100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034400      IF   INSPECT-COUNTER EQUAL TO ZERO
034500          MOVE "NO " TO ERROR-TOTAL
034600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035000 WRITE-LINE.
035100     ADD 1 TO RECORD-COUNT.
035200Y    IF RECORD-COUNT GREATER 50
035300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035400Y        MOVE SPACE TO DUMMY-RECORD
035500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035600Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
035700Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
035800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
035900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036000Y        MOVE ZERO TO RECORD-COUNT.
036100     PERFORM WRT-LN.
036200 WRT-LN.
036300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036400     MOVE SPACE TO DUMMY-RECORD.
036500 BLANK-LINE-PRINT.
036600     PERFORM WRT-LN.
036700 FAIL-ROUTINE.
036800     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036900     IF   CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037300     MOVE   SPACES TO INF-ANSI-REFERENCE.
037400     GO TO  FAIL-ROUTINE-EX.
037500 FAIL-ROUTINE-WRITE.
037600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
037800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
037900     MOVE   SPACES TO COR-ANSI-REFERENCE.
038000 FAIL-ROUTINE-EX. EXIT.
038100 BAIL-OUT.
038200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038400 BAIL-OUT-WRITE.
038500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038800     MOVE   SPACES TO INF-ANSI-REFERENCE.
038900 BAIL-OUT-EX. EXIT.
039000 CCVS1-EXIT.
039100     EXIT.
039200 SECT-RL208A-001 SECTION.
039300 REL-INIT-012.
039400     MOVE  99 TO RL-FD1-KEY.
039500*    CONTAIN THE NUMBER OF THE RECORD PREVIOUSLY READ.
039600     OPEN INPUT RL-FD1.
039700     MOVE     "REL-TEST-012" TO   PAR-NAME.
039800     MOVE     ZERO TO             WRK-CS-09V00-006.
039900     MOVE     ZERO TO             WRK-CS-09V00-007.
040000     MOVE     ZERO TO             WRK-CS-09V00-008.
040100     MOVE     ZERO TO             WRK-CS-09V00-009.
040200     MOVE     ZERO TO             WRK-CS-09V00-010.
040300     MOVE     ZERO TO             WRK-CS-09V00-011.
040400     MOVE     SPACE TO  FILE-RECORD-INFO-P1-120 (1).
040500     MOVE    RL-FD1-KEY TO WRK-CS-09V00-011.
040600     MOVE     01 TO REC-CT.
040700     MOVE    "READ SEQUENTIAL"  TO FEATURE.
040800 REL-TEST-012-R.
040900     ADD      1 TO WRK-CS-09V00-006.
041000     READ     RL-FD1  NEXT RECORD
041100              AT END GO TO REL-TEST-012-3.
041200     MOVE     RL-WRK-120 TO FILE-RECORD-INFO-P1-120 (1).
041300     IF       UPDATE-NUMBER (1) EQUAL TO 00
041400             ADD 1 TO WRK-CS-09V00-007
041500              GO TO REL-TEST-012-2.
041600     IF       UPDATE-NUMBER (1) EQUAL TO 01 OR 98
041700              ADD 1 TO WRK-CS-09V00-008
041800              GO TO REL-TEST-012-2.
041900     ADD      1 TO WRK-CS-09V00-009.
042000 REL-TEST-012-2.
042100     IF       RL-FD1-KEY NOT EQUAL TO XRECORD-NUMBER (1)
042200              ADD 1 TO  WRK-CS-09V00-010.
042300     IF       WRK-CS-09V00-006  GREATER 501
042400              GO TO REL-TEST-012-3.
042500     GO TO    REL-TEST-012-R.
042600 REL-TEST-012-3.
042700     IF       WRK-CS-09V00-006 NOT EQUAL TO 501
042800              MOVE "INCORRECT RECORD COUNT"  TO RE-MARK
042900              MOVE  WRK-CS-09V00-006 TO COMPUTED-18V0
043000              MOVE  501  TO             CORRECT-18V0
043100              PERFORM FAIL
043200              ELSE
043300              PERFORM PASS.
043400     PERFORM  PRINT-DETAIL.
043500*    .01
043600     ADD      1 TO REC-CT.
043700     IF       WRK-CS-09V00-007 EQUAL TO 395
043800              PERFORM PASS
043900              ELSE
044000              MOVE "NON-UPDATED RECORDS" TO COMPUTED-A
044100              MOVE  WRK-CS-09V00-007 TO CORRECT-18V0
044200              MOVE "SHOULD BE 395" TO RE-MARK
044300              PERFORM FAIL.
044400     PERFORM  PRINT-DETAIL.
044500     ADD      1 TO REC-CT.
044600*    .02
044700     IF      WRK-CS-09V00-008 EQUAL TO 105
044800              PERFORM PASS
044900              ELSE
045000             MOVE WRK-CS-09V00-008 TO COMPUTED-18V0
045100             MOVE 105             TO  CORRECT-18V0
045200             MOVE "UPDATED RECORDS" TO RE-MARK
045300              PERFORM FAIL.
045400     PERFORM  PRINT-DETAIL.
045500     ADD      1 TO REC-CT.
045600*    .03
045700     IF      WRK-CS-09V00-009 EQUAL TO ZERO
045800             PERFORM PASS
045900             ELSE
046000             MOVE WRK-CS-09V00-009 TO COMPUTED-18V0
046100             MOVE  ZERO            TO CORRECT-18V0
046200             MOVE "BAD-UPDATES" TO RE-MARK
046300             PERFORM FAIL.
046400     PERFORM PRINT-DETAIL.
046500     ADD     01 TO REC-CT.
046600*    .04
046700     IF      WRK-CS-09V00-010 EQUAL TO ZERO
046800             PERFORM PASS
046900             ELSE
047000             MOVE WRK-CS-09V00-010 TO COMPUTED-18V0
047100             MOVE ZERO             TO CORRECT-18V0
047200             MOVE "KEY VS RECORD" TO RE-MARK
047300             PERFORM FAIL.
047400     PERFORM PRINT-DETAIL.
047500     ADD     01 TO REC-CT.
047600*    .05
047700     MOVE    WRK-CS-09V00-011 TO RL-FD1-KEY.
047800     MOVE RL-FD1-KEY TO COMPUTED-18V0.
047900     MOVE    "INFORMATION" TO CORRECT-A.
048000     MOVE    "STATUS AFTER OPEN" TO RE-MARK.
048100     PERFORM PRINT-DETAIL.
048200     ADD     01 TO REC-CT.
048300*    .06
048400     CLOSE    RL-FD1.
048500 REL-INIT-013.
048600     MOVE     "REL-TEST-013" TO PAR-NAME
048700     OPEN     I-O RL-FD1.
048800     MOVE     ZERO TO WRK-CS-09V00-006
048900     MOVE     ZERO TO WRK-CS-09V00-007
049000     MOVE     ZERO TO WRK-CS-09V00-008
049100     MOVE     ZERO TO WRK-CS-09V00-009
049200     MOVE     ZERO TO WRK-CS-09V00-010
049300     MOVE     ZERO TO WRK-CS-09V00-011
049400     MOVE     01 TO REC-CT.
049500     MOVE     SPACE TO  FILE-RECORD-INFO-P1-120 (1).
049600     MOVE    "DELETE"  TO FEATURE.
049700 REL-TEST-013-R.
049800     ADD      1 TO WRK-CS-09V00-006
049900     ADD      1 TO WRK-CS-09V00-007.
050000     READ     RL-FD1  NEXT RECORD
050100              AT END
050200              MOVE "AT END PATH TAKEN " TO RE-MARK
050300             GO TO  REL-TEST-013-3.
050400     MOVE     RL-WRK-120 TO FILE-RECORD-INFO-P1-120 (1).
050500     IF      (WRK-CS-09V00-007  = 1 OR 11 OR 21 OR 31 OR 32)
050600              GO TO REL-TEST-013-2.
050700     IF       WRK-CS-09V00-006 GREATER 501
050800              MOVE  "AT END NOT TAKEN"  TO RE-MARK
050900              GO TO REL-TEST-013-3.
051000     GO TO    REL-TEST-013-R.
051100 REL-TEST-013-2.
051200     MOVE CCVS-PGM-ID       TO  XPROGRAM-NAME (1).
051300     MOVE  99 TO UPDATE-NUMBER (1).
051400     MOVE    FILE-RECORD-INFO-P1-120 (1) TO RL-FD1R1-F-G-140.
051500     DELETE  RL-FD1
051600             INVALID KEY GO TO REL-TEST-013-3.
051700     ADD      1 TO  WRK-CS-09V00-008
051800     GO TO    REL-TEST-013-R.
051900 REL-TEST-013-3.
052000     IF       WRK-CS-09V00-006 NOT EQUAL TO 501
052100              MOVE WRK-CS-09V00-006 TO COMPUTED-18V0
052200              MOVE              501 TO CORRECT-18V0
052300              PERFORM FAIL
052400              ELSE
052500              PERFORM PASS.
052600     PERFORM  PRINT-DETAIL.
052700     ADD      01 TO REC-CT.
052800*    .01
052900     IF       WRK-CS-09V00-008 NOT EQUAL TO 5
053000              MOVE WRK-CS-09V00-008 TO COMPUTED-18V0
053100              MOVE  5               TO CORRECT-18V0
053200              MOVE "DELETED RECORDS" TO RE-MARK
053300              PERFORM FAIL
053400              ELSE
053500              PERFORM PASS.
053600     PERFORM  PRINT-DETAIL.
053700     ADD      01 TO REC-CT.
053800*    .02
053900     CLOSE    RL-FD1.
054000 REL-INIT-014.
054100     MOVE     "REL-TEST-014" TO PAR-NAME.
054200     MOVE     ZERO TO   WRK-CS-09V00-006
054300     MOVE     ZERO TO   WRK-CS-09V00-007
054400     MOVE     ZERO TO   WRK-CS-09V00-008
054500     MOVE     ZERO TO   WRK-CS-09V00-009
054600     MOVE     ZERO TO   WRK-CS-09V00-010
054700     MOVE     ZERO TO   WRK-CS-09V00-011
054800     MOVE     01 TO REC-CT.
054900     MOVE     SPACE  TO  FILE-RECORD-INFO-P1-120 (1).
055000     MOVE     ZERO TO RL-FD1-KEY.
055100     OPEN     INPUT  RL-FD1.
055200     MOVE   "READ UPDATED FILE"  TO FEATURE.
055300 REL-TEST-014-R.
055400     ADD     1 TO WRK-CS-09V00-006.
055500     ADD     1 TO WRK-CS-09V00-007.
055600     ADD     1 TO WRK-CS-09V00-008.
055700     READ    RL-FD1 NEXT RECORD  AT END  GO TO REL-TEST-014-3.
055800     MOVE    RL-WRK-120 TO FILE-RECORD-INFO-P1-120 (1).
055900     IF      UPDATE-NUMBER (1) EQUAL TO 99
056000             ADD  1 TO WRK-CS-09V00-009.
056100     IF     (WRK-CS-09V00-008  = 1 OR 11 OR 21 OR 31)
056200             ADD 1 TO WRK-CS-09V00-008.
056300     IF      (WRK-CS-09V00-008 = 32)
056400             ADD 1 TO WRK-CS-09V00-008.
056500     IF      RL-FD1-KEY EQUAL TO  XRECORD-NUMBER (1)
056600             ADD 1 TO  WRK-CS-09V00-010.
056700     IF      XRECORD-NUMBER (1) EQUAL TO  WRK-CS-09V00-008
056800             ADD 1 TO  WRK-CS-09V00-011.
056900     IF      WRK-CS-09V00-006 GREATER  501
057000             GO TO REL-TEST-014-3.
057100     GO TO   REL-TEST-014-R.
057200 REL-TEST-014-3.
057300     IF       WRK-CS-09V00-006 NOT EQUAL TO 496
057400              MOVE "INCORRECT RECORD COUNT"  TO RE-MARK
057500              MOVE WRK-CS-09V00-006 TO COMPUTED-18V0
057600              MOVE 496 TO CORRECT-18V0
057700              PERFORM  FAIL
057800              ELSE
057900              PERFORM  PASS.
058000     PERFORM  PRINT-DETAIL.
058100     ADD      01 TO REC-CT.
058200*    .01
058300     IF       WRK-CS-09V00-009 NOT EQUAL TO ZERO
058400              MOVE WRK-CS-09V00-009 TO COMPUTED-18V0
058500             MOVE   ZERO TO CORRECT-18V0
058600              MOVE "DELETED RECORDS" TO RE-MARK
058700              PERFORM FAIL
058800              ELSE
058900              PERFORM PASS.
059000     PERFORM  PRINT-DETAIL.
059100     ADD      01  TO  REC-CT.
059200*    .02
059300     IF       WRK-CS-09V00-010 NOT EQUAL TO 495
059400              MOVE "KEY MISMATCH" TO RE-MARK
059500              MOVE 495 TO CORRECT-18V0
059600              MOVE WRK-CS-09V00-010 TO COMPUTED-18V0
059700              PERFORM FAIL
059800              ELSE
059900              PERFORM PASS.
060000     PERFORM  PRINT-DETAIL.
060100     ADD      01 TO REC-CT.
060200*    .03
060300     IF      WRK-CS-09V00-011  NOT EQUAL TO 495
060400             MOVE   495  TO CORRECT-18V0
060500             MOVE  "INCORRECT RECORD FOUND"  TO RE-MARK
060600             MOVE   WRK-CS-09V00-011 TO COMPUTED-18V0
060700             PERFORM   FAIL
060800             ELSE
060900             PERFORM  PASS.
061000     PERFORM   PRINT-DETAIL.
061100*04
061200     CLOSE    RL-FD1.
061300 CCVS-EXIT SECTION.
061400 CCVS-999999.
061500     GO TO CLOSE-FILES.
