000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL203A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*GENERAL:    THIS PROGRAM IS THE THIRD OF A SERIES.  THE FUNCTION
001400*            OF THIS PROGRAM IS TO PROCESS THE FILE SEQUENTIALLY
001500*            (ACCESS MODE IS DYNAMIC).    THE FILE USED IS THAT
001600*            RESULTING FROM RL102.
001700*
001800*            FIRST, THE FILE IS VERIFIED FOR ACCURACY OF ITS 500
001900*            RECORDS.  SECONDLY, RECORDS OF THER FILE ARE
002000*            SELECTIVELY DELETED AND THIRDLY THE ACCURACY OF EACH
002100*            RECORD IN THE FILE IS AGAIN VERIFIED.
002200*
002300*            X-CARD PARAMETERS WHICH MUST BE SUPPLIED FOR THIS
002400*            PROGRAM ARE:
002500*
002600*                 X-21   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR
002700*                         RELATIVE  I-O DATA FILE
002800*                 X-55   SYSTEM PRINTER
002900*                 X-69   ADDITIONAL VALUE OF CLAUSES
003000*                 X-74   VALUE OF IMPLEMENTOR-NAME
003100*                 X-75   OBJECT OF VALUE OF CLAUSE
003200*                 X-82   SOURCE-COMPUTER
003300*                 X-83   OBJECT-COMPUTER.
003400*
003500***************************************************
003600 ENVIRONMENT DIVISION.
003700 CONFIGURATION SECTION.
003800 SOURCE-COMPUTER.
003900     XXXXX082.
004000 OBJECT-COMPUTER.
004100     XXXXX083.
004200 INPUT-OUTPUT SECTION.
004300 FILE-CONTROL.
004400     SELECT PRINT-FILE ASSIGN TO
004500     XXXXX055.
004600     SELECT   RL-FD1 ASSIGN TO
004700     XXXXD021
004800       ACCESS MODE IS DYNAMIC
004900             RELATIVE KEY IS RL-FD1-KEY
005000       ORGANIZATION IS RELATIVE.
005100 DATA DIVISION.
005200 FILE SECTION.
005300 FD  PRINT-FILE.
005400 01  PRINT-REC PICTURE X(120).
005500 01  DUMMY-RECORD PICTURE X(120).
005600 FD  RL-FD1
005700     LABEL RECORDS STANDARD
005800C    VALUE OF
005900C    XXXXX074
006000C    IS
006100C    XXXXX075
006200G    XXXXX069
006300     BLOCK CONTAINS 01 RECORDS
006400     RECORD CONTAINS 120.
006500 01  RL-FD1R1-F-G-120.
006600     02 RL-WRK-120 PIC X(120).
006700 WORKING-STORAGE SECTION.
006800 01  RL-FD1-KEY        PIC 9(08)  USAGE COMP VALUE ZERO.
006900 01  WRK-CS-09V00-006 PIC S9(09) USAGE COMP VALUE ZERO.
007000 01  WRK-CS-09V00-007 PIC S9(09) USAGE COMP VALUE ZERO.
007100 01  WRK-CS-09V00-008 PIC S9(09) USAGE COMP VALUE ZERO.
007200 01  WRK-CS-09V00-009 PIC S9(09) USAGE COMP VALUE ZERO.
007300 01  WRK-CS-09V00-010 PIC S9(09) USAGE COMP VALUE ZERO.
007400 01  WRK-CS-09V00-011 PIC S9(09) USAGE COMP VALUE ZERO.
007500 01  I-O-ERROR-RL-FD1 PIC X(3) VALUE "NO ".
007600 01  FILE-RECORD-INFORMATION-REC.
007700     03 FILE-RECORD-INFO-SKELETON.
007800        05 FILLER                 PICTURE X(48)       VALUE
007900             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
008000        05 FILLER                 PICTURE X(46)       VALUE
008100             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
008200        05 FILLER                 PICTURE X(26)       VALUE
008300             ",LFIL=000000,ORG=  ,LBLR= ".
008400        05 FILLER                 PICTURE X(37)       VALUE
008500             ",RECKEY=                             ".
008600        05 FILLER                 PICTURE X(38)       VALUE
008700             ",ALTKEY1=                             ".
008800        05 FILLER                 PICTURE X(38)       VALUE
008900             ",ALTKEY2=                             ".
009000        05 FILLER                 PICTURE X(7)        VALUE SPACE.
009100     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
009200        05 FILE-RECORD-INFO-P1-120.
009300           07 FILLER              PIC X(5).
009400           07 XFILE-NAME           PIC X(6).
009500           07 FILLER              PIC X(8).
009600           07 XRECORD-NAME         PIC X(6).
009700           07 FILLER              PIC X(1).
009800           07 REELUNIT-NUMBER     PIC 9(1).
009900           07 FILLER              PIC X(7).
010000           07 XRECORD-NUMBER       PIC 9(6).
010100           07 FILLER              PIC X(6).
010200           07 UPDATE-NUMBER       PIC 9(2).
010300           07 FILLER              PIC X(5).
010400           07 ODO-NUMBER          PIC 9(4).
010500           07 FILLER              PIC X(5).
010600           07 XPROGRAM-NAME        PIC X(5).
010700           07 FILLER              PIC X(7).
010800           07 XRECORD-LENGTH       PIC 9(6).
010900           07 FILLER              PIC X(7).
011000           07 CHARS-OR-RECORDS    PIC X(2).
011100           07 FILLER              PIC X(1).
011200           07 XBLOCK-SIZE          PIC 9(4).
011300           07 FILLER              PIC X(6).
011400           07 RECORDS-IN-FILE     PIC 9(6).
011500           07 FILLER              PIC X(5).
011600           07 XFILE-ORGANIZATION   PIC X(2).
011700           07 FILLER              PIC X(6).
011800           07 XLABEL-TYPE          PIC X(1).
011900        05 FILE-RECORD-INFO-P121-240.
012000           07 FILLER              PIC X(8).
012100           07 XRECORD-KEY          PIC X(29).
012200           07 FILLER              PIC X(9).
012300           07 ALTERNATE-KEY1      PIC X(29).
012400           07 FILLER              PIC X(9).
012500           07 ALTERNATE-KEY2      PIC X(29).
012600           07 FILLER              PIC X(7).
012700 01  TEST-RESULTS.
012800     02 FILLER                   PIC X      VALUE SPACE.
012900     02 FEATURE                  PIC X(20)  VALUE SPACE.
013000     02 FILLER                   PIC X      VALUE SPACE.
013100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
013200     02 FILLER                   PIC X      VALUE SPACE.
013300     02  PAR-NAME.
013400       03 FILLER                 PIC X(19)  VALUE SPACE.
013500       03  PARDOT-X              PIC X      VALUE SPACE.
013600       03 DOTVALUE               PIC 99     VALUE ZERO.
013700     02 FILLER                   PIC X(8)   VALUE SPACE.
013800     02 RE-MARK                  PIC X(61).
013900 01  TEST-COMPUTED.
014000     02 FILLER                   PIC X(30)  VALUE SPACE.
014100     02 FILLER                   PIC X(17)  VALUE
014200            "       COMPUTED=".
014300     02 COMPUTED-X.
014400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
014500     03 COMPUTED-N               REDEFINES COMPUTED-A
014600                                 PIC -9(9).9(9).
014700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
014800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
014900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015000     03       CM-18V0 REDEFINES COMPUTED-A.
015100         04 COMPUTED-18V0                    PIC -9(18).
015200         04 FILLER                           PIC X.
015300     03 FILLER PIC X(50) VALUE SPACE.
015400 01  TEST-CORRECT.
015500     02 FILLER PIC X(30) VALUE SPACE.
015600     02 FILLER PIC X(17) VALUE "       CORRECT =".
015700     02 CORRECT-X.
015800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
015900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
016100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
016200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
016300     03      CR-18V0 REDEFINES CORRECT-A.
016400         04 CORRECT-18V0                     PIC -9(18).
016500         04 FILLER                           PIC X.
016600     03 FILLER PIC X(2) VALUE SPACE.
016700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
016800 01  CCVS-C-1.
016900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017000-    "SS  PARAGRAPH-NAME
017100-    "       REMARKS".
017200     02 FILLER                     PIC X(20)    VALUE SPACE.
017300 01  CCVS-C-2.
017400     02 FILLER                     PIC X        VALUE SPACE.
017500     02 FILLER                     PIC X(6)     VALUE "TESTED".
017600     02 FILLER                     PIC X(15)    VALUE SPACE.
017700     02 FILLER                     PIC X(4)     VALUE "FAIL".
017800     02 FILLER                     PIC X(94)    VALUE SPACE.
017900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018000 01  REC-CT                        PIC 99       VALUE ZERO.
018100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
018200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
018300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
018400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
018500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
018600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
018700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
018800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
018900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019000 01  CCVS-H-1.
019100     02  FILLER                    PIC X(39)    VALUE SPACES.
019200     02  FILLER                    PIC X(42)    VALUE
019300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
019400     02  FILLER                    PIC X(39)    VALUE SPACES.
019500 01  CCVS-H-2A.
019600   02  FILLER                        PIC X(40)  VALUE SPACE.
019700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
019800   02  FILLER                        PIC XXXX   VALUE
019900     "4.2 ".
020000   02  FILLER                        PIC X(28)  VALUE
020100            " COPY - NOT FOR DISTRIBUTION".
020200   02  FILLER                        PIC X(41)  VALUE SPACE.
020300
020400 01  CCVS-H-2B.
020500   02  FILLER                        PIC X(15)  VALUE
020600            "TEST RESULT OF ".
020700   02  TEST-ID                       PIC X(9).
020800   02  FILLER                        PIC X(4)   VALUE
020900            " IN ".
021000   02  FILLER                        PIC X(12)  VALUE
021100     " HIGH       ".
021200   02  FILLER                        PIC X(22)  VALUE
021300            " LEVEL VALIDATION FOR ".
021400   02  FILLER                        PIC X(58)  VALUE
021500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021600 01  CCVS-H-3.
021700     02  FILLER                      PIC X(34)  VALUE
021800            " FOR OFFICIAL USE ONLY    ".
021900     02  FILLER                      PIC X(58)  VALUE
022000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022100     02  FILLER                      PIC X(28)  VALUE
022200            "  COPYRIGHT   1985 ".
022300 01  CCVS-E-1.
022400     02 FILLER                       PIC X(52)  VALUE SPACE.
022500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
022600     02 ID-AGAIN                     PIC X(9).
022700     02 FILLER                       PIC X(45)  VALUE SPACES.
022800 01  CCVS-E-2.
022900     02  FILLER                      PIC X(31)  VALUE SPACE.
023000     02  FILLER                      PIC X(21)  VALUE SPACE.
023100     02 CCVS-E-2-2.
023200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
023300         03 FILLER                   PIC X      VALUE SPACE.
023400         03 ENDER-DESC               PIC X(44)  VALUE
023500            "ERRORS ENCOUNTERED".
023600 01  CCVS-E-3.
023700     02  FILLER                      PIC X(22)  VALUE
023800            " FOR OFFICIAL USE ONLY".
023900     02  FILLER                      PIC X(12)  VALUE SPACE.
024000     02  FILLER                      PIC X(58)  VALUE
024100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024200     02  FILLER                      PIC X(13)  VALUE SPACE.
024300     02 FILLER                       PIC X(15)  VALUE
024400             " COPYRIGHT 1985".
024500 01  CCVS-E-4.
024600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
024700     02 FILLER                       PIC X(4)   VALUE " OF ".
024800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
024900     02 FILLER                       PIC X(40)  VALUE
025000      "  TESTS WERE EXECUTED SUCCESSFULLY".
025100 01  XXINFO.
025200     02 FILLER                       PIC X(19)  VALUE
025300            "*** INFORMATION ***".
025400     02 INFO-TEXT.
025500       04 FILLER                     PIC X(8)   VALUE SPACE.
025600       04 XXCOMPUTED                 PIC X(20).
025700       04 FILLER                     PIC X(5)   VALUE SPACE.
025800       04 XXCORRECT                  PIC X(20).
025900     02 INF-ANSI-REFERENCE           PIC X(48).
026000 01  HYPHEN-LINE.
026100     02 FILLER  PIC IS X VALUE IS SPACE.
026200     02 FILLER  PIC IS X(65)    VALUE IS "************************
026300-    "*****************************************".
026400     02 FILLER  PIC IS X(54)    VALUE IS "************************
026500-    "******************************".
026600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
026700     "RL203A".
026800 PROCEDURE DIVISION.
026900 CCVS1 SECTION.
027000 OPEN-FILES.
027100     OPEN    OUTPUT PRINT-FILE.
027200     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027300     MOVE    SPACE TO TEST-RESULTS.
027400     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
027500     MOVE    ZERO TO REC-SKL-SUB.
027600     PERFORM CCVS-INIT-FILE 9 TIMES.
027700 CCVS-INIT-FILE.
027800     ADD     1 TO REC-SKL-SUB.
027900     MOVE    FILE-RECORD-INFO-SKELETON
028000          TO FILE-RECORD-INFO (REC-SKL-SUB).
028100 CCVS-INIT-EXIT.
028200     GO TO CCVS1-EXIT.
028300 CLOSE-FILES.
028400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028500 TERMINATE-CCVS.
028600S    EXIT PROGRAM.
028700STERMINATE-CALL.
028800     STOP     RUN.
028900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029300     MOVE "****TEST DELETED****" TO RE-MARK.
029400 PRINT-DETAIL.
029500     IF REC-CT NOT EQUAL TO ZERO
029600             MOVE "." TO PARDOT-X
029700             MOVE REC-CT TO DOTVALUE.
029800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
029900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030300     MOVE SPACE TO CORRECT-X.
030400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030500     MOVE     SPACE TO RE-MARK.
030600 HEAD-ROUTINE.
030700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031100 COLUMN-NAMES-ROUTINE.
031200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031500 END-ROUTINE.
031600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031700 END-RTN-EXIT.
031800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031900 END-ROUTINE-1.
032000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032200      ADD PASS-COUNTER TO ERROR-HOLD.
032300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032400      MOVE PASS-COUNTER TO CCVS-E-4-1.
032500      MOVE ERROR-HOLD TO CCVS-E-4-2.
032600      MOVE CCVS-E-4 TO CCVS-E-2-2.
032700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
032800  END-ROUTINE-12.
032900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033000     IF       ERROR-COUNTER IS EQUAL TO ZERO
033100         MOVE "NO " TO ERROR-TOTAL
033200         ELSE
033300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033500     PERFORM WRITE-LINE.
033600 END-ROUTINE-13.
033700     IF DELETE-COUNTER IS EQUAL TO ZERO
033800         MOVE "NO " TO ERROR-TOTAL  ELSE
033900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034200      IF   INSPECT-COUNTER EQUAL TO ZERO
034300          MOVE "NO " TO ERROR-TOTAL
034400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034800 WRITE-LINE.
034900     ADD 1 TO RECORD-COUNT.
035000Y    IF RECORD-COUNT GREATER 50
035100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035200Y        MOVE SPACE TO DUMMY-RECORD
035300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035400Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
035500Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
035600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
035700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
035800Y        MOVE ZERO TO RECORD-COUNT.
035900     PERFORM WRT-LN.
036000 WRT-LN.
036100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036200     MOVE SPACE TO DUMMY-RECORD.
036300 BLANK-LINE-PRINT.
036400     PERFORM WRT-LN.
036500 FAIL-ROUTINE.
036600     IF     COMPUTED-X NOT EQUAL TO SPACE
036700            GO TO   FAIL-ROUTINE-WRITE.
036800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037200     MOVE   SPACES TO INF-ANSI-REFERENCE.
037300     GO TO  FAIL-ROUTINE-EX.
037400 FAIL-ROUTINE-WRITE.
037500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
037700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
037800     MOVE   SPACES TO COR-ANSI-REFERENCE.
037900 FAIL-ROUTINE-EX. EXIT.
038000 BAIL-OUT.
038100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038300 BAIL-OUT-WRITE.
038400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038700     MOVE   SPACES TO INF-ANSI-REFERENCE.
038800 BAIL-OUT-EX. EXIT.
038900 CCVS1-EXIT.
039000     EXIT.
039100 SECT-RL-03-001 SECTION.
039200 REL-INIT-006.
039300     MOVE  99 TO RL-FD1-KEY.
039400*    CONTAIN THE NUMBER OF THE RECORD PREVIOUSLY READ.
039500     OPEN INPUT RL-FD1.
039600     MOVE     "REL-TEST-006" TO   PAR-NAME.
039700     MOVE     ZERO TO             WRK-CS-09V00-006.
039800     MOVE     ZERO TO             WRK-CS-09V00-007.
039900     MOVE     ZERO TO             WRK-CS-09V00-008.
040000     MOVE     ZERO TO             WRK-CS-09V00-009.
040100     MOVE     ZERO TO             WRK-CS-09V00-010.
040200     MOVE     ZERO TO             WRK-CS-09V00-011.
040300     MOVE     SPACE TO  FILE-RECORD-INFO-P1-120 (1).
040400     MOVE    RL-FD1-KEY TO WRK-CS-09V00-011.
040500     MOVE     01 TO REC-CT.
040600     MOVE    "READ SEQUENTIAL"  TO FEATURE.
040700 REL-TEST-006-R.
040800     ADD      1 TO WRK-CS-09V00-006.
040900     READ     RL-FD1  NEXT RECORD
041000              AT END GO TO REL-TEST-006-3.
041100     MOVE     RL-FD1R1-F-G-120    TO FILE-RECORD-INFO-P1-120 (1).
041200     IF       UPDATE-NUMBER (1) EQUAL TO 00
041300             ADD 1 TO WRK-CS-09V00-007
041400              GO TO REL-TEST-006-2.
041500     IF       UPDATE-NUMBER (1) EQUAL TO 01
041600              ADD 1 TO WRK-CS-09V00-008
041700              GO TO REL-TEST-006-2.
041800     ADD      1 TO WRK-CS-09V00-009.
041900 REL-TEST-006-2.
042000     IF       RL-FD1-KEY NOT EQUAL TO XRECORD-NUMBER (1)
042100              ADD 1 TO  WRK-CS-09V00-010.
042200     IF       WRK-CS-09V00-006  GREATER 501
042300              GO TO REL-TEST-006-3.
042400     GO TO    REL-TEST-006-R.
042500 REL-TEST-006-3.
042600     IF       WRK-CS-09V00-006 NOT EQUAL TO 501
042700              MOVE "INCORRECT RECORD COUNT"  TO RE-MARK
042800              MOVE  WRK-CS-09V00-006 TO COMPUTED-18V0
042900              MOVE  501  TO             CORRECT-18V0
043000              PERFORM FAIL
043100              ELSE
043200              PERFORM PASS.
043300     PERFORM  PRINT-DETAIL.
043400*    .01
043500     ADD      1 TO REC-CT.
043600     IF       WRK-CS-09V00-007 EQUAL TO 400
043700              PERFORM PASS
043800              ELSE
043900              MOVE "NON-UPDATED RECORDS" TO COMPUTED-A
044000              MOVE  WRK-CS-09V00-007 TO CORRECT-18V0
044100              MOVE "SHOULD BE 400" TO RE-MARK
044200              PERFORM FAIL.
044300     PERFORM  PRINT-DETAIL.
044400     ADD      1 TO REC-CT.
044500*    .02
044600     IF      WRK-CS-09V00-008 EQUAL TO 100
044700              PERFORM PASS
044800              ELSE
044900             MOVE WRK-CS-09V00-008 TO COMPUTED-18V0
045000             MOVE 100             TO  CORRECT-18V0
045100             MOVE "UPDATED RECORDS" TO RE-MARK
045200              PERFORM FAIL.
045300     PERFORM  PRINT-DETAIL.
045400     ADD      1 TO REC-CT.
045500*    .03
045600     IF      WRK-CS-09V00-009 EQUAL TO ZERO
045700             PERFORM PASS
045800             ELSE
045900             MOVE WRK-CS-09V00-009 TO COMPUTED-18V0
046000             MOVE  ZERO            TO CORRECT-18V0
046100             MOVE "BAD-UPDATES" TO RE-MARK
046200             PERFORM FAIL.
046300     PERFORM PRINT-DETAIL.
046400     ADD     01 TO REC-CT.
046500*    .04
046600     IF      WRK-CS-09V00-010 EQUAL TO ZERO
046700             PERFORM PASS
046800             ELSE
046900             MOVE WRK-CS-09V00-010 TO COMPUTED-18V0
047000             MOVE ZERO             TO CORRECT-18V0
047100             MOVE "KEY VS RECORD" TO RE-MARK
047200             PERFORM FAIL.
047300     PERFORM PRINT-DETAIL.
047400     ADD     01 TO REC-CT.
047500*    .05
047600     MOVE    WRK-CS-09V00-011 TO RL-FD1-KEY.
047700     MOVE RL-FD1-KEY TO COMPUTED-18V0.
047800     MOVE    "INFORMATION" TO CORRECT-A.
047900     MOVE    "STATUS AFTER OPEN" TO RE-MARK.
048000     PERFORM PRINT-DETAIL.
048100     ADD     01 TO REC-CT.
048200*    .06
048300     CLOSE    RL-FD1.
048400 REL-INIT-007.
048500     MOVE     "REL-TEST-007" TO PAR-NAME
048600     OPEN     I-O RL-FD1.
048700     MOVE     ZERO TO WRK-CS-09V00-006
048800     MOVE     ZERO TO WRK-CS-09V00-007
048900     MOVE     ZERO TO WRK-CS-09V00-008
049000     MOVE     ZERO TO WRK-CS-09V00-009
049100     MOVE     ZERO TO WRK-CS-09V00-010
049200     MOVE     ZERO TO WRK-CS-09V00-011
049300     MOVE     01 TO REC-CT.
049400     MOVE     SPACE TO  FILE-RECORD-INFO-P1-120 (1).
049500     MOVE    "DELETE"  TO FEATURE.
049600 REL-TEST-007-R.
049700     ADD      1 TO WRK-CS-09V00-006
049800     ADD      1 TO WRK-CS-09V00-007.
049900     READ     RL-FD1  NEXT RECORD
050000              AT END
050100              MOVE "AT END PATH TAKEN " TO RE-MARK
050200             GO TO  REL-TEST-007-3.
050300     MOVE     RL-FD1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
050400     IF       WRK-CS-09V00-007  EQUAL TO 4
050500              GO TO REL-TEST-007-2.
050600     IF       WRK-CS-09V00-006 GREATER 501
050700              MOVE  "AT END NOT TAKEN"  TO RE-MARK
050800              GO TO REL-TEST-007-3.
050900     GO TO    REL-TEST-007-R.
051000 REL-TEST-007-2.
051100     MOVE CCVS-PGM-ID       TO  XPROGRAM-NAME (1).
051200     MOVE  99 TO UPDATE-NUMBER (1).
051300     MOVE     FILE-RECORD-INFO-P1-120 (1) TO RL-FD1R1-F-G-120.
051400     DELETE    RL-FD1
051500             INVALID KEY GO TO REL-TEST-007-3.
051600     MOVE     ZERO TO  WRK-CS-09V00-007.
051700     ADD      1 TO  WRK-CS-09V00-008
051800     GO TO    REL-TEST-007-R.
051900 REL-TEST-007-3.
052000     IF       WRK-CS-09V00-006 NOT EQUAL TO 501
052100              MOVE WRK-CS-09V00-006 TO COMPUTED-18V0
052200              MOVE              501 TO CORRECT-18V0
052300              PERFORM FAIL
052400              ELSE
052500              PERFORM PASS.
052600     PERFORM  PRINT-DETAIL.
052700     ADD      01 TO REC-CT.
052800*    .01
052900     IF       WRK-CS-09V00-008 NOT EQUAL TO 125
053000              MOVE WRK-CS-09V00-008 TO COMPUTED-18V0
053100              MOVE 125              TO CORRECT-18V0
053200              MOVE "DELETED RECORDS" TO RE-MARK
053300              PERFORM FAIL
053400              ELSE
053500              PERFORM PASS.
053600     PERFORM  PRINT-DETAIL.
053700     ADD      01 TO REC-CT.
053800*    .02
053900     CLOSE    RL-FD1.
054000 REL-INIT-008.
054100     MOVE     "REL-TEST-008" TO PAR-NAME.
054200     MOVE     ZERO TO   WRK-CS-09V00-006
054300     MOVE     ZERO TO   WRK-CS-09V00-007
054400     MOVE     ZERO TO   WRK-CS-09V00-008
054500     MOVE     ZERO TO   WRK-CS-09V00-009
054600     MOVE     ZERO TO   WRK-CS-09V00-010
054700     MOVE     ZERO TO   WRK-CS-09V00-011
054800     MOVE     01 TO REC-CT.
054900     MOVE     SPACE  TO  FILE-RECORD-INFO-P1-120 (1).
055000     MOVE     ZERO TO RL-FD1-KEY.
055100     OPEN     INPUT  RL-FD1.
055200     MOVE    "READ UPDATED FILE"  TO FEATURE.
055300 REL-TEST-008-R.
055400     ADD      1 TO WRK-CS-09V00-006.
055500     ADD      1 TO WRK-CS-09V00-007.
055600     ADD      1 TO WRK-CS-09V00-008.
055700     READ      RL-FD1 NEXT RECORD  AT END  GO TO REL-TEST-008-3.
055800     MOVE     RL-FD1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
055900     IF       UPDATE-NUMBER (1) EQUAL TO 99
056000              ADD  1 TO WRK-CS-09V00-009.
056100     IF       WRK-CS-09V00-007  EQUAL TO 4
056200              MOVE 01 TO WRK-CS-09V00-007
056300              ADD 1 TO WRK-CS-09V00-008.
056400     IF       RL-FD1-KEY EQUAL TO  XRECORD-NUMBER (1)
056500              ADD 1 TO  WRK-CS-09V00-010.
056600     IF       XRECORD-NUMBER (1) EQUAL TO  WRK-CS-09V00-008
056700              ADD 1 TO  WRK-CS-09V00-011.
056800     IF       WRK-CS-09V00-006 GREATER  501
056900              GO TO REL-TEST-008-3.
057000     GO TO    REL-TEST-008-R.
057100 REL-TEST-008-3.
057200     IF       WRK-CS-09V00-006 NOT EQUAL TO 376
057300              MOVE "INCORRECT RECORD COUNT"  TO RE-MARK
057400              MOVE WRK-CS-09V00-006 TO COMPUTED-18V0
057500              MOVE 376 TO CORRECT-18V0
057600              PERFORM  FAIL
057700              ELSE
057800              PERFORM  PASS.
057900     PERFORM  PRINT-DETAIL.
058000     ADD      01 TO REC-CT.
058100*    .01
058200     IF       WRK-CS-09V00-009 NOT EQUAL TO ZERO
058300              MOVE WRK-CS-09V00-009 TO COMPUTED-18V0
058400             MOVE   ZERO TO CORRECT-18V0
058500              MOVE "DELETED RECORDS" TO RE-MARK
058600              PERFORM FAIL
058700              ELSE
058800              PERFORM PASS.
058900     PERFORM  PRINT-DETAIL.
059000     ADD      01  TO  REC-CT.
059100*    .02
059200     IF       WRK-CS-09V00-010 NOT EQUAL TO 375
059300              MOVE "KEY MISMATCH" TO RE-MARK
059400             MOVE 375 TO CORRECT-18V0
059500              MOVE WRK-CS-09V00-010 TO COMPUTED-18V0
059600              PERFORM FAIL
059700              ELSE
059800              PERFORM PASS.
059900     PERFORM  PRINT-DETAIL.
060000     ADD      01 TO REC-CT.
060100*    .03
060200     IF      WRK-CS-09V00-011  NOT EQUAL TO 375
060300             MOVE   375  TO CORRECT-18V0
060400             MOVE  "INCORRECT RECORD FOUND"  TO RE-MARK
060500             MOVE   WRK-CS-09V00-011 TO COMPUTED-18V0
060600             PERFORM   FAIL
060700             ELSE
060800             PERFORM  PASS.
060900     PERFORM   PRINT-DETAIL.
061000*04
061100     CLOSE    RL-FD1.
061200 CCVS-EXIT SECTION.
061300 CCVS-999999.
061400     GO TO CLOSE-FILES.
