000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL211A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*    THE FUNCTION OF THIS PROGRAM IS TO CREATE A RELATIVE FILE *
001400*    SEQUENTIALLY WITH VARIABLE LENGTH RECORDS AND VERIFY THAT *
001500*    IT WAS CREATED CORRECTLY.                                 *
001600*    THE PROGRAM WILL CREATE A RELATIVE FILE OF 500 VARIABLE   *
001700*    LENGTH RECORDS.                                           *
001800*    THE RECORD SIZE WILL BE 120 TO 140 CHARACTERS.            *
001900*
002000*            X-CARD PARAMETERS WHICH MUST BE SUPPLIED FOR THIS
002100*            PROGRAM ARE:
002200*
002300*                 X-21   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR
002400*                         RELATIVE  I-O DATA FILE
002500*                 X-55   SYSTEM PRINTER
002600*                 X-69   ADDITIONAL VALUE OF CLAUSES
002700*                 X-74   VALUE OF IMPLEMENTOR-NAME
002800*                 X-75   OBJECT OF VALUE OF CLAUSE
002900*                 X-82   SOURCE-COMPUTER
003000*                 X-83   OBJECT-COMPUTER.
003100*
003200****************************************************************
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.
003600     XXXXX082.
003700 OBJECT-COMPUTER.
003800     XXXXX083.
003900 INPUT-OUTPUT SECTION.
004000 FILE-CONTROL.
004100     SELECT PRINT-FILE ASSIGN TO
004200     XXXXX055.
004300     SELECT   RL-VS1 ASSIGN TO
004400     XXXXP021
004500             ORGANIZATION IS RELATIVE.
004600*    ABSENCE OF THE ACCESS CLAUSE IS TREATED AS THOUGH
004700*     SEQUENTIAL HAD BEEN SPECIFIED.
004800 DATA DIVISION.
004900 FILE SECTION.
005000 FD  PRINT-FILE.
005100 01  PRINT-REC PICTURE X(120).
005200 01  DUMMY-RECORD PICTURE X(120).
005300 FD  RL-VS1
005400     LABEL RECORDS STANDARD
005500C    VALUE OF
005600C    XXXXX074
005700C    IS
005800C    XXXXX075
005900G    XXXXX069
006000     BLOCK CONTAINS 1 RECORDS
006100     RECORD IS VARYING.
006200 01  RL-VS1R1-F-G-140.
006300     02  FILLER PIC X.
006400     02  FILLER PIC X(7).
006500     02  FILLER PIC X(108).
006600     02  RL-VS1R1-F-G-117-119  PIC 9(3).
006700     02  RL-GROUP.
006800      03 RL-VS1R1-F-G-120-140  PIC X  OCCURS 1 TO 21
006900                               DEPENDING ON RL-VS1R1-F-G-117-119.
007000 WORKING-STORAGE SECTION.
007100 01  WS-VS1R1-F-G-140.
007200     02  FILLER PIC X(116).
007300     02  WS-VS1R1-F-G-117-119  PIC 9(3).
007400     02  WS-VS1R1-F-G-120-140  PIC X(21).
007500 01  WRK-CS-09V00 PIC S9(9) USAGE COMP VALUE ZERO.
007600 01  FILE-RECORD-INFORMATION-REC.
007700     03 FILE-RECORD-INFO-SKELETON.
007800        05 FILLER                 PICTURE X(48)       VALUE
007900             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
008000        05 FILLER                 PICTURE X(46)       VALUE
008100             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
008200        05 FILLER                 PICTURE X(26)       VALUE
008300             ",LFIL=000000,ORG=  ,LBLR= ".
008400        05 FILLER                 PICTURE X(37)       VALUE
008500             ",RECKEY=                             ".
008600        05 FILLER                 PICTURE X(38)       VALUE
008700             ",ALTKEY1=                             ".
008800        05 FILLER                 PICTURE X(38)       VALUE
008900             ",ALTKEY2=                             ".
009000        05 FILLER                 PICTURE X(7)        VALUE SPACE.
009100     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
009200        05 FILE-RECORD-INFO-P1-120.
009300           07 FILLER              PIC X(5).
009400           07 XFILE-NAME           PIC X(6).
009500           07 FILLER              PIC X(8).
009600           07 XRECORD-NAME         PIC X(6).
009700           07 FILLER              PIC X(1).
009800           07 REELUNIT-NUMBER     PIC 9(1).
009900           07 FILLER              PIC X(7).
010000           07 XRECORD-NUMBER       PIC 9(6).
010100           07 FILLER              PIC X(6).
010200           07 UPDATE-NUMBER       PIC 9(2).
010300           07 FILLER              PIC X(5).
010400           07 ODO-NUMBER          PIC 9(4).
010500           07 FILLER              PIC X(5).
010600           07 XPROGRAM-NAME        PIC X(5).
010700           07 FILLER              PIC X(7).
010800           07 XRECORD-LENGTH       PIC 9(6).
010900           07 FILLER              PIC X(7).
011000           07 CHARS-OR-RECORDS    PIC X(2).
011100           07 FILLER              PIC X(1).
011200           07 XBLOCK-SIZE          PIC 9(4).
011300           07 FILLER              PIC X(6).
011400           07 RECORDS-IN-FILE     PIC 9(6).
011500           07 FILLER              PIC X(5).
011600           07 XFILE-ORGANIZATION   PIC X(2).
011700           07 FILLER              PIC X(6).
011800           07 XLABEL-TYPE          PIC X(1).
011900        05 FILE-RECORD-INFO-P121-240.
012000           07 FILLER              PIC X(8).
012100           07 XRECORD-KEY          PIC X(29).
012200           07 FILLER              PIC X(9).
012300           07 ALTERNATE-KEY1      PIC X(29).
012400           07 FILLER              PIC X(9).
012500           07 ALTERNATE-KEY2      PIC X(29).
012600           07 FILLER              PIC X(7).
012700 01  TEST-RESULTS.
012800     02 FILLER                   PIC X      VALUE SPACE.
012900     02 FEATURE                  PIC X(20)  VALUE SPACE.
013000     02 FILLER                   PIC X      VALUE SPACE.
013100     02 P-OR-F                   PIC X(5)   VALUE SPACE.
013200     02 FILLER                   PIC X      VALUE SPACE.
013300     02  PAR-NAME.
013400       03 FILLER                 PIC X(19)  VALUE SPACE.
013500       03  PARDOT-X              PIC X      VALUE SPACE.
013600       03 DOTVALUE               PIC 99     VALUE ZERO.
013700     02 FILLER                   PIC X(8)   VALUE SPACE.
013800     02 RE-MARK                  PIC X(61).
013900 01  TEST-COMPUTED.
014000     02 FILLER                   PIC X(30)  VALUE SPACE.
014100     02 FILLER                   PIC X(17)  VALUE
014200            "       COMPUTED=".
014300     02 COMPUTED-X.
014400     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
014500     03 COMPUTED-N               REDEFINES COMPUTED-A
014600                                 PIC -9(9).9(9).
014700     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
014800     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
014900     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015000     03       CM-18V0 REDEFINES COMPUTED-A.
015100         04 COMPUTED-18V0                    PIC -9(18).
015200         04 FILLER                           PIC X.
015300     03 FILLER PIC X(50) VALUE SPACE.
015400 01  TEST-CORRECT.
015500     02 FILLER PIC X(30) VALUE SPACE.
015600     02 FILLER PIC X(17) VALUE "       CORRECT =".
015700     02 CORRECT-X.
015800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
015900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
016100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
016200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
016300     03      CR-18V0 REDEFINES CORRECT-A.
016400         04 CORRECT-18V0                     PIC -9(18).
016500         04 FILLER                           PIC X.
016600     03 FILLER PIC X(2) VALUE SPACE.
016700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
016800 01  CCVS-C-1.
016900     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017000-    "SS  PARAGRAPH-NAME
017100-    "       REMARKS".
017200     02 FILLER                     PIC X(20)    VALUE SPACE.
017300 01  CCVS-C-2.
017400     02 FILLER                     PIC X        VALUE SPACE.
017500     02 FILLER                     PIC X(6)     VALUE "TESTED".
017600     02 FILLER                     PIC X(15)    VALUE SPACE.
017700     02 FILLER                     PIC X(4)     VALUE "FAIL".
017800     02 FILLER                     PIC X(94)    VALUE SPACE.
017900 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018000 01  REC-CT                        PIC 99       VALUE ZERO.
018100 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
018200 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
018300 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
018400 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
018500 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
018600 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
018700 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
018800 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
018900 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019000 01  CCVS-H-1.
019100     02  FILLER                    PIC X(39)    VALUE SPACES.
019200     02  FILLER                    PIC X(42)    VALUE
019300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
019400     02  FILLER                    PIC X(39)    VALUE SPACES.
019500 01  CCVS-H-2A.
019600   02  FILLER                        PIC X(40)  VALUE SPACE.
019700   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
019800   02  FILLER                        PIC XXXX   VALUE
019900     "4.2 ".
020000   02  FILLER                        PIC X(28)  VALUE
020100            " COPY - NOT FOR DISTRIBUTION".
020200   02  FILLER                        PIC X(41)  VALUE SPACE.
020300
020400 01  CCVS-H-2B.
020500   02  FILLER                        PIC X(15)  VALUE
020600            "TEST RESULT OF ".
020700   02  TEST-ID                       PIC X(9).
020800   02  FILLER                        PIC X(4)   VALUE
020900            " IN ".
021000   02  FILLER                        PIC X(12)  VALUE
021100     " HIGH       ".
021200   02  FILLER                        PIC X(22)  VALUE
021300            " LEVEL VALIDATION FOR ".
021400   02  FILLER                        PIC X(58)  VALUE
021500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021600 01  CCVS-H-3.
021700     02  FILLER                      PIC X(34)  VALUE
021800            " FOR OFFICIAL USE ONLY    ".
021900     02  FILLER                      PIC X(58)  VALUE
022000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022100     02  FILLER                      PIC X(28)  VALUE
022200            "  COPYRIGHT   1985 ".
022300 01  CCVS-E-1.
022400     02 FILLER                       PIC X(52)  VALUE SPACE.
022500     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
022600     02 ID-AGAIN                     PIC X(9).
022700     02 FILLER                       PIC X(45)  VALUE SPACES.
022800 01  CCVS-E-2.
022900     02  FILLER                      PIC X(31)  VALUE SPACE.
023000     02  FILLER                      PIC X(21)  VALUE SPACE.
023100     02 CCVS-E-2-2.
023200         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
023300         03 FILLER                   PIC X      VALUE SPACE.
023400         03 ENDER-DESC               PIC X(44)  VALUE
023500            "ERRORS ENCOUNTERED".
023600 01  CCVS-E-3.
023700     02  FILLER                      PIC X(22)  VALUE
023800            " FOR OFFICIAL USE ONLY".
023900     02  FILLER                      PIC X(12)  VALUE SPACE.
024000     02  FILLER                      PIC X(58)  VALUE
024100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024200     02  FILLER                      PIC X(13)  VALUE SPACE.
024300     02 FILLER                       PIC X(15)  VALUE
024400             " COPYRIGHT 1985".
024500 01  CCVS-E-4.
024600     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
024700     02 FILLER                       PIC X(4)   VALUE " OF ".
024800     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
024900     02 FILLER                       PIC X(40)  VALUE
025000      "  TESTS WERE EXECUTED SUCCESSFULLY".
025100 01  XXINFO.
025200     02 FILLER                       PIC X(19)  VALUE
025300            "*** INFORMATION ***".
025400     02 INFO-TEXT.
025500       04 FILLER                     PIC X(8)   VALUE SPACE.
025600       04 XXCOMPUTED                 PIC X(20).
025700       04 FILLER                     PIC X(5)   VALUE SPACE.
025800       04 XXCORRECT                  PIC X(20).
025900     02 INF-ANSI-REFERENCE           PIC X(48).
026000 01  HYPHEN-LINE.
026100     02 FILLER  PIC IS X VALUE IS SPACE.
026200     02 FILLER  PIC IS X(65)    VALUE IS "************************
026300-    "*****************************************".
026400     02 FILLER  PIC IS X(54)    VALUE IS "************************
026500-    "******************************".
026600 01  CCVS-PGM-ID                     PIC X(9)   VALUE
026700     "RL211A".
026800 PROCEDURE DIVISION.
026900 CCVS1 SECTION.
027000 OPEN-FILES.
027100     OPEN    OUTPUT PRINT-FILE.
027200     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027300     MOVE    SPACE TO TEST-RESULTS.
027400     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
027500     MOVE    ZERO TO REC-SKL-SUB.
027600     PERFORM CCVS-INIT-FILE 9 TIMES.
027700 CCVS-INIT-FILE.
027800     ADD     1 TO REC-SKL-SUB.
027900     MOVE    FILE-RECORD-INFO-SKELETON
028000          TO FILE-RECORD-INFO (REC-SKL-SUB).
028100 CCVS-INIT-EXIT.
028200     GO TO CCVS1-EXIT.
028300 CLOSE-FILES.
028400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028500 TERMINATE-CCVS.
028600S    EXIT PROGRAM.
028700STERMINATE-CALL.
028800     STOP     RUN.
028900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029300     MOVE "****TEST DELETED****" TO RE-MARK.
029400 PRINT-DETAIL.
029500     IF REC-CT NOT EQUAL TO ZERO
029600             MOVE "." TO PARDOT-X
029700             MOVE REC-CT TO DOTVALUE.
029800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
029900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030300     MOVE SPACE TO CORRECT-X.
030400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
030500     MOVE     SPACE TO RE-MARK.
030600 HEAD-ROUTINE.
030700     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030800     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030900     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031000     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031100 COLUMN-NAMES-ROUTINE.
031200     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031300     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
031500 END-ROUTINE.
031600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031700 END-RTN-EXIT.
031800     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031900 END-ROUTINE-1.
032000      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032100      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032200      ADD PASS-COUNTER TO ERROR-HOLD.
032300*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032400      MOVE PASS-COUNTER TO CCVS-E-4-1.
032500      MOVE ERROR-HOLD TO CCVS-E-4-2.
032600      MOVE CCVS-E-4 TO CCVS-E-2-2.
032700      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
032800  END-ROUTINE-12.
032900      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033000     IF       ERROR-COUNTER IS EQUAL TO ZERO
033100         MOVE "NO " TO ERROR-TOTAL
033200         ELSE
033300         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033400     MOVE     CCVS-E-2 TO DUMMY-RECORD.
033500     PERFORM WRITE-LINE.
033600 END-ROUTINE-13.
033700     IF DELETE-COUNTER IS EQUAL TO ZERO
033800         MOVE "NO " TO ERROR-TOTAL  ELSE
033900         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034000     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034100     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034200      IF   INSPECT-COUNTER EQUAL TO ZERO
034300          MOVE "NO " TO ERROR-TOTAL
034400      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
034500      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
034600      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034700     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034800 WRITE-LINE.
034900     ADD 1 TO RECORD-COUNT.
035000Y    IF RECORD-COUNT GREATER 50
035100Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035200Y        MOVE SPACE TO DUMMY-RECORD
035300Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035400Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
035500Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
035600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
035700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
035800Y        MOVE ZERO TO RECORD-COUNT.
035900     PERFORM WRT-LN.
036000 WRT-LN.
036100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036200     MOVE SPACE TO DUMMY-RECORD.
036300 BLANK-LINE-PRINT.
036400     PERFORM WRT-LN.
036500 FAIL-ROUTINE.
036600     IF     COMPUTED-X NOT EQUAL TO SPACE
036700            GO TO   FAIL-ROUTINE-WRITE.
036800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037200     MOVE   SPACES TO INF-ANSI-REFERENCE.
037300     GO TO  FAIL-ROUTINE-EX.
037400 FAIL-ROUTINE-WRITE.
037500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
037600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
037700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
037800     MOVE   SPACES TO COR-ANSI-REFERENCE.
037900 FAIL-ROUTINE-EX. EXIT.
038000 BAIL-OUT.
038100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038300 BAIL-OUT-WRITE.
038400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038700     MOVE   SPACES TO INF-ANSI-REFERENCE.
038800 BAIL-OUT-EX. EXIT.
038900 CCVS1-EXIT.
039000     EXIT.
039100 SECT-RL211A-001 SECTION.
039200 REL-INIT-001.
039300     MOVE     "FILE CREATE RL-VS1" TO FEATURE.
039400     OPEN     OUTPUT    RL-VS1.
039500     MOVE     "RL-VS1" TO XFILE-NAME (1).
039600     MOVE     "R1-F-G" TO XRECORD-NAME (1).
039700     MOVE CCVS-PGM-ID  TO XPROGRAM-NAME (1).
039800     MOVE     000120   TO XRECORD-LENGTH (1).
039900     MOVE     "RC"     TO CHARS-OR-RECORDS (1).
040000     MOVE     0001     TO XBLOCK-SIZE (1).
040100     MOVE     000500   TO RECORDS-IN-FILE (1).
040200     MOVE     "RL"     TO XFILE-ORGANIZATION (1).
040300     MOVE     "S"      TO XLABEL-TYPE (1).
040400     MOVE     000001   TO XRECORD-NUMBER (1).
040500 REL-TEST-001.
040600     MOVE    FILE-RECORD-INFO-P1-120 (1) TO RL-VS1R1-F-G-140.
040700     IF      XRECORD-NUMBER (1) > 32
040800             MOVE   21 TO RL-VS1R1-F-G-117-119.
040900     IF      XRECORD-NUMBER (1) = 32
041000             MOVE   16 TO RL-VS1R1-F-G-117-119.
041100     IF      XRECORD-NUMBER (1) = 31
041200             MOVE   6  TO RL-VS1R1-F-G-117-119.
041300     IF      XRECORD-NUMBER (1) < 31
041400             MOVE   21 TO RL-VS1R1-F-G-117-119.
041500     IF      XRECORD-NUMBER (1) < 21
041600             MOVE   11 TO RL-VS1R1-F-G-117-119.
041700     IF      XRECORD-NUMBER (1) < 11
041800             MOVE   1  TO RL-VS1R1-F-G-117-119.
041900     MOVE   "ABCDEFGHIJKLMNOPQRSTU" TO RL-GROUP.
042000     WRITE   RL-VS1R1-F-G-140
042100             INVALID KEY GO TO REL-FAIL-001.
042200     IF      XRECORD-NUMBER (1) EQUAL TO 500
042300             GO TO REL-WRITE-001.
042400     ADD     000001 TO XRECORD-NUMBER (1).
042500     GO      TO REL-TEST-001.
042600 REL-DELETE-001.
042700     PERFORM DE-LETE.
042800     GO TO REL-WRITE-001.
042900 REL-FAIL-001.
043000     PERFORM FAIL.
043100     MOVE   "BOUNDARY VIOLATION"  TO RE-MARK.
043200 REL-WRITE-001.
043300     MOVE   "REL-TEST-001" TO   PAR-NAME
043400     MOVE   "FILE CREATED, LFILE "  TO COMPUTED-A.
043500     MOVE    XRECORD-NUMBER (1) TO CORRECT-18V0.
043600     PERFORM PRINT-DETAIL.
043700     CLOSE   RL-VS1.
043800     OPEN    INPUT     RL-VS1.
043900     MOVE    ZERO      TO WRK-CS-09V00.
044000 REL-INIT-1.
044100     MOVE    SPACES TO RL-VS1R1-F-G-140.
044200     READ    RL-VS1
044300             AT END GO TO REL-TEST-002-2.
044400     MOVE    RL-VS1R1-F-G-140 TO FILE-RECORD-INFO-P1-120 (1).
044500     MOVE    RL-VS1R1-F-G-140 TO WS-VS1R1-F-G-140.
044600     ADD     1 TO WRK-CS-09V00.
044700     IF      WRK-CS-09V00 GREATER 500
044800             MOVE "MORE THAN 500 RECORDS" TO RE-MARK
044900             GO TO REL-TEST-002-2.
045000 REL-TEST-1.
045100     MOVE   "VII-31 3.8.4 GR 5 & 5A" TO ANSI-REFERENCE.
045200     MOVE   "REL-TEST-1" TO PAR-NAME.
045300     IF      WRK-CS-09V00 < 11
045400             IF      WS-VS1R1-F-G-120-140 =
045500                                 "A                    "
045600                     PERFORM PASS
045700*                    PERFORM PRINT-DETAIL
045800             ELSE
045900                     MOVE    WS-VS1R1-F-G-120-140 TO COMPUTED-X
046000                     MOVE   "A                    " TO CORRECT-X
046100                     MOVE   "WRONG LENGTH RECORD" TO RE-MARK
046200                     PERFORM FAIL
046300                     PERFORM PRINT-DETAIL.
046400 REL-TEST-2.
046500     MOVE   "VII-31 3.8.4 GR 5" TO ANSI-REFERENCE.
046600     MOVE   "REL-TEST-2" TO PAR-NAME.
046700     IF     (WRK-CS-09V00 > 10 AND < 21)
046800             IF      WS-VS1R1-F-G-120-140 =
046900                                 "ABCDEFGHIJK          "
047000                     PERFORM PASS
047100*                    PERFORM PRINT-DETAIL
047200             ELSE
047300                     MOVE    WS-VS1R1-F-G-120-140 TO COMPUTED-X
047400                     MOVE   "ABCDEFGHIJK          " TO CORRECT-X
047500                     MOVE   "WRONG LENGTH RECORD" TO RE-MARK
047600                     PERFORM FAIL
047700                     PERFORM PRINT-DETAIL.
047800 REL-TEST-3.
047900     MOVE   "VII-31 3.8.4 GR 5 & 5B" TO ANSI-REFERENCE.
048000     MOVE   "REL-TEST-3" TO PAR-NAME.
048100     IF     (WRK-CS-09V00 > 20 AND < 31)
048200             IF      WS-VS1R1-F-G-120-140 =
048300                                 "ABCDEFGHIJKLMNOPQRSTU"
048400                     PERFORM PASS
048500*                    PERFORM PRINT-DETAIL
048600             ELSE
048700                     MOVE    WS-VS1R1-F-G-120-140 TO COMPUTED-X
048800                     MOVE   "ABCDEFGHIJKLMNOPQRSTU" TO CORRECT-X
048900                     MOVE   "WRONG LENGTH RECORD" TO RE-MARK
049000                     PERFORM FAIL
049100                     PERFORM PRINT-DETAIL.
049200 REL-TEST-4.
049300     MOVE   "VII-31 3.8.4 GR 5" TO ANSI-REFERENCE.
049400     MOVE   "REL-TEST-4" TO PAR-NAME.
049500     IF      WRK-CS-09V00 = 31
049600             IF      WS-VS1R1-F-G-120-140 =
049700                                 "ABCDEF               "
049800                     PERFORM PASS
049900*                    PERFORM PRINT-DETAIL
050000             ELSE
050100                     MOVE    WS-VS1R1-F-G-120-140 TO COMPUTED-X
050200                     MOVE   "ABCDEF               " TO CORRECT-X
050300                     MOVE   "WRONG LENGTH RECORD" TO RE-MARK
050400                     PERFORM FAIL
050500                     PERFORM PRINT-DETAIL.
050600 REL-TEST-5.
050700     MOVE   "VII-31 3.8.4 GR 5" TO ANSI-REFERENCE.
050800     MOVE   "REL-TEST-5" TO PAR-NAME.
050900     IF      WRK-CS-09V00 = 32
051000             IF      WS-VS1R1-F-G-120-140 =
051100                                 "ABCDEFGHIJKLMNOP     "
051200                     PERFORM PASS
051300*                    PERFORM PRINT-DETAIL
051400             ELSE
051500                     MOVE    WS-VS1R1-F-G-120-140 TO COMPUTED-X
051600                     MOVE   "ABCDEFGHIJKLMNOP     " TO CORRECT-X
051700                     MOVE   "WRONG LENGTH RECORD" TO RE-MARK
051800                     PERFORM FAIL
051900                     PERFORM PRINT-DETAIL.
052000 REL-TEST-6.
052100     MOVE   "VII-31 3.8.4 GR 5 & 5B" TO ANSI-REFERENCE.
052200     MOVE   "REL-TEST-6" TO PAR-NAME.
052300     IF      WRK-CS-09V00 > 32
052400             IF      WS-VS1R1-F-G-120-140 =
052500                                 "ABCDEFGHIJKLMNOPQRSTU"
052600                     PERFORM PASS
052700*                    PERFORM PRINT-DETAIL
052800             ELSE
052900                     MOVE    WS-VS1R1-F-G-120-140 TO COMPUTED-X
053000                     MOVE   "ABCDEFGHIJKLMNOPQRSTU" TO CORRECT-X
053100                     MOVE   "WRONG LENGTH RECORD" TO RE-MARK
053200                     PERFORM FAIL
053300                     PERFORM PRINT-DETAIL.
053400     GO      TO REL-INIT-1.
053500 REL-DELETE-002.
053600     PERFORM DE-LETE.
053700     PERFORM PRINT-DETAIL.
053800 REL-TEST-002-2.
053900     MOVE   "REL-TEST-002-2" TO PAR-NAME.
054000     IF      XRECORD-NUMBER (1) NOT EQUAL TO 500
054100             PERFORM FAIL
054200     ELSE
054300             PERFORM PASS.
054400     GO      TO REL-WRITE-002.
054500 REL-WRITE-002.
054600     MOVE   "REL-TEST-002" TO PAR-NAME.
054700     MOVE   "FILE VERIFIED, LFILE" TO COMPUTED-A.
054800     MOVE    XRECORD-NUMBER (1) TO CORRECT-18V0.
054900     PERFORM PRINT-DETAIL.
055000     CLOSE   RL-VS1.
055100 CCVS-EXIT SECTION.
055200 CCVS-999999.
055300     GO TO CLOSE-FILES.
