000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     RL213A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*    THE FUNCTION OF THIS PROGRAM IS TO PROCESS A RELATIVE I-O *
001400*    FILE SEQUENTIALLY (ACCESS MODE SEQUENTIAL).  THE FILE     *
001500*    USED AS INPUT IS THE FILE "RL-FS1" CREATED BY RL212A AND  *
001600*    THE OTHER FILE "RL-FS2" WILL NOT BE PRESENT AT THE        *
001700*    EXECUTION OF THE PROGRAM.                                 *
001800*                                                              *
001900*        X-CARD PARAMETERS WHICH MUST BE SUPPLIED FOR THIS     *
002000*        PROGRAM ARE:                                          *
002100*                                                              *
002200*             X-21   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR  *
002300*                     RELATIVE  I-O DATA FILE (RL-FS1)         *
002400*             X-22   IMPLEMENTOR-NAME IN ASSIGN TO CLAUSE FOR  *
002500*                     RELATIVE  I-O DATA FILE (RL-FS2)         *
002600*             X-55   SYSTEM PRINTER                            *
002700*             X-69   ADDITIONAL VALUE OF CLAUSES               *
002800*             X-74   VALUE OF IMPLEMENTOR-NAME                 *
002900*             X-75   OBJECT OF VALUE OF CLAUSE                 *
003000*             X-82   SOURCE-COMPUTER                           *
003100*             X-83   OBJECT-COMPUTER.                          *
003200*                                                              *
003300****************************************************************
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.
003700     XXXXX082.
003800 OBJECT-COMPUTER.
003900     XXXXX083.
004000 INPUT-OUTPUT SECTION.
004100 FILE-CONTROL.
004200     SELECT PRINT-FILE ASSIGN TO
004300     XXXXX055.
004400     SELECT  OPTIONAL RL-FS1 ASSIGN TO
004500     XXXXX021
004600             ORGANIZATION IS RELATIVE
004700             ACCESS  SEQUENTIAL.
004800     SELECT  OPTIONAL RL-FS2 ASSIGN TO
004900     XXXXX022
005000             ORGANIZATION IS RELATIVE
005100             ACCESS  SEQUENTIAL.
005200 DATA DIVISION.
005300 FILE SECTION.
005400 FD  PRINT-FILE.
005500 01  PRINT-REC PICTURE X(120).
005600 01  DUMMY-RECORD PICTURE X(120).
005700 FD  RL-FS1
005800     LABEL RECORDS STANDARD
005900C    VALUE OF
006000C    XXXXX074
006100C    IS
006200C    XXXXX075
006300G    XXXXX069
006400     BLOCK CONTAINS 1 RECORDS
006500     RECORD CONTAINS 120 CHARACTERS.
006600 01  RL-FS1R1-F-G-120.
006700     02 FILLER PIC X(120).
006800 FD  RL-FS2
006900     LABEL RECORDS STANDARD
007000C    VALUE OF
007100C    XXXXX074
007200C    IS
007300C    XXXXX075
007400G    XXXXX069
007500     BLOCK CONTAINS 1 RECORDS
007600     RECORD CONTAINS 120 CHARACTERS.
007700 01  RL-FS2R1-F-G-120.
007800     02 FILLER PIC X(120).
007900 WORKING-STORAGE SECTION.
008000 01  WRK-CS-09V00 PIC S9(9) USAGE COMP VALUE ZERO.
008100 01  FILE-RECORD-INFORMATION-REC.
008200     03 FILE-RECORD-INFO-SKELETON.
008300        05 FILLER                 PICTURE X(48)       VALUE
008400             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
008500        05 FILLER                 PICTURE X(46)       VALUE
008600             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
008700        05 FILLER                 PICTURE X(26)       VALUE
008800             ",LFIL=000000,ORG=  ,LBLR= ".
008900        05 FILLER                 PICTURE X(37)       VALUE
009000             ",RECKEY=                             ".
009100        05 FILLER                 PICTURE X(38)       VALUE
009200             ",ALTKEY1=                             ".
009300        05 FILLER                 PICTURE X(38)       VALUE
009400             ",ALTKEY2=                             ".
009500        05 FILLER                 PICTURE X(7)        VALUE SPACE.
009600     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
009700        05 FILE-RECORD-INFO-P1-120.
009800           07 FILLER              PIC X(5).
009900           07 XFILE-NAME           PIC X(6).
010000           07 FILLER              PIC X(8).
010100           07 XRECORD-NAME         PIC X(6).
010200           07 FILLER              PIC X(1).
010300           07 REELUNIT-NUMBER     PIC 9(1).
010400           07 FILLER              PIC X(7).
010500           07 XRECORD-NUMBER       PIC 9(6).
010600           07 FILLER              PIC X(6).
010700           07 UPDATE-NUMBER       PIC 9(2).
010800           07 FILLER              PIC X(5).
010900           07 ODO-NUMBER          PIC 9(4).
011000           07 FILLER              PIC X(5).
011100           07 XPROGRAM-NAME        PIC X(5).
011200           07 FILLER              PIC X(7).
011300           07 XRECORD-LENGTH       PIC 9(6).
011400           07 FILLER              PIC X(7).
011500           07 CHARS-OR-RECORDS    PIC X(2).
011600           07 FILLER              PIC X(1).
011700           07 XBLOCK-SIZE          PIC 9(4).
011800           07 FILLER              PIC X(6).
011900           07 RECORDS-IN-FILE     PIC 9(6).
012000           07 FILLER              PIC X(5).
012100           07 XFILE-ORGANIZATION   PIC X(2).
012200           07 FILLER              PIC X(6).
012300           07 XLABEL-TYPE          PIC X(1).
012400        05 FILE-RECORD-INFO-P121-240.
012500           07 FILLER              PIC X(8).
012600           07 XRECORD-KEY          PIC X(29).
012700           07 FILLER              PIC X(9).
012800           07 ALTERNATE-KEY1      PIC X(29).
012900           07 FILLER              PIC X(9).
013000           07 ALTERNATE-KEY2      PIC X(29).
013100           07 FILLER              PIC X(7).
013200 01  TEST-RESULTS.
013300     02 FILLER                   PIC X      VALUE SPACE.
013400     02 FEATURE                  PIC X(20)  VALUE SPACE.
013500     02 FILLER                   PIC X      VALUE SPACE.
013600     02 P-OR-F                   PIC X(5)   VALUE SPACE.
013700     02 FILLER                   PIC X      VALUE SPACE.
013800     02  PAR-NAME.
013900       03 FILLER                 PIC X(19)  VALUE SPACE.
014000       03  PARDOT-X              PIC X      VALUE SPACE.
014100       03 DOTVALUE               PIC 99     VALUE ZERO.
014200     02 FILLER                   PIC X(8)   VALUE SPACE.
014300     02 RE-MARK                  PIC X(61).
014400 01  TEST-COMPUTED.
014500     02 FILLER                   PIC X(30)  VALUE SPACE.
014600     02 FILLER                   PIC X(17)  VALUE
014700            "       COMPUTED=".
014800     02 COMPUTED-X.
014900     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
015000     03 COMPUTED-N               REDEFINES COMPUTED-A
015100                                 PIC -9(9).9(9).
015200     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
015300     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
015400     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
015500     03       CM-18V0 REDEFINES COMPUTED-A.
015600         04 COMPUTED-18V0                    PIC -9(18).
015700         04 FILLER                           PIC X.
015800     03 FILLER PIC X(50) VALUE SPACE.
015900 01  TEST-CORRECT.
016000     02 FILLER PIC X(30) VALUE SPACE.
016100     02 FILLER PIC X(17) VALUE "       CORRECT =".
016200     02 CORRECT-X.
016300     03 CORRECT-A                  PIC X(20) VALUE SPACE.
016400     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
016500     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
016600     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
016700     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
016800     03      CR-18V0 REDEFINES CORRECT-A.
016900         04 CORRECT-18V0                     PIC -9(18).
017000         04 FILLER                           PIC X.
017100     03 FILLER PIC X(2) VALUE SPACE.
017200     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
017300 01  CCVS-C-1.
017400     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
017500-    "SS  PARAGRAPH-NAME
017600-    "       REMARKS".
017700     02 FILLER                     PIC X(20)    VALUE SPACE.
017800 01  CCVS-C-2.
017900     02 FILLER                     PIC X        VALUE SPACE.
018000     02 FILLER                     PIC X(6)     VALUE "TESTED".
018100     02 FILLER                     PIC X(15)    VALUE SPACE.
018200     02 FILLER                     PIC X(4)     VALUE "FAIL".
018300     02 FILLER                     PIC X(94)    VALUE SPACE.
018400 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
018500 01  REC-CT                        PIC 99       VALUE ZERO.
018600 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
018700 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
018800 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
018900 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
019000 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
019100 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
019200 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
019300 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
019400 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
019500 01  CCVS-H-1.
019600     02  FILLER                    PIC X(39)    VALUE SPACES.
019700     02  FILLER                    PIC X(42)    VALUE
019800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
019900     02  FILLER                    PIC X(39)    VALUE SPACES.
020000 01  CCVS-H-2A.
020100   02  FILLER                        PIC X(40)  VALUE SPACE.
020200   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
020300   02  FILLER                        PIC XXXX   VALUE
020400     "4.2 ".
020500   02  FILLER                        PIC X(28)  VALUE
020600            " COPY - NOT FOR DISTRIBUTION".
020700   02  FILLER                        PIC X(41)  VALUE SPACE.
020800
020900 01  CCVS-H-2B.
021000   02  FILLER                        PIC X(15)  VALUE
021100            "TEST RESULT OF ".
021200   02  TEST-ID                       PIC X(9).
021300   02  FILLER                        PIC X(4)   VALUE
021400            " IN ".
021500   02  FILLER                        PIC X(12)  VALUE
021600     " HIGH       ".
021700   02  FILLER                        PIC X(22)  VALUE
021800            " LEVEL VALIDATION FOR ".
021900   02  FILLER                        PIC X(58)  VALUE
022000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
022100 01  CCVS-H-3.
022200     02  FILLER                      PIC X(34)  VALUE
022300            " FOR OFFICIAL USE ONLY    ".
022400     02  FILLER                      PIC X(58)  VALUE
022500     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022600     02  FILLER                      PIC X(28)  VALUE
022700            "  COPYRIGHT   1985 ".
022800 01  CCVS-E-1.
022900     02 FILLER                       PIC X(52)  VALUE SPACE.
023000     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
023100     02 ID-AGAIN                     PIC X(9).
023200     02 FILLER                       PIC X(45)  VALUE SPACES.
023300 01  CCVS-E-2.
023400     02  FILLER                      PIC X(31)  VALUE SPACE.
023500     02  FILLER                      PIC X(21)  VALUE SPACE.
023600     02 CCVS-E-2-2.
023700         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
023800         03 FILLER                   PIC X      VALUE SPACE.
023900         03 ENDER-DESC               PIC X(44)  VALUE
024000            "ERRORS ENCOUNTERED".
024100 01  CCVS-E-3.
024200     02  FILLER                      PIC X(22)  VALUE
024300            " FOR OFFICIAL USE ONLY".
024400     02  FILLER                      PIC X(12)  VALUE SPACE.
024500     02  FILLER                      PIC X(58)  VALUE
024600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024700     02  FILLER                      PIC X(13)  VALUE SPACE.
024800     02 FILLER                       PIC X(15)  VALUE
024900             " COPYRIGHT 1985".
025000 01  CCVS-E-4.
025100     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
025200     02 FILLER                       PIC X(4)   VALUE " OF ".
025300     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
025400     02 FILLER                       PIC X(40)  VALUE
025500      "  TESTS WERE EXECUTED SUCCESSFULLY".
025600 01  XXINFO.
025700     02 FILLER                       PIC X(19)  VALUE
025800            "*** INFORMATION ***".
025900     02 INFO-TEXT.
026000       04 FILLER                     PIC X(8)   VALUE SPACE.
026100       04 XXCOMPUTED                 PIC X(20).
026200       04 FILLER                     PIC X(5)   VALUE SPACE.
026300       04 XXCORRECT                  PIC X(20).
026400     02 INF-ANSI-REFERENCE           PIC X(48).
026500 01  HYPHEN-LINE.
026600     02 FILLER  PIC IS X VALUE IS SPACE.
026700     02 FILLER  PIC IS X(65)    VALUE IS "************************
026800-    "*****************************************".
026900     02 FILLER  PIC IS X(54)    VALUE IS "************************
027000-    "******************************".
027100 01  CCVS-PGM-ID                     PIC X(9)   VALUE
027200     "RL213A".
027300 PROCEDURE DIVISION.
027400 CCVS1 SECTION.
027500 OPEN-FILES.
027600     OPEN    OUTPUT PRINT-FILE.
027700     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027800     MOVE    SPACE TO TEST-RESULTS.
027900     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028000     MOVE    ZERO TO REC-SKL-SUB.
028100     PERFORM CCVS-INIT-FILE 9 TIMES.
028200 CCVS-INIT-FILE.
028300     ADD     1 TO REC-SKL-SUB.
028400     MOVE    FILE-RECORD-INFO-SKELETON
028500          TO FILE-RECORD-INFO (REC-SKL-SUB).
028600 CCVS-INIT-EXIT.
028700     GO TO CCVS1-EXIT.
028800 CLOSE-FILES.
028900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029000 TERMINATE-CCVS.
029100S    EXIT PROGRAM.
029200STERMINATE-CALL.
029300     STOP     RUN.
029400 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029500 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
029600 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
029700 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
029800     MOVE "****TEST DELETED****" TO RE-MARK.
029900 PRINT-DETAIL.
030000     IF REC-CT NOT EQUAL TO ZERO
030100             MOVE "." TO PARDOT-X
030200             MOVE REC-CT TO DOTVALUE.
030300     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030400     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030500        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
030600          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
030700     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
030800     MOVE SPACE TO CORRECT-X.
030900     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
031000     MOVE     SPACE TO RE-MARK.
031100 HEAD-ROUTINE.
031200     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031300     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031400     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031500     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031600 COLUMN-NAMES-ROUTINE.
031700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
032000 END-ROUTINE.
032100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
032200 END-RTN-EXIT.
032300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032400 END-ROUTINE-1.
032500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032600      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
032700      ADD PASS-COUNTER TO ERROR-HOLD.
032800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
032900      MOVE PASS-COUNTER TO CCVS-E-4-1.
033000      MOVE ERROR-HOLD TO CCVS-E-4-2.
033100      MOVE CCVS-E-4 TO CCVS-E-2-2.
033200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033300  END-ROUTINE-12.
033400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033500     IF       ERROR-COUNTER IS EQUAL TO ZERO
033600         MOVE "NO " TO ERROR-TOTAL
033700         ELSE
033800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
033900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
034000     PERFORM WRITE-LINE.
034100 END-ROUTINE-13.
034200     IF DELETE-COUNTER IS EQUAL TO ZERO
034300         MOVE "NO " TO ERROR-TOTAL  ELSE
034400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
034500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034700      IF   INSPECT-COUNTER EQUAL TO ZERO
034800          MOVE "NO " TO ERROR-TOTAL
034900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
035000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
035100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035300 WRITE-LINE.
035400     ADD 1 TO RECORD-COUNT.
035500Y    IF RECORD-COUNT GREATER 50
035600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
035700Y        MOVE SPACE TO DUMMY-RECORD
035800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
035900Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
036000Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
036100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
036200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036300Y        MOVE ZERO TO RECORD-COUNT.
036400     PERFORM WRT-LN.
036500 WRT-LN.
036600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
036700     MOVE SPACE TO DUMMY-RECORD.
036800 BLANK-LINE-PRINT.
036900     PERFORM WRT-LN.
037000 FAIL-ROUTINE.
037100     IF     COMPUTED-X NOT EQUAL TO SPACE
037200            GO TO   FAIL-ROUTINE-WRITE.
037300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037700     MOVE   SPACES TO INF-ANSI-REFERENCE.
037800     GO TO  FAIL-ROUTINE-EX.
037900 FAIL-ROUTINE-WRITE.
038000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
038100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
038200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038300     MOVE   SPACES TO COR-ANSI-REFERENCE.
038400 FAIL-ROUTINE-EX. EXIT.
038500 BAIL-OUT.
038600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038800 BAIL-OUT-WRITE.
038900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
039000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
039100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039200     MOVE   SPACES TO INF-ANSI-REFERENCE.
039300 BAIL-OUT-EX. EXIT.
039400 CCVS1-EXIT.
039500     EXIT.
039600 SECT-RL213A-001 SECTION.
039700 REL-INIT-001.
039800     MOVE   "EXTEND FILE RL-FS1" TO FEATURE.
039900     OPEN    EXTEND RL-FS1.
040000     MOVE     "RL-FS1" TO XFILE-NAME (1).
040100     MOVE     "R1-F-G" TO XRECORD-NAME (1).
040200     MOVE CCVS-PGM-ID  TO XPROGRAM-NAME (1).
040300     MOVE     000120   TO XRECORD-LENGTH (1).
040400     MOVE     "RC"     TO CHARS-OR-RECORDS (1).
040500     MOVE     0001     TO XBLOCK-SIZE (1).
040600     MOVE     000520   TO RECORDS-IN-FILE (1).
040700     MOVE     "RL"     TO XFILE-ORGANIZATION (1).
040800     MOVE     "S"      TO XLABEL-TYPE (1).
040900     MOVE     000501   TO XRECORD-NUMBER (1).
041000     GO TO REL-TEST-001.
041100 REL-DELETE-001.
041200     PERFORM DE-LETE.
041300     PERFORM PRINT-DETAIL.
041400     GO TO   CCVS-EXIT.
041500 REL-TEST-001.
041600     MOVE    FILE-RECORD-INFO-P1-120 (1) TO RL-FS1R1-F-G-120.
041700     WRITE   RL-FS1R1-F-G-120
041800             INVALID KEY GO TO REL-FAIL-001.
041900     IF      XRECORD-NUMBER (1) EQUAL TO 520
042000             GO TO REL-WRITE-001.
042100     ADD     000001 TO XRECORD-NUMBER (1).
042200     GO      TO REL-TEST-001.
042300 REL-FAIL-001.
042400     PERFORM FAIL.
042500     MOVE   "BOUNDARY VIOLATION"  TO RE-MARK.
042600 REL-WRITE-001.
042700     MOVE   "REL-TEST-001" TO   PAR-NAME
042800     MOVE   "FILE EXTENDED, LFILE"  TO COMPUTED-A.
042900     MOVE    XRECORD-NUMBER (1) TO CORRECT-18V0.
043000     PERFORM PRINT-DETAIL.
043100     CLOSE   RL-FS1.
043200*
043300 REL-INIT-002.
043400     OPEN    INPUT     RL-FS1.
043500     MOVE    ZERO      TO WRK-CS-09V00.
043600     GO TO   REL-TEST-002.
043700 REL-DELETE-002.
043800     PERFORM DE-LETE.
043900     PERFORM PRINT-DETAIL.
044000     GO TO   CCVS-EXIT.
044100 REL-TEST-002.
044200     READ    RL-FS1
044300             AT END GO TO REL-TEST-002-2.
044400     MOVE    RL-FS1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
044500     ADD     1 TO WRK-CS-09V00.
044600     IF      WRK-CS-09V00 GREATER 520
044700             MOVE "MORE THAN 520 RECORDS" TO RE-MARK
044800             GO TO REL-TEST-002-2.
044900 REL-TEST-002-1.
045000     MOVE   "REL-TEST-002-1" TO PAR-NAME.
045100     IF      XRECORD-NUMBER (1) NOT = WRK-CS-09V00
045200             MOVE   "INCORRECT RECORD NUMBER" TO RE-MARK
045300             MOVE    XRECORD-NUMBER (1) TO COMPUTED-N
045400             MOVE    WRK-CS-09V00       TO CORRECT-N
045500             PERFORM FAIL
045600             PERFORM PRINT-DETAIL
045700     ELSE
045800             PERFORM PASS.
045900*            PERFORM PRINT-DETAIL.
046000     GO      TO REL-TEST-002.
046100 REL-TEST-002-2.
046200     MOVE   "REL-TEST-002-2" TO PAR-NAME.
046300     IF      XRECORD-NUMBER (1) NOT EQUAL TO 520
046400             PERFORM FAIL
046500     ELSE
046600             PERFORM PASS.
046700 REL-WRITE-002.
046800     MOVE   "REL-TEST-002" TO PAR-NAME.
046900     MOVE   "FILE VERIFIED, LFILE" TO COMPUTED-A.
047000     MOVE    XRECORD-NUMBER (1) TO CORRECT-18V0.
047100     PERFORM PRINT-DETAIL.
047200     CLOSE   RL-FS1.
047300 CCVS-EXIT SECTION.
047400 CCVS-999999.
047500     GO TO CLOSE-FILES.
