000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SG103A.
000400 AUTHOR.
000500     FEDERAL COMPILER TESTING CENTER.
000600 INSTALLATION.
000700     GENERAL SERVICES ADMINISTRATION
000800     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.
000900     SOFTWARE DEVELOPMENT OFFICE.
001000     5203 LEESBURG PIKE  SUITE 1100
001100     FALLS CHURCH VIRGINIA 22041.
001200
001300     PHONE   (703) 756-6153
001400
001500     " HIGH       ".
001600 DATE-WRITTEN.
001700     CCVS-74 VERSION 4.0 - 1980 JULY 1.
001800     CREATION DATE     /    VALIDATION DATE
001900     "4.2 ".
002000 SECURITY.
002100     NONE.
002200       THE FOLLOWING FEATURES ARE TESTED BY THIS PROGRAM ---
002300         THE ALTER, PERFORM, AND GO TO STATEMENTS ARE USED
002400         TO CHECK INITIAL AND LAST-USED STATES.
002500
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.
002900     XXXXX082.
003000 OBJECT-COMPUTER.
003100     XXXXX083.
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT PRINT-FILE ASSIGN TO
003500     XXXXX055.
003600 DATA DIVISION.
003700 FILE SECTION.
003800 FD  PRINT-FILE
003900     LABEL RECORDS
004000     XXXXX084
004100     DATA RECORD IS PRINT-REC DUMMY-RECORD.
004200 01  PRINT-REC PICTURE X(120).
004300 01  DUMMY-RECORD PICTURE X(120).
004400 WORKING-STORAGE SECTION.
004500 77  ENT-COUNTER      PIC 9 VALUE ZERO.
004600 01  INITIAL-STATE-A PICTURE 9 VALUE 0.
004700 01  GO-TO-IND          PICTURE X           VALUE " ".
004800 01  PERFORM-RSLT.
004900     02 PERFORM-RSLT-1  PICTURE X           VALUE " ".
005000     02 PERFORM-RSLT-2  PICTURE X           VALUE " ".
005100     02 PERFORM-RSLT-3  PICTURE X           VALUE " ".
005200     02 PERFORM-RSLT-4  PICTURE X           VALUE " ".
005300 01  ALTER-RSLT.
005400     02 ALTER-RSLT-1    PICTURE X           VALUE " ".
005500     02 ALTER-RSLT-2    PICTURE X           VALUE " ".
005600     02 ALTER-RSLT-3    PICTURE X           VALUE " ".
005700 01  FALL-RSLT.
005800     02 FALL-RSLT-1     PICTURE X           VALUE " ".
005900     02 FALL-RSLT-2     PICTURE X           VALUE " ".
006000 01  TEST-RESULTS.
006100     02 FILLER                    PICTURE X VALUE SPACE.
006200     02 FEATURE                   PICTURE X(20) VALUE SPACE.
006300     02 FILLER                    PICTURE X VALUE SPACE.
006400     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
006500     02 FILLER                    PICTURE X  VALUE SPACE.
006600     02  PAR-NAME.
006700       03 FILLER PICTURE X(12) VALUE SPACE.
006800       03  PARDOT-X PICTURE X  VALUE SPACE.
006900       03 DOTVALUE PICTURE 99  VALUE ZERO.
007000       03 FILLER PIC X(5) VALUE SPACE.
007100     02 FILLER PIC X(10) VALUE SPACE.
007200     02 RE-MARK PIC X(61).
007300 01  TEST-COMPUTED.
007400     02 FILLER PIC X(30) VALUE SPACE.
007500     02 FILLER PIC X(17) VALUE "       COMPUTED=".
007600     02 COMPUTED-X.
007700     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
007800     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
007900     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
008000     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
008100     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
008200     03       CM-18V0 REDEFINES COMPUTED-A.
008300         04 COMPUTED-18V0                   PICTURE -9(18).
008400         04 FILLER                          PICTURE X.
008500     03 FILLER PIC X(50) VALUE SPACE.
008600 01  TEST-CORRECT.
008700     02 FILLER PIC X(30) VALUE SPACE.
008800     02 FILLER PIC X(17) VALUE "       CORRECT =".
008900     02 CORRECT-X.
009000     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
009100     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
009200     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
009300     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
009400     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
009500     03      CR-18V0 REDEFINES CORRECT-A.
009600         04 CORRECT-18V0                    PICTURE -9(18).
009700         04 FILLER                          PICTURE X.
009800     03 FILLER PIC X(50) VALUE SPACE.
009900 01  CCVS-C-1.
010000     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
010100-    "SS  PARAGRAPH-NAME
010200-    "        REMARKS".
010300     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
010400 01  CCVS-C-2.
010500     02 FILLER PICTURE IS X VALUE IS SPACE.
010600     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
010700     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
010800     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
010900     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
011000 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
011100 01  REC-CT PICTURE 99 VALUE ZERO.
011200 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
011300 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
011400 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
011500 01  PASS-COUNTER PIC 999 VALUE ZERO.
011600 01  TOTAL-ERROR PIC 999 VALUE ZERO.
011700 01  ERROR-HOLD PIC 999 VALUE ZERO.
011800 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
011900 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
012000 01  CCVS-H-1.
012100     02  FILLER   PICTURE X(27)  VALUE SPACE.
012200     02 FILLER PICTURE X(67) VALUE
012300     " FEDERAL COMPILER TESTING CENTER COBOL COMPILER VALIDATION
012400-    " SYSTEM".
012500     02  FILLER     PICTURE X(26)  VALUE SPACE.
012600 01  CCVS-H-2.
012700     02 FILLER PICTURE X(52) VALUE IS
012800     "CCVS74 NCC  COPY, NOT FOR DISTRIBUTION.".
012900     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
013000     02 TEST-ID PICTURE IS X(9).
013100     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
013200 01  CCVS-H-3.
013300     02  FILLER PICTURE X(34) VALUE
013400     " FOR OFFICIAL USE ONLY    ".
013500     02  FILLER PICTURE X(58) VALUE
013600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
013700     02  FILLER PICTURE X(28) VALUE
013800     "  COPYRIGHT   1974 ".
013900 01  CCVS-E-1.
014000     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
014100     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
014200     02 ID-AGAIN PICTURE IS X(9).
014300     02 FILLER PICTURE X(45) VALUE IS
014400     " NTIS DISTRIBUTION COBOL 74".
014500 01  CCVS-E-2.
014600     02  FILLER                   PICTURE X(31)  VALUE
014700     SPACE.
014800     02  FILLER                   PICTURE X(21)  VALUE SPACE.
014900     02 CCVS-E-2-2.
015000         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
015100         03 FILLER PICTURE IS X VALUE IS SPACE.
015200         03 ENDER-DESC PIC X(44) VALUE "ERRORS ENCOUNTERED".
015300 01  CCVS-E-3.
015400     02  FILLER PICTURE X(22) VALUE
015500     " FOR OFFICIAL USE ONLY".
015600     02  FILLER PICTURE X(12) VALUE SPACE.
015700     02  FILLER PICTURE X(58) VALUE
015800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
015900     02  FILLER PICTURE X(13) VALUE SPACE.
016000     02 FILLER PIC X(15) VALUE " COPYRIGHT 1974".
016100 01  CCVS-E-4.
016200     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
016300     02 FILLER PIC XXXX VALUE " OF ".
016400     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
016500     02 FILLER PIC X(40) VALUE
016600      "  TESTS WERE EXECUTED SUCCESSFULLY".
016700 01  XXINFO.
016800     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
016900     02 INFO-TEXT.
017000     04 FILLER PIC X(20) VALUE SPACE.
017100     04 XXCOMPUTED PIC X(20).
017200     04 FILLER PIC X(5) VALUE SPACE.
017300     04 XXCORRECT PIC X(20).
017400 01  HYPHEN-LINE.
017500     02 FILLER PICTURE IS X VALUE IS SPACE.
017600     02 FILLER PICTURE IS X(65) VALUE IS "************************
017700-    "*****************************************".
017800     02 FILLER PICTURE IS X(54) VALUE IS "************************
017900-    "******************************".
018000 01  CCVS-PGM-ID PIC X(6) VALUE
018100     "SG103A".
018200 PROCEDURE DIVISION.
018300 SEC00 SECTION.
018400 P0001.
018500     GO TO P0003.
018600 CCVS1 SECTION.
018700 OPEN-FILES.
018800     OPEN     OUTPUT PRINT-FILE.
018900     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
019000     MOVE    SPACE TO TEST-RESULTS.
019100     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
019200     GO TO CCVS1-EXIT.
019300 CLOSE-FILES.
019400     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
019500 TERMINATE-CCVS.
019600S    EXIT PROGRAM.
019700STERMINATE-CALL.
019800     STOP     RUN.
019900 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
020000 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
020100 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
020200 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
020300     MOVE "****TEST DELETED****" TO RE-MARK.
020400 PRINT-DETAIL.
020500     IF REC-CT NOT EQUAL TO ZERO
020600             MOVE "." TO PARDOT-X
020700             MOVE REC-CT TO DOTVALUE.
020800     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
020900     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
021000        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
021100          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
021200     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
021300     MOVE SPACE TO CORRECT-X.
021400     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
021500     MOVE     SPACE TO RE-MARK.
021600 HEAD-ROUTINE.
021700     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021800     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
021900     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022000 COLUMN-NAMES-ROUTINE.
022100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
022200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
022400 END-ROUTINE.
022500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
022600 END-RTN-EXIT.
022700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022800 END-ROUTINE-1.
022900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
023000      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
023100      ADD PASS-COUNTER TO ERROR-HOLD.
023200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
023300      MOVE PASS-COUNTER TO CCVS-E-4-1.
023400      MOVE ERROR-HOLD TO CCVS-E-4-2.
023500      MOVE CCVS-E-4 TO CCVS-E-2-2.
023600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
023700  END-ROUTINE-12.
023800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
023900     IF       ERROR-COUNTER IS EQUAL TO ZERO
024000         MOVE "NO " TO ERROR-TOTAL
024100         ELSE
024200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
024300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
024400     PERFORM WRITE-LINE.
024500 END-ROUTINE-13.
024600     IF DELETE-CNT IS EQUAL TO ZERO
024700         MOVE "NO " TO ERROR-TOTAL  ELSE
024800         MOVE DELETE-CNT TO ERROR-TOTAL.
024900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
025000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025100      IF   INSPECT-COUNTER EQUAL TO ZERO
025200          MOVE "NO " TO ERROR-TOTAL
025300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
025400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
025500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025700 WRITE-LINE.
025800     ADD 1 TO RECORD-COUNT.
025900Y    IF RECORD-COUNT GREATER 50
026000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
026100Y        MOVE SPACE TO DUMMY-RECORD
026200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
026300Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
026400Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
026500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
026600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
026700Y        MOVE ZERO TO RECORD-COUNT.
026800     PERFORM WRT-LN.
026900 WRT-LN.
027000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
027100     MOVE SPACE TO DUMMY-RECORD.
027200 BLANK-LINE-PRINT.
027300     PERFORM WRT-LN.
027400 FAIL-ROUTINE.
027500     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
027600     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
027700     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
027800     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027900     GO TO FAIL-ROUTINE-EX.
028000 FAIL-ROUTINE-WRITE.
028100     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
028200     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
028300 FAIL-ROUTINE-EX. EXIT.
028400 BAIL-OUT.
028500     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
028600     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
028700 BAIL-OUT-WRITE.
028800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
028900     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029000 BAIL-OUT-EX. EXIT.
029100 CCVS1-EXIT.
029200     EXIT.
029300 SECT-SG-03-001 SECTION  00.
029400 P0002.
029500     MOVE "D" TO PERFORM-RSLT-4.
029600 P0003.
029700     PERFORM  CCVS1.
029800 SEC20 SECTION 20.
029900 TEST-1.
030000     PERFORM SEC80.
030100*    NOTE THAT AN INDEPENDENT SEGMENT SHOULD BE MADE AVAILABLE TO
030200*         THE PROGRAM IN ITS INITIAL STATE EACH TIME IT IS
030300*         REFERENCED, AN ALTER STATEMENT WILL BE USED TO TEST THIS
030400*         FEATURE.
030500     PERFORM SEC80.
030600     IF INITIAL-STATE-A EQUAL TO 2 PERFORM PASS
030700         ELSE MOVE INITIAL-STATE-A TO COMPUTED-A
030800         MOVE "2" TO CORRECT-A
030900              PERFORM FAIL.
031000     GO TO TEST-1-WRITE.
031100 TEST-1-DELETE.
031200     PERFORM DE-LETE.
031300 TEST-1-WRITE.
031400     MOVE "INITIAL STATE" TO FEATURE.
031500     MOVE "TEST-1" TO PAR-NAME.
031600     PERFORM PRINT-DETAIL.
031700 TEST-2.
031800     MOVE SPACE TO CORRECT-A.
031900*    NOTE THAT A "GO TO"   A NON-RESIDENT ROUTINE WILL BE TESTED.
032000     GO TO P6001.
032100 GO-TO-RETURN.
032200     IF GO-TO-IND EQUAL TO "G" PERFORM PASS
032300         ELSE MOVE GO-TO-IND TO COMPUTED-A
032400         MOVE "G" TO CORRECT-A
032500              PERFORM FAIL.
032600     GO TO TEST-2-WRITE.
032700 TEST-2-DELETE.
032800     PERFORM DE-LETE.
032900 TEST-2-WRITE.
033000     MOVE "GO TO INDEP SEG" TO FEATURE.
033100     MOVE "TEST-2" TO PAR-NAME.
033200     PERFORM PRINT-DETAIL.
033300 TEST-3.
033400     MOVE SPACE TO CORRECT-A.
033500*    NOTE THAT THIS TEST PERFORMS A ROUTINE LOCATED IN AN
033600*             INDEPENDENT SEGMENT.
033700     PERFORM P9301 THRU P9303.
033800     IF PERFORM-RSLT EQUAL TO "ABCD" PERFORM PASS
033900         ELSE MOVE PERFORM-RSLT TO COMPUTED-A
034000         MOVE "ABCD" TO CORRECT-A
034100              PERFORM FAIL.
034200     GO TO TEST-3-WRITE.
034300 TEST-3-DELETE.
034400     PERFORM DE-LETE.
034500 TEST-3-WRITE.
034600     MOVE "PERFORM IND SEG" TO FEATURE.
034700     MOVE "TEST-3" TO PAR-NAME.
034800     PERFORM PRINT-DETAIL.
034900 TEST-4.
035000     MOVE SPACE TO CORRECT-A.
035100*    NOTE THAT THIS TEST CAUSES AN INDEPENDENT SEGMENT TO ALTER
035200*             A STATEMENT IN THE FIXED PORTION AND THEN CHECKS TO
035300*             SEE THAT THE ALTER IS IN EFFECT.
035400     PERFORM SEC95.
035500 ALTER-RES.
035600     GO TO ALTER-RES1.
035700 ALTER-RES1.
035800     MOVE "A" TO ALTER-RSLT-2.
035900     GO TO ALTER-RES3.
036000 ALTER-RES2.
036100     MOVE "B" TO ALTER-RSLT-3.
036200 ALTER-RES3.
036300     IF ALTER-RSLT EQUAL TO "E B" PERFORM PASS
036400         ELSE MOVE ALTER-RSLT TO COMPUTED-A
036500         MOVE "E B" TO CORRECT-A
036600         PERFORM FAIL.
036700     GO TO TEST-4-WRITE.
036800 TEST-4-DELETE.
036900     PERFORM DE-LETE.
037000 TEST-4-WRITE.
037100     MOVE "ALT RES FRM IND" TO FEATURE.
037200     MOVE "TEST-4" TO PAR-NAME.
037300     PERFORM PRINT-DETAIL.
037400 TEST-5.
037500     IF PAR-NAME EQUAL TO "TEST-6         "  GO TO P2006.
037600     MOVE "TEST-5" TO PAR-NAME.
037700*    NOTE THAT THIS TEST REQUIRES THE LOGICAL PATH OF THE PROGRAM
037800*             TO PROCEED FROM THE FIXED PORTION THROUGH AN
037900*             INDEPENDENT SEGMENT.
038000 P2005.
038100     MOVE "A" TO FALL-RSLT-1.
038200 P2006.  EXIT.
038300 SEC51 SECTION 51.
038400 P5101.
038500     IF PAR-NAME EQUAL TO "TEST-6         "  GO TO P5102.
038600     MOVE "B" TO FALL-RSLT-2.
038700     IF FALL-RSLT EQUAL TO "AB" PERFORM PASS
038800         ELSE MOVE FALL-RSLT TO COMPUTED-A
038900         MOVE "AB" TO CORRECT-A
039000              PERFORM FAIL.
039100     GO TO TEST-5-WRITE.
039200 TEST-5-DELETE.
039300     PERFORM DE-LETE.
039400 TEST-5-WRITE.
039500     MOVE "FALL THRU TEST" TO FEATURE.
039600     PERFORM PRINT-DETAIL.
039700     MOVE "TEST-6" TO PAR-NAME.
039800     GO TO TEST-5.
039900 P5102.   GO TO P5103.
040000 P5103.
040100     ALTER P5102 TO PROCEED TO P5104.
040200     MOVE SPACE TO FALL-RSLT.
040300     GO TO P5105.
040400 P5104.   MOVE "XX" TO FALL-RSLT.
040500 P5105.   EXIT.
040600 P5106.
040700     ADD 1 TO ENT-COUNTER.
040800     IF ENT-COUNTER EQUAL TO 2
040900         GO TO TEST-6.
041000     GO TO TEST-5.
041100 TEST-6.
041200     IF FALL-RSLT EQUAL TO SPACE
041300         PERFORM PASS
041400         GO TO TEST-6-WRITE.
041500     MOVE "SPACE" TO CORRECT-A.
041600     MOVE FALL-RSLT TO COMPUTED-A.
041700     PERFORM FAIL.
041800     GO TO TEST-6-WRITE.
041900 TEST-6-DELETE.
042000     PERFORM DE-LETE.
042100 TEST-6-WRITE.
042200     PERFORM PRINT-DETAIL.
042300     MOVE ZERO TO ENT-COUNTER.
042400     MOVE SPACE TO GO-TO-IND.
042500 TEST-7.
042600     GO TO P9901.
042700 PARA-7A.
042800     GO TO P9901.
042900 PARA-7B.
043000     IF GO-TO-IND EQUAL TO SPACE
043100         PERFORM PASS
043200         GO TO TEST-7-WRITE.
043300     MOVE "SPACE" TO CORRECT-A.
043400     MOVE GO-TO-IND TO COMPUTED-A.
043500     PERFORM FAIL.
043600     GO TO TEST-7-WRITE.
043700 TEST-7-DELETE.
043800     PERFORM DE-LETE.
043900 TEST-7-WRITE.
044000     MOVE "TEST-7" TO PAR-NAME.
044100     MOVE "GO TO ALTER IND" TO FEATURE.
044200     PERFORM PRINT-DETAIL.
044300 WRAP-UP.
044400     GO TO   CLOSE-FILES.
044500 SEC60 SECTION 60.
044600 P6001.
044700     MOVE "G" TO GO-TO-IND.
044800     GO TO GO-TO-RETURN.
044900 SEC80 SECTION 80.
045000 P8001.
045100     GO TO P8002.
045200 P8002.
045300     ALTER P8001 TO PROCEED TO P8003.
045400     ADD 1 TO INITIAL-STATE-A.
045500     GO TO P8004.
045600 P8003.
045700     MOVE 9 TO INITIAL-STATE-A.
045800 P8004.
045900     EXIT.
046000 SEC93 SECTION 93.
046100 P9301.
046200     MOVE "A" TO PERFORM-RSLT-1.
046300     PERFORM P9302.
046400     MOVE "C" TO PERFORM-RSLT-3.
046500     GO TO P9303.
046600 P9302.
046700     MOVE "B" TO PERFORM-RSLT-2.
046800 P9303.
046900     PERFORM P0002.
047000 SEC95 SECTION 95.
047100 P9501.
047200     MOVE "E" TO ALTER-RSLT-1.
047300     ALTER ALTER-RES TO PROCEED TO ALTER-RES2.
047400 SEC99 SECTION 99.
047500 P9901.
047600     GO TO P9902.
047700 P9902.
047800     ALTER P9901 TO P9903.
047900     IF ENT-COUNTER EQUAL TO ZERO
048000         ADD 1 TO ENT-COUNTER
048100         GO TO PARA-7A.
048200     GO TO PARA-7B.
048300 P9903.
048400     MOVE "X" TO GO-TO-IND.
048500     GO TO PARA-7B.
