000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SG101A.
000400 AUTHOR.
000500     FEDERAL COMPILER TESTING CENTER.
000600 INSTALLATION.
000700     GENERAL SERVICES ADMINISTRATION
000800     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.
000900     SOFTWARE DEVELOPMENT OFFICE.
001000     5203 LEESBURG PIKE  SUITE 1100
001100     FALLS CHURCH VIRGINIA 22041.
001200
001300     PHONE   (703) 756-6153
001400
001500     " HIGH       ".
001600 DATE-WRITTEN.
001700     CCVS-74 VERSION 4.0 - 1980 JULY 1.
001800     CREATION DATE     /    VALIDATION DATE
001900     "4.2 ".
002000 SECURITY.
002100     NONE.
002200       THE FOLLOWING FEATURES ARE TESTED BY THIS PROGRAM ---
002300         THE ABILITY OF THE COMPILER TO ACCEPT 100 SEGMENTS
002400         AND REFERENCE SEGMENTS GREATER THAN 49 IN THEIR INITIAL
002500         STATE WITH SEGMENTS LESS THAN 50 IN THEIR LAST-USED
002600         STATE
002700
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.
003100     XXXXX082.
003200 OBJECT-COMPUTER.
003300     XXXXX083.
003400 INPUT-OUTPUT SECTION.
003500 FILE-CONTROL.
003600     SELECT PRINT-FILE ASSIGN TO
003700     XXXXX055.
003800 DATA DIVISION.
003900 FILE SECTION.
004000 FD  PRINT-FILE
004100     LABEL RECORDS
004200     XXXXX084
004300     DATA RECORD IS PRINT-REC DUMMY-RECORD.
004400 01  PRINT-REC PICTURE X(120).
004500 01  DUMMY-RECORD PICTURE X(120).
004600 WORKING-STORAGE SECTION.
004700 77  TEST-CHECK                    PICTURE XXXX VALUE SPACE.
004800 01  TEST-RESULTS.
004900     02 FILLER                    PICTURE X VALUE SPACE.
005000     02 FEATURE                   PICTURE X(20) VALUE SPACE.
005100     02 FILLER                    PICTURE X VALUE SPACE.
005200     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
005300     02 FILLER                    PICTURE X  VALUE SPACE.
005400     02  PAR-NAME.
005500       03 FILLER PICTURE X(12) VALUE SPACE.
005600       03  PARDOT-X PICTURE X  VALUE SPACE.
005700       03 DOTVALUE PICTURE 99  VALUE ZERO.
005800       03 FILLER PIC X(5) VALUE SPACE.
005900     02 FILLER PIC X(10) VALUE SPACE.
006000     02 RE-MARK PIC X(61).
006100 01  TEST-COMPUTED.
006200     02 FILLER PIC X(30) VALUE SPACE.
006300     02 FILLER PIC X(17) VALUE "       COMPUTED=".
006400     02 COMPUTED-X.
006500     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
006600     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
006700     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
006800     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
006900     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
007000     03       CM-18V0 REDEFINES COMPUTED-A.
007100         04 COMPUTED-18V0                   PICTURE -9(18).
007200         04 FILLER                          PICTURE X.
007300     03 FILLER PIC X(50) VALUE SPACE.
007400 01  TEST-CORRECT.
007500     02 FILLER PIC X(30) VALUE SPACE.
007600     02 FILLER PIC X(17) VALUE "       CORRECT =".
007700     02 CORRECT-X.
007800     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
007900     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
008000     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
008100     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
008200     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
008300     03      CR-18V0 REDEFINES CORRECT-A.
008400         04 CORRECT-18V0                    PICTURE -9(18).
008500         04 FILLER                          PICTURE X.
008600     03 FILLER PIC X(50) VALUE SPACE.
008700 01  CCVS-C-1.
008800     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
008900-    "SS  PARAGRAPH-NAME
009000-    "        REMARKS".
009100     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
009200 01  CCVS-C-2.
009300     02 FILLER PICTURE IS X VALUE IS SPACE.
009400     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
009500     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
009600     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
009700     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
009800 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
009900 01  REC-CT PICTURE 99 VALUE ZERO.
010000 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
010100 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
010200 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
010300 01  PASS-COUNTER PIC 999 VALUE ZERO.
010400 01  TOTAL-ERROR PIC 999 VALUE ZERO.
010500 01  ERROR-HOLD PIC 999 VALUE ZERO.
010600 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
010700 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
010800 01  CCVS-H-1.
010900     02  FILLER   PICTURE X(27)  VALUE SPACE.
011000     02 FILLER PICTURE X(67) VALUE
011100     " FEDERAL COMPILER TESTING CENTER COBOL COMPILER VALIDATION
011200-    " SYSTEM".
011300     02  FILLER     PICTURE X(26)  VALUE SPACE.
011400 01  CCVS-H-2.
011500     02 FILLER PICTURE X(52) VALUE IS
011600     "CCVS74 NCC  COPY, NOT FOR DISTRIBUTION.".
011700     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
011800     02 TEST-ID PICTURE IS X(9).
011900     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
012000 01  CCVS-H-3.
012100     02  FILLER PICTURE X(34) VALUE
012200     " FOR OFFICIAL USE ONLY    ".
012300     02  FILLER PICTURE X(58) VALUE
012400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
012500     02  FILLER PICTURE X(28) VALUE
012600     "  COPYRIGHT   1974 ".
012700 01  CCVS-E-1.
012800     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
012900     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
013000     02 ID-AGAIN PICTURE IS X(9).
013100     02 FILLER PICTURE X(45) VALUE IS
013200     " NTIS DISTRIBUTION COBOL 74".
013300 01  CCVS-E-2.
013400     02  FILLER                   PICTURE X(31)  VALUE
013500     SPACE.
013600     02  FILLER                   PICTURE X(21)  VALUE SPACE.
013700     02 CCVS-E-2-2.
013800         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
013900         03 FILLER PICTURE IS X VALUE IS SPACE.
014000         03 ENDER-DESC PIC X(44) VALUE "ERRORS ENCOUNTERED".
014100 01  CCVS-E-3.
014200     02  FILLER PICTURE X(22) VALUE
014300     " FOR OFFICIAL USE ONLY".
014400     02  FILLER PICTURE X(12) VALUE SPACE.
014500     02  FILLER PICTURE X(58) VALUE
014600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014700     02  FILLER PICTURE X(13) VALUE SPACE.
014800     02 FILLER PIC X(15) VALUE " COPYRIGHT 1974".
014900 01  CCVS-E-4.
015000     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
015100     02 FILLER PIC XXXX VALUE " OF ".
015200     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
015300     02 FILLER PIC X(40) VALUE
015400      "  TESTS WERE EXECUTED SUCCESSFULLY".
015500 01  XXINFO.
015600     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
015700     02 INFO-TEXT.
015800     04 FILLER PIC X(20) VALUE SPACE.
015900     04 XXCOMPUTED PIC X(20).
016000     04 FILLER PIC X(5) VALUE SPACE.
016100     04 XXCORRECT PIC X(20).
016200 01  HYPHEN-LINE.
016300     02 FILLER PICTURE IS X VALUE IS SPACE.
016400     02 FILLER PICTURE IS X(65) VALUE IS "************************
016500-    "*****************************************".
016600     02 FILLER PICTURE IS X(54) VALUE IS "************************
016700-    "******************************".
016800 01  CCVS-PGM-ID PIC X(6) VALUE
016900     "SG101A".
017000 PROCEDURE DIVISION.
017100 CCVS1 SECTION.
017200 OPEN-FILES.
017300     OPEN     OUTPUT PRINT-FILE.
017400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
017500     MOVE    SPACE TO TEST-RESULTS.
017600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
017700     GO TO CCVS1-EXIT.
017800 CLOSE-FILES.
017900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
018000 TERMINATE-CCVS.
018100S    EXIT PROGRAM.
018200STERMINATE-CALL.
018300     STOP     RUN.
018400 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
018500 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
018600 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
018700 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
018800     MOVE "****TEST DELETED****" TO RE-MARK.
018900 PRINT-DETAIL.
019000     IF REC-CT NOT EQUAL TO ZERO
019100             MOVE "." TO PARDOT-X
019200             MOVE REC-CT TO DOTVALUE.
019300     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
019400     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
019500        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
019600          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
019700     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
019800     MOVE SPACE TO CORRECT-X.
019900     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
020000     MOVE     SPACE TO RE-MARK.
020100 HEAD-ROUTINE.
020200     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
020300     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
020400     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
020500 COLUMN-NAMES-ROUTINE.
020600     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
020700     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
020800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
020900 END-ROUTINE.
021000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
021100 END-RTN-EXIT.
021200     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
021300 END-ROUTINE-1.
021400      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
021500      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
021600      ADD PASS-COUNTER TO ERROR-HOLD.
021700*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
021800      MOVE PASS-COUNTER TO CCVS-E-4-1.
021900      MOVE ERROR-HOLD TO CCVS-E-4-2.
022000      MOVE CCVS-E-4 TO CCVS-E-2-2.
022100      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
022200  END-ROUTINE-12.
022300      MOVE "TEST(S) FAILED" TO ENDER-DESC.
022400     IF       ERROR-COUNTER IS EQUAL TO ZERO
022500         MOVE "NO " TO ERROR-TOTAL
022600         ELSE
022700         MOVE ERROR-COUNTER TO ERROR-TOTAL.
022800     MOVE     CCVS-E-2 TO DUMMY-RECORD.
022900     PERFORM WRITE-LINE.
023000 END-ROUTINE-13.
023100     IF DELETE-CNT IS EQUAL TO ZERO
023200         MOVE "NO " TO ERROR-TOTAL  ELSE
023300         MOVE DELETE-CNT TO ERROR-TOTAL.
023400     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
023500     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023600      IF   INSPECT-COUNTER EQUAL TO ZERO
023700          MOVE "NO " TO ERROR-TOTAL
023800      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
023900      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
024000      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024100     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
024200 WRITE-LINE.
024300     ADD 1 TO RECORD-COUNT.
024400Y    IF RECORD-COUNT GREATER 50
024500Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
024600Y        MOVE SPACE TO DUMMY-RECORD
024700Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
024800Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
024900Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
025000Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
025100Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
025200Y        MOVE ZERO TO RECORD-COUNT.
025300     PERFORM WRT-LN.
025400 WRT-LN.
025500     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
025600     MOVE SPACE TO DUMMY-RECORD.
025700 BLANK-LINE-PRINT.
025800     PERFORM WRT-LN.
025900 FAIL-ROUTINE.
026000     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
026100     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
026200     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
026300     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026400     GO TO FAIL-ROUTINE-EX.
026500 FAIL-ROUTINE-WRITE.
026600     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
026700     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
026800 FAIL-ROUTINE-EX. EXIT.
026900 BAIL-OUT.
027000     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
027100     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
027200 BAIL-OUT-WRITE.
027300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
027400     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027500 BAIL-OUT-EX. EXIT.
027600 CCVS1-EXIT.
027700     EXIT.
027800 SECT-SG-01-001 SECTION 00.
027900 SG-01-001.
028000     MOVE "SEGMENTATION" TO FEATURE.
028100     GO TO SEG-TEST-1.
028200 00  SECTION 00.
028300 PARA-00.
028400     MOVE "GOOD" TO TEST-CHECK.
028500 RUN-THE-TESTS SECTION.
028600 SEG-TEST-1.
028700     MOVE SPACE TO TEST-CHECK.
028800     PERFORM 00.
028900     IF TEST-CHECK EQUAL TO "GOOD"
029000         PERFORM PASS
029100         GO TO SEG-WRITE-1.
029200     MOVE SPACE TO COMPUTED-A.
029300     MOVE "GOOD" TO CORRECT-A.
029400     PERFORM FAIL.
029500     GO TO SEG-WRITE-1.
029600 SEG-DELETE-1.
029700     PERFORM DE-LETE.
029800 SEG-WRITE-1.
029900     MOVE "SEG-TEST-1  " TO PAR-NAME.
030000     PERFORM PRINT-DETAIL.
030100 SEG-TEST-2.
030200     MOVE SPACE TO TEST-CHECK.
030300     PERFORM 01.
030400     IF TEST-CHECK EQUAL TO "GOOD"
030500         PERFORM PASS
030600         GO TO SEG-WRITE-2.
030700     MOVE SPACE TO COMPUTED-A.
030800     MOVE "GOOD" TO CORRECT-A.
030900     PERFORM FAIL.
031000     GO TO SEG-WRITE-2.
031100 SEG-DELETE-2.
031200     PERFORM DE-LETE.
031300 SEG-WRITE-2.
031400     MOVE "SEG-TEST-2  " TO PAR-NAME.
031500     PERFORM PRINT-DETAIL.
031600 SEG-TEST-3.
031700     MOVE SPACE TO TEST-CHECK.
031800     PERFORM 02.
031900     IF TEST-CHECK EQUAL TO "GOOD"
032000         PERFORM PASS
032100         GO TO SEG-WRITE-3.
032200     MOVE SPACE TO COMPUTED-A.
032300     MOVE "GOOD" TO CORRECT-A.
032400     PERFORM FAIL.
032500     GO TO SEG-WRITE-3.
032600 SEG-DELETE-3.
032700     PERFORM DE-LETE.
032800 SEG-WRITE-3.
032900     MOVE "SEG-TEST-3  " TO PAR-NAME.
033000     PERFORM PRINT-DETAIL.
033100 SEG-TEST-4.
033200     MOVE SPACE TO TEST-CHECK.
033300     PERFORM 03.
033400     IF TEST-CHECK EQUAL TO "GOOD"
033500         PERFORM PASS
033600         GO TO SEG-WRITE-4.
033700     MOVE SPACE TO COMPUTED-A.
033800     MOVE "GOOD" TO CORRECT-A.
033900     PERFORM FAIL.
034000     GO TO SEG-WRITE-4.
034100 SEG-DELETE-4.
034200     PERFORM DE-LETE.
034300 SEG-WRITE-4.
034400     MOVE "SEG-TEST-4  " TO PAR-NAME.
034500     PERFORM PRINT-DETAIL.
034600 SEG-TEST-5.
034700     MOVE SPACE TO TEST-CHECK.
034800     PERFORM 04.
034900     IF TEST-CHECK EQUAL TO "GOOD"
035000         PERFORM PASS
035100         GO TO SEG-WRITE-5.
035200     MOVE SPACE TO COMPUTED-A.
035300     MOVE "GOOD" TO CORRECT-A.
035400     PERFORM FAIL.
035500     GO TO SEG-WRITE-5.
035600 SEG-DELETE-5.
035700     PERFORM DE-LETE.
035800 SEG-WRITE-5.
035900     MOVE "SEG-TEST-5  " TO PAR-NAME.
036000     PERFORM PRINT-DETAIL.
036100 SEG-TEST-6.
036200     MOVE SPACE TO TEST-CHECK.
036300     PERFORM 05.
036400     IF TEST-CHECK EQUAL TO "GOOD"
036500         PERFORM PASS
036600         GO TO SEG-WRITE-6.
036700     MOVE SPACE TO COMPUTED-A.
036800     MOVE "GOOD" TO CORRECT-A.
036900     PERFORM FAIL.
037000     GO TO SEG-WRITE-6.
037100 SEG-DELETE-6.
037200     PERFORM DE-LETE.
037300 SEG-WRITE-6.
037400     MOVE "SEG-TEST-6  " TO PAR-NAME.
037500     PERFORM PRINT-DETAIL.
037600 SEG-TEST-7.
037700     MOVE SPACE TO TEST-CHECK.
037800     PERFORM 06.
037900     IF TEST-CHECK EQUAL TO "GOOD"
038000         PERFORM PASS
038100         GO TO SEG-WRITE-7.
038200     MOVE SPACE TO COMPUTED-A.
038300     MOVE "GOOD" TO CORRECT-A.
038400     PERFORM FAIL.
038500     GO TO SEG-WRITE-7.
038600 SEG-DELETE-7.
038700     PERFORM DE-LETE.
038800 SEG-WRITE-7.
038900     MOVE "SEG-TEST-7  " TO PAR-NAME.
039000     PERFORM PRINT-DETAIL.
039100 SEG-TEST-8.
039200     MOVE SPACE TO TEST-CHECK.
039300     PERFORM 07.
039400     IF TEST-CHECK EQUAL TO "GOOD"
039500         PERFORM PASS
039600         GO TO SEG-WRITE-8.
039700     MOVE SPACE TO COMPUTED-A.
039800     MOVE "GOOD" TO CORRECT-A.
039900     PERFORM FAIL.
040000     GO TO SEG-WRITE-8.
040100 SEG-DELETE-8.
040200     PERFORM DE-LETE.
040300 SEG-WRITE-8.
040400     MOVE "SEG-TEST-8  " TO PAR-NAME.
040500     PERFORM PRINT-DETAIL.
040600 SEG-TEST-9.
040700     MOVE SPACE TO TEST-CHECK.
040800     PERFORM 08.
040900     IF TEST-CHECK EQUAL TO "GOOD"
041000         PERFORM PASS
041100         GO TO SEG-WRITE-9.
041200     MOVE SPACE TO COMPUTED-A.
041300     MOVE "GOOD" TO CORRECT-A.
041400     PERFORM FAIL.
041500     GO TO SEG-WRITE-9.
041600 SEG-DELETE-9.
041700     PERFORM DE-LETE.
041800 SEG-WRITE-9.
041900     MOVE "SEG-TEST-9  " TO PAR-NAME.
042000     PERFORM PRINT-DETAIL.
042100 SEG-TEST-10.
042200     MOVE SPACE TO TEST-CHECK.
042300     PERFORM 09.
042400     IF TEST-CHECK EQUAL TO "GOOD"
042500         PERFORM PASS
042600         GO TO SEG-WRITE-10.
042700     MOVE SPACE TO COMPUTED-A.
042800     MOVE "GOOD" TO CORRECT-A.
042900     PERFORM FAIL.
043000     GO TO SEG-WRITE-10.
043100 SEG-DELETE-10.
043200     PERFORM DE-LETE.
043300 SEG-WRITE-10.
043400     MOVE "SEG-TEST-10 " TO PAR-NAME.
043500     PERFORM PRINT-DETAIL.
043600 SEG-TEST-11.
043700     MOVE SPACE TO TEST-CHECK.
043800     PERFORM 10.
043900     IF TEST-CHECK EQUAL TO "GOOD"
044000         PERFORM PASS
044100         GO TO SEG-WRITE-11.
044200     MOVE SPACE TO COMPUTED-A.
044300     MOVE "GOOD" TO CORRECT-A.
044400     PERFORM FAIL.
044500     GO TO SEG-WRITE-11.
044600 SEG-DELETE-11.
044700     PERFORM DE-LETE.
044800 SEG-WRITE-11.
044900     MOVE "SEG-TEST-11 " TO PAR-NAME.
045000     PERFORM PRINT-DETAIL.
045100 SEG-TEST-12.
045200     MOVE SPACE TO TEST-CHECK.
045300     PERFORM 11.
045400     IF TEST-CHECK EQUAL TO "GOOD"
045500         PERFORM PASS
045600         GO TO SEG-WRITE-12.
045700     MOVE SPACE TO COMPUTED-A.
045800     MOVE "GOOD" TO CORRECT-A.
045900     PERFORM FAIL.
046000     GO TO SEG-WRITE-12.
046100 SEG-DELETE-12.
046200     PERFORM DE-LETE.
046300 SEG-WRITE-12.
046400     MOVE "SEG-TEST-12 " TO PAR-NAME.
046500     PERFORM PRINT-DETAIL.
046600 SEG-TEST-13.
046700     MOVE SPACE TO TEST-CHECK.
046800     PERFORM 12.
046900     IF TEST-CHECK EQUAL TO "GOOD"
047000         PERFORM PASS
047100         GO TO SEG-WRITE-13.
047200     MOVE SPACE TO COMPUTED-A.
047300     MOVE "GOOD" TO CORRECT-A.
047400     PERFORM FAIL.
047500     GO TO SEG-WRITE-13.
047600 SEG-DELETE-13.
047700     PERFORM DE-LETE.
047800 SEG-WRITE-13.
047900     MOVE "SEG-TEST-13 " TO PAR-NAME.
048000     PERFORM PRINT-DETAIL.
048100 SEG-TEST-14.
048200     MOVE SPACE TO TEST-CHECK.
048300     PERFORM 13.
048400     IF TEST-CHECK EQUAL TO "GOOD"
048500         PERFORM PASS
048600         GO TO SEG-WRITE-14.
048700     MOVE SPACE TO COMPUTED-A.
048800     MOVE "GOOD" TO CORRECT-A.
048900     PERFORM FAIL.
049000     GO TO SEG-WRITE-14.
049100 SEG-DELETE-14.
049200     PERFORM DE-LETE.
049300 SEG-WRITE-14.
049400     MOVE "SEG-TEST-14 " TO PAR-NAME.
049500     PERFORM PRINT-DETAIL.
049600 SEG-TEST-15.
049700     MOVE SPACE TO TEST-CHECK.
049800     PERFORM 14.
049900     IF TEST-CHECK EQUAL TO "GOOD"
050000         PERFORM PASS
050100         GO TO SEG-WRITE-15.
050200     MOVE SPACE TO COMPUTED-A.
050300     MOVE "GOOD" TO CORRECT-A.
050400     PERFORM FAIL.
050500     GO TO SEG-WRITE-15.
050600 SEG-DELETE-15.
050700     PERFORM DE-LETE.
050800 SEG-WRITE-15.
050900     MOVE "SEG-TEST-15 " TO PAR-NAME.
051000     PERFORM PRINT-DETAIL.
051100 SEG-TEST-16.
051200     MOVE SPACE TO TEST-CHECK.
051300     PERFORM 15.
051400     IF TEST-CHECK EQUAL TO "GOOD"
051500         PERFORM PASS
051600         GO TO SEG-WRITE-16.
051700     MOVE SPACE TO COMPUTED-A.
051800     MOVE "GOOD" TO CORRECT-A.
051900     PERFORM FAIL.
052000     GO TO SEG-WRITE-16.
052100 SEG-DELETE-16.
052200     PERFORM DE-LETE.
052300 SEG-WRITE-16.
052400     MOVE "SEG-TEST-16 " TO PAR-NAME.
052500     PERFORM PRINT-DETAIL.
052600 SEG-TEST-17.
052700     MOVE SPACE TO TEST-CHECK.
052800     PERFORM 16.
052900     IF TEST-CHECK EQUAL TO "GOOD"
053000         PERFORM PASS
053100         GO TO SEG-WRITE-17.
053200     MOVE SPACE TO COMPUTED-A.
053300     MOVE "GOOD" TO CORRECT-A.
053400     PERFORM FAIL.
053500     GO TO SEG-WRITE-17.
053600 SEG-DELETE-17.
053700     PERFORM DE-LETE.
053800 SEG-WRITE-17.
053900     MOVE "SEG-TEST-17 " TO PAR-NAME.
054000     PERFORM PRINT-DETAIL.
054100 SEG-TEST-18.
054200     MOVE SPACE TO TEST-CHECK.
054300     PERFORM 17.
054400     IF TEST-CHECK EQUAL TO "GOOD"
054500         PERFORM PASS
054600         GO TO SEG-WRITE-18.
054700     MOVE SPACE TO COMPUTED-A.
054800     MOVE "GOOD" TO CORRECT-A.
054900     PERFORM FAIL.
055000     GO TO SEG-WRITE-18.
055100 SEG-DELETE-18.
055200     PERFORM DE-LETE.
055300 SEG-WRITE-18.
055400     MOVE "SEG-TEST-18 " TO PAR-NAME.
055500     PERFORM PRINT-DETAIL.
055600 SEG-TEST-19.
055700     MOVE SPACE TO TEST-CHECK.
055800     PERFORM 18.
055900     IF TEST-CHECK EQUAL TO "GOOD"
056000         PERFORM PASS
056100         GO TO SEG-WRITE-19.
056200     MOVE SPACE TO COMPUTED-A.
056300     MOVE "GOOD" TO CORRECT-A.
056400     PERFORM FAIL.
056500     GO TO SEG-WRITE-19.
056600 SEG-DELETE-19.
056700     PERFORM DE-LETE.
056800 SEG-WRITE-19.
056900     MOVE "SEG-TEST-19 " TO PAR-NAME.
057000     PERFORM PRINT-DETAIL.
057100 SEG-TEST-20.
057200     MOVE SPACE TO TEST-CHECK.
057300     PERFORM 19.
057400     IF TEST-CHECK EQUAL TO "GOOD"
057500         PERFORM PASS
057600         GO TO SEG-WRITE-20.
057700     MOVE SPACE TO COMPUTED-A.
057800     MOVE "GOOD" TO CORRECT-A.
057900     PERFORM FAIL.
058000     GO TO SEG-WRITE-20.
058100 SEG-DELETE-20.
058200     PERFORM DE-LETE.
058300 SEG-WRITE-20.
058400     MOVE "SEG-TEST-20 " TO PAR-NAME.
058500     PERFORM PRINT-DETAIL.
058600 SEG-TEST-21.
058700     MOVE SPACE TO TEST-CHECK.
058800     PERFORM 20.
058900     IF TEST-CHECK EQUAL TO "GOOD"
059000         PERFORM PASS
059100         GO TO SEG-WRITE-21.
059200     MOVE SPACE TO COMPUTED-A.
059300     MOVE "GOOD" TO CORRECT-A.
059400     PERFORM FAIL.
059500     GO TO SEG-WRITE-21.
059600 SEG-DELETE-21.
059700     PERFORM DE-LETE.
059800 SEG-WRITE-21.
059900     MOVE "SEG-TEST-21 " TO PAR-NAME.
060000     PERFORM PRINT-DETAIL.
060100 SEG-TEST-22.
060200     MOVE SPACE TO TEST-CHECK.
060300     PERFORM 21.
060400     IF TEST-CHECK EQUAL TO "GOOD"
060500         PERFORM PASS
060600         GO TO SEG-WRITE-22.
060700     MOVE SPACE TO COMPUTED-A.
060800     MOVE "GOOD" TO CORRECT-A.
060900     PERFORM FAIL.
061000     GO TO SEG-WRITE-22.
061100 SEG-DELETE-22.
061200     PERFORM DE-LETE.
061300 SEG-WRITE-22.
061400     MOVE "SEG-TEST-22 " TO PAR-NAME.
061500     PERFORM PRINT-DETAIL.
061600 SEG-TEST-23.
061700     MOVE SPACE TO TEST-CHECK.
061800     PERFORM 22.
061900     IF TEST-CHECK EQUAL TO "GOOD"
062000         PERFORM PASS
062100         GO TO SEG-WRITE-23.
062200     MOVE SPACE TO COMPUTED-A.
062300     MOVE "GOOD" TO CORRECT-A.
062400     PERFORM FAIL.
062500     GO TO SEG-WRITE-23.
062600 SEG-DELETE-23.
062700     PERFORM DE-LETE.
062800 SEG-WRITE-23.
062900     MOVE "SEG-TEST-23 " TO PAR-NAME.
063000     PERFORM PRINT-DETAIL.
063100 SEG-TEST-24.
063200     MOVE SPACE TO TEST-CHECK.
063300     PERFORM 23.
063400     IF TEST-CHECK EQUAL TO "GOOD"
063500         PERFORM PASS
063600         GO TO SEG-WRITE-24.
063700     MOVE SPACE TO COMPUTED-A.
063800     MOVE "GOOD" TO CORRECT-A.
063900     PERFORM FAIL.
064000     GO TO SEG-WRITE-24.
064100 SEG-DELETE-24.
064200     PERFORM DE-LETE.
064300 SEG-WRITE-24.
064400     MOVE "SEG-TEST-24 " TO PAR-NAME.
064500     PERFORM PRINT-DETAIL.
064600 SEG-TEST-25.
064700     MOVE SPACE TO TEST-CHECK.
064800     PERFORM 24.
064900     IF TEST-CHECK EQUAL TO "GOOD"
065000         PERFORM PASS
065100         GO TO SEG-WRITE-25.
065200     MOVE SPACE TO COMPUTED-A.
065300     MOVE "GOOD" TO CORRECT-A.
065400     PERFORM FAIL.
065500     GO TO SEG-WRITE-25.
065600 SEG-DELETE-25.
065700     PERFORM DE-LETE.
065800 SEG-WRITE-25.
065900     MOVE "SEG-TEST-25 " TO PAR-NAME.
066000     PERFORM PRINT-DETAIL.
066100 SEG-TEST-26.
066200     MOVE SPACE TO TEST-CHECK.
066300     PERFORM 25.
066400     IF TEST-CHECK EQUAL TO "GOOD"
066500         PERFORM PASS
066600         GO TO SEG-WRITE-26.
066700     MOVE SPACE TO COMPUTED-A.
066800     MOVE "GOOD" TO CORRECT-A.
066900     PERFORM FAIL.
067000     GO TO SEG-WRITE-26.
067100 SEG-DELETE-26.
067200     PERFORM DE-LETE.
067300 SEG-WRITE-26.
067400     MOVE "SEG-TEST-26 " TO PAR-NAME.
067500     PERFORM PRINT-DETAIL.
067600 SEG-TEST-27.
067700     MOVE SPACE TO TEST-CHECK.
067800     PERFORM 26.
067900     IF TEST-CHECK EQUAL TO "GOOD"
068000         PERFORM PASS
068100         GO TO SEG-WRITE-27.
068200     MOVE SPACE TO COMPUTED-A.
068300     MOVE "GOOD" TO CORRECT-A.
068400     PERFORM FAIL.
068500     GO TO SEG-WRITE-27.
068600 SEG-DELETE-27.
068700     PERFORM DE-LETE.
068800 SEG-WRITE-27.
068900     MOVE "SEG-TEST-27 " TO PAR-NAME.
069000     PERFORM PRINT-DETAIL.
069100 SEG-TEST-28.
069200     MOVE SPACE TO TEST-CHECK.
069300     PERFORM 27.
069400     IF TEST-CHECK EQUAL TO "GOOD"
069500         PERFORM PASS
069600         GO TO SEG-WRITE-28.
069700     MOVE SPACE TO COMPUTED-A.
069800     MOVE "GOOD" TO CORRECT-A.
069900     PERFORM FAIL.
070000     GO TO SEG-WRITE-28.
070100 SEG-DELETE-28.
070200     PERFORM DE-LETE.
070300 SEG-WRITE-28.
070400     MOVE "SEG-TEST-28 " TO PAR-NAME.
070500     PERFORM PRINT-DETAIL.
070600 SEG-TEST-29.
070700     MOVE SPACE TO TEST-CHECK.
070800     PERFORM 28.
070900     IF TEST-CHECK EQUAL TO "GOOD"
071000         PERFORM PASS
071100         GO TO SEG-WRITE-29.
071200     MOVE SPACE TO COMPUTED-A.
071300     MOVE "GOOD" TO CORRECT-A.
071400     PERFORM FAIL.
071500     GO TO SEG-WRITE-29.
071600 SEG-DELETE-29.
071700     PERFORM DE-LETE.
071800 SEG-WRITE-29.
071900     MOVE "SEG-TEST-29 " TO PAR-NAME.
072000     PERFORM PRINT-DETAIL.
072100 SEG-TEST-30.
072200     MOVE SPACE TO TEST-CHECK.
072300     PERFORM 29.
072400     IF TEST-CHECK EQUAL TO "GOOD"
072500         PERFORM PASS
072600         GO TO SEG-WRITE-30.
072700     MOVE SPACE TO COMPUTED-A.
072800     MOVE "GOOD" TO CORRECT-A.
072900     PERFORM FAIL.
073000     GO TO SEG-WRITE-30.
073100 SEG-DELETE-30.
073200     PERFORM DE-LETE.
073300 SEG-WRITE-30.
073400     MOVE "SEG-TEST-30 " TO PAR-NAME.
073500     PERFORM PRINT-DETAIL.
073600 SEG-TEST-31.
073700     MOVE SPACE TO TEST-CHECK.
073800     PERFORM 30.
073900     IF TEST-CHECK EQUAL TO "GOOD"
074000         PERFORM PASS
074100         GO TO SEG-WRITE-31.
074200     MOVE SPACE TO COMPUTED-A.
074300     MOVE "GOOD" TO CORRECT-A.
074400     PERFORM FAIL.
074500     GO TO SEG-WRITE-31.
074600 SEG-DELETE-31.
074700     PERFORM DE-LETE.
074800 SEG-WRITE-31.
074900     MOVE "SEG-TEST-31 " TO PAR-NAME.
075000     PERFORM PRINT-DETAIL.
075100 SEG-TEST-32.
075200     MOVE SPACE TO TEST-CHECK.
075300     PERFORM 31.
075400     IF TEST-CHECK EQUAL TO "GOOD"
075500         PERFORM PASS
075600         GO TO SEG-WRITE-32.
075700     MOVE SPACE TO COMPUTED-A.
075800     MOVE "GOOD" TO CORRECT-A.
075900     PERFORM FAIL.
076000     GO TO SEG-WRITE-32.
076100 SEG-DELETE-32.
076200     PERFORM DE-LETE.
076300 SEG-WRITE-32.
076400     MOVE "SEG-TEST-32 " TO PAR-NAME.
076500     PERFORM PRINT-DETAIL.
076600 SEG-TEST-33.
076700     MOVE SPACE TO TEST-CHECK.
076800     PERFORM 32.
076900     IF TEST-CHECK EQUAL TO "GOOD"
077000         PERFORM PASS
077100         GO TO SEG-WRITE-33.
077200     MOVE SPACE TO COMPUTED-A.
077300     MOVE "GOOD" TO CORRECT-A.
077400     PERFORM FAIL.
077500     GO TO SEG-WRITE-33.
077600 SEG-DELETE-33.
077700     PERFORM DE-LETE.
077800 SEG-WRITE-33.
077900     MOVE "SEG-TEST-33 " TO PAR-NAME.
078000     PERFORM PRINT-DETAIL.
078100 SEG-TEST-34.
078200     MOVE SPACE TO TEST-CHECK.
078300     PERFORM 33.
078400     IF TEST-CHECK EQUAL TO "GOOD"
078500         PERFORM PASS
078600         GO TO SEG-WRITE-34.
078700     MOVE SPACE TO COMPUTED-A.
078800     MOVE "GOOD" TO CORRECT-A.
078900     PERFORM FAIL.
079000     GO TO SEG-WRITE-34.
079100 SEG-DELETE-34.
079200     PERFORM DE-LETE.
079300 SEG-WRITE-34.
079400     MOVE "SEG-TEST-34 " TO PAR-NAME.
079500     PERFORM PRINT-DETAIL.
079600 SEG-TEST-35.
079700     MOVE SPACE TO TEST-CHECK.
079800     PERFORM 34.
079900     IF TEST-CHECK EQUAL TO "GOOD"
080000         PERFORM PASS
080100         GO TO SEG-WRITE-35.
080200     MOVE SPACE TO COMPUTED-A.
080300     MOVE "GOOD" TO CORRECT-A.
080400     PERFORM FAIL.
080500     GO TO SEG-WRITE-35.
080600 SEG-DELETE-35.
080700     PERFORM DE-LETE.
080800 SEG-WRITE-35.
080900     MOVE "SEG-TEST-35 " TO PAR-NAME.
081000     PERFORM PRINT-DETAIL.
081100 SEG-TEST-36.
081200     MOVE SPACE TO TEST-CHECK.
081300     PERFORM 35.
081400     IF TEST-CHECK EQUAL TO "GOOD"
081500         PERFORM PASS
081600         GO TO SEG-WRITE-36.
081700     MOVE SPACE TO COMPUTED-A.
081800     MOVE "GOOD" TO CORRECT-A.
081900     PERFORM FAIL.
082000     GO TO SEG-WRITE-36.
082100 SEG-DELETE-36.
082200     PERFORM DE-LETE.
082300 SEG-WRITE-36.
082400     MOVE "SEG-TEST-36 " TO PAR-NAME.
082500     PERFORM PRINT-DETAIL.
082600 SEG-TEST-37.
082700     MOVE SPACE TO TEST-CHECK.
082800     PERFORM 36.
082900     IF TEST-CHECK EQUAL TO "GOOD"
083000         PERFORM PASS
083100         GO TO SEG-WRITE-37.
083200     MOVE SPACE TO COMPUTED-A.
083300     MOVE "GOOD" TO CORRECT-A.
083400     PERFORM FAIL.
083500     GO TO SEG-WRITE-37.
083600 SEG-DELETE-37.
083700     PERFORM DE-LETE.
083800 SEG-WRITE-37.
083900     MOVE "SEG-TEST-37 " TO PAR-NAME.
084000     PERFORM PRINT-DETAIL.
084100 SEG-TEST-38.
084200     MOVE SPACE TO TEST-CHECK.
084300     PERFORM 37.
084400     IF TEST-CHECK EQUAL TO "GOOD"
084500         PERFORM PASS
084600         GO TO SEG-WRITE-38.
084700     MOVE SPACE TO COMPUTED-A.
084800     MOVE "GOOD" TO CORRECT-A.
084900     PERFORM FAIL.
085000     GO TO SEG-WRITE-38.
085100 SEG-DELETE-38.
085200     PERFORM DE-LETE.
085300 SEG-WRITE-38.
085400     MOVE "SEG-TEST-38 " TO PAR-NAME.
085500     PERFORM PRINT-DETAIL.
085600 SEG-TEST-39.
085700     MOVE SPACE TO TEST-CHECK.
085800     PERFORM 38.
085900     IF TEST-CHECK EQUAL TO "GOOD"
086000         PERFORM PASS
086100         GO TO SEG-WRITE-39.
086200     MOVE SPACE TO COMPUTED-A.
086300     MOVE "GOOD" TO CORRECT-A.
086400     PERFORM FAIL.
086500     GO TO SEG-WRITE-39.
086600 SEG-DELETE-39.
086700     PERFORM DE-LETE.
086800 SEG-WRITE-39.
086900     MOVE "SEG-TEST-39 " TO PAR-NAME.
087000     PERFORM PRINT-DETAIL.
087100 SEG-TEST-40.
087200     MOVE SPACE TO TEST-CHECK.
087300     PERFORM 39.
087400     IF TEST-CHECK EQUAL TO "GOOD"
087500         PERFORM PASS
087600         GO TO SEG-WRITE-40.
087700     MOVE SPACE TO COMPUTED-A.
087800     MOVE "GOOD" TO CORRECT-A.
087900     PERFORM FAIL.
088000     GO TO SEG-WRITE-40.
088100 SEG-DELETE-40.
088200     PERFORM DE-LETE.
088300 SEG-WRITE-40.
088400     MOVE "SEG-TEST-40 " TO PAR-NAME.
088500     PERFORM PRINT-DETAIL.
088600 SEG-TEST-41.
088700     MOVE SPACE TO TEST-CHECK.
088800     PERFORM 40.
088900     IF TEST-CHECK EQUAL TO "GOOD"
089000         PERFORM PASS
089100         GO TO SEG-WRITE-41.
089200     MOVE SPACE TO COMPUTED-A.
089300     MOVE "GOOD" TO CORRECT-A.
089400     PERFORM FAIL.
089500     GO TO SEG-WRITE-41.
089600 SEG-DELETE-41.
089700     PERFORM DE-LETE.
089800 SEG-WRITE-41.
089900     MOVE "SEG-TEST-41 " TO PAR-NAME.
090000     PERFORM PRINT-DETAIL.
090100 SEG-TEST-42.
090200     MOVE SPACE TO TEST-CHECK.
090300     PERFORM 41.
090400     IF TEST-CHECK EQUAL TO "GOOD"
090500         PERFORM PASS
090600         GO TO SEG-WRITE-42.
090700     MOVE SPACE TO COMPUTED-A.
090800     MOVE "GOOD" TO CORRECT-A.
090900     PERFORM FAIL.
091000     GO TO SEG-WRITE-42.
091100 SEG-DELETE-42.
091200     PERFORM DE-LETE.
091300 SEG-WRITE-42.
091400     MOVE "SEG-TEST-42 " TO PAR-NAME.
091500     PERFORM PRINT-DETAIL.
091600 SEG-TEST-43.
091700     MOVE SPACE TO TEST-CHECK.
091800     PERFORM 42.
091900     IF TEST-CHECK EQUAL TO "GOOD"
092000         PERFORM PASS
092100         GO TO SEG-WRITE-43.
092200     MOVE SPACE TO COMPUTED-A.
092300     MOVE "GOOD" TO CORRECT-A.
092400     PERFORM FAIL.
092500     GO TO SEG-WRITE-43.
092600 SEG-DELETE-43.
092700     PERFORM DE-LETE.
092800 SEG-WRITE-43.
092900     MOVE "SEG-TEST-43 " TO PAR-NAME.
093000     PERFORM PRINT-DETAIL.
093100 SEG-TEST-44.
093200     MOVE SPACE TO TEST-CHECK.
093300     PERFORM 43.
093400     IF TEST-CHECK EQUAL TO "GOOD"
093500         PERFORM PASS
093600         GO TO SEG-WRITE-44.
093700     MOVE SPACE TO COMPUTED-A.
093800     MOVE "GOOD" TO CORRECT-A.
093900     PERFORM FAIL.
094000     GO TO SEG-WRITE-44.
094100 SEG-DELETE-44.
094200     PERFORM DE-LETE.
094300 SEG-WRITE-44.
094400     MOVE "SEG-TEST-44 " TO PAR-NAME.
094500     PERFORM PRINT-DETAIL.
094600 SEG-TEST-45.
094700     MOVE SPACE TO TEST-CHECK.
094800     PERFORM 44.
094900     IF TEST-CHECK EQUAL TO "GOOD"
095000         PERFORM PASS
095100         GO TO SEG-WRITE-45.
095200     MOVE SPACE TO COMPUTED-A.
095300     MOVE "GOOD" TO CORRECT-A.
095400     PERFORM FAIL.
095500     GO TO SEG-WRITE-45.
095600 SEG-DELETE-45.
095700     PERFORM DE-LETE.
095800 SEG-WRITE-45.
095900     MOVE "SEG-TEST-45 " TO PAR-NAME.
096000     PERFORM PRINT-DETAIL.
096100 SEG-TEST-46.
096200     MOVE SPACE TO TEST-CHECK.
096300     PERFORM 45.
096400     IF TEST-CHECK EQUAL TO "GOOD"
096500         PERFORM PASS
096600         GO TO SEG-WRITE-46.
096700     MOVE SPACE TO COMPUTED-A.
096800     MOVE "GOOD" TO CORRECT-A.
096900     PERFORM FAIL.
097000     GO TO SEG-WRITE-46.
097100 SEG-DELETE-46.
097200     PERFORM DE-LETE.
097300 SEG-WRITE-46.
097400     MOVE "SEG-TEST-46 " TO PAR-NAME.
097500     PERFORM PRINT-DETAIL.
097600 SEG-TEST-47.
097700     MOVE SPACE TO TEST-CHECK.
097800     PERFORM 46.
097900     IF TEST-CHECK EQUAL TO "GOOD"
098000         PERFORM PASS
098100         GO TO SEG-WRITE-47.
098200     MOVE SPACE TO COMPUTED-A.
098300     MOVE "GOOD" TO CORRECT-A.
098400     PERFORM FAIL.
098500     GO TO SEG-WRITE-47.
098600 SEG-DELETE-47.
098700     PERFORM DE-LETE.
098800 SEG-WRITE-47.
098900     MOVE "SEG-TEST-47 " TO PAR-NAME.
099000     PERFORM PRINT-DETAIL.
099100 SEG-TEST-48.
099200     MOVE SPACE TO TEST-CHECK.
099300     PERFORM 47.
099400     IF TEST-CHECK EQUAL TO "GOOD"
099500         PERFORM PASS
099600         GO TO SEG-WRITE-48.
099700     MOVE SPACE TO COMPUTED-A.
099800     MOVE "GOOD" TO CORRECT-A.
099900     PERFORM FAIL.
100000     GO TO SEG-WRITE-48.
100100 SEG-DELETE-48.
100200     PERFORM DE-LETE.
100300 SEG-WRITE-48.
100400     MOVE "SEG-TEST-48 " TO PAR-NAME.
100500     PERFORM PRINT-DETAIL.
100600 SEG-TEST-49.
100700     MOVE SPACE TO TEST-CHECK.
100800     PERFORM 48.
100900     IF TEST-CHECK EQUAL TO "GOOD"
101000         PERFORM PASS
101100         GO TO SEG-WRITE-49.
101200     MOVE SPACE TO COMPUTED-A.
101300     MOVE "GOOD" TO CORRECT-A.
101400     PERFORM FAIL.
101500     GO TO SEG-WRITE-49.
101600 SEG-DELETE-49.
101700     PERFORM DE-LETE.
101800 SEG-WRITE-49.
101900     MOVE "SEG-TEST-49 " TO PAR-NAME.
102000     PERFORM PRINT-DETAIL.
102100 SEG-TEST-50.
102200     MOVE SPACE TO TEST-CHECK.
102300     PERFORM 49.
102400     IF TEST-CHECK EQUAL TO "GOOD"
102500         PERFORM PASS
102600         GO TO SEG-WRITE-50.
102700     MOVE SPACE TO COMPUTED-A.
102800     MOVE "GOOD" TO CORRECT-A.
102900     PERFORM FAIL.
103000     GO TO SEG-WRITE-50.
103100 SEG-DELETE-50.
103200     PERFORM DE-LETE.
103300 SEG-WRITE-50.
103400     MOVE "SEG-TEST-50 " TO PAR-NAME.
103500     PERFORM PRINT-DETAIL.
103600 SEG-TEST-51.
103700     MOVE SPACE TO TEST-CHECK.
103800     PERFORM 50.
103900     IF TEST-CHECK EQUAL TO "GOOD"
104000         PERFORM PASS
104100         GO TO SEG-WRITE-51.
104200     MOVE SPACE TO COMPUTED-A.
104300     MOVE "GOOD" TO CORRECT-A.
104400     PERFORM FAIL.
104500     GO TO SEG-WRITE-51.
104600 SEG-DELETE-51.
104700     PERFORM DE-LETE.
104800 SEG-WRITE-51.
104900     MOVE "SEG-TEST-51 " TO PAR-NAME.
105000     PERFORM PRINT-DETAIL.
105100 SEG-TEST-52.
105200     MOVE SPACE TO TEST-CHECK.
105300     PERFORM 51.
105400     IF TEST-CHECK EQUAL TO "GOOD"
105500         PERFORM PASS
105600         GO TO SEG-WRITE-52.
105700     MOVE SPACE TO COMPUTED-A.
105800     MOVE "GOOD" TO CORRECT-A.
105900     PERFORM FAIL.
106000     GO TO SEG-WRITE-52.
106100 SEG-DELETE-52.
106200     PERFORM DE-LETE.
106300 SEG-WRITE-52.
106400     MOVE "SEG-TEST-52 " TO PAR-NAME.
106500     PERFORM PRINT-DETAIL.
106600 SEG-TEST-53.
106700     MOVE SPACE TO TEST-CHECK.
106800     PERFORM 52.
106900     IF TEST-CHECK EQUAL TO "GOOD"
107000         PERFORM PASS
107100         GO TO SEG-WRITE-53.
107200     MOVE SPACE TO COMPUTED-A.
107300     MOVE "GOOD" TO CORRECT-A.
107400     PERFORM FAIL.
107500     GO TO SEG-WRITE-53.
107600 SEG-DELETE-53.
107700     PERFORM DE-LETE.
107800 SEG-WRITE-53.
107900     MOVE "SEG-TEST-53 " TO PAR-NAME.
108000     PERFORM PRINT-DETAIL.
108100 SEG-TEST-54.
108200     MOVE SPACE TO TEST-CHECK.
108300     PERFORM 53.
108400     IF TEST-CHECK EQUAL TO "GOOD"
108500         PERFORM PASS
108600         GO TO SEG-WRITE-54.
108700     MOVE SPACE TO COMPUTED-A.
108800     MOVE "GOOD" TO CORRECT-A.
108900     PERFORM FAIL.
109000     GO TO SEG-WRITE-54.
109100 SEG-DELETE-54.
109200     PERFORM DE-LETE.
109300 SEG-WRITE-54.
109400     MOVE "SEG-TEST-54 " TO PAR-NAME.
109500     PERFORM PRINT-DETAIL.
109600 SEG-TEST-55.
109700     MOVE SPACE TO TEST-CHECK.
109800     PERFORM 54.
109900     IF TEST-CHECK EQUAL TO "GOOD"
110000         PERFORM PASS
110100         GO TO SEG-WRITE-55.
110200     MOVE SPACE TO COMPUTED-A.
110300     MOVE "GOOD" TO CORRECT-A.
110400     PERFORM FAIL.
110500     GO TO SEG-WRITE-55.
110600 SEG-DELETE-55.
110700     PERFORM DE-LETE.
110800 SEG-WRITE-55.
110900     MOVE "SEG-TEST-55 " TO PAR-NAME.
111000     PERFORM PRINT-DETAIL.
111100 SEG-TEST-56.
111200     MOVE SPACE TO TEST-CHECK.
111300     PERFORM 55.
111400     IF TEST-CHECK EQUAL TO "GOOD"
111500         PERFORM PASS
111600         GO TO SEG-WRITE-56.
111700     MOVE SPACE TO COMPUTED-A.
111800     MOVE "GOOD" TO CORRECT-A.
111900     PERFORM FAIL.
112000     GO TO SEG-WRITE-56.
112100 SEG-DELETE-56.
112200     PERFORM DE-LETE.
112300 SEG-WRITE-56.
112400     MOVE "SEG-TEST-56 " TO PAR-NAME.
112500     PERFORM PRINT-DETAIL.
112600 SEG-TEST-57.
112700     MOVE SPACE TO TEST-CHECK.
112800     PERFORM 56.
112900     IF TEST-CHECK EQUAL TO "GOOD"
113000         PERFORM PASS
113100         GO TO SEG-WRITE-57.
113200     MOVE SPACE TO COMPUTED-A.
113300     MOVE "GOOD" TO CORRECT-A.
113400     PERFORM FAIL.
113500     GO TO SEG-WRITE-57.
113600 SEG-DELETE-57.
113700     PERFORM DE-LETE.
113800 SEG-WRITE-57.
113900     MOVE "SEG-TEST-57 " TO PAR-NAME.
114000     PERFORM PRINT-DETAIL.
114100 SEG-TEST-58.
114200     MOVE SPACE TO TEST-CHECK.
114300     PERFORM 57.
114400     IF TEST-CHECK EQUAL TO "GOOD"
114500         PERFORM PASS
114600         GO TO SEG-WRITE-58.
114700     MOVE SPACE TO COMPUTED-A.
114800     MOVE "GOOD" TO CORRECT-A.
114900     PERFORM FAIL.
115000     GO TO SEG-WRITE-58.
115100 SEG-DELETE-58.
115200     PERFORM DE-LETE.
115300 SEG-WRITE-58.
115400     MOVE "SEG-TEST-58 " TO PAR-NAME.
115500     PERFORM PRINT-DETAIL.
115600 SEG-TEST-59.
115700     MOVE SPACE TO TEST-CHECK.
115800     PERFORM 58.
115900     IF TEST-CHECK EQUAL TO "GOOD"
116000         PERFORM PASS
116100         GO TO SEG-WRITE-59.
116200     MOVE SPACE TO COMPUTED-A.
116300     MOVE "GOOD" TO CORRECT-A.
116400     PERFORM FAIL.
116500     GO TO SEG-WRITE-59.
116600 SEG-DELETE-59.
116700     PERFORM DE-LETE.
116800 SEG-WRITE-59.
116900     MOVE "SEG-TEST-59 " TO PAR-NAME.
117000     PERFORM PRINT-DETAIL.
117100 SEG-TEST-60.
117200     MOVE SPACE TO TEST-CHECK.
117300     PERFORM 59.
117400     IF TEST-CHECK EQUAL TO "GOOD"
117500         PERFORM PASS
117600         GO TO SEG-WRITE-60.
117700     MOVE SPACE TO COMPUTED-A.
117800     MOVE "GOOD" TO CORRECT-A.
117900     PERFORM FAIL.
118000     GO TO SEG-WRITE-60.
118100 SEG-DELETE-60.
118200     PERFORM DE-LETE.
118300 SEG-WRITE-60.
118400     MOVE "SEG-TEST-60 " TO PAR-NAME.
118500     PERFORM PRINT-DETAIL.
118600 SEG-TEST-61.
118700     MOVE SPACE TO TEST-CHECK.
118800     PERFORM 60.
118900     IF TEST-CHECK EQUAL TO "GOOD"
119000         PERFORM PASS
119100         GO TO SEG-WRITE-61.
119200     MOVE SPACE TO COMPUTED-A.
119300     MOVE "GOOD" TO CORRECT-A.
119400     PERFORM FAIL.
119500     GO TO SEG-WRITE-61.
119600 SEG-DELETE-61.
119700     PERFORM DE-LETE.
119800 SEG-WRITE-61.
119900     MOVE "SEG-TEST-61 " TO PAR-NAME.
120000     PERFORM PRINT-DETAIL.
120100 SEG-TEST-62.
120200     MOVE SPACE TO TEST-CHECK.
120300     PERFORM 61.
120400     IF TEST-CHECK EQUAL TO "GOOD"
120500         PERFORM PASS
120600         GO TO SEG-WRITE-62.
120700     MOVE SPACE TO COMPUTED-A.
120800     MOVE "GOOD" TO CORRECT-A.
120900     PERFORM FAIL.
121000     GO TO SEG-WRITE-62.
121100 SEG-DELETE-62.
121200     PERFORM DE-LETE.
121300 SEG-WRITE-62.
121400     MOVE "SEG-TEST-62 " TO PAR-NAME.
121500     PERFORM PRINT-DETAIL.
121600 SEG-TEST-63.
121700     MOVE SPACE TO TEST-CHECK.
121800     PERFORM 62.
121900     IF TEST-CHECK EQUAL TO "GOOD"
122000         PERFORM PASS
122100         GO TO SEG-WRITE-63.
122200     MOVE SPACE TO COMPUTED-A.
122300     MOVE "GOOD" TO CORRECT-A.
122400     PERFORM FAIL.
122500     GO TO SEG-WRITE-63.
122600 SEG-DELETE-63.
122700     PERFORM DE-LETE.
122800 SEG-WRITE-63.
122900     MOVE "SEG-TEST-63 " TO PAR-NAME.
123000     PERFORM PRINT-DETAIL.
123100 SEG-TEST-64.
123200     MOVE SPACE TO TEST-CHECK.
123300     PERFORM 63.
123400     IF TEST-CHECK EQUAL TO "GOOD"
123500         PERFORM PASS
123600         GO TO SEG-WRITE-64.
123700     MOVE SPACE TO COMPUTED-A.
123800     MOVE "GOOD" TO CORRECT-A.
123900     PERFORM FAIL.
124000     GO TO SEG-WRITE-64.
124100 SEG-DELETE-64.
124200     PERFORM DE-LETE.
124300 SEG-WRITE-64.
124400     MOVE "SEG-TEST-64 " TO PAR-NAME.
124500     PERFORM PRINT-DETAIL.
124600 SEG-TEST-65.
124700     MOVE SPACE TO TEST-CHECK.
124800     PERFORM 64.
124900     IF TEST-CHECK EQUAL TO "GOOD"
125000         PERFORM PASS
125100         GO TO SEG-WRITE-65.
125200     MOVE SPACE TO COMPUTED-A.
125300     MOVE "GOOD" TO CORRECT-A.
125400     PERFORM FAIL.
125500     GO TO SEG-WRITE-65.
125600 SEG-DELETE-65.
125700     PERFORM DE-LETE.
125800 SEG-WRITE-65.
125900     MOVE "SEG-TEST-65 " TO PAR-NAME.
126000     PERFORM PRINT-DETAIL.
126100 SEG-TEST-66.
126200     MOVE SPACE TO TEST-CHECK.
126300     PERFORM 65.
126400     IF TEST-CHECK EQUAL TO "GOOD"
126500         PERFORM PASS
126600         GO TO SEG-WRITE-66.
126700     MOVE SPACE TO COMPUTED-A.
126800     MOVE "GOOD" TO CORRECT-A.
126900     PERFORM FAIL.
127000     GO TO SEG-WRITE-66.
127100 SEG-DELETE-66.
127200     PERFORM DE-LETE.
127300 SEG-WRITE-66.
127400     MOVE "SEG-TEST-66 " TO PAR-NAME.
127500     PERFORM PRINT-DETAIL.
127600 SEG-TEST-67.
127700     MOVE SPACE TO TEST-CHECK.
127800     PERFORM 66.
127900     IF TEST-CHECK EQUAL TO "GOOD"
128000         PERFORM PASS
128100         GO TO SEG-WRITE-67.
128200     MOVE SPACE TO COMPUTED-A.
128300     MOVE "GOOD" TO CORRECT-A.
128400     PERFORM FAIL.
128500     GO TO SEG-WRITE-67.
128600 SEG-DELETE-67.
128700     PERFORM DE-LETE.
128800 SEG-WRITE-67.
128900     MOVE "SEG-TEST-67 " TO PAR-NAME.
129000     PERFORM PRINT-DETAIL.
129100 SEG-TEST-68.
129200     MOVE SPACE TO TEST-CHECK.
129300     PERFORM 67.
129400     IF TEST-CHECK EQUAL TO "GOOD"
129500         PERFORM PASS
129600         GO TO SEG-WRITE-68.
129700     MOVE SPACE TO COMPUTED-A.
129800     MOVE "GOOD" TO CORRECT-A.
129900     PERFORM FAIL.
130000     GO TO SEG-WRITE-68.
130100 SEG-DELETE-68.
130200     PERFORM DE-LETE.
130300 SEG-WRITE-68.
130400     MOVE "SEG-TEST-68 " TO PAR-NAME.
130500     PERFORM PRINT-DETAIL.
130600 SEG-TEST-69.
130700     MOVE SPACE TO TEST-CHECK.
130800     PERFORM 68.
130900     IF TEST-CHECK EQUAL TO "GOOD"
131000         PERFORM PASS
131100         GO TO SEG-WRITE-69.
131200     MOVE SPACE TO COMPUTED-A.
131300     MOVE "GOOD" TO CORRECT-A.
131400     PERFORM FAIL.
131500     GO TO SEG-WRITE-69.
131600 SEG-DELETE-69.
131700     PERFORM DE-LETE.
131800 SEG-WRITE-69.
131900     MOVE "SEG-TEST-69 " TO PAR-NAME.
132000     PERFORM PRINT-DETAIL.
132100 SEG-TEST-70.
132200     MOVE SPACE TO TEST-CHECK.
132300     PERFORM 69.
132400     IF TEST-CHECK EQUAL TO "GOOD"
132500         PERFORM PASS
132600         GO TO SEG-WRITE-70.
132700     MOVE SPACE TO COMPUTED-A.
132800     MOVE "GOOD" TO CORRECT-A.
132900     PERFORM FAIL.
133000     GO TO SEG-WRITE-70.
133100 SEG-DELETE-70.
133200     PERFORM DE-LETE.
133300 SEG-WRITE-70.
133400     MOVE "SEG-TEST-70 " TO PAR-NAME.
133500     PERFORM PRINT-DETAIL.
133600 SEG-TEST-71.
133700     MOVE SPACE TO TEST-CHECK.
133800     PERFORM 70.
133900     IF TEST-CHECK EQUAL TO "GOOD"
134000         PERFORM PASS
134100         GO TO SEG-WRITE-71.
134200     MOVE SPACE TO COMPUTED-A.
134300     MOVE "GOOD" TO CORRECT-A.
134400     PERFORM FAIL.
134500     GO TO SEG-WRITE-71.
134600 SEG-DELETE-71.
134700     PERFORM DE-LETE.
134800 SEG-WRITE-71.
134900     MOVE "SEG-TEST-71 " TO PAR-NAME.
135000     PERFORM PRINT-DETAIL.
135100 SEG-TEST-72.
135200     MOVE SPACE TO TEST-CHECK.
135300     PERFORM 71.
135400     IF TEST-CHECK EQUAL TO "GOOD"
135500         PERFORM PASS
135600         GO TO SEG-WRITE-72.
135700     MOVE SPACE TO COMPUTED-A.
135800     MOVE "GOOD" TO CORRECT-A.
135900     PERFORM FAIL.
136000     GO TO SEG-WRITE-72.
136100 SEG-DELETE-72.
136200     PERFORM DE-LETE.
136300 SEG-WRITE-72.
136400     MOVE "SEG-TEST-72 " TO PAR-NAME.
136500     PERFORM PRINT-DETAIL.
136600 SEG-TEST-73.
136700     MOVE SPACE TO TEST-CHECK.
136800     PERFORM 72.
136900     IF TEST-CHECK EQUAL TO "GOOD"
137000         PERFORM PASS
137100         GO TO SEG-WRITE-73.
137200     MOVE SPACE TO COMPUTED-A.
137300     MOVE "GOOD" TO CORRECT-A.
137400     PERFORM FAIL.
137500     GO TO SEG-WRITE-73.
137600 SEG-DELETE-73.
137700     PERFORM DE-LETE.
137800 SEG-WRITE-73.
137900     MOVE "SEG-TEST-73 " TO PAR-NAME.
138000     PERFORM PRINT-DETAIL.
138100 SEG-TEST-74.
138200     MOVE SPACE TO TEST-CHECK.
138300     PERFORM 73.
138400     IF TEST-CHECK EQUAL TO "GOOD"
138500         PERFORM PASS
138600         GO TO SEG-WRITE-74.
138700     MOVE SPACE TO COMPUTED-A.
138800     MOVE "GOOD" TO CORRECT-A.
138900     PERFORM FAIL.
139000     GO TO SEG-WRITE-74.
139100 SEG-DELETE-74.
139200     PERFORM DE-LETE.
139300 SEG-WRITE-74.
139400     MOVE "SEG-TEST-74 " TO PAR-NAME.
139500     PERFORM PRINT-DETAIL.
139600 SEG-TEST-75.
139700     MOVE SPACE TO TEST-CHECK.
139800     PERFORM 74.
139900     IF TEST-CHECK EQUAL TO "GOOD"
140000         PERFORM PASS
140100         GO TO SEG-WRITE-75.
140200     MOVE SPACE TO COMPUTED-A.
140300     MOVE "GOOD" TO CORRECT-A.
140400     PERFORM FAIL.
140500     GO TO SEG-WRITE-75.
140600 SEG-DELETE-75.
140700     PERFORM DE-LETE.
140800 SEG-WRITE-75.
140900     MOVE "SEG-TEST-75 " TO PAR-NAME.
141000     PERFORM PRINT-DETAIL.
141100 SEG-TEST-76.
141200     MOVE SPACE TO TEST-CHECK.
141300     PERFORM 75.
141400     IF TEST-CHECK EQUAL TO "GOOD"
141500         PERFORM PASS
141600         GO TO SEG-WRITE-76.
141700     MOVE SPACE TO COMPUTED-A.
141800     MOVE "GOOD" TO CORRECT-A.
141900     PERFORM FAIL.
142000     GO TO SEG-WRITE-76.
142100 SEG-DELETE-76.
142200     PERFORM DE-LETE.
142300 SEG-WRITE-76.
142400     MOVE "SEG-TEST-76 " TO PAR-NAME.
142500     PERFORM PRINT-DETAIL.
142600 SEG-TEST-77.
142700     MOVE SPACE TO TEST-CHECK.
142800     PERFORM 76.
142900     IF TEST-CHECK EQUAL TO "GOOD"
143000         PERFORM PASS
143100         GO TO SEG-WRITE-77.
143200     MOVE SPACE TO COMPUTED-A.
143300     MOVE "GOOD" TO CORRECT-A.
143400     PERFORM FAIL.
143500     GO TO SEG-WRITE-77.
143600 SEG-DELETE-77.
143700     PERFORM DE-LETE.
143800 SEG-WRITE-77.
143900     MOVE "SEG-TEST-77 " TO PAR-NAME.
144000     PERFORM PRINT-DETAIL.
144100 SEG-TEST-78.
144200     MOVE SPACE TO TEST-CHECK.
144300     PERFORM 77.
144400     IF TEST-CHECK EQUAL TO "GOOD"
144500         PERFORM PASS
144600         GO TO SEG-WRITE-78.
144700     MOVE SPACE TO COMPUTED-A.
144800     MOVE "GOOD" TO CORRECT-A.
144900     PERFORM FAIL.
145000     GO TO SEG-WRITE-78.
145100 SEG-DELETE-78.
145200     PERFORM DE-LETE.
145300 SEG-WRITE-78.
145400     MOVE "SEG-TEST-78 " TO PAR-NAME.
145500     PERFORM PRINT-DETAIL.
145600 SEG-TEST-79.
145700     MOVE SPACE TO TEST-CHECK.
145800     PERFORM 78.
145900     IF TEST-CHECK EQUAL TO "GOOD"
146000         PERFORM PASS
146100         GO TO SEG-WRITE-79.
146200     MOVE SPACE TO COMPUTED-A.
146300     MOVE "GOOD" TO CORRECT-A.
146400     PERFORM FAIL.
146500     GO TO SEG-WRITE-79.
146600 SEG-DELETE-79.
146700     PERFORM DE-LETE.
146800 SEG-WRITE-79.
146900     MOVE "SEG-TEST-79 " TO PAR-NAME.
147000     PERFORM PRINT-DETAIL.
147100 SEG-TEST-80.
147200     MOVE SPACE TO TEST-CHECK.
147300     PERFORM 79.
147400     IF TEST-CHECK EQUAL TO "GOOD"
147500         PERFORM PASS
147600         GO TO SEG-WRITE-80.
147700     MOVE SPACE TO COMPUTED-A.
147800     MOVE "GOOD" TO CORRECT-A.
147900     PERFORM FAIL.
148000     GO TO SEG-WRITE-80.
148100 SEG-DELETE-80.
148200     PERFORM DE-LETE.
148300 SEG-WRITE-80.
148400     MOVE "SEG-TEST-80 " TO PAR-NAME.
148500     PERFORM PRINT-DETAIL.
148600 SEG-TEST-81.
148700     MOVE SPACE TO TEST-CHECK.
148800     PERFORM 80.
148900     IF TEST-CHECK EQUAL TO "GOOD"
149000         PERFORM PASS
149100         GO TO SEG-WRITE-81.
149200     MOVE SPACE TO COMPUTED-A.
149300     MOVE "GOOD" TO CORRECT-A.
149400     PERFORM FAIL.
149500     GO TO SEG-WRITE-81.
149600 SEG-DELETE-81.
149700     PERFORM DE-LETE.
149800 SEG-WRITE-81.
149900     MOVE "SEG-TEST-81 " TO PAR-NAME.
150000     PERFORM PRINT-DETAIL.
150100 SEG-TEST-82.
150200     MOVE SPACE TO TEST-CHECK.
150300     PERFORM 81.
150400     IF TEST-CHECK EQUAL TO "GOOD"
150500         PERFORM PASS
150600         GO TO SEG-WRITE-82.
150700     MOVE SPACE TO COMPUTED-A.
150800     MOVE "GOOD" TO CORRECT-A.
150900     PERFORM FAIL.
151000     GO TO SEG-WRITE-82.
151100 SEG-DELETE-82.
151200     PERFORM DE-LETE.
151300 SEG-WRITE-82.
151400     MOVE "SEG-TEST-82 " TO PAR-NAME.
151500     PERFORM PRINT-DETAIL.
151600 SEG-TEST-83.
151700     MOVE SPACE TO TEST-CHECK.
151800     PERFORM 82.
151900     IF TEST-CHECK EQUAL TO "GOOD"
152000         PERFORM PASS
152100         GO TO SEG-WRITE-83.
152200     MOVE SPACE TO COMPUTED-A.
152300     MOVE "GOOD" TO CORRECT-A.
152400     PERFORM FAIL.
152500     GO TO SEG-WRITE-83.
152600 SEG-DELETE-83.
152700     PERFORM DE-LETE.
152800 SEG-WRITE-83.
152900     MOVE "SEG-TEST-83 " TO PAR-NAME.
153000     PERFORM PRINT-DETAIL.
153100 SEG-TEST-84.
153200     MOVE SPACE TO TEST-CHECK.
153300     PERFORM 83.
153400     IF TEST-CHECK EQUAL TO "GOOD"
153500         PERFORM PASS
153600         GO TO SEG-WRITE-84.
153700     MOVE SPACE TO COMPUTED-A.
153800     MOVE "GOOD" TO CORRECT-A.
153900     PERFORM FAIL.
154000     GO TO SEG-WRITE-84.
154100 SEG-DELETE-84.
154200     PERFORM DE-LETE.
154300 SEG-WRITE-84.
154400     MOVE "SEG-TEST-84 " TO PAR-NAME.
154500     PERFORM PRINT-DETAIL.
154600 SEG-TEST-85.
154700     MOVE SPACE TO TEST-CHECK.
154800     PERFORM 84.
154900     IF TEST-CHECK EQUAL TO "GOOD"
155000         PERFORM PASS
155100         GO TO SEG-WRITE-85.
155200     MOVE SPACE TO COMPUTED-A.
155300     MOVE "GOOD" TO CORRECT-A.
155400     PERFORM FAIL.
155500     GO TO SEG-WRITE-85.
155600 SEG-DELETE-85.
155700     PERFORM DE-LETE.
155800 SEG-WRITE-85.
155900     MOVE "SEG-TEST-85 " TO PAR-NAME.
156000     PERFORM PRINT-DETAIL.
156100 SEG-TEST-86.
156200     MOVE SPACE TO TEST-CHECK.
156300     PERFORM 85.
156400     IF TEST-CHECK EQUAL TO "GOOD"
156500         PERFORM PASS
156600         GO TO SEG-WRITE-86.
156700     MOVE SPACE TO COMPUTED-A.
156800     MOVE "GOOD" TO CORRECT-A.
156900     PERFORM FAIL.
157000     GO TO SEG-WRITE-86.
157100 SEG-DELETE-86.
157200     PERFORM DE-LETE.
157300 SEG-WRITE-86.
157400     MOVE "SEG-TEST-86 " TO PAR-NAME.
157500     PERFORM PRINT-DETAIL.
157600 SEG-TEST-87.
157700     MOVE SPACE TO TEST-CHECK.
157800     PERFORM 86.
157900     IF TEST-CHECK EQUAL TO "GOOD"
158000         PERFORM PASS
158100         GO TO SEG-WRITE-87.
158200     MOVE SPACE TO COMPUTED-A.
158300     MOVE "GOOD" TO CORRECT-A.
158400     PERFORM FAIL.
158500     GO TO SEG-WRITE-87.
158600 SEG-DELETE-87.
158700     PERFORM DE-LETE.
158800 SEG-WRITE-87.
158900     MOVE "SEG-TEST-87 " TO PAR-NAME.
159000     PERFORM PRINT-DETAIL.
159100 SEG-TEST-88.
159200     MOVE SPACE TO TEST-CHECK.
159300     PERFORM 87.
159400     IF TEST-CHECK EQUAL TO "GOOD"
159500         PERFORM PASS
159600         GO TO SEG-WRITE-88.
159700     MOVE SPACE TO COMPUTED-A.
159800     MOVE "GOOD" TO CORRECT-A.
159900     PERFORM FAIL.
160000     GO TO SEG-WRITE-88.
160100 SEG-DELETE-88.
160200     PERFORM DE-LETE.
160300 SEG-WRITE-88.
160400     MOVE "SEG-TEST-88 " TO PAR-NAME.
160500     PERFORM PRINT-DETAIL.
160600 SEG-TEST-89.
160700     MOVE SPACE TO TEST-CHECK.
160800     PERFORM 88.
160900     IF TEST-CHECK EQUAL TO "GOOD"
161000         PERFORM PASS
161100         GO TO SEG-WRITE-89.
161200     MOVE SPACE TO COMPUTED-A.
161300     MOVE "GOOD" TO CORRECT-A.
161400     PERFORM FAIL.
161500     GO TO SEG-WRITE-89.
161600 SEG-DELETE-89.
161700     PERFORM DE-LETE.
161800 SEG-WRITE-89.
161900     MOVE "SEG-TEST-89 " TO PAR-NAME.
162000     PERFORM PRINT-DETAIL.
162100 SEG-TEST-90.
162200     MOVE SPACE TO TEST-CHECK.
162300     PERFORM 89.
162400     IF TEST-CHECK EQUAL TO "GOOD"
162500         PERFORM PASS
162600         GO TO SEG-WRITE-90.
162700     MOVE SPACE TO COMPUTED-A.
162800     MOVE "GOOD" TO CORRECT-A.
162900     PERFORM FAIL.
163000     GO TO SEG-WRITE-90.
163100 SEG-DELETE-90.
163200     PERFORM DE-LETE.
163300 SEG-WRITE-90.
163400     MOVE "SEG-TEST-90 " TO PAR-NAME.
163500     PERFORM PRINT-DETAIL.
163600 SEG-TEST-91.
163700     MOVE SPACE TO TEST-CHECK.
163800     PERFORM 90.
163900     IF TEST-CHECK EQUAL TO "GOOD"
164000         PERFORM PASS
164100         GO TO SEG-WRITE-91.
164200     MOVE SPACE TO COMPUTED-A.
164300     MOVE "GOOD" TO CORRECT-A.
164400     PERFORM FAIL.
164500     GO TO SEG-WRITE-91.
164600 SEG-DELETE-91.
164700     PERFORM DE-LETE.
164800 SEG-WRITE-91.
164900     MOVE "SEG-TEST-91 " TO PAR-NAME.
165000     PERFORM PRINT-DETAIL.
165100 SEG-TEST-92.
165200     MOVE SPACE TO TEST-CHECK.
165300     PERFORM 91.
165400     IF TEST-CHECK EQUAL TO "GOOD"
165500         PERFORM PASS
165600         GO TO SEG-WRITE-92.
165700     MOVE SPACE TO COMPUTED-A.
165800     MOVE "GOOD" TO CORRECT-A.
165900     PERFORM FAIL.
166000     GO TO SEG-WRITE-92.
166100 SEG-DELETE-92.
166200     PERFORM DE-LETE.
166300 SEG-WRITE-92.
166400     MOVE "SEG-TEST-92 " TO PAR-NAME.
166500     PERFORM PRINT-DETAIL.
166600 SEG-TEST-93.
166700     MOVE SPACE TO TEST-CHECK.
166800     PERFORM 92.
166900     IF TEST-CHECK EQUAL TO "GOOD"
167000         PERFORM PASS
167100         GO TO SEG-WRITE-93.
167200     MOVE SPACE TO COMPUTED-A.
167300     MOVE "GOOD" TO CORRECT-A.
167400     PERFORM FAIL.
167500     GO TO SEG-WRITE-93.
167600 SEG-DELETE-93.
167700     PERFORM DE-LETE.
167800 SEG-WRITE-93.
167900     MOVE "SEG-TEST-93 " TO PAR-NAME.
168000     PERFORM PRINT-DETAIL.
168100 SEG-TEST-94.
168200     MOVE SPACE TO TEST-CHECK.
168300     PERFORM 93.
168400     IF TEST-CHECK EQUAL TO "GOOD"
168500         PERFORM PASS
168600         GO TO SEG-WRITE-94.
168700     MOVE SPACE TO COMPUTED-A.
168800     MOVE "GOOD" TO CORRECT-A.
168900     PERFORM FAIL.
169000     GO TO SEG-WRITE-94.
169100 SEG-DELETE-94.
169200     PERFORM DE-LETE.
169300 SEG-WRITE-94.
169400     MOVE "SEG-TEST-94 " TO PAR-NAME.
169500     PERFORM PRINT-DETAIL.
169600 SEG-TEST-95.
169700     MOVE SPACE TO TEST-CHECK.
169800     PERFORM 94.
169900     IF TEST-CHECK EQUAL TO "GOOD"
170000         PERFORM PASS
170100         GO TO SEG-WRITE-95.
170200     MOVE SPACE TO COMPUTED-A.
170300     MOVE "GOOD" TO CORRECT-A.
170400     PERFORM FAIL.
170500     GO TO SEG-WRITE-95.
170600 SEG-DELETE-95.
170700     PERFORM DE-LETE.
170800 SEG-WRITE-95.
170900     MOVE "SEG-TEST-95 " TO PAR-NAME.
171000     PERFORM PRINT-DETAIL.
171100 SEG-TEST-96.
171200     MOVE SPACE TO TEST-CHECK.
171300     PERFORM 95.
171400     IF TEST-CHECK EQUAL TO "GOOD"
171500         PERFORM PASS
171600         GO TO SEG-WRITE-96.
171700     MOVE SPACE TO COMPUTED-A.
171800     MOVE "GOOD" TO CORRECT-A.
171900     PERFORM FAIL.
172000     GO TO SEG-WRITE-96.
172100 SEG-DELETE-96.
172200     PERFORM DE-LETE.
172300 SEG-WRITE-96.
172400     MOVE "SEG-TEST-96 " TO PAR-NAME.
172500     PERFORM PRINT-DETAIL.
172600 SEG-TEST-97.
172700     MOVE SPACE TO TEST-CHECK.
172800     PERFORM 96.
172900     IF TEST-CHECK EQUAL TO "GOOD"
173000         PERFORM PASS
173100         GO TO SEG-WRITE-97.
173200     MOVE SPACE TO COMPUTED-A.
173300     MOVE "GOOD" TO CORRECT-A.
173400     PERFORM FAIL.
173500     GO TO SEG-WRITE-97.
173600 SEG-DELETE-97.
173700     PERFORM DE-LETE.
173800 SEG-WRITE-97.
173900     MOVE "SEG-TEST-97 " TO PAR-NAME.
174000     PERFORM PRINT-DETAIL.
174100 SEG-TEST-98.
174200     MOVE SPACE TO TEST-CHECK.
174300     PERFORM 97.
174400     IF TEST-CHECK EQUAL TO "GOOD"
174500         PERFORM PASS
174600         GO TO SEG-WRITE-98.
174700     MOVE SPACE TO COMPUTED-A.
174800     MOVE "GOOD" TO CORRECT-A.
174900     PERFORM FAIL.
175000     GO TO SEG-WRITE-98.
175100 SEG-DELETE-98.
175200     PERFORM DE-LETE.
175300 SEG-WRITE-98.
175400     MOVE "SEG-TEST-98 " TO PAR-NAME.
175500     PERFORM PRINT-DETAIL.
175600 SEG-TEST-99.
175700     MOVE SPACE TO TEST-CHECK.
175800     PERFORM 98.
175900     IF TEST-CHECK EQUAL TO "GOOD"
176000         PERFORM PASS
176100         GO TO SEG-WRITE-99.
176200     MOVE SPACE TO COMPUTED-A.
176300     MOVE "GOOD" TO CORRECT-A.
176400     PERFORM FAIL.
176500     GO TO SEG-WRITE-99.
176600 SEG-DELETE-99.
176700     PERFORM DE-LETE.
176800 SEG-WRITE-99.
176900     MOVE "SEG-TEST-99 " TO PAR-NAME.
177000     PERFORM PRINT-DETAIL.
177100 SEG-TEST-100.
177200     MOVE SPACE TO TEST-CHECK.
177300     PERFORM 99.
177400     IF TEST-CHECK EQUAL TO "GOOD"
177500         PERFORM PASS
177600         GO TO SEG-WRITE-100.
177700     MOVE SPACE TO COMPUTED-A.
177800     MOVE "GOOD" TO CORRECT-A.
177900     PERFORM FAIL.
178000     GO TO SEG-WRITE-100.
178100 SEG-DELETE-100.
178200     PERFORM DE-LETE.
178300 SEG-WRITE-100.
178400     MOVE "SEG-TEST-100" TO PAR-NAME.
178500     PERFORM PRINT-DETAIL.
178600     GO TO SECOND-HALF.
178700 01  SECTION 01.
178800 PARA-01.
178900     MOVE "GOOD" TO TEST-CHECK.
179000 02  SECTION 02.
179100 PARA-02.
179200     MOVE "GOOD" TO TEST-CHECK.
179300 03  SECTION 03.
179400 PARA-03.
179500     MOVE "GOOD" TO TEST-CHECK.
179600 04  SECTION 04.
179700 PARA-04.
179800     MOVE "GOOD" TO TEST-CHECK.
179900 05  SECTION 05.
180000 PARA-05.
180100     MOVE "GOOD" TO TEST-CHECK.
180200 06  SECTION 06.
180300 PARA-06.
180400     MOVE "GOOD" TO TEST-CHECK.
180500 07  SECTION 07.
180600 PARA-07.
180700     MOVE "GOOD" TO TEST-CHECK.
180800 08  SECTION 08.
180900 PARA-08.
181000     MOVE "GOOD" TO TEST-CHECK.
181100 09  SECTION 09.
181200 PARA-09.
181300     MOVE "GOOD" TO TEST-CHECK.
181400 10  SECTION 10.
181500 PARA-10.
181600     MOVE "GOOD" TO TEST-CHECK.
181700 11  SECTION 11.
181800 PARA-11.
181900     MOVE "GOOD" TO TEST-CHECK.
182000 12  SECTION 12.
182100 PARA-12.
182200     MOVE "GOOD" TO TEST-CHECK.
182300 13  SECTION 13.
182400 PARA-13.
182500     MOVE "GOOD" TO TEST-CHECK.
182600 14  SECTION 14.
182700 PARA-14.
182800     MOVE "GOOD" TO TEST-CHECK.
182900 15  SECTION 15.
183000 PARA-15.
183100     MOVE "GOOD" TO TEST-CHECK.
183200 16  SECTION 16.
183300 PARA-16.
183400     MOVE "GOOD" TO TEST-CHECK.
183500 17  SECTION 17.
183600 PARA-17.
183700     MOVE "GOOD" TO TEST-CHECK.
183800 18  SECTION 18.
183900 PARA-18.
184000     MOVE "GOOD" TO TEST-CHECK.
184100 19  SECTION 19.
184200 PARA-19.
184300     MOVE "GOOD" TO TEST-CHECK.
184400 20  SECTION 20.
184500 PARA-20.
184600     MOVE "GOOD" TO TEST-CHECK.
184700 21  SECTION 21.
184800 PARA-21.
184900     MOVE "GOOD" TO TEST-CHECK.
185000 22  SECTION 22.
185100 PARA-22.
185200     MOVE "GOOD" TO TEST-CHECK.
185300 23  SECTION 23.
185400 PARA-23.
185500     MOVE "GOOD" TO TEST-CHECK.
185600 24  SECTION 24.
185700 PARA-24.
185800     MOVE "GOOD" TO TEST-CHECK.
185900 25  SECTION 25.
186000 PARA-25.
186100     MOVE "GOOD" TO TEST-CHECK.
186200 26  SECTION 26.
186300 PARA-26.
186400     MOVE "GOOD" TO TEST-CHECK.
186500 27  SECTION 27.
186600 PARA-27.
186700     MOVE "GOOD" TO TEST-CHECK.
186800 28  SECTION 28.
186900 PARA-28.
187000     MOVE "GOOD" TO TEST-CHECK.
187100 29  SECTION 29.
187200 PARA-29.
187300     MOVE "GOOD" TO TEST-CHECK.
187400 30  SECTION 30.
187500 PARA-30.
187600     MOVE "GOOD" TO TEST-CHECK.
187700 31  SECTION 31.
187800 PARA-31.
187900     MOVE "GOOD" TO TEST-CHECK.
188000 32  SECTION 32.
188100 PARA-32.
188200     MOVE "GOOD" TO TEST-CHECK.
188300 33  SECTION 33.
188400 PARA-33.
188500     MOVE "GOOD" TO TEST-CHECK.
188600 34  SECTION 34.
188700 PARA-34.
188800     MOVE "GOOD" TO TEST-CHECK.
188900 35  SECTION 35.
189000 PARA-35.
189100     MOVE "GOOD" TO TEST-CHECK.
189200 36  SECTION 36.
189300 PARA-36.
189400     MOVE "GOOD" TO TEST-CHECK.
189500 37  SECTION 37.
189600 PARA-37.
189700     MOVE "GOOD" TO TEST-CHECK.
189800 38  SECTION 38.
189900 PARA-38.
190000     MOVE "GOOD" TO TEST-CHECK.
190100 39  SECTION 39.
190200 PARA-39.
190300     MOVE "GOOD" TO TEST-CHECK.
190400 40  SECTION 40.
190500 PARA-40.
190600     MOVE "GOOD" TO TEST-CHECK.
190700 41  SECTION 41.
190800 PARA-41.
190900     MOVE "GOOD" TO TEST-CHECK.
191000 42  SECTION 42.
191100 PARA-42.
191200     MOVE "GOOD" TO TEST-CHECK.
191300 43  SECTION 43.
191400 PARA-43.
191500     MOVE "GOOD" TO TEST-CHECK.
191600 44  SECTION 44.
191700 PARA-44.
191800     MOVE "GOOD" TO TEST-CHECK.
191900 45  SECTION 45.
192000 PARA-45.
192100     MOVE "GOOD" TO TEST-CHECK.
192200 46  SECTION 46.
192300 PARA-46.
192400     MOVE "GOOD" TO TEST-CHECK.
192500 47  SECTION 47.
192600 PARA-47.
192700     MOVE "GOOD" TO TEST-CHECK.
192800 48  SECTION 48.
192900 PARA-48.
193000     MOVE "GOOD" TO TEST-CHECK.
193100 49  SECTION 49.
193200 PARA-49.
193300     MOVE "GOOD" TO TEST-CHECK.
193400 SECOND-HALF SECTION 50.
193500 SEG-TEST-101.
193600     MOVE SPACE TO TEST-CHECK.
193700     PERFORM 50.
193800     IF TEST-CHECK EQUAL TO "GOOD"
193900         PERFORM PASS
194000         GO TO SEG-WRITE-101.
194100     MOVE SPACE TO COMPUTED-A.
194200     MOVE "GOOD" TO CORRECT-A.
194300     PERFORM FAIL.
194400     GO TO SEG-WRITE-101.
194500 SEG-DELETE-101.
194600     PERFORM DE-LETE.
194700 SEG-WRITE-101.
194800     MOVE "SEG-TEST-101" TO PAR-NAME.
194900     PERFORM PRINT-DETAIL.
195000 SEG-TEST-102.
195100     MOVE SPACE TO TEST-CHECK.
195200     PERFORM 49.
195300     IF TEST-CHECK EQUAL TO "GOOD"
195400         PERFORM PASS
195500         GO TO SEG-WRITE-102.
195600     MOVE SPACE TO COMPUTED-A.
195700     MOVE "GOOD" TO CORRECT-A.
195800     PERFORM FAIL.
195900     GO TO SEG-WRITE-102.
196000 SEG-DELETE-102.
196100     PERFORM DE-LETE.
196200 SEG-WRITE-102.
196300     MOVE "SEG-TEST-102" TO PAR-NAME.
196400     PERFORM PRINT-DETAIL.
196500 SEG-TEST-103.
196600     MOVE SPACE TO TEST-CHECK.
196700     PERFORM 48.
196800     IF TEST-CHECK EQUAL TO "GOOD"
196900         PERFORM PASS
197000         GO TO SEG-WRITE-103.
197100     MOVE SPACE TO COMPUTED-A.
197200     MOVE "GOOD" TO CORRECT-A.
197300     PERFORM FAIL.
197400     GO TO SEG-WRITE-103.
197500 SEG-DELETE-103.
197600     PERFORM DE-LETE.
197700 SEG-WRITE-103.
197800     MOVE "SEG-TEST-103" TO PAR-NAME.
197900     PERFORM PRINT-DETAIL.
198000 SEG-TEST-104.
198100     MOVE SPACE TO TEST-CHECK.
198200     PERFORM 47.
198300     IF TEST-CHECK EQUAL TO "GOOD"
198400         PERFORM PASS
198500         GO TO SEG-WRITE-104.
198600     MOVE SPACE TO COMPUTED-A.
198700     MOVE "GOOD" TO CORRECT-A.
198800     PERFORM FAIL.
198900     GO TO SEG-WRITE-104.
199000 SEG-DELETE-104.
199100     PERFORM DE-LETE.
199200 SEG-WRITE-104.
199300     MOVE "SEG-TEST-104" TO PAR-NAME.
199400     PERFORM PRINT-DETAIL.
199500 SEG-TEST-105.
199600     MOVE SPACE TO TEST-CHECK.
199700     PERFORM 46.
199800     IF TEST-CHECK EQUAL TO "GOOD"
199900         PERFORM PASS
200000         GO TO SEG-WRITE-105.
200100     MOVE SPACE TO COMPUTED-A.
200200     MOVE "GOOD" TO CORRECT-A.
200300     PERFORM FAIL.
200400     GO TO SEG-WRITE-105.
200500 SEG-DELETE-105.
200600     PERFORM DE-LETE.
200700 SEG-WRITE-105.
200800     MOVE "SEG-TEST-105" TO PAR-NAME.
200900     PERFORM PRINT-DETAIL.
201000 SEG-TEST-106.
201100     MOVE SPACE TO TEST-CHECK.
201200     PERFORM 45.
201300     IF TEST-CHECK EQUAL TO "GOOD"
201400         PERFORM PASS
201500         GO TO SEG-WRITE-106.
201600     MOVE SPACE TO COMPUTED-A.
201700     MOVE "GOOD" TO CORRECT-A.
201800     PERFORM FAIL.
201900     GO TO SEG-WRITE-106.
202000 SEG-DELETE-106.
202100     PERFORM DE-LETE.
202200 SEG-WRITE-106.
202300     MOVE "SEG-TEST-106" TO PAR-NAME.
202400     PERFORM PRINT-DETAIL.
202500 SEG-TEST-107.
202600     MOVE SPACE TO TEST-CHECK.
202700     PERFORM 44.
202800     IF TEST-CHECK EQUAL TO "GOOD"
202900         PERFORM PASS
203000         GO TO SEG-WRITE-107.
203100     MOVE SPACE TO COMPUTED-A.
203200     MOVE "GOOD" TO CORRECT-A.
203300     PERFORM FAIL.
203400     GO TO SEG-WRITE-107.
203500 SEG-DELETE-107.
203600     PERFORM DE-LETE.
203700 SEG-WRITE-107.
203800     MOVE "SEG-TEST-107" TO PAR-NAME.
203900     PERFORM PRINT-DETAIL.
204000 SEG-TEST-108.
204100     MOVE SPACE TO TEST-CHECK.
204200     PERFORM 43.
204300     IF TEST-CHECK EQUAL TO "GOOD"
204400         PERFORM PASS
204500         GO TO SEG-WRITE-108.
204600     MOVE SPACE TO COMPUTED-A.
204700     MOVE "GOOD" TO CORRECT-A.
204800     PERFORM FAIL.
204900     GO TO SEG-WRITE-108.
205000 SEG-DELETE-108.
205100     PERFORM DE-LETE.
205200 SEG-WRITE-108.
205300     MOVE "SEG-TEST-108" TO PAR-NAME.
205400     PERFORM PRINT-DETAIL.
205500 SEG-TEST-109.
205600     MOVE SPACE TO TEST-CHECK.
205700     PERFORM 42.
205800     IF TEST-CHECK EQUAL TO "GOOD"
205900         PERFORM PASS
206000         GO TO SEG-WRITE-109.
206100     MOVE SPACE TO COMPUTED-A.
206200     MOVE "GOOD" TO CORRECT-A.
206300     PERFORM FAIL.
206400     GO TO SEG-WRITE-109.
206500 SEG-DELETE-109.
206600     PERFORM DE-LETE.
206700 SEG-WRITE-109.
206800     MOVE "SEG-TEST-109" TO PAR-NAME.
206900     PERFORM PRINT-DETAIL.
207000 SEG-TEST-110.
207100     MOVE SPACE TO TEST-CHECK.
207200     PERFORM 41.
207300     IF TEST-CHECK EQUAL TO "GOOD"
207400         PERFORM PASS
207500         GO TO SEG-WRITE-110.
207600     MOVE SPACE TO COMPUTED-A.
207700     MOVE "GOOD" TO CORRECT-A.
207800     PERFORM FAIL.
207900     GO TO SEG-WRITE-110.
208000 SEG-DELETE-110.
208100     PERFORM DE-LETE.
208200 SEG-WRITE-110.
208300     MOVE "SEG-TEST-110" TO PAR-NAME.
208400     PERFORM PRINT-DETAIL.
208500 SEG-TEST-111.
208600     MOVE SPACE TO TEST-CHECK.
208700     PERFORM 40.
208800     IF TEST-CHECK EQUAL TO "GOOD"
208900         PERFORM PASS
209000         GO TO SEG-WRITE-111.
209100     MOVE SPACE TO COMPUTED-A.
209200     MOVE "GOOD" TO CORRECT-A.
209300     PERFORM FAIL.
209400     GO TO SEG-WRITE-111.
209500 SEG-DELETE-111.
209600     PERFORM DE-LETE.
209700 SEG-WRITE-111.
209800     MOVE "SEG-TEST-111" TO PAR-NAME.
209900     PERFORM PRINT-DETAIL.
210000 SEG-TEST-112.
210100     MOVE SPACE TO TEST-CHECK.
210200     PERFORM 39.
210300     IF TEST-CHECK EQUAL TO "GOOD"
210400         PERFORM PASS
210500         GO TO SEG-WRITE-112.
210600     MOVE SPACE TO COMPUTED-A.
210700     MOVE "GOOD" TO CORRECT-A.
210800     PERFORM FAIL.
210900     GO TO SEG-WRITE-112.
211000 SEG-DELETE-112.
211100     PERFORM DE-LETE.
211200 SEG-WRITE-112.
211300     MOVE "SEG-TEST-112" TO PAR-NAME.
211400     PERFORM PRINT-DETAIL.
211500 SEG-TEST-113.
211600     MOVE SPACE TO TEST-CHECK.
211700     PERFORM 38.
211800     IF TEST-CHECK EQUAL TO "GOOD"
211900         PERFORM PASS
212000         GO TO SEG-WRITE-113.
212100     MOVE SPACE TO COMPUTED-A.
212200     MOVE "GOOD" TO CORRECT-A.
212300     PERFORM FAIL.
212400     GO TO SEG-WRITE-113.
212500 SEG-DELETE-113.
212600     PERFORM DE-LETE.
212700 SEG-WRITE-113.
212800     MOVE "SEG-TEST-113" TO PAR-NAME.
212900     PERFORM PRINT-DETAIL.
213000 SEG-TEST-114.
213100     MOVE SPACE TO TEST-CHECK.
213200     PERFORM 37.
213300     IF TEST-CHECK EQUAL TO "GOOD"
213400         PERFORM PASS
213500         GO TO SEG-WRITE-114.
213600     MOVE SPACE TO COMPUTED-A.
213700     MOVE "GOOD" TO CORRECT-A.
213800     PERFORM FAIL.
213900     GO TO SEG-WRITE-114.
214000 SEG-DELETE-114.
214100     PERFORM DE-LETE.
214200 SEG-WRITE-114.
214300     MOVE "SEG-TEST-114" TO PAR-NAME.
214400     PERFORM PRINT-DETAIL.
214500 SEG-TEST-115.
214600     MOVE SPACE TO TEST-CHECK.
214700     PERFORM 36.
214800     IF TEST-CHECK EQUAL TO "GOOD"
214900         PERFORM PASS
215000         GO TO SEG-WRITE-115.
215100     MOVE SPACE TO COMPUTED-A.
215200     MOVE "GOOD" TO CORRECT-A.
215300     PERFORM FAIL.
215400     GO TO SEG-WRITE-115.
215500 SEG-DELETE-115.
215600     PERFORM DE-LETE.
215700 SEG-WRITE-115.
215800     MOVE "SEG-TEST-115" TO PAR-NAME.
215900     PERFORM PRINT-DETAIL.
216000 SEG-TEST-116.
216100     MOVE SPACE TO TEST-CHECK.
216200     PERFORM 35.
216300     IF TEST-CHECK EQUAL TO "GOOD"
216400         PERFORM PASS
216500         GO TO SEG-WRITE-116.
216600     MOVE SPACE TO COMPUTED-A.
216700     MOVE "GOOD" TO CORRECT-A.
216800     PERFORM FAIL.
216900     GO TO SEG-WRITE-116.
217000 SEG-DELETE-116.
217100     PERFORM DE-LETE.
217200 SEG-WRITE-116.
217300     MOVE "SEG-TEST-116" TO PAR-NAME.
217400     PERFORM PRINT-DETAIL.
217500 SEG-TEST-117.
217600     MOVE SPACE TO TEST-CHECK.
217700     PERFORM 34.
217800     IF TEST-CHECK EQUAL TO "GOOD"
217900         PERFORM PASS
218000         GO TO SEG-WRITE-117.
218100     MOVE SPACE TO COMPUTED-A.
218200     MOVE "GOOD" TO CORRECT-A.
218300     PERFORM FAIL.
218400     GO TO SEG-WRITE-117.
218500 SEG-DELETE-117.
218600     PERFORM DE-LETE.
218700 SEG-WRITE-117.
218800     MOVE "SEG-TEST-117" TO PAR-NAME.
218900     PERFORM PRINT-DETAIL.
219000 SEG-TEST-118.
219100     MOVE SPACE TO TEST-CHECK.
219200     PERFORM 33.
219300     IF TEST-CHECK EQUAL TO "GOOD"
219400         PERFORM PASS
219500         GO TO SEG-WRITE-118.
219600     MOVE SPACE TO COMPUTED-A.
219700     MOVE "GOOD" TO CORRECT-A.
219800     PERFORM FAIL.
219900     GO TO SEG-WRITE-118.
220000 SEG-DELETE-118.
220100     PERFORM DE-LETE.
220200 SEG-WRITE-118.
220300     MOVE "SEG-TEST-118" TO PAR-NAME.
220400     PERFORM PRINT-DETAIL.
220500 SEG-TEST-119.
220600     MOVE SPACE TO TEST-CHECK.
220700     PERFORM 32.
220800     IF TEST-CHECK EQUAL TO "GOOD"
220900         PERFORM PASS
221000         GO TO SEG-WRITE-119.
221100     MOVE SPACE TO COMPUTED-A.
221200     MOVE "GOOD" TO CORRECT-A.
221300     PERFORM FAIL.
221400     GO TO SEG-WRITE-119.
221500 SEG-DELETE-119.
221600     PERFORM DE-LETE.
221700 SEG-WRITE-119.
221800     MOVE "SEG-TEST-119" TO PAR-NAME.
221900     PERFORM PRINT-DETAIL.
222000 SEG-TEST-120.
222100     MOVE SPACE TO TEST-CHECK.
222200     PERFORM 31.
222300     IF TEST-CHECK EQUAL TO "GOOD"
222400         PERFORM PASS
222500         GO TO SEG-WRITE-120.
222600     MOVE SPACE TO COMPUTED-A.
222700     MOVE "GOOD" TO CORRECT-A.
222800     PERFORM FAIL.
222900     GO TO SEG-WRITE-120.
223000 SEG-DELETE-120.
223100     PERFORM DE-LETE.
223200 SEG-WRITE-120.
223300     MOVE "SEG-TEST-120" TO PAR-NAME.
223400     PERFORM PRINT-DETAIL.
223500 SEG-TEST-121.
223600     MOVE SPACE TO TEST-CHECK.
223700     PERFORM 30.
223800     IF TEST-CHECK EQUAL TO "GOOD"
223900         PERFORM PASS
224000         GO TO SEG-WRITE-121.
224100     MOVE SPACE TO COMPUTED-A.
224200     MOVE "GOOD" TO CORRECT-A.
224300     PERFORM FAIL.
224400     GO TO SEG-WRITE-121.
224500 SEG-DELETE-121.
224600     PERFORM DE-LETE.
224700 SEG-WRITE-121.
224800     MOVE "SEG-TEST-121" TO PAR-NAME.
224900     PERFORM PRINT-DETAIL.
225000 SEG-TEST-122.
225100     MOVE SPACE TO TEST-CHECK.
225200     PERFORM 29.
225300     IF TEST-CHECK EQUAL TO "GOOD"
225400         PERFORM PASS
225500         GO TO SEG-WRITE-122.
225600     MOVE SPACE TO COMPUTED-A.
225700     MOVE "GOOD" TO CORRECT-A.
225800     PERFORM FAIL.
225900     GO TO SEG-WRITE-122.
226000 SEG-DELETE-122.
226100     PERFORM DE-LETE.
226200 SEG-WRITE-122.
226300     MOVE "SEG-TEST-122" TO PAR-NAME.
226400     PERFORM PRINT-DETAIL.
226500 SEG-TEST-123.
226600     MOVE SPACE TO TEST-CHECK.
226700     PERFORM 28.
226800     IF TEST-CHECK EQUAL TO "GOOD"
226900         PERFORM PASS
227000         GO TO SEG-WRITE-123.
227100     MOVE SPACE TO COMPUTED-A.
227200     MOVE "GOOD" TO CORRECT-A.
227300     PERFORM FAIL.
227400     GO TO SEG-WRITE-123.
227500 SEG-DELETE-123.
227600     PERFORM DE-LETE.
227700 SEG-WRITE-123.
227800     MOVE "SEG-TEST-123" TO PAR-NAME.
227900     PERFORM PRINT-DETAIL.
228000 SEG-TEST-124.
228100     MOVE SPACE TO TEST-CHECK.
228200     PERFORM 27.
228300     IF TEST-CHECK EQUAL TO "GOOD"
228400         PERFORM PASS
228500         GO TO SEG-WRITE-124.
228600     MOVE SPACE TO COMPUTED-A.
228700     MOVE "GOOD" TO CORRECT-A.
228800     PERFORM FAIL.
228900     GO TO SEG-WRITE-124.
229000 SEG-DELETE-124.
229100     PERFORM DE-LETE.
229200 SEG-WRITE-124.
229300     MOVE "SEG-TEST-124" TO PAR-NAME.
229400     PERFORM PRINT-DETAIL.
229500 SEG-TEST-125.
229600     MOVE SPACE TO TEST-CHECK.
229700     PERFORM 26.
229800     IF TEST-CHECK EQUAL TO "GOOD"
229900         PERFORM PASS
230000         GO TO SEG-WRITE-125.
230100     MOVE SPACE TO COMPUTED-A.
230200     MOVE "GOOD" TO CORRECT-A.
230300     PERFORM FAIL.
230400     GO TO SEG-WRITE-125.
230500 SEG-DELETE-125.
230600     PERFORM DE-LETE.
230700 SEG-WRITE-125.
230800     MOVE "SEG-TEST-125" TO PAR-NAME.
230900     PERFORM PRINT-DETAIL.
231000 SEG-TEST-126.
231100     MOVE SPACE TO TEST-CHECK.
231200     PERFORM 25.
231300     IF TEST-CHECK EQUAL TO "GOOD"
231400         PERFORM PASS
231500         GO TO SEG-WRITE-126.
231600     MOVE SPACE TO COMPUTED-A.
231700     MOVE "GOOD" TO CORRECT-A.
231800     PERFORM FAIL.
231900     GO TO SEG-WRITE-126.
232000 SEG-DELETE-126.
232100     PERFORM DE-LETE.
232200 SEG-WRITE-126.
232300     MOVE "SEG-TEST-126" TO PAR-NAME.
232400     PERFORM PRINT-DETAIL.
232500 SEG-TEST-127.
232600     MOVE SPACE TO TEST-CHECK.
232700     PERFORM 24.
232800     IF TEST-CHECK EQUAL TO "GOOD"
232900         PERFORM PASS
233000         GO TO SEG-WRITE-127.
233100     MOVE SPACE TO COMPUTED-A.
233200     MOVE "GOOD" TO CORRECT-A.
233300     PERFORM FAIL.
233400     GO TO SEG-WRITE-127.
233500 SEG-DELETE-127.
233600     PERFORM DE-LETE.
233700 SEG-WRITE-127.
233800     MOVE "SEG-TEST-127" TO PAR-NAME.
233900     PERFORM PRINT-DETAIL.
234000 SEG-TEST-128.
234100     MOVE SPACE TO TEST-CHECK.
234200     PERFORM 23.
234300     IF TEST-CHECK EQUAL TO "GOOD"
234400         PERFORM PASS
234500         GO TO SEG-WRITE-128.
234600     MOVE SPACE TO COMPUTED-A.
234700     MOVE "GOOD" TO CORRECT-A.
234800     PERFORM FAIL.
234900     GO TO SEG-WRITE-128.
235000 SEG-DELETE-128.
235100     PERFORM DE-LETE.
235200 SEG-WRITE-128.
235300     MOVE "SEG-TEST-128" TO PAR-NAME.
235400     PERFORM PRINT-DETAIL.
235500 SEG-TEST-129.
235600     MOVE SPACE TO TEST-CHECK.
235700     PERFORM 22.
235800     IF TEST-CHECK EQUAL TO "GOOD"
235900         PERFORM PASS
236000         GO TO SEG-WRITE-129.
236100     MOVE SPACE TO COMPUTED-A.
236200     MOVE "GOOD" TO CORRECT-A.
236300     PERFORM FAIL.
236400     GO TO SEG-WRITE-129.
236500 SEG-DELETE-129.
236600     PERFORM DE-LETE.
236700 SEG-WRITE-129.
236800     MOVE "SEG-TEST-129" TO PAR-NAME.
236900     PERFORM PRINT-DETAIL.
237000 SEG-TEST-130.
237100     MOVE SPACE TO TEST-CHECK.
237200     PERFORM 21.
237300     IF TEST-CHECK EQUAL TO "GOOD"
237400         PERFORM PASS
237500         GO TO SEG-WRITE-130.
237600     MOVE SPACE TO COMPUTED-A.
237700     MOVE "GOOD" TO CORRECT-A.
237800     PERFORM FAIL.
237900     GO TO SEG-WRITE-130.
238000 SEG-DELETE-130.
238100     PERFORM DE-LETE.
238200 SEG-WRITE-130.
238300     MOVE "SEG-TEST-130" TO PAR-NAME.
238400     PERFORM PRINT-DETAIL.
238500 SEG-TEST-131.
238600     MOVE SPACE TO TEST-CHECK.
238700     PERFORM 20.
238800     IF TEST-CHECK EQUAL TO "GOOD"
238900         PERFORM PASS
239000         GO TO SEG-WRITE-131.
239100     MOVE "GOOD" TO CORRECT-A.
239200     PERFORM FAIL.
239300     GO TO SEG-WRITE-131.
239400 SEG-DELETE-131.
239500     PERFORM DE-LETE.
239600 SEG-WRITE-131.
239700     MOVE "SEG-TEST-131" TO PAR-NAME.
239800     PERFORM PRINT-DETAIL.
239900 SEG-TEST-132.
240000     MOVE SPACE TO TEST-CHECK.
240100     PERFORM 19.
240200     IF TEST-CHECK EQUAL TO "GOOD"
240300         PERFORM PASS
240400         GO TO SEG-WRITE-132.
240500     MOVE SPACE TO COMPUTED-A.
240600     MOVE "GOOD" TO CORRECT-A.
240700     PERFORM FAIL.
240800     GO TO SEG-WRITE-132.
240900 SEG-DELETE-132.
241000     PERFORM DE-LETE.
241100 SEG-WRITE-132.
241200     MOVE "SEG-TEST-132" TO PAR-NAME.
241300     PERFORM PRINT-DETAIL.
241400 SEG-TEST-133.
241500     MOVE SPACE TO TEST-CHECK.
241600     PERFORM 18.
241700     IF TEST-CHECK EQUAL TO "GOOD"
241800         PERFORM PASS
241900         GO TO SEG-WRITE-133.
242000     MOVE SPACE TO COMPUTED-A.
242100     MOVE "GOOD" TO CORRECT-A.
242200     PERFORM FAIL.
242300     GO TO SEG-WRITE-133.
242400 SEG-DELETE-133.
242500     PERFORM DE-LETE.
242600 SEG-WRITE-133.
242700     MOVE "SEG-TEST-133" TO PAR-NAME.
242800     PERFORM PRINT-DETAIL.
242900 SEG-TEST-134.
243000     MOVE SPACE TO TEST-CHECK.
243100     PERFORM 17.
243200     IF TEST-CHECK EQUAL TO "GOOD"
243300         PERFORM PASS
243400         GO TO SEG-WRITE-134.
243500     MOVE SPACE TO COMPUTED-A.
243600     MOVE "GOOD" TO CORRECT-A.
243700     PERFORM FAIL.
243800     GO TO SEG-WRITE-134.
243900 SEG-DELETE-134.
244000     PERFORM DE-LETE.
244100 SEG-WRITE-134.
244200     MOVE "SEG-TEST-134" TO PAR-NAME.
244300     PERFORM PRINT-DETAIL.
244400 SEG-TEST-135.
244500     MOVE SPACE TO TEST-CHECK.
244600     PERFORM 16.
244700     IF TEST-CHECK EQUAL TO "GOOD"
244800         PERFORM PASS
244900         GO TO SEG-WRITE-135.
245000     MOVE SPACE TO COMPUTED-A.
245100     MOVE "GOOD" TO CORRECT-A.
245200     PERFORM FAIL.
245300     GO TO SEG-WRITE-135.
245400 SEG-DELETE-135.
245500     PERFORM DE-LETE.
245600 SEG-WRITE-135.
245700     MOVE "SEG-TEST-135" TO PAR-NAME.
245800     PERFORM PRINT-DETAIL.
245900 SEG-TEST-136.
246000     MOVE SPACE TO TEST-CHECK.
246100     PERFORM 15.
246200     IF TEST-CHECK EQUAL TO "GOOD"
246300         PERFORM PASS
246400         GO TO SEG-WRITE-136.
246500     MOVE SPACE TO COMPUTED-A.
246600     MOVE "GOOD" TO CORRECT-A.
246700     PERFORM FAIL.
246800     GO TO SEG-WRITE-136.
246900 SEG-DELETE-136.
247000     PERFORM DE-LETE.
247100 SEG-WRITE-136.
247200     MOVE "SEG-TEST-136" TO PAR-NAME.
247300     PERFORM PRINT-DETAIL.
247400 SEG-TEST-137.
247500     MOVE SPACE TO TEST-CHECK.
247600     PERFORM 14.
247700     IF TEST-CHECK EQUAL TO "GOOD"
247800         PERFORM PASS
247900         GO TO SEG-WRITE-137.
248000     MOVE SPACE TO COMPUTED-A.
248100     MOVE "GOOD" TO CORRECT-A.
248200     PERFORM FAIL.
248300     GO TO SEG-WRITE-137.
248400 SEG-DELETE-137.
248500     PERFORM DE-LETE.
248600 SEG-WRITE-137.
248700     MOVE "SEG-TEST-137" TO PAR-NAME.
248800     PERFORM PRINT-DETAIL.
248900 SEG-TEST-138.
249000     MOVE SPACE TO TEST-CHECK.
249100     PERFORM 13.
249200     IF TEST-CHECK EQUAL TO "GOOD"
249300         PERFORM PASS
249400         GO TO SEG-WRITE-138.
249500     MOVE SPACE TO COMPUTED-A.
249600     MOVE "GOOD" TO CORRECT-A.
249700     PERFORM FAIL.
249800     GO TO SEG-WRITE-138.
249900 SEG-DELETE-138.
250000     PERFORM DE-LETE.
250100 SEG-WRITE-138.
250200     MOVE "SEG-TEST-138" TO PAR-NAME.
250300     PERFORM PRINT-DETAIL.
250400 SEG-TEST-139.
250500     MOVE SPACE TO TEST-CHECK.
250600     PERFORM 12.
250700     IF TEST-CHECK EQUAL TO "GOOD"
250800         PERFORM PASS
250900         GO TO SEG-WRITE-139.
251000     MOVE SPACE TO COMPUTED-A.
251100     MOVE "GOOD" TO CORRECT-A.
251200     PERFORM FAIL.
251300     GO TO SEG-WRITE-139.
251400 SEG-DELETE-139.
251500     PERFORM DE-LETE.
251600 SEG-WRITE-139.
251700     MOVE "SEG-TEST-139" TO PAR-NAME.
251800     PERFORM PRINT-DETAIL.
251900 SEG-TEST-140.
252000     MOVE SPACE TO TEST-CHECK.
252100     PERFORM 11.
252200     IF TEST-CHECK EQUAL TO "GOOD"
252300         PERFORM PASS
252400         GO TO SEG-WRITE-140.
252500     MOVE SPACE TO COMPUTED-A.
252600     MOVE "GOOD" TO CORRECT-A.
252700     PERFORM FAIL.
252800     GO TO SEG-WRITE-140.
252900 SEG-DELETE-140.
253000     PERFORM DE-LETE.
253100 SEG-WRITE-140.
253200     MOVE "SEG-TEST-140" TO PAR-NAME.
253300     PERFORM PRINT-DETAIL.
253400 SEG-TEST-141.
253500     MOVE SPACE TO TEST-CHECK.
253600     PERFORM 10.
253700     IF TEST-CHECK EQUAL TO "GOOD"
253800         PERFORM PASS
253900         GO TO SEG-WRITE-141.
254000     MOVE SPACE TO COMPUTED-A.
254100     MOVE "GOOD" TO CORRECT-A.
254200     PERFORM FAIL.
254300     GO TO SEG-WRITE-141.
254400 SEG-DELETE-141.
254500     PERFORM DE-LETE.
254600 SEG-WRITE-141.
254700     MOVE "SEG-TEST-141" TO PAR-NAME.
254800     PERFORM PRINT-DETAIL.
254900 SEG-TEST-142.
255000     MOVE SPACE TO TEST-CHECK.
255100     PERFORM 09.
255200     IF TEST-CHECK EQUAL TO "GOOD"
255300         PERFORM PASS
255400         GO TO SEG-WRITE-142.
255500     MOVE SPACE TO COMPUTED-A.
255600     MOVE "GOOD" TO CORRECT-A.
255700     PERFORM FAIL.
255800     GO TO SEG-WRITE-142.
255900 SEG-DELETE-142.
256000     PERFORM DE-LETE.
256100 SEG-WRITE-142.
256200     MOVE "SEG-TEST-142" TO PAR-NAME.
256300     PERFORM PRINT-DETAIL.
256400 SEG-TEST-143.
256500     MOVE SPACE TO TEST-CHECK.
256600     PERFORM 08.
256700     IF TEST-CHECK EQUAL TO "GOOD"
256800         PERFORM PASS
256900         GO TO SEG-WRITE-143.
257000     MOVE SPACE TO COMPUTED-A.
257100     MOVE "GOOD" TO CORRECT-A.
257200     PERFORM FAIL.
257300     GO TO SEG-WRITE-143.
257400 SEG-DELETE-143.
257500     PERFORM DE-LETE.
257600 SEG-WRITE-143.
257700     MOVE "SEG-TEST-143" TO PAR-NAME.
257800     PERFORM PRINT-DETAIL.
257900 SEG-TEST-144.
258000     MOVE SPACE TO TEST-CHECK.
258100     PERFORM 07.
258200     IF TEST-CHECK EQUAL TO "GOOD"
258300         PERFORM PASS
258400         GO TO SEG-WRITE-144.
258500     MOVE SPACE TO COMPUTED-A.
258600     MOVE "GOOD" TO CORRECT-A.
258700     PERFORM FAIL.
258800     GO TO SEG-WRITE-144.
258900 SEG-DELETE-144.
259000     PERFORM DE-LETE.
259100 SEG-WRITE-144.
259200     MOVE "SEG-TEST-144" TO PAR-NAME.
259300     PERFORM PRINT-DETAIL.
259400 SEG-TEST-145.
259500     MOVE SPACE TO TEST-CHECK.
259600     PERFORM 06.
259700     IF TEST-CHECK EQUAL TO "GOOD"
259800         PERFORM PASS
259900         GO TO SEG-WRITE-145.
260000     MOVE SPACE TO COMPUTED-A.
260100     MOVE "GOOD" TO CORRECT-A.
260200     PERFORM FAIL.
260300     GO TO SEG-WRITE-145.
260400 SEG-DELETE-145.
260500     PERFORM DE-LETE.
260600 SEG-WRITE-145.
260700     MOVE "SEG-TEST-145" TO PAR-NAME.
260800     PERFORM PRINT-DETAIL.
260900 SEG-TEST-146.
261000     MOVE SPACE TO TEST-CHECK.
261100     PERFORM 05.
261200     IF TEST-CHECK EQUAL TO "GOOD"
261300         PERFORM PASS
261400         GO TO SEG-WRITE-146.
261500     MOVE SPACE TO COMPUTED-A.
261600     MOVE "GOOD" TO CORRECT-A.
261700     PERFORM FAIL.
261800     GO TO SEG-WRITE-146.
261900 SEG-DELETE-146.
262000     PERFORM DE-LETE.
262100 SEG-WRITE-146.
262200     MOVE "SEG-TEST-146" TO PAR-NAME.
262300     PERFORM PRINT-DETAIL.
262400 SEG-TEST-147.
262500     MOVE SPACE TO TEST-CHECK.
262600     PERFORM 04.
262700     IF TEST-CHECK EQUAL TO "GOOD"
262800         PERFORM PASS
262900         GO TO SEG-WRITE-147.
263000     MOVE SPACE TO COMPUTED-A.
263100     MOVE "GOOD" TO CORRECT-A.
263200     PERFORM FAIL.
263300     GO TO SEG-WRITE-147.
263400 SEG-DELETE-147.
263500     PERFORM DE-LETE.
263600 SEG-WRITE-147.
263700     MOVE "SEG-TEST-147" TO PAR-NAME.
263800     PERFORM PRINT-DETAIL.
263900 SEG-TEST-148.
264000     MOVE SPACE TO TEST-CHECK.
264100     PERFORM 03.
264200     IF TEST-CHECK EQUAL TO "GOOD"
264300         PERFORM PASS
264400         GO TO SEG-WRITE-148.
264500     MOVE SPACE TO COMPUTED-A.
264600     MOVE "GOOD" TO CORRECT-A.
264700     PERFORM FAIL.
264800     GO TO SEG-WRITE-148.
264900 SEG-DELETE-148.
265000     PERFORM DE-LETE.
265100 SEG-WRITE-148.
265200     MOVE "SEG-TEST-148" TO PAR-NAME.
265300     PERFORM PRINT-DETAIL.
265400 SEG-TEST-149.
265500     MOVE SPACE TO TEST-CHECK.
265600     PERFORM 02.
265700     IF TEST-CHECK EQUAL TO "GOOD"
265800         PERFORM PASS
265900         GO TO SEG-WRITE-149.
266000     MOVE SPACE TO COMPUTED-A.
266100     MOVE "GOOD" TO CORRECT-A.
266200     PERFORM FAIL.
266300     GO TO SEG-WRITE-149.
266400 SEG-DELETE-149.
266500     PERFORM DE-LETE.
266600 SEG-WRITE-149.
266700     MOVE "SEG-TEST-149" TO PAR-NAME.
266800     PERFORM PRINT-DETAIL.
266900 SEG-TEST-150.
267000     MOVE SPACE TO TEST-CHECK.
267100     PERFORM 01.
267200     IF TEST-CHECK EQUAL TO "GOOD"
267300         PERFORM PASS
267400         GO TO SEG-WRITE-150.
267500     MOVE SPACE TO COMPUTED-A.
267600     MOVE "GOOD" TO CORRECT-A.
267700     PERFORM FAIL.
267800     GO TO SEG-WRITE-150.
267900 SEG-DELETE-150.
268000     PERFORM DE-LETE.
268100 SEG-WRITE-150.
268200     MOVE "SEG-TEST-150" TO PAR-NAME.
268300     PERFORM PRINT-DETAIL.
268400 SEG-TEST-151.
268500     MOVE SPACE TO TEST-CHECK.
268600     PERFORM 00.
268700     IF TEST-CHECK EQUAL TO "GOOD"
268800         PERFORM PASS
268900         GO TO SEG-WRITE-151.
269000     MOVE SPACE TO COMPUTED-A.
269100     MOVE "GOOD" TO CORRECT-A.
269200     PERFORM FAIL.
269300     GO TO SEG-WRITE-151.
269400 SEG-DELETE-151.
269500     PERFORM DE-LETE.
269600 SEG-WRITE-151.
269700     MOVE "SEG-TEST-151" TO PAR-NAME.
269800     PERFORM PRINT-DETAIL.
269900     GO TO     CLOSE-FILES.
270000 50  SECTION 50.
270100 PARA-50.
270200     MOVE "GOOD" TO TEST-CHECK.
270300 51  SECTION 51.
270400 PARA-51.
270500     MOVE "GOOD" TO TEST-CHECK.
270600 52  SECTION 52.
270700 PARA-52.
270800     MOVE "GOOD" TO TEST-CHECK.
270900 53  SECTION 53.
271000 PARA-53.
271100     MOVE "GOOD" TO TEST-CHECK.
271200 54  SECTION 54.
271300 PARA-54.
271400     MOVE "GOOD" TO TEST-CHECK.
271500 55  SECTION 55.
271600 PARA-55.
271700     MOVE "GOOD" TO TEST-CHECK.
271800 56  SECTION 56.
271900 PARA-56.
272000     MOVE "GOOD" TO TEST-CHECK.
272100 57  SECTION 57.
272200 PARA-57.
272300     MOVE "GOOD" TO TEST-CHECK.
272400 58  SECTION 58.
272500 PARA-58.
272600     MOVE "GOOD" TO TEST-CHECK.
272700 59  SECTION 59.
272800 PARA-59.
272900     MOVE "GOOD" TO TEST-CHECK.
273000 60  SECTION 60.
273100 PARA-60.
273200     MOVE "GOOD" TO TEST-CHECK.
273300 61  SECTION 61.
273400 PARA-61.
273500     MOVE "GOOD" TO TEST-CHECK.
273600 62  SECTION 62.
273700 PARA-62.
273800     MOVE "GOOD" TO TEST-CHECK.
273900 63  SECTION 63.
274000 PARA-63.
274100     MOVE "GOOD" TO TEST-CHECK.
274200 64  SECTION 64.
274300 PARA-64.
274400     MOVE "GOOD" TO TEST-CHECK.
274500 65  SECTION 65.
274600 PARA-65.
274700     MOVE "GOOD" TO TEST-CHECK.
274800 66  SECTION 66.
274900 PARA-66.
275000     MOVE "GOOD" TO TEST-CHECK.
275100 67  SECTION 67.
275200 PARA-67.
275300     MOVE "GOOD" TO TEST-CHECK.
275400 68  SECTION 68.
275500 PARA-68.
275600     MOVE "GOOD" TO TEST-CHECK.
275700 69  SECTION 69.
275800 PARA-69.
275900     MOVE "GOOD" TO TEST-CHECK.
276000 70  SECTION 70.
276100 PARA-70.
276200     MOVE "GOOD" TO TEST-CHECK.
276300 71  SECTION 71.
276400 PARA-71.
276500     MOVE "GOOD" TO TEST-CHECK.
276600 72  SECTION 72.
276700 PARA-72.
276800     MOVE "GOOD" TO TEST-CHECK.
276900 73  SECTION 73.
277000 PARA-73.
277100     MOVE "GOOD" TO TEST-CHECK.
277200 74  SECTION 74.
277300 PARA-74.
277400     MOVE "GOOD" TO TEST-CHECK.
277500 75  SECTION 75.
277600 PARA-75.
277700     MOVE "GOOD" TO TEST-CHECK.
277800 76  SECTION 76.
277900 PARA-76.
278000     MOVE "GOOD" TO TEST-CHECK.
278100 77  SECTION 77.
278200 PARA-77.
278300     MOVE "GOOD" TO TEST-CHECK.
278400 78  SECTION 78.
278500 PARA-78.
278600     MOVE "GOOD" TO TEST-CHECK.
278700 79  SECTION 79.
278800 PARA-79.
278900     MOVE "GOOD" TO TEST-CHECK.
279000 80  SECTION 80.
279100 PARA-80.
279200     MOVE "GOOD" TO TEST-CHECK.
279300 81  SECTION 81.
279400 PARA-81.
279500     MOVE "GOOD" TO TEST-CHECK.
279600 82  SECTION 82.
279700 PARA-82.
279800     MOVE "GOOD" TO TEST-CHECK.
279900 83  SECTION 83.
280000 PARA-83.
280100     MOVE "GOOD" TO TEST-CHECK.
280200 84  SECTION 84.
280300 PARA-84.
280400     MOVE "GOOD" TO TEST-CHECK.
280500 85  SECTION 85.
280600 PARA-85.
280700     MOVE "GOOD" TO TEST-CHECK.
280800 86  SECTION 86.
280900 PARA-86.
281000     MOVE "GOOD" TO TEST-CHECK.
281100 87  SECTION 87.
281200 PARA-87.
281300     MOVE "GOOD" TO TEST-CHECK.
281400 88  SECTION 88.
281500 PARA-88.
281600     MOVE "GOOD" TO TEST-CHECK.
281700 89  SECTION 89.
281800 PARA-89.
281900     MOVE "GOOD" TO TEST-CHECK.
282000 90  SECTION 90.
282100 PARA-90.
282200     MOVE "GOOD" TO TEST-CHECK.
282300 91  SECTION 91.
282400 PARA-91.
282500     MOVE "GOOD" TO TEST-CHECK.
282600 92  SECTION 92.
282700 PARA-92.
282800     MOVE "GOOD" TO TEST-CHECK.
282900 93  SECTION 93.
283000 PARA-93.
283100     MOVE "GOOD" TO TEST-CHECK.
283200 94  SECTION 94.
283300 PARA-94.
283400     MOVE "GOOD" TO TEST-CHECK.
283500 95  SECTION 95.
283600 PARA-95.
283700     MOVE "GOOD" TO TEST-CHECK.
283800 96  SECTION 96.
283900 PARA-96.
284000     MOVE "GOOD" TO TEST-CHECK.
284100 97  SECTION 97.
284200 PARA-97.
284300     MOVE "GOOD" TO TEST-CHECK.
284400 98  SECTION 98.
284500 PARA-98.
284600     MOVE "GOOD" TO TEST-CHECK.
284700 99  SECTION 99.
284800 PARA-99.
284900     MOVE "GOOD" TO TEST-CHECK.
