000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SG204A.
000400 AUTHOR.
000500     FEDERAL COMPILER TESTING CENTER.
000600 INSTALLATION.
000700     GENERAL SERVICES ADMINISTRATION
000800     AUTOMATED DATA AND TELECOMMUNICATION SERVICE.
000900     SOFTWARE DEVELOPMENT OFFICE.
001000     5203 LEESBURG PIKE  SUITE 1100
001100     FALLS CHURCH VIRGINIA 22041.
001200
001300     PHONE   (703) 756-6153
001400
001500     " HIGH       ".
001600 DATE-WRITTEN.
001700     CCVS-74 VERSION 4.0 - 1980 JULY 1.
001800     CREATION DATE     /    VALIDATION DATE
001900     "4.2 ".
002000 SECURITY.
002100     NONE.
002200     THIS PROGRAM CONTAINS 3 SORTS USING NUMERIC OR ALPHABETIC
002300     KEYS - BUT NOT BOTH IN THE SAME KEY  DUE TO DIFFERING
002400     COLLATING SEQUENCES AMONG COMPUTERS. EXTERNAL FILES ARE
002500     GENERATED INTERNALLY FOR SUBSEQUENT USE. THE SELECT CLAUSE
002600     IS HIGHLY DEPENDENT ON HARDWARE. THE USER SHOULD EXERCISE THE
002700     VARIOUS OPTIONS OF HARDWARE ASSIGNMENTS TO THE EXTENT THEY
002800     ARE AVAILABLE. THE SORT OF A MULTI-REEL FILE IS EXERCISED
002900     IN PROGRAM ST202. HOWEVER THE EXERCISE OF THE "FOR MULTIPLE
003000     REEL-UNIT" OF THE GIVING OPTION IS NOT DUE TO THE INDETER-
003100     MINATE LENGTH OF SUCH A FILE (E.G. RECORDING DENSITY OR SIZE
003200     OF UNIT) AND PROCESSING COST. SORT INPUT-OUTPUT OPTIONS
003300     WILL BE EXERCISED AS FOLLOWS.
003400         SORT 1  USING        GIVING
003500         SORT 2  INPUT PROC   GIVING
003600         SORT 3  INPUT PROC   OUTPUT PROC
003700     THIS PROGRAM ALSO EXERCISES THE "SAME RECORD AREA" CLAUSE.
003800
003900 ENVIRONMENT DIVISION.
004000 CONFIGURATION SECTION.
004100 SOURCE-COMPUTER.
004200     XXXXX082.
004300 OBJECT-COMPUTER.
004400     XXXXX083.
004500 INPUT-OUTPUT SECTION.
004600 FILE-CONTROL.
004700     SELECT PRINT-FILE ASSIGN TO
004800     XXXXX055.
004900     SELECT SORT1 ASSIGN TO
005000     XXXXX027.
005100     SELECT SORT2 ASSIGN TO
005200     XXXXX028.
005300     SELECT SORT3 ASSIGN TO
005400     XXXXX029.
005500     SELECT FILE1 ASSIGN TO
005600     XXXXX001.
005700     SELECT FILE2 ASSIGN TO
005800     XXXXX014
005900         RESERVE 1 AREA.
006000     SELECT FILE3 ASSIGN TO
006100     XXXXX015
006200         RESERVE 4 AREAS.
006300 I-O-CONTROL.
006400     SAME RECORD AREA FOR SORT1 SORT2
006500     SAME RECORD AREA FOR SORT3 FILE3.
006600 DATA DIVISION.
006700 FILE SECTION.
006800 FD  PRINT-FILE
006900     LABEL RECORDS
007000     XXXXX084
007100     DATA RECORD IS PRINT-REC DUMMY-RECORD.
007200 01  PRINT-REC PICTURE X(120).
007300 01  DUMMY-RECORD PICTURE X(120).
007400 FD  FILE1
007500     LABEL RECORDS ARE STANDARD
007600     VALUE OF
007700     XXXXX074
007800     IS
007900     XXXXX075
008000     BLOCK CONTAINS 10 RECORDS
008100     DATA RECORD R1.
008200 01  R1.
008300     02  FILLER PICTURE X(120).
008400 FD  FILE2
008500     LABEL RECORDS ARE STANDARD
008600     VALUE OF
008700     XXXXX074
008800     IS
008900     XXXXX076
009000     BLOCK CONTAINS 10 RECORDS
009100     DATA RECORD R2.
009200 01  R2.
009300     02  R2-KEYS.
009400         03  R2-1 PICTURE 999.
009500         03  R2-2 PICTURE AA.
009600         03  R2-3 PICTURE AA.
009700     02  FILLER PICTURE X(113).
009800 FD  FILE3
009900     BLOCK CONTAINS 10 RECORDS
010000     LABEL RECORDS ARE STANDARD
010100     VALUE OF
010200     XXXXX074
010300     IS
010400     XXXXX077
010500     DATA RECORD IS R3.
010600 01  R3.
010700     02  R3-KEYS.
010800         03  R3-1 PICTURE 999.
010900         03  R3-2 PICTURE AA.
011000         03  R3-3 PICTURE AA.
011100         03  R3-4 PICTURE 9999.
011200     02  FILLER PICTURE X(109).
011300 SD  SORT1
011400     RECORD CONTAINS 120 CHARACTERS
011500     DATA RECORD IS S1.
011600 01  S1.
011700     02  S1-KEYS.
011800         03  S1-1 PICTURE 999.
011900         03  S1-2 PICTURE AA.
012000     02  FILLER PICTURE X(115).
012100 SD  SORT2
012200     RECORD 120
012300     DATA RECORD IS S2.
012400 01  S2.
012500     02  S2-KEYS.
012600         03  S2-1 PICTURE 999.
012700         03  S2-2 PICTURE AA.
012800         03  S2-3 PICTURE AA.
012900     02  FILLER PICTURE X(113).
013000 SD  SORT3
013100     RECORD 120 CHARACTERS
013200     DATA RECORD S3.
013300 01  S3.
013400     02  S3-KEYS.
013500         03  S3-1 PICTURE 999.
013600         03  S3-2 PICTURE AA.
013700         03  S3-3 PICTURE AA.
013800         03  S3-4 PICTURE 9999.
013900     02  FILLER PICTURE X(109).
014000 WORKING-STORAGE SECTION.
014100 77  SUBSCRIPT-1 PICTURE  99 COMPUTATIONAL VALUE ZERO.
014200 77  C0 PICTURE  99 COMPUTATIONAL VALUE ZERO.
014300 77  C1 PICTURE  99 COMPUTATIONAL VALUE 1.
014400 77  CA PICTURE A VALUE "A".
014500 77  CB PICTURE A VALUE "B".
014600 01  ALPHA-TABLE.
014700     02  ALPHA-TAB PICTURE IS A(25) VALUE IS "ABCDEFGHIJKLMNPQRSTU
014800-    "VWXYZ".
014900     02  ALPHA-TBL REDEFINES ALPHA-TAB PICTURE A OCCURS 25 TIMES.
015000 01  W-KEYS.
015100     02  W-S3-KEYS.
015200         03  W-S2-KEYS.
015300             04  W-S1-KEYS.
015400                 05  S1-1W PICTURE 999 VALUE 567.
015500                 05  S1-2W.
015600                     06  S1-2W-A PICTURE A.
015700                     06  S1-2W-B PICTURE A.
015800             04  S2-3W.
015900                 05  S2-3W-A PICTURE A.
016000                 05  S2-3W-B PICTURE A.
016100         03  S3-4W PICTURE 9999 VALUE 7051.
016200 01  TEST-RESULTS.
016300     02 FILLER                    PICTURE X VALUE SPACE.
016400     02 FEATURE                   PICTURE X(20) VALUE SPACE.
016500     02 FILLER                    PICTURE X VALUE SPACE.
016600     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
016700     02 FILLER                    PICTURE X  VALUE SPACE.
016800     02  PAR-NAME.
016900       03 FILLER PICTURE X(12) VALUE SPACE.
017000       03  PARDOT-X PICTURE X  VALUE SPACE.
017100       03 DOTVALUE PICTURE 99  VALUE ZERO.
017200       03 FILLER PIC X(5) VALUE SPACE.
017300     02 FILLER PIC X(10) VALUE SPACE.
017400     02 RE-MARK PIC X(61).
017500 01  TEST-COMPUTED.
017600     02 FILLER PIC X(30) VALUE SPACE.
017700     02 FILLER PIC X(17) VALUE "       COMPUTED=".
017800     02 COMPUTED-X.
017900     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
018000     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
018100     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
018200     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
018300     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
018400     03       CM-18V0 REDEFINES COMPUTED-A.
018500         04 COMPUTED-18V0                   PICTURE -9(18).
018600         04 FILLER                          PICTURE X.
018700     03 FILLER PIC X(50) VALUE SPACE.
018800 01  TEST-CORRECT.
018900     02 FILLER PIC X(30) VALUE SPACE.
019000     02 FILLER PIC X(17) VALUE "       CORRECT =".
019100     02 CORRECT-X.
019200     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
019300     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
019400     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
019500     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
019600     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
019700     03      CR-18V0 REDEFINES CORRECT-A.
019800         04 CORRECT-18V0                    PICTURE -9(18).
019900         04 FILLER                          PICTURE X.
020000     03 FILLER PIC X(50) VALUE SPACE.
020100 01  CCVS-C-1.
020200     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
020300-    "SS  PARAGRAPH-NAME
020400-    "        REMARKS".
020500     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
020600 01  CCVS-C-2.
020700     02 FILLER PICTURE IS X VALUE IS SPACE.
020800     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
020900     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
021000     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
021100     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
021200 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
021300 01  REC-CT PICTURE 99 VALUE ZERO.
021400 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
021500 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
021600 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
021700 01  PASS-COUNTER PIC 999 VALUE ZERO.
021800 01  TOTAL-ERROR PIC 999 VALUE ZERO.
021900 01  ERROR-HOLD PIC 999 VALUE ZERO.
022000 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
022100 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
022200 01  CCVS-H-1.
022300     02  FILLER   PICTURE X(27)  VALUE SPACE.
022400     02 FILLER PICTURE X(67) VALUE
022500     " FEDERAL COMPILER TESTING CENTER COBOL COMPILER VALIDATION
022600-    " SYSTEM".
022700     02  FILLER     PICTURE X(26)  VALUE SPACE.
022800 01  CCVS-H-2.
022900     02 FILLER PICTURE X(52) VALUE IS
023000     "CCVS74 NCC  COPY, NOT FOR DISTRIBUTION.".
023100     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
023200     02 TEST-ID PICTURE IS X(9).
023300     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
023400 01  CCVS-H-3.
023500     02  FILLER PICTURE X(34) VALUE
023600     " FOR OFFICIAL USE ONLY    ".
023700     02  FILLER PICTURE X(58) VALUE
023800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
023900     02  FILLER PICTURE X(28) VALUE
024000     "  COPYRIGHT   1974 ".
024100 01  CCVS-E-1.
024200     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
024300     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
024400     02 ID-AGAIN PICTURE IS X(9).
024500     02 FILLER PICTURE X(45) VALUE IS
024600     " NTIS DISTRIBUTION COBOL 74".
024700 01  CCVS-E-2.
024800     02  FILLER                   PICTURE X(31)  VALUE
024900     SPACE.
025000     02  FILLER                   PICTURE X(21)  VALUE SPACE.
025100     02 CCVS-E-2-2.
025200         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
025300         03 FILLER PICTURE IS X VALUE IS SPACE.
025400         03 ENDER-DESC PIC X(44) VALUE "ERRORS ENCOUNTERED".
025500 01  CCVS-E-3.
025600     02  FILLER PICTURE X(22) VALUE
025700     " FOR OFFICIAL USE ONLY".
025800     02  FILLER PICTURE X(12) VALUE SPACE.
025900     02  FILLER PICTURE X(58) VALUE
026000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026100     02  FILLER PICTURE X(13) VALUE SPACE.
026200     02 FILLER PIC X(15) VALUE " COPYRIGHT 1974".
026300 01  CCVS-E-4.
026400     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
026500     02 FILLER PIC XXXX VALUE " OF ".
026600     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
026700     02 FILLER PIC X(40) VALUE
026800      "  TESTS WERE EXECUTED SUCCESSFULLY".
026900 01  XXINFO.
027000     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
027100     02 INFO-TEXT.
027200     04 FILLER PIC X(20) VALUE SPACE.
027300     04 XXCOMPUTED PIC X(20).
027400     04 FILLER PIC X(5) VALUE SPACE.
027500     04 XXCORRECT PIC X(20).
027600 01  HYPHEN-LINE.
027700     02 FILLER PICTURE IS X VALUE IS SPACE.
027800     02 FILLER PICTURE IS X(65) VALUE IS "************************
027900-    "*****************************************".
028000     02 FILLER PICTURE IS X(54) VALUE IS "************************
028100-    "******************************".
028200 01  CCVS-PGM-ID PIC X(6) VALUE
028300     "SG204A".
028400 PROCEDURE DIVISION.
028500 CCVS1 SECTION.
028600 OPEN-FILES.
028700     OPEN     OUTPUT PRINT-FILE.
028800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
028900     MOVE    SPACE TO TEST-RESULTS.
029000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
029100     GO TO CCVS1-EXIT.
029200 CLOSE-FILES.
029300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029400 TERMINATE-CCVS.
029500S    EXIT PROGRAM.
029600STERMINATE-CALL.
029700     STOP     RUN.
029800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
029900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
030000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
030100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
030200     MOVE "****TEST DELETED****" TO RE-MARK.
030300 PRINT-DETAIL.
030400     IF REC-CT NOT EQUAL TO ZERO
030500             MOVE "." TO PARDOT-X
030600             MOVE REC-CT TO DOTVALUE.
030700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
030800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
030900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
031000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
031100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
031200     MOVE SPACE TO CORRECT-X.
031300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
031400     MOVE     SPACE TO RE-MARK.
031500 HEAD-ROUTINE.
031600     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031700     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
031800     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
031900 COLUMN-NAMES-ROUTINE.
032000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
032300 END-ROUTINE.
032400     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
032500 END-RTN-EXIT.
032600     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032700 END-ROUTINE-1.
032800      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
032900      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
033000      ADD PASS-COUNTER TO ERROR-HOLD.
033100*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
033200      MOVE PASS-COUNTER TO CCVS-E-4-1.
033300      MOVE ERROR-HOLD TO CCVS-E-4-2.
033400      MOVE CCVS-E-4 TO CCVS-E-2-2.
033500      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
033600  END-ROUTINE-12.
033700      MOVE "TEST(S) FAILED" TO ENDER-DESC.
033800     IF       ERROR-COUNTER IS EQUAL TO ZERO
033900         MOVE "NO " TO ERROR-TOTAL
034000         ELSE
034100         MOVE ERROR-COUNTER TO ERROR-TOTAL.
034200     MOVE     CCVS-E-2 TO DUMMY-RECORD.
034300     PERFORM WRITE-LINE.
034400 END-ROUTINE-13.
034500     IF DELETE-CNT IS EQUAL TO ZERO
034600         MOVE "NO " TO ERROR-TOTAL  ELSE
034700         MOVE DELETE-CNT TO ERROR-TOTAL.
034800     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
034900     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035000      IF   INSPECT-COUNTER EQUAL TO ZERO
035100          MOVE "NO " TO ERROR-TOTAL
035200      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
035300      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
035400      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035500     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035600 WRITE-LINE.
035700     ADD 1 TO RECORD-COUNT.
035800Y    IF RECORD-COUNT GREATER 50
035900Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
036000Y        MOVE SPACE TO DUMMY-RECORD
036100Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
036200Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
036300Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
036400Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
036500Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
036600Y        MOVE ZERO TO RECORD-COUNT.
036700     PERFORM WRT-LN.
036800 WRT-LN.
036900     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
037000     MOVE SPACE TO DUMMY-RECORD.
037100 BLANK-LINE-PRINT.
037200     PERFORM WRT-LN.
037300 FAIL-ROUTINE.
037400     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037500     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
037600     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
037700     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037800     GO TO FAIL-ROUTINE-EX.
037900 FAIL-ROUTINE-WRITE.
038000     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
038100     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038200 FAIL-ROUTINE-EX. EXIT.
038300 BAIL-OUT.
038400     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
038500     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
038600 BAIL-OUT-WRITE.
038700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
038800     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038900 BAIL-OUT-EX. EXIT.
039000 CCVS1-EXIT.
039100     EXIT.
039200 P1-CREATE-F1.
039300     OPEN    OUTPUT FILE1.
039400     MOVE CA TO S1-2W-A.
039500     MOVE CB TO S2-3W-A.
039600 P2-CREATE-F1.
039700     PERFORM P4-CREATE-F1 2 TIMES.
039800 P3-CREATE-F1.
039900     MOVE CA TO S2-3W-A.
040000     PERFORM P4-CREATE-F1 2 TIMES.
040100     CLOSE FILE1.
040200     GO TO FIRST-SORT.
040300 P4-CREATE-F1.
040400     MOVE C0 TO SUBSCRIPT-1.
040500     PERFORM P5-CREATE-F1 25 TIMES.
040600 P5-CREATE-F1.
040700     ADD C1 TO SUBSCRIPT-1.
040800     SUBTRACT C1 FROM S3-4W.
040900     MOVE ALPHA-TBL (SUBSCRIPT-1) TO S1-2W-B S2-3W-B.
041000     MOVE W-S3-KEYS TO R1.
041100     WRITE R1.
041200 F1-NOTE.
041300*    NOTE.
041400*      KEY-1 WILL BE 567 IN ALL RECORDS.
041500*      KEY-2 WILL BE >A> IN FIRST LETTER WITH 4 OCCURRENCES OF THE
041600*        ALPHABET IN THE SECOND LETTER.
041700*      KEY-3 WILL BE >A> OR >B> IN FIRST LETTER WITH 2 OCCURRENCES
041800*        OF THE ALPHABET FOR EACH IN THE SECOND LETTER.
041900*      KEY-4 WILL VARY FROM 7050 THRU 6951.
042000*      THE LETTER "O" HAS BEEN OMITTED.
042100 SRT-1 SECTION 69.
042200 FIRST-SORT.
042300     SORT SORT1
042400         ON DESCENDING KEY S1-1
042500         ON ASCENDING KEY S1-2
042600         USING FILE1
042700         GIVING FILE2.
042800*    NOTE SORT STATEMENT WITH ALL OPTIONAL WORDS.
042900*    NOTE OUTPUT WILL BE TESTED IN THE FOLLOWING INPUT PROCEDURE.
043000 SRT-2 SECTION 48.
043100 SECOND-SORT.
043200     SORT SORT2
043300         ASCENDING S2-1
043400         DESCENDING S2-2
043500         ASCENDING S2-3
043600         INPUT PROCEDURE SRT-2-INPUT
043700         GIVING FILE3.
043800*      NOTE SORT STATEMENT WITH ALL OPTIONAL WORDS OMITTED.
043900     GO TO SRT-3.
044000 SRT-2-INPUT SECTION 74.
044100 OPEN-1.
044200     OPEN     INPUT FILE2.
044300     MOVE     "SORT, INPUT PROC" TO FEATURE.
044400 SORT-TEST-1.
044500     PERFORM  READ-RELEASE-FILE2.
044600     IF       W-S1-KEYS EQUAL TO "567AA"
044700              PERFORM PASS-1 GO TO SORT-WRITE-1.
044800     GO       TO SORT-FAIL-1.
044900 SORT-DELETE-1.
045000     PERFORM  DE-LETE-1.
045100     GO       TO SORT-WRITE-1.
045200 SORT-FAIL-1.
045300     MOVE     W-S1-KEYS TO COMPUTED-A.
045400     MOVE     "567AA" TO CORRECT-A.
045500     PERFORM  FAIL-1.
045600 SORT-WRITE-1.
045700     MOVE     "SORT-TEST-1 " TO PAR-NAME.
045800     PERFORM  PRINT-DETAIL-1.
045900 SORT-TEST-2.
046000     PERFORM  READ-RELEASE-FILE2 35 TIMES.
046100     IF       W-S1-KEYS EQUAL TO "567AI"
046200              PERFORM PASS-1 GO TO SORT-WRITE-2.
046300     GO       TO SORT-FAIL-2.
046400 SORT-DELETE-2.
046500     PERFORM  DE-LETE-1.
046600     GO       TO SORT-WRITE-2.
046700 SORT-FAIL-2.
046800     MOVE     W-S1-KEYS TO COMPUTED-A.
046900     MOVE     "567AI" TO CORRECT-A.
047000     PERFORM  FAIL-1.
047100 SORT-WRITE-2.
047200     MOVE     "SORT-TEST-2 " TO PAR-NAME.
047300     PERFORM  PRINT-DETAIL-1.
047400 SORT-TEST-3.
047500     PERFORM  READ-RELEASE-FILE2 35 TIMES.
047600     IF       W-S1-KEYS EQUAL TO "567AS"
047700              PERFORM PASS-1 GO TO SORT-WRITE-3.
047800     GO       TO SORT-FAIL-3.
047900 SORT-DELETE-3.
048000     PERFORM  DE-LETE-1.
048100     GO       TO SORT-WRITE-3.
048200 SORT-FAIL-3.
048300     MOVE     W-S1-KEYS TO COMPUTED-A.
048400     MOVE     "567AS" TO CORRECT-A.
048500     PERFORM  FAIL-1.
048600 SORT-WRITE-3.
048700     MOVE     "SORT-TEST-3 " TO PAR-NAME.
048800     PERFORM  PRINT-DETAIL-1.
048900 SORT-TEST-4.
049000     PERFORM  READ-RELEASE-FILE2 29 TIMES.
049100     IF       W-S1-KEYS EQUAL TO "567AZ"
049200              PERFORM PASS-1 GO TO SORT-WRITE-4.
049300     GO       TO SORT-FAIL-4.
049400 SORT-DELETE-4.
049500     PERFORM  DE-LETE-1.
049600     GO       TO SORT-WRITE-4.
049700 SORT-FAIL-4.
049800     MOVE     W-S1-KEYS TO COMPUTED-A.
049900     MOVE     "567AZ" TO CORRECT-A.
050000     PERFORM  FAIL-1.
050100 SORT-WRITE-4.
050200     MOVE     "SORT-TEST-4 " TO PAR-NAME.
050300     PERFORM  PRINT-DETAIL-1.
050400 CLOSE-1.
050500     CLOSE    FILE2.
050600     GO       TO EXIT-1.
050700 READ-RELEASE-FILE2.
050800     READ     FILE2 AT END GO TO TERMINAL-1.
050900     MOVE     R2 TO W-S3-KEYS.
051000     RELEASE  S2 FROM R2.
051100 TERMINAL-1.
051200     PERFORM  FAIL-1.
051300     MOVE     "TERMINAL-1" TO PAR-NAME.
051400     MOVE     "END OF FILE PREMATURELY" TO RE-MARK.
051500     PERFORM  PRINT-DETAIL-1.
051600     MOVE     SPACE TO FEATURE.
051700     MOVE     "FOUND, PREVIOUS TEST WAS" TO RE-MARK.
051800     PERFORM  PRINT-DETAIL-1.
051900     MOVE     "LAST SUCCESSFUL TEST." TO RE-MARK.
052000     PERFORM  PRINT-DETAIL-1.
052100     GO       TO CLOSE-1.
052200 INSPT-1. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
052300 PASS-1.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
052400 FAIL-1.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
052500 DE-LETE-1.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
052600     MOVE "****TEST DELETED****" TO RE-MARK.
052700 PRINT-DETAIL-1.
052800     IF REC-CT NOT EQUAL TO ZERO
052900             MOVE "." TO PARDOT-X
053000             MOVE REC-CT TO DOTVALUE.
053100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE-1.
053200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE-1
053300        PERFORM FAIL-ROUTINE-1 THRU FAIL-ROUTINE-EX-1
053400          ELSE PERFORM BAIL-OUT-1 THRU BAIL-OUT-EX-1.
053500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
053600     MOVE SPACE TO CORRECT-X.
053700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
053800     MOVE     SPACE TO RE-MARK.
053900 WRITE-LINE-1.
054000     ADD 1 TO RECORD-COUNT.
054100Y    IF RECORD-COUNT GREATER 50
054200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
054300Y        MOVE SPACE TO DUMMY-RECORD
054400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
054500Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN-1
054600Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN-1 2 TIMES
054700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN-1
054800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
054900Y        MOVE ZERO TO RECORD-COUNT.
055000     PERFORM WRT-LN-1.
055100 WRT-LN-1.
055200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
055300     MOVE SPACE TO DUMMY-RECORD.
055400 BLANK-LINE-PRINT-1.
055500     PERFORM WRT-LN-1.
055600 FAIL-ROUTINE-1.
055700     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-RTN-WRITE-1.
055800     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-RTN-WRITE-1.
055900     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
056000     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE-1 2 TIMES.
056100     GO TO FAIL-ROUTINE-EX-1.
056200 FAIL-RTN-WRITE-1.
056300     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE-1
056400     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE-1 2 TIMES.
056500 FAIL-ROUTINE-EX-1. EXIT.
056600 BAIL-OUT-1.
056700     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE-1.
056800     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX-1.
056900 BAIL-OUT-WRITE-1.
057000     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
057100     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE-1 2 TIMES.
057200 BAIL-OUT-EX-1. EXIT.
057300 EXIT-1.
057400     EXIT.
057500 SRT-3 SECTION.
057600 THIRD-SORT.
057700     SORT SORT3
057800         ON DESCENDING KEY S3-1 S3-2 S3-3
057900         ASCENDING S3-4
058000       INPUT PROCEDURE IS SRT3-INPUT
058100       OUTPUT PROCEDURE SRT3-OUTPUT-1 THRU SRT3-OUTPUT-2.
058200 NOTE-SORT-3.
058300*    NOTE SORT STATEMENT WITH INCLUSION-OMISSION OF OPTIONAL
058400*        WORDS AND THRU OPTION. THE OUTPUT OF SRT-2 IS TESTED
058500*        IN THE INPUT PROCEDURE OF THIS (THIRD) SORT.  THE OUTPUT
058600*        OF THE THIRD SORT IS TESTED IN THE OUTPUT PROCEDURE
058700*        WITHOUT THE GENERATION OF AN OUTPUT FILE.
058800 END-FIRST-PROGRAM.
058900     GO TO CCVS-EXIT.
059000 SRT3-INPUT SECTION 49.
059100 OPEN-2.
059200     OPEN     INPUT FILE3.
059300     MOVE     "SORT, INPUT PROC" TO FEATURE.
059400 SORT-TEST-5.
059500     PERFORM  READ-RELEASE-FILE3.
059600     MOVE     R3-KEYS TO W-S3-KEYS.
059700     IF       W-S2-KEYS EQUAL TO "567AZAZ"
059800              PERFORM PASS-2 GO TO SORT-WRITE-5.
059900     GO       TO SORT-FAIL-5.
060000 SORT-DELETE-5.
060100     PERFORM  DE-LETE-2.
060200     GO       TO SORT-WRITE-5.
060300 SORT-FAIL-5.
060400     MOVE     W-S2-KEYS TO COMPUTED-A.
060500     MOVE     "567AZAZ" TO CORRECT-A.
060600     PERFORM  FAIL-2.
060700 SORT-WRITE-5.
060800     MOVE     "SORT-TEST-5 " TO PAR-NAME.
060900     PERFORM  PRINT-DETAIL-2.
061000 SORT-TEST-6.
061100     PERFORM  READ-RELEASE-FILE3 35 TIMES.
061200     MOVE     R3-KEYS TO W-S3-KEYS.
061300     IF       W-S2-KEYS EQUAL TO "567ARBR"
061400              PERFORM PASS-2 GO TO SORT-WRITE-6.
061500     GO       TO SORT-FAIL-6.
061600 SORT-DELETE-6.
061700     PERFORM  DE-LETE-2.
061800     GO       TO SORT-WRITE-6.
061900 SORT-FAIL-6.
062000     MOVE     W-S2-KEYS TO COMPUTED-A.
062100     MOVE     "567ARBR" TO CORRECT-A.
062200     PERFORM  FAIL-2.
062300 SORT-WRITE-6.
062400     MOVE     "SORT-TEST-6 " TO PAR-NAME.
062500     PERFORM  PRINT-DETAIL-2.
062600 SORT-TEST-7.
062700     PERFORM  READ-RELEASE-FILE3 35 TIMES.
062800     MOVE     R3-KEYS TO W-S3-KEYS.
062900     IF       W-S2-KEYS EQUAL TO "567AHBH"
063000              PERFORM PASS-2 GO TO SORT-WRITE-7.
063100     GO       TO SORT-FAIL-7.
063200 SORT-DELETE-7.
063300     PERFORM  DE-LETE-2.
063400     GO       TO SORT-WRITE-7.
063500 SORT-FAIL-7.
063600     MOVE     W-S2-KEYS TO COMPUTED-A.
063700     MOVE     "567AHBH" TO CORRECT-A.
063800     PERFORM  FAIL-2.
063900 SORT-WRITE-7.
064000     MOVE     "SORT-TEST-7 " TO PAR-NAME.
064100     PERFORM  PRINT-DETAIL-2.
064200 SORT-TEST-8.
064300     PERFORM  READ-RELEASE-FILE3 29 TIMES.
064400     MOVE     R3-KEYS TO W-S3-KEYS.
064500     IF       W-S2-KEYS EQUAL TO "567AABA"
064600              PERFORM PASS-2 GO TO SORT-WRITE-8.
064700     GO       TO SORT-FAIL-8.
064800 SORT-DELETE-8.
064900     PERFORM  DE-LETE-2.
065000     GO       TO SORT-WRITE-8.
065100 SORT-FAIL-8.
065200     MOVE     W-S2-KEYS TO COMPUTED-A.
065300     MOVE     "567AABA" TO CORRECT-A.
065400     PERFORM  FAIL-2.
065500 SORT-WRITE-8.
065600     MOVE     "SORT-TEST-8 " TO PAR-NAME.
065700     PERFORM  PRINT-DETAIL-2.
065800 CLOSE-2.
065900     CLOSE    FILE3.
066000     GO       TO EXIT-2.
066100 READ-RELEASE-FILE3.
066200     READ     FILE3 AT END GO TO TERMINAL-2.
066300     RELEASE  S3.
066400*    NOTE     THE FROM OPTION AND MOVE ARE REDUNDANT WITH SAME
066500*             RECORD AREA CLAUSE IN I-O CONTROL PARAGRAPH.
066600 TERMINAL-2.
066700     PERFORM  FAIL-2.
066800     MOVE     "TERMINAL-2" TO PAR-NAME.
066900     MOVE     "END OF FILE PREMATURELY" TO RE-MARK.
067000     PERFORM  PRINT-DETAIL-2.
067100     MOVE     SPACE TO FEATURE.
067200     MOVE     "FOUND, PREVIOUS TEST WAS" TO RE-MARK.
067300     PERFORM  PRINT-DETAIL-2.
067400     MOVE     "LAST SUCCESSFUL TEST" TO RE-MARK.
067500     PERFORM  PRINT-DETAIL-2.
067600     GO       TO CLOSE-2.
067700 INSPT-2. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
067800 PASS-2.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
067900 FAIL-2.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
068000 DE-LETE-2.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
068100     MOVE "****TEST DELETED****" TO RE-MARK.
068200 PRINT-DETAIL-2.
068300     IF REC-CT NOT EQUAL TO ZERO
068400             MOVE "." TO PARDOT-X
068500             MOVE REC-CT TO DOTVALUE.
068600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE-2.
068700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE-2
068800        PERFORM FAIL-ROUTINE-2 THRU FAIL-ROUTINE-EX-2
068900          ELSE PERFORM BAIL-OUT-2 THRU BAIL-OUT-EX-2.
069000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
069100     MOVE SPACE TO CORRECT-X.
069200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
069300     MOVE     SPACE TO RE-MARK.
069400 WRITE-LINE-2.
069500     ADD 1 TO RECORD-COUNT.
069600Y    IF RECORD-COUNT GREATER 50
069700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
069800Y        MOVE SPACE TO DUMMY-RECORD
069900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
070000Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN-2
070100Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN-2 2 TIMES
070200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN-2
070300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
070400Y        MOVE ZERO TO RECORD-COUNT.
070500     PERFORM WRT-LN-2.
070600 WRT-LN-2.
070700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
070800     MOVE SPACE TO DUMMY-RECORD.
070900 BLANK-LINE-PRINT-2.
071000     PERFORM WRT-LN-2.
071100 FAIL-ROUTINE-2.
071200     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-RTN-WRITE-2.
071300     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-RTN-WRITE-2.
071400     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
071500     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE-2 2 TIMES.
071600     GO TO FAIL-ROUTINE-EX-2.
071700 FAIL-RTN-WRITE-2.
071800     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE-2
071900     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE-2 2 TIMES.
072000 FAIL-ROUTINE-EX-2. EXIT.
072100 BAIL-OUT-2.
072200     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE-2.
072300     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX-2.
072400 BAIL-OUT-WRITE-2.
072500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
072600     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE-2 2 TIMES.
072700 BAIL-OUT-EX-2. EXIT.
072800 EXIT-2.
072900     EXIT.
073000 SRT3-OUTPUT-1 SECTION 25.
073100 INIT-3.
073200     MOVE     "SORT, OUTPUT PROC" TO FEATURE.
073300 SORT-TEST-9.
073400     PERFORM  RETURN-SORT3.
073500     IF       S3-KEYS EQUAL TO "567AZBZ7001"
073600              PERFORM PASS-3 GO TO SORT-WRITE-9.
073700     GO       TO SORT-FAIL-9.
073800 SORT-DELETE-9.
073900     PERFORM  DE-LETE-3.
074000     GO       TO SORT-WRITE-9.
074100 SORT-FAIL-9.
074200     MOVE     S3-KEYS TO COMPUTED-A.
074300     MOVE     "567AZBZ7001" TO CORRECT-A.
074400     PERFORM  FAIL-3.
074500 SORT-WRITE-9.
074600     MOVE     "SORT-TEST-9 " TO PAR-NAME.
074700     PERFORM  PRINT-DETAIL-3.
074800 SORT-TEST-10.
074900     PERFORM  RETURN-SORT3.
075000     IF       S3-KEYS EQUAL TO "567AZBZ7026"
075100              PERFORM PASS-3 GO TO SORT-WRITE-10.
075200     GO       TO SORT-FAIL-10.
075300 SORT-DELETE-10.
075400     PERFORM  DE-LETE-3.
075500     GO       TO SORT-WRITE-10.
075600 SORT-FAIL-10.
075700     MOVE     S3-KEYS TO COMPUTED-A.
075800     MOVE     "567AZBZ7026" TO CORRECT-A.
075900     PERFORM  FAIL-3.
076000 SORT-WRITE-10.
076100     MOVE     "SORT-TEST-10" TO PAR-NAME.
076200     PERFORM  PRINT-DETAIL-3.
076300 SORT-TEST-11.
076400     PERFORM  RETURN-SORT3 35 TIMES.
076500     IF       S3-KEYS EQUAL TO "567AQBQ7010"
076600              PERFORM PASS-3 GO TO SORT-WRITE-11.
076700     GO       TO SORT-FAIL-11.
076800 SORT-DELETE-11.
076900     PERFORM  DE-LETE-3.
077000     GO       TO SORT-WRITE-11.
077100 SORT-FAIL-11.
077200     MOVE     S3-KEYS TO COMPUTED-A.
077300     MOVE     "567AQBQ7010" TO CORRECT-A.
077400     PERFORM  FAIL-3.
077500 SORT-WRITE-11.
077600     MOVE     "SORT-TEST-11" TO PAR-NAME.
077700     PERFORM  PRINT-DETAIL-3.
077800 SORT-TEST-12.
077900     PERFORM  RETURN-SORT3.
078000     IF       S3-KEYS EQUAL TO "567AQBQ7035"
078100              PERFORM PASS-3 GO TO SORT-WRITE-12.
078200     GO       TO SORT-FAIL-12.
078300 SORT-DELETE-12.
078400     PERFORM  DE-LETE-3.
078500     GO       TO SORT-WRITE-12.
078600 SORT-FAIL-12.
078700     MOVE     S3-KEYS TO COMPUTED-A.
078800     MOVE     "567AQBQ7035" TO CORRECT-A.
078900     PERFORM  FAIL-3.
079000 SORT-WRITE-12.
079100     MOVE     "SORT-TEST-12" TO PAR-NAME.
079200     PERFORM  PRINT-DETAIL-3.
079300 SORT-TEST-13.
079400     PERFORM  RETURN-SORT3 35 TIMES.
079500     IF       S3-KEYS EQUAL TO "567AGBG7019"
079600              PERFORM PASS-3 GO TO SORT-WRITE-13.
079700     GO       TO SORT-FAIL-13.
079800 SORT-DELETE-13.
079900     PERFORM  DE-LETE-3.
080000     GO       TO SORT-WRITE-13.
080100 SORT-FAIL-13.
080200     MOVE     S3-KEYS TO COMPUTED-A.
080300     MOVE     "567AGBG7019" TO CORRECT-A.
080400     PERFORM  FAIL-3.
080500 SORT-WRITE-13.
080600     MOVE     "SORT-TEST-13" TO PAR-NAME.
080700     PERFORM  PRINT-DETAIL-3.
080800 SORT-TEST-14.
080900     PERFORM  RETURN-SORT3 27 TIMES.
081000     IF       S3-KEYS EQUAL TO "567AAAA7000"
081100              PERFORM PASS-3 GO TO SORT-WRITE-14.
081200     GO       TO SORT-FAIL-14.
081300 SORT-DELETE-14.
081400     PERFORM  DE-LETE-3.
081500     GO       TO SORT-WRITE-14.
081600 SORT-FAIL-14.
081700     MOVE     S3-KEYS TO COMPUTED-A.
081800     MOVE     "567AAAA7000" TO CORRECT-A.
081900     PERFORM  FAIL-3.
082000 SORT-WRITE-14.
082100     MOVE     "SORT-TEST-14" TO PAR-NAME.
082200     PERFORM  PRINT-DETAIL-3.
082300 SORT-TEST-15.
082400     RETURN   SORT3 RECORD AT END
082500              PERFORM PASS-3 GO TO SORT-WRITE-15.
082600*    NOTE     THE FOLLOWING SENTENCES SHOULD NOT BE EXECUTED.
082700     PERFORM FAIL-3.
082800     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
082900     GO       TO SORT-WRITE-15.
083000 SORT-DELETE-15.
083100     PERFORM  DE-LETE-3.
083200 SORT-WRITE-15.
083300     MOVE     "SORT-TEST-15" TO PAR-NAME.
083400     PERFORM  PRINT-DETAIL-3.
083500 CLOSE-3.
083600     GO       TO EXIT-3.
083700 SRT3-OUTPUT-2 SECTION 25.
083800 RETURN-SORT3.
083900     RETURN   SORT3 RECORD AT END GO TO TERMINAL-3.
084000*    NOTE     RETURN VERB WITH ALL OPTIONS EXCEPT INTO.
084100 TERMINAL-3.
084200     PERFORM  FAIL-3.
084300     MOVE     "TERMINAL-3" TO PAR-NAME.
084400     MOVE     "END OF FILE PREMATURELY" TO RE-MARK.
084500     PERFORM  PRINT-DETAIL-3.
084600     MOVE     SPACE TO FEATURE.
084700     MOVE     "FOUND, PREVIOUS TEST WAS" TO RE-MARK.
084800     PERFORM  PRINT-DETAIL-3.
084900     MOVE     "LAST SUCCESSFUL TEST." TO RE-MARK
085000     PERFORM  PRINT-DETAIL-3.
085100     GO       TO CLOSE-3.
085200 PASS-3.
085300     MOVE "PASS" TO P-OR-F.  ADD 1 TO PASS-COUNTER.
085400 FAIL-3.
085500     ADD      1 TO ERROR-COUNTER.
085600     MOVE "FAIL*" TO P-OR-F.
085700 DE-LETE-3.
085800     MOVE     SPACE TO P-OR-F.
085900     MOVE     "    ************    " TO COMPUTED-A.
086000     MOVE     "    ************    " TO CORRECT-A.
086100     MOVE "****TEST DELETED****" TO RE-MARK.
086200     ADD 1 TO DELETE-CNT.
086300 PRINT-DETAIL-3.
086400     IF REC-CT NOT EQUAL TO ZERO
086500             MOVE "." TO PARDOT-X
086600             MOVE REC-CT TO DOTVALUE.
086700     MOVE     TEST-RESULTS TO PRINT-REC.
086800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
086900     MOVE     SPACE TO P-OR-F.
087000     MOVE     SPACE TO COMPUTED-A.
087100     MOVE SPACE TO CORRECT-A.
087200     IF     REC-CT EQUAL TO ZERO
087300              MOVE SPACE TO PAR-NAME.
087400     MOVE     SPACE TO RE-MARK.
087500 EXIT-3.
087600     EXIT.
087700 END-CCVS SECTION 25.
087800 CCVS-EXIT SECTION.
087900 CCVS-999999.
088000     GO TO CLOSE-FILES.
