000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SM103A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM SM103A TESTS THE USE OF THE "COPY" STATEMENT IN   *
002300*    THE IDENTIFICATION DIVISION AND ENVIRONMENT DIVISION      *
002400*    (SOURCE-COMPUTER, OBJECT-COMPUTER, SPECIAL-NAMES,         *
002500*    FILE-CONTROL AND I-O-CONTROL ENTRIES).                    *
002600*    A SEQUENTIAL FILE IS PRODUCED WHICH IS READ AND CHECKED   *
002700*    BY SM104A.                                                *
002800*    THE MAXIMUM AND MINIMUM LENGTHS OF A LIBRARY TEXT WORD    *
002900*    ARE ALSO TESTED.                                          *
003000*                                                              *
003100****************************************************************
003200 SECURITY.
003300     COPY K3SNA.
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600
003700
003800
003900
004000
004100*
004200*********************** COPY STATEMENT USED **********************
004300*
004400*SOURCE-COMPUTER.                                     COPY K3SCA
004500*
004600******************** COPIED TEXT BEGINS BELOW ********************
004700 SOURCE-COMPUTER.                                      COPY K3SCA.
004800*********************** END OF COPIED TEXT ***********************
004900
005000
005100
005200
005300
005400*
005500*********************** COPY STATEMENT USED **********************
005600*
005700*OBJECT-COMPUTER.                                     COPY K3OCA
005800*
005900******************** COPIED TEXT BEGINS BELOW ********************
006000 OBJECT-COMPUTER.                                      COPY K3OCA.
006100*********************** END OF COPIED TEXT ***********************
006200
006300
006400
006500
006600
006700*
006800*********************** COPY STATEMENT USED **********************
006900*
007000*SPECIAL-NAMES.                                       COPY K3SNA.
007100*
007200******************** COPIED TEXT BEGINS BELOW ********************
007300 SPECIAL-NAMES.                                        COPY K3SNA.
007400*********************** END OF COPIED TEXT ***********************
007500 INPUT-OUTPUT SECTION.
007600
007700
007800
007900
008000
008100*
008200*********************** COPY STATEMENT USED **********************
008300*
008400*FILE-CONTROL.                                        COPY K3FCA.
008500*
008600******************** COPIED TEXT BEGINS BELOW ********************
008700 FILE-CONTROL.                                         COPY K3FCA.
008800*********************** END OF COPIED TEXT ***********************
008900
009000
009100
009200
009300
009400*
009500*********************** COPY STATEMENT USED **********************
009600*
009700*I-O-CONTROL                                          COPY K3IOA
009800*
009900******************** COPIED TEXT BEGINS BELOW ********************
010000 I-O-CONTROL.                                          COPY K3IOA.
010100*********************** END OF COPIED TEXT ***********************
010200 DATA DIVISION.
010300 FILE SECTION.
010400 FD  PRINT-FILE.
010500 01  PRINT-REC PICTURE X(120).
010600 01  DUMMY-RECORD PICTURE X(120).
010700 FD  TEST-FILE
010800     LABEL RECORD STANDARD
010900C    VALUE OF
011000C    XXXXX074
011100C    IS
011200C    XXXXX075
011300G    XXXXX069
011400     DATA RECORD TEST-REC.
011500 01  TEST-REC.
011600     02  TST-FLD-1 PICTURE 9(5).
011700     02  TST-FLD-2 PICTURE X(13).
011800     02  FILLER PICTURE X(102).
011900 FD  TEST-FILE2
012000     LABEL RECORD STANDARD
012100C    VALUE OF
012200C    XXXXX074
012300C    IS
012400C    XXXXX076
012500G    XXXXX069
012600     DATA RECORD TEST-REC2.
012700 01  TEST-REC2.
012800     02  TST-FLD-3 PICTURE 9(5).
012900     02  TST-FLD-4 PICTURE X(13).
013000     02  FILLER PICTURE X(102).
013100 WORKING-STORAGE SECTION.
013200 77  RCD-1 PICTURE 9(5) VALUE 97532.
013300 77  RCD-2 PICTURE 9(5) VALUE 23479.
013400 77  RCD-3 PICTURE 9(5) VALUE 10901.
013500 77  RCD-4 PICTURE 9(5) VALUE 02734.
013600 77  RCD-5 PICTURE 9(5) VALUE 14003.
013700 77  RCD-6 PICTURE 9(5) VALUE 19922.
013800 77  RCD-7 PICTURE 9(5) VALUE 03543.
013900 01  S-N-1 PICTURE 9(8)V99 VALUE IS 12345678,91.
014000 01  S-N-2 PICTURE ZZ.ZZZ.ZZZ,99.
014100 01  WRK-DU-9                    PIC 9          VALUE ZERO.
014200 01  WRK-DU-99                   PIC 99         VALUE ZERO.
014300 01  WRK-DU-99-LONGER            PIC 99         VALUE ZERO.
014400 01  WRK-DU-00001                PIC 9.
014500 01  WRK-XN-00322                PIC X(322).
014600 01  FILLER REDEFINES WRK-XN-00322.
014700   03  WRK-XN-00322-1         PIC X.
014800   03  WRK-XN-00322-2-322.
014900     05  WRK-XN-00322-2-3     PIC X.
015000     05  WRK-XN-00322-20      PIC X(20)
015100                              OCCURS 16
015200                              INDEXED BY X1.
015300 01  TEST-RESULTS.
015400     02 FILLER                   PIC X      VALUE SPACE.
015500     02 FEATURE                  PIC X(20)  VALUE SPACE.
015600     02 FILLER                   PIC X      VALUE SPACE.
015700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
015800     02 FILLER                   PIC X      VALUE SPACE.
015900     02  PAR-NAME.
016000       03 FILLER                 PIC X(19)  VALUE SPACE.
016100       03  PARDOT-X              PIC X      VALUE SPACE.
016200       03 DOTVALUE               PIC 99     VALUE ZERO.
016300     02 FILLER                   PIC X(8)   VALUE SPACE.
016400     02 RE-MARK                  PIC X(61).
016500 01  TEST-COMPUTED.
016600     02 FILLER                   PIC X(30)  VALUE SPACE.
016700     02 FILLER                   PIC X(17)  VALUE
016800            "       COMPUTED=".
016900     02 COMPUTED-X.
017000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
017100     03 COMPUTED-N               REDEFINES COMPUTED-A
017200                                 PIC -9(9).9(9).
017300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
017400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
017500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
017600     03       CM-18V0 REDEFINES COMPUTED-A.
017700         04 COMPUTED-18V0                    PIC -9(18).
017800         04 FILLER                           PIC X.
017900     03 FILLER PIC X(50) VALUE SPACE.
018000 01  TEST-CORRECT.
018100     02 FILLER PIC X(30) VALUE SPACE.
018200     02 FILLER PIC X(17) VALUE "       CORRECT =".
018300     02 CORRECT-X.
018400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
018500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
018600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
018700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
018800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
018900     03      CR-18V0 REDEFINES CORRECT-A.
019000         04 CORRECT-18V0                     PIC -9(18).
019100         04 FILLER                           PIC X.
019200     03 FILLER PIC X(2) VALUE SPACE.
019300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
019400 01  CCVS-C-1.
019500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
019600-    "SS  PARAGRAPH-NAME
019700-    "       REMARKS".
019800     02 FILLER                     PIC X(20)    VALUE SPACE.
019900 01  CCVS-C-2.
020000     02 FILLER                     PIC X        VALUE SPACE.
020100     02 FILLER                     PIC X(6)     VALUE "TESTED".
020200     02 FILLER                     PIC X(15)    VALUE SPACE.
020300     02 FILLER                     PIC X(4)     VALUE "FAIL".
020400     02 FILLER                     PIC X(94)    VALUE SPACE.
020500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
020600 01  REC-CT                        PIC 99       VALUE ZERO.
020700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
020800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
020900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
021000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
021100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
021200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
021300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
021400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
021500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
021600 01  CCVS-H-1.
021700     02  FILLER                    PIC X(39)    VALUE SPACES.
021800     02  FILLER                    PIC X(42)    VALUE
021900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
022000     02  FILLER                    PIC X(39)    VALUE SPACES.
022100 01  CCVS-H-2A.
022200   02  FILLER                        PIC X(40)  VALUE SPACE.
022300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
022400   02  FILLER                        PIC XXXX   VALUE
022500     "4.2 ".
022600   02  FILLER                        PIC X(28)  VALUE
022700            " COPY - NOT FOR DISTRIBUTION".
022800   02  FILLER                        PIC X(41)  VALUE SPACE.
022900
023000 01  CCVS-H-2B.
023100   02  FILLER                        PIC X(15)  VALUE
023200            "TEST RESULT OF ".
023300   02  TEST-ID                       PIC X(9).
023400   02  FILLER                        PIC X(4)   VALUE
023500            " IN ".
023600   02  FILLER                        PIC X(12)  VALUE
023700     " HIGH       ".
023800   02  FILLER                        PIC X(22)  VALUE
023900            " LEVEL VALIDATION FOR ".
024000   02  FILLER                        PIC X(58)  VALUE
024100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024200 01  CCVS-H-3.
024300     02  FILLER                      PIC X(34)  VALUE
024400            " FOR OFFICIAL USE ONLY    ".
024500     02  FILLER                      PIC X(58)  VALUE
024600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
024700     02  FILLER                      PIC X(28)  VALUE
024800            "  COPYRIGHT   1985 ".
024900 01  CCVS-E-1.
025000     02 FILLER                       PIC X(52)  VALUE SPACE.
025100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
025200     02 ID-AGAIN                     PIC X(9).
025300     02 FILLER                       PIC X(45)  VALUE SPACES.
025400 01  CCVS-E-2.
025500     02  FILLER                      PIC X(31)  VALUE SPACE.
025600     02  FILLER                      PIC X(21)  VALUE SPACE.
025700     02 CCVS-E-2-2.
025800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
025900         03 FILLER                   PIC X      VALUE SPACE.
026000         03 ENDER-DESC               PIC X(44)  VALUE
026100            "ERRORS ENCOUNTERED".
026200 01  CCVS-E-3.
026300     02  FILLER                      PIC X(22)  VALUE
026400            " FOR OFFICIAL USE ONLY".
026500     02  FILLER                      PIC X(12)  VALUE SPACE.
026600     02  FILLER                      PIC X(58)  VALUE
026700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026800     02  FILLER                      PIC X(13)  VALUE SPACE.
026900     02 FILLER                       PIC X(15)  VALUE
027000             " COPYRIGHT 1985".
027100 01  CCVS-E-4.
027200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
027300     02 FILLER                       PIC X(4)   VALUE " OF ".
027400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
027500     02 FILLER                       PIC X(40)  VALUE
027600      "  TESTS WERE EXECUTED SUCCESSFULLY".
027700 01  XXINFO.
027800     02 FILLER                       PIC X(19)  VALUE
027900            "*** INFORMATION ***".
028000     02 INFO-TEXT.
028100       04 FILLER                     PIC X(8)   VALUE SPACE.
028200       04 XXCOMPUTED                 PIC X(20).
028300       04 FILLER                     PIC X(5)   VALUE SPACE.
028400       04 XXCORRECT                  PIC X(20).
028500     02 INF-ANSI-REFERENCE           PIC X(48).
028600 01  HYPHEN-LINE.
028700     02 FILLER  PIC IS X VALUE IS SPACE.
028800     02 FILLER  PIC IS X(65)    VALUE IS "************************
028900-    "*****************************************".
029000     02 FILLER  PIC IS X(54)    VALUE IS "************************
029100-    "******************************".
029200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
029300     "SM103A".
029400 PROCEDURE DIVISION.
029500 CCVS1 SECTION.
029600 OPEN-FILES.
029700     OPEN     OUTPUT PRINT-FILE.
029800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
029900     MOVE    SPACE TO TEST-RESULTS.
030000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
030100     GO TO CCVS1-EXIT.
030200 CLOSE-FILES.
030300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
030400 TERMINATE-CCVS.
030500S    EXIT PROGRAM.
030600STERMINATE-CALL.
030700     STOP     RUN.
030800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
030900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
031000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
031100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
031200     MOVE "****TEST DELETED****" TO RE-MARK.
031300 PRINT-DETAIL.
031400     IF REC-CT NOT EQUAL TO ZERO
031500             MOVE "." TO PARDOT-X
031600             MOVE REC-CT TO DOTVALUE.
031700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
031800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
031900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
032000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
032100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
032200     MOVE SPACE TO CORRECT-X.
032300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
032400     MOVE     SPACE TO RE-MARK.
032500 HEAD-ROUTINE.
032600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
032900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
033000 COLUMN-NAMES-ROUTINE.
033100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
033400 END-ROUTINE.
033500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
033600 END-RTN-EXIT.
033700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033800 END-ROUTINE-1.
033900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
034000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
034100      ADD PASS-COUNTER TO ERROR-HOLD.
034200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
034300      MOVE PASS-COUNTER TO CCVS-E-4-1.
034400      MOVE ERROR-HOLD TO CCVS-E-4-2.
034500      MOVE CCVS-E-4 TO CCVS-E-2-2.
034600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
034700  END-ROUTINE-12.
034800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
034900     IF       ERROR-COUNTER IS EQUAL TO ZERO
035000         MOVE "NO " TO ERROR-TOTAL
035100         ELSE
035200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
035300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
035400     PERFORM WRITE-LINE.
035500 END-ROUTINE-13.
035600     IF DELETE-COUNTER IS EQUAL TO ZERO
035700         MOVE "NO " TO ERROR-TOTAL  ELSE
035800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
035900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
036000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036100      IF   INSPECT-COUNTER EQUAL TO ZERO
036200          MOVE "NO " TO ERROR-TOTAL
036300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
036400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
036500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036700 WRITE-LINE.
036800     ADD 1 TO RECORD-COUNT.
036900Y    IF RECORD-COUNT GREATER 50
037000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
037100Y        MOVE SPACE TO DUMMY-RECORD
037200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
037300Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
037400Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
037500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
037600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
037700Y        MOVE ZERO TO RECORD-COUNT.
037800     PERFORM WRT-LN.
037900 WRT-LN.
038000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
038100     MOVE SPACE TO DUMMY-RECORD.
038200 BLANK-LINE-PRINT.
038300     PERFORM WRT-LN.
038400 FAIL-ROUTINE.
038500     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038600     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038700     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038800     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
038900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039000     MOVE   SPACES TO INF-ANSI-REFERENCE.
039100     GO TO  FAIL-ROUTINE-EX.
039200 FAIL-ROUTINE-WRITE.
039300     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
039400     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
039500     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
039600     MOVE   SPACES TO COR-ANSI-REFERENCE.
039700 FAIL-ROUTINE-EX. EXIT.
039800 BAIL-OUT.
039900     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
040000     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
040100 BAIL-OUT-WRITE.
040200     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
040300     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
040400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040500     MOVE   SPACES TO INF-ANSI-REFERENCE.
040600 BAIL-OUT-EX. EXIT.
040700 CCVS1-EXIT.
040800     EXIT.
040900 INITIALIZATION SECTION.
041000 SM103A-INIT.
041100     MOVE     "ALL TESTS IN SM103A PRODUCE" TO RE-MARK.
041200     PERFORM  PRINT-DETAIL.
041300     MOVE     "OUTPUT CHECKED IN SM104A."   TO RE-MARK.
041400     PERFORM  PRINT-DETAIL.
041500     MOVE     "COPY ---" TO FEATURE.
041600     PERFORM  PRINT-DETAIL.
041700 SPECIAL-NAMES-TEST SECTION.
041800 COPY-TEST-1.
041900     MOVE     S-N-1 TO S-N-2.
042000*    NOTE     THIS ROUTINE USES A COPIED DECIMAL-POINT IS COMMA
042100*             CLAUSE IN SPECIAL-NAMES --- THE EDITING IN S-N-2
042200*             WOULD NOT BE VALID WITHOUT THIS CLAUSE.
042300     PERFORM  PASS.
042400     GO       TO COPY-WRITE-1.
042500 COPY-DELETE-1.
042600     PERFORM  DE-LETE.
042700 COPY-WRITE-1.
042800     MOVE     "  DEC POINT IS COMMA" TO FEATURE.
042900     MOVE     "COPY-TEST-1 " TO PAR-NAME.
043000     PERFORM  PRINT-DETAIL.
043100 BUILD SECTION.
043200 COPY-TEST-2.
043300     OPEN     OUTPUT TEST-FILE.
043400     MOVE     S-N-2 TO TST-FLD-2.
043500     MOVE     RCD-1 TO TST-FLD-1.
043600     WRITE    TEST-REC.
043700     MOVE     RCD-2 TO TST-FLD-1.
043800     WRITE    TEST-REC.
043900     MOVE     RCD-3 TO TST-FLD-1.
044000     WRITE    TEST-REC.
044100     MOVE     RCD-4 TO TST-FLD-1.
044200     WRITE    TEST-REC.
044300     MOVE     RCD-5 TO TST-FLD-1.
044400     WRITE    TEST-REC.
044500     MOVE     RCD-6 TO TST-FLD-1.
044600     WRITE    TEST-REC.
044700     MOVE     RCD-7 TO TST-FLD-1.
044800     WRITE    TEST-REC.
044900     CLOSE    TEST-FILE.
045000     OPEN OUTPUT TEST-FILE2.
045100     MOVE ZERO TO TST-FLD-3.
045200     MOVE "DDDDD" TO TST-FLD-4.
045300     WRITE TEST-REC2.
045400     CLOSE TEST-FILE2.
045500     PERFORM  PASS.
045600     GO       TO COPY-WRITE-2.
045700 COPY-DELETE-2.
045800     PERFORM DE-LETE.
045900 COPY-WRITE-2.
046000     MOVE   "  ENVIR DIV ENTRIES" TO FEATURE.
046100     MOVE   "COPY-TEST-2 " TO PAR-NAME.
046200     PERFORM PRINT-DETAIL.
046300*
046400 COPY-TEST-3.
046500*    ===-->  MINIMUM LENGTH TEXT WORD  <--===
046600     MOVE   "XII-2 2.3 SR8" TO ANSI-REFERENCE.
046700     MOVE   "COPY-TEST-3"   TO PAR-NAME.
046800     MOVE    8  TO WRK-DU-00001.
046900     GO TO   COPY-TEST-3-0.
047000 COPY-DELETE-3.
047100     PERFORM DE-LETE.
047200     PERFORM PRINT-DETAIL.
047300     GO TO   COPY-INIT-4.
047400 COPY-TEST-3-0.
047500********************* COPY TEXT USED ***************************
047600*                            8                                 *
047700*********************END OF COPY TEXT***************************
047800     IF      WRK-DU-00001 =
047900     COPY    K3SML.
048000             PERFORM PASS
048100             PERFORM PRINT-DETAIL
048200     ELSE
048300             MOVE   "COPYING SINGLE CHARACTER FAILED"
048400                  TO RE-MARK
048500             MOVE    8   TO CORRECT-N
048600             MOVE    WRK-DU-00001 TO COMPUTED-N
048700             PERFORM FAIL
048800             PERFORM PRINT-DETAIL.
048900*
049000 COPY-INIT-4.
049100*    ===-->  MAXIMUM LENGTH TEXT WORD  <--===
049200     MOVE   "XII-2 2.3 (SR8) AND XII-5 2.4(GR11)"
049300          TO ANSI-REFERENCE.
049400     MOVE   "COPY-TEST-4" TO PAR-NAME.
049500     MOVE    SPACES      TO WRK-XN-00322.
049600     MOVE    1 TO REC-CT.
049700     GO TO   COPY-TEST-4-0.
049800 COPY-DELETE-4.
049900     PERFORM DE-LETE.
050000     PERFORM PRINT-DETAIL.
050100     GO TO   CCVS-EXIT.
050200 COPY-TEST-4-0.
050300********************* COPY TEXT USED ***************************
050400*    MOVE 1 TO WRK-DU-9, ADD 1 TO WRK-DU-9, ADD 1 TO WRK-DU-9, ADD
050500*     1 TO WRK-DU-99, ADD 1 TO WRK-DU-9, ADD 1 TO WRK-DU-99, ADD 1
050600*     TO WRK-DU-99, ADD 1 TO WRK-DU-99, ADD 1 TO WRK-DU-99, ADD 1
050700*    TO WRK-DU-9, ADD 1 TO WRK-DU-9, ADD 1 TO WRK-DU-99, ADD 1 TO
050800*    WRK-DU-99, ADD 1 TO WRK-DU-99, ADD 1 TO WRK-DU-99, ADD 10 TO
050900*    WRK-DU-99-LONGER.
051000*********************END OF COPY TEXT***************************
051100*
051200     COPY    K3LGE.
051300*
051400 COPY-TEST-4-1.
051500     MOVE   "COPY-TEST-4-1" TO PAR-NAME.
051600     IF      WRK-DU-9 = 6
051700             PERFORM PASS
051800             PERFORM PRINT-DETAIL
051900     ELSE
052000             MOVE   "COPYING ALL 322 CHARACTERS FAILED"
052100                  TO RE-MARK
052200             MOVE    6   TO CORRECT-N
052300             MOVE    WRK-DU-9 TO COMPUTED-N
052400             PERFORM FAIL
052500             PERFORM PRINT-DETAIL.
052600     ADD     1 TO REC-CT.
052700 COPY-TEST-4-2.
052800     MOVE   "COPY-TEST-4-2" TO PAR-NAME.
052900     IF      WRK-DU-99 = 9
053000             PERFORM PASS
053100             PERFORM PRINT-DETAIL
053200     ELSE
053300             MOVE   "COPYING ALL 322 CHARACTERS FAILED"
053400                  TO RE-MARK
053500             MOVE    9   TO CORRECT-N
053600             MOVE    WRK-DU-99 TO COMPUTED-N
053700             PERFORM FAIL
053800             PERFORM PRINT-DETAIL.
053900     ADD     1 TO REC-CT.
054000 COPY-TEST-4-3.
054100     MOVE   "COPY-TEST-4-3" TO PAR-NAME.
054200     IF      WRK-DU-99-LONGER = 10
054300             PERFORM PASS
054400             PERFORM PRINT-DETAIL
054500     ELSE
054600             MOVE   "COPYING ALL 322 CHARACTERS FAILED"
054700                  TO RE-MARK
054800             MOVE    10  TO CORRECT-N
054900             MOVE    WRK-DU-99-LONGER TO COMPUTED-N
055000             PERFORM FAIL
055100             PERFORM PRINT-DETAIL.
055200*
055300 CCVS-EXIT SECTION.
055400 CCVS-999999.
055500     GO TO CLOSE-FILES.
