000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SM102A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*                                                              *
002200*    PROGRAM SM102A TESTS THE OUTPUT FILE PRODUCED BY SM101A   *
002300*    TO ENSURE THE PROPER EXECUTION OF THE "COPY" STATEMENT    *
002400*    IN THAT PROGRAM.                                          *
002500*                                                              *
002600****************************************************************
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.
003000     XXXXX082.
003100 OBJECT-COMPUTER.
003200     XXXXX083.
003300 INPUT-OUTPUT SECTION.
003400 FILE-CONTROL.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700     SELECT TEST-FILE ASSIGN TO
003800     XXXXD001.
003900 DATA DIVISION.
004000 FILE SECTION.
004100 FD  PRINT-FILE.
004200 01  PRINT-REC PICTURE X(120).
004300 01  DUMMY-RECORD PICTURE X(120).
004400 FD  TEST-FILE
004500     LABEL RECORD STANDARD
004600C    VALUE OF
004700C    XXXXX074
004800C    IS
004900C    XXXXX075
005000G    XXXXX069
005100     DATA RECORD IS TST-TEST.
005200 01  TST-TEST.
005300     02  TST-FLD-1 PICTURE 9(5).
005400     02  FILLER PICTURE X(115).
005500 WORKING-STORAGE SECTION.
005600 01  TEST-RESULTS.
005700     02 FILLER                   PIC X      VALUE SPACE.
005800     02 FEATURE                  PIC X(20)  VALUE SPACE.
005900     02 FILLER                   PIC X      VALUE SPACE.
006000     02 P-OR-F                   PIC X(5)   VALUE SPACE.
006100     02 FILLER                   PIC X      VALUE SPACE.
006200     02  PAR-NAME.
006300       03 FILLER                 PIC X(19)  VALUE SPACE.
006400       03  PARDOT-X              PIC X      VALUE SPACE.
006500       03 DOTVALUE               PIC 99     VALUE ZERO.
006600     02 FILLER                   PIC X(8)   VALUE SPACE.
006700     02 RE-MARK                  PIC X(61).
006800 01  TEST-COMPUTED.
006900     02 FILLER                   PIC X(30)  VALUE SPACE.
007000     02 FILLER                   PIC X(17)  VALUE
007100            "       COMPUTED=".
007200     02 COMPUTED-X.
007300     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
007400     03 COMPUTED-N               REDEFINES COMPUTED-A
007500                                 PIC -9(9).9(9).
007600     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007700     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007800     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007900     03       CM-18V0 REDEFINES COMPUTED-A.
008000         04 COMPUTED-18V0                    PIC -9(18).
008100         04 FILLER                           PIC X.
008200     03 FILLER PIC X(50) VALUE SPACE.
008300 01  TEST-CORRECT.
008400     02 FILLER PIC X(30) VALUE SPACE.
008500     02 FILLER PIC X(17) VALUE "       CORRECT =".
008600     02 CORRECT-X.
008700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
009000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
009100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
009200     03      CR-18V0 REDEFINES CORRECT-A.
009300         04 CORRECT-18V0                     PIC -9(18).
009400         04 FILLER                           PIC X.
009500     03 FILLER PIC X(2) VALUE SPACE.
009600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009700 01  CCVS-C-1.
009800     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
009900-    "SS  PARAGRAPH-NAME
010000-    "       REMARKS".
010100     02 FILLER                     PIC X(20)    VALUE SPACE.
010200 01  CCVS-C-2.
010300     02 FILLER                     PIC X        VALUE SPACE.
010400     02 FILLER                     PIC X(6)     VALUE "TESTED".
010500     02 FILLER                     PIC X(15)    VALUE SPACE.
010600     02 FILLER                     PIC X(4)     VALUE "FAIL".
010700     02 FILLER                     PIC X(94)    VALUE SPACE.
010800 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
010900 01  REC-CT                        PIC 99       VALUE ZERO.
011000 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
011100 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
011200 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
011300 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
011400 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
011500 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
011600 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
011700 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
011800 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
011900 01  CCVS-H-1.
012000     02  FILLER                    PIC X(39)    VALUE SPACES.
012100     02  FILLER                    PIC X(42)    VALUE
012200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
012300     02  FILLER                    PIC X(39)    VALUE SPACES.
012400 01  CCVS-H-2A.
012500   02  FILLER                        PIC X(40)  VALUE SPACE.
012600   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
012700   02  FILLER                        PIC XXXX   VALUE
012800     "4.2 ".
012900   02  FILLER                        PIC X(28)  VALUE
013000            " COPY - NOT FOR DISTRIBUTION".
013100   02  FILLER                        PIC X(41)  VALUE SPACE.
013200
013300 01  CCVS-H-2B.
013400   02  FILLER                        PIC X(15)  VALUE
013500            "TEST RESULT OF ".
013600   02  TEST-ID                       PIC X(9).
013700   02  FILLER                        PIC X(4)   VALUE
013800            " IN ".
013900   02  FILLER                        PIC X(12)  VALUE
014000     " HIGH       ".
014100   02  FILLER                        PIC X(22)  VALUE
014200            " LEVEL VALIDATION FOR ".
014300   02  FILLER                        PIC X(58)  VALUE
014400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014500 01  CCVS-H-3.
014600     02  FILLER                      PIC X(34)  VALUE
014700            " FOR OFFICIAL USE ONLY    ".
014800     02  FILLER                      PIC X(58)  VALUE
014900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
015000     02  FILLER                      PIC X(28)  VALUE
015100            "  COPYRIGHT   1985 ".
015200 01  CCVS-E-1.
015300     02 FILLER                       PIC X(52)  VALUE SPACE.
015400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
015500     02 ID-AGAIN                     PIC X(9).
015600     02 FILLER                       PIC X(45)  VALUE SPACES.
015700 01  CCVS-E-2.
015800     02  FILLER                      PIC X(31)  VALUE SPACE.
015900     02  FILLER                      PIC X(21)  VALUE SPACE.
016000     02 CCVS-E-2-2.
016100         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
016200         03 FILLER                   PIC X      VALUE SPACE.
016300         03 ENDER-DESC               PIC X(44)  VALUE
016400            "ERRORS ENCOUNTERED".
016500 01  CCVS-E-3.
016600     02  FILLER                      PIC X(22)  VALUE
016700            " FOR OFFICIAL USE ONLY".
016800     02  FILLER                      PIC X(12)  VALUE SPACE.
016900     02  FILLER                      PIC X(58)  VALUE
017000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
017100     02  FILLER                      PIC X(13)  VALUE SPACE.
017200     02 FILLER                       PIC X(15)  VALUE
017300             " COPYRIGHT 1985".
017400 01  CCVS-E-4.
017500     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
017600     02 FILLER                       PIC X(4)   VALUE " OF ".
017700     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
017800     02 FILLER                       PIC X(40)  VALUE
017900      "  TESTS WERE EXECUTED SUCCESSFULLY".
018000 01  XXINFO.
018100     02 FILLER                       PIC X(19)  VALUE
018200            "*** INFORMATION ***".
018300     02 INFO-TEXT.
018400       04 FILLER                     PIC X(8)   VALUE SPACE.
018500       04 XXCOMPUTED                 PIC X(20).
018600       04 FILLER                     PIC X(5)   VALUE SPACE.
018700       04 XXCORRECT                  PIC X(20).
018800     02 INF-ANSI-REFERENCE           PIC X(48).
018900 01  HYPHEN-LINE.
019000     02 FILLER  PIC IS X VALUE IS SPACE.
019100     02 FILLER  PIC IS X(65)    VALUE IS "************************
019200-    "*****************************************".
019300     02 FILLER  PIC IS X(54)    VALUE IS "************************
019400-    "******************************".
019500 01  CCVS-PGM-ID                     PIC X(9)   VALUE
019600     "SM102A".
019700 PROCEDURE DIVISION.
019800 CCVS1 SECTION.
019900 OPEN-FILES.
020000     OPEN     OUTPUT PRINT-FILE.
020100     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
020200     MOVE    SPACE TO TEST-RESULTS.
020300     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
020400     GO TO CCVS1-EXIT.
020500 CLOSE-FILES.
020600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
020700 TERMINATE-CCVS.
020800S    EXIT PROGRAM.
020900STERMINATE-CALL.
021000     STOP     RUN.
021100 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
021200 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
021300 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
021400 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
021500     MOVE "****TEST DELETED****" TO RE-MARK.
021600 PRINT-DETAIL.
021700     IF REC-CT NOT EQUAL TO ZERO
021800             MOVE "." TO PARDOT-X
021900             MOVE REC-CT TO DOTVALUE.
022000     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
022100     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
022200        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
022300          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
022400     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
022500     MOVE SPACE TO CORRECT-X.
022600     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
022700     MOVE     SPACE TO RE-MARK.
022800 HEAD-ROUTINE.
022900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
023300 COLUMN-NAMES-ROUTINE.
023400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
023700 END-ROUTINE.
023800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
023900 END-RTN-EXIT.
024000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
024100 END-ROUTINE-1.
024200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
024300      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
024400      ADD PASS-COUNTER TO ERROR-HOLD.
024500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
024600      MOVE PASS-COUNTER TO CCVS-E-4-1.
024700      MOVE ERROR-HOLD TO CCVS-E-4-2.
024800      MOVE CCVS-E-4 TO CCVS-E-2-2.
024900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
025000  END-ROUTINE-12.
025100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
025200     IF       ERROR-COUNTER IS EQUAL TO ZERO
025300         MOVE "NO " TO ERROR-TOTAL
025400         ELSE
025500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
025600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
025700     PERFORM WRITE-LINE.
025800 END-ROUTINE-13.
025900     IF DELETE-COUNTER IS EQUAL TO ZERO
026000         MOVE "NO " TO ERROR-TOTAL  ELSE
026100         MOVE DELETE-COUNTER TO ERROR-TOTAL.
026200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
026300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026400      IF   INSPECT-COUNTER EQUAL TO ZERO
026500          MOVE "NO " TO ERROR-TOTAL
026600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
026700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
026800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027000 WRITE-LINE.
027100     ADD 1 TO RECORD-COUNT.
027200Y    IF RECORD-COUNT GREATER 50
027300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
027400Y        MOVE SPACE TO DUMMY-RECORD
027500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
027600Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
027700Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
027800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
027900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
028000Y        MOVE ZERO TO RECORD-COUNT.
028100     PERFORM WRT-LN.
028200 WRT-LN.
028300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
028400     MOVE SPACE TO DUMMY-RECORD.
028500 BLANK-LINE-PRINT.
028600     PERFORM WRT-LN.
028700 FAIL-ROUTINE.
028800     IF   COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
028900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
029200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029300     MOVE   SPACES TO INF-ANSI-REFERENCE.
029400     GO TO  FAIL-ROUTINE-EX.
029500 FAIL-ROUTINE-WRITE.
029600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
029700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
029800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
029900     MOVE   SPACES TO COR-ANSI-REFERENCE.
030000 FAIL-ROUTINE-EX. EXIT.
030100 BAIL-OUT.
030200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
030300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
030400 BAIL-OUT-WRITE.
030500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
030600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030800     MOVE   SPACES TO INF-ANSI-REFERENCE.
030900 BAIL-OUT-EX. EXIT.
031000 CCVS1-EXIT.
031100     EXIT.
031200 INITIALIZATION SECTION.
031300 SM102-INIT.
031400     OPEN     INPUT  TEST-FILE.
031500     MOVE     "SM102A CHECKS A FILE WHICH" TO RE-MARK.
031600     PERFORM  PRINT-DETAIL.
031700     MOVE     "WAS GENERATED IN SM101A."  TO RE-MARK.
031800     PERFORM  PRINT-DETAIL.
031900     MOVE     "COPY FILE DESCR" TO FEATURE.
032000 FD-TEST SECTION.
032100 COPY-TEST-8.
032200     PERFORM READ-TSTFILE.
032300     IF      TST-FLD-1 EQUAL TO 97523
032400             PERFORM PASS GO TO COPY-WRITE-8.
032500     GO      TO COPY-FAIL-8.
032600 COPY-DELETE-8.
032700     PERFORM DE-LETE.
032800     GO      TO COPY-WRITE-8.
032900 COPY-FAIL-8.
033000     MOVE    TST-FLD-1 TO COMPUTED-N.
033100     MOVE    97523   TO CORRECT-N.
033200     PERFORM FAIL.
033300 COPY-WRITE-8.
033400     MOVE   "COPY-TEST-8 " TO PAR-NAME.
033500     PERFORM PRINT-DETAIL.
033600 COPY-TEST-9.
033700     PERFORM READ-TSTFILE.
033800     IF      TST-FLD-1 EQUAL TO 23497
033900              PERFORM PASS GO TO COPY-WRITE-9.
034000     GO       TO COPY-FAIL-9.
034100 COPY-DELETE-9.
034200     PERFORM  DE-LETE.
034300     GO       TO COPY-WRITE-9.
034400 COPY-FAIL-9.
034500     MOVE     TST-FLD-1 TO COMPUTED-N.
034600     MOVE     23497 TO CORRECT-N.
034700     PERFORM  FAIL.
034800 COPY-WRITE-9.
034900     MOVE     "COPY-TEST-9 " TO PAR-NAME.
035000     PERFORM  PRINT-DETAIL.
035100 COPY-TEST-10.
035200     PERFORM  READ-TSTFILE 3 TIMES.
035300     IF       TST-FLD-1 EQUAL TO 14003
035400              PERFORM PASS GO TO COPY-WRITE-10.
035500     GO       TO COPY-FAIL-10.
035600 COPY-DELETE-10.
035700     PERFORM  DE-LETE.
035800     GO       TO COPY-WRITE-10.
035900 COPY-FAIL-10.
036000     MOVE     TST-FLD-1 TO COMPUTED-N.
036100     MOVE     14003 TO CORRECT-N.
036200     PERFORM  FAIL.
036300 COPY-WRITE-10.
036400     MOVE     "COPY-TEST-10 " TO PAR-NAME.
036500     PERFORM  PRINT-DETAIL.
036600 COPY-TEST-11.
036700     PERFORM  READ-TSTFILE 2 TIMES.
036800     IF       TST-FLD-1 EQUAL TO 03543
036900              PERFORM PASS GO TO COPY-WRITE-11.
037000     GO       TO COPY-FAIL-11.
037100 COPY-DELETE-11.
037200     PERFORM  DE-LETE.
037300     GO       TO COPY-WRITE-11.
037400 COPY-FAIL-11.
037500     MOVE     TST-FLD-1 TO COMPUTED-N.
037600     MOVE     03543 TO CORRECT-N.
037700     PERFORM  FAIL.
037800 COPY-WRITE-11.
037900     MOVE     "COPY-TEST-11 " TO PAR-NAME.
038000     PERFORM  PRINT-DETAIL.
038100     CLOSE    TEST-FILE.
038200     GO TO CCVS-EXIT.
038300 READ-TSTFILE.
038400     READ     TEST-FILE          AT END GO TO BAD-FILE.
038500 BAD-FILE.
038600     PERFORM  FAIL.
038700     MOVE     "BAD-FILE" TO PAR-NAME.
038800     MOVE     "EOF PREMATURELY FOUND" TO RE-MARK.
038900     PERFORM  PRINT-DETAIL.
039000     CLOSE    TEST-FILE.
039100 CCVS-EXIT SECTION.
039200 CCVS-999999.
039300     GO TO CLOSE-FILES.
