000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SM106A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100 ENVIRONMENT DIVISION.
002200*
002300*********************** COPY STATEMENT USED **********************
002400*
002500*COPY   K6SCA
002600*
002700******************** COPIED TEXT BEGINS BELOW ********************
002800 COPY   K6SCA.
002900*********************** END OF COPIED TEXT ***********************
