000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ109M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*                                                              *
000900*    CREATION DATE     /     VALIDATION DATE                   *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300
001400*         THIS ROUTINE CREATES A 2 REEL TAPE FILE OF FIXED
001500*    LENGTH RECORDS.  THE FILE IS THEN CLOSED AND OPENED AS AN
001600*    INPUT FILE.  THE FILE IS READ AND FIELDS IN THE INPUT RECORDS
001700*    ARE COMPARED TO THE VALUES WRITTEN TO ENSURE THAT THE RECORDS
001800*    WERE PROCESSED CORRECTLY.  THE FILE IS CLOSED AND OPENED
001900*    AGAIN AS AN INPUT FILE.  FOUR READ FORMAT OPTIONS ARE USED
002000*    TO READ THE FILE AND FIELDS IN THE RECORDS ARE VERIFIED.
002100*    THE OPEN, CLOSE, READ, AND WRITE STATEMENTS ARE TESTED FOR
002200*    LEVEL ONE FEATURES.
002300*
002400*    USED X-CARDS:
002500*         XXXXX006
002600*         XXXXX055
002700*     P   XXXXX062
002800*         XXXXX082
002900*         XXXXX083
003000*     C   XXXXX084
003100*
003200*
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.
003600     XXXXX082.
003700 OBJECT-COMPUTER.
003800     XXXXX083.
003900 INPUT-OUTPUT SECTION.
004000 FILE-CONTROL.
004100P    SELECT RAW-DATA   ASSIGN TO
004200P    XXXXX062
004300P           ORGANIZATION IS INDEXED
004400P           ACCESS MODE IS RANDOM
004500P           RECORD KEY IS RAW-DATA-KEY.
004600     SELECT PRINT-FILE ASSIGN TO
004700     XXXXX055.
004800     SELECT SQ-FS1 ASSIGN TO
004900     XXXXX006
005000     ORGANIZATION IS SEQUENTIAL
005100     ACCESS MODE IS SEQUENTIAL.
005200 DATA DIVISION.
005300 FILE SECTION.
005400P
005500PFD  RAW-DATA.
005600P
005700P01  RAW-DATA-SATZ.
005800P    05  RAW-DATA-KEY        PIC X(6).
005900P    05  C-DATE              PIC 9(6).
006000P    05  C-TIME              PIC 9(8).
006100P    05  C-NO-OF-TESTS       PIC 99.
006200P    05  C-OK                PIC 999.
006300P    05  C-ALL               PIC 999.
006400P    05  C-FAIL              PIC 999.
006500P    05  C-DELETED           PIC 999.
006600P    05  C-INSPECT           PIC 999.
006700P    05  C-NOTE              PIC X(13).
006800P    05  C-INDENT            PIC X.
006900P    05  C-ABORT             PIC X(8).
007000 FD  PRINT-FILE
007100C    LABEL RECORDS
007200C    XXXXX084
007300C    DATA RECORD IS PRINT-REC DUMMY-RECORD
007400               .
007500 01  PRINT-REC PICTURE X(120).
007600 01  DUMMY-RECORD PICTURE X(120).
007700 FD  SQ-FS1
007800C    LABEL RECORD STANDARD
007900               .
008000 01  SQ-FS1R1-F-G-120.
008100     02  FILLER PIC X(120).
008200 WORKING-STORAGE SECTION.
008300 01  WRK-CS-09V00 PIC S9(9) USAGE COMP VALUE ZERO.
008400 01  RECORDS-IN-ERROR PIC S9(5) USAGE COMP VALUE ZERO.
008500 01  ERROR-FLAG PIC 9 VALUE ZERO.
008600 01  EOF-FLAG   PICTURE 9 VALUE ZERO.
008700 01  FILE-RECORD-INFORMATION-REC.
008800     03 FILE-RECORD-INFO-SKELETON.
008900        05 FILLER                 PICTURE X(48)       VALUE
009000             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
009100        05 FILLER                 PICTURE X(46)       VALUE
009200             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
009300        05 FILLER                 PICTURE X(26)       VALUE
009400             ",LFIL=000000,ORG=  ,LBLR= ".
009500        05 FILLER                 PICTURE X(37)       VALUE
009600             ",RECKEY=                             ".
009700        05 FILLER                 PICTURE X(38)       VALUE
009800             ",ALTKEY1=                             ".
009900        05 FILLER                 PICTURE X(38)       VALUE
010000             ",ALTKEY2=                             ".
010100        05 FILLER                 PICTURE X(7)        VALUE SPACE.
010200     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
010300        05 FILE-RECORD-INFO-P1-120.
010400           07 FILLER              PIC X(5).
010500           07 XFILE-NAME           PIC X(6).
010600           07 FILLER              PIC X(8).
010700           07 XRECORD-NAME         PIC X(6).
010800           07 FILLER              PIC X(1).
010900           07 REELUNIT-NUMBER     PIC 9(1).
011000           07 FILLER              PIC X(7).
011100           07 XRECORD-NUMBER       PIC 9(6).
011200           07 FILLER              PIC X(6).
011300           07 UPDATE-NUMBER       PIC 9(2).
011400           07 FILLER              PIC X(5).
011500           07 ODO-NUMBER          PIC 9(4).
011600           07 FILLER              PIC X(5).
011700           07 XPROGRAM-NAME        PIC X(5).
011800           07 FILLER              PIC X(7).
011900           07 XRECORD-LENGTH       PIC 9(6).
012000           07 FILLER              PIC X(7).
012100           07 CHARS-OR-RECORDS    PIC X(2).
012200           07 FILLER              PIC X(1).
012300           07 XBLOCK-SIZE          PIC 9(4).
012400           07 FILLER              PIC X(6).
012500           07 RECORDS-IN-FILE     PIC 9(6).
012600           07 FILLER              PIC X(5).
012700           07 XFILE-ORGANIZATION   PIC X(2).
012800           07 FILLER              PIC X(6).
012900           07 XLABEL-TYPE          PIC X(1).
013000        05 FILE-RECORD-INFO-P121-240.
013100           07 FILLER              PIC X(8).
013200           07 XRECORD-KEY          PIC X(29).
013300           07 FILLER              PIC X(9).
013400           07 ALTERNATE-KEY1      PIC X(29).
013500           07 FILLER              PIC X(9).
013600           07 ALTERNATE-KEY2      PIC X(29).
013700           07 FILLER              PIC X(7).
013800 01  TEST-RESULTS.
013900     02 FILLER                    PICTURE X VALUE SPACE.
014000     02 FEATURE                   PICTURE X(20) VALUE SPACE.
014100     02 FILLER                    PICTURE X VALUE SPACE.
014200     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
014300     02 FILLER                    PICTURE X  VALUE SPACE.
014400     02  PAR-NAME.
014500       03 FILLER PICTURE X(12) VALUE SPACE.
014600       03  PARDOT-X PICTURE X  VALUE SPACE.
014700       03 DOTVALUE PICTURE 99  VALUE ZERO.
014800       03 FILLER PIC X(5) VALUE SPACE.
014900     02 FILLER PIC X(10) VALUE SPACE.
015000     02 RE-MARK PIC X(61).
015100 01  TEST-COMPUTED.
015200     02 FILLER PIC X(30) VALUE SPACE.
015300     02 FILLER PIC X(17) VALUE "       COMPUTED=".
015400     02 COMPUTED-X.
015500     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
015600     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
015700     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
015800     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
015900     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
016000     03       CM-18V0 REDEFINES COMPUTED-A.
016100         04 COMPUTED-18V0                   PICTURE -9(18).
016200         04 FILLER                          PICTURE X.
016300     03 FILLER PIC X(50) VALUE SPACE.
016400 01  TEST-CORRECT.
016500     02 FILLER PIC X(30) VALUE SPACE.
016600     02 FILLER PIC X(17) VALUE "       CORRECT =".
016700     02 CORRECT-X.
016800     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
016900     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
017000     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
017100     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
017200     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
017300     03      CR-18V0 REDEFINES CORRECT-A.
017400         04 CORRECT-18V0                    PICTURE -9(18).
017500         04 FILLER                          PICTURE X.
017600     03 FILLER PIC X(50) VALUE SPACE.
017700 01  CCVS-C-1.
017800     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
017900-    "SS  PARAGRAPH-NAME
018000-    "        REMARKS".
018100     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
018200 01  CCVS-C-2.
018300     02 FILLER PICTURE IS X VALUE IS SPACE.
018400     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
018500     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
018600     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
018700     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
018800 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
018900 01  REC-CT PICTURE 99 VALUE ZERO.
019000 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
019100 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
019200 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
019300 01  PASS-COUNTER PIC 999 VALUE ZERO.
019400 01  TOTAL-ERROR PIC 999 VALUE ZERO.
019500 01  ERROR-HOLD PIC 999 VALUE ZERO.
019600 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
019700 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
019800 01  CCVS-H-1.
019900     02  FILLER   PICTURE X(27)  VALUE SPACE.
020000     02 FILLER PICTURE X(67) VALUE
020100     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
020200-    " SYSTEM".
020300     02  FILLER     PICTURE X(26)  VALUE SPACE.
020400 01  CCVS-H-2.
020500     02 FILLER PICTURE X(52) VALUE IS
020600     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
020700     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
020800     02 TEST-ID PICTURE IS X(9).
020900     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
021000 01  CCVS-H-3.
021100     02  FILLER PICTURE X(34) VALUE
021200     " FOR OFFICIAL USE ONLY    ".
021300     02  FILLER PICTURE X(58) VALUE
021400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
021500     02  FILLER PICTURE X(28) VALUE
021600     "  COPYRIGHT   1985 ".
021700 01  CCVS-E-1.
021800     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
021900     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
022000     02 ID-AGAIN PICTURE IS X(9).
022100     02 FILLER PICTURE X(45) VALUE IS
022200     " NTIS DISTRIBUTION COBOL 85".
022300 01  CCVS-E-2.
022400     02  FILLER                   PICTURE X(31)  VALUE
022500     SPACE.
022600     02  FILLER                   PICTURE X(21)  VALUE SPACE.
022700     02 CCVS-E-2-2.
022800         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
022900         03 FILLER PICTURE IS X VALUE IS SPACE.
023000         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
023100 01  CCVS-E-3.
023200     02  FILLER PICTURE X(22) VALUE
023300     " FOR OFFICIAL USE ONLY".
023400     02  FILLER PICTURE X(12) VALUE SPACE.
023500     02  FILLER PICTURE X(58) VALUE
023600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
023700     02  FILLER PICTURE X(13) VALUE SPACE.
023800     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
023900 01  CCVS-E-4.
024000     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
024100     02 FILLER PIC XXXX VALUE " OF ".
024200     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
024300     02 FILLER PIC X(40) VALUE
024400      "  TESTS WERE EXECUTED SUCCESSFULLY".
024500 01  XXINFO.
024600     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
024700     02 INFO-TEXT.
024800     04 FILLER PIC X(20) VALUE SPACE.
024900     04 XXCOMPUTED PIC X(20).
025000     04 FILLER PIC X(5) VALUE SPACE.
025100     04 XXCORRECT PIC X(20).
025200 01  HYPHEN-LINE.
025300     02 FILLER PICTURE IS X VALUE IS SPACE.
025400     02 FILLER PICTURE IS X(65) VALUE IS "************************
025500-    "*****************************************".
025600     02 FILLER PICTURE IS X(54) VALUE IS "************************
025700-    "******************************".
025800 01  CCVS-PGM-ID PIC X(6) VALUE
025900     "SQ109M".
026000 PROCEDURE DIVISION.
026100 CCVS1 SECTION.
026200 OPEN-FILES.
026300P    OPEN I-O RAW-DATA.
026400P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
026500P    READ RAW-DATA INVALID KEY GO TO END-E-1.
026600P    MOVE "ABORTED " TO C-ABORT.
026700P    ADD 1 TO C-NO-OF-TESTS.
026800P    ACCEPT C-DATE  FROM DATE.
026900P    ACCEPT C-TIME  FROM TIME.
027000P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
027100PEND-E-1.
027200P    CLOSE RAW-DATA.
027300     OPEN     OUTPUT PRINT-FILE.
027400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
027500     MOVE    SPACE TO TEST-RESULTS.
027600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
027700     MOVE ZERO TO REC-SKL-SUB.
027800     PERFORM CCVS-INIT-FILE 9 TIMES.
027900 CCVS-INIT-FILE.
028000     ADD 1 TO REC-SKL-SUB.
028100     MOVE FILE-RECORD-INFO-SKELETON TO
028200                  FILE-RECORD-INFO (REC-SKL-SUB).
028300 CCVS-INIT-EXIT.
028400     GO TO CCVS1-EXIT.
028500 CLOSE-FILES.
028600     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
028700P    OPEN I-O RAW-DATA.
028800P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
028900P    READ RAW-DATA INVALID KEY GO TO END-E-2.
029000P    MOVE "OK.     " TO C-ABORT.
029100P    MOVE PASS-COUNTER TO C-OK.
029200P    MOVE ERROR-HOLD   TO C-ALL.
029300P    MOVE ERROR-COUNTER TO C-FAIL.
029400P    MOVE DELETE-CNT TO C-DELETED.
029500P    MOVE INSPECT-COUNTER TO C-INSPECT.
029600P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
029700PEND-E-2.
029800P    CLOSE RAW-DATA.
029900 TERMINATE-CCVS.
030000S    EXIT PROGRAM.
030100STERMINATE-CALL.
030200     STOP     RUN.
030300 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
030400 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
030500 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
030600 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
030700     MOVE "****TEST DELETED****" TO RE-MARK.
030800 PRINT-DETAIL.
030900     IF REC-CT NOT EQUAL TO ZERO
031000             MOVE "." TO PARDOT-X
031100             MOVE REC-CT TO DOTVALUE.
031200     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
031300     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
031400        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
031500          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
031600     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
031700     MOVE SPACE TO CORRECT-X.
031800     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
031900     MOVE     SPACE TO RE-MARK.
032000 HEAD-ROUTINE.
032100     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032200     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
032300     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
032400 COLUMN-NAMES-ROUTINE.
032500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
032800 END-ROUTINE.
032900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
033000 END-RTN-EXIT.
033100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033200 END-ROUTINE-1.
033300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
033400      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
033500      ADD PASS-COUNTER TO ERROR-HOLD.
033600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
033700      MOVE PASS-COUNTER TO CCVS-E-4-1.
033800      MOVE ERROR-HOLD TO CCVS-E-4-2.
033900      MOVE CCVS-E-4 TO CCVS-E-2-2.
034000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
034100  END-ROUTINE-12.
034200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
034300     IF       ERROR-COUNTER IS EQUAL TO ZERO
034400         MOVE "NO " TO ERROR-TOTAL
034500         ELSE
034600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
034700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
034800     PERFORM WRITE-LINE.
034900 END-ROUTINE-13.
035000     IF DELETE-CNT IS EQUAL TO ZERO
035100         MOVE "NO " TO ERROR-TOTAL  ELSE
035200         MOVE DELETE-CNT TO ERROR-TOTAL.
035300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
035400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035500      IF   INSPECT-COUNTER EQUAL TO ZERO
035600          MOVE "NO " TO ERROR-TOTAL
035700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
035800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
035900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036100 WRITE-LINE.
036200     ADD 1 TO RECORD-COUNT.
036300Y    IF RECORD-COUNT GREATER 50
036400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
036500Y        MOVE SPACE TO DUMMY-RECORD
036600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
036700Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
036800Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
036900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
037000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
037100Y        MOVE ZERO TO RECORD-COUNT.
037200     PERFORM WRT-LN.
037300 WRT-LN.
037400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
037500     MOVE SPACE TO DUMMY-RECORD.
037600 BLANK-LINE-PRINT.
037700     PERFORM WRT-LN.
037800 FAIL-ROUTINE.
037900     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038000     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
038100     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
038200     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
038300     GO TO FAIL-ROUTINE-EX.
038400 FAIL-ROUTINE-WRITE.
038500     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
038600     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
038700 FAIL-ROUTINE-EX. EXIT.
038800 BAIL-OUT.
038900     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
039000     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
039100 BAIL-OUT-WRITE.
039200     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
039300     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039400 BAIL-OUT-EX. EXIT.
039500 CCVS1-EXIT.
039600     EXIT.
039700 SECT-SQ109-0001 SECTION.
039800 SEQ-INIT-001.
039900     MOVE "SQ-FS1" TO XFILE-NAME (1).
040000     MOVE "R1-F-G" TO XRECORD-NAME (1).
040100     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
040200     MOVE 000120 TO XRECORD-LENGTH (1).
040300     MOVE "RC"   TO CHARS-OR-RECORDS (1).
040400     MOVE 0001   TO XBLOCK-SIZE (1).
040500     MOVE 000750 TO RECORDS-IN-FILE (1).
040600     MOVE "SQ"   TO XFILE-ORGANIZATION (1).
040700     MOVE "S" TO XLABEL-TYPE (1).
040800     MOVE 000001 TO XRECORD-NUMBER (1).
040900     OPEN OUTPUT SQ-FS1.
041000 SEQ-TEST-001.
041100     MOVE FILE-RECORD-INFO-P1-120 (1)  TO SQ-FS1R1-F-G-120.
041200     WRITE SQ-FS1R1-F-G-120.
041300     IF      XRECORD-NUMBER (1) EQUAL TO 325
041400H             ADD 1 TO REELUNIT-NUMBER (1)
041500H             CLOSE SQ-FS1 REEL.
041600I    MOVE "CLOSE REEL DELETED" TO RE-MARK.
041700     IF XRECORD-NUMBER (1) EQUAL TO 750
041800         GO TO SEQ-WRITE-001.
041900     ADD 1 TO XRECORD-NUMBER (1).
042000     GO TO SEQ-TEST-001.
042100 SEQ-WRITE-001.
042200     MOVE "CREATE FILE SQ-FS1" TO FEATURE.
042300     MOVE "SEQ-TEST-001" TO PAR-NAME.
042400     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
042500     MOVE  XRECORD-NUMBER (1) TO CORRECT-18V0.
042600     PERFORM PRINT-DETAIL.
042700     CLOSE SQ-FS1.
042800*        A SEQUENTIAL TAPE FILE WITH 120 CHARACTER RECORDS
042900*    HAS BEEN CREATED. THE FILE CONTAINS 750 RECORDS.
043000 SEQ-INIT-002.
043100     MOVE ZERO TO WRK-CS-09V00.
043200*        THIS TEST READS AND CHECKS THE FILE CREATED IN
043300*    SEQ-TEST-001.
043400     OPEN INPUT SQ-FS1.
043500 SEQ-TEST-002.
043600     READ SQ-FS1
043700          AT END GO TO SEQ-TEST-002-1.
043800     MOVE   SQ-FS1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
043900     ADD 1 TO WRK-CS-09V00.
044000     IF WRK-CS-09V00 GREATER THAN 750
044100        MOVE "MORE THAN 750 RECORDS" TO RE-MARK
044200        GO TO SEQ-FAIL-002.
044300     IF WRK-CS-09V00 NOT EQUAL TO XRECORD-NUMBER (1)
044400         ADD 1 TO RECORDS-IN-ERROR
044500         GO TO SEQ-TEST-002.
044600     IF XFILE-NAME (1) NOT EQUAL TO "SQ-FS1"
044700        ADD 1 TO RECORDS-IN-ERROR
044800        GO TO SEQ-TEST-002.
044900     IF XLABEL-TYPE (1) NOT EQUAL TO "S"
045000        ADD 1 TO RECORDS-IN-ERROR.
045100     GO TO SEQ-TEST-002.
045200 SEQ-TEST-002-1.
045300     IF WRK-CS-09V00 EQUAL TO ZERO
045400         MOVE "AT END ON FIRST READ" TO RE-MARK
045500         GO TO SEQ-FAIL-002.
045600     IF RECORDS-IN-ERROR EQUAL TO ZERO
045700         GO TO SEQ-PASS-002.
045800     MOVE "ERRORS IN READING SQ-FS1" TO RE-MARK.
045900 SEQ-FAIL-002.
046000     MOVE "RECORDS IN ERROR =" TO COMPUTED-A.
046100     MOVE RECORDS-IN-ERROR TO CORRECT-18V0.
046200     PERFORM FAIL.
046300     GO TO SEQ-WRITE-002.
046400 SEQ-PASS-002.
046500     PERFORM PASS.
046600     MOVE "FILE VERIFIED RECS =" TO COMPUTED-A.
046700     MOVE WRK-CS-09V00 TO CORRECT-18V0.
046800 SEQ-WRITE-002.
046900     MOVE "SEQ-TEST-002" TO PAR-NAME.
047000     MOVE "VERIFY FILE SQ-FS1" TO FEATURE.
047100     PERFORM PRINT-DETAIL.
047200 SEQ-CLOSE-002.
047300     CLOSE SQ-FS1.
047400 READ-INIT-GF-01.
047500     MOVE ZERO TO WRK-CS-09V00.
047600     MOVE ZERO TO RECORDS-IN-ERROR.
047700     OPEN INPUT   SQ-FS1.
047800*            FOUR OPTIONS FOR THE READ STATEMENT ARE CHECKED
047900*    IN THIS SERIES OF TESTS.
048000     MOVE "READ...RECORD AT END ..." TO FEATURE.
048100     MOVE "READ-TEST-GF-01" TO PAR-NAME.
048200     MOVE ZERO TO ERROR-FLAG.
048300 READ-TEST-GF-01.
048400     READ SQ-FS1 RECORD AT END
048500              MOVE "UNEXPECTED EOF" TO COMPUTED-A
048600              MOVE 1 TO EOF-FLAG
048700              GO TO READ-FAIL-GF-01.
048800     PERFORM RECORD-CHECK.
048900     IF WRK-CS-09V00 EQUAL TO 200
049000              GO TO READ-TEST-GF-01-1.
049100             GO TO READ-TEST-GF-01.
049200 RECORD-CHECK.
049300     MOVE SQ-FS1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
049400     ADD 1 TO WRK-CS-09V00.
049500     IF WRK-CS-09V00 NOT EQUAL TO XRECORD-NUMBER (1)
049600         ADD 1 TO RECORDS-IN-ERROR
049700         MOVE 1 TO ERROR-FLAG.
049800 READ-TEST-GF-01-1.
049900     IF ERROR-FLAG EQUAL TO ZERO
050000         GO TO READ-PASS-GF-01.
050100     MOVE "ERROR IN RECORD(S)" TO COMPUTED-A.
050200 READ-FAIL-GF-01.
050300     MOVE "VII-44; 4.4.2                            " TO  RE-MARK.
050400     PERFORM FAIL.
050500     GO TO READ-WRITE-GF-01.
050600 READ-PASS-GF-01.
050700     PERFORM PASS.
050800 READ-WRITE-GF-01.
050900     PERFORM PRINT-DETAIL.
051000 READ-INIT-GF-02.
051100     IF EOF-FLAG EQUAL TO 1
051200        GO TO SEQ-EOF-003.
051300     MOVE ZERO TO ERROR-FLAG.
051400     MOVE "READ...AT END..." TO FEATURE.
051500     MOVE "READ-TEST-GF-02" TO PAR-NAME.
051600 READ-TEST-GF-02.
051700     READ SQ-FS1 AT END
051800         MOVE "UNEXPECTED EOF" TO COMPUTED-A
051900         MOVE 1 TO EOF-FLAG
052000         GO TO READ-FAIL-GF-02.
052100     PERFORM RECORD-CHECK.
052200     IF WRK-CS-09V00 EQUAL TO 400
052300         GO TO READ-TEST-GF-02-1.
052400     GO TO READ-TEST-GF-02.
052500 READ-TEST-GF-02-1.
052600     IF ERROR-FLAG EQUAL TO ZERO
052700         GO TO READ-PASS-GF-02.
052800     MOVE "ERROR IN RECORD(S)" TO COMPUTED-A.
052900 READ-FAIL-GF-02.
053000     MOVE "VII-44; 4.4.2                            " TO  RE-MARK.
053100     PERFORM FAIL.
053200     GO TO READ-WRITE-GF-02.
053300 READ-PASS-GF-02.
053400     PERFORM PASS.
053500 READ-WRITE-GF-02.
053600     PERFORM PRINT-DETAIL.
053700 READ-INIT-GF-03.
053800     IF EOF-FLAG EQUAL TO 1
053900        GO TO SEQ-EOF-003.
054000     MOVE ZERO TO ERROR-FLAG.
054100     MOVE "READ...RECORD END..." TO FEATURE.
054200     MOVE "READ-TEST-GF-03" TO PAR-NAME.
054300 READ-TEST-GF-03.
054400     READ SQ-FS1 RECORD END
054500          MOVE "UNEXPECTED EOF" TO COMPUTED-A
054600          MOVE 1 TO EOF-FLAG
054700          GO TO READ-FAIL-GF-03.
054800     PERFORM RECORD-CHECK.
054900     IF WRK-CS-09V00 EQUAL TO 600
055000         GO TO READ-TEST-GF-03-1.
055100     GO TO READ-TEST-GF-03.
055200 READ-TEST-GF-03-1.
055300     IF ERROR-FLAG EQUAL TO ZERO
055400         GO TO READ-PASS-GF-03.
055500     MOVE "ERROR IN RECORD(S)" TO COMPUTED-A.
055600 READ-FAIL-GF-03.
055700     MOVE "VII-44; 4.4.2                            " TO  RE-MARK.
055800     PERFORM FAIL.
055900     GO TO READ-WRITE-GF-03.
056000 READ-PASS-GF-03.
056100     PERFORM PASS.
056200 READ-WRITE-GF-03.
056300     PERFORM PRINT-DETAIL.
056400 READ-INIT-GF-04.
056500     IF EOF-FLAG EQUAL TO 1
056600         GO TO SEQ-EOF-003.
056700     MOVE ZERO TO ERROR-FLAG.
056800     MOVE "READ...END..." TO FEATURE.
056900     MOVE  "READ-TEST-GF-04" TO PAR-NAME.
057000 READ-TEST-GF-04.
057100     READ SQ-FS1 END GO TO READ-TEST-GF-04-1.
057200     PERFORM RECORD-CHECK.
057300     IF WRK-CS-09V00 GREATER THAN 750
057400          GO TO READ-TEST-GF-04-1.
057500     GO TO READ-TEST-GF-04.
057600 READ-TEST-GF-04-1.
057700     IF ERROR-FLAG EQUAL TO ZERO
057800          GO TO READ-PASS-GF-04.
057900 READ-FAIL-GF-04.
058000     MOVE "VII-44; 4.4.2                            " TO  RE-MARK.
058100     MOVE "ERROR IN RECORD(S)" TO COMPUTED-A.
058200     PERFORM FAIL.
058300     GO TO READ-WRITE-GF-04.
058400 READ-PASS-GF-04.
058500     PERFORM PASS.
058600 READ-WRITE-GF-04.
058700     PERFORM PRINT-DETAIL.
058800 SEQ-TEST-003.
058900     IF RECORDS-IN-ERROR NOT EQUAL TO ZERO
059000          MOVE "RECORDS IN ERROR =" TO COMPUTED-A
059100          MOVE RECORDS-IN-ERROR TO CORRECT-18V0
059200          GO TO SEQ-FAIL-003.
059300     IF WRK-CS-09V00 GREATER THAN 750
059400          MOVE "MORE THAN 750 RECORDS" TO RE-MARK
059500          GO TO SEQ-FAIL-003.
059600 SEQ-PASS-003.
059700     PERFORM PASS.
059800     GO TO SEQ-WRITE-003.
059900 SEQ-EOF-003.
060000     MOVE "LESS THAN 750 RECORDS" TO RE-MARK.
060100     MOVE "RECORDS READ =" TO COMPUTED-A.
060200     MOVE WRK-CS-09V00 TO CORRECT-18V0.
060300 SEQ-FAIL-003.
060400     PERFORM FAIL.
060500 SEQ-WRITE-003.
060600     MOVE "SEQ-TEST-003" TO PAR-NAME.
060700     MOVE "READ FILE SQ-FS1" TO FEATURE.
060800     PERFORM PRINT-DETAIL.
060900 SEQ-CLOSE-003.
061000     CLOSE SQ-FS1.
061100 TERMINATE-ROUTINE.
061200     EXIT.
061300 CCVS-EXIT SECTION.
061400 CCVS-999999.
061500     GO TO CLOSE-FILES.
