000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ104A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                             REVISED 1986, AUGUST             *
001000*                                                              *
001100*    CREATION DATE     /     VALIDATION DATE                   *
001200*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001300*                                                              *
001400****************************************************************
001500*                                                              *
001600*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001700*                                                              *
001800*            X-14   SEQUENTIAL MASS STORAGE                    *
001900*            X-55   SYSTEM PRINTER                             *
002000*            X-82   SOURCE-COMPUTER                            *
002100*            X-83   OBJECT-COMPUTER.                           *
002200*                                                              *
002300****************************************************************
002400*                                                              *
002500*    SQ104A CREATES A SEQUENTIAL MASS STORAGE FILE CONTAINING  *
002600*    649 FIXED LENGTH RECORDS, EACH 120 CHARACTERS LONG.  THE  *
002700*    FILE READ IS TWICE.  THE FIRST PASS CHECKS THAT ALL THE   *
002800*    EXPECTED RECORDS ARE PRESENT.  THE SECOND PASS PERFORMS   *
002900*    SIMILAR CHECKS, BUT USES ALL FOUR VARIANTS OF THE READ    *
003000*    STATEMENT WITH THE END PHRASE THAT CAN BE PRODUCED BY     *
003100*    INCLUDING OR OMITTING THE OPTIONAL WORDS "RECORD" AND     *
003200*    "AT".                                                     *
003300*                                                              *
003400*    THE PROGRAM OMITS THE OPTIONAL WORDS "ORGANIZATION IS"    *
003500*    FROM THE "ORGANIZATION IS SEQUENTIAL" CLAUSE OF THE       *
003600*    FILE-CONTROL ENTRY, AND PLACES THE ASSIGN CLAUSE IN A     *
003700*    POSITION OTHER THAN FIRST IN THE SAME ENTRY.              *
003800*                                                              *
003900****************************************************************
004000*
004100*
004200 ENVIRONMENT DIVISION.
004300 CONFIGURATION SECTION.
004400 SOURCE-COMPUTER.
004500     XXXXX082.
004600 OBJECT-COMPUTER.
004700     XXXXX083.
004800*
004900 INPUT-OUTPUT SECTION.
005000 FILE-CONTROL.
005100     SELECT PRINT-FILE ASSIGN TO
005200     XXXXX055.
005300*
005400P    SELECT RAW-DATA   ASSIGN TO
005500P    XXXXX062
005600P          ORGANIZATION IS INDEXED
005700P          ACCESS MODE  IS RANDOM
005800P          RECORD-KEY   IS RAW-DATA-KEY.
005900P
006000     SELECT SQ-FS3
006100            ACCESS MODE SEQUENTIAL
006200            ASSIGN TO
006300     XXXXX014
006400            ORGANIZATION IS SEQUENTIAL
006500            .
006600*
006700*
006800 DATA DIVISION.
006900 FILE SECTION.
007000P
007100PFD  RAW-DATA.
007200P01  RAW-DATA-SATZ.
007300P    05  RAW-DATA-KEY        PIC X(6).
007400P    05  C-DATE              PIC 9(6).
007500P    05  C-TIME              PIC 9(8).
007600P    05  NO-OF-TESTS         PIC 99.
007700P    05  C-OK                PIC 999.
007800P    05  C-ALL               PIC 999.
007900P    05  C-FAIL              PIC 999.
008000P    05  C-DELETED           PIC 999.
008100P    05  C-INSPECT           PIC 999.
008200P    05  C-NOTE              PIC X(13).
008300P    05  C-INDENT            PIC X.
008400P    05  C-ABORT             PIC X(8).
008500*
008600 FD  SQ-FS3
008700C    LABEL RECORD IS STANDARD
008800C    DATA  RECORD SQ-FS3R1-F-G-120
008900     BLOCK CONTAINS 120 CHARACTERS
009000     RECORD CONTAINS 120 CHARACTERS.
009100 01  SQ-FS3R1-F-G-120 PIC X(120).
009200*
009300 FD  PRINT-FILE
009400C    LABEL RECORDS
009500C    XXXXX084
009600C    DATA RECORD IS PRINT-REC DUMMY-RECORD
009700               .
009800 01  PRINT-REC    PICTURE X(120).
009900 01  DUMMY-RECORD PICTURE X(120).
010000*
010100 WORKING-STORAGE SECTION.
010200*
010300***************************************************************
010400*                                                             *
010500*    WORKING-STORAGE DATA ITEMS SPECIFIC TO THIS TEST SUITE   *
010600*                                                             *
010700***************************************************************
010800*
010900 01  RECORDS-IN-ERROR PIC S9(5) USAGE COMP VALUE ZERO.
011000 01  ERROR-FLAG PIC 9 VALUE ZERO.
011100 01  EOF-FLAG   PICTURE 9 VALUE ZERO.
011200*
011300***************************************************************
011400*                                                             *
011500*    WORKING-STORAGE DATA ITEMS USED BY THE CCVS              *
011600*                                                             *
011700***************************************************************
011800*
011900 01  REC-SKEL-SUB   PIC 99.
012000*
012100 01  FILE-RECORD-INFORMATION-REC.
012200     03 FILE-RECORD-INFO-SKELETON.
012300        05 FILLER                 PICTURE X(48)       VALUE
012400             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
012500        05 FILLER                 PICTURE X(46)       VALUE
012600             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
012700        05 FILLER                 PICTURE X(26)       VALUE
012800             ",LFIL=000000,ORG=  ,LBLR= ".
012900        05 FILLER                 PICTURE X(37)       VALUE
013000             ",RECKEY=                             ".
013100        05 FILLER                 PICTURE X(38)       VALUE
013200             ",ALTKEY1=                             ".
013300        05 FILLER                 PICTURE X(38)       VALUE
013400             ",ALTKEY2=                             ".
013500        05 FILLER                 PICTURE X(7)        VALUE SPACE.
013600     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
013700        05 FILE-RECORD-INFO-P1-120.
013800           07 FILLER              PIC X(5).
013900           07 XFILE-NAME          PIC X(6).
014000           07 FILLER              PIC X(8).
014100           07 XRECORD-NAME        PIC X(6).
014200           07 FILLER              PIC X(1).
014300           07 REELUNIT-NUMBER     PIC 9(1).
014400           07 FILLER              PIC X(7).
014500           07 XRECORD-NUMBER      PIC 9(6).
014600           07 FILLER              PIC X(6).
014700           07 UPDATE-NUMBER       PIC 9(2).
014800           07 FILLER              PIC X(5).
014900           07 ODO-NUMBER          PIC 9(4).
015000           07 FILLER              PIC X(5).
015100           07 XPROGRAM-NAME       PIC X(5).
015200           07 FILLER              PIC X(7).
015300           07 XRECORD-LENGTH      PIC 9(6).
015400           07 FILLER              PIC X(7).
015500           07 CHARS-OR-RECORDS    PIC X(2).
015600           07 FILLER              PIC X(1).
015700           07 XBLOCK-SIZE         PIC 9(4).
015800           07 FILLER              PIC X(6).
015900           07 RECORDS-IN-FILE     PIC 9(6).
016000           07 FILLER              PIC X(5).
016100           07 XFILE-ORGANIZATION  PIC X(2).
016200           07 FILLER              PIC X(6).
016300           07 XLABEL-TYPE         PIC X(1).
016400        05 FILE-RECORD-INFO-P121-240.
016500           07 FILLER              PIC X(8).
016600           07 XRECORD-KEY         PIC X(29).
016700           07 FILLER              PIC X(9).
016800           07 ALTERNATE-KEY1      PIC X(29).
016900           07 FILLER              PIC X(9).
017000           07 ALTERNATE-KEY2      PIC X(29).
017100           07 FILLER              PIC X(7).
017200*
017300 01  TEST-RESULTS.
017400     02 FILLER              PIC X      VALUE SPACE.
017500     02  PAR-NAME.
017600       03 FILLER              PIC X(14)  VALUE SPACE.
017700       03 PARDOT-X            PIC X      VALUE SPACE.
017800       03 DOTVALUE            PIC 99     VALUE ZERO.
017900     02 FILLER              PIC X      VALUE SPACE.
018000     02 FEATURE             PIC X(24)  VALUE SPACE.
018100     02 FILLER              PIC X      VALUE SPACE.
018200     02 P-OR-F              PIC X(5)   VALUE SPACE.
018300     02 FILLER              PIC X(9)   VALUE SPACE.
018400     02 RE-MARK             PIC X(61).
018500 01  TEST-COMPUTED.
018600   02 FILLER  PIC X(30)  VALUE SPACE.
018700   02 FILLER  PIC X(17)  VALUE "      COMPUTED =".
018800   02 COMPUTED-X.
018900     03 COMPUTED-A    PIC X(20)  VALUE SPACE.
019000     03 COMPUTED-N    REDEFINES COMPUTED-A PIC -9(9).9(9).
019100     03 COMPUTED-0V18 REDEFINES COMPUTED-A PIC -.9(18).
019200     03 COMPUTED-4V14 REDEFINES COMPUTED-A PIC -9(4).9(14).
019300     03 COMPUTED-14V4 REDEFINES COMPUTED-A PIC -9(14).9(4).
019400     03       CM-18V0 REDEFINES COMPUTED-A.
019500        04 COMPUTED-18V0                   PIC -9(18).
019600        04 FILLER                          PIC X.
019700     03 FILLER PIC X(50) VALUE SPACE.
019800 01  TEST-CORRECT.
019900     02 FILLER PIC X(30) VALUE SPACE.
020000     02 FILLER PIC X(17) VALUE "       CORRECT =".
020100     02 CORRECT-X.
020200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
020400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
020600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
020700     03      CR-18V0 REDEFINES CORRECT-A.
020800         04 CORRECT-18V0                     PIC -9(18).
020900         04 FILLER                           PIC X.
021000     03 FILLER PIC X(2) VALUE SPACE.
021100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021200 01  CCVS-C-1.
021300     02 FILLER  PIC IS X        VALUE  SPACE.
021400     02 FILLER  PIC IS X(17)    VALUE "PARAGRAPH-NAME".
021500     02 FILLER  PIC IS X        VALUE  SPACE.
021600     02 FILLER  PIC IS X(24)    VALUE IS "FEATURE".
021700     02 FILLER  PIC IS X        VALUE  SPACE.
021800     02 FILLER  PIC IS X(5)     VALUE "PASS ".
021900     02 FILLER  PIC IS X(9)     VALUE  SPACE.
022000     02 FILLER  PIC IS X(62)    VALUE "REMARKS".
022100 01  CCVS-C-2.
022200     02 FILLER  PIC X(19)  VALUE  SPACE.
022300     02 FILLER  PIC X(6)   VALUE "TESTED".
022400     02 FILLER  PIC X(19)  VALUE  SPACE.
022500     02 FILLER  PIC X(4)   VALUE "FAIL".
022600     02 FILLER  PIC X(72)  VALUE  SPACE.
022700 01  REC-SKL-SUB       PIC 9(2)     VALUE ZERO.
022800 01  REC-CT            PIC 99       VALUE ZERO.
022900 01  DELETE-COUNTER    PIC 999      VALUE ZERO.
023000 01  ERROR-COUNTER     PIC 999      VALUE ZERO.
023100 01  INSPECT-COUNTER   PIC 999      VALUE ZERO.
023200 01  PASS-COUNTER      PIC 999      VALUE ZERO.
023300 01  TOTAL-ERROR       PIC 999      VALUE ZERO.
023400 01  ERROR-HOLD        PIC 999      VALUE ZERO.
023500 01  DUMMY-HOLD        PIC X(120)   VALUE SPACE.
023600 01  RECORD-COUNT      PIC 9(5)     VALUE ZERO.
023700 01  ANSI-REFERENCE    PIC X(48)    VALUE SPACES.
023800 01  CCVS-H-1.
023900     02  FILLER          PIC X(39)    VALUE SPACES.
024000     02  FILLER          PIC X(42)    VALUE
024100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024200     02  FILLER          PIC X(39)    VALUE SPACES.
024300 01  CCVS-H-2A.
024400   02  FILLER            PIC X(40)  VALUE SPACE.
024500   02  FILLER            PIC X(7)   VALUE "CCVS85 ".
024600   02  FILLER            PIC XXXX   VALUE
024700     "4.2 ".
024800   02  FILLER            PIC X(28)  VALUE
024900            " COPY - NOT FOR DISTRIBUTION".
025000   02  FILLER            PIC X(41)  VALUE SPACE.
025100*
025200 01  CCVS-H-2B.
025300   02  FILLER            PIC X(15)  VALUE "TEST RESULT OF ".
025400   02  TEST-ID           PIC X(9).
025500   02  FILLER            PIC X(4)   VALUE " IN ".
025600   02  FILLER            PIC X(12)  VALUE
025700     " HIGH       ".
025800   02  FILLER            PIC X(22)  VALUE
025900            " LEVEL VALIDATION FOR ".
026000   02  FILLER            PIC X(58)  VALUE
026100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026200 01  CCVS-H-3.
026300     02  FILLER          PIC X(34)  VALUE
026400            " FOR OFFICIAL USE ONLY    ".
026500     02  FILLER          PIC X(58)  VALUE
026600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026700     02  FILLER          PIC X(28)  VALUE
026800            "  COPYRIGHT   1985,1986 ".
026900 01  CCVS-E-1.
027000     02 FILLER           PIC X(52)  VALUE SPACE.
027100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027200     02 ID-AGAIN         PIC X(9).
027300     02 FILLER           PIC X(45)  VALUE SPACES.
027400 01  CCVS-E-2.
027500     02  FILLER          PIC X(31)  VALUE SPACE.
027600     02  FILLER          PIC X(21)  VALUE SPACE.
027700     02  CCVS-E-2-2.
027800         03 ERROR-TOTAL    PIC XXX    VALUE SPACE.
027900         03 FILLER         PIC X      VALUE SPACE.
028000         03 ENDER-DESC     PIC X(44)  VALUE
028100            "ERRORS ENCOUNTERED".
028200 01  CCVS-E-3.
028300     02  FILLER          PIC X(22)  VALUE
028400            " FOR OFFICIAL USE ONLY".
028500     02  FILLER          PIC X(12)  VALUE SPACE.
028600     02  FILLER          PIC X(58)  VALUE
028700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028800     02  FILLER          PIC X(8)   VALUE SPACE.
028900     02  FILLER          PIC X(20)  VALUE
029000             " COPYRIGHT 1985,1986".
029100 01  CCVS-E-4.
029200     02 CCVS-E-4-1       PIC XXX    VALUE SPACE.
029300     02 FILLER           PIC X(4)   VALUE " OF ".
029400     02 CCVS-E-4-2       PIC XXX    VALUE SPACE.
029500     02 FILLER           PIC X(40)  VALUE
029600      "  TESTS WERE EXECUTED SUCCESSFULLY".
029700 01  XXINFO.
029800     02 FILLER           PIC X(19)  VALUE "*** INFORMATION ***".
029900     02 INFO-TEXT.
030000       04 FILLER             PIC X(8)   VALUE SPACE.
030100       04 XXCOMPUTED         PIC X(20).
030200       04 FILLER             PIC X(5)   VALUE SPACE.
030300       04 XXCORRECT          PIC X(20).
030400     02 INF-ANSI-REFERENCE PIC X(48).
030500 01  HYPHEN-LINE.
030600     02 FILLER  PIC IS X VALUE IS SPACE.
030700     02 FILLER  PIC IS X(65)    VALUE IS "************************
030800-    "*****************************************".
030900     02 FILLER  PIC IS X(54)    VALUE IS "************************
031000-    "******************************".
031100 01  CCVS-PGM-ID  PIC X(9)   VALUE
031200     "SQ104A".
031300*
031400*
031500 PROCEDURE DIVISION.
031600*
031700 CCVS1 SECTION.
031800 OPEN-FILES.
031900P    OPEN    I-O RAW-DATA.
032000P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
032100P    READ    RAW-DATA INVALID KEY GO TO END-E-1.
032200P    MOVE   "ABORTED "   TO C-ABORT.
032300P    ADD     1           TO C-NO-OF-TESTS.
032400P    ACCEPT  C-DATE      FROM DATE.
032500P    ACCEPT  C-TIME      FROM TIME.
032600P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
032700PEND-E-1.
032800P    CLOSE   RAW-DATA.
032900     OPEN    OUTPUT PRINT-FILE.
033000     MOVE    CCVS-PGM-ID TO TEST-ID.
033100     MOVE    CCVS-PGM-ID TO ID-AGAIN.
033200     MOVE    SPACE TO TEST-RESULTS.
033300     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
033400     MOVE    ZERO TO REC-SKEL-SUB.
033500     PERFORM CCVS-INIT-FILE 10 TIMES.
033600     GO TO CCVS1-EXIT.
033700*
033800 CCVS-INIT-FILE.
033900     ADD     1 TO REC-SKL-SUB.
034000     MOVE    FILE-RECORD-INFO-SKELETON TO
034100                  FILE-RECORD-INFO (REC-SKL-SUB).
034200*
034300 CLOSE-FILES.
034400     PERFORM END-ROUTINE THRU END-ROUTINE-13.
034500     CLOSE   PRINT-FILE.
034600P    OPEN    I-O RAW-DATA.
034700P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
034800P    READ    RAW-DATA INVALID KEY GO TO END-E-2.
034900P    MOVE   "OK.     " TO C-ABORT.
035000P    MOVE    PASS-COUNTER  TO C-OK.
035100P    MOVE    ERROR-HOLD    TO C-ALL.
035200P    MOVE    ERROR-COUNTER TO C-FAIL.
035300P    MOVE    DELETE-CNT    TO C-DELETED.
035400P    MOVE    INSPECT-COUNTER TO C-INSPECT.
035500P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
035600PEND-E-2.
035700P    CLOSE   RAW-DATA.
035800 TERMINATE-CCVS.
035900S    EXIT    PROGRAM.
036000     STOP    RUN.
036100*
036200 INSPT.
036300     MOVE   "INSPT" TO P-OR-F.
036400     ADD     1 TO INSPECT-COUNTER.
036500     PERFORM PRINT-DETAIL.
036600*
036700 PASS.
036800     MOVE   "PASS " TO P-OR-F.
036900     ADD     1 TO PASS-COUNTER.
037000     PERFORM PRINT-DETAIL.
037100*
037200 FAIL.
037300     MOVE   "FAIL*" TO P-OR-F.
037400     ADD     1 TO ERROR-COUNTER.
037500     PERFORM PRINT-DETAIL.
037600*
037700 DE-LETE.
037800     MOVE   "****TEST DELETED****" TO RE-MARK.
037900     MOVE   "*****" TO P-OR-F.
038000     ADD     1 TO DELETE-COUNTER.
038100     PERFORM PRINT-DETAIL.
038200*
038300 PRINT-DETAIL.
038400     IF REC-CT NOT EQUAL TO ZERO
038500         MOVE   "." TO PARDOT-X
038600         MOVE    REC-CT TO DOTVALUE.
038700     MOVE    TEST-RESULTS TO PRINT-REC.
038800     PERFORM WRITE-LINE.
038900     IF P-OR-F EQUAL TO "FAIL*"
039000         PERFORM WRITE-LINE
039100         PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
039200     ELSE
039300         PERFORM BAIL-OUT THRU BAIL-OUT-EX.
039400     MOVE    SPACE TO P-OR-F.
039500     MOVE    SPACE TO COMPUTED-X.
039600     MOVE    SPACE TO CORRECT-X.
039700     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
039800     MOVE    SPACE TO RE-MARK.
039900*
040000 HEAD-ROUTINE.
040100     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040200     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040300     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
040400     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
040500 COLUMN-NAMES-ROUTINE.
040600     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
040700     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
040900 END-ROUTINE.
041000     MOVE    HYPHEN-LINE TO DUMMY-RECORD.
041100     PERFORM WRITE-LINE 5 TIMES.
041200 END-RTN-EXIT.
041300     MOVE    CCVS-E-1 TO DUMMY-RECORD.
041400     PERFORM WRITE-LINE 2 TIMES.
041500*
041600 END-ROUTINE-1.
041700     ADD     ERROR-COUNTER   TO ERROR-HOLD
041800     ADD     INSPECT-COUNTER TO ERROR-HOLD.
041900     ADD     DELETE-COUNTER  TO ERROR-HOLD.
042000     ADD     PASS-COUNTER    TO ERROR-HOLD.
042100     MOVE    PASS-COUNTER    TO CCVS-E-4-1.
042200     MOVE    ERROR-HOLD      TO CCVS-E-4-2.
042300     MOVE    CCVS-E-4        TO CCVS-E-2-2.
042400     MOVE    CCVS-E-2        TO DUMMY-RECORD
042500     PERFORM WRITE-LINE.
042600     MOVE   "TEST(S) FAILED" TO ENDER-DESC.
042700     IF ERROR-COUNTER IS EQUAL TO ZERO
042800         MOVE   "NO " TO ERROR-TOTAL
042900     ELSE
043000         MOVE    ERROR-COUNTER TO ERROR-TOTAL.
043100     MOVE    CCVS-E-2 TO DUMMY-RECORD.
043200     PERFORM WRITE-LINE.
043300 END-ROUTINE-13.
043400     IF DELETE-COUNTER IS EQUAL TO ZERO
043500         MOVE   "NO " TO ERROR-TOTAL
043600     ELSE
043700         MOVE    DELETE-COUNTER TO ERROR-TOTAL.
043800     MOVE   "TEST(S) DELETED     " TO ENDER-DESC.
043900     MOVE    CCVS-E-2 TO DUMMY-RECORD.
044000     PERFORM WRITE-LINE.
044100     IF INSPECT-COUNTER EQUAL TO ZERO
044200         MOVE   "NO " TO ERROR-TOTAL
044300     ELSE
044400         MOVE    INSPECT-COUNTER TO ERROR-TOTAL.
044500     MOVE   "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
044600     MOVE    CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
044700     MOVE    CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
044800*
044900 WRITE-LINE.
045000     ADD     1 TO RECORD-COUNT.
045100Y    IF RECORD-COUNT GREATER 50
045200Y        MOVE  DUMMY-RECORD TO DUMMY-HOLD
045300Y        MOVE  SPACE TO DUMMY-RECORD
045400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
045500Y        MOVE  CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
045600Y        MOVE  CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
045700Y        MOVE  HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
045800Y        MOVE  DUMMY-HOLD TO DUMMY-RECORD
045900Y        MOVE  ZERO TO RECORD-COUNT.
046000     PERFORM WRT-LN.
046100*
046200 WRT-LN.
046300     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
046400     MOVE    SPACE TO DUMMY-RECORD.
046500 BLANK-LINE-PRINT.
046600     PERFORM WRT-LN.
046700 FAIL-ROUTINE.
046800     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
046900     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
047000     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
047100     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
047200     MOVE    XXINFO TO DUMMY-RECORD.
047300     PERFORM WRITE-LINE 2 TIMES.
047400     MOVE    SPACES TO INF-ANSI-REFERENCE.
047500     GO TO   FAIL-ROUTINE-EX.
047600 FAIL-ROUTINE-WRITE.
047700     MOVE    TEST-COMPUTED  TO PRINT-REC
047800     PERFORM WRITE-LINE
047900     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
048000     MOVE    TEST-CORRECT   TO PRINT-REC
048100     PERFORM WRITE-LINE 2 TIMES.
048200     MOVE    SPACES         TO COR-ANSI-REFERENCE.
048300 FAIL-ROUTINE-EX.
048400     EXIT.
048500 BAIL-OUT.
048600     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
048700     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
048800 BAIL-OUT-WRITE.
048900     MOVE    CORRECT-A      TO XXCORRECT.
049000     MOVE    COMPUTED-A     TO XXCOMPUTED.
049100     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
049200     MOVE    XXINFO TO DUMMY-RECORD.
049300     PERFORM WRITE-LINE 2 TIMES.
049400     MOVE    SPACES TO INF-ANSI-REFERENCE.
049500 BAIL-OUT-EX.
049600     EXIT.
049700 CCVS1-EXIT.
049800     EXIT.
049900*
050000****************************************************************
050100*                                                              *
050200*    THIS POINT MARKS THE END OF THE CCVS MONITOR ROUTINES AND *
050300*    THE START OF THE TESTS OF SPECIFIC COBOL FEATURES.        *
050400*                                                              *
050500****************************************************************
050600*
050700 SECT-SQ104-0001 SECTION.
050800 SEQ-INIT-WR-01.
050900     MOVE    "SQ-FS3" TO XFILE-NAME (1).
051000     MOVE    "R1-F-G" TO XRECORD-NAME (1).
051100     MOVE     CCVS-PGM-ID TO XPROGRAM-NAME (1).
051200     MOVE     000120 TO XRECORD-LENGTH (1).
051300     MOVE    "CH"    TO CHARS-OR-RECORDS (1).
051400     MOVE     0120   TO XBLOCK-SIZE (1).
051500     MOVE     000649 TO RECORDS-IN-FILE (1).
051600     MOVE    "SQ"    TO XFILE-ORGANIZATION (1).
051700     MOVE    "S"     TO XLABEL-TYPE (1).
051800     MOVE     ZERO   TO XRECORD-NUMBER (1).
051900     MOVE    "CREATE 649 RECORD FILE" TO FEATURE.
052000     MOVE    "SEQ-TEST-WR-01" TO PAR-NAME.
052100*
052200 SEQ-TEST-WR-01.
052300     OPEN OUTPUT SQ-FS3.
052400*
052500 SEQ-TEST-WR-01-LOOP.
052600     ADD     1 TO XRECORD-NUMBER (1).
052700     MOVE    FILE-RECORD-INFO-P1-120 (1)  TO SQ-FS3R1-F-G-120.
052800     WRITE   SQ-FS3R1-F-G-120.
052900     IF XRECORD-NUMBER (1) LESS THAN 649
053000         GO TO   SEQ-TEST-WR-01-LOOP.
053100*
053200     CLOSE   SQ-FS3.
053300*
053400*    A SEQUENTIAL TAPE FILE HAS BEEN CREATED.  IT CONTAINS 649
053500*    RECORDS, EACH 120 CHARACTERS LONG.  THE FILE WILL NOW BE
053600*    READ AND THE RECORDS VERIFIED.
053700*
053800 SEQ-INIT-GF-02.
053900     MOVE   "SEQ-TEST-GF-02" TO PAR-NAME.
054000     MOVE   "VERIFY NEW FILE" TO FEATURE.
054100     MOVE    1      TO REC-CT.
054200     GO TO  SEQ-TEST-GF-02-01.
054300 SEQ-DELETE-02-01.
054400     GO TO   SEQ-DELETE-02-02.
054500 SEQ-TEST-GF-02-01.
054600     OPEN INPUT SQ-FS3.
054700*
054800 SEQ-INIT-GF-02-02.
054900     MOVE    FILE-RECORD-INFO-P1-120 (1)
055000                TO FILE-RECORD-INFO-P1-120 (2).
055100     MOVE    ZERO   TO XRECORD-NUMBER (2).
055200     GO TO   SEQ-TEST-GF-02-02.
055300 SEQ-DELETE-02-02.
055400     PERFORM DE-LETE.
055500     ADD     1 TO REC-CT.
055600     PERFORM DE-LETE.
055700     GO TO   SEQ-DELETE-GF-02-05.
055800 SEQ-TEST-GF-02-02.
055900 SEQ-TEST-GF-02-02-LOOP.
056000     READ SQ-FS3
056100          AT END GO TO SEQ-TEST-GF-02-02-1.
056200     MOVE   SQ-FS3R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
056300     ADD    1 TO XRECORD-NUMBER (2).
056400     IF XRECORD-NUMBER (2) GREATER THAN 649
056500         GO TO   SEQ-TEST-GF-02-02-1.
056600     IF FILE-RECORD-INFO-P1-120 (1)
056700                NOT EQUAL TO FILE-RECORD-INFO-P1-120 (2)
056800         ADD     1 TO RECORDS-IN-ERROR.
056900     GO TO   SEQ-TEST-GF-02-02-LOOP.
057000*
057100 SEQ-TEST-GF-02-02-1.
057200     IF XRECORD-NUMBER (2) = 649
057300         PERFORM PASS
057400     ELSE
057500         MOVE   "RECORD COUNTING ERROR" TO RE-MARK
057600         MOVE    XRECORD-NUMBER (2) TO COMPUTED-18V0
057700         MOVE    649 TO CORRECT-18V0
057800         MOVE   "VII-44" TO ANSI-REFERENCE
057900         PERFORM FAIL.
058000*
058100     ADD     1 TO REC-CT.
058200     IF RECORDS-IN-ERROR EQUAL TO ZERO
058300         PERFORM PASS
058400     ELSE
058500         MOVE   "RECORD CONTENT ERRORS" TO RE-MARK
058600         MOVE    ZERO TO CORRECT-18V0
058700         MOVE    RECORDS-IN-ERROR TO COMPUTED-18V0
058800         MOVE   "VII-44; 4.4.2" TO ANSI-REFERENCE
058900         PERFORM FAIL.
059000*
059100 SEQ-INIT-GF-02-05.
059200     GO TO   SEQ-TEST-GF-02-05.
059300 SEQ-DELETE-GF-02-05.
059400     GO TO   SEQ-TEST-GF-02-END.
059500 SEQ-TEST-GF-02-05.
059600     CLOSE   SQ-FS3.
059700 SEQ-TEST-GF-02-END.
059800*
059900*
060000 SEQ-INIT-GF-03.
060100     GO TO  SEQ-TEST-GF-03.
060200 SEQ-DELETE-03.
060300     GO TO   SEQ-TEST-03-END.
060400 SEQ-TEST-GF-03.
060500     OPEN    INPUT SQ-FS3.
060600 SEQ-TEST-03-END.
060700*
060800*
060900*    THIS SERIES OF TESTS CHECKS FOUR LEVEL 1 VARIANTS OF
061000*    THE READ STATEMENT
061100*
061200 SEQ-INIT-GF-04.
061300     MOVE    ZERO TO XRECORD-NUMBER (2).
061400     MOVE    ZERO TO RECORDS-IN-ERROR.
061500     MOVE   "READ...RECORD AT END"     TO FEATURE.
061600     MOVE   "SEQ-TEST-GF-O4" TO PAR-NAME.
061700     MOVE    ZERO TO ERROR-FLAG.
061800     MOVE    1 TO REC-CT.
061900     GO TO  SEQ-TEST-GF-04.
062000 SEQ-DELETE-04.
062100     PERFORM DE-LETE.
062200     ADD     1 TO REC-CT.
062300     PERFORM DE-LETE.
062400     GO TO   SEQ-TEST-04-END.
062500 SEQ-TEST-GF-04.
062600     READ SQ-FS3 RECORD AT END
062700         MOVE    1 TO EOF-FLAG
062800         GO TO   SEQ-TEST-GF-04-01.
062900     MOVE   SQ-FS3R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
063000     ADD    1 TO XRECORD-NUMBER (2)
063100     IF XRECORD-NUMBER (2) NOT EQUAL TO XRECORD-NUMBER (1)
063200         ADD     1 TO RECORDS-IN-ERROR
063300         MOVE    1 TO ERROR-FLAG.
063400     IF XRECORD-NUMBER (2) LESS THAN 50
063500         GO TO   SEQ-TEST-GF-04.
063600*
063700 SEQ-TEST-GF-04-01.
063800     IF EOF-FLAG NOT EQUAL TO ZERO
063900         MOVE   "PREMATURE END OF FILE" TO RE-MARK
064000         MOVE    649 TO CORRECT-18V0
064100         MOVE    XRECORD-NUMBER (2) TO COMPUTED-18V0
064200         MOVE   "VII-44" TO ANSI-REFERENCE
064300         PERFORM FAIL
064400     ELSE
064500         PERFORM PASS.
064600*
064700 SEQ-TEST-GF-04-02.
064800     ADD     1 TO REC-CT.
064900     IF ERROR-FLAG EQUAL TO ZERO
065000         PERFORM PASS
065100     ELSE
065200         MOVE    ERROR-FLAG TO COMPUTED-18V0
065300         MOVE    ZERO TO CORRECT-18V0
065400         MOVE   "ERROR IN ONE OR MORE RECORDS" TO RE-MARK
065500         MOVE   "VII-44" TO ANSI-REFERENCE
065600         PERFORM FAIL.
065700 SEQ-TEST-04-END.
065800*
065900*
066000 SEQ-INIT-GF-O5.
066100     IF EOF-FLAG EQUAL TO 1
066200         GO TO SEQ-DELETE-05.
066300     MOVE    ZERO TO ERROR-FLAG.
066400     MOVE   "READ...AT END..." TO FEATURE
066500     MOVE   "SEQ-TEST-GF-O5" TO PAR-NAME.
066600     MOVE    ZERO TO RECORDS-IN-ERROR.
066700     MOVE    1 TO REC-CT.
066800     GO TO  SEQ-TEST-GF-05.
066900 SEQ-DELETE-05.
067000     PERFORM DE-LETE.
067100     ADD     1 TO REC-CT.
067200     PERFORM DE-LETE.
067300     GO TO   SEQ-TEST-05-END.
067400 SEQ-TEST-GF-05.
067500     READ SQ-FS3 AT END
067600         MOVE    1 TO EOF-FLAG
067700         GO TO   SEQ-TEST-GF-05-01.
067800     MOVE   SQ-FS3R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
067900     ADD    1 TO XRECORD-NUMBER (2)
068000     IF XRECORD-NUMBER (2) NOT EQUAL TO XRECORD-NUMBER (1)
068100         ADD     1 TO RECORDS-IN-ERROR
068200         MOVE    1 TO ERROR-FLAG.
068300     IF XRECORD-NUMBER (2) LESS THAN 200
068400         GO TO   SEQ-TEST-GF-05.
068500*
068600 SEQ-TEST-GF-05-01.
068700     IF EOF-FLAG NOT EQUAL TO ZERO
068800         MOVE   "PREMATURE END OF FILE" TO RE-MARK
068900         MOVE    649 TO CORRECT-18V0
069000         MOVE    XRECORD-NUMBER (2) TO COMPUTED-18V0
069100         MOVE   "VII-44" TO ANSI-REFERENCE
069200         PERFORM FAIL
069300     ELSE
069400         PERFORM PASS.
069500*
069600 SEQ-TEST-GF-05-02.
069700     ADD     1 TO REC-CT.
069800     IF ERROR-FLAG EQUAL TO ZERO
069900         PERFORM PASS
070000     ELSE
070100         MOVE    ERROR-FLAG TO COMPUTED-18V0
070200         MOVE    ZERO TO CORRECT-18V0
070300         MOVE   "ERROR IN ONE OR MORE RECORDS" TO RE-MARK
070400         MOVE   "VII-44" TO ANSI-REFERENCE
070500         PERFORM FAIL.
070600 SEQ-TEST-05-END.
070700*
070800*
070900 SEQ-INIT-GF-O6.
071000     IF EOF-FLAG EQUAL TO 1
071100         GO TO SEQ-DELETE-06.
071200     MOVE    ZERO TO ERROR-FLAG.
071300     MOVE   "READ...RECORD END..." TO FEATURE
071400     MOVE   "SEQ-TEST-GF-O6" TO PAR-NAME.
071500     MOVE    ZERO TO RECORDS-IN-ERROR.
071600     MOVE    1 TO REC-CT.
071700     GO TO  SEQ-TEST-GF-06.
071800 SEQ-DELETE-06.
071900     PERFORM DE-LETE.
072000     ADD     1 TO REC-CT.
072100     PERFORM DE-LETE.
072200     GO TO   SEQ-TEST-06-END.
072300 SEQ-TEST-GF-06.
072400     READ SQ-FS3 RECORD END
072500         MOVE    1 TO EOF-FLAG
072600         GO TO   SEQ-TEST-GF-06-01.
072700     MOVE   SQ-FS3R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
072800     ADD    1 TO XRECORD-NUMBER (2)
072900     IF XRECORD-NUMBER (2) NOT EQUAL TO XRECORD-NUMBER (1)
073000         ADD     1 TO RECORDS-IN-ERROR
073100         MOVE    1 TO ERROR-FLAG.
073200     IF XRECORD-NUMBER (2) LESS THAN 499
073300         GO TO   SEQ-TEST-GF-06.
073400*
073500 SEQ-TEST-GF-06-01.
073600     IF EOF-FLAG NOT EQUAL TO ZERO
073700         MOVE   "PREMATURE END OF FILE" TO RE-MARK
073800         MOVE    649 TO CORRECT-18V0
073900         MOVE    XRECORD-NUMBER (2) TO COMPUTED-18V0
074000         MOVE   "VII-44" TO ANSI-REFERENCE
074100         PERFORM FAIL
074200     ELSE
074300         PERFORM PASS.
074400*
074500 SEQ-TEST-GF-06-02.
074600     ADD     1 TO REC-CT.
074700     IF ERROR-FLAG EQUAL TO ZERO
074800         PERFORM PASS
074900     ELSE
075000         MOVE    ERROR-FLAG TO COMPUTED-18V0
075100         MOVE    ZERO TO CORRECT-18V0
075200         MOVE   "ERROR IN ONE OR MORE RECORDS" TO RE-MARK
075300         MOVE   "VII-44" TO ANSI-REFERENCE
075400         PERFORM FAIL.
075500 SEQ-TEST-06-END.
075600*
075700*
075800 SEQ-INIT-GF-O7.
075900     IF EOF-FLAG EQUAL TO 1
076000         GO TO SEQ-DELETE-07.
076100     MOVE    ZERO TO ERROR-FLAG.
076200     MOVE   "READ... END..." TO FEATURE
076300     MOVE   "SEQ-TEST-GF-O7" TO PAR-NAME.
076400     MOVE    ZERO TO RECORDS-IN-ERROR.
076500     MOVE    1 TO REC-CT.
076600     GO TO  SEQ-TEST-GF-07.
076700 SEQ-DELETE-07.
076800     PERFORM DE-LETE.
076900     ADD     1 TO REC-CT.
077000     PERFORM DE-LETE.
077100     GO TO   SEQ-TEST-07-END.
077200 SEQ-TEST-GF-07.
077300     READ SQ-FS3 END
077400         MOVE    1 TO EOF-FLAG
077500         GO TO   SEQ-TEST-GF-07-01.
077600     MOVE   SQ-FS3R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
077700     ADD    1 TO XRECORD-NUMBER (2)
077800     IF XRECORD-NUMBER (2) NOT EQUAL TO XRECORD-NUMBER (1)
077900         ADD     1 TO RECORDS-IN-ERROR
078000         MOVE    1 TO ERROR-FLAG.
078100     IF XRECORD-NUMBER (2) LESS THAN 649
078200         GO TO   SEQ-TEST-GF-07.
078300*
078400 SEQ-TEST-GF-07-01.
078500     IF EOF-FLAG NOT EQUAL TO ZERO
078600         MOVE   "PREMATURE END OF FILE" TO RE-MARK
078700         MOVE    649 TO CORRECT-18V0
078800         MOVE    XRECORD-NUMBER (2) TO COMPUTED-18V0
078900         MOVE   "VII-44" TO ANSI-REFERENCE
079000         PERFORM FAIL
079100     ELSE
079200         PERFORM PASS.
079300*
079400 SEQ-TEST-GF-07-02.
079500     ADD     1 TO REC-CT.
079600     IF ERROR-FLAG EQUAL TO ZERO
079700         PERFORM PASS
079800     ELSE
079900         MOVE    ERROR-FLAG TO COMPUTED-18V0
080000         MOVE    ZERO TO CORRECT-18V0
080100         MOVE   "ERROR IN ONE OR MORE RECORDS" TO RE-MARK
080200         MOVE   "VII-44" TO ANSI-REFERENCE
080300         PERFORM FAIL.
080400 SEQ-TEST-07-END.
080500*
080600*
080700 SEQ-INIT-GF-O8.
080800     IF EOF-FLAG EQUAL TO 1
080900         GO TO SEQ-DELETE-08.
081000     MOVE   "READ... END... AT EOF" TO FEATURE
081100     MOVE   "SEQ-TEST-GF-O8" TO PAR-NAME.
081200     MOVE    1 TO REC-CT.
081300     GO TO  SEQ-TEST-GF-08.
081400 SEQ-DELETE-08.
081500     PERFORM DE-LETE.
081600     GO TO   SEQ-TEST-08-END.
081700 SEQ-TEST-GF-08.
081800     READ SQ-FS3 END
081900         MOVE    1 TO EOF-FLAG.
082000*
082100 SEQ-TEST-GF-08-01.
082200     IF EOF-FLAG NOT EQUAL TO 1
082300         MOVE    EOF-FLAG TO COMPUTED-18V0
082400         MOVE    1 TO CORRECT-18V0
082500         MOVE   "EOF NOT FOUND AFTER 649 RECORDS" TO RE-MARK
082600         PERFORM FAIL
082700     ELSE
082800         PERFORM PASS.
082900 SEQ-TEST-08-END.
083000*
083100*
083200 SEQ-INIT-GF-O9.
083300     GO TO  SEQ-TEST-GF-09.
083400 SEQ-DELETE-09.
083500     GO TO   SEQ-TEST-09-END.
083600 SEQ-TEST-GF-09.
083700     CLOSE SQ-FS3.
083800 SEQ-TEST-09-END.
083900*
084000*
084100 TERMINATE-ROUTINE.
084200     EXIT.
084300 CCVS-EXIT SECTION.
084400 CCVS-999999.
084500     GO TO CLOSE-FILES.
