000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ101M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                             REVISED 1986, AUGUST             *
001000*                                                              *
001100*    CREATION DATE     /     VALIDATION DATE                   *
001200*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001300*                                                              *
001400****************************************************************
001500*                                                              *
001600*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001700*                                                              *
001800*            X-55   SYSTEM PRINTER                             *
001900*            X-82   SOURCE-COMPUTER                            *
002000*            X-83   OBJECT-COMPUTER.                           *
002100*                                                              *
002200****************************************************************
002300*                                                              *
002400*    SQ101M TESTS THE LEVEL 1 FACILITIES FOR CONTROL OF THE    *
002500*    POSITION OF LINES ON A PRINTED PAGE.  THE PRINCIPAL       *
002600*    FACILITY IS THE ADVANCING PHRASE OF THE WRITE STATEMENT   *
002700*    WHEN THE ASSOCIATED PHYSICAL FILE IS DESIGNATED AS A      *
002800*    PRINTER.  THE FROM PHRASE OF THE WRITE STATEMENT IS ALSO  *
002900*    TESTED.                                                   *
003000*                                                              *
003100*    ALL POSSIBLE LEVEL 1 COMBINATIONS OF THE FORMAT OF THE    *
003200*    ADVANCING PHRASE ARE TESTED WITH AND WITHOUT THE FROM     *
003300*    PHRASE.  THE VALUES USED FOR INTEGER INCLUDE ONE-DIGIT    *
003400*    AND TWO-DIGIT UNSIGNED NUMERIC LITERALS, EIGHTEEN DIGIT   *
003500*    NUMERIC LITERALS WITH LEADING ZEROS, AND THE FIGURATIVE   *
003600*    CONSTANT ZERO.  DATA ITEMS USED AS IDENTIFIER-2 INCLUDE   *
003700*    LEVEL 77, LEVEL 01, AND SUBORDINATE ELEMENTARY ITEMS.  A  *
003800*    SIMILAR RANGE OF TYPES, BUT INCLUDING GROUP ITEMS, IS     *
003900*    USED FOR IDENTIFIER-2.                                    *
004000*                                                              *
004100*    IN ADDITION TO THE ABOVE TESTS, A TEST IS MADE TO ENSURE  *
004200*    THAT CHARACTERS DESIGNATED TO BE PRINTED IN COLUMN 1 DO   *
004300*    NOT ACT AS CARRIAGE CONTROL CHARACTERS.                   *
004400*                                                              *
004500*    BECAUSE OF THE NATURE OF THESE TESTS A "PASS" OR "FAIL"   *
004600*    CANNOT BE DETERMINED WITHIN THE PROGRAM.  THE PRINTED     *
004700*    OUTPUT MUST BE EXAMINED TO DETERMINE WHETHER EACH TEST    *
004800*    HAS BEEN PASSED OR FAILED.                                *
004900*                                                              *
005000****************************************************************
005100*
005200*
005300 ENVIRONMENT DIVISION.
005400 CONFIGURATION SECTION.
005500 SOURCE-COMPUTER.
005600     XXXXX082.
005700 OBJECT-COMPUTER.
005800     XXXXX083.
005900*
006000 INPUT-OUTPUT SECTION.
006100 FILE-CONTROL.
006200     SELECT PRINT-FILE ASSIGN TO
006300     XXXXX055.
006400*
006500P    SELECT RAW-DATA   ASSIGN TO
006600P    XXXXX062
006700P          ORGANIZATION IS INDEXED
006800P          ACCESS MODE  IS RANDOM
006900P          RECORD-KEY   IS RAW-DATA-KEY.
007000P
007100*
007200 DATA DIVISION.
007300 FILE SECTION.
007400 FD  PRINT-FILE
007500C    LABEL RECORDS
007600C    XXXXX084
007700C    DATA RECORD IS PRINT-REC DUMMY-RECORD
007800               .
007900 01  PRINT-REC    PICTURE X(120).
008000 01  DUMMY-RECORD PICTURE X(120).
008100P
008200PFD  RAW-DATA.
008300P01  RAW-DATA-SATZ.
008400P    05  RAW-DATA-KEY        PIC X(6).
008500P    05  C-DATE              PIC 9(6).
008600P    05  C-TIME              PIC 9(8).
008700P    05  NO-OF-TESTS         PIC 99.
008800P    05  C-OK                PIC 999.
008900P    05  C-ALL               PIC 999.
009000P    05  C-FAIL              PIC 999.
009100P    05  C-DELETED           PIC 999.
009200P    05  C-INSPECT           PIC 999.
009300P    05  C-NOTE              PIC X(13).
009400P    05  C-INDENT            PIC X.
009500P    05  C-ABORT             PIC X(8).
009600*
009700*
009800 WORKING-STORAGE SECTION.
009900*
010000***************************************************************
010100*                                                             *
010200*    WORKING-STORAGE DATA ITEMS SPECIFIC TO THIS TEST SUITE   *
010300*                                                             *
010400***************************************************************
010500*
010600 77  QU-OTE             PIC X   VALUE QUOTE.
010700 77  IDENTIFIER-2       PIC 99       VALUE 0.
010800 77  LONG-ZERO          PIC 9(18)    VALUE 0.
010900 77  LONG-ONE           PIC 9(18)    VALUE 1.
011000 01  IDENT-2-S99        PIC S99.
011100 01  IDENT-2-C99        PIC 99  COMP.
011200*
011300 01  ONE                PIC 9        VALUE 1.
011400*
011500 01  SPACING-VALUES-1.
011600     02 TWO               PIC 9      VALUE 2.
011700     02 SPACING-VALUES-2.
011800        03 THREE            PIC 9    VALUE 3.
011900        03 SPACING-VALUES-3.
012000           04 FOUR            PIC 9  VALUE 4.
012100*
012200 01  CHAR-LINE.
012300     03  LIN-CH   PIC X.
012400     03  FILLER   PIC X.
012500     03  LIN-SER  PIC 999.
012600     03  FILLER   PIC X(115).
012700*
012800 77  SEVENTY-SEVEN     PIC X(120)   VALUE "  THIS WAS WRITTEN FROM
012900-    " A 77 LEVEL ENTRY.  IT SHOULD BE 2 LINES BELOW AND 1 LINE AB
013000-    "OVE THE BRACKETING WRT-TEST LINES.".
013100*
013200 77  SEVENTY-SEVEN-2    PIC X(120)   VALUE "THIS LINE WAS WRITTEN
013300-    "FROM A 77 LEVEL ENTRY.  IT SHOULD BE 7 LINES BELOW AND 1 LIN
013400-    "E ABOVE THE BRACKETING WRT-TEST LINES.".
013500*
013600 01  OH-ONE             PIC X(120)   VALUE "THIS LINE WAS WRITTEN
013700-    "FROM AN 01 LEVEL ENTRY. IT SHOULD BE 1 LINE BELOW AND 5 LINE
013800-    "S ABOVE THE BRACKETING WRT-TEST LINES.".
013900*
014000 01  LEVEL-1.
014100     03 OH-THREE        PIC X(120)   VALUE "THIS LINE WAS WRITTEN
014200-       "FROM AN 03 LEVEL ENTRY. IT SHOULD BE 1 LINE BELOW AND 6 L
014300-       "INES ABOVE THE BRACKETING WRT-TEST LINES.".
014400*
014500 01  TEST-LINE-1.
014600     02 FILLER          PIC X(20)  VALUE SPACE.
014700     02 FILLER          PIC X(20)  VALUE "THIS LINE SHOULD BE ".
014800     02 LINES-BELOW-1   PIC XX.
014900     02 FILLER          PIC X(17)  VALUE " LINES BELOW AND ".
015000     02 LINES-ABOVE-1   PIC XX.
015100     02 FILLER          PIC X(59)  VALUE
015200                  " LINES ABOVE THE BRACKETING WRT-TEST LINES".
015300*
015400 01  LEVEL-ONE.
015500     02 LEVEL-TWO.
015600        03 TEST-LINE-2.
015700           04 FILLER          PIC X(20)   VALUE SPACE.
015800           04 FILLER          PIC X(20)   VALUE "THIS LINE SHOULD
015900-             "BE ".
016000           04 LINES-BELOW-2   PIC XX.
016100           04 FILLER          PIC X(17) VALUE " LINES BELOW AND ".
016200           04 LINES-ABOVE-2   PIC XX.
016300           04 FILLER          PIC X(59)   VALUE
016400                  " LINES ABOVE THE BRACKETING WRT-TEST LINES".
016500*
016600 01  OVERPRINTED-LINE.
016700     02 FILLER            PIC X(20)  VALUE SPACE.
016800     02 FILLER            PIC X(9)   VALUE "WRT-TEST-".
016900     02 OVERPRINTED-TEST  PIC XX.
017000     02 FILLER            PIC X(89)  VALUE "/ THIS LINE SHOULD BE
017100-       "OVERPRINTED. AAAAAAA".
017200 01  OVERPRINT-LINE.
017300     02 FILLER            PIC X(68)  VALUE SPACE.
017400     02 FILLER            PIC X(17)  VALUE "BBBBBBB WRT-TEST-".
017500     02 OVERPRINT-TEST    PIC XX.
017600     02 FILLER            PIC X(33)  VALUE
017700            "/ THIS LINE SHOULD OVERPRINT".
017800 01  LAST-LINE.
017900     02 FILLER            PIC X(20)  VALUE SPACE.
018000     02 FILLER            PIC X(100) VALUE "THIS LINE SHOULD BE 1
018100-       "LINE BELOW THE WRT-TEST LINE AND ALSO BE THE LAST LINE ON
018200-       " THIS PAGE".
018300*
018400 01  NEW-PAGE-LINE.
018500     02 FILLER            PIC X(20)  VALUE SPACE.
018600     02 FILLER            PIC X(100) VALUE "THIS LINE SHOULD APPEA
018700-       "R AT THE TOP OF A NEW PAGE".
018800 01  NEXT-LINE.
018900     02 FILLER            PIC X(20)  VALUE SPACE.
019000     02 FILLER            PIC X(100) VALUE "A WRT-TEST LINE SHOULD
019100-       " FOLLOW IMMEDIATELY ON THE NEXT LINE".
019200*
019300 01  NOTE-1.
019400     02 FILLER          PIC X(40)    VALUE "BECAUSE OF THE NATURE
019500-    "OF THESE TESTS A ".
019600     02 FILLER          PIC X        VALUE QUOTE.
019700     02 FILLER          PIC X(4)     VALUE "PASS".
019800     02 FILLER          PIC X        VALUE QUOTE.
019900     02 FILLER          PIC X(4)     VALUE " OR ".
020000     02 FILLER          PIC X        VALUE QUOTE.
020100     02 FILLER          PIC X(4)     VALUE "FAIL".
020200     02 FILLER          PIC X        VALUE QUOTE.
020300     02 FILLER          PIC X(64)    VALUE " CANNOT BE DETERMINED
020400-    "WITHIN THE PROGRAM. THE USER MUST VISUALLY".
020500 01  NOTE-2             PIC X(120)   VALUE "CHECK THE POSITION OF
020600-    "EACH LINE TO DETERMINE THE ACCURACY OF THE VARIOUS WRITE OPT
020700-    "IONS.  NOTE THAT SOME OVERPRINTING".
020800 01  NOTE-3             PIC X(120)   VALUE "SHOULD OCCUR, AND IN E
020900-    "VERY CASE THE OVERPRINTED LINE WILL READ---".
021000 01  NOTE-4.
021100     02 FILLER          PIC X(20)    VALUE SPACE.
021200     02 FILLER          PIC X(100)   VALUE "WRT-TEST-XX/ THIS LINE
021300-    " SHOULD BE OVERPRINTED. AAAAAAA".
021400 01  NOTE-5             PIC X(120)   VALUE "---AND THE LINE WHICH
021500-    "OVERPRINTS SHOULD READ---".
021600 01  NOTE-6.
021700     02 FILLER          PIC X(68)    VALUE SPACE.
021800     02 FILLER          PIC X(52)    VALUE "BBBBBBB WRT-TEST-XX/ T
021900-    "HIS LINE SHOULD OVERPRINT".
022000 01  NOTE-7             PIC X(120)   VALUE "ONLY FIVE OF THE LETTE
022100-    "RS A AND B SHOULD BE JUMBLED TOGETHER; THE REST SHOULD BE RE
022200-    "ADABLE.  IF ANY OTHER LINE IS".
022300*
022400 01  NOTE-8             PIC X(120)   VALUE
022500         "INVOLVED IN OVERPRINTING, AN ERROR HAS OCCURRED".
022600*
022700***************************************************************
022800*                                                             *
022900*    WORKING-STORAGE DATA ITEMS USED BY THE CCVS              *
023000*                                                             *
023100***************************************************************
023200*
023300 01  REC-SKEL-SUB   PIC 99.
023400*
023500 01  FILE-RECORD-INFORMATION-REC.
023600     03 FILE-RECORD-INFO-SKELETON.
023700        05 FILLER                 PICTURE X(48)       VALUE
023800             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
023900        05 FILLER                 PICTURE X(46)       VALUE
024000             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
024100        05 FILLER                 PICTURE X(26)       VALUE
024200             ",LFIL=000000,ORG=  ,LBLR= ".
024300        05 FILLER                 PICTURE X(37)       VALUE
024400             ",RECKEY=                             ".
024500        05 FILLER                 PICTURE X(38)       VALUE
024600             ",ALTKEY1=                             ".
024700        05 FILLER                 PICTURE X(38)       VALUE
024800             ",ALTKEY2=                             ".
024900        05 FILLER                 PICTURE X(7)        VALUE SPACE.
025000     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
025100        05 FILE-RECORD-INFO-P1-120.
025200           07 FILLER              PIC X(5).
025300           07 XFILE-NAME          PIC X(6).
025400           07 FILLER              PIC X(8).
025500           07 XRECORD-NAME        PIC X(6).
025600           07 FILLER              PIC X(1).
025700           07 REELUNIT-NUMBER     PIC 9(1).
025800           07 FILLER              PIC X(7).
025900           07 XRECORD-NUMBER      PIC 9(6).
026000           07 FILLER              PIC X(6).
026100           07 UPDATE-NUMBER       PIC 9(2).
026200           07 FILLER              PIC X(5).
026300           07 ODO-NUMBER          PIC 9(4).
026400           07 FILLER              PIC X(5).
026500           07 XPROGRAM-NAME       PIC X(5).
026600           07 FILLER              PIC X(7).
026700           07 XRECORD-LENGTH      PIC 9(6).
026800           07 FILLER              PIC X(7).
026900           07 CHARS-OR-RECORDS    PIC X(2).
027000           07 FILLER              PIC X(1).
027100           07 XBLOCK-SIZE         PIC 9(4).
027200           07 FILLER              PIC X(6).
027300           07 RECORDS-IN-FILE     PIC 9(6).
027400           07 FILLER              PIC X(5).
027500           07 XFILE-ORGANIZATION  PIC X(2).
027600           07 FILLER              PIC X(6).
027700           07 XLABEL-TYPE         PIC X(1).
027800        05 FILE-RECORD-INFO-P121-240.
027900           07 FILLER              PIC X(8).
028000           07 XRECORD-KEY         PIC X(29).
028100           07 FILLER              PIC X(9).
028200           07 ALTERNATE-KEY1      PIC X(29).
028300           07 FILLER              PIC X(9).
028400           07 ALTERNATE-KEY2      PIC X(29).
028500           07 FILLER              PIC X(7).
028600*
028700 01  TEST-RESULTS.
028800     02 FILLER              PIC X      VALUE SPACE.
028900     02 FEATURE             PIC X(24)  VALUE SPACE.
029000     02 FILLER              PIC X      VALUE SPACE.
029100     02 P-OR-F              PIC X(5)   VALUE SPACE.
029200     02 FILLER              PIC X      VALUE SPACE.
029300     02  PAR-NAME.
029400       03 FILLER              PIC X(14)  VALUE SPACE.
029500       03 PARDOT-X            PIC X      VALUE SPACE.
029600       03 DOTVALUE            PIC 99     VALUE ZERO.
029700     02 FILLER              PIC X(9)   VALUE SPACE.
029800     02 RE-MARK             PIC X(61).
029900 01  TEST-COMPUTED.
030000   02 FILLER  PIC X(30)  VALUE SPACE.
030100   02 FILLER  PIC X(17)  VALUE "      COMPUTED =".
030200   02 COMPUTED-X.
030300     03 COMPUTED-A    PIC X(20)  VALUE SPACE.
030400     03 COMPUTED-N    REDEFINES COMPUTED-A PIC -9(9).9(9).
030500     03 COMPUTED-0V18 REDEFINES COMPUTED-A PIC -.9(18).
030600     03 COMPUTED-4V14 REDEFINES COMPUTED-A PIC -9(4).9(14).
030700     03 COMPUTED-14V4 REDEFINES COMPUTED-A PIC -9(14).9(4).
030800     03       CM-18V0 REDEFINES COMPUTED-A.
030900        04 COMPUTED-18V0                   PIC -9(18).
031000        04 FILLER                          PIC X.
031100     03 FILLER PIC X(50) VALUE SPACE.
031200 01  TEST-CORRECT.
031300     02 FILLER PIC X(30) VALUE SPACE.
031400     02 FILLER PIC X(17) VALUE "       CORRECT =".
031500     02 CORRECT-X.
031600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
031700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
031800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
031900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
032000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
032100     03      CR-18V0 REDEFINES CORRECT-A.
032200         04 CORRECT-18V0                     PIC -9(18).
032300         04 FILLER                           PIC X.
032400     03 FILLER PIC X(2) VALUE SPACE.
032500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
032600 01  CCVS-C-1.
032700     02 FILLER  PIC IS X(4)     VALUE SPACE.
032800     02 FILLER  PIC IS X(98)    VALUE IS "FEATURE               PA
032900-    "SS  PARAGRAPH-NAME
033000-    "       REMARKS".
033100     02 FILLER           PIC X(17)    VALUE SPACE.
033200 01  CCVS-C-2.
033300     02 FILLER           PIC XXXX     VALUE SPACE.
033400     02 FILLER           PIC X(6)     VALUE "TESTED".
033500     02 FILLER           PIC X(16)    VALUE SPACE.
033600     02 FILLER           PIC X(4)     VALUE "FAIL".
033700     02 FILLER           PIC X(90)    VALUE SPACE.
033800 01  REC-SKL-SUB       PIC 9(2)     VALUE ZERO.
033900 01  REC-CT            PIC 99       VALUE ZERO.
034000 01  DELETE-COUNTER    PIC 999      VALUE ZERO.
034100 01  ERROR-COUNTER     PIC 999      VALUE ZERO.
034200 01  INSPECT-COUNTER   PIC 999      VALUE ZERO.
034300 01  PASS-COUNTER      PIC 999      VALUE ZERO.
034400 01  TOTAL-ERROR       PIC 999      VALUE ZERO.
034500 01  ERROR-HOLD        PIC 999      VALUE ZERO.
034600 01  DUMMY-HOLD        PIC X(120)   VALUE SPACE.
034700 01  RECORD-COUNT      PIC 9(5)     VALUE ZERO.
034800 01  ANSI-REFERENCE    PIC X(48)    VALUE SPACES.
034900 01  CCVS-H-1.
035000     02  FILLER          PIC X(39)    VALUE SPACES.
035100     02  FILLER          PIC X(42)    VALUE
035200     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
035300     02  FILLER          PIC X(39)    VALUE SPACES.
035400 01  CCVS-H-2A.
035500   02  FILLER            PIC X(40)  VALUE SPACE.
035600   02  FILLER            PIC X(7)   VALUE "CCVS85 ".
035700   02  FILLER            PIC XXXX   VALUE
035800     "4.2 ".
035900   02  FILLER            PIC X(28)  VALUE
036000            " COPY - NOT FOR DISTRIBUTION".
036100   02  FILLER            PIC X(41)  VALUE SPACE.
036200*
036300 01  CCVS-H-2B.
036400   02  FILLER            PIC X(15)  VALUE "TEST RESULT OF ".
036500   02  TEST-ID           PIC X(9).
036600   02  FILLER            PIC X(4)   VALUE " IN ".
036700   02  FILLER            PIC X(12)  VALUE
036800     " HIGH       ".
036900   02  FILLER            PIC X(22)  VALUE
037000            " LEVEL VALIDATION FOR ".
037100   02  FILLER            PIC X(58)  VALUE
037200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
037300 01  CCVS-H-3.
037400     02  FILLER          PIC X(34)  VALUE
037500            " FOR OFFICIAL USE ONLY    ".
037600     02  FILLER          PIC X(58)  VALUE
037700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
037800     02  FILLER          PIC X(28)  VALUE
037900            "  COPYRIGHT   1985,1986 ".
038000 01  CCVS-E-1.
038100     02 FILLER           PIC X(52)  VALUE SPACE.
038200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
038300     02 ID-AGAIN         PIC X(9).
038400     02 FILLER           PIC X(45)  VALUE SPACES.
038500 01  CCVS-E-2.
038600     02  FILLER          PIC X(31)  VALUE SPACE.
038700     02  FILLER          PIC X(21)  VALUE SPACE.
038800     02  CCVS-E-2-2.
038900         03 ERROR-TOTAL    PIC XXX    VALUE SPACE.
039000         03 FILLER         PIC X      VALUE SPACE.
039100         03 ENDER-DESC     PIC X(44)  VALUE
039200            "ERRORS ENCOUNTERED".
039300 01  CCVS-E-3.
039400     02  FILLER          PIC X(22)  VALUE
039500            " FOR OFFICIAL USE ONLY".
039600     02  FILLER          PIC X(12)  VALUE SPACE.
039700     02  FILLER          PIC X(58)  VALUE
039800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
039900     02  FILLER          PIC X(8)   VALUE SPACE.
040000     02  FILLER          PIC X(20)  VALUE
040100             " COPYRIGHT 1985,1986".
040200 01  CCVS-E-4.
040300     02 CCVS-E-4-1       PIC XXX    VALUE SPACE.
040400     02 FILLER           PIC X(4)   VALUE " OF ".
040500     02 CCVS-E-4-2       PIC XXX    VALUE SPACE.
040600     02 FILLER           PIC X(40)  VALUE
040700      "  TESTS WERE EXECUTED SUCCESSFULLY".
040800 01  XXINFO.
040900     02 FILLER           PIC X(19)  VALUE "*** INFORMATION ***".
041000     02 INFO-TEXT.
041100       04 FILLER             PIC X(8)   VALUE SPACE.
041200       04 XXCOMPUTED         PIC X(20).
041300       04 FILLER             PIC X(5)   VALUE SPACE.
041400       04 XXCORRECT          PIC X(20).
041500     02 INF-ANSI-REFERENCE PIC X(48).
041600 01  HYPHEN-LINE.
041700     02 FILLER  PIC IS X VALUE IS SPACE.
041800     02 FILLER  PIC IS X(65)    VALUE IS "************************
041900-    "*****************************************".
042000     02 FILLER  PIC IS X(54)    VALUE IS "************************
042100-    "******************************".
042200 01  CCVS-PGM-ID  PIC X(9)   VALUE
042300     "SQ101M".
042400 PROCEDURE DIVISION.
042500 CCVS1 SECTION.
042600 OPEN-FILES.
042700P    OPEN    I-O RAW-DATA.
042800P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
042900P    READ    RAW-DATA INVALID KEY GO TO END-E-1.
043000P    MOVE   "ABORTED "   TO C-ABORT.
043100P    ADD     1           TO C-NO-OF-TESTS.
043200P    ACCEPT  C-DATE      FROM DATE.
043300P    ACCEPT  C-TIME      FROM TIME.
043400P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
043500PEND-E-1.
043600P    CLOSE   RAW-DATA.
043700     OPEN    OUTPUT PRINT-FILE.
043800     MOVE    CCVS-PGM-ID TO TEST-ID.
043900     MOVE    CCVS-PGM-ID TO ID-AGAIN.
044000     MOVE    SPACE TO TEST-RESULTS.
044100     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
044200     MOVE    ZERO TO REC-SKEL-SUB.
044300     PERFORM CCVS-INIT-FILE 10 TIMES.
044400     GO TO CCVS1-EXIT.
044500*
044600 CCVS-INIT-FILE.
044700     ADD     1 TO REC-SKL-SUB.
044800     MOVE    FILE-RECORD-INFO-SKELETON TO
044900                  FILE-RECORD-INFO (REC-SKL-SUB).
045000*
045100 CLOSE-FILES.
045200     PERFORM END-ROUTINE THRU END-ROUTINE-13.
045300     CLOSE   PRINT-FILE.
045400P    OPEN    I-O RAW-DATA.
045500P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
045600P    READ    RAW-DATA INVALID KEY GO TO END-E-2.
045700P    MOVE   "OK.     " TO C-ABORT.
045800P    MOVE    PASS-COUNTER  TO C-OK.
045900P    MOVE    ERROR-HOLD    TO C-ALL.
046000P    MOVE    ERROR-COUNTER TO C-FAIL.
046100P    MOVE    DELETE-CNT    TO C-DELETED.
046200P    MOVE    INSPECT-COUNTER TO C-INSPECT.
046300P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
046400PEND-E-2.
046500P    CLOSE   RAW-DATA.
046600 TERMINATE-CCVS.
046700S    EXIT    PROGRAM.
046800     STOP    RUN.
046900*
047000 INSPT.
047100     MOVE   "INSPT" TO P-OR-F.
047200     ADD     1 TO INSPECT-COUNTER.
047300*
047400 PASS.
047500     MOVE   "PASS " TO P-OR-F.
047600     ADD     1 TO PASS-COUNTER.
047700*
047800 FAIL.
047900     MOVE   "FAIL*" TO P-OR-F.
048000     ADD     1 TO ERROR-COUNTER.
048100*
048200 DE-LETE.
048300     MOVE   "****TEST DELETED****" TO RE-MARK.
048400     MOVE   "*****" TO P-OR-F.
048500     ADD     1 TO DELETE-COUNTER.
048600     PERFORM PRINT-DETAIL.
048700*
048800 PRINT-DETAIL.
048900     IF REC-CT NOT EQUAL TO ZERO
049000         MOVE   "." TO PARDOT-X
049100         MOVE    REC-CT TO DOTVALUE.
049200     MOVE    TEST-RESULTS TO PRINT-REC.
049300     PERFORM WRITE-LINE.
049400     IF P-OR-F EQUAL TO "FAIL*"
049500         PERFORM WRITE-LINE
049600         PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
049700     ELSE
049800         PERFORM BAIL-OUT THRU BAIL-OUT-EX.
049900     MOVE    SPACE TO P-OR-F.
050000     MOVE    SPACE TO COMPUTED-X.
050100     MOVE    SPACE TO CORRECT-X.
050200     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
050300     MOVE    SPACE TO RE-MARK.
050400*
050500 HEAD-ROUTINE.
050600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
050900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
051000 COLUMN-NAMES-ROUTINE.
051100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
051200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
051400 END-ROUTINE.
051500     MOVE    HYPHEN-LINE TO DUMMY-RECORD.
051600     PERFORM WRITE-LINE 5 TIMES.
051700 END-RTN-EXIT.
051800     MOVE    CCVS-E-1 TO DUMMY-RECORD.
051900     PERFORM WRITE-LINE 2 TIMES.
052000*
052100 END-ROUTINE-1.
052200     ADD     ERROR-COUNTER   TO ERROR-HOLD
052300     ADD     INSPECT-COUNTER TO ERROR-HOLD.
052400     ADD     DELETE-COUNTER  TO ERROR-HOLD.
052500     ADD     PASS-COUNTER    TO ERROR-HOLD.
052600     MOVE    PASS-COUNTER    TO CCVS-E-4-1.
052700     MOVE    ERROR-HOLD      TO CCVS-E-4-2.
052800     MOVE    CCVS-E-4        TO CCVS-E-2-2.
052900     MOVE    CCVS-E-2        TO DUMMY-RECORD
053000     PERFORM WRITE-LINE.
053100     MOVE   "TEST(S) FAILED" TO ENDER-DESC.
053200     IF ERROR-COUNTER IS EQUAL TO ZERO
053300         MOVE   "NO " TO ERROR-TOTAL
053400     ELSE
053500         MOVE    ERROR-COUNTER TO ERROR-TOTAL.
053600     MOVE    CCVS-E-2 TO DUMMY-RECORD.
053700     PERFORM WRITE-LINE.
053800 END-ROUTINE-13.
053900     IF DELETE-COUNTER IS EQUAL TO ZERO
054000         MOVE   "NO " TO ERROR-TOTAL
054100     ELSE
054200         MOVE    DELETE-COUNTER TO ERROR-TOTAL.
054300     MOVE   "TEST(S) DELETED     " TO ENDER-DESC.
054400     MOVE    CCVS-E-2 TO DUMMY-RECORD.
054500     PERFORM WRITE-LINE.
054600     IF INSPECT-COUNTER EQUAL TO ZERO
054700         MOVE   "NO " TO ERROR-TOTAL
054800     ELSE
054900         MOVE    INSPECT-COUNTER TO ERROR-TOTAL.
055000     MOVE   "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
055100     MOVE    CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055200     MOVE    CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055300*
055400 WRITE-LINE.
055500     ADD     1 TO RECORD-COUNT.
055600Y    IF RECORD-COUNT GREATER 50
055700Y        MOVE  DUMMY-RECORD TO DUMMY-HOLD
055800Y        MOVE  SPACE TO DUMMY-RECORD
055900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
056000Y        MOVE  CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
056100Y        MOVE  CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
056200Y        MOVE  HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
056300Y        MOVE  DUMMY-HOLD TO DUMMY-RECORD
056400Y        MOVE  ZERO TO RECORD-COUNT.
056500     PERFORM WRT-LN.
056600*
056700 WRT-LN.
056800     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
056900     MOVE    SPACE TO DUMMY-RECORD.
057000 BLANK-LINE-PRINT.
057100     PERFORM WRT-LN.
057200 FAIL-ROUTINE.
057300     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057400     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057500     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
057600     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
057700     MOVE    XXINFO TO DUMMY-RECORD.
057800     PERFORM WRITE-LINE 2 TIMES.
057900     MOVE    SPACES TO INF-ANSI-REFERENCE.
058000     GO TO   FAIL-ROUTINE-EX.
058100 FAIL-ROUTINE-WRITE.
058200     MOVE    TEST-COMPUTED  TO PRINT-REC
058300     PERFORM WRITE-LINE
058400     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
058500     MOVE    TEST-CORRECT   TO PRINT-REC
058600     PERFORM WRITE-LINE 2 TIMES.
058700     MOVE    SPACES         TO COR-ANSI-REFERENCE.
058800 FAIL-ROUTINE-EX.
058900     EXIT.
059000 BAIL-OUT.
059100     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
059200     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
059300 BAIL-OUT-WRITE.
059400     MOVE    CORRECT-A      TO XXCORRECT.
059500     MOVE    COMPUTED-A     TO XXCOMPUTED.
059600     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
059700     MOVE    XXINFO TO DUMMY-RECORD.
059800     PERFORM WRITE-LINE 2 TIMES.
059900     MOVE    SPACES TO INF-ANSI-REFERENCE.
060000 BAIL-OUT-EX.
060100     EXIT.
060200 CCVS1-EXIT.
060300     EXIT.
060400*
060500****************************************************************
060600*                                                              *
060700*    THIS POINT MARKS THE END OF THE CCVS MONITOR ROUTINES AND *
060800*    THE START OF THE TESTS OF SPECIFIC COBOL FEATURES.        *
060900*                                                              *
061000****************************************************************
061100*
061200 SECT-SQ101-0001 SECTION.
061300 WRT-PREAMBLE.
061400     MOVE NOTE-1 TO PRINT-REC.
061500     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
061600     MOVE NOTE-2 TO PRINT-REC.
061700     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
061800     MOVE NOTE-3 TO PRINT-REC.
061900     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
062000     MOVE NOTE-4 TO PRINT-REC.
062100     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
062200     MOVE NOTE-5 TO PRINT-REC.
062300     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
062400     MOVE NOTE-6 TO PRINT-REC.
062500     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
062600     MOVE NOTE-7 TO PRINT-REC.
062700     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
062800     MOVE NOTE-8 TO PRINT-REC.
062900     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
063000     MOVE SPACE TO DUMMY-RECORD.
063100     PERFORM BLANK-LINE-PRINT.
063200*
063300****************************************************************
063400*                                                              *
063500*    THE STANDARD PAGE HEADING OF THE MONITOR OUTPUT AND THE   *
063600*    PREAMBLE DESCRIBING MONTORING REQUIREMENTS WILL HAVE USED *
063700*    24 LINES ON THE FIRST PAGE OF PRINTED OUTPUT.  THE TESTS  *
063800*    ARE ARRANGED WHEREVER POSSIBLE SO THAT THE BLANK LINES    *
063900*    WHICH MUST BE COUNTED DO NOT INCLUDE A BOUNDARY BETWEEN   *
064000*    TWO PAGES.                                                *
064100*                                                              *
064200*    IT IS ASSUMED THAT A PHYSICAL PAGE CAN SHOW AT LEAST 60   *
064300*    PRINTED LINES.  THERE ARE THUS AT LEAST 36 LINES LEFT ON  *
064400*    THIS FIRST PAGE.                                          *
064500*                                                              *
064600****************************************************************
064700*
064800 WRT-INIT-GF-01.
064900*
065000*    THIS TEST ADVANCES THE PRINT POSITION 8 LINES
065100*
065200     MOVE   "WRT BEFORE ADV INT LINES" TO FEATURE.
065300     MOVE   "WRT-TEST-GF-01" TO PAR-NAME.
065400     GO TO   WRT-TEST-GF-01.
065500 WRT-DELETE-GF-01.
065600     PERFORM DE-LETE.
065700     GO TO   WRT-END-GF-01.
065800 WRT-TEST-GF-01.
065900     PERFORM INSPT.
066000     PERFORM WRITE-TEST-LINE.
066100     MOVE "1" TO LINES-BELOW-1.
066200     MOVE "8" TO LINES-ABOVE-1.
066300     MOVE TEST-LINE-1 TO PRINT-REC.
066400     WRITE PRINT-REC BEFORE ADVANCING 7 LINES.
066500 WRT-END-GF-01.
066600*
066700 WRT-INIT-GF-02.
066800*
066900*    THIS TEST ADVANCES THE PRINT POSITION 7 LINES
067000*
067100     MOVE   "WRT BEFORE ADV INT LINE" TO FEATURE.
067200     MOVE   "WRT-TEST-GF-02" TO PAR-NAME.
067300     GO TO   WRT-TEST-GF-02.
067400 WRT-DELETE-GF-02.
067500     PERFORM DE-LETE.
067600     GO TO   WRT-END-GF-02.
067700 WRT-TEST-GF-02.
067800     PERFORM INSPT.
067900     PERFORM WRITE-TEST-LINE.
068000     MOVE "1" TO LINES-BELOW-1.
068100     MOVE "7" TO LINES-ABOVE-1.
068200     MOVE TEST-LINE-1 TO DUMMY-RECORD.
068300     WRITE DUMMY-RECORD BEFORE ADVANCING 6 LINE.
068400 WRT-END-GF-02.
068500*
068600 WRT-INIT-GF-03.
068700*
068800*    THIS TEST ADVANCES THE PRINT POSITION 6 LINES
068900*
069000     MOVE   "WRT BEFORE INTEGER LINES" TO FEATURE.
069100     MOVE   "WRT-TEST-GF-03" TO PAR-NAME.
069200     GO TO   WRT-TEST-GF-03.
069300 WRT-DELETE-GF-03.
069400     PERFORM DE-LETE.
069500     GO TO   WRT-END-GF-03.
069600 WRT-TEST-GF-03.
069700     PERFORM INSPT.
069800     PERFORM WRITE-TEST-LINE.
069900     MOVE   "1" TO LINES-BELOW-2.
070000     MOVE   "6" TO LINES-ABOVE-2.
070100     MOVE    TEST-LINE-2 TO PRINT-REC.
070200     WRITE   PRINT-REC BEFORE 5 LINES.
070300 WRT-END-GF-03.
070400*
070500 WRT-INIT-GF-04.
070600*
070700*    THIS TEST ADVANCES THE PRINT POSITION 5 LINES
070800*
070900     MOVE   "WRT BEFORE INTEGER LINE" TO FEATURE.
071000     MOVE   "WRT-TEST-GF-04" TO PAR-NAME.
071100     GO TO   WRT-TEST-GF-04.
071200 WRT-DELETE-GF-04.
071300     PERFORM DE-LETE.
071400     GO TO   WRT-END-GF-04.
071500 WRT-TEST-GF-04.
071600     PERFORM INSPT.
071700     PERFORM WRITE-TEST-LINE.
071800     MOVE "1" TO LINES-BELOW-2.
071900     MOVE "5" TO LINES-ABOVE-2.
072000     MOVE TEST-LINE-2 TO DUMMY-RECORD.
072100     WRITE DUMMY-RECORD BEFORE 4 LINE.
072200 WRT-END-GF-04.
072300*
072400 WRT-INIT-GF-05.
072500*
072600*    THIS TEST ADVANCES THE PRINT POSITION 5 LINES
072700*
072800     MOVE   "WRT AFTER ADV INT LINES" TO FEATURE.
072900     MOVE   "WRT-TEST-GF-05" TO PAR-NAME.
073000     GO TO   WRT-TEST-GF-05.
073100 WRT-DELETE-GF-05.
073200     PERFORM DE-LETE.
073300     GO TO   WRT-END-GF-05.
073400 WRT-TEST-GF-05.
073500     PERFORM INSPT.
073600     PERFORM WRITE-TEST-LINE.
073700     MOVE "4" TO LINES-BELOW-1.
073800     MOVE "1" TO LINES-ABOVE-1.
073900     MOVE TEST-LINE-1 TO PRINT-REC.
074000     WRITE PRINT-REC AFTER ADVANCING 3 LINES.
074100 WRT-END-GF-05.
074200*
074300 WRT-INIT-GF-06.
074400*
074500*    THE NEXT TEST IN NORMAL SEQUENCE WOULD COME VERY NEAR TO
074600*    OVERFLOWING THE CURRENT PAGE, SO THE FIRST OF THE TESTS OF
074700*    ADVANCING PAGE IS INSERTED HERE.  IT SHOULD LEAVE LINE 2
074800*    ON THE NEW PAGE AS THE CURRENT LINE, SO THAT THE FIRST
074900*    WRT-TEST LINE ON THE NEW PAGE IS THE THIRD PRINTABLE LINE.
075000*
075100     MOVE   "WRT BEFORE ADV PAGE" TO FEATURE.
075200     MOVE   "WRT-TEST-GF-06" TO PAR-NAME.
075300     GO TO   WRT-TEST-GF-06.
075400 WRT-DELETE-GF-06.
075500     PERFORM DE-LETE.
075600     GO TO   WRT-END-GF-06.
075700 WRT-TEST-GF-06.
075800     PERFORM INSPT.
075900     PERFORM WRITE-TEST-LINE.
076000     MOVE    LAST-LINE TO PRINT-REC.
076100     WRITE   PRINT-REC BEFORE ADVANCING PAGE.
076200     MOVE    NEW-PAGE-LINE TO PRINT-REC.
076300     WRITE   PRINT-REC BEFORE ADVANCING 1 LINE.
076400     MOVE    NEXT-LINE TO PRINT-REC.
076500     WRITE   PRINT-REC BEFORE ADVANCING 0 LINE.
076600 WRT-END-GF-06.
076700*
076800 WRT-INIT-GF-07.
076900*
077000*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES TO LINE 6
077100*
077200     MOVE   "WRT AFTER ADV INT LINE" TO FEATURE.
077300     MOVE   "WRT-TEST-GF-07" TO PAR-NAME.
077400     GO TO   WRT-TEST-GF-07.
077500 WRT-DELETE-GF-07.
077600     PERFORM DE-LETE.
077700     GO TO   WRT-END-GF-07.
077800 WRT-TEST-GF-07.
077900     PERFORM INSPT.
078000     PERFORM WRITE-TEST-LINE.
078100     MOVE   "3" TO LINES-BELOW-1.
078200     MOVE   "1" TO LINES-ABOVE-1.
078300     MOVE    TEST-LINE-1 TO DUMMY-RECORD.
078400     WRITE   DUMMY-RECORD AFTER ADVANCING 2 LINES.
078500 WRT-END-GF-07.
078600*
078700 WRT-INIT-GF-08.
078800*
078900*    THIS TEST IS IN TWO PARTS.  IT PRINTS ON THE LINE BELOW
079000*    THE MARKER LINE, THEN OVERPRINTS THAT LINE, ADVANCING ZERO
079100*    LINES AFTER PRINTING.
079200*    TOTAL PAPER ADVANCE IS TWO LINES, TO LINE 8.
079300*
079400     MOVE   "WRT AFTER INT LINE/S" TO FEATURE.
079500     MOVE   "WRT-TEST-GF-08" TO PAR-NAME.
079600     GO TO   WRT-TEST-GF-08.
079700 WRT-DELETE-GF-08.
079800     PERFORM DE-LETE.
079900     GO TO   WRT-END-GF-08.
080000 WRT-TEST-GF-08.
080100     PERFORM INSPT.
080200     PERFORM WRITE-TEST-LINE.
080300     MOVE   "08" TO OVERPRINTED-TEST.
080400     MOVE    OVERPRINTED-LINE TO PRINT-REC.
080500     WRITE   PRINT-REC AFTER 1 LINES.
080600     MOVE   "08" TO OVERPRINT-TEST.
080700     MOVE    OVERPRINT-LINE TO PRINT-REC.
080800     WRITE   PRINT-REC AFTER 0 LINE.
080900 WRT-END-GF-08.
081000*
081100 WRT-INIT-GF-09.
081200*
081300*    THIS TEST ADVANCES THE PRINT POSITION 12 LINES, TO LINE 20
081400*
081500     MOVE    1 TO REC-CT.
081600     MOVE   "WRT FRM BFR ADV INT LINS" TO FEATURE.
081700     MOVE   "WRT-TEST-GF-09" TO PAR-NAME.
081800     GO TO   WRT-TEST-GF-09.
081900 WRT-DELETE-GF-09.
082000     PERFORM DE-LETE.
082100     GO TO   WRT-END-GF-09.
082200 WRT-TEST-GF-09.
082300     PERFORM INSPT.
082400     PERFORM WRITE-TEST-LINE.
082500     MOVE   "1" TO LINES-BELOW-1.
082600     MOVE   "11" TO LINES-ABOVE-1.
082700     WRITE  PRINT-REC FROM TEST-LINE-1 BEFORE ADVANCING 10 LINES.
082800 WRT-END-GF-09.
082900*
083000 WRT-INIT-GF-10.
083100*
083200*    THIS TEST ADVANCES THE PRINT POSITION 22 LINES, TO LINE 44
083300*
083400     MOVE   "WRT FRM BFR ADV INT LINE" TO FEATURE.
083500     MOVE   "WRT-TEST-GF-10" TO PAR-NAME.
083600     GO TO   WRT-TEST-GF-10.
083700 WRT-DELETE-GF-10.
083800     PERFORM DE-LETE.
083900     GO TO   WRT-END-GF-10.
084000 WRT-TEST-GF-10.
084100     PERFORM INSPT.
084200     PERFORM WRITE-TEST-LINE.
084300     MOVE   "1" TO LINES-BELOW-2.
084400     MOVE   "21" TO LINES-ABOVE-2.
084500     WRITE DUMMY-RECORD FROM TEST-LINE-2 BEFORE ADVANCING 20 LINE.
084600 WRT-END-GF-10.
084700*
084800 WRT-INIT-GF-11.
084900*
085000*    THIS TEST ADVANCES THE PRINT POSITION 13 LINES, TO LINE 57
085100*
085200     MOVE   "WRT FRM BEFORE INT LINES" TO FEATURE.
085300     MOVE   "WRT-TEST-GF-11" TO PAR-NAME.
085400     GO TO   WRT-TEST-GF-11.
085500 WRT-DELETE-GF-11.
085600     PERFORM DE-LETE.
085700     GO TO   WRT-END-GF-11.
085800 WRT-TEST-GF-11.
085900     PERFORM INSPT.
086000     PERFORM WRITE-TEST-LINE.
086100     MOVE   "1" TO LINES-BELOW-1.
086200     MOVE   "12" TO LINES-ABOVE-1.
086300     WRITE   PRINT-REC FROM TEST-LINE-1 BEFORE 11 LINES.
086400 WRT-END-GF-11.
086500*
086600 WRT-INIT-GF-12.
086700*
086800*    THE NEXT TEST IN NORMAL SEQUENCE WOULD PROBABLY OVERFLOW
086900*    THE CURRENT PAGE, SO ANOTHER TEST OF ADVANCING PAGE IS
087000*    INSERTED HERE.  IT SHOULD LEAVE LINE 2 ON THE NEW PAGE AS
087100*    THE CURRENT LINE, SO THAT THE FIRST WRT-TEST LINE ON THE
087200*    NEW PAGE IS ON THE THIRD PRINTABLE LINE.
087300*
087400     MOVE   "WRITE BEFORE PAGE" TO FEATURE.
087500     MOVE   "WRT-TEST-GF-12" TO PAR-NAME.
087600     GO TO   WRT-TEST-GF-12.
087700 WRT-DELETE-GF-12.
087800     PERFORM DE-LETE.
087900     GO TO   WRT-END-GF-12.
088000 WRT-TEST-GF-12.
088100     PERFORM INSPT.
088200     PERFORM WRITE-TEST-LINE.
088300     MOVE    LAST-LINE TO PRINT-REC.
088400     WRITE   PRINT-REC BEFORE PAGE.
088500     MOVE    NEW-PAGE-LINE TO PRINT-REC.
088600     WRITE   PRINT-REC BEFORE ADVANCING 1 LINE.
088700     MOVE    NEXT-LINE TO PRINT-REC.
088800     WRITE   PRINT-REC BEFORE ADVANCING 0 LINE.
088900 WRT-END-GF-12.
089000*
089100 WRT-INIT-GF-13.
089200*
089300*    THIS TEST ADVANCES THE PRINT POSITION 42 LINES, TO LINE 44
089400*
089500     MOVE   "WRT FROM BEFORE INT LINE" TO FEATURE.
089600     MOVE   "WRT-TEST-GF-13" TO PAR-NAME.
089700     GO TO   WRT-TEST-GF-13.
089800 WRT-DELETE-GF-13.
089900     PERFORM DE-LETE.
090000     GO TO   WRT-END-GF-13.
090100 WRT-TEST-GF-13.
090200     PERFORM INSPT.
090300     PERFORM WRITE-TEST-LINE.
090400     MOVE "1" TO LINES-BELOW-2.
090500     MOVE "41" TO LINES-ABOVE-2.
090600     WRITE DUMMY-RECORD FROM TEST-LINE-2 BEFORE 40 LINE.
090700 WRT-END-GF-13.
090800*
090900 WRT-INIT-GF-14.
091000*
091100*    THE NEXT TEST IN NORMAL SEQUENCE WOULD PROBABLY OVERFLOW
091200*    THE CURRENT PAGE, SO ANOTHER TEST OF ADVANCING PAGE IS
091300*    INSERTED HERE.  IT SHOULD LEAVE LINE 2 ON THE NEW PAGE AS
091400*    THE CURRENT LINE, SO THAT THE FIRST WRT-TEST LINE ON THE
091500*    NEW PAGE IS ON THE THIRD PRINTABLE LINE.
091600*
091700     MOVE   "WRT AFTER ADV PAGE" TO FEATURE.
091800     MOVE   "WRT-TEST-GF-14" TO PAR-NAME.
091900     GO TO   WRT-TEST-GF-14.
092000 WRT-DELETE-GF-14.
092100     PERFORM DE-LETE.
092200     GO TO   WRT-END-GF-14.
092300 WRT-TEST-GF-14.
092400     PERFORM INSPT.
092500     PERFORM WRITE-TEST-LINE.
092600     MOVE NEW-PAGE-LINE TO PRINT-REC.
092700     WRITE PRINT-REC AFTER ADVANCING PAGE.
092800     MOVE NEXT-LINE TO PRINT-REC.
092900     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
093000 WRT-END-GF-14.
093100*
093200 WRT-INIT-GF-15.
093300*
093400*    THIS TEST ADVANCES THE PRINT POSITION 52 LINES, TO LINE 54
093500*
093600     MOVE   "WRT FRM AFT ADV INT LINS" TO FEATURE.
093700     MOVE   "WRT-TEST-GF-15" TO PAR-NAME.
093800     GO TO   WRT-TEST-GF-15.
093900 WRT-DELETE-GF-15.
094000     PERFORM DE-LETE.
094100     GO TO   WRT-END-GF-15.
094200 WRT-TEST-GF-15.
094300     PERFORM INSPT.
094400     PERFORM WRITE-TEST-LINE.
094500     MOVE "51" TO LINES-BELOW-1.
094600     MOVE "1" TO LINES-ABOVE-1.
094700     WRITE PRINT-REC FROM TEST-LINE-1 AFTER ADVANCING 50 LINES.
094800 WRT-END-GF-15.
094900*
095000 WRT-INIT-GF-16.
095100*
095200*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 55
095300*
095400     MOVE   "WRT FRM AFT ADV INT LINE" TO FEATURE.
095500     MOVE   "WRT-TEST-GF-16" TO PAR-NAME.
095600     GO TO   WRT-TEST-GF-16.
095700 WRT-DELETE-GF-16.
095800     PERFORM DE-LETE.
095900     GO TO   WRT-END-GF-16.
096000 WRT-TEST-GF-16.
096100     PERFORM INSPT.
096200     PERFORM WRITE-TEST-LINE.
096300     MOVE   "2" TO LINES-BELOW-1.
096400     MOVE   "1" TO LINES-ABOVE-1.
096500     WRITE   PRINT-REC FROM TEST-LINE-1 AFTER ADVANCING 1 LINE.
096600 WRT-END-GF-16.
096700*
096800 WRT-INIT-GF-17.
096900*
097000*    THE NEXT TEST IN NORMAL SEQUENCE WOULD PROBABLY OVERFLOW
097100*    THE CURRENT PAGE, SO ANOTHER TEST OF ADVANCING PAGE IS
097200*    INSERTED HERE.  IT SHOULD LEAVE LINE 2 ON THE NEW PAGE AS
097300*    THE CURRENT LINE, SO THAT THE FIRST WRT-TEST LINE ON THE
097400*    NEW PAGE IS ON THE THIRD PRINTABLE LINE.
097500*
097600     MOVE   "WRITE AFTER PAGE" TO FEATURE.
097700     MOVE   "WRT-TEST-GF-17" TO PAR-NAME.
097800     GO TO   WRT-TEST-GF-17.
097900 WRT-DELETE-GF-17.
098000     PERFORM DE-LETE.
098100     GO TO   WRT-END-GF-17.
098200 WRT-TEST-GF-17.
098300     PERFORM INSPT.
098400     PERFORM WRITE-TEST-LINE.
098500     MOVE    NEW-PAGE-LINE TO PRINT-REC.
098600     WRITE   PRINT-REC AFTER PAGE.
098700     MOVE    NEXT-LINE TO PRINT-REC.
098800     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
098900 WRT-END-GF-17.
099000*
099100 WRT-INIT-GF-18.
099200*
099300*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 5
099400*
099500     MOVE   "WRT FRM AFTER INT LINE/S" TO FEATURE.
099600     MOVE   "WRT-TEST-GF-18" TO PAR-NAME.
099700     GO TO   WRT-TEST-GF-18.
099800 WRT-DELETE-GF-18.
099900     PERFORM DE-LETE.
100000     GO TO   WRT-END-GF-18.
100100 WRT-TEST-GF-18.
100200     PERFORM INSPT.
100300     PERFORM WRITE-TEST-LINE.
100400     MOVE "18" TO OVERPRINTED-TEST.
100500     WRITE PRINT-REC FROM OVERPRINTED-LINE AFTER
100600              000000000000000001 LINE.
100700     MOVE "18" TO OVERPRINT-TEST.
100800     WRITE PRINT-REC FROM OVERPRINT-LINE AFTER
100900              000000000000000000 LINES.
101000 WRT-END-GF-18.
101100*
101200 WRT-INIT-GF-19.
101300*
101400*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 8
101500*
101600     MOVE   "WRITE" TO FEATURE.
101700     MOVE   "WRT-TEST-GF-19" TO PAR-NAME.
101800     GO TO   WRT-TEST-GF-19.
101900 WRT-DELETE-GF-19.
102000     PERFORM DE-LETE.
102100     GO TO   WRT-END-GF-19.
102200 WRT-TEST-GF-19.
102300     PERFORM INSPT.
102400     PERFORM WRITE-TEST-LINE.
102500     MOVE   "2" TO LINES-BELOW-1.
102600     MOVE   "1" TO LINES-ABOVE-1.
102700     MOVE    TEST-LINE-1 TO PRINT-REC.
102800     WRITE   PRINT-REC.
102900 WRT-END-GF-19.
103000*
103100 WRT-INIT-GF-20.
103200*
103300*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 11
103400*
103500     MOVE   "WRITE FROM" TO FEATURE.
103600     MOVE   "WRT-TEST-GF-20" TO PAR-NAME.
103700     GO TO   WRT-TEST-GF-20.
103800 WRT-DELETE-GF-20.
103900     PERFORM DE-LETE.
104000     GO TO   WRT-END-GF-20.
104100 WRT-TEST-GF-20.
104200     PERFORM INSPT.
104300     PERFORM WRITE-TEST-LINE.
104400     MOVE   "2" TO LINES-BELOW-1.
104500     MOVE   "1" TO LINES-ABOVE-1.
104600     WRITE   PRINT-REC FROM TEST-LINE-1.
104700 WRT-END-GF-20.
104800*
104900 WRT-INIT-GF-21.
105000*
105100*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 14
105200*    IDENTIFIER-1 IS A SUBORDINATE GROUP ITEM
105300*
105400     MOVE   "WRT SUBGR BFR ADV INT" TO FEATURE.
105500     MOVE   "WRT-TEST-GF-21" TO PAR-NAME.
105600     GO TO   WRT-TEST-GF-21.
105700 WRT-DELETE-GF-21.
105800     PERFORM DE-LETE.
105900     GO TO   WRT-END-GF-21.
106000 WRT-TEST-GF-21.
106100     PERFORM INSPT.
106200     PERFORM WRITE-TEST-LINE.
106300     MOVE   "1" TO LINES-BELOW-2.
106400     MOVE   "2" TO LINES-ABOVE-2.
106500     WRITE   PRINT-REC FROM TEST-LINE-2 BEFORE ADVANCING 1.
106600 WRT-END-GF-21.
106700*
106800 WRT-INIT-GF-22.
106900*
107000*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 18
107100*    IDENTIFIER-1 IS A SUBORDINATE GROUP ITEM
107200*
107300     MOVE   "WRT SUBGRP BEFORE INT" TO FEATURE.
107400     MOVE   "WRT-TEST-GF-22" TO PAR-NAME.
107500     GO TO   WRT-TEST-GF-22.
107600 WRT-DELETE-GF-22.
107700     PERFORM DE-LETE.
107800     GO TO   WRT-END-GF-22.
107900 WRT-TEST-GF-22.
108000     PERFORM INSPT.
108100     PERFORM WRITE-TEST-LINE.
108200     MOVE   "1" TO LINES-BELOW-2.
108300     MOVE   "3" TO LINES-ABOVE-2.
108400     WRITE   PRINT-REC FROM TEST-LINE-2 BEFORE 2.
108500 WRT-END-GF-22.
108600*
108700 WRT-INIT-GF-23.
108800*
108900*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 21
109000*
109100     MOVE   "WRT FROM 77 AFT ADV INT" TO FEATURE.
109200     MOVE   "WRT-TEST-23" TO PAR-NAME.
109300     GO TO   WRT-TEST-GF-23.
109400 WRT-DELETE-GF-23.
109500     PERFORM DE-LETE.
109600     GO TO   WRT-END-GF-23.
109700 WRT-TEST-GF-23.
109800     PERFORM INSPT.
109900     PERFORM WRITE-TEST-LINE.
110000     WRITE PRINT-REC FROM SEVENTY-SEVEN AFTER ADVANCING 1.
110100 WRT-END-GF-23.
110200*
110300 WRT-INIT-GF-24.
110400*
110500*    THIS TEST ADVANCES THE PRINT POSITION 5 LINES, TO LINE 26
110600*
110700     MOVE   "WRT FROM AFTER INT" TO FEATURE.
110800     MOVE   "WRT-TEST-GF-24" TO PAR-NAME.
110900     GO TO   WRT-TEST-GF-24.
111000 WRT-DELETE-GF-24.
111100     PERFORM DE-LETE.
111200     GO TO   WRT-END-GF-24.
111300 WRT-TEST-GF-24.
111400     PERFORM INSPT.
111500     PERFORM WRITE-TEST-LINE.
111600     MOVE   "4" TO LINES-BELOW-1.
111700     MOVE   "1" TO LINES-ABOVE-1.
111800     WRITE   PRINT-REC FROM TEST-LINE-1 AFTER 3.
111900 WRT-END-GF-24.
112000*
112100 WRT-INIT-GF-25.
112200*
112300*    THIS TEST ADVANCES THE PRINT POSITION 2 LINES, TO LINE 28
112400*
112500     MOVE   "WRT BEFORE ADV ZERO" TO FEATURE.
112600     MOVE   "WRT-TEST-GF-25" TO PAR-NAME.
112700     GO TO   WRT-TEST-GF-25.
112800 WRT-DELETE-GF-25.
112900     PERFORM DE-LETE.
113000     GO TO   WRT-END-GF-25.
113100 WRT-TEST-GF-25.
113200     PERFORM INSPT.
113300     PERFORM WRITE-TEST-LINE.
113400     MOVE   "1" TO LINES-BELOW-1.
113500     MOVE   "1" TO LINES-ABOVE-1.
113600     MOVE TEST-LINE-1 TO PRINT-REC.
113700     WRITE PRINT-REC BEFORE ADVANCING ZERO.
113800 WRT-END-GF-25.
113900*
114000 WRT-INIT-GF-26.
114100*
114200*    THIS TEST ADVANCES THE PRINT POSITION 7 LINES, TO LINE 35
114300*
114400     MOVE   "WRT BEFORE INT" TO FEATURE.
114500     MOVE   "WRT-TEST-GF-26" TO PAR-NAME.
114600     GO TO   WRT-TEST-GF-26.
114700 WRT-DELETE-GF-26.
114800     PERFORM DE-LETE.
114900     GO TO   WRT-END-GF-26.
115000 WRT-TEST-GF-26.
115100     PERFORM INSPT.
115200     PERFORM WRITE-TEST-LINE.
115300     MOVE   "1" TO LINES-BELOW-2.
115400     MOVE   "6" TO LINES-ABOVE-2.
115500     MOVE    TEST-LINE-2 TO PRINT-REC.
115600     WRITE   PRINT-REC BEFORE 5.
115700 WRT-END-GF-26.
115800*
115900 WRT-INIT-GF-27.
116000*
116100*    THIS TEST ADVANCES THE PRINT POSITION 7 LINES, TO LINE 42
116200*
116300     MOVE   "WRT AFTER ADVANCING INT" TO FEATURE.
116400     MOVE   "WRT-TEST-GF-27" TO PAR-NAME.
116500     GO TO   WRT-TEST-GF-27.
116600 WRT-DELETE-GF-27.
116700     PERFORM DE-LETE.
116800     GO TO   WRT-END-GF-27.
116900 WRT-TEST-GF-27.
117000     PERFORM INSPT.
117100     PERFORM WRITE-TEST-LINE.
117200     MOVE   "6" TO LINES-BELOW-2.
117300     MOVE   "1" TO LINES-ABOVE-2.
117400     MOVE    TEST-LINE-2 TO PRINT-REC.
117500     WRITE   PRINT-REC AFTER ADVANCING 5.
117600 WRT-END-GF-27.
117700*
117800 WRT-INIT-GF-28.
117900*
118000*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 45
118100*
118200     MOVE   "WRT AFTER INT" TO FEATURE.
118300     MOVE   "WRT-TEST-GF-28" TO PAR-NAME.
118400     GO TO   WRT-TEST-GF-28.
118500 WRT-DELETE-GF-28.
118600     PERFORM DE-LETE.
118700     GO TO   WRT-END-GF-28.
118800 WRT-TEST-GF-28.
118900     PERFORM INSPT.
119000     PERFORM WRITE-TEST-LINE.
119100     MOVE   "2" TO LINES-BELOW-2.
119200     MOVE   "1" TO LINES-ABOVE-2.
119300     MOVE    TEST-LINE-2 TO PRINT-REC.
119400     WRITE   PRINT-REC AFTER 1.
119500 WRT-END-GF-28.
119600*
119700 WRT-INIT-GF-29.
119800*
119900*    THIS TEST ADVANCES THE PRINT POSITION TO A NEW PAGE.  IT
120000*    SHOULD LEAVE LINE 2 ON THE NEW PAGE AS THE CURRENT LINE, SO
120100*    THAT THE FIRST WRT-TEST LINE ON THE NEW PAGE IS ON THE
120200*    THIRD PRINTABLE LINE.
120300*
120400     MOVE   "WRT FROM BEFORE ADV PAGE" TO FEATURE.
120500     MOVE   "WRT-TEST-GF-29" TO PAR-NAME.
120600     GO TO   WRT-TEST-GF-29.
120700 WRT-DELETE-GF-29.
120800     PERFORM DE-LETE.
120900     GO TO   WRT-END-GF-29.
121000 WRT-TEST-GF-29.
121100     PERFORM INSPT.
121200     PERFORM WRITE-TEST-LINE.
121300     WRITE   DUMMY-RECORD FROM LAST-LINE BEFORE ADVANCING PAGE.
121400     MOVE    NEW-PAGE-LINE TO PRINT-REC.
121500     WRITE   PRINT-REC BEFORE ADVANCING 1 LINE.
121600     MOVE    NEXT-LINE TO PRINT-REC.
121700     WRITE   PRINT-REC BEFORE ADVANCING 0 LINE.
121800 WRT-END-GF-29.
121900*
122000 WRT-INIT-GF-30.
122100*
122200*    THIS TEST ADVANCES THE PRINT POSITION MANY LINES,
122300*    OVERFLOWING SEVERAL PAGES.  NO SPECIAL PROVISION IS MADE
122400*    FOR OVERFLOW HANDLING.
122500*
122600     MOVE   "CHARACTERS IN COLUMN 1" TO FEATURE.
122700     MOVE   "WRT-TEST-GF-30" TO PAR-NAME.
122800     GO TO   WRT-TEST-GF-30.
122900 WRT-DELETE-GF-30.
123000     PERFORM DE-LETE.
123100     GO TO   WRT-END-GF-30.
123200 WRT-TEST-GF-30.
123300     PERFORM INSPT.
123400     PERFORM WRITE-TEST-LINE.
123500     PERFORM BLANK-LINE-PRINT.
123600     MOVE " COLUMN 1 OF EACH OF THE LINES BELOW CONTAINS A NON-BLA
123700-    "NK CHARACTER.  IN THE PAST, CHARACTERS IN THIS POSITION MIGH
123800-    "T"     TO PRINT-REC.
123900     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
124000     MOVE " HAVE CONTROLLED PAPER MOVEMENT AND BEEN SUPPRESSED.  T
124100-    "HIS PRACTICE DOES NOT CONFORM TO THE STANDARD."
124200             TO PRINT-REC.
124300     WRITE   PRINT-REC AFTER ADVANCING 1 LINES.
124400     MOVE   " ALL LINES SHOULD BE PRINTED SINGLE-SPACED, AND EACH
124500-    " CONTAINS A SEQUENCE NUMBER, STARTING WITH 001"
124600             TO PRINT-REC.
124700     WRITE   PRINT-REC AFTER ADVANCING 1 LINES.
124800     MOVE " THE CHARACTERS PRINTED SHOULD BE AS FOLLOWS --- 0 1 2
124900-    "3 4 5 6 7 8 9 + - * / = $ , . ; ( ) < > A B C . . . Z AND"
125000             TO PRINT-REC.
125100     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
125200     MOVE   " a b c . . . z AND QUOTE"  TO PRINT-REC.
125300     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
125400     MOVE   " PRINTING BEGINS ON THE NEXT LINE BELOW ---"
125500             TO PRINT-REC.
125600     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
125700     MOVE    SPACES TO CHAR-LINE.
125800     MOVE    ZERO TO LIN-SER.
125900     MOVE "0" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126000     MOVE "1" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126100     MOVE "2" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126200     MOVE "3" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126300     MOVE "4" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126400     MOVE "5" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126500     MOVE "6" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126600     MOVE "7" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126700     MOVE "8" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126800     MOVE "9" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
126900     MOVE "+" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127000     MOVE "-" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127100     MOVE "*" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127200     MOVE "/" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127300     MOVE "=" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127400     MOVE "$" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127500     MOVE "," TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127600     MOVE "." TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127700     MOVE ";" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127800     MOVE "(" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
127900     MOVE ")" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128000     MOVE "<" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128100     MOVE ">" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128200     MOVE "A" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128300     MOVE "B" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128400     MOVE "C" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128500     MOVE "D" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128600     MOVE "E" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128700     MOVE "F" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128800     MOVE "G" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
128900     MOVE "H" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129000     MOVE "I" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129100     MOVE "J" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129200     MOVE "K" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129300     MOVE "L" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129400     MOVE "M" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129500     MOVE "N" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129600     MOVE "O" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129700     MOVE "P" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129800     MOVE "Q" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
129900     MOVE "R" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130000     MOVE "S" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130100     MOVE "T" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130200     MOVE "U" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130300     MOVE "V" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130400     MOVE "W" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130500     MOVE "X" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130600     MOVE "Y" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130700     MOVE "Z" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130800     MOVE "a" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
130900     MOVE "b" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131000     MOVE "c" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131100     MOVE "d" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131200     MOVE "e" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131300     MOVE "f" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131400     MOVE "g" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131500     MOVE "h" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131600     MOVE "i" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131700     MOVE "j" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131800     MOVE "k" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
131900     MOVE "l" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132000     MOVE "m" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132100     MOVE "n" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132200     MOVE "o" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132300     MOVE "p" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132400     MOVE "q" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132500     MOVE "r" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132600     MOVE "s" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132700     MOVE "t" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132800     MOVE "u" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
132900     MOVE "v" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
133000     MOVE "w" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
133100     MOVE "x" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
133200     MOVE "y" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
133300     MOVE "z" TO LIN-CH PERFORM COL-1-CHAR-PRINT.
133400     MOVE QU-OTE TO LIN-CH PERFORM COL-1-CHAR-PRINT.
133500 WRT-END-GF-30.
133600*
133700 WRT-INIT-GF-31.
133800*
133900*    THIS TEST ADVANCES THE PRINT POSITION TO A NEW PAGE.  IT
134000*    SHOULD LEAVE LINE 2 ON THE NEW PAGE AS THE CURRENT LINE, SO
134100*    THAT THE FIRST WRT-TEST LINE ON THE NEW PAGE IS ON THE
134200*    THIRD PRINTABLE LINE.
134300*
134400     MOVE   "WRT FROM BEFORE PAGE" TO FEATURE.
134500     MOVE   "WRT-TEST-GF-31" TO PAR-NAME.
134600     GO TO   WRT-TEST-GF-31.
134700 WRT-DELETE-GF-31.
134800     PERFORM DE-LETE.
134900     GO TO   WRT-END-GF-31.
135000 WRT-TEST-GF-31.
135100     PERFORM INSPT.
135200     PERFORM WRITE-TEST-LINE.
135300     WRITE   DUMMY-RECORD FROM LAST-LINE BEFORE PAGE.
135400     MOVE    NEW-PAGE-LINE TO PRINT-REC.
135500     WRITE   PRINT-REC BEFORE ADVANCING 1 LINE.
135600     MOVE    NEXT-LINE TO PRINT-REC.
135700     WRITE   PRINT-REC BEFORE ADVANCING 0 LINE.
135800 WRT-END-GF-31.
135900*
136000 WRT-INIT-GF-32.
136100*
136200*    THIS TEST ADVANCES THE PRINT POSITION 2 LINES, TO LINE 5
136300*
136400     MOVE   "WRT FRM BFR ADV P99 LINE" TO FEATURE.
136500     MOVE   "WRT-TEST-GF-32" TO PAR-NAME.
136600     GO TO   WRT-TEST-GF-32.
136700 WRT-DELETE-GF-32.
136800     PERFORM DE-LETE.
136900     GO TO   WRT-END-GF-32.
137000 WRT-TEST-GF-32.
137100     PERFORM INSPT.
137200     PERFORM WRITE-TEST-LINE.
137300     MOVE    0 TO IDENTIFIER-2.
137400     MOVE   "1" TO LINES-BELOW-1.
137500     MOVE   "1" TO LINES-ABOVE-1.
137600     WRITE PRINT-REC FROM TEST-LINE-1 BEFORE ADVANCING
137700              IDENTIFIER-2 LINE.
137800 WRT-END-GF-32.
137900*
138000 WRT-INIT-GF-33.
138100*
138200*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 8
138300*
138400     MOVE   "WRT FRM BFR ADV P99 LINS" TO FEATURE.
138500     MOVE   "WRT-TEST-GF-33" TO PAR-NAME.
138600     GO TO   WRT-TEST-GF-33.
138700 WRT-DELETE-GF-33.
138800     PERFORM DE-LETE.
138900     GO TO   WRT-END-GF-33.
139000 WRT-TEST-GF-33.
139100     PERFORM INSPT.
139200     PERFORM WRITE-TEST-LINE.
139300     MOVE    1 TO IDENTIFIER-2.
139400     MOVE   "1" TO LINES-BELOW-1.
139500     MOVE   "2" TO LINES-ABOVE-1.
139600     WRITE PRINT-REC FROM TEST-LINE-1 BEFORE ADVANCING
139700              IDENTIFIER-2 LINES.
139800 WRT-END-GF-33.
139900*
140000 WRT-INIT-GF-34.
140100*
140200*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 12
140300*
140400     MOVE "WRT FRM BEFORE ADV PIC99" TO FEATURE.
140500     MOVE "WRT-TEST-GF-34" TO PAR-NAME.
140600     GO TO   WRT-TEST-GF-34.
140700 WRT-DELETE-GF-34.
140800     PERFORM DE-LETE.
140900     GO TO   WRT-END-GF-34.
141000 WRT-TEST-GF-34.
141100     PERFORM INSPT.
141200     PERFORM WRITE-TEST-LINE.
141300     MOVE    2 TO IDENTIFIER-2.
141400     MOVE   "1" TO LINES-BELOW-1.
141500     MOVE   "3" TO LINES-ABOVE-1.
141600     WRITE   PRINT-REC FROM TEST-LINE-1 BEFORE ADVANCING
141700              IDENTIFIER-2.
141800 WRT-END-GF-34.
141900*
142000 WRT-INIT-GF-35.
142100*
142200*    THIS TEST ADVANCES THE PRINT POSITION 5 LINES, TO LINE 17
142300*
142400     MOVE   "WRT FROM BEFORE P99 LINE" TO FEATURE.
142500     MOVE   "WRT-TEST-GF-35" TO PAR-NAME.
142600     GO TO   WRT-TEST-GF-35.
142700 WRT-DELETE-GF-35.
142800     PERFORM DE-LETE.
142900     GO TO   WRT-END-GF-35.
143000 WRT-TEST-GF-35.
143100     PERFORM INSPT.
143200     PERFORM WRITE-TEST-LINE.
143300     MOVE    3 TO IDENTIFIER-2.
143400     MOVE   "1" TO LINES-BELOW-1.
143500     MOVE   "4" TO LINES-ABOVE-1.
143600     WRITE PRINT-REC FROM TEST-LINE-1 BEFORE IDENTIFIER-2 LINE.
143700 WRT-END-GF-35.
143800*
143900 WRT-INIT-GF-36.
144000*
144100*    THIS TEST ADVANCES THE PRINT POSITION 6 LINES, TO LINE 23
144200*
144300     MOVE   "WRT FRM BEFORE P99 LINES" TO FEATURE.
144400     MOVE   "WRT-TEST-GF-36" TO PAR-NAME.
144500     GO TO   WRT-TEST-GF-36.
144600 WRT-DELETE-GF-36.
144700     PERFORM DE-LETE.
144800     GO TO   WRT-END-GF-36.
144900 WRT-TEST-GF-36.
145000     PERFORM INSPT.
145100     PERFORM WRITE-TEST-LINE.
145200     MOVE    4 TO IDENTIFIER-2.
145300     WRITE   PRINT-REC FROM OH-ONE BEFORE IDENTIFIER-2 LINES.
145400 WRT-END-GF-36.
145500*
145600 WRT-INIT-GF-37.
145700*
145800*    THIS TEST ADVANCES THE PRINT POSITION 7 LINES, TO LINE 29
145900*
146000     MOVE   "WRT FROM 03 BEFORE PIC99" TO FEATURE.
146100     MOVE   "WRT-TEST-GF-37" TO PAR-NAME.
146200     GO TO   WRT-TEST-GF-37.
146300 WRT-DELETE-GF-37.
146400     PERFORM DE-LETE.
146500     GO TO   WRT-END-GF-37.
146600 WRT-TEST-GF-37.
146700     PERFORM INSPT.
146800     PERFORM WRITE-TEST-LINE.
146900     MOVE    5 TO IDENTIFIER-2.
147000     WRITE   PRINT-REC FROM OH-THREE BEFORE IDENTIFIER-2.
147100 WRT-END-GF-37.
147200*
147300 WRT-INIT-GF-38.
147400*
147500*    THIS TEST ADVANCES THE PRINT POSITION 8 LINES, TO LINE 37
147600*
147700     MOVE   "WRT FRM AFT ADV P99 LINE" TO FEATURE.
147800     MOVE   "WRT-TEST-GF-38" TO PAR-NAME.
147900     GO TO   WRT-TEST-GF-38.
148000 WRT-DELETE-GF-38.
148100     PERFORM DE-LETE.
148200     GO TO   WRT-END-GF-38.
148300 WRT-TEST-GF-38.
148400     PERFORM INSPT.
148500     PERFORM WRITE-TEST-LINE.
148600     MOVE    6 TO IDENTIFIER-2.
148700     WRITE   PRINT-REC FROM SEVENTY-SEVEN-2 AFTER ADVANCING
148800              IDENTIFIER-2 LINE.
148900 WRT-END-GF-38.
149000*
149100 WRT-INIT-GF-39.
149200*
149300*    THIS TEST ADVANCES THE PRINT POSITION 9 LINES, TO LINE 46
149400*
149500     MOVE   "WRT FRM AFT ADV P99 LINS" TO FEATURE.
149600     MOVE   "WRT-TEST-GF-39" TO PAR-NAME.
149700     GO TO   WRT-TEST-GF-39.
149800 WRT-DELETE-GF-39.
149900     PERFORM DE-LETE.
150000     GO TO   WRT-END-GF-39.
150100 WRT-TEST-GF-39.
150200     PERFORM INSPT.
150300     PERFORM WRITE-TEST-LINE.
150400     MOVE    7 TO IDENTIFIER-2.
150500     MOVE   "8" TO LINES-BELOW-1.
150600     MOVE   "1" TO LINES-ABOVE-1.
150700     WRITE   PRINT-REC FROM TEST-LINE-1 AFTER ADVANCING
150800              IDENTIFIER-2 LINES.
150900 WRT-END-GF-39.
151000*
151100 WRT-INIT-GF-40.
151200*
151300*    THIS TEST ADVANCES THE PRINT POSITION 10 LINES, TO LINE 56
151400*
151500     MOVE "WRT FRM AFT ADV ID2" TO FEATURE.
151600     MOVE "WRT-TEST-44" TO PAR-NAME.
151700     PERFORM WRITE-TEST-LINE.
151800     MOVE 8 TO IDENTIFIER-2.
151900     MOVE "9" TO LINES-BELOW-1.
152000     MOVE "1" TO LINES-ABOVE-1.
152100     WRITE PRINT-REC FROM TEST-LINE-1 AFTER ADVANCING
152200              IDENTIFIER-2.
152300 WRT-END-GF-40.
152400*
152500 WRT-INIT-GF-41.
152600*
152700*    THIS TEST ADVANCES THE PRINT POSITION TO A NEW PAGE.  IT
152800*    SHOULD LEAVE LINE 2 ON THE NEW PAGE AS THE CURRENT LINE, SO
152900*    THAT THE FIRST WRT-TEST LINE ON THE NEW PAGE IS ON THE
153000*    THIRD PRINTABLE LINE.
153100*
153200     MOVE   "WRT FROM AFTER ADV PAGE" TO FEATURE.
153300     MOVE   "WRT-TEST-GF-41" TO PAR-NAME.
153400     GO TO   WRT-TEST-GF-41.
153500 WRT-DELETE-GF-41.
153600     PERFORM DE-LETE.
153700     GO TO   WRT-END-GF-41.
153800 WRT-TEST-GF-41.
153900     PERFORM INSPT.
154000     PERFORM WRITE-TEST-LINE.
154100     WRITE   PRINT-REC FROM NEW-PAGE-LINE AFTER ADVANCING PAGE.
154200     MOVE    NEXT-LINE TO PRINT-REC.
154300     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
154400 WRT-END-GF-41.
154500*
154600 WRT-INIT-GF-42.
154700*
154800*    THIS TEST ADVANCES THE PRINT POSITION 2 LINES, TO LINE 5
154900*
155000     MOVE   "WRT FROM AFTER ID2 LINE" TO FEATURE.
155100     MOVE   "WRT-TEST-GF-42" TO PAR-NAME.
155200     GO TO   WRT-TEST-GF-42.
155300 WRT-DELETE-GF-42.
155400     PERFORM DE-LETE.
155500     GO TO   WRT-END-GF-42.
155600 WRT-TEST-GF-42.
155700     PERFORM INSPT.
155800     PERFORM WRITE-TEST-LINE.
155900     MOVE    0 TO IDENTIFIER-2.
156000     MOVE   "1" TO LINES-BELOW-1.
156100     MOVE   "1" TO LINES-ABOVE-1.
156200     WRITE PRINT-REC FROM TEST-LINE-1 AFTER IDENTIFIER-2 LINE.
156300 WRT-END-GF-42.
156400*
156500 WRT-INIT-GF-43.
156600*
156700*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 9
156800*
156900     MOVE   "WRT FROM AFTER S99 LINES" TO FEATURE.
157000     MOVE   "WRT-TEST-GF-43" TO PAR-NAME.
157100     GO TO   WRT-TEST-GF-43.
157200 WRT-DELETE-GF-43.
157300     PERFORM DE-LETE.
157400     GO TO   WRT-END-GF-43.
157500 WRT-TEST-GF-43.
157600     PERFORM INSPT.
157700     PERFORM WRITE-TEST-LINE.
157800     MOVE    2 TO IDENT-2-S99.
157900     MOVE   "3" TO LINES-BELOW-1.
158000     MOVE   "1" TO LINES-ABOVE-1.
158100     WRITE   PRINT-REC FROM TEST-LINE-1 AFTER IDENT-2-S99 LINES.
158200 WRT-END-GF-43.
158300*
158400 WRT-INIT-GF-44.
158500*
158600*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 12
158700*
158800     MOVE   "WRT FROM AFTER C99" TO FEATURE.
158900     MOVE   "WRT-TEST-GF-44" TO PAR-NAME.
159000     GO TO   WRT-TEST-GF-44.
159100 WRT-DELETE-GF-44.
159200     PERFORM DE-LETE.
159300     GO TO   WRT-END-GF-44.
159400 WRT-TEST-GF-44.
159500     PERFORM INSPT.
159600     PERFORM WRITE-TEST-LINE.
159700     MOVE    1 TO IDENT-2-C99.
159800     MOVE   "2" TO LINES-BELOW-1.
159900     MOVE   "1" TO LINES-ABOVE-1.
160000     WRITE   PRINT-REC FROM TEST-LINE-1 AFTER IDENT-2-C99.
160100 WRT-END-GF-44.
160200*
160300 WRT-INIT-GF-45.
160400*
160500*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 16
160600*
160700     MOVE   "WRT BEFORE ADV S99 LINE" TO FEATURE.
160800     MOVE   "WRT-TEST-GF-45" TO PAR-NAME.
160900     GO TO   WRT-TEST-GF-45.
161000 WRT-DELETE-GF-45.
161100     PERFORM DE-LETE.
161200     GO TO   WRT-END-GF-45.
161300 WRT-TEST-GF-45.
161400     PERFORM INSPT.
161500     PERFORM WRITE-TEST-LINE.
161600     MOVE    2 TO IDENT-2-S99.
161700     MOVE   "1" TO LINES-BELOW-1.
161800     MOVE   "3" TO LINES-ABOVE-1.
161900     MOVE    TEST-LINE-1 TO PRINT-REC.
162000     WRITE PRINT-REC BEFORE ADVANCING IDENT-2-S99 LINE.
162100 WRT-END-GF-45.
162200*
162300 WRT-INIT-GF-46.
162400*
162500*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 20
162600*
162700     MOVE   "WRT BEFORE ADV S99 LINES" TO FEATURE.
162800     MOVE   "WRT-TEST-GF-46" TO PAR-NAME.
162900     GO TO   WRT-TEST-GF-46.
163000 WRT-DELETE-GF-46.
163100     PERFORM DE-LETE.
163200     GO TO   WRT-END-GF-46.
163300 WRT-TEST-GF-46.
163400     PERFORM INSPT.
163500     PERFORM WRITE-TEST-LINE.
163600     MOVE    2 TO IDENT-2-S99.
163700     MOVE   "1" TO LINES-BELOW-1.
163800     MOVE   "3" TO LINES-ABOVE-1.
163900     MOVE    TEST-LINE-1 TO PRINT-REC.
164000     WRITE   PRINT-REC BEFORE ADVANCING IDENT-2-S99 LINES.
164100 WRT-END-GF-46.
164200*
164300 WRT-INIT-GF-47.
164400*
164500*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 24
164600*
164700     MOVE   "WRT BEFORE ADV S99" TO FEATURE.
164800     MOVE   "WRT-TEST-GF-47" TO PAR-NAME.
164900     GO TO   WRT-TEST-GF-47.
165000 WRT-DELETE-GF-47.
165100     PERFORM DE-LETE.
165200     GO TO   WRT-END-GF-47.
165300 WRT-TEST-GF-47.
165400     PERFORM INSPT.
165500     PERFORM WRITE-TEST-LINE.
165600     MOVE    2 TO IDENT-2-S99.
165700     MOVE   "1" TO LINES-BELOW-1.
165800     MOVE   "3" TO LINES-ABOVE-1.
165900     MOVE    TEST-LINE-1 TO PRINT-REC.
166000     WRITE   PRINT-REC BEFORE ADVANCING IDENT-2-S99.
166100 WRT-END-GF-47.
166200*
166300 WRT-INIT-GF-48.
166400*
166500*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 27
166600*
166700     MOVE   "WRT BEFORE PIC9 LINE" TO FEATURE.
166800     MOVE   "WRT-TEST-GF-48" TO PAR-NAME.
166900     GO TO   WRT-TEST-GF-48.
167000 WRT-DELETE-GF-48.
167100     PERFORM DE-LETE.
167200     GO TO   WRT-END-GF-48.
167300 WRT-TEST-GF-48.
167400     PERFORM INSPT.
167500     PERFORM WRITE-TEST-LINE.
167600     MOVE   "1" TO LINES-BELOW-1.
167700     MOVE   "2" TO LINES-ABOVE-1.
167800     MOVE    TEST-LINE-1 TO PRINT-REC.
167900     WRITE   PRINT-REC BEFORE ONE LINE.
168000     PERFORM INSPT.
168100 WRT-END-GF-48.
168200*
168300 WRT-INIT-GF-49.
168400*
168500*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 31
168600*
168700     MOVE   "WRT BEFORE PIC9 LINES" TO FEATURE.
168800     MOVE   "WRT-TEST-GF-49" TO PAR-NAME.
168900     GO TO   WRT-TEST-GF-49.
169000 WRT-DELETE-GF-49.
169100     PERFORM DE-LETE.
169200     GO TO   WRT-END-GF-49.
169300 WRT-TEST-GF-49.
169400     PERFORM INSPT.
169500     PERFORM WRITE-TEST-LINE.
169600     MOVE   "1" TO LINES-BELOW-1.
169700     MOVE   "3" TO LINES-ABOVE-1.
169800     MOVE    TEST-LINE-1 TO PRINT-REC.
169900     WRITE   PRINT-REC BEFORE TWO LINES.
170000 WRT-END-GF-49.
170100*
170200 WRT-INIT-GF-50.
170300*
170400*    THIS TEST ADVANCES THE PRINT POSITION 5 LINES, TO LINE 36
170500*
170600     MOVE   "WRT BEFORE PIC9" TO FEATURE.
170700     MOVE   "WRT-TEST-GF-50" TO PAR-NAME.
170800     GO TO   WRT-TEST-GF-50.
170900 WRT-DELETE-GF-50.
171000     PERFORM DE-LETE.
171100     GO TO   WRT-END-GF-50.
171200 WRT-TEST-GF-50.
171300     PERFORM INSPT.
171400     PERFORM WRITE-TEST-LINE.
171500     MOVE   "1" TO LINES-BELOW-1.
171600     MOVE   "4" TO LINES-ABOVE-1.
171700     MOVE    TEST-LINE-1 TO PRINT-REC.
171800     WRITE   PRINT-REC BEFORE THREE.
171900 WRT-END-GF-50.
172000*
172100 WRT-INIT-GF-51.
172200*
172300*    THIS TEST ADVANCES THE PRINT POSITION 6 LINES, TO LINE 42
172400*
172500     MOVE   "WRT AFTER ADV PIC9 LINE" TO FEATURE.
172600     MOVE   "WRT-TEST-GF-51" TO PAR-NAME.
172700     GO TO   WRT-TEST-GF-51.
172800 WRT-DELETE-GF-51.
172900     PERFORM DE-LETE.
173000     GO TO   WRT-END-GF-51.
173100 WRT-TEST-GF-51.
173200     PERFORM INSPT.
173300     PERFORM WRITE-TEST-LINE.
173400     MOVE   "5" TO LINES-BELOW-1.
173500     MOVE   "1" TO LINES-ABOVE-1.
173600     MOVE    TEST-LINE-1 TO PRINT-REC.
173700     WRITE   PRINT-REC AFTER ADVANCING FOUR LINE.
173800 WRT-END-GF-51.
173900*
174000 WRT-INIT-GF-52.
174100*
174200*    THIS TEST ADVANCES THE PRINT POSITION 2 LINES, TO LINE 44
174300*
174400     MOVE   "WRT AFT ADV 9(18) LINES" TO FEATURE.
174500     MOVE   "WRT-TEST-GF-52" TO PAR-NAME.
174600     GO TO   WRT-TEST-GF-52.
174700 WRT-DELETE-GF-52.
174800     PERFORM DE-LETE.
174900     GO TO   WRT-END-GF-52.
175000 WRT-TEST-GF-52.
175100     PERFORM INSPT.
175200     PERFORM WRITE-TEST-LINE.
175300     MOVE   "1" TO LINES-BELOW-1.
175400     MOVE   "1" TO LINES-ABOVE-1.
175500     MOVE    TEST-LINE-1 TO PRINT-REC.
175600     WRITE   PRINT-REC AFTER ADVANCING LONG-ZERO LINES.
175700 WRT-END-GF-52.
175800*
175900 WRT-INIT-GF-53.
176000*
176100*    THIS TEST ADVANCES THE PRINT POSITION 3 LINES, TO LINE 47
176200*
176300     MOVE   "WRT AFTER ADV 9(18)" TO FEATURE.
176400     MOVE   "WRT-TEST-GF-53" TO PAR-NAME.
176500     GO TO   WRT-TEST-GF-53.
176600 WRT-DELETE-GF-53.
176700     PERFORM DE-LETE.
176800     GO TO   WRT-END-GF-53.
176900 WRT-TEST-GF-53.
177000     PERFORM INSPT.
177100     PERFORM WRITE-TEST-LINE.
177200     MOVE   "2" TO LINES-BELOW-1.
177300     MOVE   "1" TO LINES-ABOVE-1.
177400     MOVE    TEST-LINE-1 TO PRINT-REC.
177500     WRITE   PRINT-REC AFTER ADVANCING LONG-ONE.
177600 WRT-END-GF-53.
177700*
177800 WRT-INIT-GF-54.
177900*
178000*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 51
178100*
178200     MOVE   "WRT AFTER S99 LINE" TO FEATURE.
178300     MOVE   "WRT-TEST-GF-54" TO PAR-NAME.
178400     GO TO   WRT-TEST-GF-54.
178500 WRT-DELETE-GF-54.
178600     PERFORM DE-LETE.
178700     GO TO   WRT-END-GF-54.
178800 WRT-TEST-GF-54.
178900     PERFORM INSPT.
179000     PERFORM WRITE-TEST-LINE.
179100     MOVE    2 TO IDENT-2-S99.
179200     MOVE   "3" TO LINES-BELOW-1.
179300     MOVE   "1" TO LINES-ABOVE-1.
179400     MOVE    TEST-LINE-1 TO PRINT-REC.
179500     WRITE   PRINT-REC AFTER IDENT-2-S99 LINE.
179600 WRT-END-GF-54.
179700*
179800 WRT-INIT-GF-55.
179900*
180000*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 55
180100*
180200     MOVE   "WRT AFTER PIC99 LINES" TO FEATURE.
180300     MOVE   "WRT-TEST-GF-55" TO PAR-NAME.
180400     GO TO   WRT-TEST-GF-55.
180500 WRT-DELETE-GF-55.
180600     PERFORM DE-LETE.
180700     GO TO   WRT-END-GF-55.
180800 WRT-TEST-GF-55.
180900     PERFORM INSPT.
181000     PERFORM WRITE-TEST-LINE.
181100     MOVE    2 TO IDENTIFIER-2.
181200     MOVE   "3" TO LINES-BELOW-1.
181300     MOVE   "1" TO LINES-ABOVE-1.
181400     MOVE    TEST-LINE-1 TO PRINT-REC.
181500     WRITE   PRINT-REC AFTER IDENTIFIER-2 LINES.
181600 WRT-END-GF-55.
181700*
181800 WRT-INIT-GF-56.
181900*
182000*    THIS TEST ADVANCES THE PRINT POSITION 4 LINES, TO LINE 59
182100*
182200     MOVE   "WRT AFTER PIC99" TO FEATURE.
182300     MOVE   "WRT-TEST-GF-56" TO PAR-NAME.
182400     GO TO   WRT-TEST-GF-56.
182500 WRT-DELETE-GF-56.
182600     PERFORM DE-LETE.
182700     GO TO   WRT-END-GF-56.
182800 WRT-TEST-GF-56.
182900     PERFORM INSPT.
183000     PERFORM WRITE-TEST-LINE.
183100     MOVE    2 TO IDENTIFIER-2.
183200     MOVE   "3" TO LINES-BELOW-1.
183300     MOVE   "1" TO LINES-ABOVE-1.
183400     MOVE TEST-LINE-1 TO PRINT-REC.
183500     WRITE PRINT-REC AFTER IDENTIFIER-2.
183600 WRT-END-GF-56.
183700*
183800 WRT-INIT-GF-57.
183900*
184000*    THIS TEST ADVANCES THE PRINT POSITION TO A NEW PAGE.  IT
184100*    SHOULD LEAVE LINE 2 ON THE NEW PAGE AS THE CURRENT LINE, SO
184200*    THAT THE FIRST WRT-TEST LINE ON THE NEW PAGE IS ON THE
184300*    THIRD PRINTABLE LINE.
184400*
184500     MOVE   "WRT FROM AFTER PAGE" TO FEATURE.
184600     MOVE   "WRT-TEST-GF-57" TO PAR-NAME.
184700     GO TO   WRT-TEST-GF-57.
184800 WRT-DELETE-GF-57.
184900     PERFORM DE-LETE.
185000     GO TO   WRT-END-GF-57.
185100 WRT-TEST-GF-57.
185200     PERFORM INSPT.
185300     PERFORM WRITE-TEST-LINE.
185400     WRITE   PRINT-REC FROM NEW-PAGE-LINE AFTER PAGE.
185500     MOVE    NEXT-LINE TO PRINT-REC.
185600     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
185700 WRT-END-GF-57.
185800*
185900 AFTER-LAST-TEST.
186000     MOVE    "FINAL WRT TEST LINE" TO FEATURE.
186100     MOVE     "AFTER-LAST-TEST" TO PAR-NAME.
186200     PERFORM  WRITE-TEST-LINE.
186300*
186400*
186500 SQ-END-ROUTINE.
186600     GO TO CCVS-EXIT.
186700*
186800 WRITE-TEST-LINE.
186900     MOVE    TEST-RESULTS TO PRINT-REC.
187000     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
187100     MOVE    SPACE TO PRINT-REC.
187200     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
187300*
187400 COL-1-CHAR-PRINT.
187500     ADD     1 TO LIN-SER
187600     MOVE    CHAR-LINE TO PRINT-REC
187700     WRITE   PRINT-REC AFTER ADVANCING 1 LINE.
187800*
187900 CCVS-EXIT SECTION.
188000 CCVS-999999.
188100     GO TO CLOSE-FILES.
