000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ111A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*                                                              *
000900*    CREATION DATE     /     VALIDATION DATE                   *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300
001400*        THIS ROUTINE CREATES A SEQUENTIAL TAPE FILE CONTAINING
001500*    595 RECORDS, EACH RECORD CONTAINING 155 CHARACTERS.  THE
001600*    CODE-SET CLAUSE IS INCLUDED IN THE FILE DESCRIPTION ENTRY
001700*    FOR THE FILE.  THE RECORD DESCRIPTION FOR THE FILE CONTAINS
001800*    AN ITEM WITH THE SIGN IS SEPARATE CHARACTER CLAUSE.
001900*        A SEQUENTIAL TAPE FILE WITH 595 RECORDS HAS BEEN
002000*    CREATED.  THE FD FOR THE FILE CONTAINS A CODE-SET CLAUSE.
002100*    THERE ARE 155 CHARACTERS PER RECORD INCLUDING A NUMERIC
002200*    ITEM WITH THE SIGN IS SEPARATE CLAUSE.
002300*
002400*    USED X-CARDS:
002500*         XXXXX001
002600*         XXXXX055
002700*     P   XXXXX062
002800*         XXXXX082
002900*         XXXXX083
003000*     C   XXXXX084
003100*
003200*
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.
003600     XXXXX082.
003700 OBJECT-COMPUTER.
003800     XXXXX083.
003900 SPECIAL-NAMES.
004000     ALPHABET TAPE-CHARACTER-SET IS STANDARD-1.
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
004300P    SELECT RAW-DATA   ASSIGN TO
004400P    XXXXX062
004500P           ORGANIZATION IS INDEXED
004600P           ACCESS MODE IS RANDOM
004700P           RECORD KEY IS RAW-DATA-KEY.
004800     SELECT PRINT-FILE ASSIGN TO
004900     XXXXX055.
005000     SELECT SQ-FS1 ASSIGN TO
005100     XXXXX001
005200     ORGANIZATION IS SEQUENTIAL.
005300 DATA DIVISION.
005400 FILE SECTION.
005500P
005600PFD  RAW-DATA.
005700P
005800P01  RAW-DATA-SATZ.
005900P    05  RAW-DATA-KEY        PIC X(6).
006000P    05  C-DATE              PIC 9(6).
006100P    05  C-TIME              PIC 9(8).
006200P    05  C-NO-OF-TESTS       PIC 99.
006300P    05  C-OK                PIC 999.
006400P    05  C-ALL               PIC 999.
006500P    05  C-FAIL              PIC 999.
006600P    05  C-DELETED           PIC 999.
006700P    05  C-INSPECT           PIC 999.
006800P    05  C-NOTE              PIC X(13).
006900P    05  C-INDENT            PIC X.
007000P    05  C-ABORT             PIC X(8).
007100 FD  PRINT-FILE
007200C    LABEL RECORDS
007300C    XXXXX084
007400C    DATA RECORD IS PRINT-REC DUMMY-RECORD
007500               .
007600 01  PRINT-REC PICTURE X(120).
007700 01  DUMMY-RECORD PICTURE X(120).
007800 FD  SQ-FS1
007900C    LABEL RECORD STANDARD
008000     CODE-SET IS TAPE-CHARACTER-SET .
008100 01  SQ-FS1R1-F-G-155.
008200     02  SQ-FS1-FIRST  PICTURE X(120).
008300     02  SQ-FS1-RECNO  PIC S9(5)  SIGN IS LEADING
008400         SEPARATE CHARACTER.
008500     02  SQ-FS1-FILLER PICTURE X(30).
008600 WORKING-STORAGE SECTION.
008700 01  COUNT-OF-RECS   PIC S9(5) VALUE ZERO.
008800 01  ERROR-FLAG   PIC 9 VALUE ZERO.
008900 01  RECORDS-IN-ERROR  PIC S9(5) USAGE COMP VALUE ZERO.
009000 01  EOF-FLAG PIC 9 VALUE ZERO.
009100 01  COMPARE-ITEM.
009200     02  FILLER PICTURE X.
009300     02  COMPARE-REC-NO PICTURE 9(5).
009400 01  TEMP-STORE-FOR-PRINT.
009500     02 TEMP-FIRST  PIC X(120).
009600     02 TEMP-SECOND.
009700        03  TEMP-RECNO PIC X(6).
009800        03  TEMP-FILLER PIC X(30).
009900 01  FILE-RECORD-INFORMATION-REC.
010000     03 FILE-RECORD-INFO-SKELETON.
010100        05 FILLER                 PICTURE X(48)       VALUE
010200             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
010300        05 FILLER                 PICTURE X(46)       VALUE
010400             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
010500        05 FILLER                 PICTURE X(26)       VALUE
010600             ",LFIL=000000,ORG=  ,LBLR= ".
010700        05 FILLER                 PICTURE X(37)       VALUE
010800             ",RECKEY=                             ".
010900        05 FILLER                 PICTURE X(38)       VALUE
011000             ",ALTKEY1=                             ".
011100        05 FILLER                 PICTURE X(38)       VALUE
011200             ",ALTKEY2=                             ".
011300        05 FILLER                 PICTURE X(7)        VALUE SPACE.
011400     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
011500        05 FILE-RECORD-INFO-P1-120.
011600           07 FILLER              PIC X(5).
011700           07 XFILE-NAME           PIC X(6).
011800           07 FILLER              PIC X(8).
011900           07 XRECORD-NAME         PIC X(6).
012000           07 FILLER              PIC X(1).
012100           07 REELUNIT-NUMBER     PIC 9(1).
012200           07 FILLER              PIC X(7).
012300           07 XRECORD-NUMBER       PIC 9(6).
012400           07 FILLER              PIC X(6).
012500           07 UPDATE-NUMBER       PIC 9(2).
012600           07 FILLER              PIC X(5).
012700           07 ODO-NUMBER          PIC 9(4).
012800           07 FILLER              PIC X(5).
012900           07 XPROGRAM-NAME        PIC X(5).
013000           07 FILLER              PIC X(7).
013100           07 XRECORD-LENGTH       PIC 9(6).
013200           07 FILLER              PIC X(7).
013300           07 CHARS-OR-RECORDS    PIC X(2).
013400           07 FILLER              PIC X(1).
013500           07 XBLOCK-SIZE          PIC 9(4).
013600           07 FILLER              PIC X(6).
013700           07 RECORDS-IN-FILE     PIC 9(6).
013800           07 FILLER              PIC X(5).
013900           07 XFILE-ORGANIZATION   PIC X(2).
014000           07 FILLER              PIC X(6).
014100           07 XLABEL-TYPE          PIC X(1).
014200        05 FILE-RECORD-INFO-P121-240.
014300           07 FILLER              PIC X(8).
014400           07 XRECORD-KEY          PIC X(29).
014500           07 FILLER              PIC X(9).
014600           07 ALTERNATE-KEY1      PIC X(29).
014700           07 FILLER              PIC X(9).
014800           07 ALTERNATE-KEY2      PIC X(29).
014900           07 FILLER              PIC X(7).
015000 01  TEST-RESULTS.
015100     02 FILLER                    PICTURE X VALUE SPACE.
015200     02 FEATURE                   PICTURE X(20) VALUE SPACE.
015300     02 FILLER                    PICTURE X VALUE SPACE.
015400     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
015500     02 FILLER                    PICTURE X  VALUE SPACE.
015600     02  PAR-NAME.
015700       03 FILLER PICTURE X(12) VALUE SPACE.
015800       03  PARDOT-X PICTURE X  VALUE SPACE.
015900       03 DOTVALUE PICTURE 99  VALUE ZERO.
016000       03 FILLER PIC X(5) VALUE SPACE.
016100     02 FILLER PIC X(10) VALUE SPACE.
016200     02 RE-MARK PIC X(61).
016300 01  TEST-COMPUTED.
016400     02 FILLER PIC X(30) VALUE SPACE.
016500     02 FILLER PIC X(17) VALUE "       COMPUTED=".
016600     02 COMPUTED-X.
016700     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
016800     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
016900     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
017000     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
017100     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
017200     03       CM-18V0 REDEFINES COMPUTED-A.
017300         04 COMPUTED-18V0                   PICTURE -9(18).
017400         04 FILLER                          PICTURE X.
017500     03 FILLER PIC X(50) VALUE SPACE.
017600 01  TEST-CORRECT.
017700     02 FILLER PIC X(30) VALUE SPACE.
017800     02 FILLER PIC X(17) VALUE "       CORRECT =".
017900     02 CORRECT-X.
018000     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
018100     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
018200     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
018300     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
018400     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
018500     03      CR-18V0 REDEFINES CORRECT-A.
018600         04 CORRECT-18V0                    PICTURE -9(18).
018700         04 FILLER                          PICTURE X.
018800     03 FILLER PIC X(50) VALUE SPACE.
018900 01  CCVS-C-1.
019000     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
019100-    "SS  PARAGRAPH-NAME
019200-    "        REMARKS".
019300     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
019400 01  CCVS-C-2.
019500     02 FILLER PICTURE IS X VALUE IS SPACE.
019600     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
019700     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
019800     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
019900     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
020000 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
020100 01  REC-CT PICTURE 99 VALUE ZERO.
020200 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
020300 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
020400 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
020500 01  PASS-COUNTER PIC 999 VALUE ZERO.
020600 01  TOTAL-ERROR PIC 999 VALUE ZERO.
020700 01  ERROR-HOLD PIC 999 VALUE ZERO.
020800 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
020900 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
021000 01  CCVS-H-1.
021100     02  FILLER   PICTURE X(27)  VALUE SPACE.
021200     02 FILLER PICTURE X(67) VALUE
021300     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
021400-    " SYSTEM".
021500     02  FILLER     PICTURE X(26)  VALUE SPACE.
021600 01  CCVS-H-2.
021700     02 FILLER PICTURE X(52) VALUE IS
021800     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
021900     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
022000     02 TEST-ID PICTURE IS X(9).
022100     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
022200 01  CCVS-H-3.
022300     02  FILLER PICTURE X(34) VALUE
022400     " FOR OFFICIAL USE ONLY    ".
022500     02  FILLER PICTURE X(58) VALUE
022600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022700     02  FILLER PICTURE X(28) VALUE
022800     "  COPYRIGHT   1985 ".
022900 01  CCVS-E-1.
023000     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
023100     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
023200     02 ID-AGAIN PICTURE IS X(9).
023300     02 FILLER PICTURE X(45) VALUE IS
023400     " NTIS DISTRIBUTION COBOL 85".
023500 01  CCVS-E-2.
023600     02  FILLER                   PICTURE X(31)  VALUE
023700     SPACE.
023800     02  FILLER                   PICTURE X(21)  VALUE SPACE.
023900     02 CCVS-E-2-2.
024000         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
024100         03 FILLER PICTURE IS X VALUE IS SPACE.
024200         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
024300 01  CCVS-E-3.
024400     02  FILLER PICTURE X(22) VALUE
024500     " FOR OFFICIAL USE ONLY".
024600     02  FILLER PICTURE X(12) VALUE SPACE.
024700     02  FILLER PICTURE X(58) VALUE
024800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024900     02  FILLER PICTURE X(13) VALUE SPACE.
025000     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
025100 01  CCVS-E-4.
025200     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
025300     02 FILLER PIC XXXX VALUE " OF ".
025400     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
025500     02 FILLER PIC X(40) VALUE
025600      "  TESTS WERE EXECUTED SUCCESSFULLY".
025700 01  XXINFO.
025800     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
025900     02 INFO-TEXT.
026000     04 FILLER PIC X(20) VALUE SPACE.
026100     04 XXCOMPUTED PIC X(20).
026200     04 FILLER PIC X(5) VALUE SPACE.
026300     04 XXCORRECT PIC X(20).
026400 01  HYPHEN-LINE.
026500     02 FILLER PICTURE IS X VALUE IS SPACE.
026600     02 FILLER PICTURE IS X(65) VALUE IS "************************
026700-    "*****************************************".
026800     02 FILLER PICTURE IS X(54) VALUE IS "************************
026900-    "******************************".
027000 01  CCVS-PGM-ID PIC X(6) VALUE
027100     "SQ111A".
027200 PROCEDURE DIVISION.
027300 CCVS1 SECTION.
027400 OPEN-FILES.
027500P    OPEN I-O RAW-DATA.
027600P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
027700P    READ RAW-DATA INVALID KEY GO TO END-E-1.
027800P    MOVE "ABORTED " TO C-ABORT.
027900P    ADD 1 TO C-NO-OF-TESTS.
028000P    ACCEPT C-DATE  FROM DATE.
028100P    ACCEPT C-TIME  FROM TIME.
028200P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
028300PEND-E-1.
028400P    CLOSE RAW-DATA.
028500     OPEN     OUTPUT PRINT-FILE.
028600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
028700     MOVE    SPACE TO TEST-RESULTS.
028800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028900     MOVE ZERO TO REC-SKL-SUB.
029000     PERFORM CCVS-INIT-FILE 9 TIMES.
029100 CCVS-INIT-FILE.
029200     ADD 1 TO REC-SKL-SUB.
029300     MOVE FILE-RECORD-INFO-SKELETON TO
029400                  FILE-RECORD-INFO (REC-SKL-SUB).
029500 CCVS-INIT-EXIT.
029600     GO TO CCVS1-EXIT.
029700 CLOSE-FILES.
029800     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029900P    OPEN I-O RAW-DATA.
030000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
030100P    READ RAW-DATA INVALID KEY GO TO END-E-2.
030200P    MOVE "OK.     " TO C-ABORT.
030300P    MOVE PASS-COUNTER TO C-OK.
030400P    MOVE ERROR-HOLD   TO C-ALL.
030500P    MOVE ERROR-COUNTER TO C-FAIL.
030600P    MOVE DELETE-CNT TO C-DELETED.
030700P    MOVE INSPECT-COUNTER TO C-INSPECT.
030800P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
030900PEND-E-2.
031000P    CLOSE RAW-DATA.
031100 TERMINATE-CCVS.
031200S    EXIT PROGRAM.
031300STERMINATE-CALL.
031400     STOP     RUN.
031500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
031600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
031700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
031800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
031900     MOVE "****TEST DELETED****" TO RE-MARK.
032000 PRINT-DETAIL.
032100     IF REC-CT NOT EQUAL TO ZERO
032200             MOVE "." TO PARDOT-X
032300             MOVE REC-CT TO DOTVALUE.
032400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
032500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
032600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
032700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
032800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
032900     MOVE SPACE TO CORRECT-X.
033000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
033100     MOVE     SPACE TO RE-MARK.
033200 HEAD-ROUTINE.
033300     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033400     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
033500     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
033600 COLUMN-NAMES-ROUTINE.
033700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
034000 END-ROUTINE.
034100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
034200 END-RTN-EXIT.
034300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034400 END-ROUTINE-1.
034500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
034600      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
034700      ADD PASS-COUNTER TO ERROR-HOLD.
034800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
034900      MOVE PASS-COUNTER TO CCVS-E-4-1.
035000      MOVE ERROR-HOLD TO CCVS-E-4-2.
035100      MOVE CCVS-E-4 TO CCVS-E-2-2.
035200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
035300  END-ROUTINE-12.
035400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
035500     IF       ERROR-COUNTER IS EQUAL TO ZERO
035600         MOVE "NO " TO ERROR-TOTAL
035700         ELSE
035800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
035900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
036000     PERFORM WRITE-LINE.
036100 END-ROUTINE-13.
036200     IF DELETE-CNT IS EQUAL TO ZERO
036300         MOVE "NO " TO ERROR-TOTAL  ELSE
036400         MOVE DELETE-CNT TO ERROR-TOTAL.
036500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
036600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036700      IF   INSPECT-COUNTER EQUAL TO ZERO
036800          MOVE "NO " TO ERROR-TOTAL
036900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
037000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
037100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037300 WRITE-LINE.
037400     ADD 1 TO RECORD-COUNT.
037500Y    IF RECORD-COUNT GREATER 50
037600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
037700Y        MOVE SPACE TO DUMMY-RECORD
037800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
037900Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
038000Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
038100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
038200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
038300Y        MOVE ZERO TO RECORD-COUNT.
038400     PERFORM WRT-LN.
038500 WRT-LN.
038600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
038700     MOVE SPACE TO DUMMY-RECORD.
038800 BLANK-LINE-PRINT.
038900     PERFORM WRT-LN.
039000 FAIL-ROUTINE.
039100     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
039200     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
039300     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
039400     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039500     GO TO FAIL-ROUTINE-EX.
039600 FAIL-ROUTINE-WRITE.
039700     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
039800     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
039900 FAIL-ROUTINE-EX. EXIT.
040000 BAIL-OUT.
040100     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
040200     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
040300 BAIL-OUT-WRITE.
040400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
040500     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040600 BAIL-OUT-EX. EXIT.
040700 CCVS1-EXIT.
040800     EXIT.
040900 SECT-SQ111A-0001 SECTION.
041000 WRITE-INIT-GF-01.
041100     MOVE "SQ-FS1" TO XFILE-NAME (1).
041200     MOVE "R1-F-G" TO XRECORD-NAME (1).
041300     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
041400     MOVE 000155 TO XRECORD-LENGTH (1).
041500     MOVE "RC" TO CHARS-OR-RECORDS (1).
041600     MOVE 0001 TO XBLOCK-SIZE (1).
041700     MOVE 000595 TO RECORDS-IN-FILE (1).
041800     MOVE "SQ" TO XFILE-ORGANIZATION (1).
041900     MOVE "S" TO XLABEL-TYPE (1).
042000     MOVE 000001 TO XRECORD-NUMBER (1).
042100     OPEN OUTPUT SQ-FS1.
042200 WRITE-TEST-GF-01.
042300     ADD 1 TO COUNT-OF-RECS.
042400     MOVE COUNT-OF-RECS TO XRECORD-NUMBER (1).
042500     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS1-FIRST.
042600     MOVE COUNT-OF-RECS TO SQ-FS1-RECNO.
042700     MOVE "WRITE-SET USED IN CREATING FILE" TO SQ-FS1-FILLER.
042800     WRITE SQ-FS1R1-F-G-155.
042900     IF COUNT-OF-RECS EQUAL TO 595
043000          GO TO WRITE-WRITE-GF-01.
043100     GO TO WRITE-TEST-GF-01.
043200 WRITE-WRITE-GF-01.
043300     MOVE "WRITE  FILE SQ-FS1" TO FEATURE.
043400     MOVE "WRITE-TEST-GF-01" TO PAR-NAME.
043500     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
043600     MOVE COUNT-OF-RECS TO CORRECT-18V0.
043700     MOVE "CODE-SET CLAUSE IN FD" TO RE-MARK.
043800     PERFORM PRINT-DETAIL.
043900     CLOSE SQ-FS1.
044000 READ-INIT-GF-01.
044100     MOVE ZERO TO COUNT-OF-RECS.
044200*       THIS TEST READS AND CHECKS THE FILE CREATED IN
044300*    READ-TEST-GF-01.
044400     OPEN INPUT SQ-FS1.
044500 READ-TEST-GF-01.
044600     READ SQ-FS1 RECORD
044700        AT END GO TO READ-TEST-GF-01-1.
044800     ADD 1 TO COUNT-OF-RECS.
044900     IF COUNT-OF-RECS EQUAL TO 596
045000         MOVE "MORE THAN 595 RECORDS" TO RE-MARK
045100         GO TO READ-FAIL-GF-01-1.
045200     MOVE SQ-FS1-FIRST TO FILE-RECORD-INFO-P1-120 (1).
045300     IF COUNT-OF-RECS NOT EQUAL TO XRECORD-NUMBER (1)
045400         ADD 1 TO RECORDS-IN-ERROR
045500         GO TO READ-TEST-GF-01.
045600     IF XFILE-NAME (1) NOT EQUAL TO "SQ-FS1"
045700         ADD 1 TO RECORDS-IN-ERROR
045800         GO TO READ-TEST-GF-01.
045900     MOVE SQ-FS1-RECNO TO COMPARE-ITEM.
046000     IF COMPARE-REC-NO EQUAL TO COUNT-OF-RECS
046100         GO TO READ-TEST-GF-01.
046200     ADD 1 TO RECORDS-IN-ERROR.
046300     GO TO READ-TEST-GF-01.
046400 READ-TEST-GF-01-1.
046500     IF COUNT-OF-RECS NOT EQUAL TO 595
046600         MOVE "UNEXPECTED EOF" TO RE-MARK
046700         MOVE "RECORDS READ =" TO COMPUTED-A
046800         MOVE COUNT-OF-RECS TO CORRECT-18V0
046900         GO TO READ-FAIL-GF-01.
047000     IF RECORDS-IN-ERROR EQUAL TO ZERO
047100         GO TO READ-PASS-GF-01.
047200     MOVE "VII-44; 4.4.2; ERRORS IN READING SQ-FS1" TO RE-MARK.
047300 READ-FAIL-GF-01-1.
047400     MOVE "RECORDS IN ERROR =" TO COMPUTED-A.
047500     MOVE RECORDS-IN-ERROR TO CORRECT-18V0.
047600 READ-FAIL-GF-01.
047700     PERFORM FAIL.
047800     GO TO READ-WRITE-GF-01.
047900 READ-PASS-GF-01.
048000     PERFORM PASS.
048100     MOVE "FILE VERIFIED RECS =" TO COMPUTED-A.
048200     MOVE COUNT-OF-RECS TO CORRECT-18V0.
048300 READ-WRITE-GF-01.
048400     MOVE "READ-TEST-GF-01" TO PAR-NAME.
048500     MOVE "READ TO VERIFY    " TO FEATURE.
048600     PERFORM PRINT-DETAIL.
048700 READ-CLOSE-GF-01.
048800     CLOSE SQ-FS1.
048900 CCVS-EXIT SECTION.
049000 CCVS-999999.
049100     GO TO CLOSE-FILES.
