000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ129A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                             REVISED 1986, AUGUST             *
001000*                                                              *
001100*    CREATION DATE     /     VALIDATION DATE                   *
001200*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001300*                                                              *
001400****************************************************************
001500*                                                              *
001600*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001700*                                                              *
001800*            X-01   SEQUENTIAL MAGNETIC TAPE FILE.             *
001900*            X-55   SYSTEM PRINTER                             *
002000*            X-82   SOURCE-COMPUTER                            *
002100*            X-83   OBJECT-COMPUTER.                           *
002200*                                                              *
002300*                                                              *
002400****************************************************************
002500*                                                              *
002600*    SQ129A ATTEMPTS TO OPEN FOR INPUT A MAGNETIC TAPE FILE    *
002700*    WHICH IS NOT PRESENT.  THIS SHOULD RESULT IN A PERMANENT  *
002800*    ERROR AND AN I-O STATUS OF "35".                          *
002900*                                                              *
003000*    THIS PROGRAM HAS BEEN SPLIT FROM V2.0 ONWARDS.            *
003100*    THE NEW PROGRAMS ARE SQ141A AND SQ142A.                   *
003200*                                                              *
003300*                                                              *
003400****************************************************************
003500*
003600 ENVIRONMENT DIVISION.
003700 CONFIGURATION SECTION.
003800 SOURCE-COMPUTER.
003900     XXXXX082.
004000 OBJECT-COMPUTER.
004100     XXXXX083.
004200*
004300 INPUT-OUTPUT SECTION.
004400 FILE-CONTROL.
004500     SELECT PRINT-FILE ASSIGN TO
004600     XXXXX055.
004700*
004800P    SELECT RAW-DATA   ASSIGN TO
004900P    XXXXX062
005000P          ORGANIZATION IS INDEXED
005100P          ACCESS MODE  IS RANDOM
005200P          RECORD-KEY   IS RAW-DATA-KEY.
005300P
005400     SELECT SQ-FS1 ASSIGN TO
005500     XXXXX001
005600            FILE STATUS IS SQ-FS1-STATUS.
005700*
005800*
005900 DATA DIVISION.
006000 FILE SECTION.
006100 FD  PRINT-FILE
006200C    LABEL RECORDS
006300C    XXXXX084
006400C    DATA RECORD IS PRINT-REC DUMMY-RECORD
006500               .
006600 01  PRINT-REC    PICTURE X(120).
006700 01  DUMMY-RECORD PICTURE X(120).
006800P
006900PFD  RAW-DATA.
007000P01  RAW-DATA-SATZ.
007100P    05  RAW-DATA-KEY        PIC X(6).
007200P    05  C-DATE              PIC 9(6).
007300P    05  C-TIME              PIC 9(8).
007400P    05  NO-OF-TESTS         PIC 99.
007500P    05  C-OK                PIC 999.
007600P    05  C-ALL               PIC 999.
007700P    05  C-FAIL              PIC 999.
007800P    05  C-DELETED           PIC 999.
007900P    05  C-INSPECT           PIC 999.
008000P    05  C-NOTE              PIC X(13).
008100P    05  C-INDENT            PIC X.
008200P    05  C-ABORT             PIC X(8).
008300*
008400 FD  SQ-FS1
008500C    LABEL RECORD IS STANDARD
008600                .
008700 01  SQ-FS1R1-F-G-120 PIC X(120).
008800*
008900 WORKING-STORAGE SECTION.
009000*
009100***************************************************************
009200*                                                             *
009300*    WORKING-STORAGE DATA ITEMS SPECIFIC TO THIS TEST SUITE   *
009400*                                                             *
009500***************************************************************
009600*
009700 01  SQ-FS1-STATUS.
009800   03  SQ-FS1-KEY-1   PIC X.
009900   03  SQ-FS1-KEY-2   PIC X.
010000*
010100 01  DECL-EXEC-SW  PIC 9.
010200*
010300***************************************************************
010400*                                                             *
010500*    WORKING-STORAGE DATA ITEMS USED BY THE CCVS              *
010600*                                                             *
010700***************************************************************
010800*
010900 01  REC-SKEL-SUB   PIC 99.
011000*
011100 01  FILE-RECORD-INFORMATION-REC.
011200     03 FILE-RECORD-INFO-SKELETON.
011300        05 FILLER                 PICTURE X(48)       VALUE
011400             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
011500        05 FILLER                 PICTURE X(46)       VALUE
011600             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
011700        05 FILLER                 PICTURE X(26)       VALUE
011800             ",LFIL=000000,ORG=  ,LBLR= ".
011900        05 FILLER                 PICTURE X(37)       VALUE
012000             ",RECKEY=                             ".
012100        05 FILLER                 PICTURE X(38)       VALUE
012200             ",ALTKEY1=                             ".
012300        05 FILLER                 PICTURE X(38)       VALUE
012400             ",ALTKEY2=                             ".
012500        05 FILLER                 PICTURE X(7)        VALUE SPACE.
012600     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
012700        05 FILE-RECORD-INFO-P1-120.
012800           07 FILLER              PIC X(5).
012900           07 XFILE-NAME          PIC X(6).
013000           07 FILLER              PIC X(8).
013100           07 XRECORD-NAME        PIC X(6).
013200           07 FILLER              PIC X(1).
013300           07 REELUNIT-NUMBER     PIC 9(1).
013400           07 FILLER              PIC X(7).
013500           07 XRECORD-NUMBER      PIC 9(6).
013600           07 FILLER              PIC X(6).
013700           07 UPDATE-NUMBER       PIC 9(2).
013800           07 FILLER              PIC X(5).
013900           07 ODO-NUMBER          PIC 9(4).
014000           07 FILLER              PIC X(5).
014100           07 XPROGRAM-NAME       PIC X(5).
014200           07 FILLER              PIC X(7).
014300           07 XRECORD-LENGTH      PIC 9(6).
014400           07 FILLER              PIC X(7).
014500           07 CHARS-OR-RECORDS    PIC X(2).
014600           07 FILLER              PIC X(1).
014700           07 XBLOCK-SIZE         PIC 9(4).
014800           07 FILLER              PIC X(6).
014900           07 RECORDS-IN-FILE     PIC 9(6).
015000           07 FILLER              PIC X(5).
015100           07 XFILE-ORGANIZATION  PIC X(2).
015200           07 FILLER              PIC X(6).
015300           07 XLABEL-TYPE         PIC X(1).
015400        05 FILE-RECORD-INFO-P121-240.
015500           07 FILLER              PIC X(8).
015600           07 XRECORD-KEY         PIC X(29).
015700           07 FILLER              PIC X(9).
015800           07 ALTERNATE-KEY1      PIC X(29).
015900           07 FILLER              PIC X(9).
016000           07 ALTERNATE-KEY2      PIC X(29).
016100           07 FILLER              PIC X(7).
016200*
016300 01  TEST-RESULTS.
016400     02 FILLER              PIC X      VALUE SPACE.
016500     02 FEATURE             PIC X(24)  VALUE SPACE.
016600     02 FILLER              PIC X      VALUE SPACE.
016700     02 P-OR-F              PIC X(5)   VALUE SPACE.
016800     02 FILLER              PIC X      VALUE SPACE.
016900     02  PAR-NAME.
017000       03 FILLER              PIC X(14)  VALUE SPACE.
017100       03 PARDOT-X            PIC X      VALUE SPACE.
017200       03 DOTVALUE            PIC 99     VALUE ZERO.
017300     02 FILLER              PIC X(9)   VALUE SPACE.
017400     02 RE-MARK             PIC X(61).
017500 01  TEST-COMPUTED.
017600   02 FILLER  PIC X(30)  VALUE SPACE.
017700   02 FILLER  PIC X(17)  VALUE "      COMPUTED =".
017800   02 COMPUTED-X.
017900     03 COMPUTED-A    PIC X(20)  VALUE SPACE.
018000     03 COMPUTED-N    REDEFINES COMPUTED-A PIC -9(9).9(9).
018100     03 COMPUTED-0V18 REDEFINES COMPUTED-A PIC -.9(18).
018200     03 COMPUTED-4V14 REDEFINES COMPUTED-A PIC -9(4).9(14).
018300     03 COMPUTED-14V4 REDEFINES COMPUTED-A PIC -9(14).9(4).
018400     03       CM-18V0 REDEFINES COMPUTED-A.
018500        04 COMPUTED-18V0                   PIC -9(18).
018600        04 FILLER                          PIC X.
018700     03 FILLER PIC X(50) VALUE SPACE.
018800 01  TEST-CORRECT.
018900     02 FILLER PIC X(30) VALUE SPACE.
019000     02 FILLER PIC X(17) VALUE "       CORRECT =".
019100     02 CORRECT-X.
019200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
019300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
019400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
019500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
019600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
019700     03      CR-18V0 REDEFINES CORRECT-A.
019800         04 CORRECT-18V0                     PIC -9(18).
019900         04 FILLER                           PIC X.
020000     03 FILLER PIC X(2) VALUE SPACE.
020100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
020200 01  CCVS-C-1.
020300     02 FILLER  PIC IS X(4)     VALUE SPACE.
020400     02 FILLER  PIC IS X(98)    VALUE IS "FEATURE               PA
020500-    "SS  PARAGRAPH-NAME
020600-    "       REMARKS".
020700     02 FILLER           PIC X(17)    VALUE SPACE.
020800 01  CCVS-C-2.
020900     02 FILLER           PIC XXXX     VALUE SPACE.
021000     02 FILLER           PIC X(6)     VALUE "TESTED".
021100     02 FILLER           PIC X(16)    VALUE SPACE.
021200     02 FILLER           PIC X(4)     VALUE "FAIL".
021300     02 FILLER           PIC X(90)    VALUE SPACE.
021400 01  REC-SKL-SUB       PIC 9(2)     VALUE ZERO.
021500 01  REC-CT            PIC 99       VALUE ZERO.
021600 01  DELETE-COUNTER    PIC 999      VALUE ZERO.
021700 01  ERROR-COUNTER     PIC 999      VALUE ZERO.
021800 01  INSPECT-COUNTER   PIC 999      VALUE ZERO.
021900 01  PASS-COUNTER      PIC 999      VALUE ZERO.
022000 01  TOTAL-ERROR       PIC 999      VALUE ZERO.
022100 01  ERROR-HOLD        PIC 999      VALUE ZERO.
022200 01  DUMMY-HOLD        PIC X(120)   VALUE SPACE.
022300 01  RECORD-COUNT      PIC 9(5)     VALUE ZERO.
022400 01  ANSI-REFERENCE    PIC X(48)    VALUE SPACES.
022500 01  CCVS-H-1.
022600     02  FILLER          PIC X(39)    VALUE SPACES.
022700     02  FILLER          PIC X(42)    VALUE
022800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
022900     02  FILLER          PIC X(39)    VALUE SPACES.
023000 01  CCVS-H-2A.
023100   02  FILLER            PIC X(40)  VALUE SPACE.
023200   02  FILLER            PIC X(7)   VALUE "CCVS85 ".
023300   02  FILLER            PIC XXXX   VALUE
023400     "4.2 ".
023500   02  FILLER            PIC X(28)  VALUE
023600            " COPY - NOT FOR DISTRIBUTION".
023700   02  FILLER            PIC X(41)  VALUE SPACE.
023800*
023900 01  CCVS-H-2B.
024000   02  FILLER            PIC X(15)  VALUE "TEST RESULT OF ".
024100   02  TEST-ID           PIC X(9).
024200   02  FILLER            PIC X(4)   VALUE " IN ".
024300   02  FILLER            PIC X(12)  VALUE
024400     " HIGH       ".
024500   02  FILLER            PIC X(22)  VALUE
024600            " LEVEL VALIDATION FOR ".
024700   02  FILLER            PIC X(58)  VALUE
024800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024900 01  CCVS-H-3.
025000     02  FILLER          PIC X(34)  VALUE
025100            " FOR OFFICIAL USE ONLY    ".
025200     02  FILLER          PIC X(58)  VALUE
025300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
025400     02  FILLER          PIC X(28)  VALUE
025500            "  COPYRIGHT   1985,1986 ".
025600 01  CCVS-E-1.
025700     02 FILLER           PIC X(52)  VALUE SPACE.
025800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
025900     02 ID-AGAIN         PIC X(9).
026000     02 FILLER           PIC X(45)  VALUE SPACES.
026100 01  CCVS-E-2.
026200     02  FILLER          PIC X(31)  VALUE SPACE.
026300     02  FILLER          PIC X(21)  VALUE SPACE.
026400     02  CCVS-E-2-2.
026500         03 ERROR-TOTAL    PIC XXX    VALUE SPACE.
026600         03 FILLER         PIC X      VALUE SPACE.
026700         03 ENDER-DESC     PIC X(44)  VALUE
026800            "ERRORS ENCOUNTERED".
026900 01  CCVS-E-3.
027000     02  FILLER          PIC X(22)  VALUE
027100            " FOR OFFICIAL USE ONLY".
027200     02  FILLER          PIC X(12)  VALUE SPACE.
027300     02  FILLER          PIC X(58)  VALUE
027400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027500     02  FILLER          PIC X(8)   VALUE SPACE.
027600     02  FILLER          PIC X(20)  VALUE
027700             " COPYRIGHT 1985,1986".
027800 01  CCVS-E-4.
027900     02 CCVS-E-4-1       PIC XXX    VALUE SPACE.
028000     02 FILLER           PIC X(4)   VALUE " OF ".
028100     02 CCVS-E-4-2       PIC XXX    VALUE SPACE.
028200     02 FILLER           PIC X(40)  VALUE
028300      "  TESTS WERE EXECUTED SUCCESSFULLY".
028400 01  XXINFO.
028500     02 FILLER           PIC X(19)  VALUE "*** INFORMATION ***".
028600     02 INFO-TEXT.
028700       04 FILLER             PIC X(8)   VALUE SPACE.
028800       04 XXCOMPUTED         PIC X(20).
028900       04 FILLER             PIC X(5)   VALUE SPACE.
029000       04 XXCORRECT          PIC X(20).
029100     02 INF-ANSI-REFERENCE PIC X(48).
029200 01  HYPHEN-LINE.
029300     02 FILLER  PIC IS X VALUE IS SPACE.
029400     02 FILLER  PIC IS X(65)    VALUE IS "************************
029500-    "*****************************************".
029600     02 FILLER  PIC IS X(54)    VALUE IS "************************
029700-    "******************************".
029800 01  CCVS-PGM-ID  PIC X(9)   VALUE
029900     "SQ129A".
030000*
030100*
030200 PROCEDURE DIVISION.
030300 DECLARATIVES.
030400 SQ129A-DECLARATIVE-001-SECT SECTION.
030500     USE AFTER STANDARD EXCEPTION PROCEDURE ON INPUT.
030600 INPUT-ERROR-PROCEDURE.
030700     IF DECL-EXEC-SW NOT = 9
030800         GO TO   NOT-DECL-9.
030900*
031000*    DECLARATIVE PROCEDURE ENTERED FROM OPEN INPUT
031100*
031200 DECL-OPEN-TEST.
031300     MOVE   "DECL-OPEN-TEST" TO PAR-NAME.
031400     MOVE    1               TO REC-CT.
031500     IF SQ-FS1-STATUS = "35"
031600         PERFORM DECL-PASS
031700     ELSE
031800         MOVE   "35"           TO CORRECT-A
031900         MOVE    SQ-FS1-STATUS TO COMPUTED-A
032000         MOVE   "INCORRECT FILE STATUS FOR NON-AVAILABLE FILE"
032100                   TO RE-MARK
032200         PERFORM DECL-FAIL.
032300     MOVE    SPACE TO DUMMY-RECORD
032400     PERFORM DECL-WRITE-LINE
032500     PERFORM DECL-WRITE-LINE 3 TIMES.
032600     GO TO   END-DECLS.
032700*
032800*
032900 NOT-DECL-9.
033000     MOVE   "NOT-DECL-9"  TO PAR-NAME.
033100     MOVE    DECL-EXEC-SW TO COMPUTED-18V0.
033200     MOVE    9            TO CORRECT-18V0.
033300     PERFORM DECL-FAIL.
033400     GO TO   END-DECLS.
033500*
033600*
033700*
033800 DECL-PASS.
033900     MOVE   "PASS " TO P-OR-F.
034000     ADD     1 TO PASS-COUNTER.
034100     PERFORM DECL-PRINT-DETAIL.
034200*
034300 DECL-FAIL.
034400     MOVE   "FAIL*" TO P-OR-F.
034500     ADD     1 TO ERROR-COUNTER.
034600     PERFORM DECL-PRINT-DETAIL.
034700*
034800 DECL-PRINT-DETAIL.
034900     IF REC-CT NOT EQUAL TO ZERO
035000             MOVE "." TO PARDOT-X
035100             MOVE REC-CT TO DOTVALUE.
035200     MOVE    TEST-RESULTS TO PRINT-REC.
035300     PERFORM DECL-WRITE-LINE.
035400     IF P-OR-F EQUAL TO "FAIL*"
035500         PERFORM DECL-WRITE-LINE
035600         PERFORM DECL-FAIL-ROUTINE THRU DECL-FAIL-EX
035700     ELSE
035800         PERFORM DECL-BAIL THRU DECL-BAIL-EX.
035900     MOVE    SPACE TO P-OR-F.
036000     MOVE    SPACE TO COMPUTED-X.
036100     MOVE    SPACE TO CORRECT-X.
036200     IF REC-CT EQUAL TO ZERO
036300         MOVE    SPACE TO PAR-NAME.
036400     MOVE    SPACE TO RE-MARK.
036500*
036600 DECL-WRITE-LINE.
036700     ADD     1 TO RECORD-COUNT.
036800Y    IF RECORD-COUNT GREATER 50
036900Y        MOVE    DUMMY-RECORD TO DUMMY-HOLD
037000Y        MOVE    SPACE TO DUMMY-RECORD
037100Y        WRITE   DUMMY-RECORD AFTER ADVANCING PAGE
037200Y        MOVE    CCVS-C-1 TO DUMMY-RECORD PERFORM DECL-WRT-LN
037300Y        MOVE    CCVS-C-2 TO DUMMY-RECORD
037400Y        PERFORM DECL-WRT-LN 2 TIMES
037500Y        MOVE    HYPHEN-LINE TO DUMMY-RECORD
037600Y        PERFORM DECL-WRT-LN
037700Y        MOVE    DUMMY-HOLD TO DUMMY-RECORD
037800Y        MOVE    ZERO TO RECORD-COUNT.
037900     PERFORM DECL-WRT-LN.
038000*
038100 DECL-WRT-LN.
038200     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
038300     MOVE    SPACE TO DUMMY-RECORD.
038400*
038500 DECL-FAIL-ROUTINE.
038600     IF COMPUTED-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
038700     IF CORRECT-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
038800     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
038900     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
039000     MOVE    XXINFO TO DUMMY-RECORD.
039100     PERFORM DECL-WRITE-LINE 2 TIMES.
039200     MOVE    SPACES TO INF-ANSI-REFERENCE.
039300     GO TO   DECL-FAIL-EX.
039400 DECL-FAIL-WRITE.
039500     MOVE    TEST-COMPUTED TO PRINT-REC
039600     PERFORM DECL-WRITE-LINE
039700     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
039800     MOVE    TEST-CORRECT TO PRINT-REC
039900     PERFORM DECL-WRITE-LINE 2 TIMES.
040000     MOVE    SPACES TO COR-ANSI-REFERENCE.
040100 DECL-FAIL-EX.
040200     EXIT.
040300*
040400 DECL-BAIL.
040500     IF COMPUTED-A NOT EQUAL TO SPACE GO TO DECL-BAIL-WRITE.
040600     IF CORRECT-A EQUAL TO SPACE GO TO DECL-BAIL-EX.
040700 DECL-BAIL-WRITE.
040800     MOVE    CORRECT-A TO XXCORRECT.
040900     MOVE    COMPUTED-A TO XXCOMPUTED.
041000     MOVE    XXINFO TO DUMMY-RECORD.
041100     PERFORM DECL-WRITE-LINE 2 TIMES.
041200 DECL-BAIL-EX.
041300     EXIT.
041400*
041500 END-DECLS.
041600     MOVE    ZERO TO DECL-EXEC-SW.
041700 END DECLARATIVES.
041800*
041900*
042000 CCVS1 SECTION.
042100 OPEN-FILES.
042200P    OPEN    I-O RAW-DATA.
042300P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
042400P    READ    RAW-DATA INVALID KEY GO TO END-E-1.
042500P    MOVE   "ABORTED "   TO C-ABORT.
042600P    ADD     1           TO C-NO-OF-TESTS.
042700P    ACCEPT  C-DATE      FROM DATE.
042800P    ACCEPT  C-TIME      FROM TIME.
042900P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
043000PEND-E-1.
043100P    CLOSE   RAW-DATA.
043200     OPEN    OUTPUT PRINT-FILE.
043300     MOVE    CCVS-PGM-ID TO TEST-ID.
043400     MOVE    CCVS-PGM-ID TO ID-AGAIN.
043500     MOVE    SPACE TO TEST-RESULTS.
043600     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
043700     MOVE    ZERO TO REC-SKEL-SUB.
043800     PERFORM CCVS-INIT-FILE 10 TIMES.
043900     GO TO CCVS1-EXIT.
044000*
044100 CCVS-INIT-FILE.
044200     ADD     1 TO REC-SKL-SUB.
044300     MOVE    FILE-RECORD-INFO-SKELETON TO
044400                  FILE-RECORD-INFO (REC-SKL-SUB).
044500*
044600 CLOSE-FILES.
044700     PERFORM END-ROUTINE THRU END-ROUTINE-13.
044800     CLOSE   PRINT-FILE.
044900P    OPEN    I-O RAW-DATA.
045000P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
045100P    READ    RAW-DATA INVALID KEY GO TO END-E-2.
045200P    MOVE   "OK.     " TO C-ABORT.
045300P    MOVE    PASS-COUNTER  TO C-OK.
045400P    MOVE    ERROR-HOLD    TO C-ALL.
045500P    MOVE    ERROR-COUNTER TO C-FAIL.
045600P    MOVE    DELETE-CNT    TO C-DELETED.
045700P    MOVE    INSPECT-COUNTER TO C-INSPECT.
045800P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
045900PEND-E-2.
046000P    CLOSE   RAW-DATA.
046100 TERMINATE-CCVS.
046200S    EXIT    PROGRAM.
046300     STOP    RUN.
046400*
046500 INSPT.
046600     MOVE   "INSPT" TO P-OR-F.
046700     ADD     1 TO INSPECT-COUNTER.
046800     PERFORM PRINT-DETAIL.
046900
047000 PASS.
047100     MOVE   "PASS " TO P-OR-F.
047200     ADD     1 TO PASS-COUNTER.
047300     PERFORM PRINT-DETAIL.
047400*
047500 FAIL.
047600     MOVE   "FAIL*" TO P-OR-F.
047700     ADD     1 TO ERROR-COUNTER.
047800     PERFORM PRINT-DETAIL.
047900*
048000 DE-LETE.
048100     MOVE   "****TEST DELETED****" TO RE-MARK.
048200     MOVE   "*****" TO P-OR-F.
048300     ADD     1 TO DELETE-COUNTER.
048400     PERFORM PRINT-DETAIL.
048500*
048600 PRINT-DETAIL.
048700     IF REC-CT NOT EQUAL TO ZERO
048800         MOVE   "." TO PARDOT-X
048900         MOVE    REC-CT TO DOTVALUE.
049000     MOVE    TEST-RESULTS TO PRINT-REC.
049100     PERFORM WRITE-LINE.
049200     IF P-OR-F EQUAL TO "FAIL*"
049300         PERFORM WRITE-LINE
049400         PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
049500     ELSE
049600         PERFORM BAIL-OUT THRU BAIL-OUT-EX.
049700     MOVE    SPACE TO P-OR-F.
049800     MOVE    SPACE TO COMPUTED-X.
049900     MOVE    SPACE TO CORRECT-X.
050000     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
050100     MOVE    SPACE TO RE-MARK.
050200*
050300 HEAD-ROUTINE.
050400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
050700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
050800 COLUMN-NAMES-ROUTINE.
050900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
051000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
051200 END-ROUTINE.
051300     MOVE    HYPHEN-LINE TO DUMMY-RECORD.
051400     PERFORM WRITE-LINE 5 TIMES.
051500 END-RTN-EXIT.
051600     MOVE    CCVS-E-1 TO DUMMY-RECORD.
051700     PERFORM WRITE-LINE 2 TIMES.
051800*
051900 END-ROUTINE-1.
052000     ADD     ERROR-COUNTER   TO ERROR-HOLD
052100     ADD     INSPECT-COUNTER TO ERROR-HOLD.
052200     ADD     DELETE-COUNTER  TO ERROR-HOLD.
052300     ADD     PASS-COUNTER    TO ERROR-HOLD.
052400     MOVE    PASS-COUNTER    TO CCVS-E-4-1.
052500     MOVE    ERROR-HOLD      TO CCVS-E-4-2.
052600     MOVE    CCVS-E-4        TO CCVS-E-2-2.
052700     MOVE    CCVS-E-2        TO DUMMY-RECORD
052800     PERFORM WRITE-LINE.
052900     MOVE   "TEST(S) FAILED" TO ENDER-DESC.
053000     IF ERROR-COUNTER IS EQUAL TO ZERO
053100         MOVE   "NO " TO ERROR-TOTAL
053200     ELSE
053300         MOVE    ERROR-COUNTER TO ERROR-TOTAL.
053400     MOVE    CCVS-E-2 TO DUMMY-RECORD.
053500     PERFORM WRITE-LINE.
053600 END-ROUTINE-13.
053700     IF DELETE-COUNTER IS EQUAL TO ZERO
053800         MOVE   "NO " TO ERROR-TOTAL
053900     ELSE
054000         MOVE    DELETE-COUNTER TO ERROR-TOTAL.
054100     MOVE   "TEST(S) DELETED     " TO ENDER-DESC.
054200     MOVE    CCVS-E-2 TO DUMMY-RECORD.
054300     PERFORM WRITE-LINE.
054400     IF INSPECT-COUNTER EQUAL TO ZERO
054500         MOVE   "NO " TO ERROR-TOTAL
054600     ELSE
054700         MOVE    INSPECT-COUNTER TO ERROR-TOTAL.
054800     MOVE   "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
054900     MOVE    CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055000     MOVE    CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055100*
055200 WRITE-LINE.
055300     ADD     1 TO RECORD-COUNT.
055400Y    IF RECORD-COUNT GREATER 50
055500Y        MOVE  DUMMY-RECORD TO DUMMY-HOLD
055600Y        MOVE  SPACE TO DUMMY-RECORD
055700Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
055800Y        MOVE  CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
055900Y        MOVE  CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
056000Y        MOVE  HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
056100Y        MOVE  DUMMY-HOLD TO DUMMY-RECORD
056200Y        MOVE  ZERO TO RECORD-COUNT.
056300     PERFORM WRT-LN.
056400*
056500 WRT-LN.
056600     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
056700     MOVE    SPACE TO DUMMY-RECORD.
056800 BLANK-LINE-PRINT.
056900     PERFORM WRT-LN.
057000 FAIL-ROUTINE.
057100     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057200     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057300     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
057400     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
057500     MOVE    XXINFO TO DUMMY-RECORD.
057600     PERFORM WRITE-LINE 2 TIMES.
057700     MOVE    SPACES TO INF-ANSI-REFERENCE.
057800     GO TO   FAIL-ROUTINE-EX.
057900 FAIL-ROUTINE-WRITE.
058000     MOVE    TEST-COMPUTED  TO PRINT-REC
058100     PERFORM WRITE-LINE
058200     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
058300     MOVE    TEST-CORRECT   TO PRINT-REC
058400     PERFORM WRITE-LINE 2 TIMES.
058500     MOVE    SPACES         TO COR-ANSI-REFERENCE.
058600 FAIL-ROUTINE-EX.
058700     EXIT.
058800 BAIL-OUT.
058900     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
059000     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
059100 BAIL-OUT-WRITE.
059200     MOVE    CORRECT-A      TO XXCORRECT.
059300     MOVE    COMPUTED-A     TO XXCOMPUTED.
059400     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
059500     MOVE    XXINFO TO DUMMY-RECORD.
059600     PERFORM WRITE-LINE 2 TIMES.
059700     MOVE    SPACES TO INF-ANSI-REFERENCE.
059800 BAIL-OUT-EX.
059900     EXIT.
060000 CCVS1-EXIT.
060100     EXIT.
060200*
060300****************************************************************
060400*                                                              *
060500*    THIS POINT MARKS THE END OF THE CCVS MONITOR ROUTINES AND *
060600*    THE START OF THE TESTS OF SPECIFIC COBOL FEATURES.        *
060700*                                                              *
060800****************************************************************
060900*
061000 SECT-SQ129A-MAIN SECTION.
061100 OPEN-INIT-01.
061200*
061300*    THIS PROGRAM ATTEMPTS TO OPEN A FILE WHICH IS NOT
061400*    PRESENT AND AVAILABLE TO IT.
061500*
061600     MOVE    1 TO REC-CT
061700     MOVE   "OPEN ABSENT FILE INPUT" TO FEATURE
061800     MOVE   "OPEN-TEST-01" TO PAR-NAME
061900     MOVE    9 TO DECL-EXEC-SW
062000     MOVE   "**" TO SQ-FS1-STATUS.
062100 OPEN-TEST-01.
062200     OPEN    INPUT SQ-FS1.
062300 CCVS-EXIT SECTION.
062400 CCVS-999999.
062500     GO TO   CLOSE-FILES.
