000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ148A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 3.0.                                 *
000900*                                                              *
001000*    CREATION DATE     /     VALIDATION DATE                   *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*            X-14   SEQUENTIAL MASS STORAGE FILE               *
001800*            X-55   SYSTEM PRINTER                             *
001900*            X-82   SOURCE-COMPUTER                            *
002000*            X-83   OBJECT-COMPUTER                            *
002100*            X-84   LABEL RECORDS OPTION.                      *
002200*                                                              *
002300****************************************************************
002400*                                                              *
002500*    THIS PROGRAM CHECKS FOR THE CORRECT RESPONSE TO READING   *
002600*    A FILE OPEN IN THE OUTPUT MODE.  THE TEST FOR CORRECT     *
002700*    I-O STATUS CODE 47 IS IN THE DECLARATIVES. AN ABNORMAL    *
002800*    TERMINATION IS POSSIBLE AFTER THE TEST OF THE I-O STATUS  *
002900*    CODE IS ACCOMPLISHED BUT BEFORE CONTROL IS RETURNED TO    *
003000*    THE MAIN LINE CODE.                                       *
003100*                                                              *
003200****************************************************************
003300*
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.
003700     XXXXX082.
003800 OBJECT-COMPUTER.
003900     XXXXX083.
004000*
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
004300     SELECT PRINT-FILE ASSIGN TO
004400     XXXXX055.
004500*
004600     SELECT SQ-FS4
004700            ASSIGN
004800     XXXXX014
004900            FILE STATUS SQ-FS4-STATUS
005000            ORGANIZATION IS SEQUENTIAL
005100            .
005200*
005300*
005400 DATA DIVISION.
005500 FILE SECTION.
005600 FD  PRINT-FILE
005700C    LABEL RECORDS
005800C    XXXXX084
005900C    DATA RECORD IS PRINT-REC DUMMY-RECORD
006000               .
006100 01  PRINT-REC    PICTURE X(120).
006200 01  DUMMY-RECORD PICTURE X(120).
006300*
006400 FD  SQ-FS4
006500C    LABEL RECORD IS STANDARD
006600     BLOCK  CONTAINS 120 CHARACTERS
006700     RECORD CONTAINS 120 CHARACTERS
006800                .
006900 01  SQ-FS4R1-F-G-120.
007000        05 FFILE-RECORD-INFO-P1-120.
007100           07 FILLER              PIC X(5).
007200           07 FFILE-NAME          PIC X(6).
007300           07 FILLER              PIC X(8).
007400           07 FRECORD-NAME        PIC X(6).
007500           07 FILLER              PIC X(1).
007600           07 FREELUNIT-NUMBER    PIC 9(1).
007700           07 FILLER              PIC X(7).
007800           07 FRECORD-NUMBER      PIC 9(6).
007900           07 FILLER              PIC X(6).
008000           07 FUPDATE-NUMBER      PIC 9(2).
008100           07 FILLER              PIC X(5).
008200           07 FODO-NUMBER         PIC 9(4).
008300           07 FILLER              PIC X(5).
008400           07 FPROGRAM-NAME       PIC X(5).
008500           07 FILLER              PIC X(7).
008600           07 FRECORD-LENGTH      PIC 9(6).
008700           07 FILLER              PIC X(7).
008800           07 FCHARS-OR-RECORDS   PIC X(2).
008900           07 FILLER              PIC X(1).
009000           07 FBLOCK-SIZE         PIC 9(4).
009100           07 FILLER              PIC X(6).
009200           07 FRECORDS-IN-FILE    PIC 9(6).
009300           07 FILLER              PIC X(5).
009400           07 FFILE-ORGANIZATION  PIC X(2).
009500           07 FILLER              PIC X(6).
009600           07 FLABEL-TYPE         PIC X(1).
009700*
009800 WORKING-STORAGE SECTION.
009900*
010000***************************************************************
010100*                                                             *
010200*    WORKING-STORAGE DATA ITEMS SPECIFIC TO THIS TEST SUITE   *
010300*                                                             *
010400***************************************************************
010500*
010600 01  STATUS-GROUP.
010700     04  SQ-FS4-STATUS.
010800         07  SQ-FS4-KEY-1   PIC X.
010900         07  SQ-FS4-KEY-2   PIC X.
011000*
011100***************************************************************
011200*                                                             *
011300*    WORKING-STORAGE DATA ITEMS USED BY THE CCVS              *
011400*                                                             *
011500***************************************************************
011600*
011700 01  REC-SKEL-SUB   PIC 99.
011800*
011900 01  FILE-RECORD-INFORMATION-REC.
012000     03 FILE-RECORD-INFO-SKELETON.
012100        05 FILLER                 PICTURE X(48)       VALUE
012200             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
012300        05 FILLER                 PICTURE X(46)       VALUE
012400             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
012500        05 FILLER                 PICTURE X(26)       VALUE
012600             ",LFIL=000000,ORG=  ,LBLR= ".
012700        05 FILLER                 PICTURE X(37)       VALUE
012800             ",RECKEY=                             ".
012900        05 FILLER                 PICTURE X(38)       VALUE
013000             ",ALTKEY1=                             ".
013100        05 FILLER                 PICTURE X(38)       VALUE
013200             ",ALTKEY2=                             ".
013300        05 FILLER                 PICTURE X(7)        VALUE SPACE.
013400     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
013500        05 FILE-RECORD-INFO-P1-120.
013600           07 FILLER              PIC X(5).
013700           07 XFILE-NAME          PIC X(6).
013800           07 FILLER              PIC X(8).
013900           07 XRECORD-NAME        PIC X(6).
014000           07 FILLER              PIC X(1).
014100           07 REELUNIT-NUMBER     PIC 9(1).
014200           07 FILLER              PIC X(7).
014300           07 XRECORD-NUMBER      PIC 9(6).
014400           07 FILLER              PIC X(6).
014500           07 UPDATE-NUMBER       PIC 9(2).
014600           07 FILLER              PIC X(5).
014700           07 ODO-NUMBER          PIC 9(4).
014800           07 FILLER              PIC X(5).
014900           07 XPROGRAM-NAME       PIC X(5).
015000           07 FILLER              PIC X(7).
015100           07 XRECORD-LENGTH      PIC 9(6).
015200           07 FILLER              PIC X(7).
015300           07 CHARS-OR-RECORDS    PIC X(2).
015400           07 FILLER              PIC X(1).
015500           07 XBLOCK-SIZE         PIC 9(4).
015600           07 FILLER              PIC X(6).
015700           07 RECORDS-IN-FILE     PIC 9(6).
015800           07 FILLER              PIC X(5).
015900           07 XFILE-ORGANIZATION  PIC X(2).
016000           07 FILLER              PIC X(6).
016100           07 XLABEL-TYPE         PIC X(1).
016200        05 FILE-RECORD-INFO-P121-240.
016300           07 FILLER              PIC X(8).
016400           07 XRECORD-KEY         PIC X(29).
016500           07 FILLER              PIC X(9).
016600           07 ALTERNATE-KEY1      PIC X(29).
016700           07 FILLER              PIC X(9).
016800           07 ALTERNATE-KEY2      PIC X(29).
016900           07 FILLER              PIC X(7).
017000*
017100 01  TEST-RESULTS.
017200     02 FILLER              PIC X      VALUE SPACE.
017300     02  PAR-NAME.
017400       03 FILLER              PIC X(14)  VALUE SPACE.
017500       03 PARDOT-X            PIC X      VALUE SPACE.
017600       03 DOTVALUE            PIC 99     VALUE ZERO.
017700     02 FILLER              PIC X      VALUE SPACE.
017800     02 FEATURE             PIC X(24)  VALUE SPACE.
017900     02 FILLER              PIC X      VALUE SPACE.
018000     02 P-OR-F              PIC X(5)   VALUE SPACE.
018100     02 FILLER              PIC X(9)   VALUE SPACE.
018200     02 RE-MARK             PIC X(61).
018300 01  TEST-COMPUTED.
018400   02 FILLER  PIC X(30)  VALUE SPACE.
018500   02 FILLER  PIC X(17)  VALUE "      COMPUTED =".
018600   02 COMPUTED-X.
018700     03 COMPUTED-A    PIC X(20)  VALUE SPACE.
018800     03 COMPUTED-N    REDEFINES COMPUTED-A PIC -9(9).9(9).
018900     03 COMPUTED-0V18 REDEFINES COMPUTED-A PIC -.9(18).
019000     03 COMPUTED-4V14 REDEFINES COMPUTED-A PIC -9(4).9(14).
019100     03 COMPUTED-14V4 REDEFINES COMPUTED-A PIC -9(14).9(4).
019200     03       CM-18V0 REDEFINES COMPUTED-A.
019300        04 COMPUTED-18V0                   PIC -9(18).
019400        04 FILLER                          PIC X.
019500     03 FILLER PIC X(50) VALUE SPACE.
019600 01  TEST-CORRECT.
019700     02 FILLER PIC X(30) VALUE SPACE.
019800     02 FILLER PIC X(17) VALUE "       CORRECT =".
019900     02 CORRECT-X.
020000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
020200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
020400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
020500     03      CR-18V0 REDEFINES CORRECT-A.
020600         04 CORRECT-18V0                     PIC -9(18).
020700         04 FILLER                           PIC X.
020800     03 FILLER PIC X(2) VALUE SPACE.
020900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021000*
021100 01  CCVS-C-1.
021200     02 FILLER  PIC IS X        VALUE  SPACE.
021300     02 FILLER  PIC IS X(17)    VALUE "PARAGRAPH-NAME".
021400     02 FILLER  PIC IS X        VALUE  SPACE.
021500     02 FILLER  PIC IS X(24)    VALUE IS "FEATURE".
021600     02 FILLER  PIC IS X        VALUE  SPACE.
021700     02 FILLER  PIC IS X(5)     VALUE "PASS ".
021800     02 FILLER  PIC IS X(9)     VALUE  SPACE.
021900     02 FILLER  PIC IS X(62)    VALUE "REMARKS".
022000 01  CCVS-C-2.
022100     02 FILLER  PIC X(19)  VALUE  SPACE.
022200     02 FILLER  PIC X(6)   VALUE "TESTED".
022300     02 FILLER  PIC X(19)  VALUE  SPACE.
022400     02 FILLER  PIC X(4)   VALUE "FAIL".
022500     02 FILLER  PIC X(72)  VALUE  SPACE.
022600*
022700 01  REC-SKL-SUB       PIC 9(2)     VALUE ZERO.
022800 01  REC-CT            PIC 99       VALUE ZERO.
022900 01  DELETE-COUNTER    PIC 999      VALUE ZERO.
023000 01  ERROR-COUNTER     PIC 999      VALUE ZERO.
023100 01  INSPECT-COUNTER   PIC 999      VALUE ZERO.
023200 01  PASS-COUNTER      PIC 999      VALUE ZERO.
023300 01  TOTAL-ERROR       PIC 999      VALUE ZERO.
023400 01  ERROR-HOLD        PIC 999      VALUE ZERO.
023500 01  DUMMY-HOLD        PIC X(120)   VALUE SPACE.
023600 01  RECORD-COUNT      PIC 9(5)     VALUE ZERO.
023700 01  ANSI-REFERENCE    PIC X(48)    VALUE SPACES.
023800 01  CCVS-H-1.
023900     02  FILLER          PIC X(39)    VALUE SPACES.
024000     02  FILLER          PIC X(42)    VALUE
024100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024200     02  FILLER          PIC X(39)    VALUE SPACES.
024300 01  CCVS-H-2A.
024400   02  FILLER            PIC X(40)  VALUE SPACE.
024500   02  FILLER            PIC X(7)   VALUE "CCVS85 ".
024600   02  FILLER            PIC XXXX   VALUE
024700     "4.2 ".
024800   02  FILLER            PIC X(28)  VALUE
024900            " COPY - NOT FOR DISTRIBUTION".
025000   02  FILLER            PIC X(41)  VALUE SPACE.
025100*
025200 01  CCVS-H-2B.
025300   02  FILLER            PIC X(15)  VALUE "TEST RESULT OF ".
025400   02  TEST-ID           PIC X(9).
025500   02  FILLER            PIC X(4)   VALUE " IN ".
025600   02  FILLER            PIC X(12)  VALUE
025700     " HIGH       ".
025800   02  FILLER            PIC X(22)  VALUE
025900            " LEVEL VALIDATION FOR ".
026000   02  FILLER            PIC X(58)  VALUE
026100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026200 01  CCVS-H-3.
026300     02  FILLER          PIC X(34)  VALUE
026400            " FOR OFFICIAL USE ONLY    ".
026500     02  FILLER          PIC X(58)  VALUE
026600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026700     02  FILLER          PIC X(28)  VALUE
026800            "  COPYRIGHT   1985,1986 ".
026900 01  CCVS-E-1.
027000     02 FILLER           PIC X(52)  VALUE SPACE.
027100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027200     02 ID-AGAIN         PIC X(9).
027300     02 FILLER           PIC X(45)  VALUE SPACES.
027400 01  CCVS-E-2.
027500     02  FILLER          PIC X(31)  VALUE SPACE.
027600     02  FILLER          PIC X(21)  VALUE SPACE.
027700     02  CCVS-E-2-2.
027800         03 ERROR-TOTAL    PIC XXX    VALUE SPACE.
027900         03 FILLER         PIC X      VALUE SPACE.
028000         03 ENDER-DESC     PIC X(44)  VALUE
028100            "ERRORS ENCOUNTERED".
028200 01  CCVS-E-3.
028300     02  FILLER          PIC X(22)  VALUE
028400            " FOR OFFICIAL USE ONLY".
028500     02  FILLER          PIC X(12)  VALUE SPACE.
028600     02  FILLER          PIC X(58)  VALUE
028700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028800     02  FILLER          PIC X(8)   VALUE SPACE.
028900     02  FILLER          PIC X(20)  VALUE
029000             " COPYRIGHT 1985,1986".
029100 01  CCVS-E-4.
029200     02 CCVS-E-4-1       PIC XXX    VALUE SPACE.
029300     02 FILLER           PIC X(4)   VALUE " OF ".
029400     02 CCVS-E-4-2       PIC XXX    VALUE SPACE.
029500     02 FILLER           PIC X(40)  VALUE
029600      "  TESTS WERE EXECUTED SUCCESSFULLY".
029700 01  XXINFO.
029800     02 FILLER           PIC X(19)  VALUE "*** INFORMATION ***".
029900     02 INFO-TEXT.
030000       04 FILLER             PIC X(8)   VALUE SPACE.
030100       04 XXCOMPUTED         PIC X(20).
030200       04 FILLER             PIC X(5)   VALUE SPACE.
030300       04 XXCORRECT          PIC X(20).
030400     02 INF-ANSI-REFERENCE PIC X(48).
030500 01  HYPHEN-LINE.
030600     02 FILLER  PIC IS X VALUE IS SPACE.
030700     02 FILLER  PIC IS X(65)    VALUE IS "************************
030800-    "*****************************************".
030900     02 FILLER  PIC IS X(54)    VALUE IS "************************
031000-    "******************************".
031100 01  CCVS-PGM-ID  PIC X(9)   VALUE
031200     "SQ148A".
031300*
031400*
031500 PROCEDURE DIVISION.
031600 DECLARATIVES.
031700*
031800 SQ148A-DECLARATIVE-001-SECT SECTION.
031900     USE AFTER STANDARD EXCEPTION PROCEDURE OUTPUT.
032000 READ-ERROR-PROCESS.
032100     IF  SQ-FS4-STATUS = "47"
032200             PERFORM DECL-PASS
032300             GO TO DECL-ABNORMAL-TERM
032400     ELSE
032500             MOVE "47" TO CORRECT-A
032600             MOVE SQ-FS4-STATUS TO COMPUTED-A
032700             MOVE "STATUS FOR READ OF FILE OPEN OUTPUT INCORRECT"
032800                     TO RE-MARK
032900             MOVE "VII-5, 1.3.5(4)F" TO ANSI-REFERENCE
033000             PERFORM DECL-FAIL
033100             GO TO DECL-ABNORMAL-TERM
033200     END-IF.
033300*
033400 DECL-PASS.
033500     MOVE   "PASS " TO P-OR-F.
033600     ADD     1 TO PASS-COUNTER.
033700     PERFORM DECL-PRINT-DETAIL.
033800*
033900 DECL-FAIL.
034000     MOVE   "FAIL*" TO P-OR-F.
034100     ADD     1 TO ERROR-COUNTER.
034200     PERFORM DECL-PRINT-DETAIL.
034300*
034400 DECL-DE-LETE.
034500     MOVE   "****TEST DELETED****" TO RE-MARK.
034600     MOVE   "*****" TO P-OR-F.
034700     ADD     1 TO DELETE-COUNTER.
034800     PERFORM DECL-PRINT-DETAIL.
034900*
035000 DECL-PRINT-DETAIL.
035100     IF REC-CT NOT EQUAL TO ZERO
035200             MOVE "." TO PARDOT-X
035300             MOVE REC-CT TO DOTVALUE.
035400     MOVE    TEST-RESULTS TO PRINT-REC.
035500     PERFORM DECL-WRITE-LINE.
035600     IF P-OR-F EQUAL TO "FAIL*"
035700         PERFORM DECL-WRITE-LINE
035800         PERFORM DECL-FAIL-ROUTINE THRU DECL-FAIL-EX
035900     ELSE
036000         PERFORM DECL-BAIL THRU DECL-BAIL-EX.
036100     MOVE    SPACE TO P-OR-F.
036200     MOVE    SPACE TO COMPUTED-X.
036300     MOVE    SPACE TO CORRECT-X.
036400     IF REC-CT EQUAL TO ZERO
036500         MOVE    SPACE TO PAR-NAME.
036600     MOVE    SPACE TO RE-MARK.
036700*
036800 DECL-WRITE-LINE.
036900     ADD     1 TO RECORD-COUNT.
037000Y    IF RECORD-COUNT GREATER 50
037100Y        MOVE    DUMMY-RECORD TO DUMMY-HOLD
037200Y        MOVE    SPACE TO DUMMY-RECORD
037300Y        WRITE   DUMMY-RECORD AFTER ADVANCING PAGE
037400Y        MOVE    CCVS-C-1 TO DUMMY-RECORD PERFORM DECL-WRT-LN
037500Y        MOVE    CCVS-C-2 TO DUMMY-RECORD
037600Y        PERFORM DECL-WRT-LN 2 TIMES
037700Y        MOVE    HYPHEN-LINE TO DUMMY-RECORD
037800Y        PERFORM DECL-WRT-LN
037900Y        MOVE    DUMMY-HOLD TO DUMMY-RECORD
038000Y        MOVE    ZERO TO RECORD-COUNT.
038100     PERFORM DECL-WRT-LN.
038200*
038300 DECL-WRT-LN.
038400     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
038500     MOVE    SPACE TO DUMMY-RECORD.
038600*
038700 DECL-FAIL-ROUTINE.
038800     IF COMPUTED-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
038900     IF CORRECT-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
039000     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
039100     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
039200     MOVE    XXINFO TO DUMMY-RECORD.
039300     PERFORM DECL-WRITE-LINE 2 TIMES.
039400     MOVE    SPACES TO INF-ANSI-REFERENCE.
039500     GO TO   DECL-FAIL-EX.
039600 DECL-FAIL-WRITE.
039700     MOVE    TEST-COMPUTED TO PRINT-REC
039800     PERFORM DECL-WRITE-LINE
039900     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
040000     MOVE    TEST-CORRECT TO PRINT-REC
040100     PERFORM DECL-WRITE-LINE 2 TIMES.
040200     MOVE    SPACES TO COR-ANSI-REFERENCE.
040300 DECL-FAIL-EX.
040400     EXIT.
040500*
040600 DECL-BAIL.
040700     IF COMPUTED-A NOT EQUAL TO SPACE GO TO DECL-BAIL-WRITE.
040800     IF CORRECT-A EQUAL TO SPACE GO TO DECL-BAIL-EX.
040900 DECL-BAIL-WRITE.
041000     MOVE    CORRECT-A TO XXCORRECT.
041100     MOVE    COMPUTED-A TO XXCOMPUTED.
041200     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041300     MOVE    XXINFO TO DUMMY-RECORD.
041400     PERFORM DECL-WRITE-LINE 2 TIMES.
041500     MOVE    SPACE TO INF-ANSI-REFERENCE.
041600 DECL-BAIL-EX.
041700     EXIT.
041800*
041900 DECL-ABNORMAL-TERM.
042000     MOVE SPACE TO DUMMY-RECORD.
042100     PERFORM DECL-WRITE-LINE.
042200     MOVE "ABNORMAL TERMINATION AT THIS POINT IS ACCEPTABLE"
042300             TO DUMMY-RECORD.
042400     PERFORM DECL-WRITE-LINE 3 TIMES.
042500*
042600 END-DECLS.
042700     EXIT.
042800 END DECLARATIVES.
042900*
043000*
043100 CCVS1 SECTION.
043200 OPEN-FILES.
043300     OPEN    OUTPUT PRINT-FILE.
043400     MOVE    CCVS-PGM-ID TO TEST-ID.
043500     MOVE    CCVS-PGM-ID TO ID-AGAIN.
043600     MOVE    SPACE TO TEST-RESULTS.
043700     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
043800     MOVE    ZERO TO REC-SKEL-SUB.
043900     PERFORM CCVS-INIT-FILE 10 TIMES.
044000     GO TO CCVS1-EXIT.
044100*
044200 CCVS-INIT-FILE.
044300     ADD     1 TO REC-SKL-SUB.
044400     MOVE    FILE-RECORD-INFO-SKELETON TO
044500                  FILE-RECORD-INFO (REC-SKL-SUB).
044600*
044700 CLOSE-FILES.
044800     PERFORM END-ROUTINE THRU END-ROUTINE-13.
044900     CLOSE   PRINT-FILE.
045000 TERMINATE-CCVS.
045100     STOP    RUN.
045200*
045300 INSPT.
045400     MOVE   "INSPT" TO P-OR-F.
045500     ADD     1 TO INSPECT-COUNTER.
045600     PERFORM PRINT-DETAIL.
045700*
045800 PASS.
045900     MOVE   "PASS " TO P-OR-F.
046000     ADD     1 TO PASS-COUNTER.
046100     PERFORM PRINT-DETAIL.
046200*
046300 FAIL.
046400     MOVE   "FAIL*" TO P-OR-F.
046500     ADD     1 TO ERROR-COUNTER.
046600     PERFORM PRINT-DETAIL.
046700*
046800 DE-LETE.
046900     MOVE   "****TEST DELETED****" TO RE-MARK.
047000     MOVE   "*****" TO P-OR-F.
047100     ADD     1 TO DELETE-COUNTER.
047200     PERFORM PRINT-DETAIL.
047300*
047400 PRINT-DETAIL.
047500     IF REC-CT NOT EQUAL TO ZERO
047600         MOVE   "." TO PARDOT-X
047700         MOVE    REC-CT TO DOTVALUE.
047800     MOVE    TEST-RESULTS TO PRINT-REC.
047900     PERFORM WRITE-LINE.
048000     IF P-OR-F EQUAL TO "FAIL*"
048100         PERFORM WRITE-LINE
048200         PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
048300     ELSE
048400         PERFORM BAIL-OUT THRU BAIL-OUT-EX.
048500     MOVE    SPACE TO P-OR-F.
048600     MOVE    SPACE TO COMPUTED-X.
048700     MOVE    SPACE TO CORRECT-X.
048800     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
048900     MOVE    SPACE TO RE-MARK.
049000*
049100 HEAD-ROUTINE.
049200     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049300     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049400     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
049500     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
049600 COLUMN-NAMES-ROUTINE.
049700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
050000 END-ROUTINE.
050100     MOVE    HYPHEN-LINE TO DUMMY-RECORD.
050200     PERFORM WRITE-LINE 5 TIMES.
050300 END-RTN-EXIT.
050400     MOVE    CCVS-E-1 TO DUMMY-RECORD.
050500     PERFORM WRITE-LINE 2 TIMES.
050600*
050700 END-ROUTINE-1.
050800     ADD     ERROR-COUNTER   TO ERROR-HOLD
050900     ADD     INSPECT-COUNTER TO ERROR-HOLD.
051000     ADD     DELETE-COUNTER  TO ERROR-HOLD.
051100     ADD     PASS-COUNTER    TO ERROR-HOLD.
051200     MOVE    PASS-COUNTER    TO CCVS-E-4-1.
051300     MOVE    ERROR-HOLD      TO CCVS-E-4-2.
051400     MOVE    CCVS-E-4        TO CCVS-E-2-2.
051500     MOVE    CCVS-E-2        TO DUMMY-RECORD
051600     PERFORM WRITE-LINE.
051700     MOVE   "TEST(S) FAILED" TO ENDER-DESC.
051800     IF ERROR-COUNTER IS EQUAL TO ZERO
051900         MOVE   "NO " TO ERROR-TOTAL
052000     ELSE
052100         MOVE    ERROR-COUNTER TO ERROR-TOTAL.
052200     MOVE    CCVS-E-2 TO DUMMY-RECORD.
052300     PERFORM WRITE-LINE.
052400 END-ROUTINE-13.
052500     IF DELETE-COUNTER IS EQUAL TO ZERO
052600         MOVE   "NO " TO ERROR-TOTAL
052700     ELSE
052800         MOVE    DELETE-COUNTER TO ERROR-TOTAL.
052900     MOVE   "TEST(S) DELETED     " TO ENDER-DESC.
053000     MOVE    CCVS-E-2 TO DUMMY-RECORD.
053100     PERFORM WRITE-LINE.
053200     IF INSPECT-COUNTER EQUAL TO ZERO
053300         MOVE   "NO " TO ERROR-TOTAL
053400     ELSE
053500         MOVE    INSPECT-COUNTER TO ERROR-TOTAL.
053600     MOVE   "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
053700     MOVE    CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
053800     MOVE    CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
053900*
054000 WRITE-LINE.
054100     ADD     1 TO RECORD-COUNT.
054200Y    IF RECORD-COUNT GREATER 50
054300Y        MOVE  DUMMY-RECORD TO DUMMY-HOLD
054400Y        MOVE  SPACE TO DUMMY-RECORD
054500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
054600Y        MOVE  CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
054700Y        MOVE  CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
054800Y        MOVE  HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
054900Y        MOVE  DUMMY-HOLD TO DUMMY-RECORD
055000Y        MOVE  ZERO TO RECORD-COUNT.
055100     PERFORM WRT-LN.
055200*
055300 WRT-LN.
055400     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
055500     MOVE    SPACE TO DUMMY-RECORD.
055600 BLANK-LINE-PRINT.
055700     PERFORM WRT-LN.
055800 FAIL-ROUTINE.
055900     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
056000     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
056100     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
056200     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
056300     MOVE    XXINFO TO DUMMY-RECORD.
056400     PERFORM WRITE-LINE 2 TIMES.
056500     MOVE    SPACES TO INF-ANSI-REFERENCE.
056600     GO TO   FAIL-ROUTINE-EX.
056700 FAIL-ROUTINE-WRITE.
056800     MOVE    TEST-COMPUTED  TO PRINT-REC
056900     PERFORM WRITE-LINE
057000     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
057100     MOVE    TEST-CORRECT   TO PRINT-REC
057200     PERFORM WRITE-LINE 2 TIMES.
057300     MOVE    SPACES         TO COR-ANSI-REFERENCE.
057400 FAIL-ROUTINE-EX.
057500     EXIT.
057600 BAIL-OUT.
057700     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
057800     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
057900 BAIL-OUT-WRITE.
058000     MOVE    CORRECT-A      TO XXCORRECT.
058100     MOVE    COMPUTED-A     TO XXCOMPUTED.
058200     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
058300     MOVE    XXINFO TO DUMMY-RECORD.
058400     PERFORM WRITE-LINE 2 TIMES.
058500     MOVE    SPACES TO INF-ANSI-REFERENCE.
058600 BAIL-OUT-EX.
058700     EXIT.
058800 CCVS1-EXIT.
058900     EXIT.
059000*
059100****************************************************************
059200*                                                              *
059300*    THIS POINT MARKS THE END OF THE CCVS MONITOR ROUTINES AND *
059400*    THE START OF THE TESTS OF SPECIFIC COBOL FEATURES.        *
059500*                                                              *
059600****************************************************************
059700*
059800 SECT-SQ148A-0002 SECTION.
059900 STA-INIT.
060000*
060100     MOVE   "SQ-FS4" TO XFILE-NAME (1).
060200     MOVE   "R1-F-G" TO XRECORD-NAME (1).
060300     MOVE    CCVS-PGM-ID TO XPROGRAM-NAME (1).
060400     MOVE    120 TO XRECORD-LENGTH (1).
060500     MOVE   "CC" TO CHARS-OR-RECORDS (1).
060600     MOVE    1   TO XBLOCK-SIZE (1).
060700     MOVE    1   TO RECORDS-IN-FILE (1).
060800     MOVE   "SQ" TO XFILE-ORGANIZATION (1).
060900     MOVE   "S"  TO XLABEL-TYPE (1).
061000*
061100*    OPEN THE FILE IN THE OUTPUT MODE
061200*
061300 SEQ-INIT-01.
061400     MOVE    1 TO REC-CT.
061500     MOVE   "**" TO SQ-FS4-STATUS.
061600     MOVE    ZERO TO XRECORD-NUMBER (1).
061700     MOVE   "OPEN, CREATE FILE"  TO FEATURE.
061800     MOVE   "SEQ-TEST-OP-01" TO PAR-NAME.
061900 SEQ-TEST-OP-01.
062000     OPEN    OUTPUT SQ-FS4.
062100*
062200*    CHECK I-O STATUS RETURNED FROM OPEN OUTPUT
062300*
062400 SEQ-TEST-OP-01-01.
062500     IF SQ-FS4-STATUS = "00"
062600         PERFORM PASS
062700     ELSE
062800         MOVE    SQ-FS4-STATUS TO COMPUTED-A
062900         MOVE   "00" TO CORRECT-A
063000         MOVE   "UNEXPECTED ERROR CODE FROM OPEN OUTPUT"
063100                   TO RE-MARK
063200         MOVE   "VII-3, VII-43" TO ANSI-REFERENCE
063300         PERFORM FAIL.
063400 SEQ-TEST-01-01-END.
063500*
063600*
063700*    A NEW FILE IS OPEN.  WE NOW ATTEMPT TO READ A RECORD.
063800*
063900 SEQ-INIT-02.
064000     MOVE    1 TO REC-CT.
064100     MOVE   "**" TO SQ-FS4-STATUS.
064200     MOVE   "READ IN OUTPUT MODE" TO FEATURE.
064300     MOVE   "SEQ-TEST-RD-02" TO PAR-NAME.
064400 SEQ-TEST-RD-02.
064500     READ    SQ-FS4.
064600*
064700 CLOSE-TEST-03.
064800     CLOSE SQ-FS4.
064900*
065000 CCVS-EXIT SECTION.
065100 CCVS-999999.
065200     GO TO   CLOSE-FILES.
