000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ146A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 3.0.                                 *
000900*                                                              *
001000*    CREATION DATE     /     VALIDATION DATE                   *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300****************************************************************
001400*                                                              *
001500*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001600*                                                              *
001700*            X-01   SEQUENTIAL TAPE                            *
001800*            X-55   SYSTEM PRINTER                             *
001900*            X-82   SOURCE-COMPUTER                            *
002000*            X-83   OBJECT-COMPUTER.                           *
002100*            X-84   LABEL RECORDS OPTION                       *
002200*                                                              *
002300****************************************************************
002400*                                                              *
002500*    THIS PROGRAM CHECKS FOR THE CORRECT RESPONSE TO CLOSE OF  *
002600*    AN ALREADY CLOSED FILE.  THE TEST FOR CORRECT I-O STATUS  *
002700*    CODE 42 IS IN THE MAIN LINE CODE, THEREFORE AN ABNORMAL   *
002800*    TERMINATION IS POSSIBLE BEFORE THE TEST OF THE I-O STATUS *
002900*    CODE IS ACCOMPLISHED.                                     *
003000*                                                              *
003100****************************************************************
003200*
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.
003600     XXXXX082.
003700 OBJECT-COMPUTER.
003800     XXXXX083.
003900*
004000 INPUT-OUTPUT SECTION.
004100 FILE-CONTROL.
004200     SELECT PRINT-FILE ASSIGN TO
004300     XXXXX055.
004400*
004500     SELECT SQ-FS1 ASSIGN TO
004600     XXXXX001
004700            FILE STATUS IS SQ-FS1-STATUS.
004800*
004900*
005000 DATA DIVISION.
005100 FILE SECTION.
005200 FD  PRINT-FILE
005300C    LABEL RECORDS
005400C    XXXXX084
005500C    DATA RECORD IS PRINT-REC DUMMY-RECORD
005600               .
005700 01  PRINT-REC    PICTURE X(120).
005800 01  DUMMY-RECORD PICTURE X(120).
005900*
006000 FD  SQ-FS1
006100C    LABEL RECORD IS STANDARD
006200                .
006300 01  SQ-FS1R1-F-G-120 PIC X(120).
006400*
006500 WORKING-STORAGE SECTION.
006600*
006700***************************************************************
006800*                                                             *
006900*    WORKING-STORAGE DATA ITEMS SPECIFIC TO THIS TEST SUITE   *
007000*                                                             *
007100***************************************************************
007200*
007300 01  SQ-FS1-STATUS.
007400   03  SQ-FS1-KEY-1   PIC X.
007500   03  SQ-FS1-KEY-2   PIC X.
007600*
007700 01  DECL-EXEC-SW   PIC 9.
007800*
007900***************************************************************
008000*                                                             *
008100*    WORKING-STORAGE DATA ITEMS USED BY THE CCVS              *
008200*                                                             *
008300***************************************************************
008400*
008500 01  REC-SKEL-SUB   PIC 99.
008600*
008700 01  FILE-RECORD-INFORMATION-REC.
008800     03 FILE-RECORD-INFO-SKELETON.
008900        05 FILLER                 PICTURE X(48)       VALUE
009000             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
009100        05 FILLER                 PICTURE X(46)       VALUE
009200             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
009300        05 FILLER                 PICTURE X(26)       VALUE
009400             ",LFIL=000000,ORG=  ,LBLR= ".
009500        05 FILLER                 PICTURE X(37)       VALUE
009600             ",RECKEY=                             ".
009700        05 FILLER                 PICTURE X(38)       VALUE
009800             ",ALTKEY1=                             ".
009900        05 FILLER                 PICTURE X(38)       VALUE
010000             ",ALTKEY2=                             ".
010100        05 FILLER                 PICTURE X(7)        VALUE SPACE.
010200     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
010300        05 FILE-RECORD-INFO-P1-120.
010400           07 FILLER              PIC X(5).
010500           07 XFILE-NAME          PIC X(6).
010600           07 FILLER              PIC X(8).
010700           07 XRECORD-NAME        PIC X(6).
010800           07 FILLER              PIC X(1).
010900           07 REELUNIT-NUMBER     PIC 9(1).
011000           07 FILLER              PIC X(7).
011100           07 XRECORD-NUMBER      PIC 9(6).
011200           07 FILLER              PIC X(6).
011300           07 UPDATE-NUMBER       PIC 9(2).
011400           07 FILLER              PIC X(5).
011500           07 ODO-NUMBER          PIC 9(4).
011600           07 FILLER              PIC X(5).
011700           07 XPROGRAM-NAME       PIC X(5).
011800           07 FILLER              PIC X(7).
011900           07 XRECORD-LENGTH      PIC 9(6).
012000           07 FILLER              PIC X(7).
012100           07 CHARS-OR-RECORDS    PIC X(2).
012200           07 FILLER              PIC X(1).
012300           07 XBLOCK-SIZE         PIC 9(4).
012400           07 FILLER              PIC X(6).
012500           07 RECORDS-IN-FILE     PIC 9(6).
012600           07 FILLER              PIC X(5).
012700           07 XFILE-ORGANIZATION  PIC X(2).
012800           07 FILLER              PIC X(6).
012900           07 XLABEL-TYPE         PIC X(1).
013000        05 FILE-RECORD-INFO-P121-240.
013100           07 FILLER              PIC X(8).
013200           07 XRECORD-KEY         PIC X(29).
013300           07 FILLER              PIC X(9).
013400           07 ALTERNATE-KEY1      PIC X(29).
013500           07 FILLER              PIC X(9).
013600           07 ALTERNATE-KEY2      PIC X(29).
013700           07 FILLER              PIC X(7).
013800*
013900 01  TEST-RESULTS.
014000     02 FILLER              PIC X      VALUE SPACE.
014100     02 FEATURE             PIC X(24)  VALUE SPACE.
014200     02 FILLER              PIC X      VALUE SPACE.
014300     02 P-OR-F              PIC X(5)   VALUE SPACE.
014400     02 FILLER              PIC X      VALUE SPACE.
014500     02  PAR-NAME.
014600       03 FILLER              PIC X(14)  VALUE SPACE.
014700       03 PARDOT-X            PIC X      VALUE SPACE.
014800       03 DOTVALUE            PIC 99     VALUE ZERO.
014900     02 FILLER              PIC X(9)   VALUE SPACE.
015000     02 RE-MARK             PIC X(61).
015100 01  TEST-COMPUTED.
015200   02 FILLER  PIC X(30)  VALUE SPACE.
015300   02 FILLER  PIC X(17)  VALUE "      COMPUTED =".
015400   02 COMPUTED-X.
015500     03 COMPUTED-A    PIC X(20)  VALUE SPACE.
015600     03 COMPUTED-N    REDEFINES COMPUTED-A PIC -9(9).9(9).
015700     03 COMPUTED-0V18 REDEFINES COMPUTED-A PIC -.9(18).
015800     03 COMPUTED-4V14 REDEFINES COMPUTED-A PIC -9(4).9(14).
015900     03 COMPUTED-14V4 REDEFINES COMPUTED-A PIC -9(14).9(4).
016000     03       CM-18V0 REDEFINES COMPUTED-A.
016100        04 COMPUTED-18V0                   PIC -9(18).
016200        04 FILLER                          PIC X.
016300     03 FILLER PIC X(50) VALUE SPACE.
016400 01  TEST-CORRECT.
016500     02 FILLER PIC X(30) VALUE SPACE.
016600     02 FILLER PIC X(17) VALUE "       CORRECT =".
016700     02 CORRECT-X.
016800     03 CORRECT-A                  PIC X(20) VALUE SPACE.
016900     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
017000     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
017100     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
017200     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
017300     03      CR-18V0 REDEFINES CORRECT-A.
017400         04 CORRECT-18V0                     PIC -9(18).
017500         04 FILLER                           PIC X.
017600     03 FILLER PIC X(2) VALUE SPACE.
017700     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
017800 01  CCVS-C-1.
017900     02 FILLER  PIC IS X(4)     VALUE SPACE.
018000     02 FILLER  PIC IS X(98)    VALUE IS "FEATURE               PA
018100-    "SS  PARAGRAPH-NAME
018200-    "       REMARKS".
018300     02 FILLER           PIC X(17)    VALUE SPACE.
018400 01  CCVS-C-2.
018500     02 FILLER           PIC XXXX     VALUE SPACE.
018600     02 FILLER           PIC X(6)     VALUE "TESTED".
018700     02 FILLER           PIC X(16)    VALUE SPACE.
018800     02 FILLER           PIC X(4)     VALUE "FAIL".
018900     02 FILLER           PIC X(90)    VALUE SPACE.
019000 01  REC-SKL-SUB       PIC 9(2)     VALUE ZERO.
019100 01  REC-CT            PIC 99       VALUE ZERO.
019200 01  DELETE-COUNTER    PIC 999      VALUE ZERO.
019300 01  ERROR-COUNTER     PIC 999      VALUE ZERO.
019400 01  INSPECT-COUNTER   PIC 999      VALUE ZERO.
019500 01  PASS-COUNTER      PIC 999      VALUE ZERO.
019600 01  TOTAL-ERROR       PIC 999      VALUE ZERO.
019700 01  ERROR-HOLD        PIC 999      VALUE ZERO.
019800 01  DUMMY-HOLD        PIC X(120)   VALUE SPACE.
019900 01  RECORD-COUNT      PIC 9(5)     VALUE ZERO.
020000 01  ANSI-REFERENCE    PIC X(48)    VALUE SPACES.
020100 01  CCVS-H-1.
020200     02  FILLER          PIC X(39)    VALUE SPACES.
020300     02  FILLER          PIC X(42)    VALUE
020400     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
020500     02  FILLER          PIC X(39)    VALUE SPACES.
020600 01  CCVS-H-2A.
020700   02  FILLER            PIC X(40)  VALUE SPACE.
020800   02  FILLER            PIC X(7)   VALUE "CCVS85 ".
020900   02  FILLER            PIC XXXX   VALUE
021000     "4.2 ".
021100   02  FILLER            PIC X(28)  VALUE
021200            " COPY - NOT FOR DISTRIBUTION".
021300   02  FILLER            PIC X(41)  VALUE SPACE.
021400*
021500 01  CCVS-H-2B.
021600   02  FILLER            PIC X(15)  VALUE "TEST RESULT OF ".
021700   02  TEST-ID           PIC X(9).
021800   02  FILLER            PIC X(4)   VALUE " IN ".
021900   02  FILLER            PIC X(12)  VALUE
022000     " HIGH       ".
022100   02  FILLER            PIC X(22)  VALUE
022200            " LEVEL VALIDATION FOR ".
022300   02  FILLER            PIC X(58)  VALUE
022400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
022500 01  CCVS-H-3.
022600     02  FILLER          PIC X(34)  VALUE
022700            " FOR OFFICIAL USE ONLY    ".
022800     02  FILLER          PIC X(58)  VALUE
022900     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
023000     02  FILLER          PIC X(28)  VALUE
023100            "  COPYRIGHT   1985,1986 ".
023200 01  CCVS-E-1.
023300     02 FILLER           PIC X(52)  VALUE SPACE.
023400     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
023500     02 ID-AGAIN         PIC X(9).
023600     02 FILLER           PIC X(45)  VALUE SPACES.
023700 01  CCVS-E-2.
023800     02  FILLER          PIC X(31)  VALUE SPACE.
023900     02  FILLER          PIC X(21)  VALUE SPACE.
024000     02  CCVS-E-2-2.
024100         03 ERROR-TOTAL    PIC XXX    VALUE SPACE.
024200         03 FILLER         PIC X      VALUE SPACE.
024300         03 ENDER-DESC     PIC X(44)  VALUE
024400            "ERRORS ENCOUNTERED".
024500 01  CCVS-E-3.
024600     02  FILLER          PIC X(22)  VALUE
024700            " FOR OFFICIAL USE ONLY".
024800     02  FILLER          PIC X(12)  VALUE SPACE.
024900     02  FILLER          PIC X(58)  VALUE
025000     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025100     02  FILLER          PIC X(8)   VALUE SPACE.
025200     02  FILLER          PIC X(20)  VALUE
025300             " COPYRIGHT 1985,1986".
025400 01  CCVS-E-4.
025500     02 CCVS-E-4-1       PIC XXX    VALUE SPACE.
025600     02 FILLER           PIC X(4)   VALUE " OF ".
025700     02 CCVS-E-4-2       PIC XXX    VALUE SPACE.
025800     02 FILLER           PIC X(40)  VALUE
025900      "  TESTS WERE EXECUTED SUCCESSFULLY".
026000 01  XXINFO.
026100     02 FILLER           PIC X(19)  VALUE "*** INFORMATION ***".
026200     02 INFO-TEXT.
026300       04 FILLER             PIC X(8)   VALUE SPACE.
026400       04 XXCOMPUTED         PIC X(20).
026500       04 FILLER             PIC X(5)   VALUE SPACE.
026600       04 XXCORRECT          PIC X(20).
026700     02 INF-ANSI-REFERENCE PIC X(48).
026800 01  HYPHEN-LINE.
026900     02 FILLER  PIC IS X VALUE IS SPACE.
027000     02 FILLER  PIC IS X(65)    VALUE IS "************************
027100-    "*****************************************".
027200     02 FILLER  PIC IS X(54)    VALUE IS "************************
027300-    "******************************".
027400 01  CCVS-PGM-ID  PIC X(9)   VALUE
027500     "SQ146A".
027600*
027700 PROCEDURE DIVISION.
027800 CCVS1 SECTION.
027900 OPEN-FILES.
028000     OPEN    OUTPUT PRINT-FILE.
028100     MOVE    CCVS-PGM-ID TO TEST-ID.
028200     MOVE    CCVS-PGM-ID TO ID-AGAIN.
028300     MOVE    SPACE TO TEST-RESULTS.
028400     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028500     MOVE    ZERO TO REC-SKEL-SUB.
028600     PERFORM CCVS-INIT-FILE 10 TIMES.
028700     GO TO CCVS1-EXIT.
028800*
028900 CCVS-INIT-FILE.
029000     ADD     1 TO REC-SKL-SUB.
029100     MOVE    FILE-RECORD-INFO-SKELETON TO
029200                  FILE-RECORD-INFO (REC-SKL-SUB).
029300*
029400 CLOSE-FILES.
029500     PERFORM END-ROUTINE THRU END-ROUTINE-13.
029600     CLOSE   PRINT-FILE.
029700 TERMINATE-CCVS.
029800     STOP    RUN.
029900*
030000 INSPT.
030100     MOVE   "INSPT" TO P-OR-F.
030200     ADD     1 TO INSPECT-COUNTER.
030300     PERFORM PRINT-DETAIL.
030400
030500 PASS.
030600     MOVE   "PASS " TO P-OR-F.
030700     ADD     1 TO PASS-COUNTER.
030800     PERFORM PRINT-DETAIL.
030900*
031000 FAIL.
031100     MOVE   "FAIL*" TO P-OR-F.
031200     ADD     1 TO ERROR-COUNTER.
031300     PERFORM PRINT-DETAIL.
031400*
031500 DE-LETE.
031600     MOVE   "****TEST DELETED****" TO RE-MARK.
031700     MOVE   "*****" TO P-OR-F.
031800     ADD     1 TO DELETE-COUNTER.
031900     PERFORM PRINT-DETAIL.
032000*
032100 PRINT-DETAIL.
032200     IF REC-CT NOT EQUAL TO ZERO
032300         MOVE   "." TO PARDOT-X
032400         MOVE    REC-CT TO DOTVALUE.
032500     MOVE    TEST-RESULTS TO PRINT-REC.
032600     PERFORM WRITE-LINE.
032700     IF P-OR-F EQUAL TO "FAIL*"
032800         PERFORM WRITE-LINE
032900         PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
033000     ELSE
033100         PERFORM BAIL-OUT THRU BAIL-OUT-EX.
033200     MOVE    SPACE TO P-OR-F.
033300     MOVE    SPACE TO COMPUTED-X.
033400     MOVE    SPACE TO CORRECT-X.
033500     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
033600     MOVE    SPACE TO RE-MARK.
033700*
033800 HEAD-ROUTINE.
033900     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034000     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034100     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
034200     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
034300 COLUMN-NAMES-ROUTINE.
034400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
034700 END-ROUTINE.
034800     MOVE    HYPHEN-LINE TO DUMMY-RECORD.
034900     PERFORM WRITE-LINE 5 TIMES.
035000 END-RTN-EXIT.
035100     MOVE    CCVS-E-1 TO DUMMY-RECORD.
035200     PERFORM WRITE-LINE 2 TIMES.
035300*
035400 END-ROUTINE-1.
035500     ADD     ERROR-COUNTER   TO ERROR-HOLD
035600     ADD     INSPECT-COUNTER TO ERROR-HOLD.
035700     ADD     DELETE-COUNTER  TO ERROR-HOLD.
035800     ADD     PASS-COUNTER    TO ERROR-HOLD.
035900     MOVE    PASS-COUNTER    TO CCVS-E-4-1.
036000     MOVE    ERROR-HOLD      TO CCVS-E-4-2.
036100     MOVE    CCVS-E-4        TO CCVS-E-2-2.
036200     MOVE    CCVS-E-2        TO DUMMY-RECORD
036300     PERFORM WRITE-LINE.
036400     MOVE   "TEST(S) FAILED" TO ENDER-DESC.
036500     IF ERROR-COUNTER IS EQUAL TO ZERO
036600         MOVE   "NO " TO ERROR-TOTAL
036700     ELSE
036800         MOVE    ERROR-COUNTER TO ERROR-TOTAL.
036900     MOVE    CCVS-E-2 TO DUMMY-RECORD.
037000     PERFORM WRITE-LINE.
037100 END-ROUTINE-13.
037200     IF DELETE-COUNTER IS EQUAL TO ZERO
037300         MOVE   "NO " TO ERROR-TOTAL
037400     ELSE
037500         MOVE    DELETE-COUNTER TO ERROR-TOTAL.
037600     MOVE   "TEST(S) DELETED     " TO ENDER-DESC.
037700     MOVE    CCVS-E-2 TO DUMMY-RECORD.
037800     PERFORM WRITE-LINE.
037900     IF INSPECT-COUNTER EQUAL TO ZERO
038000         MOVE   "NO " TO ERROR-TOTAL
038100     ELSE
038200         MOVE    INSPECT-COUNTER TO ERROR-TOTAL.
038300     MOVE   "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038400     MOVE    CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038500     MOVE    CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038600*
038700 WRITE-LINE.
038800     ADD     1 TO RECORD-COUNT.
038900Y    IF RECORD-COUNT GREATER 50
039000Y        MOVE  DUMMY-RECORD TO DUMMY-HOLD
039100Y        MOVE  SPACE TO DUMMY-RECORD
039200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039300Y        MOVE  CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
039400Y        MOVE  CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
039500Y        MOVE  HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
039600Y        MOVE  DUMMY-HOLD TO DUMMY-RECORD
039700Y        MOVE  ZERO TO RECORD-COUNT.
039800     PERFORM WRT-LN.
039900*
040000 WRT-LN.
040100     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
040200     MOVE    SPACE TO DUMMY-RECORD.
040300 BLANK-LINE-PRINT.
040400     PERFORM WRT-LN.
040500 FAIL-ROUTINE.
040600     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
040700     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
040800     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
040900     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041000     MOVE    XXINFO TO DUMMY-RECORD.
041100     PERFORM WRITE-LINE 2 TIMES.
041200     MOVE    SPACES TO INF-ANSI-REFERENCE.
041300     GO TO   FAIL-ROUTINE-EX.
041400 FAIL-ROUTINE-WRITE.
041500     MOVE    TEST-COMPUTED  TO PRINT-REC
041600     PERFORM WRITE-LINE
041700     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
041800     MOVE    TEST-CORRECT   TO PRINT-REC
041900     PERFORM WRITE-LINE 2 TIMES.
042000     MOVE    SPACES         TO COR-ANSI-REFERENCE.
042100 FAIL-ROUTINE-EX.
042200     EXIT.
042300 BAIL-OUT.
042400     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
042500     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
042600 BAIL-OUT-WRITE.
042700     MOVE    CORRECT-A      TO XXCORRECT.
042800     MOVE    COMPUTED-A     TO XXCOMPUTED.
042900     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
043000     MOVE    XXINFO TO DUMMY-RECORD.
043100     PERFORM WRITE-LINE 2 TIMES.
043200     MOVE    SPACES TO INF-ANSI-REFERENCE.
043300 BAIL-OUT-EX.
043400     EXIT.
043500 CCVS1-EXIT.
043600     EXIT.
043700*
043800****************************************************************
043900*                                                              *
044000*    THIS POINT MARKS THE END OF THE CCVS MONITOR ROUTINES AND *
044100*    THE START OF THE TESTS OF SPECIFIC COBOL FEATURES.        *
044200*                                                              *
044300****************************************************************
044400*
044500 SECT-SQ146A-0001 SECTION.
044600 WRITE-INIT-GF-01.
044700*
044800*        THIS TEST CREATES FILE SQ-FS1 AND CLOSES IT.
044900*        FIRST IT SETS UP A SKELETON RECORD IN WORKING STORAGE.
045000*
045100     MOVE "SQ-FS1"     TO XFILE-NAME (1).
045200     MOVE "R1-F-G"     TO XRECORD-NAME (1).
045300     MOVE  CCVS-PGM-ID TO XPROGRAM-NAME (1).
045400     MOVE 120          TO XRECORD-LENGTH (1).
045500     MOVE "RC"         TO CHARS-OR-RECORDS (1).
045600     MOVE 1            TO XBLOCK-SIZE (1).
045700     MOVE 1            TO RECORDS-IN-FILE (1).
045800     MOVE "SQ"         TO XFILE-ORGANIZATION (1).
045900     MOVE "S"          TO XLABEL-TYPE (1).
046000     MOVE 1            TO XRECORD-NUMBER (1).
046100*
046200 WRITE-OPEN-01.
046300     OPEN    OUTPUT SQ-FS1.
046400*
046500*        WRITE A SINGLE RECORD TO THE FILE
046600*
046700 WRITE-INIT-01.
046800 WRITE-TEST-01-01.
046900     MOVE    FILE-RECORD-INFO-P1-120 (1) TO SQ-FS1R1-F-G-120.
047000     WRITE   SQ-FS1R1-F-G-120.
047100*
047200*        CLOSE THE FILE.
047300*
047400 CLOSE-INIT-01.
047500 CLOSE-TEST-01.
047600     CLOSE   SQ-FS1.
047700*
047800*        HAVING CLOSED THE FILE, WE NOW TRY TO CLOSE IT AGAIN.
047900*        THE TEST PASSES IF THE FILE CANNOT BE RECLOSED AND
048000*        THE APPROPRIATE I-O STATUS VALUE IS RETURNED.
048100*        AN IMPLEMENTATION MAY TERMINATE EXECUTION OF THE
048200*        PROGRAM ON EXECUTION OF THE CLOSE OR MAY RETURN CONTROL
048300*        TO THE STATEMENT FOLLOWING THE CLOSE STATEMENT.
048400*
048500 CLOSE-INIT-02.
048600*
048700     MOVE   "CLOSE A CLOSED FILE" TO FEATURE.
048800     MOVE   "**" TO SQ-FS1-STATUS.
048900     MOVE    1 TO REC-CT.
049000     MOVE   "CLOSE-TEST-02"   TO PAR-NAME.
049100     MOVE "ABNORMAL TERMINATION AT THIS POINT IS ACCEPTABLE"
049200                 TO DUMMY-RECORD.
049300     PERFORM WRITE-LINE 3 TIMES.
049400*
049500 CLOSE-TEST-02.
049600     CLOSE SQ-FS1.
049700     IF SQ-FS1-STATUS = "42"
049800         PERFORM PASS
049900     ELSE
050000         MOVE   "42" TO CORRECT-A
050100         MOVE    SQ-FS1-STATUS TO COMPUTED-A
050200         MOVE   "STATUS OF CLOSE OF CLOSED FILE INCORRECT"
050300                   TO RE-MARK
050400         MOVE   "VII-3, FILE STATUS" TO ANSI-REFERENCE
050500         PERFORM FAIL
050600     END-IF.
050700*
050800 CCVS-EXIT SECTION.
050900 CCVS-999999.
051000     GO TO CLOSE-FILES.
