000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ142A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                             REVISED 1986, AUGUST             *
001000*                                                              *
001100*    CREATION DATE     /     VALIDATION DATE                   *
001200*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001300*                                                              *
001400****************************************************************
001500*                                                              *
001600*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001700*                                                              *
001800*            X-01   SEQUENTIAL MAGNETIC TAPE FILE.             *
001900*            X-55   SYSTEM PRINTER                             *
002000*            X-82   SOURCE-COMPUTER                            *
002100*            X-83   OBJECT-COMPUTER.                           *
002200*                                                              *
002300*                                                              *
002400****************************************************************
002500*                                                              *
002600*    SPLIT FROM SQ129A, THIS PROGRAM REPEATS THE SEQUENCE OF   *
002700*    FILE HANDLING ROUTINES IN ORDER TO CARRY OUT THE ISOLATED *
002800*    SPLIT TEST THAT CHECKS FOR THE CORRECT RESPONSE TO AN     *
002900*    OPEN FOR INPUT ON A TAPE FILE WHICH IS NOT PRESENT.       *
003000*    (SEE SQ129A).                                             *
003100*                                                              *
003200****************************************************************
003300*
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.
003700     XXXXX082.
003800 OBJECT-COMPUTER.
003900     XXXXX083.
004000*
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
004300     SELECT PRINT-FILE ASSIGN TO
004400     XXXXX055.
004500*
004600P    SELECT RAW-DATA   ASSIGN TO
004700P    XXXXX062
004800P          ORGANIZATION IS INDEXED
004900P          ACCESS MODE  IS RANDOM
005000P          RECORD-KEY   IS RAW-DATA-KEY.
005100P
005200     SELECT SQ-FS1 ASSIGN TO
005300     XXXXX001
005400            FILE STATUS IS SQ-FS1-STATUS.
005500*
005600*
005700 DATA DIVISION.
005800 FILE SECTION.
005900 FD  PRINT-FILE
006000C    LABEL RECORDS
006100C    XXXXX084
006200C    DATA RECORD IS PRINT-REC DUMMY-RECORD
006300               .
006400 01  PRINT-REC    PICTURE X(120).
006500 01  DUMMY-RECORD PICTURE X(120).
006600P
006700PFD  RAW-DATA.
006800P01  RAW-DATA-SATZ.
006900P    05  RAW-DATA-KEY        PIC X(6).
007000P    05  C-DATE              PIC 9(6).
007100P    05  C-TIME              PIC 9(8).
007200P    05  NO-OF-TESTS         PIC 99.
007300P    05  C-OK                PIC 999.
007400P    05  C-ALL               PIC 999.
007500P    05  C-FAIL              PIC 999.
007600P    05  C-DELETED           PIC 999.
007700P    05  C-INSPECT           PIC 999.
007800P    05  C-NOTE              PIC X(13).
007900P    05  C-INDENT            PIC X.
008000P    05  C-ABORT             PIC X(8).
008100*
008200 FD  SQ-FS1
008300C    LABEL RECORD IS STANDARD
008400                .
008500 01  SQ-FS1R1-F-G-120 PIC X(120).
008600*
008700 WORKING-STORAGE SECTION.
008800*
008900***************************************************************
009000*                                                             *
009100*    WORKING-STORAGE DATA ITEMS SPECIFIC TO THIS TEST SUITE   *
009200*                                                             *
009300***************************************************************
009400*
009500 01  SQ-FS1-STATUS.
009600   03  SQ-FS1-KEY-1   PIC X.
009700   03  SQ-FS1-KEY-2   PIC X.
009800*
009900 01  DECL-EXEC-SW  PIC 9.
010000*
010100***************************************************************
010200*                                                             *
010300*    WORKING-STORAGE DATA ITEMS USED BY THE CCVS              *
010400*                                                             *
010500***************************************************************
010600*
010700 01  REC-SKEL-SUB   PIC 99.
010800*
010900 01  FILE-RECORD-INFORMATION-REC.
011000     03 FILE-RECORD-INFO-SKELETON.
011100        05 FILLER                 PICTURE X(48)       VALUE
011200             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
011300        05 FILLER                 PICTURE X(46)       VALUE
011400             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
011500        05 FILLER                 PICTURE X(26)       VALUE
011600             ",LFIL=000000,ORG=  ,LBLR= ".
011700        05 FILLER                 PICTURE X(37)       VALUE
011800             ",RECKEY=                             ".
011900        05 FILLER                 PICTURE X(38)       VALUE
012000             ",ALTKEY1=                             ".
012100        05 FILLER                 PICTURE X(38)       VALUE
012200             ",ALTKEY2=                             ".
012300        05 FILLER                 PICTURE X(7)        VALUE SPACE.
012400     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
012500        05 FILE-RECORD-INFO-P1-120.
012600           07 FILLER              PIC X(5).
012700           07 XFILE-NAME          PIC X(6).
012800           07 FILLER              PIC X(8).
012900           07 XRECORD-NAME        PIC X(6).
013000           07 FILLER              PIC X(1).
013100           07 REELUNIT-NUMBER     PIC 9(1).
013200           07 FILLER              PIC X(7).
013300           07 XRECORD-NUMBER      PIC 9(6).
013400           07 FILLER              PIC X(6).
013500           07 UPDATE-NUMBER       PIC 9(2).
013600           07 FILLER              PIC X(5).
013700           07 ODO-NUMBER          PIC 9(4).
013800           07 FILLER              PIC X(5).
013900           07 XPROGRAM-NAME       PIC X(5).
014000           07 FILLER              PIC X(7).
014100           07 XRECORD-LENGTH      PIC 9(6).
014200           07 FILLER              PIC X(7).
014300           07 CHARS-OR-RECORDS    PIC X(2).
014400           07 FILLER              PIC X(1).
014500           07 XBLOCK-SIZE         PIC 9(4).
014600           07 FILLER              PIC X(6).
014700           07 RECORDS-IN-FILE     PIC 9(6).
014800           07 FILLER              PIC X(5).
014900           07 XFILE-ORGANIZATION  PIC X(2).
015000           07 FILLER              PIC X(6).
015100           07 XLABEL-TYPE         PIC X(1).
015200        05 FILE-RECORD-INFO-P121-240.
015300           07 FILLER              PIC X(8).
015400           07 XRECORD-KEY         PIC X(29).
015500           07 FILLER              PIC X(9).
015600           07 ALTERNATE-KEY1      PIC X(29).
015700           07 FILLER              PIC X(9).
015800           07 ALTERNATE-KEY2      PIC X(29).
015900           07 FILLER              PIC X(7).
016000*
016100 01  TEST-RESULTS.
016200     02 FILLER              PIC X      VALUE SPACE.
016300     02 FEATURE             PIC X(24)  VALUE SPACE.
016400     02 FILLER              PIC X      VALUE SPACE.
016500     02 P-OR-F              PIC X(5)   VALUE SPACE.
016600     02 FILLER              PIC X      VALUE SPACE.
016700     02  PAR-NAME.
016800       03 FILLER              PIC X(14)  VALUE SPACE.
016900       03 PARDOT-X            PIC X      VALUE SPACE.
017000       03 DOTVALUE            PIC 99     VALUE ZERO.
017100     02 FILLER              PIC X(9)   VALUE SPACE.
017200     02 RE-MARK             PIC X(61).
017300 01  TEST-COMPUTED.
017400   02 FILLER  PIC X(30)  VALUE SPACE.
017500   02 FILLER  PIC X(17)  VALUE "      COMPUTED =".
017600   02 COMPUTED-X.
017700     03 COMPUTED-A    PIC X(20)  VALUE SPACE.
017800     03 COMPUTED-N    REDEFINES COMPUTED-A PIC -9(9).9(9).
017900     03 COMPUTED-0V18 REDEFINES COMPUTED-A PIC -.9(18).
018000     03 COMPUTED-4V14 REDEFINES COMPUTED-A PIC -9(4).9(14).
018100     03 COMPUTED-14V4 REDEFINES COMPUTED-A PIC -9(14).9(4).
018200     03       CM-18V0 REDEFINES COMPUTED-A.
018300        04 COMPUTED-18V0                   PIC -9(18).
018400        04 FILLER                          PIC X.
018500     03 FILLER PIC X(50) VALUE SPACE.
018600 01  TEST-CORRECT.
018700     02 FILLER PIC X(30) VALUE SPACE.
018800     02 FILLER PIC X(17) VALUE "       CORRECT =".
018900     02 CORRECT-X.
019000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
019100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
019200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
019300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
019400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
019500     03      CR-18V0 REDEFINES CORRECT-A.
019600         04 CORRECT-18V0                     PIC -9(18).
019700         04 FILLER                           PIC X.
019800     03 FILLER PIC X(2) VALUE SPACE.
019900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
020000 01  CCVS-C-1.
020100     02 FILLER  PIC IS X(4)     VALUE SPACE.
020200     02 FILLER  PIC IS X(98)    VALUE IS "FEATURE               PA
020300-    "SS  PARAGRAPH-NAME
020400-    "       REMARKS".
020500     02 FILLER           PIC X(17)    VALUE SPACE.
020600 01  CCVS-C-2.
020700     02 FILLER           PIC XXXX     VALUE SPACE.
020800     02 FILLER           PIC X(6)     VALUE "TESTED".
020900     02 FILLER           PIC X(16)    VALUE SPACE.
021000     02 FILLER           PIC X(4)     VALUE "FAIL".
021100     02 FILLER           PIC X(90)    VALUE SPACE.
021200 01  REC-SKL-SUB       PIC 9(2)     VALUE ZERO.
021300 01  REC-CT            PIC 99       VALUE ZERO.
021400 01  DELETE-COUNTER    PIC 999      VALUE ZERO.
021500 01  ERROR-COUNTER     PIC 999      VALUE ZERO.
021600 01  INSPECT-COUNTER   PIC 999      VALUE ZERO.
021700 01  PASS-COUNTER      PIC 999      VALUE ZERO.
021800 01  TOTAL-ERROR       PIC 999      VALUE ZERO.
021900 01  ERROR-HOLD        PIC 999      VALUE ZERO.
022000 01  DUMMY-HOLD        PIC X(120)   VALUE SPACE.
022100 01  RECORD-COUNT      PIC 9(5)     VALUE ZERO.
022200 01  ANSI-REFERENCE    PIC X(48)    VALUE SPACES.
022300 01  CCVS-H-1.
022400     02  FILLER          PIC X(39)    VALUE SPACES.
022500     02  FILLER          PIC X(42)    VALUE
022600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
022700     02  FILLER          PIC X(39)    VALUE SPACES.
022800 01  CCVS-H-2A.
022900   02  FILLER            PIC X(40)  VALUE SPACE.
023000   02  FILLER            PIC X(7)   VALUE "CCVS85 ".
023100   02  FILLER            PIC XXXX   VALUE
023200     "4.2 ".
023300   02  FILLER            PIC X(28)  VALUE
023400            " COPY - NOT FOR DISTRIBUTION".
023500   02  FILLER            PIC X(41)  VALUE SPACE.
023600*
023700 01  CCVS-H-2B.
023800   02  FILLER            PIC X(15)  VALUE "TEST RESULT OF ".
023900   02  TEST-ID           PIC X(9).
024000   02  FILLER            PIC X(4)   VALUE " IN ".
024100   02  FILLER            PIC X(12)  VALUE
024200     " HIGH       ".
024300   02  FILLER            PIC X(22)  VALUE
024400            " LEVEL VALIDATION FOR ".
024500   02  FILLER            PIC X(58)  VALUE
024600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024700 01  CCVS-H-3.
024800     02  FILLER          PIC X(34)  VALUE
024900            " FOR OFFICIAL USE ONLY    ".
025000     02  FILLER          PIC X(58)  VALUE
025100     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
025200     02  FILLER          PIC X(28)  VALUE
025300            "  COPYRIGHT   1985,1986 ".
025400 01  CCVS-E-1.
025500     02 FILLER           PIC X(52)  VALUE SPACE.
025600     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
025700     02 ID-AGAIN         PIC X(9).
025800     02 FILLER           PIC X(45)  VALUE SPACES.
025900 01  CCVS-E-2.
026000     02  FILLER          PIC X(31)  VALUE SPACE.
026100     02  FILLER          PIC X(21)  VALUE SPACE.
026200     02  CCVS-E-2-2.
026300         03 ERROR-TOTAL    PIC XXX    VALUE SPACE.
026400         03 FILLER         PIC X      VALUE SPACE.
026500         03 ENDER-DESC     PIC X(44)  VALUE
026600            "ERRORS ENCOUNTERED".
026700 01  CCVS-E-3.
026800     02  FILLER          PIC X(22)  VALUE
026900            " FOR OFFICIAL USE ONLY".
027000     02  FILLER          PIC X(12)  VALUE SPACE.
027100     02  FILLER          PIC X(58)  VALUE
027200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
027300     02  FILLER          PIC X(8)   VALUE SPACE.
027400     02  FILLER          PIC X(20)  VALUE
027500             " COPYRIGHT 1985,1986".
027600 01  CCVS-E-4.
027700     02 CCVS-E-4-1       PIC XXX    VALUE SPACE.
027800     02 FILLER           PIC X(4)   VALUE " OF ".
027900     02 CCVS-E-4-2       PIC XXX    VALUE SPACE.
028000     02 FILLER           PIC X(40)  VALUE
028100      "  TESTS WERE EXECUTED SUCCESSFULLY".
028200 01  XXINFO.
028300     02 FILLER           PIC X(19)  VALUE "*** INFORMATION ***".
028400     02 INFO-TEXT.
028500       04 FILLER             PIC X(8)   VALUE SPACE.
028600       04 XXCOMPUTED         PIC X(20).
028700       04 FILLER             PIC X(5)   VALUE SPACE.
028800       04 XXCORRECT          PIC X(20).
028900     02 INF-ANSI-REFERENCE PIC X(48).
029000 01  HYPHEN-LINE.
029100     02 FILLER  PIC IS X VALUE IS SPACE.
029200     02 FILLER  PIC IS X(65)    VALUE IS "************************
029300-    "*****************************************".
029400     02 FILLER  PIC IS X(54)    VALUE IS "************************
029500-    "******************************".
029600 01  CCVS-PGM-ID  PIC X(9)   VALUE
029700     "SQ142A".
029800*
029900*
030000 PROCEDURE DIVISION.
030100 DECLARATIVES.
030200 SQ142A-DECLARATIVE-001-SECT SECTION.
030300     USE AFTER STANDARD EXCEPTION PROCEDURE ON INPUT.
030400 INPUT-ERROR-PROCEDURE.
030500     IF DECL-EXEC-SW NOT = 9
030600         GO TO   NOT-DECL-9.
030700*
030800*    DECLARATIVE PROCEDURE ENTERED FROM OPEN INPUT
030900*
031000 DECL-OPEN-TEST.
031100     MOVE    SPACE TO DUMMY-RECORD
031200     PERFORM DECL-WRITE-LINE
031300     MOVE   "ABNORMAL TERMINATION AT THIS POINT IS ACCEPTABLE"
031400               TO DUMMY-RECORD
031500     PERFORM DECL-WRITE-LINE 3 TIMES.
031600     GO TO   END-DECLS.
031700*
031800*
031900 NOT-DECL-9.
032000     MOVE   "NOT-DECL-9"  TO PAR-NAME.
032100     MOVE    DECL-EXEC-SW TO COMPUTED-18V0.
032200     MOVE    9            TO CORRECT-18V0.
032300     PERFORM DECL-FAIL.
032400     GO TO   END-DECLS.
032500*
032600*
032700*
032800 DECL-PASS.
032900     MOVE   "PASS " TO P-OR-F.
033000     ADD     1 TO PASS-COUNTER.
033100     PERFORM DECL-PRINT-DETAIL.
033200*
033300 DECL-FAIL.
033400     MOVE   "FAIL*" TO P-OR-F.
033500     ADD     1 TO ERROR-COUNTER.
033600     PERFORM DECL-PRINT-DETAIL.
033700*
033800 DECL-PRINT-DETAIL.
033900     IF REC-CT NOT EQUAL TO ZERO
034000             MOVE "." TO PARDOT-X
034100             MOVE REC-CT TO DOTVALUE.
034200     MOVE    TEST-RESULTS TO PRINT-REC.
034300     PERFORM DECL-WRITE-LINE.
034400     IF P-OR-F EQUAL TO "FAIL*"
034500         PERFORM DECL-WRITE-LINE
034600         PERFORM DECL-FAIL-ROUTINE THRU DECL-FAIL-EX
034700     ELSE
034800         PERFORM DECL-BAIL THRU DECL-BAIL-EX.
034900     MOVE    SPACE TO P-OR-F.
035000     MOVE    SPACE TO COMPUTED-X.
035100     MOVE    SPACE TO CORRECT-X.
035200     IF REC-CT EQUAL TO ZERO
035300         MOVE    SPACE TO PAR-NAME.
035400     MOVE    SPACE TO RE-MARK.
035500*
035600 DECL-WRITE-LINE.
035700     ADD     1 TO RECORD-COUNT.
035800Y    IF RECORD-COUNT GREATER 50
035900Y        MOVE    DUMMY-RECORD TO DUMMY-HOLD
036000Y        MOVE    SPACE TO DUMMY-RECORD
036100Y        WRITE   DUMMY-RECORD AFTER ADVANCING PAGE
036200Y        MOVE    CCVS-C-1 TO DUMMY-RECORD PERFORM DECL-WRT-LN
036300Y        MOVE    CCVS-C-2 TO DUMMY-RECORD
036400Y        PERFORM DECL-WRT-LN 2 TIMES
036500Y        MOVE    HYPHEN-LINE TO DUMMY-RECORD
036600Y        PERFORM DECL-WRT-LN
036700Y        MOVE    DUMMY-HOLD TO DUMMY-RECORD
036800Y        MOVE    ZERO TO RECORD-COUNT.
036900     PERFORM DECL-WRT-LN.
037000*
037100 DECL-WRT-LN.
037200     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
037300     MOVE    SPACE TO DUMMY-RECORD.
037400*
037500 DECL-FAIL-ROUTINE.
037600     IF COMPUTED-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
037700     IF CORRECT-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
037800     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
037900     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
038000     MOVE    XXINFO TO DUMMY-RECORD.
038100     PERFORM DECL-WRITE-LINE 2 TIMES.
038200     MOVE    SPACES TO INF-ANSI-REFERENCE.
038300     GO TO   DECL-FAIL-EX.
038400 DECL-FAIL-WRITE.
038500     MOVE    TEST-COMPUTED TO PRINT-REC
038600     PERFORM DECL-WRITE-LINE
038700     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
038800     MOVE    TEST-CORRECT TO PRINT-REC
038900     PERFORM DECL-WRITE-LINE 2 TIMES.
039000     MOVE    SPACES TO COR-ANSI-REFERENCE.
039100 DECL-FAIL-EX.
039200     EXIT.
039300*
039400 DECL-BAIL.
039500     IF COMPUTED-A NOT EQUAL TO SPACE GO TO DECL-BAIL-WRITE.
039600     IF CORRECT-A EQUAL TO SPACE GO TO DECL-BAIL-EX.
039700 DECL-BAIL-WRITE.
039800     MOVE    CORRECT-A TO XXCORRECT.
039900     MOVE    COMPUTED-A TO XXCOMPUTED.
040000     MOVE    XXINFO TO DUMMY-RECORD.
040100     PERFORM DECL-WRITE-LINE 2 TIMES.
040200 DECL-BAIL-EX.
040300     EXIT.
040400*
040500 END-DECLS.
040600     MOVE    ZERO TO DECL-EXEC-SW.
040700 END DECLARATIVES.
040800*
040900*
041000 CCVS1 SECTION.
041100 OPEN-FILES.
041200P    OPEN    I-O RAW-DATA.
041300P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
041400P    READ    RAW-DATA INVALID KEY GO TO END-E-1.
041500P    MOVE   "ABORTED "   TO C-ABORT.
041600P    ADD     1           TO C-NO-OF-TESTS.
041700P    ACCEPT  C-DATE      FROM DATE.
041800P    ACCEPT  C-TIME      FROM TIME.
041900P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
042000PEND-E-1.
042100P    CLOSE   RAW-DATA.
042200     OPEN    OUTPUT PRINT-FILE.
042300     MOVE    CCVS-PGM-ID TO TEST-ID.
042400     MOVE    CCVS-PGM-ID TO ID-AGAIN.
042500     MOVE    SPACE TO TEST-RESULTS.
042600     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
042700     MOVE    ZERO TO REC-SKEL-SUB.
042800     PERFORM CCVS-INIT-FILE 10 TIMES.
042900     GO TO CCVS1-EXIT.
043000*
043100 CCVS-INIT-FILE.
043200     ADD     1 TO REC-SKL-SUB.
043300     MOVE    FILE-RECORD-INFO-SKELETON TO
043400                  FILE-RECORD-INFO (REC-SKL-SUB).
043500*
043600 CLOSE-FILES.
043700     PERFORM END-ROUTINE THRU END-ROUTINE-13.
043800     CLOSE   PRINT-FILE.
043900P    OPEN    I-O RAW-DATA.
044000P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
044100P    READ    RAW-DATA INVALID KEY GO TO END-E-2.
044200P    MOVE   "OK.     " TO C-ABORT.
044300P    MOVE    PASS-COUNTER  TO C-OK.
044400P    MOVE    ERROR-HOLD    TO C-ALL.
044500P    MOVE    ERROR-COUNTER TO C-FAIL.
044600P    MOVE    DELETE-CNT    TO C-DELETED.
044700P    MOVE    INSPECT-COUNTER TO C-INSPECT.
044800P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
044900PEND-E-2.
045000P    CLOSE   RAW-DATA.
045100 TERMINATE-CCVS.
045200S    EXIT    PROGRAM.
045300     STOP    RUN.
045400*
045500 INSPT.
045600     MOVE   "INSPT" TO P-OR-F.
045700     ADD     1 TO INSPECT-COUNTER.
045800     PERFORM PRINT-DETAIL.
045900
046000 PASS.
046100     MOVE   "PASS " TO P-OR-F.
046200     ADD     1 TO PASS-COUNTER.
046300     PERFORM PRINT-DETAIL.
046400*
046500 FAIL.
046600     MOVE   "FAIL*" TO P-OR-F.
046700     ADD     1 TO ERROR-COUNTER.
046800     PERFORM PRINT-DETAIL.
046900*
047000 DE-LETE.
047100     MOVE   "****TEST DELETED****" TO RE-MARK.
047200     MOVE   "*****" TO P-OR-F.
047300     ADD     1 TO DELETE-COUNTER.
047400     PERFORM PRINT-DETAIL.
047500*
047600 PRINT-DETAIL.
047700     IF REC-CT NOT EQUAL TO ZERO
047800         MOVE   "." TO PARDOT-X
047900         MOVE    REC-CT TO DOTVALUE.
048000     MOVE    TEST-RESULTS TO PRINT-REC.
048100     PERFORM WRITE-LINE.
048200     IF P-OR-F EQUAL TO "FAIL*"
048300         PERFORM WRITE-LINE
048400         PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
048500     ELSE
048600         PERFORM BAIL-OUT THRU BAIL-OUT-EX.
048700     MOVE    SPACE TO P-OR-F.
048800     MOVE    SPACE TO COMPUTED-X.
048900     MOVE    SPACE TO CORRECT-X.
049000     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
049100     MOVE    SPACE TO RE-MARK.
049200*
049300 HEAD-ROUTINE.
049400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
049700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
049800 COLUMN-NAMES-ROUTINE.
049900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
050000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
050200 END-ROUTINE.
050300     MOVE    HYPHEN-LINE TO DUMMY-RECORD.
050400     PERFORM WRITE-LINE 5 TIMES.
050500 END-RTN-EXIT.
050600     MOVE    CCVS-E-1 TO DUMMY-RECORD.
050700     PERFORM WRITE-LINE 2 TIMES.
050800*
050900 END-ROUTINE-1.
051000     ADD     ERROR-COUNTER   TO ERROR-HOLD
051100     ADD     INSPECT-COUNTER TO ERROR-HOLD.
051200     ADD     DELETE-COUNTER  TO ERROR-HOLD.
051300     ADD     PASS-COUNTER    TO ERROR-HOLD.
051400     MOVE    PASS-COUNTER    TO CCVS-E-4-1.
051500     MOVE    ERROR-HOLD      TO CCVS-E-4-2.
051600     MOVE    CCVS-E-4        TO CCVS-E-2-2.
051700     MOVE    CCVS-E-2        TO DUMMY-RECORD
051800     PERFORM WRITE-LINE.
051900     MOVE   "TEST(S) FAILED" TO ENDER-DESC.
052000     IF ERROR-COUNTER IS EQUAL TO ZERO
052100         MOVE   "NO " TO ERROR-TOTAL
052200     ELSE
052300         MOVE    ERROR-COUNTER TO ERROR-TOTAL.
052400     MOVE    CCVS-E-2 TO DUMMY-RECORD.
052500     PERFORM WRITE-LINE.
052600 END-ROUTINE-13.
052700     IF DELETE-COUNTER IS EQUAL TO ZERO
052800         MOVE   "NO " TO ERROR-TOTAL
052900     ELSE
053000         MOVE    DELETE-COUNTER TO ERROR-TOTAL.
053100     MOVE   "TEST(S) DELETED     " TO ENDER-DESC.
053200     MOVE    CCVS-E-2 TO DUMMY-RECORD.
053300     PERFORM WRITE-LINE.
053400     IF INSPECT-COUNTER EQUAL TO ZERO
053500         MOVE   "NO " TO ERROR-TOTAL
053600     ELSE
053700         MOVE    INSPECT-COUNTER TO ERROR-TOTAL.
053800     MOVE   "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
053900     MOVE    CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054000     MOVE    CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
054100*
054200 WRITE-LINE.
054300     ADD     1 TO RECORD-COUNT.
054400Y    IF RECORD-COUNT GREATER 50
054500Y        MOVE  DUMMY-RECORD TO DUMMY-HOLD
054600Y        MOVE  SPACE TO DUMMY-RECORD
054700Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
054800Y        MOVE  CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
054900Y        MOVE  CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
055000Y        MOVE  HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
055100Y        MOVE  DUMMY-HOLD TO DUMMY-RECORD
055200Y        MOVE  ZERO TO RECORD-COUNT.
055300     PERFORM WRT-LN.
055400*
055500 WRT-LN.
055600     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
055700     MOVE    SPACE TO DUMMY-RECORD.
055800 BLANK-LINE-PRINT.
055900     PERFORM WRT-LN.
056000 FAIL-ROUTINE.
056100     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
056200     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
056300     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
056400     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
056500     MOVE    XXINFO TO DUMMY-RECORD.
056600     PERFORM WRITE-LINE 2 TIMES.
056700     MOVE    SPACES TO INF-ANSI-REFERENCE.
056800     GO TO   FAIL-ROUTINE-EX.
056900 FAIL-ROUTINE-WRITE.
057000     MOVE    TEST-COMPUTED  TO PRINT-REC
057100     PERFORM WRITE-LINE
057200     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
057300     MOVE    TEST-CORRECT   TO PRINT-REC
057400     PERFORM WRITE-LINE 2 TIMES.
057500     MOVE    SPACES         TO COR-ANSI-REFERENCE.
057600 FAIL-ROUTINE-EX.
057700     EXIT.
057800 BAIL-OUT.
057900     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
058000     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
058100 BAIL-OUT-WRITE.
058200     MOVE    CORRECT-A      TO XXCORRECT.
058300     MOVE    COMPUTED-A     TO XXCOMPUTED.
058400     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
058500     MOVE    XXINFO TO DUMMY-RECORD.
058600     PERFORM WRITE-LINE 2 TIMES.
058700     MOVE    SPACES TO INF-ANSI-REFERENCE.
058800 BAIL-OUT-EX.
058900     EXIT.
059000 CCVS1-EXIT.
059100     EXIT.
059200*
059300****************************************************************
059400*                                                              *
059500*    THIS POINT MARKS THE END OF THE CCVS MONITOR ROUTINES AND *
059600*    THE START OF THE TESTS OF SPECIFIC COBOL FEATURES.        *
059700*                                                              *
059800****************************************************************
059900*
060000 SECT-SQ142A-MAIN SECTION.
060100 OPEN-INIT-01.
060200*
060300*    THIS PROGRAM ATTEMPTS TO OPEN A FILE WHICH IS NOT
060400*    PRESENT AND AVAILABLE TO IT.
060500*
060600     MOVE    1 TO REC-CT
060700     MOVE   "OPEN ABSENT FILE INPUT" TO FEATURE
060800     MOVE   "OPEN-TEST-01" TO PAR-NAME
060900     MOVE    9 TO DECL-EXEC-SW
061000     MOVE   "**" TO SQ-FS1-STATUS.
061100 OPEN-TEST-01.
061200     OPEN    INPUT SQ-FS1.
061300     MOVE   "OPEN-TEST-01" TO PAR-NAME.
061400     MOVE    1 TO REC-CT.
061500     ADD     1 TO REC-CT.
061600     IF  SQ-FS1-STATUS NOT = "35"
061700         MOVE   "INCORRECT STATUS CODE RETURNED" TO RE-MARK
061800         MOVE   "VII-4, 1.5.3(3)C" TO ANSI-REFERENCE
061900         MOVE   "35" TO CORRECT-A
062000         MOVE    SQ-FS1-STATUS TO COMPUTED-A
062100         PERFORM FAIL
062200     ELSE
062300         PERFORM PASS.
062400*
062500*
062600 CCVS-EXIT SECTION.
062700 CCVS-999999.
062800     GO TO   CLOSE-FILES.
