000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ209M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    " HIGH       ".
000800*                                                              *
000900*    CREATION DATE     /     VALIDATION DATE                   *
001000*    "4.2 ".
001100*                                                              *
001200*        THE ROUTINE SQ209M TESTS THE USE OF THE LEVEL 2 WRITE
001300*    STATEMENT AND THE LINAGE CLAUSE FOR A FILE DESIGNATED AS
001400*    PRINTER OUTPUT.  THESE STATEMENTS CONTROL THE VERTICAL
001500*    POSITONING OF EACH LINE ON A PRINTED PAGE.  THE LINAGE
001600*    CLAUSE SPECIFICALLY CONTROLS THE VERTICAL FORMAT OF A LOGICAL
001700*    PRINT PAGE.  SQ209M IS DESIGNED TO TEST THE MINIMUM
001800*    CONFIGURATION OF THE LINAGE CLAUSE.  IT IS ASSUMED THAT ALL
001900*    LEVEL 2 NUCLEUS OPTIONS ARE AVAILABLE IN TESTING SQ210.
002000*        BECAUSE OF THE NATURE OF THESE TESTS A "PASS" OR "FAIL"
002100*    CANNOT BE DETERMINED WITHIN THE PROGRAM.  THE USER MUST
002200*    VISUALLY CHECK THE POSITION OF EACH LINE TO DETERMINE THE
002300*    ACCURACY OF THE VARIOUS WRITE OPTIONS.
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.
002700     XXXXX082.
002800 OBJECT-COMPUTER.
002900     XXXXX083.
003000 INPUT-OUTPUT SECTION.
003100 FILE-CONTROL.
003200P    SELECT RAW-DATA   ASSIGN TO
003300P    XXXXX062
003400P           ORGANIZATION IS INDEXED
003500P           ACCESS MODE IS RANDOM
003600P           RECORD KEY IS RAW-DATA-KEY.
003700     SELECT PRINT-FILE ASSIGN TO
003800     XXXXX055.
003900 DATA DIVISION.
004000 FILE SECTION.
004100P
004200PFD  RAW-DATA.
004300P
004400P01  RAW-DATA-SATZ.
004500P    05  RAW-DATA-KEY        PIC X(6).
004600P    05  C-DATE              PIC 9(6).
004700P    05  C-TIME              PIC 9(8).
004800P    05  C-NO-OF-TESTS       PIC 99.
004900P    05  C-OK                PIC 999.
005000P    05  C-ALL               PIC 999.
005100P    05  C-FAIL              PIC 999.
005200P    05  C-DELETED           PIC 999.
005300P    05  C-INSPECT           PIC 999.
005400P    05  C-NOTE              PIC X(13).
005500P    05  C-INDENT            PIC X.
005600P    05  C-ABORT             PIC X(8).
005700 FD  PRINT-FILE
005800C    LABEL RECORDS
005900C    XXXXX084
006000C    DATA RECORD IS PRINT-REC DUMMY-RECORD
006100     LINAGE 40
006200              TOP 2.
006300 01  PRINT-REC PICTURE X(120).
006400 01  DUMMY-RECORD PICTURE X(120).
006500 WORKING-STORAGE SECTION.
006600 77  ONE                PIC 9        VALUE 1.
006700 01  NOTE-1.
006800     02 FILLER          PIC X(39)    VALUE "BECAUSE OF THE NATURE
006900-    "OF THESE TESTS A ".
007000     02 FILLER          PIC X        VALUE QUOTE.
007100     02 FILLER          PIC X(4)     VALUE "PASS".
007200     02 FILLER          PIC X        VALUE QUOTE.
007300     02 FILLER          PIC X(4)     VALUE " OR ".
007400     02 FILLER          PIC X        VALUE QUOTE.
007500     02 FILLER          PIC X(4)     VALUE "FAIL".
007600     02 FILLER          PIC X        VALUE QUOTE.
007700     02 FILLER          PIC X(65)    VALUE " CANNOT BE DETERMINED
007800-    "WITHIN THE PROGRAM. THE USER MUST VISUALLY".
007900 01  NOTE-2             PIC X(120)   VALUE "CHECK THE POSITION OF
008000-    "EACH LINE TO DETERMINE THE ACCURACY OF THE VARIOUS WRITE OPT
008100-    "IONS. VII-27 TO 29 LINAGE ".
008200 01  LAST-LINE-1        PIC X(120)   VALUE "THIS LINE SHOULD PRINT
008300-    " AS THE LAST LINE ON THIS LOGICAL PAGE. TWO BLANK LINES SHOU
008400-    "LD FOLLOW.".
008500 01  FIRST-LINE-1       PIC X(120)   VALUE "THIS LINE SHOULD PRINT
008600-    " AS THE FIRST LINE ON A NEW LOGICAL PAGE. IT SHOULD BE THREE
008700-    " LINES BELOW THE PREVIOUS LINE.".
008800 01  DETAIL-LINE-3.
008900     02 FILLER          PIC X(13)    VALUE "THIS IS LINE ".
009000     02 DL3-LINE-NO     PIC 99.
009100     02 FILLER          PIC X(40)    VALUE " OF 60 DETAIL LINES.
009200-    "LINAGE-COUNTER IS ".
009300     02 DL3-LC          PIC 99.
009400     02 FILLER          PIC X(63)    VALUE ".".
009500 01  FOOT-LINE-3.
009600     02 FILLER          PIC X(103)   VALUE "THIS LINE WAS PRINTED
009700-    "FROM AN EOP CLAUSE.  THE VALUE OF THE LINAGE-COUNTER PRIOR T
009800-    "O THIS EXECUTION IS ".
009900     02 FL3-LC          PIC 99.
010000     02 FILLER          PIC X(15)    VALUE ".".
010100 01  INFO-LINE-1        PIC X(120)   VALUE "THIS TEST IS DESIGNED
010200-    "TO TEST THE OVERFLOW RESULTS OF A WRITE BEFORE ADVANCING OPE
010300-    "RATION CONTAINING AN EOP PHRASE.".
010400 01  INFO-LINE-2        PIC X(120)   VALUE "THIS TEST IS DESIGNED
010500-    "TO TEST THE OVERFLOW RESULTS OF A WRITE AFTER ADVANCING OPER
010600-    "ATION CONTAINING AN EOP PHRASE.".
010700 01  INFO-LINE-3        PIC X(120)   VALUE "FOR THIS TEST LINAGE V
010800-    "ALUE IS 40.  NO FOOTING PHRASE IS SPECIFIED.".
010900 01  INFO-LINE-4        PIC X(120)   VALUE "39 DETAIL LINES SHOULD
011000-    " PRINT ON THE 1ST LOGICAL PAGE AND THE REMAINING 21 DETAIL L
011100-    "INES ON THE 2ND LOGICAL PAGE.".
011200 01  INFO-LINE-5        PIC X(120)   VALUE "40 DETAIL LINES SHOULD
011300-    " PRINT ON THE 1ST LOGICAL PAGE AND THE REMAINING 20 DETAIL L
011400-    "INES ON THE 2ND LOGICAL PAGE.".
011500 01  INFO-LINE-6        PIC X(120)   VALUE "THE EOP LINE SHOULD FO
011600-    "LLOW DETAIL LINE 40 AND BE THE FIRST LINE ON THE 2ND LOGICAL
011700-    " PAGE.".
011800 01  INFO-LINE-7        PIC X(120)   VALUE "THE EOP LINE SHOULD FO
011900-    "LLOW DETAIL LINE 40 AND BE THE 2ND LINE ON THE 2ND LOGICAL P
012000-    "AGE.".
012100 01  INFO-LINE-8        PIC X(120)   VALUE "ALL LINAGE-COUNTER VAL
012200-    "UES REPRESENT VALUES PRIOR TO EXECUTION OF THE WRITE OPERATI
012300-    "ON.  NO MODIFICATIONS HAVE BEEN MADE.".
012400 01  TEST-RESULTS.
012500     02 FILLER                    PICTURE X VALUE SPACE.
012600     02 FEATURE                   PICTURE X(20) VALUE SPACE.
012700     02 FILLER                    PICTURE X VALUE SPACE.
012800     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
012900     02 FILLER                    PICTURE X  VALUE SPACE.
013000     02  PAR-NAME.
013100       03 FILLER PICTURE X(12) VALUE SPACE.
013200       03  PARDOT-X PICTURE X  VALUE SPACE.
013300       03 DOTVALUE PICTURE 99  VALUE ZERO.
013400       03 FILLER PIC X(5) VALUE SPACE.
013500     02 FILLER PIC X(10) VALUE SPACE.
013600     02 RE-MARK PIC X(61).
013700 01  TEST-COMPUTED.
013800     02 FILLER PIC X(30) VALUE SPACE.
013900     02 FILLER PIC X(17) VALUE "       COMPUTED=".
014000     02 COMPUTED-X.
014100     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
014200     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
014300     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
014400     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
014500     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
014600     03       CM-18V0 REDEFINES COMPUTED-A.
014700         04 COMPUTED-18V0                   PICTURE -9(18).
014800         04 FILLER                          PICTURE X.
014900     03 FILLER PIC X(50) VALUE SPACE.
015000 01  TEST-CORRECT.
015100     02 FILLER PIC X(30) VALUE SPACE.
015200     02 FILLER PIC X(17) VALUE "       CORRECT =".
015300     02 CORRECT-X.
015400     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
015500     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
015600     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
015700     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
015800     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
015900     03      CR-18V0 REDEFINES CORRECT-A.
016000         04 CORRECT-18V0                    PICTURE -9(18).
016100         04 FILLER                          PICTURE X.
016200     03 FILLER PIC X(50) VALUE SPACE.
016300 01  CCVS-C-1.
016400     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
016500-    "SS  PARAGRAPH-NAME
016600-    "        REMARKS".
016700     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
016800 01  CCVS-C-2.
016900     02 FILLER PICTURE IS X VALUE IS SPACE.
017000     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
017100     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
017200     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
017300     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
017400 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
017500 01  REC-CT PICTURE 99 VALUE ZERO.
017600 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
017700 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
017800 01  INSPECT-COUNTER PIC 999 VALUE 3.
017900 01  PASS-COUNTER PIC 999 VALUE ZERO.
018000 01  TOTAL-ERROR PIC 999 VALUE ZERO.
018100 01  ERROR-HOLD PIC 999 VALUE ZERO.
018200 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
018300 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
018400 01  CCVS-H-1.
018500     02  FILLER   PICTURE X(27)  VALUE SPACE.
018600     02 FILLER PICTURE X(67) VALUE
018700     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
018800-    " SYSTEM".
018900     02  FILLER     PICTURE X(26)  VALUE SPACE.
019000 01  CCVS-H-2.
019100     02 FILLER PICTURE X(52) VALUE IS
019200     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
019300     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
019400     02 TEST-ID PICTURE IS X(9).
019500     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
019600 01  CCVS-H-3.
019700     02  FILLER PICTURE X(34) VALUE
019800     " FOR OFFICIAL USE ONLY    ".
019900     02  FILLER PICTURE X(58) VALUE
020000     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
020100     02  FILLER PICTURE X(28) VALUE
020200     "  COPYRIGHT   1985 ".
020300 01  CCVS-E-1.
020400     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
020500     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
020600     02 ID-AGAIN PICTURE IS X(9).
020700     02 FILLER PICTURE X(45) VALUE IS
020800     " NTIS DISTRIBUTION COBOL 85".
020900 01  CCVS-E-2.
021000     02  FILLER                   PICTURE X(31)  VALUE
021100     SPACE.
021200     02  FILLER                   PICTURE X(21)  VALUE SPACE.
021300     02 CCVS-E-2-2.
021400         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
021500         03 FILLER PICTURE IS X VALUE IS SPACE.
021600         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
021700 01  CCVS-E-3.
021800     02  FILLER PICTURE X(22) VALUE
021900     " FOR OFFICIAL USE ONLY".
022000     02  FILLER PICTURE X(12) VALUE SPACE.
022100     02  FILLER PICTURE X(58) VALUE
022200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
022300     02  FILLER PICTURE X(13) VALUE SPACE.
022400     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
022500 01  CCVS-E-4.
022600     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
022700     02 FILLER PIC XXXX VALUE " OF ".
022800     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
022900     02 FILLER PIC X(40) VALUE
023000      "  TESTS WERE EXECUTED SUCCESSFULLY".
023100 01  XXINFO.
023200     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
023300     02 INFO-TEXT.
023400     04 FILLER PIC X(20) VALUE SPACE.
023500     04 XXCOMPUTED PIC X(20).
023600     04 FILLER PIC X(5) VALUE SPACE.
023700     04 XXCORRECT PIC X(20).
023800 01  HYPHEN-LINE.
023900     02 FILLER PICTURE IS X VALUE IS SPACE.
024000     02 FILLER PICTURE IS X(65) VALUE IS "************************
024100-    "*****************************************".
024200     02 FILLER PICTURE IS X(54) VALUE IS "************************
024300-    "******************************".
024400 01  CCVS-PGM-ID PIC X(6) VALUE
024500     "SQ209M".
024600 PROCEDURE DIVISION.
024700 CCVS1 SECTION.
024800 OPEN-FILES.
024900P    OPEN I-O RAW-DATA.
025000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
025100P    READ RAW-DATA INVALID KEY GO TO END-E-1.
025200P    MOVE "ABORTED " TO C-ABORT.
025300P    ADD 1 TO C-NO-OF-TESTS.
025400P    ACCEPT C-DATE  FROM DATE.
025500P    ACCEPT C-TIME  FROM TIME.
025600P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
025700PEND-E-1.
025800P    CLOSE RAW-DATA.
025900     OPEN     OUTPUT PRINT-FILE.
026000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
026100     MOVE    SPACE TO TEST-RESULTS.
026200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
026300     GO TO CCVS1-EXIT.
026400 CLOSE-FILES.
026500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
026600P    OPEN I-O RAW-DATA.
026700P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
026800P    READ RAW-DATA INVALID KEY GO TO END-E-2.
026900P    MOVE "OK.     " TO C-ABORT.
027000P    MOVE PASS-COUNTER TO C-OK.
027100P    MOVE ERROR-HOLD   TO C-ALL.
027200P    MOVE ERROR-COUNTER TO C-FAIL.
027300P    MOVE DELETE-CNT TO C-DELETED.
027400P    MOVE INSPECT-COUNTER TO C-INSPECT.
027500P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
027600PEND-E-2.
027700P    CLOSE RAW-DATA.
027800 TERMINATE-CCVS.
027900S    EXIT PROGRAM.
028000STERMINATE-CALL.
028100     STOP     RUN.
028200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
028300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
028400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
028500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
028600     MOVE "****TEST DELETED****" TO RE-MARK.
028700 PRINT-DETAIL.
028800     IF REC-CT NOT EQUAL TO ZERO
028900             MOVE "." TO PARDOT-X
029000             MOVE REC-CT TO DOTVALUE.
029100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
029200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
029300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
029400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
029500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
029600     MOVE SPACE TO CORRECT-X.
029700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
029800     MOVE     SPACE TO RE-MARK.
029900 HEAD-ROUTINE.
030000     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030100     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
030200     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
030300 COLUMN-NAMES-ROUTINE.
030400     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030500     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030600     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
030700 END-ROUTINE.
030800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
030900 END-RTN-EXIT.
031000     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
031100 END-ROUTINE-1.
031200      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
031300      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
031400      ADD PASS-COUNTER TO ERROR-HOLD.
031500*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
031600      MOVE PASS-COUNTER TO CCVS-E-4-1.
031700      MOVE ERROR-HOLD TO CCVS-E-4-2.
031800      MOVE CCVS-E-4 TO CCVS-E-2-2.
031900      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
032000  END-ROUTINE-12.
032100      MOVE "TEST(S) FAILED" TO ENDER-DESC.
032200     IF       ERROR-COUNTER IS EQUAL TO ZERO
032300         MOVE "NO " TO ERROR-TOTAL
032400         ELSE
032500         MOVE ERROR-COUNTER TO ERROR-TOTAL.
032600     MOVE     CCVS-E-2 TO DUMMY-RECORD.
032700     PERFORM WRITE-LINE.
032800 END-ROUTINE-13.
032900     IF DELETE-CNT IS EQUAL TO ZERO
033000         MOVE "NO " TO ERROR-TOTAL  ELSE
033100         MOVE DELETE-CNT TO ERROR-TOTAL.
033200     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
033300     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033400      IF   INSPECT-COUNTER EQUAL TO ZERO
033500          MOVE "NO " TO ERROR-TOTAL
033600      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
033700      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
033800      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033900     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
034000 WRITE-LINE.
034100     ADD 1 TO RECORD-COUNT.
034200Y    IF RECORD-COUNT GREATER 50
034300Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
034400Y        MOVE SPACE TO DUMMY-RECORD
034500Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
034600Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
034700Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
034800Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
034900Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
035000Y        MOVE ZERO TO RECORD-COUNT.
035100     PERFORM WRT-LN.
035200 WRT-LN.
035300     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
035400     MOVE SPACE TO DUMMY-RECORD.
035500 BLANK-LINE-PRINT.
035600     PERFORM WRT-LN.
035700 FAIL-ROUTINE.
035800     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
035900     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
036000     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
036100     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036200     GO TO FAIL-ROUTINE-EX.
036300 FAIL-ROUTINE-WRITE.
036400     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
036500     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
036600 FAIL-ROUTINE-EX. EXIT.
036700 BAIL-OUT.
036800     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
036900     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
037000 BAIL-OUT-WRITE.
037100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
037200     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
037300 BAIL-OUT-EX. EXIT.
037400 CCVS1-EXIT.
037500     EXIT.
037600 SECT-SQ209M-0001 SECTION.
037700 WRITE-INIT-001.
037800     MOVE NOTE-1 TO PRINT-REC.
037900     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
038000     MOVE NOTE-2 TO PRINT-REC.
038100     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
038200     MOVE SPACE TO DUMMY-RECORD.
038300     PERFORM BLANK-LINE-PRINT.
038400 WRITE-TEST-GF-01.
038500*             THIS TEST CHECKS THE VERTICAL SPACING BETWEEN
038600*             LOGICAL PAGES.  BECAUSE ONLY THE TOP PHRASE IS
038700*             SPECIFIED THERE SHOULD BE TWO SPACES BETWEEN PAGES.
038800     MOVE "SPACE BTWN LOG PAGES" TO FEATURE.
038900     MOVE "WRITE-TEST-GF-01" TO PAR-NAME.
039000     PERFORM PRINT-DETAIL.
039100     PERFORM BLANK-LINE-PRINT UNTIL LINAGE-COUNTER EQUAL 39.
039200     MOVE LAST-LINE-1 TO PRINT-REC.
039300     WRITE PRINT-REC AFTER ONE LINE.
039400     WRITE PRINT-REC FROM FIRST-LINE-1 AFTER ADVANCING PAGE.
039500 WRITE-TEST-GF-02.
039600*             THIS TEST SHOWS THE RESULTS OF A WRITE BEFORE
039700*             OPERATION WITH AN EOP PHRASE. ONLY LINAGE IS
039800*             SPECIFIED.
039900     MOVE "WRITE BEFORE" TO FEATURE.
040000     MOVE "WRITE-TEST-GF-02" TO PAR-NAME.
040100     PERFORM PRINT-DETAIL.
040200     MOVE INFO-LINE-1 TO PRINT-REC.
040300     WRITE PRINT-REC AFTER ADVANCING 5 LINES.
040400     MOVE INFO-LINE-3 TO PRINT-REC.
040500     WRITE PRINT-REC AFTER ADVANCING 1 LINES.
040600     MOVE INFO-LINE-5 TO PRINT-REC.
040700     WRITE PRINT-REC AFTER ADVANCING 1 LINES.
040800     MOVE INFO-LINE-6 TO PRINT-REC.
040900     WRITE PRINT-REC AFTER ADVANCING 1 LINES.
041000     MOVE INFO-LINE-8 TO PRINT-REC.
041100     WRITE PRINT-REC AFTER ADVANCING 1 LINES.
041200     MOVE SPACES TO PRINT-REC.
041300     WRITE PRINT-REC BEFORE ADVANCING PAGE.
041400     MOVE 1 TO DL3-LINE-NO.
041500     PERFORM WRITE-BEFORE 60 TIMES.
041600 WRITE-TEST-GF-03.
041700*             THIS TEST SHOWS THE RESULTS OF A WRITE AFTER
041800*             OPERATION WITH AN EOP PHRASE. ONLY LINAGE IS
041900*             SPECIFIED.
042000     MOVE "WRITE AFTER" TO FEATURE.
042100     MOVE "WRITE-TEST-GF-03" TO PAR-NAME.
042200     PERFORM PRINT-DETAIL.
042300     MOVE INFO-LINE-2 TO PRINT-REC.
042400     WRITE PRINT-REC AFTER ADVANCING 5 LINES.
042500     MOVE INFO-LINE-3 TO PRINT-REC.
042600     WRITE PRINT-REC AFTER ADVANCING 1 LINES.
042700     MOVE INFO-LINE-4 TO PRINT-REC.
042800     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
042900     MOVE INFO-LINE-7 TO PRINT-REC.
043000     WRITE PRINT-REC AFTER ADVANCING 1 LINES.
043100     MOVE INFO-LINE-8 TO PRINT-REC.
043200     WRITE PRINT-REC AFTER ADVANCING 1 LINES.
043300     MOVE SPACES TO PRINT-REC.
043400     WRITE PRINT-REC BEFORE ADVANCING PAGE.
043500     MOVE 1 TO DL3-LINE-NO.
043600     PERFORM WRITE-AFTER 60 TIMES.
043700 SQ209M-END-ROUTINE.
043800     MOVE "END OF SQ209M VALIDATION TESTS" TO PRINT-REC.
043900     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
044000     GO TO CCVS-EXIT.
044100 WRITE-BEFORE.
044200     MOVE LINAGE-COUNTER TO DL3-LC.
044300     MOVE DETAIL-LINE-3 TO PRINT-REC.
044400     WRITE PRINT-REC BEFORE ADVANCING 1 LINE AT EOP
044500              MOVE LINAGE-COUNTER TO FL3-LC
044600              MOVE FOOT-LINE-3 TO PRINT-REC
044700              WRITE PRINT-REC BEFORE ADVANCING 1 LINE.
044800     ADD 1 TO DL3-LINE-NO.
044900 WRITE-AFTER.
045000     MOVE LINAGE-COUNTER TO DL3-LC.
045100     MOVE DETAIL-LINE-3 TO PRINT-REC.
045200     WRITE PRINT-REC AFTER ADVANCING 1 LINE AT EOP
045300              MOVE LINAGE-COUNTER TO FL3-LC
045400              MOVE FOOT-LINE-3 TO PRINT-REC
045500              WRITE PRINT-REC AFTER ADVANCING 1 LINE.
045600     ADD 1 TO DL3-LINE-NO.
045700 CCVS-EXIT SECTION.
045800 CCVS-999999.
045900     GO TO CLOSE-FILES.
