000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ207M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    " HIGH       ".
000800*                                                              *
000900*    CREATION DATE     /     VALIDATION DATE                   *
001000*    "4.2 ".
001100*                                                              *
001200*        THE ROUTINE SQ207M TESTS THE USE OF THE LEVEL 2 WRITE
001300*    STATEMENT FOR A FILE DESIGNATED AS PRINTER OUTPUT.  THESE
001400*    WRITE STATEMENTS CONTROL THE VERTICAL POSITIONING OF EACH
001500*    LINE ON A PRINTED PAGE.  SQ207M TESTS ALL POSSIBLE LEVEL 2
001600*    COMBINATIONS OF THE FROM AND ADVANCING PHRASES USING MNEMONIC
001700*    NAME.  IT IS ASSUMED THAT ALL LEVEL 2 NUCLEUS OPTIONS ARE
001800*    AVAILABLE IN TESTING SQ207M. THE VARIABLES IN THE TESTS ARE
001900*    IDENTIFIER-1 AND MNEMONIC-NAME.  HOWEVER, BECAUSE ONLY ONE
002000*    MNEMONIC-NAME IS DEFINED IN THE SPECIAL-NAMES PARAGRAPH,
002100*    SEPARATE RUNS MUST BE MADE FOR EACH MNEMONIC-NAME TESTED.
002200*    IDENTIFIER-1 IS A 77, 01, OR SUBGROUP IDENTIFIER IN THE
002300*    WORKING-STORAGE SECTION.  THIS TEST MAY BE DELETED IF NO
002400*    MNEMONIC-NAMES EXIST FOR THE SYSTEM BEING VALIDATED.
002500*        BECAUSE OF THE NATURE OF THESE TESTS A "PASS" OR "FAIL"
002600*    CANNOT BE DETERMINED WITHIN THE PROGRAM.  THE USER MUST
002700*    VISUALLY CHECK THE POSITION OF EACH LINE TO DETERMINE THE
002800*    ACCURACY OF THE VARIOUS WRITE OPTIONS.
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.
003200     XXXXX082.
003300 OBJECT-COMPUTER.
003400     XXXXX083.
003500 SPECIAL-NAMES.
003600     XXXXX073
003700             IS MNEMONIC-NAME.
003800 INPUT-OUTPUT SECTION.
003900 FILE-CONTROL.
004000P    SELECT RAW-DATA   ASSIGN TO
004100P    XXXXX062
004200P           ORGANIZATION IS INDEXED
004300P           ACCESS MODE IS RANDOM
004400P           RECORD KEY IS RAW-DATA-KEY.
004500     SELECT PRINT-FILE ASSIGN TO
004600     XXXXX055.
004700 DATA DIVISION.
004800 FILE SECTION.
004900P
005000PFD  RAW-DATA.
005100P
005200P01  RAW-DATA-SATZ.
005300P    05  RAW-DATA-KEY        PIC X(6).
005400P    05  C-DATE              PIC 9(6).
005500P    05  C-TIME              PIC 9(8).
005600P    05  C-NO-OF-TESTS       PIC 99.
005700P    05  C-OK                PIC 999.
005800P    05  C-ALL               PIC 999.
005900P    05  C-FAIL              PIC 999.
006000P    05  C-DELETED           PIC 999.
006100P    05  C-INSPECT           PIC 999.
006200P    05  C-NOTE              PIC X(13).
006300P    05  C-INDENT            PIC X.
006400P    05  C-ABORT             PIC X(8).
006500 FD  PRINT-FILE
006600C    LABEL RECORDS
006700C    XXXXX084
006800C    DATA RECORD IS PRINT-REC DUMMY-RECORD
006900               .
007000 01  PRINT-REC PICTURE X(120).
007100 01  DUMMY-RECORD PICTURE X(120).
007200 WORKING-STORAGE SECTION.
007300 77  BEFORE-MSG-1       PIC X(120)   VALUE   "          THIS LINE
007400-    "IS PRINTED BEFORE ADVANCING THE MNEMONIC-NAME SPACING.  IT S
007500-    "HOULD BE 1 LINE BELOW THE WRT-TEST LINE.".
007600 01  BEFORE-MSG-2      PIC X(120)   VALUE    "          THIS LINE
007700-    "IS PRINTED BEFORE ADVANCING THE MNEMONIC-NAME SPACING.  IT S
007800-    "HOULD BE 1 LINE BELOW THE WRT-TEST LINE.".
007900 01  BEFORE-MSG-3      PIC X(120)   VALUE    "          THIS LINE
008000-    "SHOULD BE WRITTEN ON THE LINE POSITIONED TO BY THE WRITE MNE
008100-    "MONIC-NAME OPTION BEING TESTED.".
008200 01  LEVEL-ONE.
008300     02 LEVEL-TWO.
008400        03 AFTER-MSG-1.
008500           04 FILLER    PIC X(10)    VALUE SPACES.
008600           04 FILLER    PIC X(110)   VALUE "THIS LINE IS PRINTED A
008700-             "FTER ADVANCING THE MNEMONIC-NAME SPACING.  IT SHOUL
008800-             "D BE WRITTEN ON THE LINE POSITIONED".
008900        03 AFTER-MSG-2.
009000           04 FILLER    PIC X(10)    VALUE SPACE.
009100           04 FILLER    PIC X(110)   VALUE "TO BY THE WRITE MNEMON
009200-             "IC-NAME OPTION BEING TESTED.".
009300 01  NOTE-1.
009400     02 FILLER          PIC X(40)    VALUE "BECAUSE OF THE NATURE
009500-    "OF THESE TESTS A ".
009600     02 FILLER          PIC X        VALUE QUOTE.
009700     02 FILLER          PIC X(4)     VALUE "PASS".
009800     02 FILLER          PIC X        VALUE QUOTE.
009900     02 FILLER          PIC X(4)     VALUE " OR ".
010000     02 FILLER          PIC X        VALUE QUOTE.
010100     02 FILLER          PIC X(4)     VALUE "FAIL".
010200     02 FILLER          PIC X        VALUE QUOTE.
010300     02 FILLER          PIC X(64)    VALUE " CANNOT BE DETERMINED
010400-    "WITHIN THE PROGRAM. THE USER MUST VISUALLY".
010500 01  NOTE-2             PIC X(120)   VALUE "CHECK THE POSITION OF
010600-    "EACH LINE TO DETERMINE THE ACCURACY OF THE VARIOUS WRITE OPT
010700-    "IONS. VII-52 4.7.3 (3, 6, 7, 8, 9)".
010800 01  TEST-RESULTS.
010900     02 FILLER                    PICTURE X VALUE SPACE.
011000     02 FEATURE                   PICTURE X(20) VALUE SPACE.
011100     02 FILLER                    PICTURE X VALUE SPACE.
011200     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
011300     02 FILLER                    PICTURE X  VALUE SPACE.
011400     02  PAR-NAME.
011500       03 FILLER PICTURE X(12) VALUE SPACE.
011600       03  PARDOT-X PICTURE X  VALUE SPACE.
011700       03 DOTVALUE PICTURE 99  VALUE ZERO.
011800       03 FILLER PIC X(5) VALUE SPACE.
011900     02 FILLER PIC X(10) VALUE SPACE.
012000     02 RE-MARK PIC X(61).
012100 01  TEST-COMPUTED.
012200     02 FILLER PIC X(30) VALUE SPACE.
012300     02 FILLER PIC X(17) VALUE "       COMPUTED=".
012400     02 COMPUTED-X.
012500     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
012600     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
012700     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
012800     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
012900     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
013000     03       CM-18V0 REDEFINES COMPUTED-A.
013100         04 COMPUTED-18V0                   PICTURE -9(18).
013200         04 FILLER                          PICTURE X.
013300     03 FILLER PIC X(50) VALUE SPACE.
013400 01  TEST-CORRECT.
013500     02 FILLER PIC X(30) VALUE SPACE.
013600     02 FILLER PIC X(17) VALUE "       CORRECT =".
013700     02 CORRECT-X.
013800     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
013900     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
014000     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
014100     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
014200     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
014300     03      CR-18V0 REDEFINES CORRECT-A.
014400         04 CORRECT-18V0                    PICTURE -9(18).
014500         04 FILLER                          PICTURE X.
014600     03 FILLER PIC X(50) VALUE SPACE.
014700 01  CCVS-C-1.
014800     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
014900-    "SS  PARAGRAPH-NAME
015000-    "        REMARKS".
015100     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
015200 01  CCVS-C-2.
015300     02 FILLER PICTURE IS X VALUE IS SPACE.
015400     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
015500     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
015600     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
015700     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
015800 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
015900 01  REC-CT PICTURE 99 VALUE ZERO.
016000 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
016100 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
016200 01  INSPECT-COUNTER PIC 999 VALUE 8.
016300 01  PASS-COUNTER PIC 999 VALUE ZERO.
016400 01  TOTAL-ERROR PIC 999 VALUE ZERO.
016500 01  ERROR-HOLD PIC 999 VALUE ZERO.
016600 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
016700 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
016800 01  CCVS-H-1.
016900     02  FILLER   PICTURE X(27)  VALUE SPACE.
017000     02 FILLER PICTURE X(67) VALUE
017100     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
017200-    " SYSTEM".
017300     02  FILLER     PICTURE X(26)  VALUE SPACE.
017400 01  CCVS-H-2.
017500     02 FILLER PICTURE X(52) VALUE IS
017600     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
017700     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
017800     02 TEST-ID PICTURE IS X(9).
017900     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
018000 01  CCVS-H-3.
018100     02  FILLER PICTURE X(34) VALUE
018200     " FOR OFFICIAL USE ONLY    ".
018300     02  FILLER PICTURE X(58) VALUE
018400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
018500     02  FILLER PICTURE X(28) VALUE
018600     "  COPYRIGHT   1985 ".
018700 01  CCVS-E-1.
018800     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
018900     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
019000     02 ID-AGAIN PICTURE IS X(9).
019100     02 FILLER PICTURE X(45) VALUE IS
019200     " NTIS DISTRIBUTION COBOL 85".
019300 01  CCVS-E-2.
019400     02  FILLER                   PICTURE X(31)  VALUE
019500     SPACE.
019600     02  FILLER                   PICTURE X(21)  VALUE SPACE.
019700     02 CCVS-E-2-2.
019800         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
019900         03 FILLER PICTURE IS X VALUE IS SPACE.
020000         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
020100 01  CCVS-E-3.
020200     02  FILLER PICTURE X(22) VALUE
020300     " FOR OFFICIAL USE ONLY".
020400     02  FILLER PICTURE X(12) VALUE SPACE.
020500     02  FILLER PICTURE X(58) VALUE
020600     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020700     02  FILLER PICTURE X(13) VALUE SPACE.
020800     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
020900 01  CCVS-E-4.
021000     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
021100     02 FILLER PIC XXXX VALUE " OF ".
021200     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
021300     02 FILLER PIC X(40) VALUE
021400      "  TESTS WERE EXECUTED SUCCESSFULLY".
021500 01  XXINFO.
021600     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
021700     02 INFO-TEXT.
021800     04 FILLER PIC X(20) VALUE SPACE.
021900     04 XXCOMPUTED PIC X(20).
022000     04 FILLER PIC X(5) VALUE SPACE.
022100     04 XXCORRECT PIC X(20).
022200 01  HYPHEN-LINE.
022300     02 FILLER PICTURE IS X VALUE IS SPACE.
022400     02 FILLER PICTURE IS X(65) VALUE IS "************************
022500-    "*****************************************".
022600     02 FILLER PICTURE IS X(54) VALUE IS "************************
022700-    "******************************".
022800 01  CCVS-PGM-ID PIC X(6) VALUE
022900     "SQ207M".
023000 PROCEDURE DIVISION.
023100 CCVS1 SECTION.
023200 OPEN-FILES.
023300P    OPEN I-O RAW-DATA.
023400P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
023500P    READ RAW-DATA INVALID KEY GO TO END-E-1.
023600P    MOVE "ABORTED " TO C-ABORT.
023700P    ADD 1 TO C-NO-OF-TESTS.
023800P    ACCEPT C-DATE  FROM DATE.
023900P    ACCEPT C-TIME  FROM TIME.
024000P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
024100PEND-E-1.
024200P    CLOSE RAW-DATA.
024300     OPEN     OUTPUT PRINT-FILE.
024400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
024500     MOVE    SPACE TO TEST-RESULTS.
024600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
024700     GO TO CCVS1-EXIT.
024800 CLOSE-FILES.
024900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
025000P    OPEN I-O RAW-DATA.
025100P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
025200P    READ RAW-DATA INVALID KEY GO TO END-E-2.
025300P    MOVE "OK.     " TO C-ABORT.
025400P    MOVE PASS-COUNTER TO C-OK.
025500P    MOVE ERROR-HOLD   TO C-ALL.
025600P    MOVE ERROR-COUNTER TO C-FAIL.
025700P    MOVE DELETE-CNT TO C-DELETED.
025800P    MOVE INSPECT-COUNTER TO C-INSPECT.
025900P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
026000PEND-E-2.
026100P    CLOSE RAW-DATA.
026200 TERMINATE-CCVS.
026300S    EXIT PROGRAM.
026400STERMINATE-CALL.
026500     STOP     RUN.
026600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
026700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
026800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
026900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
027000     MOVE "****TEST DELETED****" TO RE-MARK.
027100 PRINT-DETAIL.
027200     IF REC-CT NOT EQUAL TO ZERO
027300             MOVE "." TO PARDOT-X
027400             MOVE REC-CT TO DOTVALUE.
027500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
027600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
027700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
027800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
027900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
028000     MOVE SPACE TO CORRECT-X.
028100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
028200     MOVE     SPACE TO RE-MARK.
028300 HEAD-ROUTINE.
028400     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028500     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
028600     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
028700 COLUMN-NAMES-ROUTINE.
028800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
029100 END-ROUTINE.
029200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
029300 END-RTN-EXIT.
029400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029500 END-ROUTINE-1.
029600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
029700      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
029800      ADD PASS-COUNTER TO ERROR-HOLD.
029900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
030000      MOVE PASS-COUNTER TO CCVS-E-4-1.
030100      MOVE ERROR-HOLD TO CCVS-E-4-2.
030200      MOVE CCVS-E-4 TO CCVS-E-2-2.
030300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
030400  END-ROUTINE-12.
030500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
030600     IF       ERROR-COUNTER IS EQUAL TO ZERO
030700         MOVE "NO " TO ERROR-TOTAL
030800         ELSE
030900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
031000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
031100     PERFORM WRITE-LINE.
031200 END-ROUTINE-13.
031300     IF DELETE-CNT IS EQUAL TO ZERO
031400         MOVE "NO " TO ERROR-TOTAL  ELSE
031500         MOVE DELETE-CNT TO ERROR-TOTAL.
031600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
031700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031800      IF   INSPECT-COUNTER EQUAL TO ZERO
031900          MOVE "NO " TO ERROR-TOTAL
032000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
032100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
032200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032400 WRITE-LINE.
032500     ADD 1 TO RECORD-COUNT.
032600Y    IF RECORD-COUNT GREATER 50
032700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
032800Y        MOVE SPACE TO DUMMY-RECORD
032900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
033000Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
033100Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
033200Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
033300Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
033400Y        MOVE ZERO TO RECORD-COUNT.
033500     PERFORM WRT-LN.
033600 WRT-LN.
033700     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
033800     MOVE SPACE TO DUMMY-RECORD.
033900 BLANK-LINE-PRINT.
034000     PERFORM WRT-LN.
034100 FAIL-ROUTINE.
034200     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
034300     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
034400     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
034500     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034600     GO TO FAIL-ROUTINE-EX.
034700 FAIL-ROUTINE-WRITE.
034800     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
034900     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
035000 FAIL-ROUTINE-EX. EXIT.
035100 BAIL-OUT.
035200     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
035300     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
035400 BAIL-OUT-WRITE.
035500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
035600     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035700 BAIL-OUT-EX. EXIT.
035800 CCVS1-EXIT.
035900     EXIT.
036000 SECT-SQ207M-0001 SECTION.
036100 WRITE-INIT-GF-01.
036200     MOVE NOTE-1 TO PRINT-REC.
036300     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
036400     MOVE NOTE-2 TO PRINT-REC.
036500     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
036600     MOVE SPACE TO DUMMY-RECORD.
036700     PERFORM BLANK-LINE-PRINT.
036800 WRITE-TEST-GF-01.
036900     MOVE "WRT FRM BFR ADV MNC" TO FEATURE.
037000     MOVE "WRITE-TEST-GF-01" TO PAR-NAME.
037100     MOVE "FROM 77 LEVEL" TO RE-MARK.
037200     PERFORM WRITE-TEST-LINE.
037300     WRITE PRINT-REC FROM BEFORE-MSG-1 BEFORE ADVANCING
037400              MNEMONIC-NAME.
037500     WRITE PRINT-REC FROM BEFORE-MSG-3 BEFORE ADVANCING 0 LINE.
037600 WRITE-TEST-GF-02.
037700     MOVE "WRT FRM BFR MNC" TO FEATURE.
037800     MOVE "WRITE-TEST-GF-02" TO PAR-NAME.
037900     MOVE "FROM 01 LEVEL" TO RE-MARK.
038000     PERFORM WRITE-TEST-LINE.
038100     WRITE PRINT-REC FROM BEFORE-MSG-2 BEFORE MNEMONIC-NAME.
038200     WRITE PRINT-REC FROM BEFORE-MSG-3 BEFORE ADVANCING 0 LINE.
038300 WRITE-TEST-GF-03.
038400     MOVE "WRT FRM AFT ADV MNC" TO FEATURE.
038500     MOVE "WRITE-TEST-GF-03" TO PAR-NAME.
038600     MOVE "FROM 03 LEVEL" TO RE-MARK.
038700     PERFORM WRITE-TEST-LINE.
038800     WRITE PRINT-REC FROM AFTER-MSG-1 AFTER ADVANCING
038900              MNEMONIC-NAME.
039000     WRITE PRINT-REC FROM AFTER-MSG-2 AFTER ADVANCING 1 LINE.
039100 WRITE-TEST-GF-04.
039200     MOVE "WRT FRM AFT MNC" TO FEATURE.
039300     MOVE "WRITE-TEST-GF-04" TO PAR-NAME.
039400     PERFORM WRITE-TEST-LINE.
039500     WRITE PRINT-REC FROM AFTER-MSG-1 AFTER MNEMONIC-NAME.
039600     WRITE PRINT-REC FROM AFTER-MSG-2 AFTER ADVANCING 1 LINE.
039700 WRITE-TEST-GF-05.
039800     MOVE "WRT BFR ADV MNC" TO FEATURE.
039900     MOVE "WRITE-TEST-GF-05" TO PAR-NAME.
040000     PERFORM WRITE-TEST-LINE.
040100     MOVE BEFORE-MSG-1 TO PRINT-REC.
040200     WRITE PRINT-REC BEFORE ADVANCING MNEMONIC-NAME.
040300     MOVE BEFORE-MSG-3 TO PRINT-REC.
040400     WRITE PRINT-REC BEFORE ADVANCING 0 LINE.
040500 WRITE-TEST-GF-06.
040600     MOVE "WRT BFR MNC" TO FEATURE.
040700     MOVE "WRITE-TEST-GF-06" TO PAR-NAME.
040800     PERFORM WRITE-TEST-LINE.
040900     MOVE BEFORE-MSG-2 TO PRINT-REC.
041000     WRITE PRINT-REC BEFORE MNEMONIC-NAME.
041100     MOVE BEFORE-MSG-3 TO PRINT-REC.
041200     WRITE PRINT-REC BEFORE ADVANCING 0 LINE.
041300 WRITE-TEST-GF-07.
041400     MOVE "WRT AFT ADV MNC" TO FEATURE.
041500     MOVE "WRITE-TEST-GF-07" TO PAR-NAME.
041600     MOVE "RECORD-NAME IS QUALIFIED (IN)" TO RE-MARK.
041700     PERFORM WRITE-TEST-LINE.
041800     MOVE AFTER-MSG-1 TO PRINT-REC.
041900     WRITE PRINT-REC IN PRINT-FILE AFTER ADVANCING MNEMONIC-NAME.
042000     MOVE AFTER-MSG-2 TO PRINT-REC.
042100     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
042200 WRITE-TEST-GF-08.
042300     MOVE "WRT AFT MNC" TO FEATURE.
042400     MOVE "WRITE-TEST-GF-08" TO PAR-NAME.
042500     MOVE "RECORD-NAME IS QUALIFIED (OF)" TO RE-MARK.
042600     PERFORM WRITE-TEST-LINE.
042700     MOVE AFTER-MSG-1 TO PRINT-REC.
042800     WRITE PRINT-REC OF PRINT-FILE AFTER MNEMONIC-NAME.
042900     MOVE AFTER-MSG-2 TO PRINT-REC.
043000     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
043100 SQ207M-END-ROUTINE.
043200     MOVE "END OF SQ207M VALIDATION TESTS" TO PRINT-REC.
043300     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
043400     GO TO CCVS-EXIT.
043500 WRITE-TEST-LINE.
043600     PERFORM PRINT-DETAIL.
043700     PERFORM BLANK-LINE-PRINT.
043800 CCVS-EXIT SECTION.
043900 CCVS-999999.
044000     GO TO CLOSE-FILES.
