000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ203A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    " HIGH       ".
000800*                                                              *
000900*    CREATION DATE     /     VALIDATION DATE                   *
001000*    "4.2 ".
001100*                                                              *
001200*         THE ROUTINE SQ203A TESTS THE USE OF THE OPTIONAL CLAUSE
001300*    IN THE SELECT CLAUSE OF A FILE CONTROL ENTRY.  THE TEST IS
001400*    MADE WHEN THE OPTIONAL FILE IS BOTH PRESENT AND ABSENT.
001500*    THE RESERVE INTEGER AREA CLAUSE IS ALSO INCLUDE IN THIS TEST.
001600 ENVIRONMENT DIVISION.
001700 CONFIGURATION SECTION.
001800 SOURCE-COMPUTER.
001900     XXXXX082.
002000 OBJECT-COMPUTER.
002100     XXXXX083.
002200 INPUT-OUTPUT SECTION.
002300 FILE-CONTROL.
002400P    SELECT RAW-DATA   ASSIGN TO
002500P    XXXXX062
002600P           ORGANIZATION IS INDEXED
002700P           ACCESS MODE IS RANDOM
002800P           RECORD KEY IS RAW-DATA-KEY.
002900     SELECT PRINT-FILE ASSIGN TO
003000     XXXXX055.
003100     SELECT OPTIONAL SQ-FS1
003200     ASSIGN TO
003300     XXXXD001
003400     RESERVE 8 AREAS
003500     ORGANIZATION IS SEQUENTIAL
003600     ACCESS MODE IS SEQUENTIAL
003700     FILE STATUS GRP-STATUS-KEY-1.
003800     SELECT OPTIONAL SQ-FS2
003900     ASSIGN TO
004000     XXXXX018
004100     STATUS GRP-STATUS-KEY-2.
004200     SELECT SQ-FS3 ASSIGN TO
004300     XXXXX003
004400     RESERVE 7 AREA
004500     ORGANIZATION SEQUENTIAL
004600     ACCESS SEQUENTIAL
004700     FILE STATUS IS GRP-STATUS-KEY-3.
004800     SELECT OPTIONAL SQ-FS4 ASSIGN TO
004900     XXXXX017
005000     ORGANIZATION IS SEQUENTIAL.
005100 DATA DIVISION.
005200 FILE SECTION.
005300P
005400PFD  RAW-DATA.
005500P
005600P01  RAW-DATA-SATZ.
005700P    05  RAW-DATA-KEY        PIC X(6).
005800P    05  C-DATE              PIC 9(6).
005900P    05  C-TIME              PIC 9(8).
006000P    05  C-NO-OF-TESTS       PIC 99.
006100P    05  C-OK                PIC 999.
006200P    05  C-ALL               PIC 999.
006300P    05  C-FAIL              PIC 999.
006400P    05  C-DELETED           PIC 999.
006500P    05  C-INSPECT           PIC 999.
006600P    05  C-NOTE              PIC X(13).
006700P    05  C-INDENT            PIC X.
006800P    05  C-ABORT             PIC X(8).
006900 FD  PRINT-FILE
007000C    LABEL RECORDS
007100C    XXXXX084
007200C    DATA RECORD IS PRINT-REC DUMMY-RECORD
007300               .
007400 01  PRINT-REC PICTURE X(120).
007500 01  DUMMY-RECORD PICTURE X(120).
007600 FD  SQ-FS1
007700C    LABEL RECORDS ARE STANDARD
007800     BLOCK CONTAINS 120 CHARACTERS.
007900 01  SQ-FS1R1-F-G-120 PIC X(120).
008000 FD  SQ-FS2
008100C    LABEL RECORDS ARE STANDARD
008200     BLOCK CONTAINS 120 CHARACTERS.
008300 01  SQ-FS2R1-F-G-120 PIC X(120).
008400 FD  SQ-FS3
008500C    LABEL RECORDS ARE STANDARD
008600     BLOCK CONTAINS 120 CHARACTERS.
008700 01  SQ-FS3R1-F-G-120 PIC X(120).
008800 FD  SQ-FS4
008900C    LABEL RECORDS ARE STANDARD
009000     BLOCK CONTAINS 120 CHARACTERS.
009100 01  SQ-FS4R1-F-G-120 PIC X(120).
009200 WORKING-STORAGE SECTION.
009300 01  COUNT-OF-RECS PIC 9999.
009400 01  EOF-FLAG         PIC 99  VALUE 0.
009500 01  GRP-STATUS-KEY-1.
009600     02 WRK-XN-00001-KEY-1   PIC X.
009700     02 FILLER               PIC X.
009800 01  GRP-STATUS-KEY-2.
009900     02 WRK-XN-00001-KEY-2   PIC X.
010000     02 FILLER               PIC X.
010100 01  GRP-STATUS-KEY-3.
010200     02 WRK-XN-00001-KEY-3   PIC X.
010300     02 FILLER               PIC X.
010400 01  FILE-RECORD-INFORMATION-REC.
010500     03 FILE-RECORD-INFO-SKELETON.
010600        05 FILLER                 PICTURE X(48)       VALUE
010700             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
010800        05 FILLER                 PICTURE X(46)       VALUE
010900             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
011000        05 FILLER                 PICTURE X(26)       VALUE
011100             ",LFIL=000000,ORG=  ,LBLR= ".
011200        05 FILLER                 PICTURE X(37)       VALUE
011300             ",RECKEY=                             ".
011400        05 FILLER                 PICTURE X(38)       VALUE
011500             ",ALTKEY1=                             ".
011600        05 FILLER                 PICTURE X(38)       VALUE
011700             ",ALTKEY2=                             ".
011800        05 FILLER                 PICTURE X(7)        VALUE SPACE.
011900     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
012000        05 FILE-RECORD-INFO-P1-120.
012100           07 FILLER              PIC X(5).
012200           07 XFILE-NAME           PIC X(6).
012300           07 FILLER              PIC X(8).
012400           07 XRECORD-NAME         PIC X(6).
012500           07 FILLER              PIC X(1).
012600           07 REELUNIT-NUMBER     PIC 9(1).
012700           07 FILLER              PIC X(7).
012800           07 XRECORD-NUMBER       PIC 9(6).
012900           07 FILLER              PIC X(6).
013000           07 UPDATE-NUMBER       PIC 9(2).
013100           07 FILLER              PIC X(5).
013200           07 ODO-NUMBER          PIC 9(4).
013300           07 FILLER              PIC X(5).
013400           07 XPROGRAM-NAME        PIC X(5).
013500           07 FILLER              PIC X(7).
013600           07 XRECORD-LENGTH       PIC 9(6).
013700           07 FILLER              PIC X(7).
013800           07 CHARS-OR-RECORDS    PIC X(2).
013900           07 FILLER              PIC X(1).
014000           07 XBLOCK-SIZE          PIC 9(4).
014100           07 FILLER              PIC X(6).
014200           07 RECORDS-IN-FILE     PIC 9(6).
014300           07 FILLER              PIC X(5).
014400           07 XFILE-ORGANIZATION   PIC X(2).
014500           07 FILLER              PIC X(6).
014600           07 XLABEL-TYPE          PIC X(1).
014700        05 FILE-RECORD-INFO-P121-240.
014800           07 FILLER              PIC X(8).
014900           07 XRECORD-KEY          PIC X(29).
015000           07 FILLER              PIC X(9).
015100           07 ALTERNATE-KEY1      PIC X(29).
015200           07 FILLER              PIC X(9).
015300           07 ALTERNATE-KEY2      PIC X(29).
015400           07 FILLER              PIC X(7).
015500 01  TEST-RESULTS.
015600     02 FILLER                    PICTURE X VALUE SPACE.
015700     02 FEATURE                   PICTURE X(20) VALUE SPACE.
015800     02 FILLER                    PICTURE X VALUE SPACE.
015900     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
016000     02 FILLER                    PICTURE X  VALUE SPACE.
016100     02  PAR-NAME.
016200       03 FILLER PICTURE X(12) VALUE SPACE.
016300       03  PARDOT-X PICTURE X  VALUE SPACE.
016400       03 DOTVALUE PICTURE 99  VALUE ZERO.
016500       03 FILLER PIC X(5) VALUE SPACE.
016600     02 FILLER PIC X(10) VALUE SPACE.
016700     02 RE-MARK PIC X(61).
016800 01  TEST-COMPUTED.
016900     02 FILLER PIC X(30) VALUE SPACE.
017000     02 FILLER PIC X(17) VALUE "       COMPUTED=".
017100     02 COMPUTED-X.
017200     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
017300     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
017400     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
017500     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
017600     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
017700     03       CM-18V0 REDEFINES COMPUTED-A.
017800         04 COMPUTED-18V0                   PICTURE -9(18).
017900         04 FILLER                          PICTURE X.
018000     03 FILLER PIC X(50) VALUE SPACE.
018100 01  TEST-CORRECT.
018200     02 FILLER PIC X(30) VALUE SPACE.
018300     02 FILLER PIC X(17) VALUE "       CORRECT =".
018400     02 CORRECT-X.
018500     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
018600     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
018700     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
018800     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
018900     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
019000     03      CR-18V0 REDEFINES CORRECT-A.
019100         04 CORRECT-18V0                    PICTURE -9(18).
019200         04 FILLER                          PICTURE X.
019300     03 FILLER PIC X(50) VALUE SPACE.
019400 01  CCVS-C-1.
019500     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
019600-    "SS  PARAGRAPH-NAME
019700-    "        REMARKS".
019800     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
019900 01  CCVS-C-2.
020000     02 FILLER PICTURE IS X VALUE IS SPACE.
020100     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
020200     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
020300     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
020400     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
020500 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
020600 01  REC-CT PICTURE 99 VALUE ZERO.
020700 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
020800 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
020900 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
021000 01  PASS-COUNTER PIC 999 VALUE ZERO.
021100 01  TOTAL-ERROR PIC 999 VALUE ZERO.
021200 01  ERROR-HOLD PIC 999 VALUE ZERO.
021300 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
021400 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
021500 01  CCVS-H-1.
021600     02  FILLER   PICTURE X(27)  VALUE SPACE.
021700     02 FILLER PICTURE X(67) VALUE
021800     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
021900-    " SYSTEM".
022000     02  FILLER     PICTURE X(26)  VALUE SPACE.
022100 01  CCVS-H-2.
022200     02 FILLER PICTURE X(52) VALUE IS
022300     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
022400     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
022500     02 TEST-ID PICTURE IS X(9).
022600     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
022700 01  CCVS-H-3.
022800     02  FILLER PICTURE X(34) VALUE
022900     " FOR OFFICIAL USE ONLY    ".
023000     02  FILLER PICTURE X(58) VALUE
023100     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
023200     02  FILLER PICTURE X(28) VALUE
023300     "  COPYRIGHT   1985 ".
023400 01  CCVS-E-1.
023500     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
023600     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
023700     02 ID-AGAIN PICTURE IS X(9).
023800     02 FILLER PICTURE X(45) VALUE IS
023900     " NTIS DISTRIBUTION COBOL 85".
024000 01  CCVS-E-2.
024100     02  FILLER                   PICTURE X(31)  VALUE
024200     SPACE.
024300     02  FILLER                   PICTURE X(21)  VALUE SPACE.
024400     02 CCVS-E-2-2.
024500         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
024600         03 FILLER PICTURE IS X VALUE IS SPACE.
024700         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
024800 01  CCVS-E-3.
024900     02  FILLER PICTURE X(22) VALUE
025000     " FOR OFFICIAL USE ONLY".
025100     02  FILLER PICTURE X(12) VALUE SPACE.
025200     02  FILLER PICTURE X(58) VALUE
025300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025400     02  FILLER PICTURE X(13) VALUE SPACE.
025500     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
025600 01  CCVS-E-4.
025700     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
025800     02 FILLER PIC XXXX VALUE " OF ".
025900     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
026000     02 FILLER PIC X(40) VALUE
026100      "  TESTS WERE EXECUTED SUCCESSFULLY".
026200 01  XXINFO.
026300     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
026400     02 INFO-TEXT.
026500     04 FILLER PIC X(20) VALUE SPACE.
026600     04 XXCOMPUTED PIC X(20).
026700     04 FILLER PIC X(5) VALUE SPACE.
026800     04 XXCORRECT PIC X(20).
026900 01  HYPHEN-LINE.
027000     02 FILLER PICTURE IS X VALUE IS SPACE.
027100     02 FILLER PICTURE IS X(65) VALUE IS "************************
027200-    "*****************************************".
027300     02 FILLER PICTURE IS X(54) VALUE IS "************************
027400-    "******************************".
027500 01  CCVS-PGM-ID PIC X(6) VALUE
027600     "SQ203A".
027700 PROCEDURE DIVISION.
027800 DECLARATIVES.
027900 USE-1 SECTION.
028000     USE AFTER STANDARD EXCEPTION PROCEDURE ON INPUT.
028100 USE-1-PROCEDURE.
028200     IF WRK-XN-00001-KEY-2 EQUAL TO "1"
028300          MOVE 1 TO EOF-FLAG.
028400 END DECLARATIVES.
028500 CCVS1 SECTION.
028600 OPEN-FILES.
028700P    OPEN I-O RAW-DATA.
028800P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
028900P    READ RAW-DATA INVALID KEY GO TO END-E-1.
029000P    MOVE "ABORTED " TO C-ABORT.
029100P    ADD 1 TO C-NO-OF-TESTS.
029200P    ACCEPT C-DATE  FROM DATE.
029300P    ACCEPT C-TIME  FROM TIME.
029400P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
029500PEND-E-1.
029600P    CLOSE RAW-DATA.
029700     OPEN     OUTPUT PRINT-FILE.
029800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
029900     MOVE    SPACE TO TEST-RESULTS.
030000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
030100     MOVE ZERO TO REC-SKL-SUB.
030200     PERFORM CCVS-INIT-FILE 9 TIMES.
030300 CCVS-INIT-FILE.
030400     ADD 1 TO REC-SKL-SUB.
030500     MOVE FILE-RECORD-INFO-SKELETON TO
030600                  FILE-RECORD-INFO (REC-SKL-SUB).
030700 CCVS-INIT-EXIT.
030800     GO TO CCVS1-EXIT.
030900 CLOSE-FILES.
031000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
031100P    OPEN I-O RAW-DATA.
031200P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
031300P    READ RAW-DATA INVALID KEY GO TO END-E-2.
031400P    MOVE "OK.     " TO C-ABORT.
031500P    MOVE PASS-COUNTER TO C-OK.
031600P    MOVE ERROR-HOLD   TO C-ALL.
031700P    MOVE ERROR-COUNTER TO C-FAIL.
031800P    MOVE DELETE-CNT TO C-DELETED.
031900P    MOVE INSPECT-COUNTER TO C-INSPECT.
032000P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
032100PEND-E-2.
032200P    CLOSE RAW-DATA.
032300 TERMINATE-CCVS.
032400S    EXIT PROGRAM.
032500STERMINATE-CALL.
032600     STOP     RUN.
032700 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
032800 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
032900 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
033000 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
033100     MOVE "****TEST DELETED****" TO RE-MARK.
033200 PRINT-DETAIL.
033300     IF REC-CT NOT EQUAL TO ZERO
033400             MOVE "." TO PARDOT-X
033500             MOVE REC-CT TO DOTVALUE.
033600     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
033700     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
033800        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
033900          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
034000     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
034100     MOVE SPACE TO CORRECT-X.
034200     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
034300     MOVE     SPACE TO RE-MARK.
034400 HEAD-ROUTINE.
034500     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034600     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
034700     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
034800 COLUMN-NAMES-ROUTINE.
034900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
035200 END-ROUTINE.
035300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
035400 END-RTN-EXIT.
035500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035600 END-ROUTINE-1.
035700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
035800      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
035900      ADD PASS-COUNTER TO ERROR-HOLD.
036000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
036100      MOVE PASS-COUNTER TO CCVS-E-4-1.
036200      MOVE ERROR-HOLD TO CCVS-E-4-2.
036300      MOVE CCVS-E-4 TO CCVS-E-2-2.
036400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
036500  END-ROUTINE-12.
036600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
036700     IF       ERROR-COUNTER IS EQUAL TO ZERO
036800         MOVE "NO " TO ERROR-TOTAL
036900         ELSE
037000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
037100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
037200     PERFORM WRITE-LINE.
037300 END-ROUTINE-13.
037400     IF DELETE-CNT IS EQUAL TO ZERO
037500         MOVE "NO " TO ERROR-TOTAL  ELSE
037600         MOVE DELETE-CNT TO ERROR-TOTAL.
037700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
037800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037900      IF   INSPECT-COUNTER EQUAL TO ZERO
038000          MOVE "NO " TO ERROR-TOTAL
038100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
038200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038500 WRITE-LINE.
038600     ADD 1 TO RECORD-COUNT.
038700Y    IF RECORD-COUNT GREATER 50
038800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
038900Y        MOVE SPACE TO DUMMY-RECORD
039000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039100Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
039200Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
039300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
039400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
039500Y        MOVE ZERO TO RECORD-COUNT.
039600     PERFORM WRT-LN.
039700 WRT-LN.
039800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
039900     MOVE SPACE TO DUMMY-RECORD.
040000 BLANK-LINE-PRINT.
040100     PERFORM WRT-LN.
040200 FAIL-ROUTINE.
040300     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
040400     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
040500     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
040600     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040700     GO TO FAIL-ROUTINE-EX.
040800 FAIL-ROUTINE-WRITE.
040900     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
041000     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
041100 FAIL-ROUTINE-EX. EXIT.
041200 BAIL-OUT.
041300     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
041400     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
041500 BAIL-OUT-WRITE.
041600     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
041700     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041800 BAIL-OUT-EX. EXIT.
041900 CCVS1-EXIT.
042000     EXIT.
042100 SECT-SQ203A-0001 SECTION.
042200 READ-INIT-GF-01.
042300*             THIS IS A TEST FOR SELECT OPTIONAL SQ-FS1. IN
042400*             THIS TEST THE FILE IS PRESENT THEREFORE IT SHOULD
042500*             OPEN AND HAVE THE FIRST RECORD READ CORRECTLY
042600*             WITHOUT TRANSFERING CONTROL TO THE AT END CONDITION.
042700     MOVE "READ-TEST-GF-01" TO PAR-NAME.
042800     MOVE "SELECT OPTIONAL F-N" TO FEATURE.
042900     MOVE "FILE PRESENT" TO RE-MARK.
043000 READ-TEST-GF-01.
043100     OPEN INPUT SQ-FS1.
043200     READ SQ-FS1 ; AT END GO TO READ-FAIL-GF-01.
043300     MOVE SQ-FS1R1-F-G-120 TO FILE-RECORD-INFO-P1-120 (1).
043400     IF XFILE-NAME (1) NOT EQUAL TO "SQ-FS1"
043500              MOVE "INVALID XFILE-NAME" TO RE-MARK
043600              GO TO READ-FAIL-GF-01.
043700     IF XRECORD-NUMBER (1) NOT EQUAL TO 1
043800              MOVE "INVALID RECORD NUMBER" TO RE-MARK
043900              GO TO READ-FAIL-GF-01.
044000     GO TO READ-PASS-GF-01.
044100 READ-DELETE-GF-01.
044200     PERFORM DE-LETE.
044300     GO TO READ-WRITE-GF-01.
044400 READ-FAIL-GF-01.
044500     MOVE "VII-7 2.3.2; VII-8 2.3.4 (2); GR (4) B, (10)"
044600        TO RE-MARK.
044700     PERFORM FAIL.
044800     CLOSE SQ-FS1.
044900     GO TO READ-WRITE-GF-01.
045000 READ-PASS-GF-01.
045100     PERFORM PASS.
045200     CLOSE SQ-FS1.
045300 READ-WRITE-GF-01.
045400     PERFORM PRINT-DETAIL.
045500 READ-INIT-GF-02.
045600*             THIS IS A TEST FOR SELECT OPTIONAL SQ-FS4     IN
045700*             WHICH THE FIRST READ STATEMENT HAS AN AT END PHRASE.
045800*             IN THIS TEST THE SELECTED FILE IS NOT PRESENT.
045900     MOVE "READ-TEST-GF-02" TO PAR-NAME.
046000     MOVE "SELECT OPTIONAL F-N" TO FEATURE.
046100     MOVE "FILE NOT PRESENT" TO RE-MARK.
046200 READ-TEST-GF-02.
046300     OPEN INPUT SQ-FS4.
046400     READ SQ-FS4 ; AT END GO TO READ-PASS-GF-02.
046500     GO TO READ-FAIL-GF-02.
046600 READ-DELETE-GF-02.
046700     PERFORM DE-LETE.
046800     GO TO READ-WRITE-GF-02.
046900 READ-FAIL-GF-02.
047000     MOVE "VII-7 2.3.2; VII-8 2.3.4 (2); GR (4) B, (10)"
047100        TO RE-MARK.
047200     PERFORM FAIL.
047300     CLOSE SQ-FS4.
047400     GO TO READ-WRITE-GF-02.
047500 READ-PASS-GF-02.
047600     PERFORM PASS.
047700     CLOSE SQ-FS4.
047800 READ-WRITE-GF-02.
047900     PERFORM PRINT-DETAIL.
048000 READ-INIT-GF-03.
048100*             THIS IS A TEST FOR SELECT OPTIONAL SQ-FS2     IN
048200*             WHICH THE FIRST READ STATEMENT DOES NOT HAVE AN AT
048300*             END PHRASE.  INSTEAD A USE STATEMENT IS SPECIFIED.
048400*             IN THIS TEST THE SELECTED FILE IS NOT PRESENT.
048500     MOVE "READ-TEST-GF-03" TO PAR-NAME.
048600     MOVE "SELECT OPTIONAL F-N" TO FEATURE.
048700     MOVE "FILE NOT PRESENT" TO RE-MARK.
048800 READ-TEST-GF-03.
048900     OPEN INPUT SQ-FS2.
049000     READ SQ-FS2.
049100     IF EOF-FLAG EQUAL TO 1
049200              GO TO READ-PASS-GF-03.
049300     GO TO READ-FAIL-GF-03.
049400 READ-DELETE-GF-03.
049500     PERFORM DE-LETE.
049600     GO TO READ-WRITE-GF-03.
049700 READ-FAIL-GF-03.
049800     MOVE "VII-7 2.3.2; VII-8 2.3.4 (2); GR (4) B, (10)"
049900        TO RE-MARK.
050000     PERFORM FAIL.
050100     MOVE WRK-XN-00001-KEY-2 TO COMPUTED-A.
050200     MOVE "1" TO CORRECT-A.
050300     CLOSE SQ-FS2.
050400     GO TO READ-WRITE-GF-03.
050500 READ-PASS-GF-03.
050600     PERFORM PASS.
050700     MOVE WRK-XN-00001-KEY-2 TO COMPUTED-A.
050800     MOVE "1" TO CORRECT-A.
050900     CLOSE SQ-FS2.
051000 READ-WRITE-GF-03.
051100     PERFORM PRINT-DETAIL.
051200 READ-INIT-GF-04.
051300*             THIS TEST IS USED TO CHECK OUT THE RESERVE INTEGER
051400*             AREA CLAUSE IN THE FILE-CONTROL ENTRY.
051500     MOVE "READ-TEST-GF-04" TO PAR-NAME.
051600     MOVE "RESERVE INTEGER AREA" TO FEATURE.
051700     MOVE "SQ-FS3" TO XFILE-NAME (1).
051800     MOVE "R1-F-G" TO XRECORD-NAME (1).
051900     MOVE "SQ203A" TO XPROGRAM-NAME (1).
052000     MOVE 000120  TO XRECORD-LENGTH (1).
052100     MOVE "RC" TO CHARS-OR-RECORDS (1).
052200     MOVE 0001    TO XBLOCK-SIZE (1).
052300     MOVE 000750  TO RECORDS-IN-FILE (1).
052400     MOVE "SQ"    TO XFILE-ORGANIZATION (1).
052500     MOVE "S"     TO XLABEL-TYPE (1).
052600     MOVE 000001  TO XRECORD-NUMBER (1).
052700 READ-TEST-GF-04-01.
052800     OPEN OUTPUT SQ-FS3.
052900 READ-TEST-GF-04-02.
053000     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-FS3R1-F-G-120.
053100     WRITE SQ-FS3R1-F-G-120.
053200     IF XRECORD-NUMBER (1) EQUAL TO 750
053300              GO TO READ-TEST-GF-04-03.
053400     ADD 1 TO XRECORD-NUMBER (1).
053500     GO TO READ-TEST-GF-04-02.
053600 READ-TEST-GF-04-03.
053700     CLOSE SQ-FS3.
053800     PERFORM PASS.
053900     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
054000     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
054100     GO TO READ-WRITE-GF-04.
054200 READ-DELETE-GF-04.
054300     PERFORM DE-LETE.
054400 READ-WRITE-GF-04.
054500     PERFORM PRINT-DETAIL.
054600 SQ203A-END-ROUTINE.
054700     MOVE "END OF SQ203A VALIDATION TESTS" TO PRINT-REC.
054800     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
054900 TERMINATE-SQ203A.
055000     EXIT.
055100 CCVS-EXIT SECTION.
055200 CCVS-999999.
055300     GO TO CLOSE-FILES.
