000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ210M.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    " HIGH       ".
000800*                                                              *
000900*    CREATION DATE     /     VALIDATION DATE                   *
001000*    "4.2 ".
001100*                                                              *
001200*        THE ROUTINE SQ210M TESTS THE USE OF THE LEVEL 2 WRITE
001300*    STATEMENT AND THE LINAGE CLAUSE FOR A FILE DESIGNATED AS
001400*    PRINTER OUTPUT.  THESE STATEMENTS CONTROL THE VERTICAL
001500*    POSITIONING OF EACH LINE ON A PRINTED PAGE.  THE LINAGE
001600*    CLAUSE SPECIFICALLY CONTROLS THE VERTICAL FORMAT OF LOGICAL
001700*    PRINT PAGE.  SQ210M TESTS THE USE OF A MIXTURE OF INTEGER AND
001800*    DATA-NAME ITEMS IN THE LINAGE CLAUSE.  VALUES OF DATA-NAMES
001900*    ARE CHANGED IN ORDER TO CHECK REDEFINITION OF LOGICAL PAGE
002000*    FORMATS.  IT IS ASSUMED THAT ALL LEVEL 2 NUCLEUS OPTIONS
002100*    ARE AVAILABLE IN TESTING SQ210M.
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.
002500     XXXXX082.
002600 OBJECT-COMPUTER.
002700     XXXXX083.
002800 INPUT-OUTPUT SECTION.
002900 FILE-CONTROL.
003000P    SELECT RAW-DATA   ASSIGN TO
003100P    XXXXX062
003200P           ORGANIZATION IS INDEXED
003300P           ACCESS MODE IS RANDOM
003400P           RECORD KEY IS RAW-DATA-KEY.
003500     SELECT PRINT-FILE ASSIGN TO
003600     XXXXX055.
003700 DATA DIVISION.
003800 FILE SECTION.
003900P
004000PFD  RAW-DATA.
004100P
004200P01  RAW-DATA-SATZ.
004300P    05  RAW-DATA-KEY        PIC X(6).
004400P    05  C-DATE              PIC 9(6).
004500P    05  C-TIME              PIC 9(8).
004600P    05  C-NO-OF-TESTS       PIC 99.
004700P    05  C-OK                PIC 999.
004800P    05  C-ALL               PIC 999.
004900P    05  C-FAIL              PIC 999.
005000P    05  C-DELETED           PIC 999.
005100P    05  C-INSPECT           PIC 999.
005200P    05  C-NOTE              PIC X(13).
005300P    05  C-INDENT            PIC X.
005400P    05  C-ABORT             PIC X(8).
005500 FD  PRINT-FILE
005600C    LABEL RECORDS
005700C    XXXXX084
005800C    DATA RECORD IS PRINT-REC DUMMY-RECORD
005900     LINAGE IS LINAGE-CTR LINES
006000              TOP 5.
006100 01  PRINT-REC PICTURE X(120).
006200 01  DUMMY-RECORD PICTURE X(120).
006300 WORKING-STORAGE SECTION.
006400 77  LINAGE-CTR         PIC 99       VALUE 66.
006500 01  DETAIL-LINE-1.
006600     02 FILLER          PIC X(20)    VALUE SPACE.
006700     02 FILLER          PIC X(13)    VALUE "THIS IS LINE ".
006800     02 DL1-LINE-NO     PIC 99.
006900     02 FILLER          PIC X(40)    VALUE " OF 80 DETAIL LINES.
007000-    "LINAGE-COUNTER IS ".
007100     02 DL1-LC          PIC 99.
007200     02 FILLER          PIC X(43)    VALUE ".".
007300 01  COMMENT-LINE-1     PIC X(120)   VALUE "BECAUSE OF THE NATURE
007400-    "OF THESE TESTS A PASS OR FAIL CANNOT BE DETERMINED WITHIN TH
007500-    "E PROGRAM.  THE USER MUST VISUALLY".
007600 01  COMMENT-LINE-2     PIC X(120)   VALUE "CHECK THE POSITION OF
007700-    "EACH LINE TO DETERMINE THE ACCURACY OF THE VARIOUS WRITE OPT
007800-    "IONS. VII-27 TO 29".
007900 01  COMMENT-LINE-3     PIC X(120)   VALUE "IN THIS TEST THE FIRST
008000-    " LOGICAL PAGE SHOULD CONTAIN 20 DETAIL LINES.  ALL SUCCEEDIN
008100-    "G LOGICAL PAGES SHOULD CONTAIN 30".
008200 01  COMMENT-LINE-4     PIC X(120)   VALUE "DETAIL LINES.  ALL LOG
008300-    "ICAL PAGES SHOULD BE SEPARATED BY 5 BLANK LINES.".
008400 01  LAST-LINE          PIC X(120)   VALUE "THIS IS THE LAST LINE
008500-    "IN THE PAGE BODY OF THIS LOGICAL PAGE.  USE IT AS A REFERENC
008600-    "E POINT FOR THE FOLLOWING TEST PAGES.".
008700 01  TEST-RESULTS.
008800     02 FILLER                    PICTURE X VALUE SPACE.
008900     02 FEATURE                   PICTURE X(20) VALUE SPACE.
009000     02 FILLER                    PICTURE X VALUE SPACE.
009100     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
009200     02 FILLER                    PICTURE X  VALUE SPACE.
009300     02  PAR-NAME.
009400       03 FILLER PICTURE X(12) VALUE SPACE.
009500       03  PARDOT-X PICTURE X  VALUE SPACE.
009600       03 DOTVALUE PICTURE 99  VALUE ZERO.
009700       03 FILLER PIC X(5) VALUE SPACE.
009800     02 FILLER PIC X(10) VALUE SPACE.
009900     02 RE-MARK PIC X(61).
010000 01  TEST-COMPUTED.
010100     02 FILLER PIC X(30) VALUE SPACE.
010200     02 FILLER PIC X(17) VALUE "       COMPUTED=".
010300     02 COMPUTED-X.
010400     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
010500     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
010600     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
010700     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
010800     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
010900     03       CM-18V0 REDEFINES COMPUTED-A.
011000         04 COMPUTED-18V0                   PICTURE -9(18).
011100         04 FILLER                          PICTURE X.
011200     03 FILLER PIC X(50) VALUE SPACE.
011300 01  TEST-CORRECT.
011400     02 FILLER PIC X(30) VALUE SPACE.
011500     02 FILLER PIC X(17) VALUE "       CORRECT =".
011600     02 CORRECT-X.
011700     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
011800     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
011900     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
012000     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
012100     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
012200     03      CR-18V0 REDEFINES CORRECT-A.
012300         04 CORRECT-18V0                    PICTURE -9(18).
012400         04 FILLER                          PICTURE X.
012500     03 FILLER PIC X(50) VALUE SPACE.
012600 01  CCVS-C-1.
012700     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
012800-    "SS  PARAGRAPH-NAME
012900-    "        REMARKS".
013000     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
013100 01  CCVS-C-2.
013200     02 FILLER PICTURE IS X VALUE IS SPACE.
013300     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
013400     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
013500     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
013600     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
013700 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
013800 01  REC-CT PICTURE 99 VALUE ZERO.
013900 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
014000 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
014100 01  INSPECT-COUNTER PIC 999 VALUE 3.
014200 01  PASS-COUNTER PIC 999 VALUE ZERO.
014300 01  TOTAL-ERROR PIC 999 VALUE ZERO.
014400 01  ERROR-HOLD PIC 999 VALUE ZERO.
014500 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
014600 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
014700 01  CCVS-H-1.
014800     02  FILLER   PICTURE X(27)  VALUE SPACE.
014900     02 FILLER PICTURE X(67) VALUE
015000     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
015100-    " SYSTEM".
015200     02  FILLER     PICTURE X(26)  VALUE SPACE.
015300 01  CCVS-H-2.
015400     02 FILLER PICTURE X(52) VALUE IS
015500     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
015600     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
015700     02 TEST-ID PICTURE IS X(9).
015800     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
015900 01  CCVS-H-3.
016000     02  FILLER PICTURE X(34) VALUE
016100     " FOR OFFICIAL USE ONLY    ".
016200     02  FILLER PICTURE X(58) VALUE
016300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
016400     02  FILLER PICTURE X(28) VALUE
016500     "  COPYRIGHT   1985 ".
016600 01  CCVS-E-1.
016700     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
016800     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
016900     02 ID-AGAIN PICTURE IS X(9).
017000     02 FILLER PICTURE X(45) VALUE IS
017100     " NTIS DISTRIBUTION COBOL 85".
017200 01  CCVS-E-2.
017300     02  FILLER                   PICTURE X(31)  VALUE
017400     SPACE.
017500     02  FILLER                   PICTURE X(21)  VALUE SPACE.
017600     02 CCVS-E-2-2.
017700         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
017800         03 FILLER PICTURE IS X VALUE IS SPACE.
017900         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
018000 01  CCVS-E-3.
018100     02  FILLER PICTURE X(22) VALUE
018200     " FOR OFFICIAL USE ONLY".
018300     02  FILLER PICTURE X(12) VALUE SPACE.
018400     02  FILLER PICTURE X(58) VALUE
018500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018600     02  FILLER PICTURE X(13) VALUE SPACE.
018700     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
018800 01  CCVS-E-4.
018900     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
019000     02 FILLER PIC XXXX VALUE " OF ".
019100     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
019200     02 FILLER PIC X(40) VALUE
019300      "  TESTS WERE EXECUTED SUCCESSFULLY".
019400 01  XXINFO.
019500     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
019600     02 INFO-TEXT.
019700     04 FILLER PIC X(20) VALUE SPACE.
019800     04 XXCOMPUTED PIC X(20).
019900     04 FILLER PIC X(5) VALUE SPACE.
020000     04 XXCORRECT PIC X(20).
020100 01  HYPHEN-LINE.
020200     02 FILLER PICTURE IS X VALUE IS SPACE.
020300     02 FILLER PICTURE IS X(65) VALUE IS "************************
020400-    "*****************************************".
020500     02 FILLER PICTURE IS X(54) VALUE IS "************************
020600-    "******************************".
020700 01  CCVS-PGM-ID PIC X(6) VALUE
020800     "SQ210M".
020900 PROCEDURE DIVISION.
021000 CCVS1 SECTION.
021100 OPEN-FILES.
021200P    OPEN I-O RAW-DATA.
021300P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
021400P    READ RAW-DATA INVALID KEY GO TO END-E-1.
021500P    MOVE "ABORTED " TO C-ABORT.
021600P    ADD 1 TO C-NO-OF-TESTS.
021700P    ACCEPT C-DATE  FROM DATE.
021800P    ACCEPT C-TIME  FROM TIME.
021900P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
022000PEND-E-1.
022100P    CLOSE RAW-DATA.
022200     OPEN     OUTPUT PRINT-FILE.
022300     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
022400     MOVE    SPACE TO TEST-RESULTS.
022500     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
022600     GO TO CCVS1-EXIT.
022700 CLOSE-FILES.
022800     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
022900P    OPEN I-O RAW-DATA.
023000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
023100P    READ RAW-DATA INVALID KEY GO TO END-E-2.
023200P    MOVE "OK.     " TO C-ABORT.
023300P    MOVE PASS-COUNTER TO C-OK.
023400P    MOVE ERROR-HOLD   TO C-ALL.
023500P    MOVE ERROR-COUNTER TO C-FAIL.
023600P    MOVE DELETE-CNT TO C-DELETED.
023700P    MOVE INSPECT-COUNTER TO C-INSPECT.
023800P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
023900PEND-E-2.
024000P    CLOSE RAW-DATA.
024100 TERMINATE-CCVS.
024200S    EXIT PROGRAM.
024300STERMINATE-CALL.
024400     STOP     RUN.
024500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
024600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
024700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
024800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
024900     MOVE "****TEST DELETED****" TO RE-MARK.
025000 PRINT-DETAIL.
025100     IF REC-CT NOT EQUAL TO ZERO
025200             MOVE "." TO PARDOT-X
025300             MOVE REC-CT TO DOTVALUE.
025400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
025500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
025600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
025700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
025800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
025900     MOVE SPACE TO CORRECT-X.
026000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
026100     MOVE     SPACE TO RE-MARK.
026200 HEAD-ROUTINE.
026300     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026400     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
026500     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
026600 COLUMN-NAMES-ROUTINE.
026700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
026900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
027000 END-ROUTINE.
027100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
027200 END-RTN-EXIT.
027300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027400 END-ROUTINE-1.
027500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
027600      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
027700      ADD PASS-COUNTER TO ERROR-HOLD.
027800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
027900      MOVE PASS-COUNTER TO CCVS-E-4-1.
028000      MOVE ERROR-HOLD TO CCVS-E-4-2.
028100      MOVE CCVS-E-4 TO CCVS-E-2-2.
028200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
028300  END-ROUTINE-12.
028400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
028500     IF       ERROR-COUNTER IS EQUAL TO ZERO
028600         MOVE "NO " TO ERROR-TOTAL
028700         ELSE
028800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
028900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
029000     PERFORM WRITE-LINE.
029100 END-ROUTINE-13.
029200     IF DELETE-CNT IS EQUAL TO ZERO
029300         MOVE "NO " TO ERROR-TOTAL  ELSE
029400         MOVE DELETE-CNT TO ERROR-TOTAL.
029500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
029600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
029700      IF   INSPECT-COUNTER EQUAL TO ZERO
029800          MOVE "NO " TO ERROR-TOTAL
029900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
030000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
030100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030300 WRITE-LINE.
030400     ADD 1 TO RECORD-COUNT.
030500Y    IF RECORD-COUNT GREATER 50
030600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
030700Y        MOVE SPACE TO DUMMY-RECORD
030800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
030900Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
031000Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
031100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
031200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
031300Y        MOVE ZERO TO RECORD-COUNT.
031400     PERFORM WRT-LN.
031500 WRT-LN.
031600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
031700     MOVE SPACE TO DUMMY-RECORD.
031800 BLANK-LINE-PRINT.
031900     PERFORM WRT-LN.
032000 FAIL-ROUTINE.
032100     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032200     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
032300     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
032400     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
032500     GO TO FAIL-ROUTINE-EX.
032600 FAIL-ROUTINE-WRITE.
032700     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
032800     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
032900 FAIL-ROUTINE-EX. EXIT.
033000 BAIL-OUT.
033100     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
033200     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
033300 BAIL-OUT-WRITE.
033400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
033500     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033600 BAIL-OUT-EX. EXIT.
033700 CCVS1-EXIT.
033800     EXIT.
033900 SECT-SQ210M-0001 SECTION.
034000 WRITE-INIT-GF-01.
034100     MOVE COMMENT-LINE-1 TO PRINT-REC.
034200     WRITE PRINT-REC AFTER ADVANCING 5 LINES.
034300     MOVE COMMENT-LINE-2 TO PRINT-REC.
034400     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
034500 WRITE-TEST-GF-01.
034600*             THIS TEST CHECKS A LINAGE CLAUSE WHICH CONTAINS
034700*             PHRASES WITH BOTH INTEGER AND DATA NAME ITEMS.
034800     MOVE "LINAGE INT / D-N MIX" TO FEATURE.
034900     MOVE "WRITE-TEST-GF-01" TO PAR-NAME.
035000     PERFORM PRINT-DETAIL.
035100     MOVE COMMENT-LINE-3 TO PRINT-REC.
035200     WRITE PRINT-REC AFTER ADVANCING 5 LINES.
035300     MOVE COMMENT-LINE-4 TO PRINT-REC.
035400     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
035500     MOVE SPACE TO DUMMY-RECORD.
035600     PERFORM BLANK-LINE-PRINT UNTIL LINAGE-COUNTER EQUAL 66.
035700     MOVE 20 TO LINAGE-CTR.
035800     MOVE LAST-LINE TO PRINT-REC.
035900     WRITE PRINT-REC BEFORE ADVANCING 1 LINE.
036000     MOVE 30 TO LINAGE-CTR.
036100     MOVE 1 TO DL1-LINE-NO.
036200     PERFORM PRINT-DETAIL-1 80 TIMES.
036300 SQ210M-END-ROUTINE.
036400     MOVE "END OF SQ210M VALIDATION TESTS" TO PRINT-REC.
036500     WRITE PRINT-REC AFTER ADVANCING 1 LINE.
036600     GO TO CCVS-EXIT.
036700 PRINT-DETAIL-1.
036800     MOVE LINAGE-COUNTER TO DL1-LC.
036900     MOVE DETAIL-LINE-1 TO PRINT-REC.
037000     WRITE PRINT-REC BEFORE ADVANCING 1 LINE.
037100     ADD 1 TO DL1-LINE-NO.
037200 CCVS-EXIT SECTION.
037300 CCVS-999999.
037400     GO TO CLOSE-FILES.
