000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ219A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                                                              *
001000*    CREATION DATE     /     VALIDATION DATE                   *
001100*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001200*                                                              *
001300*       THIS ROUTINE CHECKS  THE
001400*               RECORD DELIMITER IS IMPLEMENTOR-NAME  LAUSE.
001500*
001600*            SEE  VII-13.
001700*
001800*
001900*       THIS ROUTINE BUILDS A SEQUENTIAL TAPE FILE WHICH CONTAINS
002000*    BOTH 120 CHARACTER AND 151 CHARACTER RECORDS.  THE TAPE
002100*    CONSISTS OF 1 SHORT, 1 LONG, 10 SHORT, 100 LONG, AND 338
002200*    SHORT RECORDS FOR A TOTAL OF 450 RECORDS IN THE FILE.
002300*    THE TAPE IS READ AND FIELDS IN THE RECORDS ARE CHECKED
002400*    AGAINST THE EXPECTED VALUES.
002500*
002600*       AN INFORMATION SECTION AT THE END OF THE ROUTINE CHECKS
002700*    THE FIELD WHICH CONTAINS THE XRECORD-NUMBER.  THIS FIELD IS
002800*    PART OF A LONG RECORD ONLY.  IF THE XRECORD-NUMBER IS THERE
002900*    FOR A SHORT RECORD, IT MEANS THE MAXIMUM SIZE RECORD IS
003000*    ALWAYS WRITTEN.
003100 ENVIRONMENT DIVISION.
003200 CONFIGURATION SECTION.
003300 SOURCE-COMPUTER.
003400     XXXXX082.
003500 OBJECT-COMPUTER.
003600     XXXXX083.
003700 INPUT-OUTPUT SECTION.
003800 FILE-CONTROL.
003900P    SELECT RAW-DATA   ASSIGN TO
004000P    XXXXX062
004100P           ORGANIZATION IS INDEXED
004200P           ACCESS MODE IS RANDOM
004300P           RECORD KEY IS RAW-DATA-KEY.
004400     SELECT PRINT-FILE ASSIGN TO
004500     XXXXX055.
004600     SELECT SQ-VS6 ASSIGN
004700     XXXXX001
004800     RECORD DELIMITER
004900     XXXXX070
005000     ORGANIZATION IS SEQUENTIAL.
005100 DATA DIVISION.
005200 FILE SECTION.
005300P
005400PFD  RAW-DATA.
005500P
005600P01  RAW-DATA-SATZ.
005700P    05  RAW-DATA-KEY        PIC X(6).
005800P    05  C-DATE              PIC 9(6).
005900P    05  C-TIME              PIC 9(8).
006000P    05  C-NO-OF-TESTS       PIC 99.
006100P    05  C-OK                PIC 999.
006200P    05  C-ALL               PIC 999.
006300P    05  C-FAIL              PIC 999.
006400P    05  C-DELETED           PIC 999.
006500P    05  C-INSPECT           PIC 999.
006600P    05  C-NOTE              PIC X(13).
006700P    05  C-INDENT            PIC X.
006800P    05  C-ABORT             PIC X(8).
006900 FD  PRINT-FILE
007000C    LABEL RECORDS
007100C    XXXXX084
007200C    DATA RECORD IS PRINT-REC DUMMY-RECORD
007300               .
007400 01  PRINT-REC PICTURE X(120).
007500 01  DUMMY-RECORD PICTURE X(120).
007600
007700 FD  SQ-VS6
007800     RECORD CONTAINS 120 TO 151 CHARACTERS
007900C    LABEL RECORDS ARE STANDARD
008000C    DATA RECORDS ARE SQ-VS6R1-M-G-120  SQ-VS6R2-M-G-151
008100               .
008200 01  SQ-VS6R1-M-G-120.
008300     02  SQ-VS6R1-FIRST PIC X(120).
008400 01  SQ-VS6R2-M-G-151.
008500     02  SQ-VS6R2-FIRST  PIC X(120).
008600     02  LONG-OR-SHORT  PIC X(5).
008700     02  SQ-VS6-RECNO  PIC X(5).
008800     02  SQ-VS6-FILLER  PIC X(21).
008900 WORKING-STORAGE SECTION.
009000 01  SAVE-COUNT-OF-RECS  PIC X(5).
009100 01  COUNT-OF-RECS  PIC S9(5) COMP.
009200 01  RECORDS-IN-ERROR  PIC S9(5) COMP.
009300 01  ERROR-FLAG PIC 9.
009400 01  EOF-FLAG  PIC 9.
009500 01  DUMP-AREA.
009600     02  TYPE-OF-REC PICTURE X(5).
009700     02  RECNO  PIC 9(5).
009800     02  REC-FILLER  PIC X(21).
009900 01  FILE-RECORD-INFORMATION-REC.
010000     03 FILE-RECORD-INFO-SKELETON.
010100        05 FILLER                 PICTURE X(48)       VALUE
010200             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
010300        05 FILLER                 PICTURE X(46)       VALUE
010400             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
010500        05 FILLER                 PICTURE X(26)       VALUE
010600             ",LFIL=000000,ORG=  ,LBLR= ".
010700        05 FILLER                 PICTURE X(37)       VALUE
010800             ",RECKEY=                             ".
010900        05 FILLER                 PICTURE X(38)       VALUE
011000             ",ALTKEY1=                             ".
011100        05 FILLER                 PICTURE X(38)       VALUE
011200             ",ALTKEY2=                             ".
011300        05 FILLER                 PICTURE X(7)        VALUE SPACE.
011400     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
011500        05 FILE-RECORD-INFO-P1-120.
011600           07 FILLER              PIC X(5).
011700           07 XFILE-NAME           PIC X(6).
011800           07 FILLER              PIC X(8).
011900           07 XRECORD-NAME         PIC X(6).
012000           07 FILLER              PIC X(1).
012100           07 REELUNIT-NUMBER     PIC 9(1).
012200           07 FILLER              PIC X(7).
012300           07 XRECORD-NUMBER       PIC 9(6).
012400           07 FILLER              PIC X(6).
012500           07 UPDATE-NUMBER       PIC 9(2).
012600           07 FILLER              PIC X(5).
012700           07 ODO-NUMBER          PIC 9(4).
012800           07 FILLER              PIC X(5).
012900           07 XPROGRAM-NAME        PIC X(5).
013000           07 FILLER              PIC X(7).
013100           07 XRECORD-LENGTH       PIC 9(6).
013200           07 FILLER              PIC X(7).
013300           07 CHARS-OR-RECORDS    PIC X(2).
013400           07 FILLER              PIC X(1).
013500           07 XBLOCK-SIZE          PIC 9(4).
013600           07 FILLER              PIC X(6).
013700           07 RECORDS-IN-FILE     PIC 9(6).
013800           07 FILLER              PIC X(5).
013900           07 XFILE-ORGANIZATION   PIC X(2).
014000           07 FILLER              PIC X(6).
014100           07 XLABEL-TYPE          PIC X(1).
014200        05 FILE-RECORD-INFO-P121-240.
014300           07 FILLER              PIC X(8).
014400           07 XRECORD-KEY          PIC X(29).
014500           07 FILLER              PIC X(9).
014600           07 ALTERNATE-KEY1      PIC X(29).
014700           07 FILLER              PIC X(9).
014800           07 ALTERNATE-KEY2      PIC X(29).
014900           07 FILLER              PIC X(7).
015000 01  TEST-RESULTS.
015100     02 FILLER                    PICTURE X VALUE SPACE.
015200     02 FEATURE                   PICTURE X(20) VALUE SPACE.
015300     02 FILLER                    PICTURE X VALUE SPACE.
015400     02 P-OR-F                    PICTURE X(5) VALUE SPACE.
015500     02 FILLER                    PICTURE X  VALUE SPACE.
015600     02  PAR-NAME.
015700       03 FILLER PICTURE X(12) VALUE SPACE.
015800       03  PARDOT-X PICTURE X  VALUE SPACE.
015900       03 DOTVALUE PICTURE 99  VALUE ZERO.
016000       03 FILLER PIC X(5) VALUE SPACE.
016100     02 FILLER PIC X(10) VALUE SPACE.
016200     02 RE-MARK PIC X(61).
016300 01  TEST-COMPUTED.
016400     02 FILLER PIC X(30) VALUE SPACE.
016500     02 FILLER PIC X(17) VALUE "       COMPUTED=".
016600     02 COMPUTED-X.
016700     03 COMPUTED-A                PICTURE X(20) VALUE SPACE.
016800     03 COMPUTED-N REDEFINES COMPUTED-A PICTURE -9(9).9(9).
016900     03 COMPUTED-0V18 REDEFINES COMPUTED-A  PICTURE -.9(18).
017000     03 COMPUTED-4V14 REDEFINES COMPUTED-A  PICTURE -9(4).9(14).
017100     03 COMPUTED-14V4 REDEFINES COMPUTED-A  PICTURE -9(14).9(4).
017200     03       CM-18V0 REDEFINES COMPUTED-A.
017300         04 COMPUTED-18V0                   PICTURE -9(18).
017400         04 FILLER                          PICTURE X.
017500     03 FILLER PIC X(50) VALUE SPACE.
017600 01  TEST-CORRECT.
017700     02 FILLER PIC X(30) VALUE SPACE.
017800     02 FILLER PIC X(17) VALUE "       CORRECT =".
017900     02 CORRECT-X.
018000     03 CORRECT-A                 PICTURE X(20) VALUE SPACE.
018100     03 CORRECT-N REDEFINES CORRECT-A PICTURE -9(9).9(9).
018200     03 CORRECT-0V18 REDEFINES CORRECT-A    PICTURE -.9(18).
018300     03 CORRECT-4V14 REDEFINES CORRECT-A    PICTURE -9(4).9(14).
018400     03 CORRECT-14V4 REDEFINES CORRECT-A    PICTURE -9(14).9(4).
018500     03      CR-18V0 REDEFINES CORRECT-A.
018600         04 CORRECT-18V0                    PICTURE -9(18).
018700         04 FILLER                          PICTURE X.
018800     03 FILLER PIC X(50) VALUE SPACE.
018900 01  CCVS-C-1.
019000     02 FILLER PICTURE IS X(99) VALUE IS " FEATURE              PA
019100-    "SS  PARAGRAPH-NAME
019200-    "        REMARKS".
019300     02 FILLER PICTURE IS X(20) VALUE IS SPACE.
019400 01  CCVS-C-2.
019500     02 FILLER PICTURE IS X VALUE IS SPACE.
019600     02 FILLER PICTURE IS X(6) VALUE IS "TESTED".
019700     02 FILLER PICTURE IS X(15) VALUE IS SPACE.
019800     02 FILLER PICTURE IS X(4) VALUE IS "FAIL".
019900     02 FILLER PICTURE IS X(94) VALUE IS SPACE.
020000 01  REC-SKL-SUB PICTURE 9(2) VALUE ZERO.
020100 01  REC-CT PICTURE 99 VALUE ZERO.
020200 01  DELETE-CNT                   PICTURE 999  VALUE ZERO.
020300 01  ERROR-COUNTER PICTURE IS 999 VALUE IS ZERO.
020400 01  INSPECT-COUNTER PIC 999 VALUE ZERO.
020500 01  PASS-COUNTER PIC 999 VALUE ZERO.
020600 01  TOTAL-ERROR PIC 999 VALUE ZERO.
020700 01  ERROR-HOLD PIC 999 VALUE ZERO.
020800 01  DUMMY-HOLD PIC X(120) VALUE SPACE.
020900 01  RECORD-COUNT PIC 9(5) VALUE ZERO.
021000 01  CCVS-H-1.
021100     02  FILLER   PICTURE X(27)  VALUE SPACE.
021200     02 FILLER PICTURE X(67) VALUE
021300     " FEDERAL SOFTWARE TESTING CENTER COBOL COMPILER VALIDATION
021400-    " SYSTEM".
021500     02  FILLER     PICTURE X(26)  VALUE SPACE.
021600 01  CCVS-H-2.
021700     02 FILLER PICTURE X(52) VALUE IS
021800     "CCVS85 FSTC COPY, NOT FOR DISTRIBUTION.".
021900     02 FILLER PICTURE IS X(19) VALUE IS "TEST RESULTS SET-  ".
022000     02 TEST-ID PICTURE IS X(9).
022100     02 FILLER PICTURE IS X(40) VALUE IS SPACE.
022200 01  CCVS-H-3.
022300     02  FILLER PICTURE X(34) VALUE
022400     " FOR OFFICIAL USE ONLY    ".
022500     02  FILLER PICTURE X(58) VALUE
022600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
022700     02  FILLER PICTURE X(28) VALUE
022800     "  COPYRIGHT   1985 ".
022900 01  CCVS-E-1.
023000     02 FILLER PICTURE IS X(52) VALUE IS SPACE.
023100     02 FILLER PICTURE IS X(14) VALUE IS "END OF TEST-  ".
023200     02 ID-AGAIN PICTURE IS X(9).
023300     02 FILLER PICTURE X(45) VALUE IS
023400     " NTIS DISTRIBUTION COBOL 85".
023500 01  CCVS-E-2.
023600     02  FILLER                   PICTURE X(31)  VALUE
023700     SPACE.
023800     02  FILLER                   PICTURE X(21)  VALUE SPACE.
023900     02 CCVS-E-2-2.
024000         03 ERROR-TOTAL PICTURE IS XXX VALUE IS SPACE.
024100         03 FILLER PICTURE IS X VALUE IS SPACE.
024200         03 ENDER-DESC PIC X(46) VALUE "ERRORS ENCOUNTERED".
024300 01  CCVS-E-3.
024400     02  FILLER PICTURE X(22) VALUE
024500     " FOR OFFICIAL USE ONLY".
024600     02  FILLER PICTURE X(12) VALUE SPACE.
024700     02  FILLER PICTURE X(58) VALUE
024800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
024900     02  FILLER PICTURE X(13) VALUE SPACE.
025000     02 FILLER PIC X(15) VALUE " COPYRIGHT 1985".
025100 01  CCVS-E-4.
025200     02 CCVS-E-4-1 PIC XXX VALUE SPACE.
025300     02 FILLER PIC XXXX VALUE " OF ".
025400     02 CCVS-E-4-2 PIC XXX VALUE SPACE.
025500     02 FILLER PIC X(40) VALUE
025600      "  TESTS WERE EXECUTED SUCCESSFULLY".
025700 01  XXINFO.
025800     02 FILLER PIC X(30) VALUE "        *** INFORMATION  ***".
025900     02 INFO-TEXT.
026000     04 FILLER PIC X(20) VALUE SPACE.
026100     04 XXCOMPUTED PIC X(20).
026200     04 FILLER PIC X(5) VALUE SPACE.
026300     04 XXCORRECT PIC X(20).
026400 01  HYPHEN-LINE.
026500     02 FILLER PICTURE IS X VALUE IS SPACE.
026600     02 FILLER PICTURE IS X(65) VALUE IS "************************
026700-    "*****************************************".
026800     02 FILLER PICTURE IS X(54) VALUE IS "************************
026900-    "******************************".
027000 01  CCVS-PGM-ID PIC X(6) VALUE
027100     "SQ219A".
027200 PROCEDURE DIVISION.
027300 CCVS1 SECTION.
027400 OPEN-FILES.
027500P    OPEN I-O RAW-DATA.
027600P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
027700P    READ RAW-DATA INVALID KEY GO TO END-E-1.
027800P    MOVE "ABORTED " TO C-ABORT.
027900P    ADD 1 TO C-NO-OF-TESTS.
028000P    ACCEPT C-DATE  FROM DATE.
028100P    ACCEPT C-TIME  FROM TIME.
028200P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-1.
028300PEND-E-1.
028400P    CLOSE RAW-DATA.
028500     OPEN     OUTPUT PRINT-FILE.
028600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
028700     MOVE    SPACE TO TEST-RESULTS.
028800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
028900     MOVE ZERO TO REC-SKL-SUB.
029000     PERFORM CCVS-INIT-FILE 9 TIMES.
029100 CCVS-INIT-FILE.
029200     ADD 1 TO REC-SKL-SUB.
029300     MOVE FILE-RECORD-INFO-SKELETON TO
029400                  FILE-RECORD-INFO (REC-SKL-SUB).
029500 CCVS-INIT-EXIT.
029600     GO TO CCVS1-EXIT.
029700 CLOSE-FILES.
029800     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
029900P    OPEN I-O RAW-DATA.
030000P    MOVE CCVS-PGM-ID TO RAW-DATA-KEY.
030100P    READ RAW-DATA INVALID KEY GO TO END-E-2.
030200P    MOVE "OK.     " TO C-ABORT.
030300P    MOVE PASS-COUNTER TO C-OK.
030400P    MOVE ERROR-HOLD   TO C-ALL.
030500P    MOVE ERROR-COUNTER TO C-FAIL.
030600P    MOVE DELETE-CNT TO C-DELETED.
030700P    MOVE INSPECT-COUNTER TO C-INSPECT.
030800P    REWRITE RAW-DATA-SATZ INVALID KEY GO TO END-E-2.
030900PEND-E-2.
031000P    CLOSE RAW-DATA.
031100 TERMINATE-CCVS.
031200S    EXIT PROGRAM.
031300STERMINATE-CALL.
031400     STOP     RUN.
031500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
031600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
031700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
031800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-CNT.
031900     MOVE "****TEST DELETED****" TO RE-MARK.
032000 PRINT-DETAIL.
032100     IF REC-CT NOT EQUAL TO ZERO
032200             MOVE "." TO PARDOT-X
032300             MOVE REC-CT TO DOTVALUE.
032400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
032500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
032600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
032700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
032800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
032900     MOVE SPACE TO CORRECT-X.
033000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
033100     MOVE     SPACE TO RE-MARK.
033200 HEAD-ROUTINE.
033300     MOVE CCVS-H-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033400     MOVE CCVS-H-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
033500     MOVE CCVS-H-3 TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
033600 COLUMN-NAMES-ROUTINE.
033700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
033800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
033900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
034000 END-ROUTINE.
034100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
034200 END-RTN-EXIT.
034300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034400 END-ROUTINE-1.
034500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
034600      ERROR-HOLD. ADD DELETE-CNT TO ERROR-HOLD.
034700      ADD PASS-COUNTER TO ERROR-HOLD.
034800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
034900      MOVE PASS-COUNTER TO CCVS-E-4-1.
035000      MOVE ERROR-HOLD TO CCVS-E-4-2.
035100      MOVE CCVS-E-4 TO CCVS-E-2-2.
035200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
035300  END-ROUTINE-12.
035400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
035500     IF       ERROR-COUNTER IS EQUAL TO ZERO
035600         MOVE "NO " TO ERROR-TOTAL
035700         ELSE
035800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
035900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
036000     PERFORM WRITE-LINE.
036100 END-ROUTINE-13.
036200     IF DELETE-CNT IS EQUAL TO ZERO
036300         MOVE "NO " TO ERROR-TOTAL  ELSE
036400         MOVE DELETE-CNT TO ERROR-TOTAL.
036500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
036600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
036700      IF   INSPECT-COUNTER EQUAL TO ZERO
036800          MOVE "NO " TO ERROR-TOTAL
036900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
037000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
037100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
037300 WRITE-LINE.
037400     ADD 1 TO RECORD-COUNT.
037500Y    IF RECORD-COUNT GREATER 50
037600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
037700Y        MOVE SPACE TO DUMMY-RECORD
037800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
037900Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
038000Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
038100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
038200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
038300Y        MOVE ZERO TO RECORD-COUNT.
038400     PERFORM WRT-LN.
038500 WRT-LN.
038600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
038700     MOVE SPACE TO DUMMY-RECORD.
038800 BLANK-LINE-PRINT.
038900     PERFORM WRT-LN.
039000 FAIL-ROUTINE.
039100     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
039200     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
039300     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
039400     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
039500     GO TO FAIL-ROUTINE-EX.
039600 FAIL-ROUTINE-WRITE.
039700     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
039800     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
039900 FAIL-ROUTINE-EX. EXIT.
040000 BAIL-OUT.
040100     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
040200     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
040300 BAIL-OUT-WRITE.
040400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
040500     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
040600 BAIL-OUT-EX. EXIT.
040700 CCVS1-EXIT.
040800     EXIT.
040900 SECT-SQ219A-0001 SECTION.
041000 WRITE-INIT-GF-01.
041100     MOVE "SQ-VS6" TO XFILE-NAME (1).
041200     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
041300     MOVE "RC" TO CHARS-OR-RECORDS (1).
041400     MOVE 0001 TO XBLOCK-SIZE (1).
041500     MOVE 000450 TO RECORDS-IN-FILE (1).
041600     MOVE "SQ" TO XFILE-ORGANIZATION (1).
041700     MOVE "S" TO XLABEL-TYPE (1).
041800     MOVE 000000 TO XRECORD-NUMBER (1).
041900     MOVE ZERO TO COUNT-OF-RECS.
042000     OPEN OUTPUT SQ-VS6.
042100     MOVE "MULTIPLE LENGTH RECS " TO SQ-VS6-FILLER.
042200 WRITE-TEST-GF-01.
042300     PERFORM WRITE-SHORT-REC.
042400     PERFORM WRITE-LONG-REC.
042500     PERFORM WRITE-SHORT-REC 10 TIMES.
042600     PERFORM WRITE-LONG-REC 100 TIMES.
042700     PERFORM WRITE-SHORT-REC 338 TIMES.
042800 WRITE-WRITE-GF-01.
042900     MOVE "CREATE FILE SQ-VS6" TO FEATURE.
043000     MOVE "WRITE-TEST-GF-01" TO PAR-NAME.
043100     MOVE "FILE CREATED, RECS =" TO COMPUTED-A.
043200     MOVE COUNT-OF-RECS TO CORRECT-18V0.
043300     MOVE "FILE HAS 120 AND 151 CHAR RECS" TO RE-MARK.
043400     PERFORM PRINT-DETAIL.
043500*         A SEQUENTIAL TAPE FILE CONTAINING 450 RECORDS HAS
043600*    BEEN CREATED.  THE FILE CONTAINS RECORDS OF 120 CHARACTERS
043700*    AND RECORDS OF 151 CHARACTERS.  THE SEQUENCE IN WHICH THE
043800*    RECORDS WERE WRITTEN IS S-L-10S-100L-338S.
043900 WRITE-CLOSE-GF-01.
044000     CLOSE SQ-VS6.
044100     GO TO READ-INIT-F1-01.
044200 WRITE-SHORT-REC.
044300     MOVE "R1-M-G" TO XRECORD-NAME (1).
044400     MOVE 000120 TO XRECORD-LENGTH (1).
044500     ADD 1 TO COUNT-OF-RECS.
044600     MOVE COUNT-OF-RECS TO XRECORD-NUMBER (1).
044700     MOVE "SHORT" TO LONG-OR-SHORT.
044800     MOVE COUNT-OF-RECS TO SQ-VS6-RECNO.
044900     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-VS6R1-FIRST.
045000     WRITE SQ-VS6R1-M-G-120.
045100 WRITE-LONG-REC.
045200     MOVE "R2-M-G" TO XRECORD-NAME (1).
045300     MOVE 000151 TO XRECORD-LENGTH (1).
045400     ADD 1 TO COUNT-OF-RECS.
045500     MOVE COUNT-OF-RECS TO XRECORD-NUMBER (1).
045600     MOVE "LONG" TO LONG-OR-SHORT.
045700     MOVE COUNT-OF-RECS TO SQ-VS6-RECNO.
045800     MOVE FILE-RECORD-INFO-P1-120 (1) TO SQ-VS6R2-FIRST.
045900     WRITE SQ-VS6R2-M-G-151.
046000 READ-INIT-F1-01.
046100     MOVE ZERO TO COUNT-OF-RECS.
046200     MOVE ZERO TO EOF-FLAG.
046300     MOVE ZERO TO RECORDS-IN-ERROR.
046400     MOVE ZERO TO ERROR-FLAG.
046500     OPEN INPUT SQ-VS6.
046600 READ-TEST-F1-01.
046700     PERFORM READ-SHORT-REC THRU READ-SHORT-REC-EXIT.
046800     IF EOF-FLAG EQUAL TO 1
046900         MOVE "EOF ON FIRST READ" TO RE-MARK
047000         GO TO READ-EOF-F1-06.
047100     IF ERROR-FLAG EQUAL TO 1
047200         GO TO READ-FAIL-F1-01.
047300 READ-PASS-F1-01.
047400     PERFORM PASS.
047500     GO TO READ-WRITE-F1-01.
047600 READ-FAIL-F1-01.
047700     MOVE "ERROR ON FIRST READ;VII-13 GR (3)          " TO RE-MARK
047800     PERFORM FAIL.
047900 READ-WRITE-F1-01.
048000     MOVE "READ SHORT RECORD" TO FEATURE.
048100     MOVE "READ-TEST-F1-01" TO PAR-NAME.
048200     PERFORM PRINT-DETAIL.
048300     GO TO READ-INIT-F1-02.
048400 READ-SHORT-REC.
048500     IF EOF-FLAG EQUAL TO 1
048600          GO TO READ-SHORT-REC-EXIT.
048700     READ SQ-VS6 AT END
048800          MOVE 1 TO EOF-FLAG
048900          GO TO READ-SHORT-REC-EXIT.
049000     ADD 1 TO COUNT-OF-RECS.
049100     MOVE SQ-VS6R1-FIRST TO FILE-RECORD-INFO-P1-120 (1).
049200     IF XRECORD-NAME (1) NOT EQUAL TO "R1-M-G"
049300          GO TO READ-SHORT-REC-ERROR.
049400     IF XRECORD-LENGTH (1) NOT EQUAL TO 120
049500          GO TO READ-SHORT-REC-ERROR.
049600     IF COUNT-OF-RECS NOT EQUAL TO XRECORD-NUMBER (1)
049700          GO TO READ-SHORT-REC-ERROR.
049800     IF XLABEL-TYPE (1) EQUAL TO "S"
049900          GO TO READ-SHORT-REC-EXIT.
050000 READ-SHORT-REC-ERROR.
050100     ADD 1 TO RECORDS-IN-ERROR.
050200     MOVE 1 TO ERROR-FLAG.
050300 READ-SHORT-REC-EXIT.
050400     EXIT.
050500 READ-INIT-F1-02.
050600     MOVE ZERO TO ERROR-FLAG.
050700 READ-TEST-F1-02.
050800     PERFORM READ-LONG-REC THRU READ-LONG-REC-EXIT.
050900     IF EOF-FLAG EQUAL TO 1
051000          MOVE "EOF ON SECOND READ" TO RE-MARK
051100          GO TO READ-EOF-F1-06.
051200     IF ERROR-FLAG EQUAL TO 1
051300          GO TO READ-FAIL-F1-02.
051400 READ-PASS-F1-02.
051500     PERFORM PASS.
051600     GO TO READ-WRITE-F1-02.
051700 READ-FAIL-F1-02.
051800     MOVE "ERROR ON SEC READ; VII-13 GR (3           " TO RE-MARK
051900     PERFORM FAIL.
052000 READ-WRITE-F1-02.
052100     MOVE "READ LONG RECORD" TO FEATURE.
052200     MOVE "READ-TEST-F1-02" TO PAR-NAME.
052300     PERFORM PRINT-DETAIL.
052400     GO TO READ-INIT-F1-03.
052500 READ-LONG-REC.
052600     IF EOF-FLAG EQUAL TO 1
052700         GO TO READ-LONG-REC-EXIT.
052800     READ SQ-VS6 END
052900         MOVE 1 TO EOF-FLAG
053000         GO TO READ-LONG-REC-EXIT.
053100     ADD 1 TO COUNT-OF-RECS.
053200     MOVE SQ-VS6R2-FIRST TO FILE-RECORD-INFO-P1-120 (1).
053300     IF XRECORD-NAME (1) NOT EQUAL TO "R2-M-G"
053400         GO TO READ-LONG-REC-ERROR.
053500     IF XRECORD-LENGTH (1) NOT EQUAL TO 151
053600         GO TO READ-LONG-REC-ERROR.
053700     MOVE COUNT-OF-RECS TO SAVE-COUNT-OF-RECS.
053800     IF SAVE-COUNT-OF-RECS NOT EQUAL TO SQ-VS6-RECNO
053900         GO TO READ-LONG-REC-ERROR.
054000     IF LONG-OR-SHORT EQUAL TO "LONG "
054100         GO TO READ-LONG-REC-EXIT.
054200 READ-LONG-REC-ERROR.
054300     ADD 1 TO RECORDS-IN-ERROR.
054400     MOVE 1 TO ERROR-FLAG.
054500 READ-LONG-REC-EXIT.
054600     EXIT.
054700 READ-INIT-F1-03.
054800     MOVE ZERO TO ERROR-FLAG.
054900 READ-TEST-F1-03.
055000     PERFORM READ-SHORT-REC THRU READ-SHORT-REC-EXIT 10 TIMES.
055100     IF EOF-FLAG EQUAL TO 1
055200          MOVE "UNEXPECTED EOF" TO RE-MARK
055300          GO TO READ-EOF-F1-06.
055400     IF ERROR-FLAG EQUAL TO 1
055500          GO TO READ-FAIL-F1-03.
055600 READ-PASS-F1-03.
055700     PERFORM PASS.
055800     GO TO READ-WRITE-F1-03.
055900 READ-FAIL-F1-03.
056000     MOVE "ERROR REA SHORT REC; VII-13 SR (3)         " TO RE-MARK
056100     PERFORM FAIL.
056200 READ-WRITE-F1-03.
056300     MOVE "READ SHORT RECORDS" TO FEATURE.
056400     MOVE "READ-TEST-F1-03" TO PAR-NAME.
056500     PERFORM PRINT-DETAIL.
056600 READ-INIT-F1-04.
056700     MOVE ZERO TO ERROR-FLAG.
056800 READ-TEST-F1-04.
056900     PERFORM READ-LONG-REC THRU READ-LONG-REC-EXIT 100 TIMES.
057000     IF EOF-FLAG EQUAL TO 1
057100         MOVE "UNEXPECTED EOF" TO RE-MARK
057200         GO TO READ-EOF-F1-06.
057300     IF ERROR-FLAG EQUAL TO 1
057400         GO TO READ-FAIL-F1-04.
057500 READ-PASS-F1-04.
057600     PERFORM PASS.
057700     GO TO READ-WRITE-F1-04.
057800 READ-FAIL-F1-04.
057900     PERFORM FAIL.
058000     MOVE "ERROR READING LONG RECORD" TO RE-MARK.
058100 READ-WRITE-F1-04.
058200     MOVE "READ LONG RECORDS" TO FEATURE.
058300     MOVE "READ-TEST-F1-04" TO PAR-NAME.
058400     PERFORM PRINT-DETAIL.
058500 READ-INIT-F1-05.
058600     MOVE ZERO TO ERROR-FLAG.
058700 READ-TEST-F1-05.
058800     PERFORM READ-SHORT-REC THRU READ-SHORT-REC-EXIT 338 TIMES.
058900     IF EOF-FLAG EQUAL TO 1
059000         MOVE "UNEXPECTED EOF" TO RE-MARK
059100         GO TO READ-EOF-F1-06.
059200     IF ERROR-FLAG EQUAL TO 1
059300         GO TO READ-FAIL-F1-05.
059400 READ-PASS-F1-05.
059500     PERFORM PASS.
059600     GO TO READ-WRITE-F1-05.
059700 READ-FAIL-F1-05.
059800     MOVE "ERROR READING SHORT;VII-13 GR (3)          " TO RE-MARK
059900     PERFORM FAIL.
060000 READ-WRITE-F1-05.
060100     MOVE "READ SHORT RECORDS" TO FEATURE.
060200     MOVE "READ-TEST-F1-05" TO PAR-NAME.
060300     PERFORM PRINT-DETAIL.
060400 READ-INIT-F1-06.
060500     READ SQ-VS6 RECORD END
060600         GO TO READ-TEST-F1-06.
060700     MOVE "MORE THAN 450 RECORDS" TO RE-MARK.
060800     GO TO READ-FAIL-F1-06.
060900 READ-EOF-F1-06.
061000     MOVE "RECORDS READ =" TO COMPUTED-A.
061100     MOVE COUNT-OF-RECS TO CORRECT-18V0.
061200     GO TO READ-FAIL-F1-06.
061300 READ-TEST-F1-06.
061400     IF RECORDS-IN-ERROR NOT EQUAL TO ZERO
061500         MOVE "RECORDS IN ERROR =" TO COMPUTED-A
061600         MOVE RECORDS-IN-ERROR TO CORRECT-18V0
061700         GO TO READ-FAIL-F1-06.
061800 READ-PASS-F1-06.
061900     PERFORM PASS.
062000     GO TO READ-WRITE-F1-06.
062100 READ-FAIL-F1-06.
062200     MOVE "VII-13 GR (3)          " TO RE-MARK.
062300     PERFORM FAIL.
062400 READ-WRITE-F1-06.
062500     MOVE "READ-TEST-F1-06" TO PAR-NAME.
062600     MOVE "VERIFY FILE SQ-VS6" TO FEATURE.
062700     PERFORM PRINT-DETAIL.
062800 READ-CLOSE-F1-06.
062900     CLOSE SQ-VS6.
063000 SECT-SQ219A-0002 SECTION.
063100*        THIS SECTION CHECKS IF THE ENTIRE RECORD AREA IS WRITTEN
063200*    ON THE OUTPUT DEVICE WHEN A SHORT RECORD IS WRITTEN.  THE
063300*    RECORD NUMBER IN CHARACTERS 126 THROUGH 130 IS UNIQUE
063400*    FOR EACH RECORD.
063500 INFO-INIT-001.
063600     OPEN INPUT SQ-VS6.
063700     MOVE ZERO TO COUNT-OF-RECS.
063800 INFO-TEST-001.
063900     READ SQ-VS6 AT END
064000          GO TO INFO-END.
064100     ADD 1 TO COUNT-OF-RECS.
064200     IF SQ-VS6-RECNO NOT EQUAL TO "00001"
064300          GO TO NO-INFO-001.
064400     MOVE "MAXIMUM RECORD SIZE WRITTEN" TO RE-MARK.
064500     MOVE "RECORD READ =" TO COMPUTED-A.
064600     MOVE 0001 TO CORRECT-18V0.
064700     GO TO INFO-WRITE-001.
064800 NO-INFO-001.
064900     MOVE "NO DEFINITE CONCLUSION POSSIBLE" TO RE-MARK.
065000 INFO-WRITE-001.
065100     MOVE "READ SHORT RECORD" TO FEATURE.
065200     MOVE "INFO-TEST-001" TO PAR-NAME.
065300     PERFORM PRINT-DETAIL.
065400 INFO-INIT-002.
065500     READ SQ-VS6 RECORD AT END
065600          GO TO INFO-END.
065700     READ SQ-VS6 END
065800          GO TO INFO-END.
065900 INFO-TEST-002.
066000     READ SQ-VS6 AT END
066100          GO TO INFO-END.
066200     IF SQ-VS6-RECNO NOT EQUAL TO "00004"
066300          GO TO NO-INFO-002.
066400     MOVE "MAXIMUM RECORD SIZE WRITTEN" TO RE-MARK.
066500     MOVE "RECORD READ =" TO COMPUTED-A.
066600     MOVE 0004 TO CORRECT-18V0.
066700     GO TO INFO-WRITE-002.
066800 NO-INFO-002.
066900     MOVE "NO DEFINITE CONCLUSION POSSIBLE" TO RE-MARK.
067000 INFO-WRITE-002.
067100     MOVE "READ SHORT RECORD" TO FEATURE.
067200     MOVE "INFO-TEST-002" TO PAR-NAME.
067300     PERFORM PRINT-DETAIL.
067400 INFO-INIT-003.
067500     ADD 3 TO COUNT-OF-RECS.
067600 INFO-INIT-003-1.
067700     READ SQ-VS6 RECORD
067800          END GO TO INFO-END.
067900     ADD 1 TO COUNT-OF-RECS.
068000     IF COUNT-OF-RECS EQUAL TO 450
068100         GO TO INFO-TEST-003.
068200     GO TO INFO-INIT-003-1.
068300 INFO-TEST-003.
068400     IF SQ-VS6-RECNO NOT EQUAL TO "00450"
068500          GO TO NO-INFO-003.
068600     MOVE "MAXIMUM RECORD SIZE WRITTEN" TO RE-MARK.
068700     MOVE "RECORD READ =" TO COMPUTED-A.
068800     MOVE 0450 TO CORRECT-18V0.
068900     GO TO INFO-WRITE-003.
069000 NO-INFO-003.
069100     MOVE "NO DEFINITE CONCLUSION POSSIBLE" TO RE-MARK.
069200 INFO-WRITE-003.
069300     MOVE "READ SHORT RECORD" TO FEATURE.
069400     MOVE "INFO-TEST-003" TO PAR-NAME.
069500     PERFORM PRINT-DETAIL.
069600 INFO-END.
069700     CLOSE SQ-VS6.
069800 TERMINATE-ROUTINE.
069900     EXIT.
070000 CCVS-EXIT SECTION.
070100 CCVS-999999.
070200     GO TO CLOSE-FILES.
