000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ225A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                             REVISED 1986, AUGUST             *
001000*                                                              *
001100*    CREATION DATE     /     VALIDATION DATE                   *
001200*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001300*                                                              *
001400****************************************************************
001500*                                                              *
001600*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001700*                                                              *
001800*            X-14   SEQUENTIAL MASS STORAGE FILE.              *
001900*            X-55   SYSTEM PRINTER                             *
002000*            X-82   SOURCE-COMPUTER                            *
002100*            X-83   OBJECT-COMPUTER.                           *
002200*                                                              *
002300*                                                              *
002400****************************************************************
002500*                                                              *
002600*    SQ225A ATTEMPTS TO OPEN FOR EXTEND A MASS STORAGE FILE    *
002700*    WHICH IS NOT PRESENT.  THIS SHOULD RESULT IN A PERMANENT  *
002800*    ERROR AND AN I-O STATUS OF "35".  THE PROGRAM CONTAINS AN *
002900*    APPLICABLE DECLARATIVE PROCEDURE, WHICH SHOULD BE         *
003000*    EXECUTED.  THE STANDARD ALLOWS THE IMPLEMENTOR TO         *
003100*    TERMINATE EXECUTION ON EXIT FROM THE DECLARATIVE, OR TO   *
003200*    CONTINUE EXECUTION IN THE MAIN PROGRAM.                   *
003300*                                                              *
003400****************************************************************
003500*
003600 ENVIRONMENT DIVISION.
003700 CONFIGURATION SECTION.
003800 SOURCE-COMPUTER.
003900     XXXXX082.
004000 OBJECT-COMPUTER.
004100     XXXXX083.
004200*
004300 INPUT-OUTPUT SECTION.
004400 FILE-CONTROL.
004500     SELECT PRINT-FILE ASSIGN TO
004600     XXXXX055.
004700*
004800P    SELECT RAW-DATA   ASSIGN TO
004900P    XXXXX062
005000P          ORGANIZATION IS INDEXED
005100P          ACCESS MODE  IS RANDOM
005200P          RECORD-KEY   IS RAW-DATA-KEY.
005300P
005400     SELECT SQ-FS1 ASSIGN TO
005500     XXXXX014
005600            FILE STATUS IS SQ-FS1-STATUS.
005700*
005800*
005900 DATA DIVISION.
006000 FILE SECTION.
006100 FD  PRINT-FILE
006200C    LABEL RECORDS
006300C    XXXXX084
006400C    DATA RECORD IS PRINT-REC DUMMY-RECORD
006500               .
006600 01  PRINT-REC    PICTURE X(120).
006700 01  DUMMY-RECORD PICTURE X(120).
006800P
006900PFD  RAW-DATA.
007000P01  RAW-DATA-SATZ.
007100P    05  RAW-DATA-KEY        PIC X(6).
007200P    05  C-DATE              PIC 9(6).
007300P    05  C-TIME              PIC 9(8).
007400P    05  NO-OF-TESTS         PIC 99.
007500P    05  C-OK                PIC 999.
007600P    05  C-ALL               PIC 999.
007700P    05  C-FAIL              PIC 999.
007800P    05  C-DELETED           PIC 999.
007900P    05  C-INSPECT           PIC 999.
008000P    05  C-NOTE              PIC X(13).
008100P    05  C-INDENT            PIC X.
008200P    05  C-ABORT             PIC X(8).
008300*
008400 FD  SQ-FS1
008500C    LABEL RECORD IS STANDARD
008600                .
008700 01  SQ-FS1R1-F-G-120 PIC X(120).
008800*
008900 WORKING-STORAGE SECTION.
009000*
009100***************************************************************
009200*                                                             *
009300*    WORKING-STORAGE DATA ITEMS SPECIFIC TO THIS TEST SUITE   *
009400*                                                             *
009500***************************************************************
009600*
009700 01  SQ-FS1-STATUS.
009800   03  SQ-FS1-KEY-1   PIC X.
009900   03  SQ-FS1-KEY-2   PIC X.
010000*
010100 01  DECL-EXEC-SW  PIC 9.
010200*
010300***************************************************************
010400*                                                             *
010500*    WORKING-STORAGE DATA ITEMS USED BY THE CCVS              *
010600*                                                             *
010700***************************************************************
010800*
010900 01  REC-SKEL-SUB   PIC 99.
011000*
011100 01  FILE-RECORD-INFORMATION-REC.
011200     03 FILE-RECORD-INFO-SKELETON.
011300        05 FILLER                 PICTURE X(48)       VALUE
011400             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
011500        05 FILLER                 PICTURE X(46)       VALUE
011600             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
011700        05 FILLER                 PICTURE X(26)       VALUE
011800             ",LFIL=000000,ORG=  ,LBLR= ".
011900        05 FILLER                 PICTURE X(37)       VALUE
012000             ",RECKEY=                             ".
012100        05 FILLER                 PICTURE X(38)       VALUE
012200             ",ALTKEY1=                             ".
012300        05 FILLER                 PICTURE X(38)       VALUE
012400             ",ALTKEY2=                             ".
012500        05 FILLER                 PICTURE X(7)        VALUE SPACE.
012600     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
012700        05 FILE-RECORD-INFO-P1-120.
012800           07 FILLER              PIC X(5).
012900           07 XFILE-NAME          PIC X(6).
013000           07 FILLER              PIC X(8).
013100           07 XRECORD-NAME        PIC X(6).
013200           07 FILLER              PIC X(1).
013300           07 REELUNIT-NUMBER     PIC 9(1).
013400           07 FILLER              PIC X(7).
013500           07 XRECORD-NUMBER      PIC 9(6).
013600           07 FILLER              PIC X(6).
013700           07 UPDATE-NUMBER       PIC 9(2).
013800           07 FILLER              PIC X(5).
013900           07 ODO-NUMBER          PIC 9(4).
014000           07 FILLER              PIC X(5).
014100           07 XPROGRAM-NAME       PIC X(5).
014200           07 FILLER              PIC X(7).
014300           07 XRECORD-LENGTH      PIC 9(6).
014400           07 FILLER              PIC X(7).
014500           07 CHARS-OR-RECORDS    PIC X(2).
014600           07 FILLER              PIC X(1).
014700           07 XBLOCK-SIZE         PIC 9(4).
014800           07 FILLER              PIC X(6).
014900           07 RECORDS-IN-FILE     PIC 9(6).
015000           07 FILLER              PIC X(5).
015100           07 XFILE-ORGANIZATION  PIC X(2).
015200           07 FILLER              PIC X(6).
015300           07 XLABEL-TYPE         PIC X(1).
015400        05 FILE-RECORD-INFO-P121-240.
015500           07 FILLER              PIC X(8).
015600           07 XRECORD-KEY         PIC X(29).
015700           07 FILLER              PIC X(9).
015800           07 ALTERNATE-KEY1      PIC X(29).
015900           07 FILLER              PIC X(9).
016000           07 ALTERNATE-KEY2      PIC X(29).
016100           07 FILLER              PIC X(7).
016200*
016300 01  TEST-RESULTS.
016400     02 FILLER              PIC X      VALUE SPACE.
016500     02  PAR-NAME.
016600       03 FILLER              PIC X(14)  VALUE SPACE.
016700       03 PARDOT-X            PIC X      VALUE SPACE.
016800       03 DOTVALUE            PIC 99     VALUE ZERO.
016900     02 FILLER              PIC X      VALUE SPACE.
017000     02 FEATURE             PIC X(24)  VALUE SPACE.
017100     02 FILLER              PIC X      VALUE SPACE.
017200     02 P-OR-F              PIC X(5)   VALUE SPACE.
017300     02 FILLER              PIC X(9)   VALUE SPACE.
017400     02 RE-MARK             PIC X(61).
017500 01  TEST-COMPUTED.
017600   02 FILLER  PIC X(30)  VALUE SPACE.
017700   02 FILLER  PIC X(17)  VALUE "      COMPUTED =".
017800   02 COMPUTED-X.
017900     03 COMPUTED-A    PIC X(20)  VALUE SPACE.
018000     03 COMPUTED-N    REDEFINES COMPUTED-A PIC -9(9).9(9).
018100     03 COMPUTED-0V18 REDEFINES COMPUTED-A PIC -.9(18).
018200     03 COMPUTED-4V14 REDEFINES COMPUTED-A PIC -9(4).9(14).
018300     03 COMPUTED-14V4 REDEFINES COMPUTED-A PIC -9(14).9(4).
018400     03       CM-18V0 REDEFINES COMPUTED-A.
018500        04 COMPUTED-18V0                   PIC -9(18).
018600        04 FILLER                          PIC X.
018700     03 FILLER PIC X(50) VALUE SPACE.
018800 01  TEST-CORRECT.
018900     02 FILLER PIC X(30) VALUE SPACE.
019000     02 FILLER PIC X(17) VALUE "       CORRECT =".
019100     02 CORRECT-X.
019200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
019300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
019400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
019500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
019600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
019700     03      CR-18V0 REDEFINES CORRECT-A.
019800         04 CORRECT-18V0                     PIC -9(18).
019900         04 FILLER                           PIC X.
020000     03 FILLER PIC X(2) VALUE SPACE.
020100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
020200*
020300 01  CCVS-C-1.
020400     02 FILLER  PIC IS X        VALUE  SPACE.
020500     02 FILLER  PIC IS X(17)    VALUE "PARAGRAPH-NAME".
020600     02 FILLER  PIC IS X        VALUE  SPACE.
020700     02 FILLER  PIC IS X(24)    VALUE IS "FEATURE".
020800     02 FILLER  PIC IS X        VALUE  SPACE.
020900     02 FILLER  PIC IS X(5)     VALUE "PASS ".
021000     02 FILLER  PIC IS X(9)     VALUE  SPACE.
021100     02 FILLER  PIC IS X(62)    VALUE "REMARKS".
021200 01  CCVS-C-2.
021300     02 FILLER  PIC X(19)  VALUE  SPACE.
021400     02 FILLER  PIC X(6)   VALUE "TESTED".
021500     02 FILLER  PIC X(19)  VALUE  SPACE.
021600     02 FILLER  PIC X(4)   VALUE "FAIL".
021700     02 FILLER  PIC X(72)  VALUE  SPACE.
021800*
021900 01  REC-SKL-SUB       PIC 9(2)     VALUE ZERO.
022000 01  REC-CT            PIC 99       VALUE ZERO.
022100 01  DELETE-COUNTER    PIC 999      VALUE ZERO.
022200 01  ERROR-COUNTER     PIC 999      VALUE ZERO.
022300 01  INSPECT-COUNTER   PIC 999      VALUE ZERO.
022400 01  PASS-COUNTER      PIC 999      VALUE ZERO.
022500 01  TOTAL-ERROR       PIC 999      VALUE ZERO.
022600 01  ERROR-HOLD        PIC 999      VALUE ZERO.
022700 01  DUMMY-HOLD        PIC X(120)   VALUE SPACE.
022800 01  RECORD-COUNT      PIC 9(5)     VALUE ZERO.
022900 01  ANSI-REFERENCE    PIC X(48)    VALUE SPACES.
023000 01  CCVS-H-1.
023100     02  FILLER          PIC X(39)    VALUE SPACES.
023200     02  FILLER          PIC X(42)    VALUE
023300     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
023400     02  FILLER          PIC X(39)    VALUE SPACES.
023500 01  CCVS-H-2A.
023600   02  FILLER            PIC X(40)  VALUE SPACE.
023700   02  FILLER            PIC X(7)   VALUE "CCVS85 ".
023800   02  FILLER            PIC XXXX   VALUE
023900     "4.2 ".
024000   02  FILLER            PIC X(28)  VALUE
024100            " COPY - NOT FOR DISTRIBUTION".
024200   02  FILLER            PIC X(41)  VALUE SPACE.
024300*
024400 01  CCVS-H-2B.
024500   02  FILLER            PIC X(15)  VALUE "TEST RESULT OF ".
024600   02  TEST-ID           PIC X(9).
024700   02  FILLER            PIC X(4)   VALUE " IN ".
024800   02  FILLER            PIC X(12)  VALUE
024900     " HIGH       ".
025000   02  FILLER            PIC X(22)  VALUE
025100            " LEVEL VALIDATION FOR ".
025200   02  FILLER            PIC X(58)  VALUE
025300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
025400 01  CCVS-H-3.
025500     02  FILLER          PIC X(34)  VALUE
025600            " FOR OFFICIAL USE ONLY    ".
025700     02  FILLER          PIC X(58)  VALUE
025800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
025900     02  FILLER          PIC X(28)  VALUE
026000            "  COPYRIGHT   1985,1986 ".
026100 01  CCVS-E-1.
026200     02 FILLER           PIC X(52)  VALUE SPACE.
026300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
026400     02 ID-AGAIN         PIC X(9).
026500     02 FILLER           PIC X(45)  VALUE SPACES.
026600 01  CCVS-E-2.
026700     02  FILLER          PIC X(31)  VALUE SPACE.
026800     02  FILLER          PIC X(21)  VALUE SPACE.
026900     02  CCVS-E-2-2.
027000         03 ERROR-TOTAL    PIC XXX    VALUE SPACE.
027100         03 FILLER         PIC X      VALUE SPACE.
027200         03 ENDER-DESC     PIC X(44)  VALUE
027300            "ERRORS ENCOUNTERED".
027400 01  CCVS-E-3.
027500     02  FILLER          PIC X(22)  VALUE
027600            " FOR OFFICIAL USE ONLY".
027700     02  FILLER          PIC X(12)  VALUE SPACE.
027800     02  FILLER          PIC X(58)  VALUE
027900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
028000     02  FILLER          PIC X(8)   VALUE SPACE.
028100     02  FILLER          PIC X(20)  VALUE
028200             " COPYRIGHT 1985,1986".
028300 01  CCVS-E-4.
028400     02 CCVS-E-4-1       PIC XXX    VALUE SPACE.
028500     02 FILLER           PIC X(4)   VALUE " OF ".
028600     02 CCVS-E-4-2       PIC XXX    VALUE SPACE.
028700     02 FILLER           PIC X(40)  VALUE
028800      "  TESTS WERE EXECUTED SUCCESSFULLY".
028900 01  XXINFO.
029000     02 FILLER           PIC X(19)  VALUE "*** INFORMATION ***".
029100     02 INFO-TEXT.
029200       04 FILLER             PIC X(8)   VALUE SPACE.
029300       04 XXCOMPUTED         PIC X(20).
029400       04 FILLER             PIC X(5)   VALUE SPACE.
029500       04 XXCORRECT          PIC X(20).
029600     02 INF-ANSI-REFERENCE PIC X(48).
029700 01  HYPHEN-LINE.
029800     02 FILLER  PIC IS X VALUE IS SPACE.
029900     02 FILLER  PIC IS X(65)    VALUE IS "************************
030000-    "*****************************************".
030100     02 FILLER  PIC IS X(54)    VALUE IS "************************
030200-    "******************************".
030300 01  CCVS-PGM-ID  PIC X(9)   VALUE
030400     "SQ225A".
030500*
030600*
030700 PROCEDURE DIVISION.
030800 DECLARATIVES.
030900 SQ225A-DECLARATIVE-001-SECT SECTION.
031000     USE AFTER ERROR PROCEDURE EXTEND.
031100 INPUT-ERROR-PROCEDURE.
031200     IF DECL-EXEC-SW NOT = 9
031300         GO TO   NOT-DECL-9.
031400*
031500*    DECLARATIVE PROCEDURE ENTERED FROM OPEN INPUT
031600*
031700 DECL-OPEN-TEST.
031800     MOVE   "EXEC USE ON OPEN FAILURE" TO FEATURE.
031900     MOVE   "DECL-OPEN-TEST" TO PAR-NAME.
032000     MOVE    1               TO REC-CT.
032100     IF SQ-FS1-STATUS = "35"
032200         PERFORM DECL-PASS
032300     ELSE
032400         MOVE   "35"           TO CORRECT-A
032500         MOVE    SQ-FS1-STATUS TO COMPUTED-A
032600         MOVE   "INCORRECT FILE STATUS FOR NON-AVAILABLE FILE"
032700                   TO RE-MARK
032800         PERFORM DECL-FAIL.
032900     MOVE    SPACE TO DUMMY-RECORD
033000     PERFORM DECL-WRITE-LINE
033100     MOVE   "ABNORMAL TERMINATION AT THIS POINT IS ACCEPTABLE"
033200               TO DUMMY-RECORD
033300     PERFORM DECL-WRITE-LINE 3 TIMES.
033400     GO TO   END-DECLS.
033500*
033600*
033700 NOT-DECL-9.
033800     MOVE   "NOT-DECL-9"  TO PAR-NAME.
033900     MOVE    DECL-EXEC-SW TO COMPUTED-18V0.
034000     MOVE    9            TO CORRECT-18V0.
034100     PERFORM DECL-FAIL.
034200     GO TO   END-DECLS.
034300*
034400*
034500 DECL-PASS.
034600     MOVE   "PASS " TO P-OR-F.
034700     ADD     1 TO PASS-COUNTER.
034800     PERFORM DECL-PRINT-DETAIL.
034900*
035000 DECL-FAIL.
035100     MOVE   "FAIL*" TO P-OR-F.
035200     ADD     1 TO ERROR-COUNTER.
035300     PERFORM DECL-PRINT-DETAIL.
035400*
035500 DECL-PRINT-DETAIL.
035600     IF REC-CT NOT EQUAL TO ZERO
035700             MOVE "." TO PARDOT-X
035800             MOVE REC-CT TO DOTVALUE.
035900     MOVE    TEST-RESULTS TO PRINT-REC.
036000     PERFORM DECL-WRITE-LINE.
036100     IF P-OR-F EQUAL TO "FAIL*"
036200         PERFORM DECL-WRITE-LINE
036300         PERFORM DECL-FAIL-ROUTINE THRU DECL-FAIL-EX
036400     ELSE
036500         PERFORM DECL-BAIL THRU DECL-BAIL-EX.
036600     MOVE    SPACE TO P-OR-F.
036700     MOVE    SPACE TO COMPUTED-X.
036800     MOVE    SPACE TO CORRECT-X.
036900     IF REC-CT EQUAL TO ZERO
037000         MOVE    SPACE TO PAR-NAME.
037100     MOVE    SPACE TO RE-MARK.
037200*
037300 DECL-WRITE-LINE.
037400     ADD     1 TO RECORD-COUNT.
037500Y    IF RECORD-COUNT GREATER 50
037600Y        MOVE    DUMMY-RECORD TO DUMMY-HOLD
037700Y        MOVE    SPACE TO DUMMY-RECORD
037800Y        WRITE   DUMMY-RECORD AFTER ADVANCING PAGE
037900Y        MOVE    CCVS-C-1 TO DUMMY-RECORD PERFORM DECL-WRT-LN
038000Y        MOVE    CCVS-C-2 TO DUMMY-RECORD
038100Y        PERFORM DECL-WRT-LN 2 TIMES
038200Y        MOVE    HYPHEN-LINE TO DUMMY-RECORD
038300Y        PERFORM DECL-WRT-LN
038400Y        MOVE    DUMMY-HOLD TO DUMMY-RECORD
038500Y        MOVE    ZERO TO RECORD-COUNT.
038600     PERFORM DECL-WRT-LN.
038700*
038800 DECL-WRT-LN.
038900     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
039000     MOVE    SPACE TO DUMMY-RECORD.
039100*
039200 DECL-FAIL-ROUTINE.
039300     IF COMPUTED-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
039400     IF CORRECT-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
039500     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
039600     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
039700     MOVE    XXINFO TO DUMMY-RECORD.
039800     PERFORM DECL-WRITE-LINE 2 TIMES.
039900     MOVE    SPACES TO INF-ANSI-REFERENCE.
040000     GO TO   DECL-FAIL-EX.
040100 DECL-FAIL-WRITE.
040200     MOVE    TEST-COMPUTED TO PRINT-REC
040300     PERFORM DECL-WRITE-LINE
040400     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
040500     MOVE    TEST-CORRECT TO PRINT-REC
040600     PERFORM DECL-WRITE-LINE 2 TIMES.
040700     MOVE    SPACES TO COR-ANSI-REFERENCE.
040800 DECL-FAIL-EX.
040900     EXIT.
041000*
041100 DECL-BAIL.
041200     IF COMPUTED-A NOT EQUAL TO SPACE GO TO DECL-BAIL-WRITE.
041300     IF CORRECT-A EQUAL TO SPACE GO TO DECL-BAIL-EX.
041400 DECL-BAIL-WRITE.
041500     MOVE    CORRECT-A TO XXCORRECT.
041600     MOVE    COMPUTED-A TO XXCOMPUTED.
041700     MOVE    XXINFO TO DUMMY-RECORD.
041800     PERFORM DECL-WRITE-LINE 2 TIMES.
041900 DECL-BAIL-EX.
042000     EXIT.
042100*
042200 END-DECLS.
042300     MOVE    ZERO TO DECL-EXEC-SW.
042400 END DECLARATIVES.
042500*
042600*
042700 CCVS1 SECTION.
042800 OPEN-FILES.
042900P    OPEN    I-O RAW-DATA.
043000P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
043100P    READ    RAW-DATA INVALID KEY GO TO END-E-1.
043200P    MOVE   "ABORTED "   TO C-ABORT.
043300P    ADD     1           TO C-NO-OF-TESTS.
043400P    ACCEPT  C-DATE      FROM DATE.
043500P    ACCEPT  C-TIME      FROM TIME.
043600P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
043700PEND-E-1.
043800P    CLOSE   RAW-DATA.
043900     OPEN    OUTPUT PRINT-FILE.
044000     MOVE    CCVS-PGM-ID TO TEST-ID.
044100     MOVE    CCVS-PGM-ID TO ID-AGAIN.
044200     MOVE    SPACE TO TEST-RESULTS.
044300     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
044400     MOVE    ZERO TO REC-SKEL-SUB.
044500     PERFORM CCVS-INIT-FILE 10 TIMES.
044600     GO TO CCVS1-EXIT.
044700*
044800 CCVS-INIT-FILE.
044900     ADD     1 TO REC-SKL-SUB.
045000     MOVE    FILE-RECORD-INFO-SKELETON TO
045100                  FILE-RECORD-INFO (REC-SKL-SUB).
045200*
045300 CLOSE-FILES.
045400     PERFORM END-ROUTINE THRU END-ROUTINE-13.
045500     CLOSE   PRINT-FILE.
045600P    OPEN    I-O RAW-DATA.
045700P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
045800P    READ    RAW-DATA INVALID KEY GO TO END-E-2.
045900P    MOVE   "OK.     " TO C-ABORT.
046000P    MOVE    PASS-COUNTER  TO C-OK.
046100P    MOVE    ERROR-HOLD    TO C-ALL.
046200P    MOVE    ERROR-COUNTER TO C-FAIL.
046300P    MOVE    DELETE-CNT    TO C-DELETED.
046400P    MOVE    INSPECT-COUNTER TO C-INSPECT.
046500P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
046600PEND-E-2.
046700P    CLOSE   RAW-DATA.
046800 TERMINATE-CCVS.
046900S    EXIT    PROGRAM.
047000     STOP    RUN.
047100*
047200 INSPT.
047300     MOVE   "INSPT" TO P-OR-F.
047400     ADD     1 TO INSPECT-COUNTER.
047500     PERFORM PRINT-DETAIL.
047600
047700 PASS.
047800     MOVE   "PASS " TO P-OR-F.
047900     ADD     1 TO PASS-COUNTER.
048000     PERFORM PRINT-DETAIL.
048100*
048200 FAIL.
048300     MOVE   "FAIL*" TO P-OR-F.
048400     ADD     1 TO ERROR-COUNTER.
048500     PERFORM PRINT-DETAIL.
048600*
048700 DE-LETE.
048800     MOVE   "****TEST DELETED****" TO RE-MARK.
048900     MOVE   "*****" TO P-OR-F.
049000     ADD     1 TO DELETE-COUNTER.
049100     PERFORM PRINT-DETAIL.
049200*
049300 PRINT-DETAIL.
049400     IF REC-CT NOT EQUAL TO ZERO
049500         MOVE   "." TO PARDOT-X
049600         MOVE    REC-CT TO DOTVALUE.
049700     MOVE    TEST-RESULTS TO PRINT-REC.
049800     PERFORM WRITE-LINE.
049900     IF P-OR-F EQUAL TO "FAIL*"
050000         PERFORM WRITE-LINE
050100         PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
050200     ELSE
050300         PERFORM BAIL-OUT THRU BAIL-OUT-EX.
050400     MOVE    SPACE TO P-OR-F.
050500     MOVE    SPACE TO COMPUTED-X.
050600     MOVE    SPACE TO CORRECT-X.
050700     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
050800     MOVE    SPACE TO RE-MARK.
050900*
051000 HEAD-ROUTINE.
051100     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051200     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051300     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
051400     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
051500 COLUMN-NAMES-ROUTINE.
051600     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
051700     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051800     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
051900 END-ROUTINE.
052000     MOVE    HYPHEN-LINE TO DUMMY-RECORD.
052100     PERFORM WRITE-LINE 5 TIMES.
052200 END-RTN-EXIT.
052300     MOVE    CCVS-E-1 TO DUMMY-RECORD.
052400     PERFORM WRITE-LINE 2 TIMES.
052500*
052600 END-ROUTINE-1.
052700     ADD     ERROR-COUNTER   TO ERROR-HOLD
052800     ADD     INSPECT-COUNTER TO ERROR-HOLD.
052900     ADD     DELETE-COUNTER  TO ERROR-HOLD.
053000     ADD     PASS-COUNTER    TO ERROR-HOLD.
053100     MOVE    PASS-COUNTER    TO CCVS-E-4-1.
053200     MOVE    ERROR-HOLD      TO CCVS-E-4-2.
053300     MOVE    CCVS-E-4        TO CCVS-E-2-2.
053400     MOVE    CCVS-E-2        TO DUMMY-RECORD
053500     PERFORM WRITE-LINE.
053600     MOVE   "TEST(S) FAILED" TO ENDER-DESC.
053700     IF ERROR-COUNTER IS EQUAL TO ZERO
053800         MOVE   "NO " TO ERROR-TOTAL
053900     ELSE
054000         MOVE    ERROR-COUNTER TO ERROR-TOTAL.
054100     MOVE    CCVS-E-2 TO DUMMY-RECORD.
054200     PERFORM WRITE-LINE.
054300 END-ROUTINE-13.
054400     IF DELETE-COUNTER IS EQUAL TO ZERO
054500         MOVE   "NO " TO ERROR-TOTAL
054600     ELSE
054700         MOVE    DELETE-COUNTER TO ERROR-TOTAL.
054800     MOVE   "TEST(S) DELETED     " TO ENDER-DESC.
054900     MOVE    CCVS-E-2 TO DUMMY-RECORD.
055000     PERFORM WRITE-LINE.
055100     IF INSPECT-COUNTER EQUAL TO ZERO
055200         MOVE   "NO " TO ERROR-TOTAL
055300     ELSE
055400         MOVE    INSPECT-COUNTER TO ERROR-TOTAL.
055500     MOVE   "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
055600     MOVE    CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055700     MOVE    CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055800*
055900 WRITE-LINE.
056000     ADD     1 TO RECORD-COUNT.
056100Y    IF RECORD-COUNT GREATER 50
056200Y        MOVE  DUMMY-RECORD TO DUMMY-HOLD
056300Y        MOVE  SPACE TO DUMMY-RECORD
056400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
056500Y        MOVE  CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
056600Y        MOVE  CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
056700Y        MOVE  HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
056800Y        MOVE  DUMMY-HOLD TO DUMMY-RECORD
056900Y        MOVE  ZERO TO RECORD-COUNT.
057000     PERFORM WRT-LN.
057100*
057200 WRT-LN.
057300     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
057400     MOVE    SPACE TO DUMMY-RECORD.
057500 BLANK-LINE-PRINT.
057600     PERFORM WRT-LN.
057700 FAIL-ROUTINE.
057800     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
057900     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
058000     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
058100     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
058200     MOVE    XXINFO TO DUMMY-RECORD.
058300     PERFORM WRITE-LINE 2 TIMES.
058400     MOVE    SPACES TO INF-ANSI-REFERENCE.
058500     GO TO   FAIL-ROUTINE-EX.
058600 FAIL-ROUTINE-WRITE.
058700     MOVE    TEST-COMPUTED  TO PRINT-REC
058800     PERFORM WRITE-LINE
058900     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
059000     MOVE    TEST-CORRECT   TO PRINT-REC
059100     PERFORM WRITE-LINE 2 TIMES.
059200     MOVE    SPACES         TO COR-ANSI-REFERENCE.
059300 FAIL-ROUTINE-EX.
059400     EXIT.
059500 BAIL-OUT.
059600     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
059700     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
059800 BAIL-OUT-WRITE.
059900     MOVE    CORRECT-A      TO XXCORRECT.
060000     MOVE    COMPUTED-A     TO XXCOMPUTED.
060100     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
060200     MOVE    XXINFO TO DUMMY-RECORD.
060300     PERFORM WRITE-LINE 2 TIMES.
060400     MOVE    SPACES TO INF-ANSI-REFERENCE.
060500 BAIL-OUT-EX.
060600     EXIT.
060700 CCVS1-EXIT.
060800     EXIT.
060900*
061000****************************************************************
061100*                                                              *
061200*    THIS POINT MARKS THE END OF THE CCVS MONITOR ROUTINES AND *
061300*    THE START OF THE TESTS OF SPECIFIC COBOL FEATURES.        *
061400*                                                              *
061500****************************************************************
061600*
061700 SECT-SQ225A-MAIN SECTION.
061800 OPEN-INIT-01.
061900*
062000*    THIS PROGRAM ATTEMPTS TO OPEN A FILE WHICH IS NOT
062100*    PRESENT AND AVAILABLE TO IT.
062200*
062300     MOVE    9 TO DECL-EXEC-SW
062400     MOVE   "**" TO SQ-FS1-STATUS.
062500 OPEN-TEST-01.
062600     OPEN    EXTEND SQ-FS1.
062700     MOVE    1 TO REC-CT
062800     MOVE   "OPEN ABSENT FILE EXTEND" TO FEATURE
062900     MOVE   "OPEN-TEST-01" TO PAR-NAME
063000     IF      DECL-EXEC-SW = 0
063100         PERFORM PASS
063200     ELSE
063300         MOVE    DECL-EXEC-SW TO COMPUTED-18V0
063400         MOVE    ZERO         TO CORRECT-18V0
063500         MOVE   "DECLARATIVE NOT EXECUTED" TO RE-MARK
063600         MOVE   "V11-2, 1.3.5" TO ANSI-REFERENCE
063700         PERFORM FAIL.
063800*
063900     ADD     1 TO REC-CT.
064000     IF  SQ-FS1-STATUS NOT = "35"
064100         MOVE   "INCORRECT STATUS CODE RETURNED" TO RE-MARK
064200         MOVE   "VII-4, 1.5.3(3)C" TO ANSI-REFERENCE
064300         MOVE   "35" TO CORRECT-A
064400         MOVE    SQ-FS1-STATUS TO COMPUTED-A
064500         PERFORM FAIL
064600     ELSE
064700         PERFORM PASS.
064800*
064900*
065000 CCVS-EXIT SECTION.
065100 CCVS-999999.
065200     GO TO   CLOSE-FILES.
