000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     SQ228A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000800*    USING CCVS85 VERSION 1.0 ISSUED IN JANUARY 1986.          *
000900*                             REVISED 1986, AUGUST             *
001000*                                                              *
001100*    CREATION DATE     /     VALIDATION DATE                   *
001200*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001300*                                                              *
001400****************************************************************
001500*                                                              *
001600*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001700*                                                              *
001800*            X-14   SEQUENTIAL MASS STORAGE FILE               *
001900*            X-55   SYSTEM PRINTER                             *
002000*            X-82   SOURCE-COMPUTER                            *
002100*            X-83   OBJECT-COMPUTER.                           *
002200*                                                              *
002300****************************************************************
002400*                                                              *
002500*    SPLIT FROM SQ227A, THIS PROGRAM REPEATS THE SEQUENCE OF   *
002600*    FILE HANDLING ROUTINES IN ORDER TO CARRY OUT THE ISOLATED *
002700*    SPLIT TEST THAT CHECKS FOR THE CORRECT RESPONSE TO A      *
002800*    RE-WRITE ON A RECORD THAT IS TOO LONG FOR THE FILE.       *
002900*    (SEE SQ227A).                                             *
003000*                                                              *
003100****************************************************************
003200*
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.
003600     XXXXX082.
003700 OBJECT-COMPUTER.
003800     XXXXX083.
003900*
004000 INPUT-OUTPUT SECTION.
004100 FILE-CONTROL.
004200     SELECT PRINT-FILE ASSIGN TO
004300     XXXXX055.
004400*
004500P    SELECT RAW-DATA   ASSIGN TO
004600P    XXXXX062
004700P          ORGANIZATION IS INDEXED
004800P          ACCESS MODE  IS RANDOM
004900P          RECORD-KEY   IS RAW-DATA-KEY.
005000P
005100     SELECT SQ-FS4
005200            ASSIGN
005300     XXXXX014
005400            STATUS SQ-FS4-STATUS OF STATUS-GROUP
005500            ACCESS MODE IS SEQUENTIAL
005600            ORGANIZATION IS SEQUENTIAL
005700            .
005800*
005900*
006000 DATA DIVISION.
006100 FILE SECTION.
006200 FD  PRINT-FILE
006300C    LABEL RECORDS
006400C    XXXXX084
006500C    DATA RECORD IS PRINT-REC DUMMY-RECORD
006600               .
006700 01  PRINT-REC    PICTURE X(120).
006800 01  DUMMY-RECORD PICTURE X(120).
006900P
007000PFD  RAW-DATA.
007100P01  RAW-DATA-SATZ.
007200P    05  RAW-DATA-KEY        PIC X(6).
007300P    05  C-DATE              PIC 9(6).
007400P    05  C-TIME              PIC 9(8).
007500P    05  NO-OF-TESTS         PIC 99.
007600P    05  C-OK                PIC 999.
007700P    05  C-ALL               PIC 999.
007800P    05  C-FAIL              PIC 999.
007900P    05  C-DELETED           PIC 999.
008000P    05  C-INSPECT           PIC 999.
008100P    05  C-NOTE              PIC X(13).
008200P    05  C-INDENT            PIC X.
008300P    05  C-ABORT             PIC X(8).
008400*
008500 FD  SQ-FS4
008600C    LABEL RECORD IS STANDARD
008700     BLOCK  138 CHARACTERS
008800     RECORD VARYING SIZE FROM 50 TO 138 CHARACTERS
008900       DEPENDING ON SQ-FS4-RECSIZE
009000                .
009100 01  SQ-FS4R1-F-G-120.
009200        05 FFILE-RECORD-INFO-P1-120.
009300           07 FILLER              PIC X(5).
009400           07 FFILE-NAME          PIC X(6).
009500           07 FILLER              PIC X(8).
009600           07 FRECORD-NAME        PIC X(6).
009700           07 FILLER              PIC X(1).
009800           07 FREELUNIT-NUMBER    PIC 9(1).
009900           07 FILLER              PIC X(7).
010000           07 FRECORD-NUMBER      PIC 9(6).
010100           07 FILLER              PIC X(6).
010200           07 FUPDATE-NUMBER      PIC 9(2).
010300           07 FILLER              PIC X(5).
010400           07 FODO-NUMBER         PIC 9(4).
010500           07 FILLER              PIC X(5).
010600           07 FPROGRAM-NAME       PIC X(5).
010700           07 FILLER              PIC X(7).
010800           07 FRECORD-LENGTH      PIC 9(6).
010900           07 FILLER              PIC X(7).
011000           07 FCHARS-OR-RECORDS   PIC X(2).
011100           07 FILLER              PIC X(1).
011200           07 FBLOCK-SIZE         PIC 9(4).
011300           07 FILLER              PIC X(6).
011400           07 FRECORDS-IN-FILE    PIC 9(6).
011500           07 FILLER              PIC X(5).
011600           07 FFILE-ORGANIZATION  PIC X(2).
011700           07 FILLER              PIC X(6).
011800           07 FLABEL-TYPE         PIC X(1).
011900*
012000 01  SQ-FS4R2-F-G-138.
012100     03  FILLER PIC X(120).
012200     03  EXT-18 PIC X(18).
012300*
012400 WORKING-STORAGE SECTION.
012500*
012600***************************************************************
012700*                                                             *
012800*    WORKING-STORAGE DATA ITEMS SPECIFIC TO THIS TEST SUITE   *
012900*                                                             *
013000***************************************************************
013100*
013200 01  STATUS-GROUP.
013300     04  SQ-FS4-STATUS.
013400         07  SQ-FS4-KEY-1   PIC X.
013500         07  SQ-FS4-KEY-2   PIC X.
013600*
013700 01  DELETE-SW.
013800     03  DELETE-SW-1 PIC X.
013900     03  DELETE-SW-1-GROUP.
014000         05  DELETE-SW-2 PIC X.
014100*
014200 01  DECL-EXEC-I-O PIC X(12).
014300*
014400 01  DECL-EXEC-SW PIC X.
014500*
014600 01  SQ-FS4-RECSIZE PIC 999.
014700*
014800***************************************************************
014900*                                                             *
015000*    WORKING-STORAGE DATA ITEMS USED BY THE CCVS              *
015100*                                                             *
015200***************************************************************
015300*
015400 01  REC-SKEL-SUB   PIC 99.
015500*
015600 01  FILE-RECORD-INFORMATION-REC.
015700     03 FILE-RECORD-INFO-SKELETON.
015800        05 FILLER                 PICTURE X(48)       VALUE
015900             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
016000        05 FILLER                 PICTURE X(46)       VALUE
016100             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
016200        05 FILLER                 PICTURE X(26)       VALUE
016300             ",LFIL=000000,ORG=  ,LBLR= ".
016400        05 FILLER                 PICTURE X(37)       VALUE
016500             ",RECKEY=                             ".
016600        05 FILLER                 PICTURE X(38)       VALUE
016700             ",ALTKEY1=                             ".
016800        05 FILLER                 PICTURE X(38)       VALUE
016900             ",ALTKEY2=                             ".
017000        05 FILLER                 PICTURE X(7)        VALUE SPACE.
017100     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
017200        05 FILE-RECORD-INFO-P1-120.
017300           07 FILLER              PIC X(5).
017400           07 XFILE-NAME          PIC X(6).
017500           07 FILLER              PIC X(8).
017600           07 XRECORD-NAME        PIC X(6).
017700           07 FILLER              PIC X(1).
017800           07 REELUNIT-NUMBER     PIC 9(1).
017900           07 FILLER              PIC X(7).
018000           07 XRECORD-NUMBER      PIC 9(6).
018100           07 FILLER              PIC X(6).
018200           07 UPDATE-NUMBER       PIC 9(2).
018300           07 FILLER              PIC X(5).
018400           07 ODO-NUMBER          PIC 9(4).
018500           07 FILLER              PIC X(5).
018600           07 XPROGRAM-NAME       PIC X(5).
018700           07 FILLER              PIC X(7).
018800           07 XRECORD-LENGTH      PIC 9(6).
018900           07 FILLER              PIC X(7).
019000           07 CHARS-OR-RECORDS    PIC X(2).
019100           07 FILLER              PIC X(1).
019200           07 XBLOCK-SIZE         PIC 9(4).
019300           07 FILLER              PIC X(6).
019400           07 RECORDS-IN-FILE     PIC 9(6).
019500           07 FILLER              PIC X(5).
019600           07 XFILE-ORGANIZATION  PIC X(2).
019700           07 FILLER              PIC X(6).
019800           07 XLABEL-TYPE         PIC X(1).
019900        05 FILE-RECORD-INFO-P121-240.
020000           07 FILLER              PIC X(8).
020100           07 XRECORD-KEY         PIC X(29).
020200           07 FILLER              PIC X(9).
020300           07 ALTERNATE-KEY1      PIC X(29).
020400           07 FILLER              PIC X(9).
020500           07 ALTERNATE-KEY2      PIC X(29).
020600           07 FILLER              PIC X(7).
020700*
020800 01  TEST-RESULTS.
020900     02 FILLER              PIC X      VALUE SPACE.
021000     02  PAR-NAME.
021100       03 FILLER              PIC X(14)  VALUE SPACE.
021200       03 PARDOT-X            PIC X      VALUE SPACE.
021300       03 DOTVALUE            PIC 99     VALUE ZERO.
021400     02 FILLER              PIC X      VALUE SPACE.
021500     02 FEATURE             PIC X(24)  VALUE SPACE.
021600     02 FILLER              PIC X      VALUE SPACE.
021700     02 P-OR-F              PIC X(5)   VALUE SPACE.
021800     02 FILLER              PIC X(9)   VALUE SPACE.
021900     02 RE-MARK             PIC X(61).
022000 01  TEST-COMPUTED.
022100   02 FILLER  PIC X(30)  VALUE SPACE.
022200   02 FILLER  PIC X(17)  VALUE "      COMPUTED =".
022300   02 COMPUTED-X.
022400     03 COMPUTED-A    PIC X(20)  VALUE SPACE.
022500     03 COMPUTED-N    REDEFINES COMPUTED-A PIC -9(9).9(9).
022600     03 COMPUTED-0V18 REDEFINES COMPUTED-A PIC -.9(18).
022700     03 COMPUTED-4V14 REDEFINES COMPUTED-A PIC -9(4).9(14).
022800     03 COMPUTED-14V4 REDEFINES COMPUTED-A PIC -9(14).9(4).
022900     03       CM-18V0 REDEFINES COMPUTED-A.
023000        04 COMPUTED-18V0                   PIC -9(18).
023100        04 FILLER                          PIC X.
023200     03 FILLER PIC X(50) VALUE SPACE.
023300 01  TEST-CORRECT.
023400     02 FILLER PIC X(30) VALUE SPACE.
023500     02 FILLER PIC X(17) VALUE "       CORRECT =".
023600     02 CORRECT-X.
023700     03 CORRECT-A                  PIC X(20) VALUE SPACE.
023800     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
023900     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
024000     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
024100     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
024200     03      CR-18V0 REDEFINES CORRECT-A.
024300         04 CORRECT-18V0                     PIC -9(18).
024400         04 FILLER                           PIC X.
024500     03 FILLER PIC X(2) VALUE SPACE.
024600     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
024700*
024800 01  CCVS-C-1.
024900     02 FILLER  PIC IS X        VALUE  SPACE.
025000     02 FILLER  PIC IS X(17)    VALUE "PARAGRAPH-NAME".
025100     02 FILLER  PIC IS X        VALUE  SPACE.
025200     02 FILLER  PIC IS X(24)    VALUE IS "FEATURE".
025300     02 FILLER  PIC IS X        VALUE  SPACE.
025400     02 FILLER  PIC IS X(5)     VALUE "PASS ".
025500     02 FILLER  PIC IS X(9)     VALUE  SPACE.
025600     02 FILLER  PIC IS X(62)    VALUE "REMARKS".
025700 01  CCVS-C-2.
025800     02 FILLER  PIC X(19)  VALUE  SPACE.
025900     02 FILLER  PIC X(6)   VALUE "TESTED".
026000     02 FILLER  PIC X(19)  VALUE  SPACE.
026100     02 FILLER  PIC X(4)   VALUE "FAIL".
026200     02 FILLER  PIC X(72)  VALUE  SPACE.
026300*
026400 01  REC-SKL-SUB       PIC 9(2)     VALUE ZERO.
026500 01  REC-CT            PIC 99       VALUE ZERO.
026600 01  DELETE-COUNTER    PIC 999      VALUE ZERO.
026700 01  ERROR-COUNTER     PIC 999      VALUE ZERO.
026800 01  INSPECT-COUNTER   PIC 999      VALUE ZERO.
026900 01  PASS-COUNTER      PIC 999      VALUE ZERO.
027000 01  TOTAL-ERROR       PIC 999      VALUE ZERO.
027100 01  ERROR-HOLD        PIC 999      VALUE ZERO.
027200 01  DUMMY-HOLD        PIC X(120)   VALUE SPACE.
027300 01  RECORD-COUNT      PIC 9(5)     VALUE ZERO.
027400 01  ANSI-REFERENCE    PIC X(48)    VALUE SPACES.
027500 01  CCVS-H-1.
027600     02  FILLER          PIC X(39)    VALUE SPACES.
027700     02  FILLER          PIC X(42)    VALUE
027800     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
027900     02  FILLER          PIC X(39)    VALUE SPACES.
028000 01  CCVS-H-2A.
028100   02  FILLER            PIC X(40)  VALUE SPACE.
028200   02  FILLER            PIC X(7)   VALUE "CCVS85 ".
028300   02  FILLER            PIC XXXX   VALUE
028400     "4.2 ".
028500   02  FILLER            PIC X(28)  VALUE
028600            " COPY - NOT FOR DISTRIBUTION".
028700   02  FILLER            PIC X(41)  VALUE SPACE.
028800*
028900 01  CCVS-H-2B.
029000   02  FILLER            PIC X(15)  VALUE "TEST RESULT OF ".
029100   02  TEST-ID           PIC X(9).
029200   02  FILLER            PIC X(4)   VALUE " IN ".
029300   02  FILLER            PIC X(12)  VALUE
029400     " HIGH       ".
029500   02  FILLER            PIC X(22)  VALUE
029600            " LEVEL VALIDATION FOR ".
029700   02  FILLER            PIC X(58)  VALUE
029800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029900 01  CCVS-H-3.
030000     02  FILLER          PIC X(34)  VALUE
030100            " FOR OFFICIAL USE ONLY    ".
030200     02  FILLER          PIC X(58)  VALUE
030300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
030400     02  FILLER          PIC X(28)  VALUE
030500            "  COPYRIGHT   1985,1986 ".
030600 01  CCVS-E-1.
030700     02 FILLER           PIC X(52)  VALUE SPACE.
030800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
030900     02 ID-AGAIN         PIC X(9).
031000     02 FILLER           PIC X(45)  VALUE SPACES.
031100 01  CCVS-E-2.
031200     02  FILLER          PIC X(31)  VALUE SPACE.
031300     02  FILLER          PIC X(21)  VALUE SPACE.
031400     02  CCVS-E-2-2.
031500         03 ERROR-TOTAL    PIC XXX    VALUE SPACE.
031600         03 FILLER         PIC X      VALUE SPACE.
031700         03 ENDER-DESC     PIC X(44)  VALUE
031800            "ERRORS ENCOUNTERED".
031900 01  CCVS-E-3.
032000     02  FILLER          PIC X(22)  VALUE
032100            " FOR OFFICIAL USE ONLY".
032200     02  FILLER          PIC X(12)  VALUE SPACE.
032300     02  FILLER          PIC X(58)  VALUE
032400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
032500     02  FILLER          PIC X(8)   VALUE SPACE.
032600     02  FILLER          PIC X(20)  VALUE
032700             " COPYRIGHT 1985,1986".
032800 01  CCVS-E-4.
032900     02 CCVS-E-4-1       PIC XXX    VALUE SPACE.
033000     02 FILLER           PIC X(4)   VALUE " OF ".
033100     02 CCVS-E-4-2       PIC XXX    VALUE SPACE.
033200     02 FILLER           PIC X(40)  VALUE
033300      "  TESTS WERE EXECUTED SUCCESSFULLY".
033400 01  XXINFO.
033500     02 FILLER           PIC X(19)  VALUE "*** INFORMATION ***".
033600     02 INFO-TEXT.
033700       04 FILLER             PIC X(8)   VALUE SPACE.
033800       04 XXCOMPUTED         PIC X(20).
033900       04 FILLER             PIC X(5)   VALUE SPACE.
034000       04 XXCORRECT          PIC X(20).
034100     02 INF-ANSI-REFERENCE PIC X(48).
034200 01  HYPHEN-LINE.
034300     02 FILLER  PIC IS X VALUE IS SPACE.
034400     02 FILLER  PIC IS X(65)    VALUE IS "************************
034500-    "*****************************************".
034600     02 FILLER  PIC IS X(54)    VALUE IS "************************
034700-    "******************************".
034800 01  CCVS-PGM-ID  PIC X(9)   VALUE
034900     "SQ228A".
035000*
035100*
035200 PROCEDURE DIVISION.
035300 DECLARATIVES.
035400*
035500 SECT-SQ228A-0001 SECTION.
035600     USE AFTER EXCEPTION PROCEDURE I-O.
035700 I-O-ERROR-PROCESS.
035800     MOVE   "EXECUTED" TO DECL-EXEC-I-O.
035900     IF DECL-EXEC-SW NOT = SPACE
036000         GO TO   END-DECLS.
036100*
036200     MOVE    1 TO REC-CT.
036300     MOVE   "DCL-REWRITE-01" TO PAR-NAME.
036400     GO TO   DCL-REWRITE-01-01.
036500 DECL-DELETE-01-01.
036600     PERFORM DECL-DE-LETE.
036700     GO TO   DECL-TEST-01-01-END.
036800 DCL-REWRITE-01-01.
036900 DECL-TEST-01-01-END.
037000*
037100     ADD     1 TO REC-CT.
037200     GO TO   DCL-REWRITE-01-02.
037300 DECL-DELETE-01-02.
037400     PERFORM DECL-DE-LETE.
037500     GO TO   DECL-TEST-01-02-END.
037600 DCL-REWRITE-01-02.
037700 DECL-TEST-01-02-END.
037800*
037900     ADD     1 TO REC-CT.
038000     GO TO   DCL-REWRITE-01-03.
038100 DECL-DELETE-01-03.
038200     PERFORM DECL-DE-LETE.
038300     GO TO   DECL-TEST-01-03-END.
038400 DCL-REWRITE-01-03.
038500 DECL-TEST-01-03-END.
038600*
038700     PERFORM DECL-WRITE-LINE.
038800     MOVE   "ABNORMAL TERMINATION AT THIS POINT IS ACCEPTABLE"
038900               TO DUMMY-RECORD.
039000     PERFORM DECL-WRITE-LINE 3 TIMES.
039100     GO TO   END-DECLS.
039200*
039300*
039400 DECL-PASS.
039500     MOVE   "PASS " TO P-OR-F.
039600     ADD     1 TO PASS-COUNTER.
039700     PERFORM DECL-PRINT-DETAIL.
039800*
039900 DECL-FAIL.
040000     MOVE   "FAIL*" TO P-OR-F.
040100     ADD     1 TO ERROR-COUNTER.
040200     PERFORM DECL-PRINT-DETAIL.
040300*
040400 DECL-DE-LETE.
040500     MOVE   "****TEST DELETED****" TO RE-MARK.
040600     MOVE   "*****" TO P-OR-F.
040700     ADD     1 TO DELETE-COUNTER.
040800     PERFORM DECL-PRINT-DETAIL.
040900*
041000 DECL-PRINT-DETAIL.
041100     IF REC-CT NOT EQUAL TO ZERO
041200             MOVE "." TO PARDOT-X
041300             MOVE REC-CT TO DOTVALUE.
041400     MOVE    TEST-RESULTS TO PRINT-REC.
041500     PERFORM DECL-WRITE-LINE.
041600     IF P-OR-F EQUAL TO "FAIL*"
041700         PERFORM DECL-WRITE-LINE
041800         PERFORM DECL-FAIL-ROUTINE THRU DECL-FAIL-EX
041900     ELSE
042000         PERFORM DECL-BAIL THRU DECL-BAIL-EX.
042100     MOVE    SPACE TO P-OR-F.
042200     MOVE    SPACE TO COMPUTED-X.
042300     MOVE    SPACE TO CORRECT-X.
042400     IF REC-CT EQUAL TO ZERO
042500         MOVE    SPACE TO PAR-NAME.
042600     MOVE    SPACE TO RE-MARK.
042700*
042800 DECL-WRITE-LINE.
042900     ADD     1 TO RECORD-COUNT.
043000Y    IF RECORD-COUNT GREATER 50
043100Y        MOVE    DUMMY-RECORD TO DUMMY-HOLD
043200Y        MOVE    SPACE TO DUMMY-RECORD
043300Y        WRITE   DUMMY-RECORD AFTER ADVANCING PAGE
043400Y        MOVE    CCVS-C-1 TO DUMMY-RECORD PERFORM DECL-WRT-LN
043500Y        MOVE    CCVS-C-2 TO DUMMY-RECORD
043600Y        PERFORM DECL-WRT-LN 2 TIMES
043700Y        MOVE    HYPHEN-LINE TO DUMMY-RECORD
043800Y        PERFORM DECL-WRT-LN
043900Y        MOVE    DUMMY-HOLD TO DUMMY-RECORD
044000Y        MOVE    ZERO TO RECORD-COUNT.
044100     PERFORM DECL-WRT-LN.
044200*
044300 DECL-WRT-LN.
044400     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
044500     MOVE    SPACE TO DUMMY-RECORD.
044600*
044700 DECL-FAIL-ROUTINE.
044800     IF COMPUTED-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
044900     IF CORRECT-X NOT EQUAL TO SPACE GO TO DECL-FAIL-WRITE.
045000     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
045100     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
045200     MOVE    XXINFO TO DUMMY-RECORD.
045300     PERFORM DECL-WRITE-LINE 2 TIMES.
045400     MOVE    SPACES TO INF-ANSI-REFERENCE.
045500     GO TO   DECL-FAIL-EX.
045600 DECL-FAIL-WRITE.
045700     MOVE    TEST-COMPUTED TO PRINT-REC
045800     PERFORM DECL-WRITE-LINE
045900     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
046000     MOVE    TEST-CORRECT TO PRINT-REC
046100     PERFORM DECL-WRITE-LINE 2 TIMES.
046200     MOVE    SPACES TO COR-ANSI-REFERENCE.
046300 DECL-FAIL-EX.
046400     EXIT.
046500*
046600 DECL-BAIL.
046700     IF COMPUTED-A NOT EQUAL TO SPACE GO TO DECL-BAIL-WRITE.
046800     IF CORRECT-A EQUAL TO SPACE GO TO DECL-BAIL-EX.
046900 DECL-BAIL-WRITE.
047000     MOVE    CORRECT-A TO XXCORRECT.
047100     MOVE    COMPUTED-A TO XXCOMPUTED.
047200     MOVE    XXINFO TO DUMMY-RECORD.
047300     PERFORM DECL-WRITE-LINE 2 TIMES.
047400 DECL-BAIL-EX.
047500     EXIT.
047600*
047700 END-DECLS.
047800 END DECLARATIVES.
047900*
048000*
048100 CCVS1 SECTION.
048200 OPEN-FILES.
048300P    OPEN    I-O RAW-DATA.
048400P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
048500P    READ    RAW-DATA INVALID KEY GO TO END-E-1.
048600P    MOVE   "ABORTED "   TO C-ABORT.
048700P    ADD     1           TO C-NO-OF-TESTS.
048800P    ACCEPT  C-DATE      FROM DATE.
048900P    ACCEPT  C-TIME      FROM TIME.
049000P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
049100PEND-E-1.
049200P    CLOSE   RAW-DATA.
049300     OPEN    OUTPUT PRINT-FILE.
049400     MOVE    CCVS-PGM-ID TO TEST-ID.
049500     MOVE    CCVS-PGM-ID TO ID-AGAIN.
049600     MOVE    SPACE TO TEST-RESULTS.
049700     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
049800     MOVE    ZERO TO REC-SKEL-SUB.
049900     PERFORM CCVS-INIT-FILE 10 TIMES.
050000     GO TO CCVS1-EXIT.
050100*
050200 CCVS-INIT-FILE.
050300     ADD     1 TO REC-SKL-SUB.
050400     MOVE    FILE-RECORD-INFO-SKELETON TO
050500                  FILE-RECORD-INFO (REC-SKL-SUB).
050600*
050700 CLOSE-FILES.
050800     PERFORM END-ROUTINE THRU END-ROUTINE-13.
050900     CLOSE   PRINT-FILE.
051000P    OPEN    I-O RAW-DATA.
051100P    MOVE    CCVS-PGM-ID TO RAW-DATA-KEY.
051200P    READ    RAW-DATA INVALID KEY GO TO END-E-2.
051300P    MOVE   "OK.     " TO C-ABORT.
051400P    MOVE    PASS-COUNTER  TO C-OK.
051500P    MOVE    ERROR-HOLD    TO C-ALL.
051600P    MOVE    ERROR-COUNTER TO C-FAIL.
051700P    MOVE    DELETE-CNT    TO C-DELETED.
051800P    MOVE    INSPECT-COUNTER TO C-INSPECT.
051900P    REWRITE RAW-DATA-SATZ INVALID KEY CONTINUE.
052000PEND-E-2.
052100P    CLOSE   RAW-DATA.
052200 TERMINATE-CCVS.
052300S    EXIT    PROGRAM.
052400     STOP    RUN.
052500*
052600 INSPT.
052700     MOVE   "INSPT" TO P-OR-F.
052800     ADD     1 TO INSPECT-COUNTER.
052900     PERFORM PRINT-DETAIL.
053000*
053100 PASS.
053200     MOVE   "PASS " TO P-OR-F.
053300     ADD     1 TO PASS-COUNTER.
053400     PERFORM PRINT-DETAIL.
053500*
053600 FAIL.
053700     MOVE   "FAIL*" TO P-OR-F.
053800     ADD     1 TO ERROR-COUNTER.
053900     PERFORM PRINT-DETAIL.
054000*
054100 DE-LETE.
054200     MOVE   "****TEST DELETED****" TO RE-MARK.
054300     MOVE   "*****" TO P-OR-F.
054400     ADD     1 TO DELETE-COUNTER.
054500     PERFORM PRINT-DETAIL.
054600*
054700 PRINT-DETAIL.
054800     IF REC-CT NOT EQUAL TO ZERO
054900         MOVE   "." TO PARDOT-X
055000         MOVE    REC-CT TO DOTVALUE.
055100     MOVE    TEST-RESULTS TO PRINT-REC.
055200     PERFORM WRITE-LINE.
055300     IF P-OR-F EQUAL TO "FAIL*"
055400         PERFORM WRITE-LINE
055500         PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
055600     ELSE
055700         PERFORM BAIL-OUT THRU BAIL-OUT-EX.
055800     MOVE    SPACE TO P-OR-F.
055900     MOVE    SPACE TO COMPUTED-X.
056000     MOVE    SPACE TO CORRECT-X.
056100     IF REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
056200     MOVE    SPACE TO RE-MARK.
056300*
056400 HEAD-ROUTINE.
056500     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
056600     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
056700     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
056800     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
056900 COLUMN-NAMES-ROUTINE.
057000     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
057100     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
057200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
057300 END-ROUTINE.
057400     MOVE    HYPHEN-LINE TO DUMMY-RECORD.
057500     PERFORM WRITE-LINE 5 TIMES.
057600 END-RTN-EXIT.
057700     MOVE    CCVS-E-1 TO DUMMY-RECORD.
057800     PERFORM WRITE-LINE 2 TIMES.
057900*
058000 END-ROUTINE-1.
058100     ADD     ERROR-COUNTER   TO ERROR-HOLD
058200     ADD     INSPECT-COUNTER TO ERROR-HOLD.
058300     ADD     DELETE-COUNTER  TO ERROR-HOLD.
058400     ADD     PASS-COUNTER    TO ERROR-HOLD.
058500     MOVE    PASS-COUNTER    TO CCVS-E-4-1.
058600     MOVE    ERROR-HOLD      TO CCVS-E-4-2.
058700     MOVE    CCVS-E-4        TO CCVS-E-2-2.
058800     MOVE    CCVS-E-2        TO DUMMY-RECORD
058900     PERFORM WRITE-LINE.
059000     MOVE   "TEST(S) FAILED" TO ENDER-DESC.
059100     IF ERROR-COUNTER IS EQUAL TO ZERO
059200         MOVE   "NO " TO ERROR-TOTAL
059300     ELSE
059400         MOVE    ERROR-COUNTER TO ERROR-TOTAL.
059500     MOVE    CCVS-E-2 TO DUMMY-RECORD.
059600     PERFORM WRITE-LINE.
059700 END-ROUTINE-13.
059800     IF DELETE-COUNTER IS EQUAL TO ZERO
059900         MOVE   "NO " TO ERROR-TOTAL
060000     ELSE
060100         MOVE    DELETE-COUNTER TO ERROR-TOTAL.
060200     MOVE   "TEST(S) DELETED     " TO ENDER-DESC.
060300     MOVE    CCVS-E-2 TO DUMMY-RECORD.
060400     PERFORM WRITE-LINE.
060500     IF INSPECT-COUNTER EQUAL TO ZERO
060600         MOVE   "NO " TO ERROR-TOTAL
060700     ELSE
060800         MOVE    INSPECT-COUNTER TO ERROR-TOTAL.
060900     MOVE   "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
061000     MOVE    CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
061100     MOVE    CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
061200*
061300 WRITE-LINE.
061400     ADD     1 TO RECORD-COUNT.
061500Y    IF RECORD-COUNT GREATER 50
061600Y        MOVE  DUMMY-RECORD TO DUMMY-HOLD
061700Y        MOVE  SPACE TO DUMMY-RECORD
061800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
061900Y        MOVE  CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN
062000Y        MOVE  CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
062100Y        MOVE  HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
062200Y        MOVE  DUMMY-HOLD TO DUMMY-RECORD
062300Y        MOVE  ZERO TO RECORD-COUNT.
062400     PERFORM WRT-LN.
062500*
062600 WRT-LN.
062700     WRITE   DUMMY-RECORD AFTER ADVANCING 1 LINES.
062800     MOVE    SPACE TO DUMMY-RECORD.
062900 BLANK-LINE-PRINT.
063000     PERFORM WRT-LN.
063100 FAIL-ROUTINE.
063200     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
063300     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
063400     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
063500     MOVE   "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
063600     MOVE    XXINFO TO DUMMY-RECORD.
063700     PERFORM WRITE-LINE 2 TIMES.
063800     MOVE    SPACES TO INF-ANSI-REFERENCE.
063900     GO TO   FAIL-ROUTINE-EX.
064000 FAIL-ROUTINE-WRITE.
064100     MOVE    TEST-COMPUTED  TO PRINT-REC
064200     PERFORM WRITE-LINE
064300     MOVE    ANSI-REFERENCE TO COR-ANSI-REFERENCE.
064400     MOVE    TEST-CORRECT   TO PRINT-REC
064500     PERFORM WRITE-LINE 2 TIMES.
064600     MOVE    SPACES         TO COR-ANSI-REFERENCE.
064700 FAIL-ROUTINE-EX.
064800     EXIT.
064900 BAIL-OUT.
065000     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
065100     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
065200 BAIL-OUT-WRITE.
065300     MOVE    CORRECT-A      TO XXCORRECT.
065400     MOVE    COMPUTED-A     TO XXCOMPUTED.
065500     MOVE    ANSI-REFERENCE TO INF-ANSI-REFERENCE.
065600     MOVE    XXINFO TO DUMMY-RECORD.
065700     PERFORM WRITE-LINE 2 TIMES.
065800     MOVE    SPACES TO INF-ANSI-REFERENCE.
065900 BAIL-OUT-EX.
066000     EXIT.
066100 CCVS1-EXIT.
066200     EXIT.
066300*
066400****************************************************************
066500*                                                              *
066600*    THIS POINT MARKS THE END OF THE CCVS MONITOR ROUTINES AND *
066700*    THE START OF THE TESTS OF SPECIFIC COBOL FEATURES.        *
066800*                                                              *
066900****************************************************************
067000*
067100 SECT-SQ228A-0002 SECTION.
067200 STA-INIT.
067300     MOVE    SPACE TO DELETE-SW.
067400*
067500     MOVE   "SQ-FS4" TO XFILE-NAME (1).
067600     MOVE   "R1-F-G" TO XRECORD-NAME (1).
067700     MOVE    CCVS-PGM-ID TO XPROGRAM-NAME (1).
067800     MOVE    120 TO XRECORD-LENGTH (1).
067900     MOVE   "CC" TO CHARS-OR-RECORDS (1).
068000     MOVE    1   TO XBLOCK-SIZE (1).
068100     MOVE    1   TO RECORDS-IN-FILE (1).
068200     MOVE   "SQ" TO XFILE-ORGANIZATION (1).
068300     MOVE   "S"  TO XLABEL-TYPE (1).
068400*
068500*    OPEN THE FILE IN THE OUTPUT MODE
068600*
068700 SEQ-INIT-01.
068800     MOVE    0 TO REC-CT.
068900     MOVE   "*" TO DECL-EXEC-SW.
069000     MOVE   "**" TO SQ-FS4-STATUS.
069100     MOVE   "NOT EXECUTED" TO DECL-EXEC-I-O.
069200     MOVE    ZERO TO XRECORD-NUMBER (1).
069300     MOVE   "OPEN, CREATE FILE"  TO FEATURE.
069400     MOVE   "SEQ-TEST-OP-01" TO PAR-NAME.
069500     GO TO   SEQ-TEST-OP-01.
069600 SEQ-TEST-OP-01.
069700     OPEN    OUTPUT SQ-FS4.
069800 SEQ-INIT-02.
069900     MOVE    0 TO REC-CT.
070000     MOVE   "*" TO DECL-EXEC-SW.
070100     ADD     1 TO XRECORD-NUMBER (1).
070200     MOVE   "**" TO SQ-FS4-STATUS.
070300     MOVE   "NOT EXECUTED" TO DECL-EXEC-I-O.
070400     MOVE    FILE-RECORD-INFO-P1-120 (1) TO SQ-FS4R1-F-G-120.
070500     MOVE   "987654321123456789" TO EXT-18.
070600     MOVE    120 TO SQ-FS4-RECSIZE.
070700     MOVE   "WRITE A RECORD"  TO FEATURE.
070800     MOVE   "SEQ-TEST-WR-02" TO PAR-NAME.
070900 SEQ-TEST-WR-02.
071000     WRITE   SQ-FS4R2-F-G-138.
071100 SEQ-INIT-03.
071200     MOVE    0 TO REC-CT.
071300     MOVE   "*" TO DECL-EXEC-SW.
071400     MOVE   "**" TO SQ-FS4-STATUS.
071500     MOVE   "NOT EXECUTED" TO DECL-EXEC-I-O.
071600     MOVE   "CLOSE FILE" TO FEATURE.
071700     MOVE   "SEQ-TEST-CL-03" TO PAR-NAME.
071800 SEQ-TEST-CL-03.
071900     CLOSE   SQ-FS4.
072000 SEQ-INIT-04.
072100     MOVE    0 TO REC-CT.
072200     MOVE   "*" TO DECL-EXEC-SW.
072300     MOVE   "**" TO SQ-FS4-STATUS.
072400     MOVE   "NOT EXECUTED" TO DECL-EXEC-I-O.
072500     MOVE    ZERO TO XRECORD-NUMBER (1).
072600     MOVE   "OPEN FILE FOR I-O" TO FEATURE.
072700     MOVE   "SEQ-TEST-OP-04" TO PAR-NAME.
072800 SEQ-TEST-OP-04.
072900     OPEN    I-O SQ-FS4.
073000 SEQ-INIT-05.
073100     MOVE    0 TO REC-CT.
073200     MOVE   "*" TO DECL-EXEC-SW.
073300     ADD     1 TO XRECORD-NUMBER (1).
073400     MOVE   "**" TO SQ-FS4-STATUS.
073500     MOVE   "NOT EXECUTED" TO DECL-EXEC-I-O.
073600     MOVE    ZERO TO SQ-FS4-RECSIZE.
073700     MOVE    SPACE TO SQ-FS4R2-F-G-138.
073800     MOVE   "READ FIRST RECORD" TO FEATURE.
073900     MOVE   "SEQ-TEST-RD-05" TO PAR-NAME.
074000 SEQ-TEST-RD-05.
074100     READ    SQ-FS4.
074200 SEQ-INIT-06.
074300     MOVE    0 TO REC-CT.
074400     MOVE    SPACE TO DECL-EXEC-SW.
074500     MOVE   "**" TO SQ-FS4-STATUS.
074600     MOVE   "NOT EXECUTED" TO DECL-EXEC-I-O.
074700     MOVE    FILE-RECORD-INFO-P1-120 (1) TO SQ-FS4R1-F-G-120.
074800     MOVE   "ABCDEFGHIJKLMNOPQR" TO EXT-18.
074900     MOVE    130 TO SQ-FS4-RECSIZE.
075000     MOVE   "REWRITE DIFFERENT SIZE REC" TO FEATURE.
075100     MOVE   "SEQ-TEST-RW-06" TO PAR-NAME.
075200 SEQ-TEST-RW-06.
075300     REWRITE SQ-FS4R1-F-G-120.
075400     MOVE    0 TO REC-CT.
075500*
075600*    CHECK I-O STATUS RETURNED FROM REWRITE
075700*
075800     ADD    1 TO REC-CT.
075900 SEQ-TEST-06-01-END.
076000*
076100*    CHECK EXECUTION OF I-O DECLARATIVE
076200*
076300     ADD     1 TO REC-CT.
076400     IF DELETE-SW NOT = SPACE
076500         GO TO   SEQ-DELETE-06-02.
076600     GO TO   SEQ-TEST-RW-06-02.
076700 SEQ-DELETE-06-02.
076800     PERFORM DE-LETE.
076900     GO TO   SEQ-TEST-06-02-END.
077000 SEQ-TEST-RW-06-02.
077100     IF DECL-EXEC-I-O = "EXECUTED"
077200         PERFORM PASS
077300     ELSE
077400         MOVE    DECL-EXEC-I-O TO COMPUTED-A
077500         MOVE   "EXECUTED" TO CORRECT-A
077600         MOVE   "DECLARATIVE NOT EXECUTED ON REWRITE"
077700                   TO RE-MARK
077800         MOVE   "VII-2,1.3.5, VII-51,4.6.4(5)" TO ANSI-REFERENCE
077900         PERFORM FAIL.
078000 SEQ-TEST-06-02-END.
078100 CCVS-EXIT SECTION.
078200 CCVS-999999.
078300     GO TO CLOSE-FILES.
