000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST106A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*        ) IS RIGHT PARENTHESIS
002200*        ( IS LEFT PARENTHESIS
002300*        " IS QUOTE
002400*        + IS PLUS
002500*
002600*    THIS PROGRAM BUILDS A FILE OF NINE RECORDS. EACH RECORD HAS
002700*    THREE KEYS, AND THE VALUES OF THE RECORDS ARE SHOWN BELOW-
002800*             S
002900*             O
003000*             R               SORT
003100*             T  SORT         KEY
003200*             K  KEY           -2
003300*             E   -1           ..
003400*             Y   ..         .    .
003500*             -  .  .      .        .
003600*             3 .    .   .            .
003700*             ..      ..                .
003800*              11111112888888888888888888
003900*              11111112999999999999999999
004000*              11111112999999999999999999
004100*              00000001999999999999999999
004200*             000000001999999999999999999
004300*             000000001999999999999999999
004400*             000000001999999999999999999
004500*             000000001999999999999999999
004600*             000000001999999999999999999
004700*    THERE IS AN ASSUMED DECIMAL POINT BETWEEN THE FIRST AND
004800*    SECOND COLUMNS OF SORTKEY-1.
004900*    THIS FILE IS BUILT AND SORTED BY THIS PROGRAM AND THE OUTPUT
005000*    IS PASSED ON TO ST107 FOR CHECKING.
005100
005200 ENVIRONMENT DIVISION.
005300 CONFIGURATION SECTION.
005400 SOURCE-COMPUTER.
005500     XXXXX082.
005600 OBJECT-COMPUTER.
005700     XXXXX083.
005800 INPUT-OUTPUT SECTION.
005900 FILE-CONTROL.
006000     SELECT PRINT-FILE ASSIGN TO
006100     XXXXX055.
006200     SELECT SORTFILE-1F ASSIGN TO
006300     XXXXX027.
006400     SELECT SORTOUT-1F ASSIGN TO
006500     XXXXP001.
006600 DATA DIVISION.
006700 FILE SECTION.
006800 FD  PRINT-FILE.
006900 01  PRINT-REC PICTURE X(120).
007000 01  DUMMY-RECORD PICTURE X(120).
007100 FD  SORTOUT-1F
007200     LABEL RECORDS STANDARD
007300C    VALUE OF
007400C    XXXXX074
007500C    IS
007600C    XXXXX075
007700G    XXXXX069
007800     RECORD CONTAINS 27 CHARACTERS
007900     DATA RECORD IS SORTOUT-REC.
008000 01  SORTOUT-REC.
008100     02 FILLER          PICTURE X(27).
008200 SD  SORTFILE-1F
008300     RECORD  CONTAINS 27 CHARACTERS
008400     DATA RECORD IS SORT-GROUP.
008500 01  SORT-GROUP.
008600     02 SORTKEY-3       PICTURE X.
008700     02 SORTKEY-1       PICTURE S9V9(7).
008800     02 SORTKEY-2       PICTURE 9(18).
008900 WORKING-STORAGE SECTION.
009000 77  UTIL-CTR           PICTURE S99999 VALUE ZERO.
009100 77  UTILITY-1          PICTURE S9V9(7) VALUE +1.1111112.
009200 77  UTILITY-2          PICTURE 9(018) VALUE 888888888888888888.
009300 77  UTILITY-3          PICTURE X VALUE SPACE.
009400 01  TEST-RESULTS.
009500     02 FILLER                   PIC X      VALUE SPACE.
009600     02 FEATURE                  PIC X(20)  VALUE SPACE.
009700     02 FILLER                   PIC X      VALUE SPACE.
009800     02 P-OR-F                   PIC X(5)   VALUE SPACE.
009900     02 FILLER                   PIC X      VALUE SPACE.
010000     02  PAR-NAME.
010100       03 FILLER                 PIC X(19)  VALUE SPACE.
010200       03  PARDOT-X              PIC X      VALUE SPACE.
010300       03 DOTVALUE               PIC 99     VALUE ZERO.
010400     02 FILLER                   PIC X(8)   VALUE SPACE.
010500     02 RE-MARK                  PIC X(61).
010600 01  TEST-COMPUTED.
010700     02 FILLER                   PIC X(30)  VALUE SPACE.
010800     02 FILLER                   PIC X(17)  VALUE
010900            "       COMPUTED=".
011000     02 COMPUTED-X.
011100     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
011200     03 COMPUTED-N               REDEFINES COMPUTED-A
011300                                 PIC -9(9).9(9).
011400     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
011500     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
011600     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
011700     03       CM-18V0 REDEFINES COMPUTED-A.
011800         04 COMPUTED-18V0                    PIC -9(18).
011900         04 FILLER                           PIC X.
012000     03 FILLER PIC X(50) VALUE SPACE.
012100 01  TEST-CORRECT.
012200     02 FILLER PIC X(30) VALUE SPACE.
012300     02 FILLER PIC X(17) VALUE "       CORRECT =".
012400     02 CORRECT-X.
012500     03 CORRECT-A                  PIC X(20) VALUE SPACE.
012600     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
012700     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
012800     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
012900     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
013000     03      CR-18V0 REDEFINES CORRECT-A.
013100         04 CORRECT-18V0                     PIC -9(18).
013200         04 FILLER                           PIC X.
013300     03 FILLER PIC X(2) VALUE SPACE.
013400     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
013500 01  CCVS-C-1.
013600     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
013700-    "SS  PARAGRAPH-NAME
013800-    "       REMARKS".
013900     02 FILLER                     PIC X(20)    VALUE SPACE.
014000 01  CCVS-C-2.
014100     02 FILLER                     PIC X        VALUE SPACE.
014200     02 FILLER                     PIC X(6)     VALUE "TESTED".
014300     02 FILLER                     PIC X(15)    VALUE SPACE.
014400     02 FILLER                     PIC X(4)     VALUE "FAIL".
014500     02 FILLER                     PIC X(94)    VALUE SPACE.
014600 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
014700 01  REC-CT                        PIC 99       VALUE ZERO.
014800 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
014900 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
015000 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
015100 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
015200 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
015300 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
015400 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
015500 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
015600 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
015700 01  CCVS-H-1.
015800     02  FILLER                    PIC X(39)    VALUE SPACES.
015900     02  FILLER                    PIC X(42)    VALUE
016000     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
016100     02  FILLER                    PIC X(39)    VALUE SPACES.
016200 01  CCVS-H-2A.
016300   02  FILLER                        PIC X(40)  VALUE SPACE.
016400   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
016500   02  FILLER                        PIC XXXX   VALUE
016600     "4.2 ".
016700   02  FILLER                        PIC X(28)  VALUE
016800            " COPY - NOT FOR DISTRIBUTION".
016900   02  FILLER                        PIC X(41)  VALUE SPACE.
017000
017100 01  CCVS-H-2B.
017200   02  FILLER                        PIC X(15)  VALUE
017300            "TEST RESULT OF ".
017400   02  TEST-ID                       PIC X(9).
017500   02  FILLER                        PIC X(4)   VALUE
017600            " IN ".
017700   02  FILLER                        PIC X(12)  VALUE
017800     " HIGH       ".
017900   02  FILLER                        PIC X(22)  VALUE
018000            " LEVEL VALIDATION FOR ".
018100   02  FILLER                        PIC X(58)  VALUE
018200     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018300 01  CCVS-H-3.
018400     02  FILLER                      PIC X(34)  VALUE
018500            " FOR OFFICIAL USE ONLY    ".
018600     02  FILLER                      PIC X(58)  VALUE
018700     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
018800     02  FILLER                      PIC X(28)  VALUE
018900            "  COPYRIGHT   1985 ".
019000 01  CCVS-E-1.
019100     02 FILLER                       PIC X(52)  VALUE SPACE.
019200     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
019300     02 ID-AGAIN                     PIC X(9).
019400     02 FILLER                       PIC X(45)  VALUE SPACES.
019500 01  CCVS-E-2.
019600     02  FILLER                      PIC X(31)  VALUE SPACE.
019700     02  FILLER                      PIC X(21)  VALUE SPACE.
019800     02 CCVS-E-2-2.
019900         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
020000         03 FILLER                   PIC X      VALUE SPACE.
020100         03 ENDER-DESC               PIC X(44)  VALUE
020200            "ERRORS ENCOUNTERED".
020300 01  CCVS-E-3.
020400     02  FILLER                      PIC X(22)  VALUE
020500            " FOR OFFICIAL USE ONLY".
020600     02  FILLER                      PIC X(12)  VALUE SPACE.
020700     02  FILLER                      PIC X(58)  VALUE
020800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
020900     02  FILLER                      PIC X(13)  VALUE SPACE.
021000     02 FILLER                       PIC X(15)  VALUE
021100             " COPYRIGHT 1985".
021200 01  CCVS-E-4.
021300     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
021400     02 FILLER                       PIC X(4)   VALUE " OF ".
021500     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
021600     02 FILLER                       PIC X(40)  VALUE
021700      "  TESTS WERE EXECUTED SUCCESSFULLY".
021800 01  XXINFO.
021900     02 FILLER                       PIC X(19)  VALUE
022000            "*** INFORMATION ***".
022100     02 INFO-TEXT.
022200       04 FILLER                     PIC X(8)   VALUE SPACE.
022300       04 XXCOMPUTED                 PIC X(20).
022400       04 FILLER                     PIC X(5)   VALUE SPACE.
022500       04 XXCORRECT                  PIC X(20).
022600     02 INF-ANSI-REFERENCE           PIC X(48).
022700 01  HYPHEN-LINE.
022800     02 FILLER  PIC IS X VALUE IS SPACE.
022900     02 FILLER  PIC IS X(65)    VALUE IS "************************
023000-    "*****************************************".
023100     02 FILLER  PIC IS X(54)    VALUE IS "************************
023200-    "******************************".
023300 01  CCVS-PGM-ID                     PIC X(9)   VALUE
023400     "ST106A".
023500 PROCEDURE DIVISION.
023600 SORTPARA SECTION.
023700 SORT-PARAGRAPH.
023800     SORT     SORTFILE-1F ON
023900              ASCENDING SORTKEY-1
024000              DESCENDING SORTKEY-2
024100              ASCENDING SORTKEY-3
024200              INPUT PROCEDURE INPROC THRU INPROC-EXIT
024300              GIVING SORTOUT-1F.
024400     STOP     RUN.
024500 INPROC SECTION.
024600 OPEN-FILES.
024700     OPEN     OUTPUT PRINT-FILE.
024800     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
024900     MOVE    SPACE TO TEST-RESULTS.
025000     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
025100     GO TO CCVS1-EXIT.
025200 CLOSE-FILES.
025300     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
025400 TERMINATE-CCVS.
025500S    EXIT PROGRAM.
025600STERMINATE-CALL.
025700     STOP     RUN.
025800 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
025900 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
026000 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
026100 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
026200     MOVE "****TEST DELETED****" TO RE-MARK.
026300 PRINT-DETAIL.
026400     IF REC-CT NOT EQUAL TO ZERO
026500             MOVE "." TO PARDOT-X
026600             MOVE REC-CT TO DOTVALUE.
026700     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
026800     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
026900        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
027000          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
027100     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
027200     MOVE SPACE TO CORRECT-X.
027300     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
027400     MOVE     SPACE TO RE-MARK.
027500 HEAD-ROUTINE.
027600     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027700     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027800     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
027900     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
028000 COLUMN-NAMES-ROUTINE.
028100     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028200     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
028400 END-ROUTINE.
028500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
028600 END-RTN-EXIT.
028700     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028800 END-ROUTINE-1.
028900      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
029000      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
029100      ADD PASS-COUNTER TO ERROR-HOLD.
029200*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
029300      MOVE PASS-COUNTER TO CCVS-E-4-1.
029400      MOVE ERROR-HOLD TO CCVS-E-4-2.
029500      MOVE CCVS-E-4 TO CCVS-E-2-2.
029600      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
029700  END-ROUTINE-12.
029800      MOVE "TEST(S) FAILED" TO ENDER-DESC.
029900     IF       ERROR-COUNTER IS EQUAL TO ZERO
030000         MOVE "NO " TO ERROR-TOTAL
030100         ELSE
030200         MOVE ERROR-COUNTER TO ERROR-TOTAL.
030300     MOVE     CCVS-E-2 TO DUMMY-RECORD.
030400     PERFORM WRITE-LINE.
030500 END-ROUTINE-13.
030600     IF DELETE-COUNTER IS EQUAL TO ZERO
030700         MOVE "NO " TO ERROR-TOTAL  ELSE
030800         MOVE DELETE-COUNTER TO ERROR-TOTAL.
030900     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
031000     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031100      IF   INSPECT-COUNTER EQUAL TO ZERO
031200          MOVE "NO " TO ERROR-TOTAL
031300      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
031400      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
031500      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031600     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031700 WRITE-LINE.
031800     ADD 1 TO RECORD-COUNT.
031900Y    IF RECORD-COUNT GREATER 42
032000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
032100Y        MOVE SPACE TO DUMMY-RECORD
032200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
032300Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
032400Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
032500Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
032600Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
032700Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
032800Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
032900Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
033000Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
033100Y        MOVE ZERO TO RECORD-COUNT.
033200     PERFORM WRT-LN.
033300 WRT-LN.
033400     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
033500     MOVE SPACE TO DUMMY-RECORD.
033600 BLANK-LINE-PRINT.
033700     PERFORM WRT-LN.
033800 FAIL-ROUTINE.
033900     IF     COMPUTED-X NOT EQUAL TO SPACE
034000            GO TO   FAIL-ROUTINE-WRITE.
034100     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
034200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
034300     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
034400     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034500     MOVE   SPACES TO INF-ANSI-REFERENCE.
034600     GO TO  FAIL-ROUTINE-EX.
034700 FAIL-ROUTINE-WRITE.
034800     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
034900     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
035000     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
035100     MOVE   SPACES TO COR-ANSI-REFERENCE.
035200 FAIL-ROUTINE-EX. EXIT.
035300 BAIL-OUT.
035400     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
035500     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
035600 BAIL-OUT-WRITE.
035700     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
035800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
035900     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036000     MOVE   SPACES TO INF-ANSI-REFERENCE.
036100 BAIL-OUT-EX. EXIT.
036200 CCVS1-EXIT.
036300     EXIT.
036400 ST106-0001-01.
036500     OPEN     OUTPUT   SORTOUT-1F.
036600     MOVE     "THIS PROGRAM BUILDS AND" TO RE-MARK.
036700     PERFORM  PRINT-DETAIL.
036800     MOVE     "SORTS A FILE AND PASSES" TO RE-MARK.
036900     PERFORM  PRINT-DETAIL.
037000     MOVE      "THE OUTPUT TO ST107." TO RE-MARK.
037100     PERFORM  PRINT-DETAIL.
037200 BUILD-FILE.
037300     ADD      1 TO UTIL-CTR
037400     IF       UTIL-CTR EQUAL TO 2
037500              MOVE 999999999999999999 TO UTILITY-2.
037600     IF       UTIL-CTR EQUAL TO 4
037700              ADD -1.1111111 TO UTILITY-1.
037800     IF       UTIL-CTR EQUAL TO 5
037900              MOVE ZERO TO UTILITY-3.
038000     MOVE     UTILITY-1 TO SORTKEY-1.
038100     MOVE     UTILITY-3 TO SORTKEY-3.
038200     MOVE     UTILITY-2 TO SORTKEY-2.
038300     RELEASE  SORT-GROUP.
038400     IF       UTIL-CTR LESS THAN 9 GO TO BUILD-FILE.
038500 BUILD-FILE-TEST.
038600     IF       UTIL-CTR EQUAL TO 9
038700              PERFORM PASS GO TO BUILD-FILE-WRITE.
038800 BUILD-FILE-FAIL.
038900     MOVE     UTIL-CTR TO COMPUTED-N.
039000     MOVE     9 TO CORRECT-N.
039100     PERFORM  FAIL.
039200 BUILD-FILE-WRITE.
039300     MOVE     "CREATE A FILE" TO FEATURE.
039400     MOVE     "BUILD-FILE-TEST" TO PAR-NAME.
039500     PERFORM  PRINT-DETAIL.
039600     CLOSE    SORTOUT-1F.
039700     GO       TO INPROC-EXIT.
039800 INPROC-EXIT SECTION.
039900 EXITPARA.
040000     PERFORM CLOSE-FILES.
