000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST110A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.
002400     XXXXX082.
002500 OBJECT-COMPUTER.
002600     XXXXX083.
002700 INPUT-OUTPUT SECTION.
002800 FILE-CONTROL.
002900     SELECT PRINT-FILE ASSIGN TO
003000     XXXXX055.
003100     SELECT   SORTIN-1J ASSIGN TO
003200     XXXXD001.
003300     SELECT   SORTOUT-1J ASSIGN TO
003400     XXXXP002.
003500     SELECT   SORTFILE-1J ASSIGN TO
003600     XXXXX027.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  PRINT-FILE.
004000 01  PRINT-REC PICTURE X(120).
004100 01  DUMMY-RECORD PICTURE X(120).
004200 FD  SORTIN-1J
004300     LABEL RECORDS STANDARD
004400C    VALUE OF
004500C    XXXXX074
004600C    IS
004700C    XXXXX075
004800G    XXXXX069
004900     RECORD CONTAINS 50 TO 100 CHARACTERS
005000     DATA RECORDS ARE SHORT-IN
005100                      MEDIUM-IN
005200                      LONG-IN.
005300 01  SHORT-IN           PICTURE X(50).
005400 01  MEDIUM-IN          PICTURE X(75).
005500 01  LONG-IN.
005600     02 FALSE-LENGTH-1  PICTURE X(25).
005700     02 FALSE-LENGTH-2  PICTURE A(20).
005800     02 FALSE-LENGTH-3  PICTURE 9(15).
005900     02 FALSE-LENGTH-4  PICTURE X(40).
006000 FD  SORTOUT-1J
006100     LABEL RECORDS ARE STANDARD
006200C    VALUE OF
006300C    XXXXX074
006400C    IS
006500C    XXXXX076
006600G    XXXXX069
006700     RECORD CONTAINS 50 TO 100 CHARACTERS
006800     DATA RECORD SHORT-OUT
006900                 MEDIUM-OUT
007000                 LONG-OUT.
007100 01  SHORT-OUT.
007200     02 FAKE-LENGTH-1   PICTURE X(10).
007300     02 FAKE-LENGTH-2   PICTURE A(10).
007400     02 FAKE-LENGTH-3   PICTURE 9(10).
007500     02 FAKE-LENGTH-4   PICTURE X(20).
007600 01  MEDIUM-OUT         PICTURE X(75).
007700 01  LONG-OUT           PICTURE X(100).
007800 SD  SORTFILE-1J
007900     RECORD 50 TO 100
008000     DATA RECORD SHORT-SORT
008100                 MEDIUM-SORT
008200                 LONG-SORT.
008300 01  SHORT-SORT.
008400     02 SHORT-NON-KEY   PICTURE XX.
008500     02 SHORT-KEY-1     PICTURE X(10).
008600     02 SHORT-KEY-2     PICTURE X(38).
008700 01  MEDIUM-SORT.
008800     02 MEDIUM-NON-KEY  PICTURE XX.
008900     02 MEDIUM-KEY-1    PICTURE X(10).
009000     02 MEDIUM-KEY-2    PICTURE X(38).
009100     02 MEDIUM-FILLER   PICTURE X(25).
009200 01  LONG-SORT.
009300     02 LONG-NON-KEY    PICTURE XX.
009400     02 LONG-KEY-1      PICTURE X(10).
009500     02 LONG-KEY-2      PICTURE X(38).
009600     02 LONG-FILLER     PICTURE X(50).
009700 PROCEDURE    DIVISION.
009800 SORT-PARAGRAPH.
009900     SORT     SORTFILE-1J
010000              DESCENDING KEY
010100              MEDIUM-KEY-1
010200              MEDIUM-KEY-2
010300              USING SORTIN-1J
010400              GIVING SORTOUT-1J.
010500     STOP     RUN.
