000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST121A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.
002400     XXXXX082.
002500 OBJECT-COMPUTER.
002600     XXXXX083.
002700 INPUT-OUTPUT SECTION.
002800 FILE-CONTROL.
002900     SELECT PRINT-FILE ASSIGN TO
003000     XXXXX055.
003100     SELECT SORTIN-1C ASSIGN TO
003200     XXXXD002.
003300 DATA DIVISION.
003400 FILE SECTION.
003500 FD  PRINT-FILE.
003600 01  PRINT-REC PICTURE X(120).
003700 01  DUMMY-RECORD PICTURE X(120).
003800 FD  SORTIN-1C
003900     BLOCK CONTAINS 10 RECORDS
004000     LABEL RECORD STANDARD
004100C    VALUE OF
004200C    XXXXX074
004300C    IS
004400C    XXXXX076
004500G    XXXXX069
004600     DATA  RECORD IS SORTIN-REC.
004700 01  SORTIN-REC.
004800     02  KEYS-GROUP PICTURE 9(15).
004900     02  FILLER PICTURE X(105).
005000 WORKING-STORAGE SECTION.
005100 01  TEST-RESULTS.
005200     02 FILLER                   PIC X      VALUE SPACE.
005300     02 FEATURE                  PIC X(20)  VALUE SPACE.
005400     02 FILLER                   PIC X      VALUE SPACE.
005500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
005600     02 FILLER                   PIC X      VALUE SPACE.
005700     02  PAR-NAME.
005800       03 FILLER                 PIC X(19)  VALUE SPACE.
005900       03  PARDOT-X              PIC X      VALUE SPACE.
006000       03 DOTVALUE               PIC 99     VALUE ZERO.
006100     02 FILLER                   PIC X(8)   VALUE SPACE.
006200     02 RE-MARK                  PIC X(61).
006300 01  TEST-COMPUTED.
006400     02 FILLER                   PIC X(30)  VALUE SPACE.
006500     02 FILLER                   PIC X(17)  VALUE
006600            "       COMPUTED=".
006700     02 COMPUTED-X.
006800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
006900     03 COMPUTED-N               REDEFINES COMPUTED-A
007000                                 PIC -9(9).9(9).
007100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
007200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
007300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
007400     03       CM-18V0 REDEFINES COMPUTED-A.
007500         04 COMPUTED-18V0                    PIC -9(18).
007600         04 FILLER                           PIC X.
007700     03 FILLER PIC X(50) VALUE SPACE.
007800 01  TEST-CORRECT.
007900     02 FILLER PIC X(30) VALUE SPACE.
008000     02 FILLER PIC X(17) VALUE "       CORRECT =".
008100     02 CORRECT-X.
008200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
008300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
008400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
008500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
008600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
008700     03      CR-18V0 REDEFINES CORRECT-A.
008800         04 CORRECT-18V0                     PIC -9(18).
008900         04 FILLER                           PIC X.
009000     03 FILLER PIC X(2) VALUE SPACE.
009100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
009200 01  CCVS-C-1.
009300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
009400-    "SS  PARAGRAPH-NAME
009500-    "       REMARKS".
009600     02 FILLER                     PIC X(20)    VALUE SPACE.
009700 01  CCVS-C-2.
009800     02 FILLER                     PIC X        VALUE SPACE.
009900     02 FILLER                     PIC X(6)     VALUE "TESTED".
010000     02 FILLER                     PIC X(15)    VALUE SPACE.
010100     02 FILLER                     PIC X(4)     VALUE "FAIL".
010200     02 FILLER                     PIC X(94)    VALUE SPACE.
010300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
010400 01  REC-CT                        PIC 99       VALUE ZERO.
010500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
010600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
010700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
010800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
010900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
011000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
011100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
011200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
011300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
011400 01  CCVS-H-1.
011500     02  FILLER                    PIC X(39)    VALUE SPACES.
011600     02  FILLER                    PIC X(42)    VALUE
011700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
011800     02  FILLER                    PIC X(39)    VALUE SPACES.
011900 01  CCVS-H-2A.
012000   02  FILLER                        PIC X(40)  VALUE SPACE.
012100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
012200   02  FILLER                        PIC XXXX   VALUE
012300     "4.2 ".
012400   02  FILLER                        PIC X(28)  VALUE
012500            " COPY - NOT FOR DISTRIBUTION".
012600   02  FILLER                        PIC X(41)  VALUE SPACE.
012700
012800 01  CCVS-H-2B.
012900   02  FILLER                        PIC X(15)  VALUE
013000            "TEST RESULT OF ".
013100   02  TEST-ID                       PIC X(9).
013200   02  FILLER                        PIC X(4)   VALUE
013300            " IN ".
013400   02  FILLER                        PIC X(12)  VALUE
013500     " HIGH       ".
013600   02  FILLER                        PIC X(22)  VALUE
013700            " LEVEL VALIDATION FOR ".
013800   02  FILLER                        PIC X(58)  VALUE
013900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
014000 01  CCVS-H-3.
014100     02  FILLER                      PIC X(34)  VALUE
014200            " FOR OFFICIAL USE ONLY    ".
014300     02  FILLER                      PIC X(58)  VALUE
014400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
014500     02  FILLER                      PIC X(28)  VALUE
014600            "  COPYRIGHT   1985 ".
014700 01  CCVS-E-1.
014800     02 FILLER                       PIC X(52)  VALUE SPACE.
014900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
015000     02 ID-AGAIN                     PIC X(9).
015100     02 FILLER                       PIC X(45)  VALUE SPACES.
015200 01  CCVS-E-2.
015300     02  FILLER                      PIC X(31)  VALUE SPACE.
015400     02  FILLER                      PIC X(21)  VALUE SPACE.
015500     02 CCVS-E-2-2.
015600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
015700         03 FILLER                   PIC X      VALUE SPACE.
015800         03 ENDER-DESC               PIC X(44)  VALUE
015900            "ERRORS ENCOUNTERED".
016000 01  CCVS-E-3.
016100     02  FILLER                      PIC X(22)  VALUE
016200            " FOR OFFICIAL USE ONLY".
016300     02  FILLER                      PIC X(12)  VALUE SPACE.
016400     02  FILLER                      PIC X(58)  VALUE
016500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
016600     02  FILLER                      PIC X(13)  VALUE SPACE.
016700     02 FILLER                       PIC X(15)  VALUE
016800             " COPYRIGHT 1985".
016900 01  CCVS-E-4.
017000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
017100     02 FILLER                       PIC X(4)   VALUE " OF ".
017200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
017300     02 FILLER                       PIC X(40)  VALUE
017400      "  TESTS WERE EXECUTED SUCCESSFULLY".
017500 01  XXINFO.
017600     02 FILLER                       PIC X(19)  VALUE
017700            "*** INFORMATION ***".
017800     02 INFO-TEXT.
017900       04 FILLER                     PIC X(8)   VALUE SPACE.
018000       04 XXCOMPUTED                 PIC X(20).
018100       04 FILLER                     PIC X(5)   VALUE SPACE.
018200       04 XXCORRECT                  PIC X(20).
018300     02 INF-ANSI-REFERENCE           PIC X(48).
018400 01  HYPHEN-LINE.
018500     02 FILLER  PIC IS X VALUE IS SPACE.
018600     02 FILLER  PIC IS X(65)    VALUE IS "************************
018700-    "*****************************************".
018800     02 FILLER  PIC IS X(54)    VALUE IS "************************
018900-    "******************************".
019000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
019100     "ST121A".
019200 PROCEDURE DIVISION.
019300 CCVS1 SECTION.
019400 OPEN-FILES.
019500     OPEN     OUTPUT PRINT-FILE.
019600     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
019700     MOVE    SPACE TO TEST-RESULTS.
019800     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
019900     GO TO CCVS1-EXIT.
020000 CLOSE-FILES.
020100     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
020200 TERMINATE-CCVS.
020300S    EXIT PROGRAM.
020400STERMINATE-CALL.
020500     STOP     RUN.
020600 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
020700 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
020800 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
020900 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
021000     MOVE "****TEST DELETED****" TO RE-MARK.
021100 PRINT-DETAIL.
021200     IF REC-CT NOT EQUAL TO ZERO
021300             MOVE "." TO PARDOT-X
021400             MOVE REC-CT TO DOTVALUE.
021500     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
021600     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
021700        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
021800          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
021900     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
022000     MOVE SPACE TO CORRECT-X.
022100     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
022200     MOVE     SPACE TO RE-MARK.
022300 HEAD-ROUTINE.
022400     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022500     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
022600     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022700     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
022800 COLUMN-NAMES-ROUTINE.
022900     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
023000     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
023200 END-ROUTINE.
023300     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
023400 END-RTN-EXIT.
023500     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
023600 END-ROUTINE-1.
023700      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
023800      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
023900      ADD PASS-COUNTER TO ERROR-HOLD.
024000*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
024100      MOVE PASS-COUNTER TO CCVS-E-4-1.
024200      MOVE ERROR-HOLD TO CCVS-E-4-2.
024300      MOVE CCVS-E-4 TO CCVS-E-2-2.
024400      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
024500  END-ROUTINE-12.
024600      MOVE "TEST(S) FAILED" TO ENDER-DESC.
024700     IF       ERROR-COUNTER IS EQUAL TO ZERO
024800         MOVE "NO " TO ERROR-TOTAL
024900         ELSE
025000         MOVE ERROR-COUNTER TO ERROR-TOTAL.
025100     MOVE     CCVS-E-2 TO DUMMY-RECORD.
025200     PERFORM WRITE-LINE.
025300 END-ROUTINE-13.
025400     IF DELETE-COUNTER IS EQUAL TO ZERO
025500         MOVE "NO " TO ERROR-TOTAL  ELSE
025600         MOVE DELETE-COUNTER TO ERROR-TOTAL.
025700     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
025800     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
025900      IF   INSPECT-COUNTER EQUAL TO ZERO
026000          MOVE "NO " TO ERROR-TOTAL
026100      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
026200      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
026300      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026400     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
026500 WRITE-LINE.
026600     ADD 1 TO RECORD-COUNT.
026700Y    IF RECORD-COUNT GREATER 42
026800Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
026900Y        MOVE SPACE TO DUMMY-RECORD
027000Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
027100Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
027200Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
027300Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
027400Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
027500Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
027600Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
027700Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
027800Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
027900Y        MOVE ZERO TO RECORD-COUNT.
028000     PERFORM WRT-LN.
028100 WRT-LN.
028200     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
028300     MOVE SPACE TO DUMMY-RECORD.
028400 BLANK-LINE-PRINT.
028500     PERFORM WRT-LN.
028600 FAIL-ROUTINE.
028700     IF     COMPUTED-X NOT EQUAL TO SPACE
028800            GO TO   FAIL-ROUTINE-WRITE.
028900     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
029000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
029100     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
029200     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029300     MOVE   SPACES TO INF-ANSI-REFERENCE.
029400     GO TO  FAIL-ROUTINE-EX.
029500 FAIL-ROUTINE-WRITE.
029600     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
029700     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
029800     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
029900     MOVE   SPACES TO COR-ANSI-REFERENCE.
030000 FAIL-ROUTINE-EX. EXIT.
030100 BAIL-OUT.
030200     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
030300     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
030400 BAIL-OUT-WRITE.
030500     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
030600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
030700     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
030800     MOVE   SPACES TO INF-ANSI-REFERENCE.
030900 BAIL-OUT-EX. EXIT.
031000 CCVS1-EXIT.
031100     EXIT.
031200 SECT-ST119A-0001 SECTION.
031300 ST119A-0001-01.
031400     OPEN    INPUT  SORTIN-1C.
031500     MOVE     "THIS PROGRAM TESTS THE" TO RE-MARK.
031600     PERFORM  PRINT-DETAIL.
031700     MOVE     "OUTPUT GENERATED BY ST120A,"  TO RE-MARK.
031800     PERFORM  PRINT-DETAIL.
031900     MOVE     "WHICH WAS IN TURN GENERATED" TO RE-MARK.
032000     PERFORM  PRINT-DETAIL.
032100     MOVE     "IN ST119A."                   TO RE-MARK.
032200     PERFORM  PRINT-DETAIL.
032300     MOVE     "SORT - USING, GIVING" TO FEATURE.
032400 SORT-TEST-1.
032500     PERFORM  READ-SORTED-FILE.
032600     IF       KEYS-GROUP EQUAL TO 900009000000000
032700              PERFORM PASS GO TO SORT-WRITE-1.
032800     GO       TO SORT-FAIL-1.
032900 SORT-DELETE-1.
033000     PERFORM  DE-LETE.
033100     GO       TO SORT-WRITE-1.
033200 SORT-FAIL-1.
033300     PERFORM  FAIL.
033400     MOVE     KEYS-GROUP TO COMPUTED-18V0.
033500     MOVE     900009000000000 TO CORRECT-18V0.
033600 SORT-WRITE-1.
033700     MOVE     "SORT-TEST-1" TO PAR-NAME.
033800     PERFORM  PRINT-DETAIL.
033900 SORT-TEST-2.
034000     PERFORM  READ-SORTED-FILE.
034100     IF       KEYS-GROUP EQUAL TO 900008000000000
034200              PERFORM PASS GO TO SORT-WRITE-2.
034300     GO       TO SORT-FAIL-2.
034400 SORT-DELETE-2.
034500     PERFORM  DE-LETE.
034600     GO       TO SORT-WRITE-2.
034700 SORT-FAIL-2.
034800     PERFORM  FAIL.
034900     MOVE     KEYS-GROUP TO COMPUTED-18V0.
035000     MOVE     900008000000000 TO CORRECT-18V0.
035100 SORT-WRITE-2.
035200     MOVE     "SORT-TEST-2" TO PAR-NAME.
035300     PERFORM  PRINT-DETAIL.
035400 SORT-TEST-3.
035500     PERFORM  READ-SORTED-FILE.
035600     IF       KEYS-GROUP EQUAL TO 201002000100001
035700              PERFORM PASS GO TO SORT-WRITE-3.
035800     GO       TO SORT-FAIL-3.
035900 SORT-DELETE-3.
036000     PERFORM  DE-LETE.
036100     GO       TO SORT-WRITE-3.
036200 SORT-FAIL-3.
036300     PERFORM  FAIL.
036400     MOVE     KEYS-GROUP TO COMPUTED-18V0.
036500     MOVE     201002000100001 TO CORRECT-18V0.
036600 SORT-WRITE-3.
036700     MOVE     "SORT-TEST-3" TO PAR-NAME.
036800     PERFORM  PRINT-DETAIL.
036900 SORT-TEST-4.
037000     PERFORM  READ-SORTED-FILE 48 TIMES.
037100     IF       KEYS-GROUP EQUAL TO 101002000100001
037200              PERFORM PASS GO TO SORT-WRITE-4.
037300     GO       TO SORT-FAIL-4.
037400 SORT-DELETE-4.
037500     PERFORM  DE-LETE.
037600     GO       TO SORT-WRITE-4.
037700 SORT-FAIL-4.
037800     PERFORM  FAIL.
037900     MOVE     KEYS-GROUP TO COMPUTED-18V0.
038000     MOVE     101002000100001 TO CORRECT-18V0.
038100 SORT-WRITE-4.
038200     MOVE     "SORT-TEST-4" TO PAR-NAME.
038300     PERFORM  PRINT-DETAIL.
038400 SORT-TEST-5.
038500     PERFORM  READ-SORTED-FILE 40 TIMES.
038600     IF       KEYS-GROUP EQUAL TO 106002000100001
038700              PERFORM PASS GO TO SORT-WRITE-5.
038800     GO       TO SORT-FAIL-5.
038900 SORT-DELETE-5.
039000     PERFORM  DE-LETE.
039100     GO       TO SORT-WRITE-5.
039200 SORT-FAIL-5.
039300     PERFORM  FAIL.
039400     MOVE     KEYS-GROUP TO COMPUTED-18V0.
039500     MOVE     106002000100001 TO CORRECT-18V0.
039600 SORT-WRITE-5.
039700     MOVE     "SORT-TEST-5" TO PAR-NAME.
039800     PERFORM  PRINT-DETAIL.
039900 SORT-TEST-6.
040000     PERFORM  READ-SORTED-FILE  7 TIMES.
040100     IF       KEYS-GROUP EQUAL TO 106001000200002
040200              PERFORM PASS GO TO SORT-WRITE-6.
040300     GO       TO SORT-FAIL-6.
040400 SORT-DELETE-6.
040500     PERFORM  DE-LETE.
040600     GO       TO SORT-WRITE-6.
040700 SORT-FAIL-6.
040800     PERFORM  FAIL.
040900     MOVE     KEYS-GROUP TO COMPUTED-18V0.
041000     MOVE     106001000200002 TO CORRECT-18V0.
041100 SORT-WRITE-6.
041200     MOVE     "SORT-TEST-6" TO PAR-NAME.
041300     PERFORM  PRINT-DETAIL.
041400 SORT-TEST-7.
041500     PERFORM  READ-SORTED-FILE.
041600     IF       KEYS-GROUP EQUAL TO 009000000900008
041700              PERFORM PASS GO TO SORT-WRITE-7.
041800     GO       TO SORT-FAIL-7.
041900 SORT-DELETE-7.
042000     PERFORM  DE-LETE.
042100     GO       TO SORT-WRITE-7.
042200 SORT-FAIL-7.
042300     PERFORM  FAIL.
042400     MOVE     KEYS-GROUP TO COMPUTED-18V0.
042500     MOVE     009000000900008 TO CORRECT-18V0.
042600 SORT-WRITE-7.
042700     MOVE     "SORT-TEST-7" TO PAR-NAME.
042800     PERFORM  PRINT-DETAIL.
042900 SORT-TEST-8.
043000     PERFORM  READ-SORTED-FILE.
043100     IF       KEYS-GROUP EQUAL TO 009000000900009
043200              PERFORM PASS GO TO SORT-WRITE-8.
043300     GO       TO SORT-FAIL-8.
043400 SORT-DELETE-8.
043500     PERFORM  DE-LETE.
043600     GO       TO SORT-WRITE-8.
043700 SORT-FAIL-8.
043800     PERFORM  FAIL.
043900     MOVE     KEYS-GROUP TO COMPUTED-18V0.
044000     MOVE     009000000900009 TO CORRECT-18V0.
044100 SORT-WRITE-8.
044200     MOVE     "SORT-TEST-8" TO PAR-NAME.
044300     PERFORM  PRINT-DETAIL.
044400 SORT-TEST-9.
044500     READ     SORTIN-1C AT END
044600              PERFORM PASS GO TO SORT-WRITE-9.
044700*    NOTE     THE FOLLOWING STATEMENTS SHOULD NOT BE EXECUTED.
044800     PERFORM  FAIL.
044900     MOVE     KEYS-GROUP TO COMPUTED-18V0.
045000     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
045100     GO       TO SORT-WRITE-9.
045200 SORT-DELETE-9.
045300     PERFORM  DE-LETE.
045400 SORT-WRITE-9.
045500     MOVE     "SORT-TEST-9" TO PAR-NAME.
045600     PERFORM  PRINT-DETAIL.
045700     CLOSE    SORTIN-1C.
045800     GO TO    CCVS-EXIT.
045900 READ-SORTED-FILE.
046000     READ     SORTIN-1C          AT END GO TO BAD-FILE.
046100 BAD-FILE.
046200     PERFORM FAIL.
046300     MOVE     "BAD-FILE" TO PAR-NAME.
046400     MOVE     "END OF FILE PREMATURELY" TO RE-MARK.
046500     PERFORM  PRINT-DETAIL.
046600     MOVE     SPACE TO FEATURE.
046700     MOVE     "FOUND, PREVIOUS TEST WAS" TO RE-MARK.
046800     PERFORM  PRINT-DETAIL.
046900     MOVE     "LAST SUCCESSFUL TEST." TO RE-MARK.
047000     PERFORM  PRINT-DETAIL.
047100 CCVS-EXIT SECTION.
047200 CCVS-999999.
047300     GO TO CLOSE-FILES.
