000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST127A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*        X-27  - SORT-FILE-NAME-1                              *
002000*                                                              *
002100****************************************************************
002200*    ST127A IS A COMPLETELY SELF-CONTAINED PROGRAM.  THE INPUT
002300*    PROCEDURE BUILDS THE 17-RECORD FILE SHOWN BELOW. THE
002400*    OUTPUT PROCEDURE CHECKS THE SORTED FILE AND GENERATES THE
002500*    REPORT.
002600*    SORT    SORT   SORT    SORT   SORT   SORT   SORT  SORT  LAST
002700*    KEY-1   KEY-2  KEY-3   KEY-4  KEY-5  KEY-6  KEY-7 KEY-8 CHAR
002800*    S9(6)   A(5)   SV9(16) X(10)  A(20)  X(10)  999   S99   PIC X
002900*    USAGE   JUST           JUST                       USAGE
003000*    COMP    RIGHT          RIGHT                      COMP
003100*
003200*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     1
003300*    +123456  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99
003400*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     2
003500*    -054321    X  -.1234  BBBBBB A     AAAAAAAA  501  +99
003600*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     3
003700*    -054321  BBB  +.6     BBBBBB A     AAAAAAAA  501  +99
003800*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     4
003900*    -054321  BBB  -.1234       X A     AAAAAAAA  501  +99
004000*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     5
004100*    -054321  BBB  -.1234  BBBBBB Z     AAAAAAAA  501  +99
004200*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     6
004300*    -054321  BBB  -.1234  BBBBBB A     Z         501  +99
004400*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     7
004500*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  418  +99
004600*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     8
004700*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  -14
004800*    -054321  BBB  -.1234  BBBBBB A     AAAAAAAA  501  +99     9
004900*
005000*    THIS PROGRAM TESTS THE USE OF THE "DUPLICATES" PHRASE OF
005100*    THE  "SORT" STATEMENT.  THE ORDER OF RECORDS HAVING
005200*    DUPLICATE KEYS AFTER THE EXECUTION OF A "SORT" STATEMENT
005300*    MUST BE THE SAME AS THE ORDER OF THOSE RECORDS ON INPUT
005400*    TO THE "SORT" STATEMENT.
005500
005600 ENVIRONMENT DIVISION.
005700 CONFIGURATION SECTION.
005800 SOURCE-COMPUTER.
005900     XXXXX082.
006000 OBJECT-COMPUTER.
006100     XXXXX083.
006200 INPUT-OUTPUT SECTION.
006300 FILE-CONTROL.
006400     SELECT PRINT-FILE ASSIGN TO
006500     XXXXX055.
006600     SELECT   SORTFILE-1H ASSIGN TO
006700     XXXXX027.
006800 DATA DIVISION.
006900 FILE SECTION.
007000 FD  PRINT-FILE.
007100 01  PRINT-REC PICTURE X(120).
007200 01  DUMMY-RECORD PICTURE X(120).
007300 SD  SORTFILE-1H
007400     DATA RECORD IS SORTFILE-REC.
007500 01  SORTFILE-REC.
007600   05 SORT-1.
007700     10 SORTKEY-8       PICTURE S99 COMPUTATIONAL.
007800     10 SORTKEY-1       PICTURE S9(6) COMPUTATIONAL.
007900     10 SORTKEY-7       PICTURE 999.
008000     10 SORTKEY-3       PICTURE SV9(16).
008100     10 FILLER          PICTURE XX.
008200     10 SORTKEY-4       PICTURE X(10) JUSTIFIED RIGHT.
008300     10 SORTKEY-6       PICTURE X(10).
008400     10 SORTKEY-2       PICTURE A(05) JUSTIFIED RIGHT.
008500     10 SORTKEY-5       PICTURE A(20).
008600     10 FILLER          PICTURE XXX.
008700  05    SORT-IDENTIFIER PICTURE X.
008800 WORKING-STORAGE SECTION.
008900 77  WS-IDENTIFIER      PIC 9.
009000 01  WS-SORTFILE-REC.
009100     02 WS-8            PICTURE S99 COMPUTATIONAL.
009200     02 WS-1            PICTURE S9(6) COMPUTATIONAL.
009300     02 WS-7            PICTURE 999.
009400     02 WS-3            PICTURE SV9(16).
009500     02 FILLER          PICTURE XX.
009600     02 WS-4            PICTURE X(10) JUSTIFIED RIGHT.
009700     02 WS-6            PICTURE X(10).
009800     02 WS-2            PICTURE A(05) JUSTIFIED RIGHT.
009900     02 WS-5            PICTURE A(20).
010000     02 FILLER          PICTURE XXX.
010100 77  UTIL-CTR           PICTURE S99999.
010200 77  SPAC-E             PICTURE X VALUE " ".
010300 01  TEST-RESULTS.
010400     02 FILLER                   PIC X      VALUE SPACE.
010500     02 FEATURE                  PIC X(20)  VALUE SPACE.
010600     02 FILLER                   PIC X      VALUE SPACE.
010700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
010800     02 FILLER                   PIC X      VALUE SPACE.
010900     02  PAR-NAME.
011000       03 FILLER                 PIC X(19)  VALUE SPACE.
011100       03  PARDOT-X              PIC X      VALUE SPACE.
011200       03 DOTVALUE               PIC 99     VALUE ZERO.
011300     02 FILLER                   PIC X(8)   VALUE SPACE.
011400     02 RE-MARK                  PIC X(61).
011500 01  TEST-COMPUTED.
011600     02 FILLER                   PIC X(30)  VALUE SPACE.
011700     02 FILLER                   PIC X(17)  VALUE
011800            "       COMPUTED=".
011900     02 COMPUTED-X.
012000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
012100     03 COMPUTED-N               REDEFINES COMPUTED-A
012200                                 PIC -9(9).9(9).
012300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
012400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
012500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
012600     03       CM-18V0 REDEFINES COMPUTED-A.
012700         04 COMPUTED-18V0                    PIC -9(18).
012800         04 FILLER                           PIC X.
012900     03 FILLER PIC X(50) VALUE SPACE.
013000 01  TEST-CORRECT.
013100     02 FILLER PIC X(30) VALUE SPACE.
013200     02 FILLER PIC X(17) VALUE "       CORRECT =".
013300     02 CORRECT-X.
013400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
013500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
013600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
013700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
013800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
013900     03      CR-18V0 REDEFINES CORRECT-A.
014000         04 CORRECT-18V0                     PIC -9(18).
014100         04 FILLER                           PIC X.
014200     03 FILLER PIC X(2) VALUE SPACE.
014300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
014400 01  CCVS-C-1.
014500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
014600-    "SS  PARAGRAPH-NAME
014700-    "       REMARKS".
014800     02 FILLER                     PIC X(20)    VALUE SPACE.
014900 01  CCVS-C-2.
015000     02 FILLER                     PIC X        VALUE SPACE.
015100     02 FILLER                     PIC X(6)     VALUE "TESTED".
015200     02 FILLER                     PIC X(15)    VALUE SPACE.
015300     02 FILLER                     PIC X(4)     VALUE "FAIL".
015400     02 FILLER                     PIC X(94)    VALUE SPACE.
015500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
015600 01  REC-CT                        PIC 99       VALUE ZERO.
015700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
015800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
015900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
016000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
016100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
016200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
016300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
016400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
016500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
016600 01  CCVS-H-1.
016700     02  FILLER                    PIC X(39)    VALUE SPACES.
016800     02  FILLER                    PIC X(42)    VALUE
016900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
017000     02  FILLER                    PIC X(39)    VALUE SPACES.
017100 01  CCVS-H-2A.
017200   02  FILLER                        PIC X(40)  VALUE SPACE.
017300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
017400   02  FILLER                        PIC XXXX   VALUE
017500     "4.2 ".
017600   02  FILLER                        PIC X(28)  VALUE
017700            " COPY - NOT FOR DISTRIBUTION".
017800   02  FILLER                        PIC X(41)  VALUE SPACE.
017900
018000 01  CCVS-H-2B.
018100   02  FILLER                        PIC X(15)  VALUE
018200            "TEST RESULT OF ".
018300   02  TEST-ID                       PIC X(9).
018400   02  FILLER                        PIC X(4)   VALUE
018500            " IN ".
018600   02  FILLER                        PIC X(12)  VALUE
018700     " HIGH       ".
018800   02  FILLER                        PIC X(22)  VALUE
018900            " LEVEL VALIDATION FOR ".
019000   02  FILLER                        PIC X(58)  VALUE
019100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019200 01  CCVS-H-3.
019300     02  FILLER                      PIC X(34)  VALUE
019400            " FOR OFFICIAL USE ONLY    ".
019500     02  FILLER                      PIC X(58)  VALUE
019600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
019700     02  FILLER                      PIC X(28)  VALUE
019800            "  COPYRIGHT   1985 ".
019900 01  CCVS-E-1.
020000     02 FILLER                       PIC X(52)  VALUE SPACE.
020100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
020200     02 ID-AGAIN                     PIC X(9).
020300     02 FILLER                       PIC X(45)  VALUE SPACES.
020400 01  CCVS-E-2.
020500     02  FILLER                      PIC X(31)  VALUE SPACE.
020600     02  FILLER                      PIC X(21)  VALUE SPACE.
020700     02 CCVS-E-2-2.
020800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
020900         03 FILLER                   PIC X      VALUE SPACE.
021000         03 ENDER-DESC               PIC X(44)  VALUE
021100            "ERRORS ENCOUNTERED".
021200 01  CCVS-E-3.
021300     02  FILLER                      PIC X(22)  VALUE
021400            " FOR OFFICIAL USE ONLY".
021500     02  FILLER                      PIC X(12)  VALUE SPACE.
021600     02  FILLER                      PIC X(58)  VALUE
021700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021800     02  FILLER                      PIC X(13)  VALUE SPACE.
021900     02 FILLER                       PIC X(15)  VALUE
022000             " COPYRIGHT 1985".
022100 01  CCVS-E-4.
022200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
022300     02 FILLER                       PIC X(4)   VALUE " OF ".
022400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
022500     02 FILLER                       PIC X(40)  VALUE
022600      "  TESTS WERE EXECUTED SUCCESSFULLY".
022700 01  XXINFO.
022800     02 FILLER                       PIC X(19)  VALUE
022900            "*** INFORMATION ***".
023000     02 INFO-TEXT.
023100       04 FILLER                     PIC X(8)   VALUE SPACE.
023200       04 XXCOMPUTED                 PIC X(20).
023300       04 FILLER                     PIC X(5)   VALUE SPACE.
023400       04 XXCORRECT                  PIC X(20).
023500     02 INF-ANSI-REFERENCE           PIC X(48).
023600 01  HYPHEN-LINE.
023700     02 FILLER  PIC IS X VALUE IS SPACE.
023800     02 FILLER  PIC IS X(65)    VALUE IS "************************
023900-    "*****************************************".
024000     02 FILLER  PIC IS X(54)    VALUE IS "************************
024100-    "******************************".
024200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
024300     "ST127A".
024400 PROCEDURE DIVISION.
024500 SORT-PARA SECTION.
024600 SORT-PARAGRAPH.
024700     MOVE    "XI-18 4.4.4 GR(3)b" TO ANSI-REFERENCE.
024800     SORT     SORTFILE-1H ON
024900              ASCENDING KEY SORTKEY-1
025000              ASCENDING SORTKEY-2
025100              ASCENDING SORTKEY-3
025200              ASCENDING SORTKEY-4
025300              ASCENDING SORTKEY-5
025400              ASCENDING SORTKEY-6
025500              ASCENDING SORTKEY-7
025600              ASCENDING SORTKEY-8
025700              WITH DUPLICATES IN ORDER
025800              INPUT PROCEDURE INPROC
025900              OUTPUT PROCEDURE OUTPROC THRU OUTPROC-EXIT.
026000     STOP     RUN.
026100 INPROC SECTION.
026200 BUILD-FILE.
026300     MOVE     ZERO TO WS-IDENTIFIER.
026400     PERFORM  BUILD-RECORD.
026500     MOVE     SORT-1              TO WS-SORTFILE-REC.
026600     ADD      1 TO WS-IDENTIFIER.
026700     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
026800     PERFORM  RELEASE-RECORD.
026900     MOVE     +123456             TO SORTKEY-1.
027000     PERFORM  RELEASE-RECORD.
027100     MOVE     WS-SORTFILE-REC     TO SORTFILE-REC.
027200     ADD      1 TO WS-IDENTIFIER.
027300     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
027400     PERFORM  RELEASE-RECORD.
027500     PERFORM  BUILD-RECORD.
027600     MOVE     "X"                 TO SORTKEY-2.
027700     PERFORM  RELEASE-RECORD.
027800     MOVE     WS-SORTFILE-REC     TO SORTFILE-REC.
027900     ADD      1 TO WS-IDENTIFIER.
028000     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
028100     PERFORM  RELEASE-RECORD.
028200     PERFORM  BUILD-RECORD.
028300     MOVE     +.6                 TO SORTKEY-3.
028400     PERFORM  RELEASE-RECORD.
028500     MOVE     WS-SORTFILE-REC     TO SORTFILE-REC.
028600     ADD      1 TO WS-IDENTIFIER.
028700     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
028800     PERFORM  RELEASE-RECORD.
028900     PERFORM  BUILD-RECORD.
029000     MOVE     "X"                 TO SORTKEY-4.
029100     PERFORM  RELEASE-RECORD.
029200     MOVE     WS-SORTFILE-REC     TO SORTFILE-REC.
029300     ADD      1 TO WS-IDENTIFIER.
029400     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
029500     PERFORM  RELEASE-RECORD.
029600     PERFORM  BUILD-RECORD.
029700     MOVE     "Z"                 TO SORTKEY-5.
029800     PERFORM  RELEASE-RECORD.
029900     MOVE     WS-SORTFILE-REC     TO SORTFILE-REC.
030000     ADD      1 TO WS-IDENTIFIER.
030100     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
030200     PERFORM  RELEASE-RECORD.
030300     PERFORM  BUILD-RECORD.
030400     MOVE     "Z"                 TO SORTKEY-6.
030500     PERFORM  RELEASE-RECORD.
030600     MOVE     WS-SORTFILE-REC     TO SORTFILE-REC.
030700     ADD      1 TO WS-IDENTIFIER.
030800     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
030900     PERFORM  RELEASE-RECORD.
031000     PERFORM  BUILD-RECORD.
031100     MOVE     +418                TO SORTKEY-7.
031200     PERFORM  RELEASE-RECORD.
031300     MOVE     WS-SORTFILE-REC     TO SORTFILE-REC.
031400     ADD      1 TO WS-IDENTIFIER.
031500     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
031600     PERFORM  RELEASE-RECORD.
031700     PERFORM  BUILD-RECORD.
031800     MOVE     -14                 TO SORTKEY-8.
031900     PERFORM  RELEASE-RECORD.
032000     MOVE     WS-SORTFILE-REC     TO SORTFILE-REC.
032100     ADD      1 TO WS-IDENTIFIER.
032200     MOVE     WS-IDENTIFIER       TO SORT-IDENTIFIER.
032300     PERFORM  RELEASE-RECORD.
032400     GO       TO BUILD-EXIT.
032500 BUILD-RECORD.
032600     MOVE     -054321             TO SORTKEY-1.
032700     MOVE     "BBB"               TO SORTKEY-2.
032800     MOVE     -.1234567890123456  TO SORTKEY-3.
032900     MOVE     "BBBBBB"            TO SORTKEY-4.
033000     MOVE     "A"                 TO SORTKEY-5.
033100     MOVE     "AAAAAAAA"          TO SORTKEY-6.
033200     MOVE     -501                TO SORTKEY-7.
033300*       NOTE THIS ITEM IS INTENTIONALLY MOVED TO AN UNSIGNED
033400*             FIELD.
033500     MOVE     +99                 TO SORTKEY-8.
033600     MOVE      SPACE              TO SORT-IDENTIFIER.
033700 RELEASE-RECORD.
033800     RELEASE  SORTFILE-REC.
033900 BUILD-EXIT.
034000     EXIT.
034100 OUTPROC SECTION.
034200 OPEN-FILES.
034300     OPEN     OUTPUT PRINT-FILE.
034400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
034500     MOVE    SPACE TO TEST-RESULTS.
034600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
034700     IF       SPAC-E IS LESS THAN "B"
034800              GO TO SPACE-IS-LESS-THAN-B.
034900 B-IS-LESS-THAN-SPACE SECTION.
035000 SORT-INIT-A.
035100     MOVE     "SORT - 8 ASC. KEYS" TO FEATURE.
035200*        NOTE THE RECORDS SHOULD BE SORTED INTO THE FOLLOWING
035300*             ORDER --- 8 7 6 5 4 3 1 2 --- THAT IS,
035400*             THE 8TH RECORD SORTS UP TO THE 1ST POSITION,
035500*             THE 7TH RECORD SORTS UP TO THE 2ND POSITION, ETC.
035600 SORT-TEST-1.
035700     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
035800     IF       SORTKEY-7 EQUAL TO 418
035900              PERFORM PASS GO TO SORT-WRITE-1.
036000 SORT-FAIL-1.
036100     PERFORM  FAIL.
036200     MOVE     SORTKEY-7 TO COMPUTED-N.
036300     MOVE     418 TO CORRECT-N.
036400 SORT-WRITE-1.
036500     MOVE     "SORT-TEST-1 " TO PAR-NAME.
036600     PERFORM  PRINT-DETAIL.
036700 SORT-TEST-2.
036800     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
036900     IF       SORTKEY-8 EQUAL TO -14
037000              PERFORM PASS GO TO SORT-WRITE-2.
037100 SORT-FAIL-2.
037200     PERFORM  FAIL.
037300     MOVE     SORTKEY-8 TO COMPUTED-N.
037400     MOVE     -14 TO CORRECT-N.
037500 SORT-WRITE-2.
037600     MOVE     "SORT-TEST-2 " TO PAR-NAME.
037700     PERFORM  PRINT-DETAIL.
037800 SORT-TEST-3.
037900     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
038000     IF       SORTKEY-6 EQUAL TO "Z         "
038100              PERFORM PASS GO TO SORT-WRITE-3.
038200 SORT-FAIL-3.
038300     PERFORM  FAIL.
038400     MOVE     SORTKEY-6 TO COMPUTED-A.
038500     MOVE     "Z         "           TO CORRECT-A.
038600 SORT-WRITE-3.
038700     MOVE     "SORT-TEST-3 " TO PAR-NAME.
038800     PERFORM  PRINT-DETAIL.
038900 SORT-TEST-4.
039000     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
039100     IF       SORTKEY-5 EQUAL TO "Z                   "
039200              PERFORM PASS GO TO SORT-WRITE-4.
039300 SORT-FAIL-4.
039400     PERFORM  FAIL.
039500     MOVE     SORTKEY-5 TO COMPUTED-A.
039600     MOVE     "Z                   " TO CORRECT-A.
039700 SORT-WRITE-4.
039800     MOVE     "SORT-TEST-4 " TO PAR-NAME.
039900     PERFORM  PRINT-DETAIL.
040000 SORT-TEST-5.
040100     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
040200     IF       SORTKEY-4 EQUAL TO "         X"
040300              PERFORM PASS GO TO SORT-WRITE-5.
040400 SORT-FAIL-5.
040500     PERFORM  FAIL.
040600     MOVE     SORTKEY-4 TO COMPUTED-A.
040700     MOVE     "         X"           TO CORRECT-A.
040800 SORT-WRITE-5.
040900     MOVE     "SORT-TEST-5 " TO PAR-NAME.
041000     PERFORM  PRINT-DETAIL.
041100 SORT-TEST-6.
041200     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
041300     IF       SORTKEY-3 EQUAL TO +.6000000000000000
041400              PERFORM PASS GO TO SORT-WRITE-6.
041500 SORT-FAIL-6.
041600     PERFORM  FAIL.
041700     MOVE     SORTKEY-3 TO COMPUTED-0V18.
041800     MOVE     +.6000000000000000     TO CORRECT-0V18.
041900 SORT-WRITE-6.
042000     MOVE     "SORT-TEST-6 " TO PAR-NAME.
042100     PERFORM  PRINT-DETAIL.
042200 SORT-TEST-7.
042300     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
042400     IF       SORTKEY-2 EQUAL TO "    X"
042500              PERFORM PASS GO TO SORT-WRITE-7.
042600 SORT-FAIL-7.
042700     PERFORM  FAIL.
042800     MOVE     SORTKEY-2 TO COMPUTED-A.
042900     MOVE     "    X" TO CORRECT-A.
043000 SORT-WRITE-7.
043100     MOVE     "SORT-TEST-7 " TO PAR-NAME.
043200     PERFORM  PRINT-DETAIL.
043300 SORT-TEST-8.
043400     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
043500     IF       SORTKEY-1 EQUAL TO +123456
043600              PERFORM PASS GO TO SORT-WRITE-8.
043700 SORT-FAIL-8.
043800     PERFORM  FAIL.
043900     MOVE     SORTKEY-1 TO COMPUTED-N.
044000     MOVE     +123456 TO CORRECT-N.
044100 SORT-WRITE-8.
044200     MOVE     "SORT-TEST-8 " TO PAR-NAME.
044300     PERFORM  PRINT-DETAIL.
044400 SORT-REMARK-A.
044500     MOVE     SPACE TO FEATURE.
044600     MOVE     "THE COLLATING SEQUENCE" TO RE-MARK.
044700     PERFORM  PRINT-DETAIL.
044800     MOVE     "RENDERS TESTS 9 THRU 16" TO RE-MARK.
044900     PERFORM  PRINT-DETAIL.
045000     MOVE     "UNNECESSARY." TO RE-MARK.
045100     PERFORM  PRINT-DETAIL.
045200     MOVE     "SORT - 8 ASC. KEYS" TO FEATURE.
045300     GO       TO CONTINUE-TESTING.
045400 SPACE-IS-LESS-THAN-B SECTION.
045500 SORT-REMARK-B.
045600     MOVE     "THE COLLATING SEQUENCE" TO RE-MARK.
045700     PERFORM  PRINT-DETAIL.
045800     MOVE     "RENDERS TESTS 1 THRU 8" TO RE-MARK.
045900     PERFORM  PRINT-DETAIL.
046000     MOVE     "UNNECESSARY." TO RE-MARK.
046100     PERFORM  PRINT-DETAIL.
046200     MOVE     "SORT - 8 ASC. KEYS" TO FEATURE.
046300*        NOTE THE RECORDS SHOULD BE SORTED INTO THE FOLLOWING
046400*             ORDER --- 8 1 7 2 6 5 3 4 --- THAT IS,
046500*             THE 1ST RECORD IS SORTED DOWN TO THE 8TH POSITION,
046600*             THE 2ND RECORD SORTS UP TO THE 1ST POSITION, ETC.
046700 SORT-TEST-9.
046800     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
046900     IF       SORTKEY-2 EQUAL TO "    X"
047000              PERFORM PASS GO TO SORT-WRITE-9.
047100 SORT-FAIL-9.
047200     PERFORM  FAIL.
047300     MOVE     SORTKEY-2 TO COMPUTED-A.
047400     MOVE     "    X" TO CORRECT-A.
047500 SORT-WRITE-9.
047600     MOVE     "SORT-TEST-9 " TO PAR-NAME.
047700     PERFORM  PRINT-DETAIL.
047800*
047900*    PERFORM  RETURN-DUPLICATE-RECORDS.
048000*
048100 SORT-TEST-10.
048200     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
048300     IF       SORTKEY-4 EQUAL TO "         X"
048400              PERFORM PASS GO TO SORT-WRITE-10.
048500 SORT-FAIL-10.
048600     PERFORM  FAIL.
048700     MOVE     SORTKEY-4 TO COMPUTED-A.
048800     MOVE     "         X" TO CORRECT-A.
048900 SORT-WRITE-10.
049000     MOVE     "SORT-TEST-10" TO PAR-NAME.
049100     PERFORM  PRINT-DETAIL.
049200 SORT-TEST-11.
049300     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
049400     IF       SORTKEY-7 EQUAL TO 418
049500              PERFORM PASS GO TO SORT-WRITE-11.
049600 SORT-FAIL-11.
049700     PERFORM  FAIL.
049800     MOVE     SORTKEY-7 TO COMPUTED-N
049900     MOVE     418 TO CORRECT-N.
050000 SORT-WRITE-11.
050100     MOVE     "SORT-TEST-11" TO PAR-NAME.
050200     PERFORM  PRINT-DETAIL.
050300 SORT-TEST-12.
050400     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
050500     IF       SORTKEY-8 EQUAL TO -14
050600              PERFORM PASS GO TO SORT-WRITE-12.
050700 SORT-FAIL-12.
050800     PERFORM  FAIL.
050900     MOVE     SORTKEY-8 TO COMPUTED-N.
051000     MOVE     -14 TO CORRECT-N.
051100 SORT-WRITE-12.
051200     MOVE     "SORT-TEST-12" TO PAR-NAME.
051300     PERFORM  PRINT-DETAIL.
051400     PERFORM  RETURN-DUPLICATE-RECORDS.
051500 SORT-TEST-13.
051600     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
051700     IF       SORTKEY-6 EQUAL TO "Z         "
051800              PERFORM PASS GO TO SORT-WRITE-13.
051900 SORT-FAIL-13.
052000     PERFORM  FAIL.
052100     MOVE     SORTKEY-6 TO COMPUTED-A.
052200     MOVE     "Z         "           TO CORRECT-A.
052300 SORT-WRITE-13.
052400     MOVE     "SORT-TEST-13" TO PAR-NAME.
052500     PERFORM  PRINT-DETAIL.
052600 SORT-TEST-14.
052700     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
052800     IF       SORTKEY-5 EQUAL TO "Z                   "
052900              PERFORM PASS GO TO SORT-WRITE-14.
053000 SORT-FAIL-14.
053100     PERFORM  FAIL.
053200     MOVE     SORTKEY-5 TO COMPUTED-A.
053300     MOVE     "Z                   " TO CORRECT-A.
053400 SORT-WRITE-14.
053500     MOVE     "SORT-TEST-14" TO PAR-NAME.
053600     PERFORM  PRINT-DETAIL.
053700 SORT-TEST-15.
053800     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
053900     IF       SORTKEY-3 EQUAL TO +.6000000000000000
054000              PERFORM PASS GO TO SORT-WRITE-15.
054100 SORT-FAIL-15.
054200     PERFORM  FAIL.
054300     MOVE     SORTKEY-3 TO COMPUTED-0V18.
054400     MOVE     +.6000000000000000     TO CORRECT-0V18.
054500 SORT-WRITE-15.
054600     MOVE     "SORT-TEST-15" TO PAR-NAME.
054700     PERFORM  PRINT-DETAIL.
054800 SORT-TEST-16.
054900     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
055000     IF       SORTKEY-1 EQUAL TO +123456
055100              PERFORM PASS GO TO SORT-WRITE-16.
055200 SORT-FAIL-16.
055300     PERFORM  FAIL.
055400     MOVE     SORTKEY-1 TO COMPUTED-N.
055500     MOVE     +123456 TO CORRECT-N.
055600 SORT-WRITE-16.
055700     MOVE     "SORT-TEST-16" TO PAR-NAME.
055800     PERFORM  PRINT-DETAIL.
055900 CONTINUE-TESTING SECTION.
056000 SORT-TEST-17.
056100     RETURN   SORTFILE-1H AT END
056200              PERFORM PASS GO TO SORT-WRITE-17.
056300 SORT-FAIL-17.
056400     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
056500     PERFORM  FAIL.
056600 SORT-WRITE-17.
056700     MOVE     "SORT-TEST-17" TO PAR-NAME.
056800     PERFORM  PRINT-DETAIL.
056900     GO       TO OUTPROC-EXIT.
057000 RETURN-ERROR.
057100     MOVE     "RETURN-ERROR" TO PAR-NAME.
057200     PERFORM  FAIL.
057300     MOVE     "EOF PREMATURELY FOUND" TO RE-MARK.
057400     PERFORM  PRINT-DETAIL.
057500     GO TO CCVS1-EXIT.
057600 CLOSE-FILES.
057700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
057800 TERMINATE-CCVS.
057900S    EXIT PROGRAM.
058000STERMINATE-CALL.
058100     STOP     RUN.
058200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
058300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
058400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
058500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
058600     MOVE "****TEST DELETED****" TO RE-MARK.
058700 PRINT-DETAIL.
058800     IF REC-CT NOT EQUAL TO ZERO
058900             MOVE "." TO PARDOT-X
059000             MOVE REC-CT TO DOTVALUE.
059100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
059200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
059300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
059400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
059500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
059600     MOVE SPACE TO CORRECT-X.
059700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
059800     MOVE     SPACE TO RE-MARK.
059900 HEAD-ROUTINE.
060000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
060100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
060200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
060300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
060400 COLUMN-NAMES-ROUTINE.
060500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
060600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
060700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
060800 END-ROUTINE.
060900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
061000 END-RTN-EXIT.
061100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
061200 END-ROUTINE-1.
061300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
061400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
061500      ADD PASS-COUNTER TO ERROR-HOLD.
061600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
061700      MOVE PASS-COUNTER TO CCVS-E-4-1.
061800      MOVE ERROR-HOLD TO CCVS-E-4-2.
061900      MOVE CCVS-E-4 TO CCVS-E-2-2.
062000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
062100  END-ROUTINE-12.
062200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
062300     IF       ERROR-COUNTER IS EQUAL TO ZERO
062400         MOVE "NO " TO ERROR-TOTAL
062500         ELSE
062600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
062700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
062800     PERFORM WRITE-LINE.
062900 END-ROUTINE-13.
063000     IF DELETE-COUNTER IS EQUAL TO ZERO
063100         MOVE "NO " TO ERROR-TOTAL  ELSE
063200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
063300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
063400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
063500      IF   INSPECT-COUNTER EQUAL TO ZERO
063600          MOVE "NO " TO ERROR-TOTAL
063700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
063800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
063900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
064000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
064100 WRITE-LINE.
064200     ADD 1 TO RECORD-COUNT.
064300Y    IF RECORD-COUNT GREATER 42
064400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
064500Y        MOVE SPACE TO DUMMY-RECORD
064600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
064700Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
064800Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
064900Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
065000Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
065100Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
065200Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
065300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
065400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
065500Y        MOVE ZERO TO RECORD-COUNT.
065600     PERFORM WRT-LN.
065700 WRT-LN.
065800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
065900     MOVE SPACE TO DUMMY-RECORD.
066000 BLANK-LINE-PRINT.
066100     PERFORM WRT-LN.
066200 FAIL-ROUTINE.
066300     IF     COMPUTED-X NOT EQUAL TO SPACE
066400            GO TO   FAIL-ROUTINE-WRITE.
066500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
066600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
066700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
066800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
066900     MOVE   SPACES TO INF-ANSI-REFERENCE.
067000     GO TO  FAIL-ROUTINE-EX.
067100 FAIL-ROUTINE-WRITE.
067200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
067300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
067400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
067500     MOVE   SPACES TO COR-ANSI-REFERENCE.
067600 FAIL-ROUTINE-EX. EXIT.
067700 BAIL-OUT.
067800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
067900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
068000 BAIL-OUT-WRITE.
068100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
068200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
068300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
068400     MOVE   SPACES TO INF-ANSI-REFERENCE.
068500 BAIL-OUT-EX. EXIT.
068600 CCVS1-EXIT.
068700     EXIT.
068800*
068900 OUTPROC-EXIT SECTION.
069000 EXIT-ONLY.
069100     PERFORM  CLOSE-FILES.
069200*
069300 RETURN-DUPLICATE-RECORDS SECTION.
069400*================================
069500 SORT-INIT-18.
069600     MOVE     "DUPLICATE KEYS" TO FEATURE.
069700*        NOTE THE RECORDS SHOULD BE SORTED INTO THE FOLLOWING
069800*             ORDER OF THE LAST CHARACTER OF THE RECORD:
069900*             ---- 1 2 3 4 5 6 7 8 9 ---
070000 SORT-TEST-18-1.
070100     MOVE    "SORT-TEST-18-1" TO PAR-NAME.
070200     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
070300     IF       SORT-1 = WS-SORTFILE-REC
070400              PERFORM PASS
070500              PERFORM PRINT-DETAIL
070600              GO TO   SORT-TEST-18-2.
070700 SORT-FAIL-18-1.
070800     PERFORM  FAIL.
070900     PERFORM  CHECK-KEYS.
071000 SORT-TEST-18-2.
071100     MOVE    "SORT-TEST-18-2" TO PAR-NAME.
071200     IF       SORT-IDENTIFIER = "1"
071300              PERFORM PASS
071400              PERFORM PRINT-DETAIL
071500              GO TO   SORT-TEST-19-1.
071600 SORT-FAIL-18-2.
071700     PERFORM  FAIL.
071800     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
071900     MOVE    "1" TO CORRECT-X.
072000     PERFORM PRINT-DETAIL.
072100*
072200 SORT-TEST-19-1.
072300     MOVE    "SORT-TEST-19-1" TO PAR-NAME.
072400     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
072500     IF       SORT-1 = WS-SORTFILE-REC
072600              PERFORM PASS
072700              PERFORM PRINT-DETAIL
072800              GO TO   SORT-TEST-19-2.
072900 SORT-FAIL-19-1.
073000     PERFORM  FAIL.
073100     PERFORM  CHECK-KEYS.
073200 SORT-TEST-19-2.
073300     MOVE    "SORT-TEST-19-2" TO PAR-NAME.
073400     IF       SORT-IDENTIFIER = "2"
073500              PERFORM PASS
073600              PERFORM PRINT-DETAIL
073700              GO TO   SORT-TEST-20-1.
073800 SORT-FAIL-19-2.
073900     PERFORM  FAIL.
074000     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
074100     MOVE    "2" TO CORRECT-X.
074200     PERFORM PRINT-DETAIL.
074300*
074400 SORT-TEST-20-1.
074500     MOVE    "SORT-TEST-20-1" TO PAR-NAME.
074600     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
074700     IF       SORT-1 = WS-SORTFILE-REC
074800              PERFORM PASS
074900              PERFORM PRINT-DETAIL
075000              GO TO   SORT-TEST-20-2.
075100 SORT-FAIL-20-1.
075200     PERFORM  FAIL.
075300     PERFORM  CHECK-KEYS.
075400 SORT-TEST-20-2.
075500     MOVE    "SORT-TEST-20-2" TO PAR-NAME.
075600     IF       SORT-IDENTIFIER = "3"
075700              PERFORM PASS
075800              PERFORM PRINT-DETAIL
075900              GO TO   SORT-TEST-21-1.
076000 SORT-FAIL-20-2.
076100     PERFORM  FAIL.
076200     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
076300     MOVE    "3" TO CORRECT-X.
076400     PERFORM PRINT-DETAIL.
076500*
076600 SORT-TEST-21-1.
076700     MOVE    "SORT-TEST-21-1" TO PAR-NAME.
076800     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
076900     IF       SORT-1 = WS-SORTFILE-REC
077000              PERFORM PASS
077100              PERFORM PRINT-DETAIL
077200              GO TO   SORT-TEST-21-2.
077300 SORT-FAIL-21-1.
077400     PERFORM  FAIL.
077500     PERFORM  CHECK-KEYS.
077600 SORT-TEST-21-2.
077700     MOVE    "SORT-TEST-21-2" TO PAR-NAME.
077800     IF       SORT-IDENTIFIER = "4"
077900              PERFORM PASS
078000              PERFORM PRINT-DETAIL
078100              GO TO   SORT-TEST-22-1.
078200 SORT-FAIL-21-2.
078300     PERFORM  FAIL.
078400     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
078500     MOVE    "4" TO CORRECT-X.
078600     PERFORM PRINT-DETAIL.
078700*
078800 SORT-TEST-22-1.
078900     MOVE    "SORT-TEST-22-1" TO PAR-NAME.
079000     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
079100     IF       SORT-1 = WS-SORTFILE-REC
079200              PERFORM PASS
079300              PERFORM PRINT-DETAIL
079400              GO TO   SORT-TEST-22-2.
079500 SORT-FAIL-22-1.
079600     PERFORM  FAIL.
079700     PERFORM  CHECK-KEYS.
079800 SORT-TEST-22-2.
079900     MOVE    "SORT-TEST-22-2" TO PAR-NAME.
080000     IF       SORT-IDENTIFIER = "5"
080100              PERFORM PASS
080200              PERFORM PRINT-DETAIL
080300              GO TO   SORT-TEST-23-1.
080400 SORT-FAIL-22-2.
080500     PERFORM  FAIL.
080600     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
080700     MOVE    "5" TO CORRECT-X.
080800     PERFORM PRINT-DETAIL.
080900*
081000 SORT-TEST-23-1.
081100     MOVE    "SORT-TEST-23-1" TO PAR-NAME.
081200     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
081300     IF       SORT-1 = WS-SORTFILE-REC
081400              PERFORM PASS
081500              PERFORM PRINT-DETAIL
081600              GO TO   SORT-TEST-23-2.
081700 SORT-FAIL-23-1.
081800     PERFORM  FAIL.
081900     PERFORM  CHECK-KEYS.
082000 SORT-TEST-23-2.
082100     MOVE    "SORT-TEST-23-2" TO PAR-NAME.
082200     IF       SORT-IDENTIFIER = "6"
082300              PERFORM PASS
082400              PERFORM PRINT-DETAIL
082500              GO TO   SORT-TEST-24-1.
082600 SORT-FAIL-23-2.
082700     PERFORM  FAIL.
082800     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
082900     MOVE    "6" TO CORRECT-X.
083000     PERFORM PRINT-DETAIL.
083100*
083200 SORT-TEST-24-1.
083300     MOVE    "SORT-TEST-24-1" TO PAR-NAME.
083400     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
083500     IF       SORT-1 = WS-SORTFILE-REC
083600              PERFORM PASS
083700              PERFORM PRINT-DETAIL
083800              GO TO   SORT-TEST-24-2.
083900 SORT-FAIL-24-1.
084000     PERFORM  FAIL.
084100     PERFORM  CHECK-KEYS.
084200 SORT-TEST-24-2.
084300     MOVE    "SORT-TEST-24-2" TO PAR-NAME.
084400     IF       SORT-IDENTIFIER = "7"
084500              PERFORM PASS
084600              PERFORM PRINT-DETAIL
084700              GO TO   SORT-TEST-25-1.
084800 SORT-FAIL-24-2.
084900     PERFORM  FAIL.
085000     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
085100     MOVE    "7" TO CORRECT-X.
085200     PERFORM PRINT-DETAIL.
085300*
085400 SORT-TEST-25-1.
085500     MOVE    "SORT-TEST-25-1" TO PAR-NAME.
085600     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
085700     IF       SORT-1 = WS-SORTFILE-REC
085800              PERFORM PASS
085900              PERFORM PRINT-DETAIL
086000              GO TO   SORT-TEST-25-2.
086100 SORT-FAIL-25-1.
086200     PERFORM  FAIL.
086300     PERFORM  CHECK-KEYS.
086400 SORT-TEST-25-2.
086500     MOVE    "SORT-TEST-25-2" TO PAR-NAME.
086600     IF       SORT-IDENTIFIER = "8"
086700              PERFORM PASS
086800              PERFORM PRINT-DETAIL
086900              GO TO   SORT-TEST-26-1.
087000 SORT-FAIL-25-2.
087100     PERFORM  FAIL.
087200     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
087300     MOVE    "8" TO CORRECT-X.
087400     PERFORM PRINT-DETAIL.
087500*
087600 SORT-TEST-26-1.
087700     MOVE    "SORT-TEST-26-1" TO PAR-NAME.
087800     RETURN   SORTFILE-1H AT END GO TO RETURN-ERROR.
087900     IF       SORT-1 = WS-SORTFILE-REC
088000              PERFORM PASS
088100              PERFORM PRINT-DETAIL
088200              GO TO   SORT-TEST-26-2.
088300 SORT-FAIL-26-1.
088400     PERFORM  FAIL.
088500     PERFORM  CHECK-KEYS.
088600 SORT-TEST-26-2.
088700     MOVE    "SORT-TEST-26-2" TO PAR-NAME.
088800     IF       SORT-IDENTIFIER = "9"
088900              PERFORM PASS
089000              PERFORM PRINT-DETAIL
089100              GO TO   DUPLICATE-RECORD-EXIT.
089200 SORT-FAIL-26-2.
089300     PERFORM  FAIL.
089400     MOVE     SORT-IDENTIFIER TO COMPUTED-X.
089500     MOVE    "9" TO CORRECT-X.
089600     PERFORM PRINT-DETAIL.
089700
089800*
089900 DUPLICATE-RECORD-EXIT.
090000     EXIT.
090100*
090200*
090300 CHECK-KEYS SECTION.
090400*==================
090500 CHK-TEST-1.
090600     MOVE    "CHK-TEST-1" TO PAR-NAME.
090700     IF       SORTKEY-1 = WS-1
090800              PERFORM PASS
090900              PERFORM PRINT-DETAIL
091000              GO TO   CHK-TEST-2.
091100 CHK-FAIL-1.
091200     PERFORM  FAIL.
091300     MOVE     SORTKEY-1 TO COMPUTED-N.
091400     MOVE     WS-1      TO CORRECT-N.
091500     PERFORM PRINT-DETAIL.
091600*
091700 CHK-TEST-2.
091800     MOVE    "CHK-TEST-2" TO PAR-NAME.
091900     IF       SORTKEY-2 = WS-2
092000              PERFORM PASS
092100              PERFORM PRINT-DETAIL
092200              GO TO   CHK-TEST-3.
092300 CHK-FAIL-2.
092400     PERFORM  FAIL.
092500     MOVE     SORTKEY-1 TO COMPUTED-N.
092600     MOVE     WS-1      TO CORRECT-N.
092700     PERFORM PRINT-DETAIL.
092800*
092900 CHK-TEST-3.
093000     MOVE    "CHK-TEST-3" TO PAR-NAME.
093100     IF       SORTKEY-3 = WS-3
093200              PERFORM PASS
093300              PERFORM PRINT-DETAIL
093400              GO TO   CHK-TEST-4.
093500 CHK-FAIL-3.
093600     PERFORM  FAIL.
093700     MOVE     SORTKEY-3 TO COMPUTED-X.
093800     MOVE     WS-1      TO CORRECT-X.
093900     PERFORM PRINT-DETAIL.
094000*
094100 CHK-TEST-4.
094200     MOVE    "CHK-TEST-4" TO PAR-NAME.
094300     IF       SORTKEY-4 = WS-4
094400              PERFORM PASS
094500              PERFORM PRINT-DETAIL
094600              GO TO   CHK-TEST-5.
094700 CHK-FAIL-4.
094800     PERFORM  FAIL.
094900     MOVE     SORTKEY-4 TO COMPUTED-X.
095000     MOVE     WS-4      TO CORRECT-X.
095100     PERFORM PRINT-DETAIL.
095200
095300 CHK-TEST-5.
095400     MOVE    "CHK-TEST-5" TO PAR-NAME.
095500     IF       SORTKEY-5 = WS-5
095600              PERFORM PASS
095700              PERFORM PRINT-DETAIL
095800              GO TO   CHK-TEST-6.
095900 CHK-FAIL-5.
096000     PERFORM  FAIL.
096100     MOVE     SORTKEY-5 TO COMPUTED-X.
096200     MOVE     WS-5      TO CORRECT-X.
096300     PERFORM PRINT-DETAIL.
096400*
096500 CHK-TEST-6.
096600     MOVE    "CHK-TEST-6" TO PAR-NAME.
096700     IF       SORTKEY-6 = WS-6
096800              PERFORM PASS
096900              PERFORM PRINT-DETAIL
097000              GO TO   CHK-TEST-7.
097100 CHK-FAIL-6.
097200     PERFORM  FAIL.
097300     MOVE     SORTKEY-6 TO COMPUTED-X.
097400     MOVE     WS-6      TO CORRECT-X.
097500     PERFORM PRINT-DETAIL.
097600*
097700 CHK-TEST-7.
097800     MOVE    "CHK-TEST-7" TO PAR-NAME.
097900     IF       SORTKEY-7 = WS-7
098000              PERFORM PASS
098100              PERFORM PRINT-DETAIL
098200              GO TO   CHK-TEST-8.
098300 CHK-FAIL-7.
098400     PERFORM  FAIL.
098500     MOVE     SORTKEY-7 TO COMPUTED-X.
098600     MOVE     WS-7      TO CORRECT-X.
098700     PERFORM PRINT-DETAIL.
098800*
098900 CHK-TEST-8.
099000     MOVE    "CHK-TEST-8" TO PAR-NAME.
099100     IF       SORTKEY-8 = WS-8
099200              PERFORM PASS
099300              PERFORM PRINT-DETAIL
099400              GO TO   CHECK-KEYS-EXIT.
099500 CHK-FAIL-8.
099600     PERFORM  FAIL.
099700     MOVE     SORTKEY-8 TO COMPUTED-N.
099800     MOVE     WS-8      TO CORRECT-N.
099900     PERFORM PRINT-DETAIL.
100000 CHECK-KEYS-EXIT.
100100     EXIT.
