000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST126A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-01                                                  *
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-69                                                  *
001900*        X-74                                                  *
002000*        X-75                                                  *
002100*        X-82  - SOURCE COMPUTER NAME.                         *
002200*        X-83  - OBJECT COMPUTER NAME.                         *
002300*                                                              *
002400****************************************************************
002500*                                                              *
002600*    PROGRAM ST126A VERIFIES THE CONTENT OF THE THREE FILES    *
002700*    PRODUCED BY ST125A.                                       *
002800*                                                              *
002900****************************************************************
003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.
003300     XXXXX082.
003400 OBJECT-COMPUTER.
003500     XXXXX083.
003600 INPUT-OUTPUT SECTION.
003700 FILE-CONTROL.
003800     SELECT PRINT-FILE ASSIGN TO
003900     XXXXX055.
004000     SELECT   SORTIN-1G ASSIGN TO
004100     XXXXD001.
004200     SELECT   SORTIN-2G ASSIGN TO
004300     XXXXD002.
004400     SELECT   SORTIN-3G ASSIGN TO
004500     XXXXD003.
004600 DATA DIVISION.
004700 FILE SECTION.
004800 FD  PRINT-FILE.
004900 01  PRINT-REC PICTURE X(120).
005000 01  DUMMY-RECORD PICTURE X(120).
005100 FD  SORTIN-1G
005200     LABEL RECORDS STANDARD
005300C    VALUE OF
005400C    XXXXX074
005500C    IS
005600C    XXXXX075
005700G    XXXXX069
005800     RECORD   CONTAINS 27 CHARACTERS.
005900 01  SORTIN-REC-1.
006000     02 SORTKEY-3-1     PICTURE X.
006100     02 SORTKEY-1-1     PICTURE S9V9(7).
006200     02 SORTKEY-2-1     PICTURE 9(18).
006300 FD  SORTIN-2G
006400     LABEL RECORDS STANDARD
006500C    VALUE OF
006600C    XXXXX074
006700C    IS
006800C    XXXXX075
006900G    XXXXX069
007000     RECORD   CONTAINS 27 CHARACTERS.
007100 01  SORTIN-REC-2.
007200     02 SORTKEY-3-2     PICTURE X.
007300     02 SORTKEY-1-2     PICTURE S9V9(7).
007400     02 SORTKEY-2-2     PICTURE 9(18).
007500 FD  SORTIN-3G
007600     LABEL RECORDS STANDARD
007700C    VALUE OF
007800C    XXXXX074
007900C    IS
008000C    XXXXX075
008100G    XXXXX069
008200     RECORD   CONTAINS 27 CHARACTERS.
008300 01  SORTIN-REC-3.
008400     02 SORTKEY-3-3     PICTURE X.
008500     02 SORTKEY-1-3     PICTURE S9V9(7).
008600     02 SORTKEY-2-3     PICTURE 9(18).
008700 WORKING-STORAGE SECTION.
008800 77  UTIL-CTR           PICTURE S99999 VALUE ZERO.
008900 77  ITEM-3   PICTURE X(27) VALUE "FIRST OF 3 ITEMS IN RECORD ".
009000 77  ITEM-1   PICTURE X(27) VALUE "  SECOND OF 3 ITEMS        ".
009100 77  ITEM-2   PICTURE X(27) VALUE "    THIRD OF 3 ITEMS       ".
009200 77  DUM-MY   PICTURE X(27) VALUE "TEST UNNECESSARY - BYPASSED".
009300 77  ZER-O              PICTURE X VALUE "0".
009400 77  SPAC-E             PICTURE X VALUE " ".
009500 01  UTILITY-KEYS.
009600     02 UTILITY-3       PICTURE X.
009700     02 UTILITY-1       PICTURE S9V9(7).
009800     02 UTILITY-2       PICTURE 9(018).
009900 01  TEST-RESULTS.
010000     02 FILLER                   PIC X      VALUE SPACE.
010100     02 FEATURE                  PIC X(20)  VALUE SPACE.
010200     02 FILLER                   PIC X      VALUE SPACE.
010300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
010400     02 FILLER                   PIC X      VALUE SPACE.
010500     02  PAR-NAME.
010600       03 FILLER                 PIC X(19)  VALUE SPACE.
010700       03  PARDOT-X              PIC X      VALUE SPACE.
010800       03 DOTVALUE               PIC 99     VALUE ZERO.
010900     02 FILLER                   PIC X(8)   VALUE SPACE.
011000     02 RE-MARK                  PIC X(61).
011100 01  TEST-COMPUTED.
011200     02 FILLER                   PIC X(30)  VALUE SPACE.
011300     02 FILLER                   PIC X(17)  VALUE
011400            "       COMPUTED=".
011500     02 COMPUTED-X.
011600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
011700     03 COMPUTED-N               REDEFINES COMPUTED-A
011800                                 PIC -9(9).9(9).
011900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
012000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
012100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
012200     03       CM-18V0 REDEFINES COMPUTED-A.
012300         04 COMPUTED-18V0                    PIC -9(18).
012400         04 FILLER                           PIC X.
012500     03 FILLER PIC X(50) VALUE SPACE.
012600 01  TEST-CORRECT.
012700     02 FILLER PIC X(30) VALUE SPACE.
012800     02 FILLER PIC X(17) VALUE "       CORRECT =".
012900     02 CORRECT-X.
013000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
013100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
013200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
013300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
013400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
013500     03      CR-18V0 REDEFINES CORRECT-A.
013600         04 CORRECT-18V0                     PIC -9(18).
013700         04 FILLER                           PIC X.
013800     03 FILLER PIC X(2) VALUE SPACE.
013900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
014000 01  CCVS-C-1.
014100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
014200-    "SS  PARAGRAPH-NAME
014300-    "       REMARKS".
014400     02 FILLER                     PIC X(20)    VALUE SPACE.
014500 01  CCVS-C-2.
014600     02 FILLER                     PIC X        VALUE SPACE.
014700     02 FILLER                     PIC X(6)     VALUE "TESTED".
014800     02 FILLER                     PIC X(15)    VALUE SPACE.
014900     02 FILLER                     PIC X(4)     VALUE "FAIL".
015000     02 FILLER                     PIC X(94)    VALUE SPACE.
015100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
015200 01  REC-CT                        PIC 99       VALUE ZERO.
015300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
015400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
015500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
015600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
015700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
015800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
015900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
016000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
016100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
016200 01  CCVS-H-1.
016300     02  FILLER                    PIC X(39)    VALUE SPACES.
016400     02  FILLER                    PIC X(42)    VALUE
016500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
016600     02  FILLER                    PIC X(39)    VALUE SPACES.
016700 01  CCVS-H-2A.
016800   02  FILLER                        PIC X(40)  VALUE SPACE.
016900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
017000   02  FILLER                        PIC XXXX   VALUE
017100     "4.2 ".
017200   02  FILLER                        PIC X(28)  VALUE
017300            " COPY - NOT FOR DISTRIBUTION".
017400   02  FILLER                        PIC X(41)  VALUE SPACE.
017500
017600 01  CCVS-H-2B.
017700   02  FILLER                        PIC X(15)  VALUE
017800            "TEST RESULT OF ".
017900   02  TEST-ID                       PIC X(9).
018000   02  FILLER                        PIC X(4)   VALUE
018100            " IN ".
018200   02  FILLER                        PIC X(12)  VALUE
018300     " HIGH       ".
018400   02  FILLER                        PIC X(22)  VALUE
018500            " LEVEL VALIDATION FOR ".
018600   02  FILLER                        PIC X(58)  VALUE
018700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
018800 01  CCVS-H-3.
018900     02  FILLER                      PIC X(34)  VALUE
019000            " FOR OFFICIAL USE ONLY    ".
019100     02  FILLER                      PIC X(58)  VALUE
019200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
019300     02  FILLER                      PIC X(28)  VALUE
019400            "  COPYRIGHT   1985 ".
019500 01  CCVS-E-1.
019600     02 FILLER                       PIC X(52)  VALUE SPACE.
019700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
019800     02 ID-AGAIN                     PIC X(9).
019900     02 FILLER                       PIC X(45)  VALUE SPACES.
020000 01  CCVS-E-2.
020100     02  FILLER                      PIC X(31)  VALUE SPACE.
020200     02  FILLER                      PIC X(21)  VALUE SPACE.
020300     02 CCVS-E-2-2.
020400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
020500         03 FILLER                   PIC X      VALUE SPACE.
020600         03 ENDER-DESC               PIC X(44)  VALUE
020700            "ERRORS ENCOUNTERED".
020800 01  CCVS-E-3.
020900     02  FILLER                      PIC X(22)  VALUE
021000            " FOR OFFICIAL USE ONLY".
021100     02  FILLER                      PIC X(12)  VALUE SPACE.
021200     02  FILLER                      PIC X(58)  VALUE
021300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
021400     02  FILLER                      PIC X(13)  VALUE SPACE.
021500     02 FILLER                       PIC X(15)  VALUE
021600             " COPYRIGHT 1985".
021700 01  CCVS-E-4.
021800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
021900     02 FILLER                       PIC X(4)   VALUE " OF ".
022000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
022100     02 FILLER                       PIC X(40)  VALUE
022200      "  TESTS WERE EXECUTED SUCCESSFULLY".
022300 01  XXINFO.
022400     02 FILLER                       PIC X(19)  VALUE
022500            "*** INFORMATION ***".
022600     02 INFO-TEXT.
022700       04 FILLER                     PIC X(8)   VALUE SPACE.
022800       04 XXCOMPUTED                 PIC X(20).
022900       04 FILLER                     PIC X(5)   VALUE SPACE.
023000       04 XXCORRECT                  PIC X(20).
023100     02 INF-ANSI-REFERENCE           PIC X(48).
023200 01  HYPHEN-LINE.
023300     02 FILLER  PIC IS X VALUE IS SPACE.
023400     02 FILLER  PIC IS X(65)    VALUE IS "************************
023500-    "*****************************************".
023600     02 FILLER  PIC IS X(54)    VALUE IS "************************
023700-    "******************************".
023800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
023900     "ST126A".
024000 PROCEDURE DIVISION.
024100 CCVS1 SECTION.
024200 OPEN-FILES.
024300     OPEN     OUTPUT PRINT-FILE.
024400     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
024500     MOVE    SPACE TO TEST-RESULTS.
024600     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
024700     GO TO CCVS1-EXIT.
024800 CLOSE-FILES.
024900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
025000 TERMINATE-CCVS.
025100S    EXIT PROGRAM.
025200STERMINATE-CALL.
025300     STOP     RUN.
025400 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
025500 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
025600 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
025700 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
025800     MOVE "****TEST DELETED****" TO RE-MARK.
025900 PRINT-DETAIL.
026000     IF REC-CT NOT EQUAL TO ZERO
026100             MOVE "." TO PARDOT-X
026200             MOVE REC-CT TO DOTVALUE.
026300     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
026400     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
026500        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
026600          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
026700     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
026800     MOVE SPACE TO CORRECT-X.
026900     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
027000     MOVE     SPACE TO RE-MARK.
027100 HEAD-ROUTINE.
027200     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027300     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027400     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
027500     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
027600 COLUMN-NAMES-ROUTINE.
027700     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
027800     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
027900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
028000 END-ROUTINE.
028100     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
028200 END-RTN-EXIT.
028300     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028400 END-ROUTINE-1.
028500      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
028600      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
028700      ADD PASS-COUNTER TO ERROR-HOLD.
028800*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
028900      MOVE PASS-COUNTER TO CCVS-E-4-1.
029000      MOVE ERROR-HOLD TO CCVS-E-4-2.
029100      MOVE CCVS-E-4 TO CCVS-E-2-2.
029200      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
029300  END-ROUTINE-12.
029400      MOVE "TEST(S) FAILED" TO ENDER-DESC.
029500     IF       ERROR-COUNTER IS EQUAL TO ZERO
029600         MOVE "NO " TO ERROR-TOTAL
029700         ELSE
029800         MOVE ERROR-COUNTER TO ERROR-TOTAL.
029900     MOVE     CCVS-E-2 TO DUMMY-RECORD.
030000     PERFORM WRITE-LINE.
030100 END-ROUTINE-13.
030200     IF DELETE-COUNTER IS EQUAL TO ZERO
030300         MOVE "NO " TO ERROR-TOTAL  ELSE
030400         MOVE DELETE-COUNTER TO ERROR-TOTAL.
030500     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
030600     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
030700      IF   INSPECT-COUNTER EQUAL TO ZERO
030800          MOVE "NO " TO ERROR-TOTAL
030900      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
031000      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
031100      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031200     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031300 WRITE-LINE.
031400     ADD 1 TO RECORD-COUNT.
031500Y    IF RECORD-COUNT GREATER 42
031600Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
031700Y        MOVE SPACE TO DUMMY-RECORD
031800Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
031900Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
032000Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
032100Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
032200Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
032300Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
032400Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
032500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
032600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
032700Y        MOVE ZERO TO RECORD-COUNT.
032800     PERFORM WRT-LN.
032900 WRT-LN.
033000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
033100     MOVE SPACE TO DUMMY-RECORD.
033200 BLANK-LINE-PRINT.
033300     PERFORM WRT-LN.
033400 FAIL-ROUTINE.
033500     IF     COMPUTED-X NOT EQUAL TO SPACE
033600            GO TO   FAIL-ROUTINE-WRITE.
033700     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
033800     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
033900     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
034000     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034100     MOVE   SPACES TO INF-ANSI-REFERENCE.
034200     GO TO  FAIL-ROUTINE-EX.
034300 FAIL-ROUTINE-WRITE.
034400     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
034500     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
034600     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
034700     MOVE   SPACES TO COR-ANSI-REFERENCE.
034800 FAIL-ROUTINE-EX. EXIT.
034900 BAIL-OUT.
035000     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
035100     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
035200 BAIL-OUT-WRITE.
035300     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
035400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
035500     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035600     MOVE   SPACES TO INF-ANSI-REFERENCE.
035700 BAIL-OUT-EX. EXIT.
035800 CCVS1-EXIT.
035900     EXIT.
036000 ST126A-001-01.
036100     MOVE   "XI-20 4.4.4 GR(12)" TO ANSI-REFERENCE.
036200     OPEN    INPUT SORTIN-1G.
036300     OPEN    INPUT SORTIN-2G.
036400     OPEN    INPUT SORTIN-3G.
036500     MOVE     "SORT, MIXED CLASSES" TO FEATURE.
036600     IF       ZER-O IS LESS THAN SPAC-E
036700              GO TO ZERO-IS-LESS-THAN-SPACE.
036800 SPACE-IS-LESS-THAN-ZERO SECTION.
036900 SORT-INIT-A.
037000     MOVE     +0.0000001 TO UTILITY-1.
037100     MOVE     999999999999999999 TO UTILITY-2.
037200     MOVE     SPACE TO UTILITY-3.
037300 SORT-TEST-1.
037400     PERFORM  READ-SORTIN.
037500     MOVE     "SORT-TEST-1" TO PAR-NAME.
037600     IF       SORTIN-REC-1 EQUAL TO UTILITY-KEYS
037700              PERFORM PASS GO TO SORT-WRITE-1.
037800 SORT-FAIL-1.
037900     MOVE     SORTKEY-3-1 TO COMPUTED-A.
038000     MOVE     UTILITY-3 TO CORRECT-A.
038100     MOVE     ITEM-3    TO RE-MARK.
038200     PERFORM  PRINT-DETAIL.
038300     MOVE     SORTKEY-1-1 TO COMPUTED-4V14.
038400     MOVE     UTILITY-1 TO CORRECT-4V14.
038500     MOVE     ITEM-1    TO RE-MARK.
038600     PERFORM  PRINT-DETAIL.
038700     MOVE     SORTKEY-2-1 TO COMPUTED-18V0.
038800     MOVE     UTILITY-2 TO CORRECT-18V0.
038900     MOVE     ITEM-2    TO RE-MARK.
039000     PERFORM  FAIL.
039100 SORT-WRITE-1.
039200     PERFORM  PRINT-DETAIL.
039300 SORT-INIT-B.
039400     MOVE     ZERO TO UTILITY-3.
039500     PERFORM  READ-SORTIN 4 TIMES.
039600*        NOTE SORT-TEST-2 CHECKS THE SIXTH RECORD IN THE FILE.
039700 SORT-TEST-2.
039800     PERFORM  READ-SORTIN.
039900     MOVE     "SORT-TEST-2" TO PAR-NAME.
040000     IF       SORTIN-REC-1 EQUAL TO UTILITY-KEYS
040100              PERFORM PASS GO TO SORT-WRITE-2.
040200 SORT-FAIL-2.
040300     MOVE     SORTKEY-3-1 TO COMPUTED-A.
040400     MOVE     UTILITY-3 TO CORRECT-A.
040500     MOVE     ITEM-3    TO RE-MARK.
040600     PERFORM  PRINT-DETAIL.
040700     MOVE     SORTKEY-1-1 TO COMPUTED-4V14.
040800     MOVE     UTILITY-1 TO CORRECT-4V14.
040900     MOVE     ITEM-1    TO RE-MARK.
041000     PERFORM  PRINT-DETAIL.
041100     MOVE     SORTKEY-2-1 TO COMPUTED-18V0.
041200     MOVE     UTILITY-2 TO CORRECT-18V0.
041300     MOVE     ITEM-2    TO RE-MARK.
041400     PERFORM  FAIL.
041500 SORT-WRITE-2.
041600     PERFORM  PRINT-DETAIL.
041700 DUMMY-3-AND-4.
041800     MOVE     "SORT-TEST-3" TO PAR-NAME.
041900     MOVE     DUM-MY TO RE-MARK.
042000     PERFORM  PRINT-DETAIL.
042100     MOVE     "SORT-TEST-4" TO PAR-NAME.
042200     MOVE     DUM-MY TO RE-MARK.
042300     PERFORM  PRINT-DETAIL.
042400     GO       TO CONTINUE-TESTING.
042500 ZERO-IS-LESS-THAN-SPACE SECTION.
042600 SORT-INIT-C.
042700     MOVE     +0.0000001 TO UTILITY-1.
042800     MOVE     999999999999999999 TO UTILITY-2.
042900     MOVE     ZERO TO UTILITY-3.
043000 DUMMY-1-AND-2.
043100     MOVE     "SORT-TEST-1" TO PAR-NAME.
043200     MOVE     DUM-MY TO RE-MARK.
043300     PERFORM  PRINT-DETAIL.
043400     MOVE     "SORT-TEST-2" TO PAR-NAME.
043500     MOVE     DUM-MY TO RE-MARK.
043600     PERFORM  PRINT-DETAIL.
043700 SORT-TEST-3.
043800     PERFORM  READ-SORTIN.
043900     MOVE     "SORT-TEST-3" TO PAR-NAME.
044000     IF       SORTIN-REC-1 EQUAL TO UTILITY-KEYS
044100              PERFORM PASS GO TO SORT-WRITE-3.
044200 SORT-FAIL-3.
044300     MOVE     SORTKEY-3-1 TO COMPUTED-A.
044400     MOVE     UTILITY-3 TO CORRECT-A.
044500     MOVE     ITEM-3    TO RE-MARK.
044600     PERFORM  PRINT-DETAIL.
044700     MOVE     SORTKEY-1-1 TO COMPUTED-4V14.
044800     MOVE     UTILITY-1 TO CORRECT-4V14.
044900     MOVE     ITEM-1    TO RE-MARK.
045000     PERFORM  PRINT-DETAIL.
045100     MOVE     SORTKEY-2-1 TO COMPUTED-18V0.
045200     MOVE     UTILITY-2 TO CORRECT-18V0.
045300     MOVE     ITEM-2    TO RE-MARK.
045400     PERFORM  FAIL.
045500 SORT-WRITE-3.
045600     PERFORM  PRINT-DETAIL.
045700 SORT-INIT-D.
045800     PERFORM  READ-SORTIN 4 TIMES.
045900     MOVE     SPACE TO UTILITY-3.
046000*        NOTE SORT-TEST-4 CHECKS THE SIXTH RECORD IN THE FILE.
046100 SORT-TEST-4.
046200     PERFORM  READ-SORTIN.
046300     MOVE     "SORT-TEST-4" TO PAR-NAME.
046400     IF       SORTIN-REC-1 EQUAL TO UTILITY-KEYS
046500              PERFORM PASS GO TO SORT-WRITE-4.
046600 SORT-FAIL-4.
046700     MOVE     SORTKEY-3-1 TO COMPUTED-A.
046800     MOVE     UTILITY-3 TO CORRECT-A.
046900     MOVE     ITEM-3    TO RE-MARK.
047000     PERFORM  PRINT-DETAIL.
047100     MOVE     SORTKEY-1-1 TO COMPUTED-4V14.
047200     MOVE     UTILITY-1 TO CORRECT-4V14.
047300     MOVE     ITEM-1    TO RE-MARK.
047400     PERFORM  PRINT-DETAIL.
047500     MOVE     SORTKEY-2-1 TO COMPUTED-18V0.
047600     MOVE     UTILITY-2 TO CORRECT-18V0.
047700     MOVE     ITEM-2    TO RE-MARK.
047800     PERFORM  FAIL.
047900 SORT-WRITE-4.
048000     PERFORM  PRINT-DETAIL.
048100 CONTINUE-TESTING SECTION.
048200 SORT-INIT-E.
048300     MOVE     +1.1111112 TO UTILITY-1.
048400     MOVE     SPACE TO UTILITY-3.
048500*        NOTE SORT-TEST-5 CHECKS THE SEVENTH RECORD IN THE FILE.
048600 SORT-TEST-5.
048700     PERFORM  READ-SORTIN.
048800     MOVE     "SORT-TEST-5" TO PAR-NAME.
048900     IF       SORTIN-REC-1 EQUAL TO UTILITY-KEYS
049000              PERFORM PASS GO TO SORT-WRITE-5.
049100 SORT-FAIL-5.
049200     MOVE     SORTKEY-3-1 TO COMPUTED-A.
049300     MOVE     UTILITY-3 TO CORRECT-A.
049400     MOVE     ITEM-3    TO RE-MARK.
049500     PERFORM  PRINT-DETAIL.
049600     MOVE     SORTKEY-1-1 TO COMPUTED-4V14.
049700     MOVE     UTILITY-1 TO CORRECT-4V14.
049800     MOVE     ITEM-1    TO RE-MARK.
049900     PERFORM  PRINT-DETAIL.
050000     MOVE     SORTKEY-2-1 TO COMPUTED-18V0.
050100     MOVE     UTILITY-2 TO CORRECT-18V0.
050200     MOVE     ITEM-2    TO RE-MARK.
050300     PERFORM  FAIL.
050400 SORT-WRITE-5.
050500     PERFORM  PRINT-DETAIL.
050600 SORT-INIT-F.
050700     PERFORM  READ-SORTIN.
050800     MOVE     888888888888888888 TO UTILITY-2.
050900*        NOTE SORT-TEST-6 CHECKS THE NINTH RECORD IN THE FILE.
051000 SORT-TEST-6.
051100     PERFORM  READ-SORTIN.
051200     MOVE     "SORT-TEST-6" TO PAR-NAME.
051300     IF       SORTIN-REC-1 EQUAL TO UTILITY-KEYS
051400              PERFORM PASS GO TO SORT-WRITE-6.
051500 SORT-FAIL-6.
051600     MOVE     SORTKEY-3-1 TO COMPUTED-A.
051700     MOVE     UTILITY-3 TO CORRECT-A.
051800     MOVE     ITEM-3    TO RE-MARK.
051900     PERFORM  PRINT-DETAIL.
052000     MOVE     SORTKEY-1-1 TO COMPUTED-4V14.
052100     MOVE     UTILITY-1 TO CORRECT-4V14.
052200     MOVE     ITEM-1    TO RE-MARK.
052300     PERFORM  PRINT-DETAIL.
052400     MOVE     SORTKEY-2-1 TO COMPUTED-18V0.
052500     MOVE     UTILITY-2 TO CORRECT-18V0.
052600     MOVE     ITEM-2    TO RE-MARK.
052700     PERFORM  FAIL.
052800 SORT-WRITE-6.
052900     PERFORM  PRINT-DETAIL.
053000 SORT-TEST-7.
053100     READ     SORTIN-1G AT END
053200              PERFORM PASS GO TO SORT-WRITE-7.
053300 SORT-FAIL-7.
053400     MOVE     SORTKEY-3-1 TO COMPUTED-A.
053500     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
053600     PERFORM  FAIL.
053700 SORT-WRITE-7.
053800     MOVE     "SORT-TEST-7" TO PAR-NAME.
053900     PERFORM  PRINT-DETAIL.
054000 SORT-TEST-8.
054100     IF       UTIL-CTR EQUAL TO 9
054200              PERFORM PASS GO TO SORT-WRITE-8.
054300 SORT-FAIL-8.
054400     MOVE     UTIL-CTR TO COMPUTED-4V14.
054500     MOVE     9 TO CORRECT-4V14.
054600     PERFORM  FAIL.
054700 SORT-WRITE-8.
054800     MOVE     "SORT-TEST-8" TO PAR-NAME.
054900     PERFORM  PRINT-DETAIL.
055000     CLOSE    SORTIN-1G.
055100     GO TO    ST126A-001-02.
055200 READ-SORTIN.
055300     READ     SORTIN-1G AT END GO TO READ-ERROR.
055400     ADD      1 TO UTIL-CTR.
055500 READ-ERROR.
055600     MOVE     "READ-ERROR" TO PAR-NAME.
055700     MOVE     "EOF PREMATURELY FOUND" TO RE-MARK.
055800     PERFORM  FAIL.
055900     PERFORM  PRINT-DETAIL.
056000*
056100*
056200 ST126A-001-02.
056300     MOVE     "SORT, MIXED CLASSES" TO FEATURE.
056400     MOVE     ZERO TO UTIL-CTR.
056500     IF       ZER-O IS LESS THAN SPAC-E
056600              GO TO ZERO-IS-LESS-THAN-SPACE-2.
056700 SPACE-IS-LESS-THAN-ZERO-2 SECTION.
056800 SORT-INIT-A-2.
056900     MOVE     +0.0000001 TO UTILITY-1.
057000     MOVE     999999999999999999 TO UTILITY-2.
057100     MOVE     SPACE TO UTILITY-3.
057200 SORT-TEST-1-2.
057300     PERFORM  READ-SORTIN-2.
057400     MOVE     "SORT-TEST-1-2" TO PAR-NAME.
057500     IF       SORTIN-REC-2 EQUAL TO UTILITY-KEYS
057600              PERFORM PASS GO TO SORT-WRITE-1-2.
057700 SORT-FAIL-1-2.
057800     MOVE     SORTKEY-3-2 TO COMPUTED-A.
057900     MOVE     UTILITY-3 TO CORRECT-A.
058000     MOVE     ITEM-3    TO RE-MARK.
058100     PERFORM  PRINT-DETAIL.
058200     MOVE     SORTKEY-1-2 TO COMPUTED-4V14.
058300     MOVE     UTILITY-1 TO CORRECT-4V14.
058400     MOVE     ITEM-1    TO RE-MARK.
058500     PERFORM  PRINT-DETAIL.
058600     MOVE     SORTKEY-2-2 TO COMPUTED-18V0.
058700     MOVE     UTILITY-2 TO CORRECT-18V0.
058800     MOVE     ITEM-2    TO RE-MARK.
058900     PERFORM  FAIL.
059000 SORT-WRITE-1-2.
059100     PERFORM  PRINT-DETAIL.
059200 SORT-INIT-B-2.
059300     MOVE     ZERO TO UTILITY-3.
059400     PERFORM  READ-SORTIN-2 4 TIMES.
059500*        NOTE SORT-TEST-2-2 CHECKS THE 6TH RECORD IN THE FILE.
059600 SORT-TEST-2-2.
059700     PERFORM  READ-SORTIN-2.
059800     MOVE     "SORT-TEST-2-2" TO PAR-NAME.
059900     IF       SORTIN-REC-2 EQUAL TO UTILITY-KEYS
060000              PERFORM PASS GO TO SORT-WRITE-2-2.
060100 SORT-FAIL-2-2.
060200     MOVE     SORTKEY-3-2 TO COMPUTED-A.
060300     MOVE     UTILITY-3 TO CORRECT-A.
060400     MOVE     ITEM-3    TO RE-MARK.
060500     PERFORM  PRINT-DETAIL.
060600     MOVE     SORTKEY-1-2 TO COMPUTED-4V14.
060700     MOVE     UTILITY-1 TO CORRECT-4V14.
060800     MOVE     ITEM-1    TO RE-MARK.
060900     PERFORM  PRINT-DETAIL.
061000     MOVE     SORTKEY-2-2 TO COMPUTED-18V0.
061100     MOVE     UTILITY-2 TO CORRECT-18V0.
061200     MOVE     ITEM-2    TO RE-MARK.
061300     PERFORM  FAIL.
061400 SORT-WRITE-2-2.
061500     PERFORM  PRINT-DETAIL.
061600 DUMMY-3-AND-4-2.
061700     MOVE     "SORT-TEST-3-2" TO PAR-NAME.
061800     MOVE     DUM-MY TO RE-MARK.
061900     PERFORM  PRINT-DETAIL.
062000     MOVE     "SORT-TEST-4-2" TO PAR-NAME.
062100     MOVE     DUM-MY TO RE-MARK.
062200     PERFORM  PRINT-DETAIL.
062300     GO       TO CONTINUE-TESTING-2.
062400 ZERO-IS-LESS-THAN-SPACE-2 SECTION.
062500 SORT-INIT-C-2.
062600     MOVE     +0.0000001 TO UTILITY-1.
062700     MOVE     999999999999999999 TO UTILITY-2.
062800     MOVE     ZERO TO UTILITY-3.
062900 DUMMY-1-AND-2-2.
063000     MOVE     "SORT-TEST-1-2" TO PAR-NAME.
063100     MOVE     DUM-MY TO RE-MARK.
063200     PERFORM  PRINT-DETAIL.
063300     MOVE     "SORT-TEST-2-2" TO PAR-NAME.
063400     MOVE     DUM-MY TO RE-MARK.
063500     PERFORM  PRINT-DETAIL.
063600 SORT-TEST-3-2.
063700     PERFORM  READ-SORTIN-2.
063800     MOVE     "SORT-TEST-3-2" TO PAR-NAME.
063900     IF       SORTIN-REC-2 EQUAL TO UTILITY-KEYS
064000              PERFORM PASS GO TO SORT-WRITE-3-2.
064100 SORT-FAIL-3-2.
064200     MOVE     SORTKEY-3-2 TO COMPUTED-A.
064300     MOVE     UTILITY-3 TO CORRECT-A.
064400     MOVE     ITEM-3    TO RE-MARK.
064500     PERFORM  PRINT-DETAIL.
064600     MOVE     SORTKEY-1-2 TO COMPUTED-4V14.
064700     MOVE     UTILITY-1 TO CORRECT-4V14.
064800     MOVE     ITEM-1    TO RE-MARK.
064900     PERFORM  PRINT-DETAIL.
065000     MOVE     SORTKEY-2-2 TO COMPUTED-18V0.
065100     MOVE     UTILITY-2 TO CORRECT-18V0.
065200     MOVE     ITEM-2    TO RE-MARK.
065300     PERFORM  FAIL.
065400 SORT-WRITE-3-2.
065500     PERFORM  PRINT-DETAIL.
065600 SORT-INIT-D-2.
065700     PERFORM  READ-SORTIN-2 4 TIMES.
065800     MOVE     SPACE TO UTILITY-3.
065900*        NOTE SORT-TEST-4-2 CHECKS THE SIXTH RECORD IN THE FILE.
066000 SORT-TEST-4-2.
066100     PERFORM  READ-SORTIN-2.
066200     MOVE     "SORT-TEST-4-2" TO PAR-NAME.
066300     IF       SORTIN-REC-2 EQUAL TO UTILITY-KEYS
066400              PERFORM PASS GO TO SORT-WRITE-4-2.
066500 SORT-FAIL-4-2.
066600     MOVE     SORTKEY-3-2 TO COMPUTED-A.
066700     MOVE     UTILITY-3 TO CORRECT-A.
066800     MOVE     ITEM-3    TO RE-MARK.
066900     PERFORM  PRINT-DETAIL.
067000     MOVE     SORTKEY-1-2 TO COMPUTED-4V14.
067100     MOVE     UTILITY-1 TO CORRECT-4V14.
067200     MOVE     ITEM-1    TO RE-MARK.
067300     PERFORM  PRINT-DETAIL.
067400     MOVE     SORTKEY-2-2 TO COMPUTED-18V0.
067500     MOVE     UTILITY-2 TO CORRECT-18V0.
067600     MOVE     ITEM-2    TO RE-MARK.
067700     PERFORM  FAIL.
067800 SORT-WRITE-4-2.
067900     PERFORM  PRINT-DETAIL.
068000 CONTINUE-TESTING-2 SECTION.
068100 SORT-INIT-E-2.
068200     MOVE     +1.1111112 TO UTILITY-1.
068300     MOVE     SPACE TO UTILITY-3.
068400*        NOTE SORT-TEST-5-2 CHECKS THE 7TH RECORD IN THE FILE.
068500 SORT-TEST-5-2.
068600     PERFORM  READ-SORTIN-2.
068700     MOVE     "SORT-TEST-5-2" TO PAR-NAME.
068800     IF       SORTIN-REC-2 EQUAL TO UTILITY-KEYS
068900              PERFORM PASS GO TO SORT-WRITE-5-2.
069000 SORT-FAIL-5-2.
069100     MOVE     SORTKEY-3-2 TO COMPUTED-A.
069200     MOVE     UTILITY-3 TO CORRECT-A.
069300     MOVE     ITEM-3    TO RE-MARK.
069400     PERFORM  PRINT-DETAIL.
069500     MOVE     SORTKEY-1-2 TO COMPUTED-4V14.
069600     MOVE     UTILITY-1 TO CORRECT-4V14.
069700     MOVE     ITEM-1    TO RE-MARK.
069800     PERFORM  PRINT-DETAIL.
069900     MOVE     SORTKEY-2-2 TO COMPUTED-18V0.
070000     MOVE     UTILITY-2 TO CORRECT-18V0.
070100     MOVE     ITEM-2    TO RE-MARK.
070200     PERFORM  FAIL.
070300 SORT-WRITE-5-2.
070400     PERFORM  PRINT-DETAIL.
070500 SORT-INIT-F-2.
070600     PERFORM  READ-SORTIN-2.
070700     MOVE     888888888888888888 TO UTILITY-2.
070800*        NOTE SORT-TEST-6-2 CHECKS THE 9TH RECORD IN THE FILE.
070900 SORT-TEST-6-2.
071000     PERFORM  READ-SORTIN-2.
071100     MOVE     "SORT-TEST-6-2" TO PAR-NAME.
071200     IF       SORTIN-REC-2 EQUAL TO UTILITY-KEYS
071300              PERFORM PASS GO TO SORT-WRITE-6-2.
071400 SORT-FAIL-6-2.
071500     MOVE     SORTKEY-3-2 TO COMPUTED-A.
071600     MOVE     UTILITY-3 TO CORRECT-A.
071700     MOVE     ITEM-3    TO RE-MARK.
071800     PERFORM  PRINT-DETAIL.
071900     MOVE     SORTKEY-1-2 TO COMPUTED-4V14.
072000     MOVE     UTILITY-1 TO CORRECT-4V14.
072100     MOVE     ITEM-1    TO RE-MARK.
072200     PERFORM  PRINT-DETAIL.
072300     MOVE     SORTKEY-2-2 TO COMPUTED-18V0.
072400     MOVE     UTILITY-2 TO CORRECT-18V0.
072500     MOVE     ITEM-2    TO RE-MARK.
072600     PERFORM  FAIL.
072700 SORT-WRITE-6-2.
072800     PERFORM  PRINT-DETAIL.
072900 SORT-TEST-7-2.
073000     READ     SORTIN-2G AT END
073100              PERFORM PASS GO TO SORT-WRITE-7-2.
073200 SORT-FAIL-7-2.
073300     MOVE     SORTKEY-3-2 TO COMPUTED-A.
073400     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
073500     PERFORM  FAIL.
073600 SORT-WRITE-7-2.
073700     MOVE     "SORT-TEST-7-2" TO PAR-NAME.
073800     PERFORM  PRINT-DETAIL.
073900 SORT-TEST-8-2.
074000     IF       UTIL-CTR EQUAL TO 9
074100              PERFORM PASS GO TO SORT-WRITE-8-2.
074200 SORT-FAIL-8-2.
074300     MOVE     UTIL-CTR TO COMPUTED-4V14.
074400     MOVE     9 TO CORRECT-4V14.
074500     PERFORM  FAIL.
074600 SORT-WRITE-8-2.
074700     MOVE     "SORT-TEST-8-2" TO PAR-NAME.
074800     PERFORM  PRINT-DETAIL.
074900     CLOSE    SORTIN-2G.
075000     GO TO    ST126A-001-03.
075100 READ-SORTIN-2.
075200     READ     SORTIN-2G AT END GO TO READ-ERROR-2.
075300     ADD      1 TO UTIL-CTR.
075400 READ-ERROR-2.
075500     MOVE     "READ-ERROR-2" TO PAR-NAME.
075600     MOVE     "EOF PREMATURELY FOUND" TO RE-MARK.
075700     PERFORM  FAIL.
075800     PERFORM  PRINT-DETAIL.
075900*
076000*
076100 ST126A-001-03.
076200     MOVE    "SORT, MIXED CLASSES" TO FEATURE.
076300     MOVE     ZERO TO UTIL-CTR.
076400     IF       ZER-O IS LESS THAN SPAC-E
076500              GO TO ZERO-IS-LESS-THAN-SPACE-3.
076600 SPACE-IS-LESS-THAN-ZERO-3 SECTION.
076700 SORT-INIT-A-3.
076800     MOVE     +0.0000001 TO UTILITY-1.
076900     MOVE     999999999999999999 TO UTILITY-2.
077000     MOVE     SPACE TO UTILITY-3.
077100 SORT-TEST-1-3.
077200     PERFORM  READ-SORTIN-3.
077300     MOVE     "SORT-TEST-1-3" TO PAR-NAME.
077400     IF       SORTIN-REC-3 EQUAL TO UTILITY-KEYS
077500              PERFORM PASS GO TO SORT-WRITE-1-3.
077600 SORT-FAIL-1-3.
077700     MOVE     SORTKEY-3-3 TO COMPUTED-A.
077800     MOVE     UTILITY-3 TO CORRECT-A.
077900     MOVE     ITEM-3    TO RE-MARK.
078000     PERFORM  PRINT-DETAIL.
078100     MOVE     SORTKEY-1-3 TO COMPUTED-4V14.
078200     MOVE     UTILITY-1 TO CORRECT-4V14.
078300     MOVE     ITEM-1    TO RE-MARK.
078400     PERFORM  PRINT-DETAIL.
078500     MOVE     SORTKEY-2-3 TO COMPUTED-18V0.
078600     MOVE     UTILITY-2 TO CORRECT-18V0.
078700     MOVE     ITEM-2    TO RE-MARK.
078800     PERFORM  FAIL.
078900 SORT-WRITE-1-3.
079000     PERFORM  PRINT-DETAIL.
079100 SORT-INIT-B-3.
079200     MOVE     ZERO TO UTILITY-3.
079300     PERFORM  READ-SORTIN-3 4 TIMES.
079400*        NOTE SORT-TEST-2-3 CHECKS THE 6TH RECORD IN THE FILE.
079500 SORT-TEST-2-3.
079600     PERFORM  READ-SORTIN-3.
079700     MOVE     "SORT-TEST-2-3" TO PAR-NAME.
079800     IF       SORTIN-REC-3 EQUAL TO UTILITY-KEYS
079900              PERFORM PASS GO TO SORT-WRITE-2-3.
080000 SORT-FAIL-2-3.
080100     MOVE     SORTKEY-3-3 TO COMPUTED-A.
080200     MOVE     UTILITY-3 TO CORRECT-A.
080300     MOVE     ITEM-3    TO RE-MARK.
080400     PERFORM  PRINT-DETAIL.
080500     MOVE     SORTKEY-1-3 TO COMPUTED-4V14.
080600     MOVE     UTILITY-1 TO CORRECT-4V14.
080700     MOVE     ITEM-1    TO RE-MARK.
080800     PERFORM  PRINT-DETAIL.
080900     MOVE     SORTKEY-2-3 TO COMPUTED-18V0.
081000     MOVE     UTILITY-2 TO CORRECT-18V0.
081100     MOVE     ITEM-2    TO RE-MARK.
081200     PERFORM  FAIL.
081300 SORT-WRITE-2-3.
081400     PERFORM  PRINT-DETAIL.
081500 DUMMY-3-AND-4-3.
081600     MOVE     "SORT-TEST-3-3" TO PAR-NAME.
081700     MOVE     DUM-MY TO RE-MARK.
081800     PERFORM  PRINT-DETAIL.
081900     MOVE     "SORT-TEST-4-3" TO PAR-NAME.
082000     MOVE     DUM-MY TO RE-MARK.
082100     PERFORM  PRINT-DETAIL.
082200     GO       TO CONTINUE-TESTING-3.
082300 ZERO-IS-LESS-THAN-SPACE-3 SECTION.
082400 SORT-INIT-C-3.
082500     MOVE     +0.0000001 TO UTILITY-1.
082600     MOVE     999999999999999999 TO UTILITY-2.
082700     MOVE     ZERO TO UTILITY-3.
082800 DUMMY-1-AND-2-3.
082900     MOVE     "SORT-TEST-1-3" TO PAR-NAME.
083000     MOVE     DUM-MY TO RE-MARK.
083100     PERFORM  PRINT-DETAIL.
083200     MOVE     "SORT-TEST-2-3" TO PAR-NAME.
083300     MOVE     DUM-MY TO RE-MARK.
083400     PERFORM  PRINT-DETAIL.
083500 SORT-TEST-3-3.
083600     PERFORM  READ-SORTIN-3.
083700     MOVE     "SORT-TEST-3-3" TO PAR-NAME.
083800     IF       SORTIN-REC-3 EQUAL TO UTILITY-KEYS
083900              PERFORM PASS GO TO SORT-WRITE-3-3.
084000 SORT-FAIL-3-3.
084100     MOVE     SORTKEY-3-3 TO COMPUTED-A.
084200     MOVE     UTILITY-3 TO CORRECT-A.
084300     MOVE     ITEM-3    TO RE-MARK.
084400     PERFORM  PRINT-DETAIL.
084500     MOVE     SORTKEY-1-3 TO COMPUTED-4V14.
084600     MOVE     UTILITY-1 TO CORRECT-4V14.
084700     MOVE     ITEM-1    TO RE-MARK.
084800     PERFORM  PRINT-DETAIL.
084900     MOVE     SORTKEY-2-3 TO COMPUTED-18V0.
085000     MOVE     UTILITY-2 TO CORRECT-18V0.
085100     MOVE     ITEM-2    TO RE-MARK.
085200     PERFORM  FAIL.
085300 SORT-WRITE-3-3.
085400     PERFORM  PRINT-DETAIL.
085500 SORT-INIT-D-3.
085600     PERFORM  READ-SORTIN-3 4 TIMES.
085700     MOVE     SPACE TO UTILITY-3.
085800*        NOTE SORT-TEST-4-3 CHECKS THE SIXTH RECORD IN THE FILE.
085900 SORT-TEST-4-3.
086000     PERFORM  READ-SORTIN-3.
086100     MOVE     "SORT-TEST-4-3" TO PAR-NAME.
086200     IF       SORTIN-REC-3 EQUAL TO UTILITY-KEYS
086300              PERFORM PASS GO TO SORT-WRITE-4-3.
086400 SORT-FAIL-4-3.
086500     MOVE     SORTKEY-3-3 TO COMPUTED-A.
086600     MOVE     UTILITY-3 TO CORRECT-A.
086700     MOVE     ITEM-3    TO RE-MARK.
086800     PERFORM  PRINT-DETAIL.
086900     MOVE     SORTKEY-1-3 TO COMPUTED-4V14.
087000     MOVE     UTILITY-1 TO CORRECT-4V14.
087100     MOVE     ITEM-1    TO RE-MARK.
087200     PERFORM  PRINT-DETAIL.
087300     MOVE     SORTKEY-2-3 TO COMPUTED-18V0.
087400     MOVE     UTILITY-2 TO CORRECT-18V0.
087500     MOVE     ITEM-2    TO RE-MARK.
087600     PERFORM  FAIL.
087700 SORT-WRITE-4-3.
087800     PERFORM  PRINT-DETAIL.
087900 CONTINUE-TESTING-3 SECTION.
088000 SORT-INIT-E-3.
088100     MOVE     +1.1111112 TO UTILITY-1.
088200     MOVE     SPACE TO UTILITY-3.
088300*        NOTE SORT-TEST-5-3 CHECKS THE 7TH RECORD IN THE FILE.
088400 SORT-TEST-5-3.
088500     PERFORM  READ-SORTIN-3.
088600     MOVE     "SORT-TEST-5-3" TO PAR-NAME.
088700     IF       SORTIN-REC-3 EQUAL TO UTILITY-KEYS
088800              PERFORM PASS GO TO SORT-WRITE-5-3.
088900 SORT-FAIL-5-3.
089000     MOVE     SORTKEY-3-3 TO COMPUTED-A.
089100     MOVE     UTILITY-3 TO CORRECT-A.
089200     MOVE     ITEM-3    TO RE-MARK.
089300     PERFORM  PRINT-DETAIL.
089400     MOVE     SORTKEY-1-3 TO COMPUTED-4V14.
089500     MOVE     UTILITY-1 TO CORRECT-4V14.
089600     MOVE     ITEM-1    TO RE-MARK.
089700     PERFORM  PRINT-DETAIL.
089800     MOVE     SORTKEY-2-3 TO COMPUTED-18V0.
089900     MOVE     UTILITY-2 TO CORRECT-18V0.
090000     MOVE     ITEM-2    TO RE-MARK.
090100     PERFORM  FAIL.
090200 SORT-WRITE-5-3.
090300     PERFORM  PRINT-DETAIL.
090400 SORT-INIT-F-3.
090500     PERFORM  READ-SORTIN-3.
090600     MOVE     888888888888888888 TO UTILITY-2.
090700*        NOTE SORT-TEST-6-3 CHECKS THE 9TH RECORD IN THE FILE.
090800 SORT-TEST-6-3.
090900     PERFORM  READ-SORTIN-3.
091000     MOVE     "SORT-TEST-6-3" TO PAR-NAME.
091100     IF       SORTIN-REC-3 EQUAL TO UTILITY-KEYS
091200              PERFORM PASS GO TO SORT-WRITE-6-3.
091300 SORT-FAIL-6-3.
091400     MOVE     SORTKEY-3-3 TO COMPUTED-A.
091500     MOVE     UTILITY-3 TO CORRECT-A.
091600     MOVE     ITEM-3    TO RE-MARK.
091700     PERFORM  PRINT-DETAIL.
091800     MOVE     SORTKEY-1-3 TO COMPUTED-4V14.
091900     MOVE     UTILITY-1 TO CORRECT-4V14.
092000     MOVE     ITEM-1    TO RE-MARK.
092100     PERFORM  PRINT-DETAIL.
092200     MOVE     SORTKEY-2-3 TO COMPUTED-18V0.
092300     MOVE     UTILITY-3 TO CORRECT-18V0.
092400     MOVE     ITEM-2    TO RE-MARK.
092500     PERFORM  FAIL.
092600 SORT-WRITE-6-3.
092700     PERFORM  PRINT-DETAIL.
092800 SORT-TEST-7-3.
092900     READ     SORTIN-3G AT END
093000              PERFORM PASS GO TO SORT-WRITE-7-3.
093100 SORT-FAIL-7-3.
093200     MOVE     SORTKEY-3-3 TO COMPUTED-A.
093300     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
093400     PERFORM  FAIL.
093500 SORT-WRITE-7-3.
093600     MOVE     "SORT-TEST-7-3" TO PAR-NAME.
093700     PERFORM  PRINT-DETAIL.
093800 SORT-TEST-8-3.
093900     IF       UTIL-CTR EQUAL TO 9
094000              PERFORM PASS GO TO SORT-WRITE-8-3.
094100 SORT-FAIL-8-3.
094200     MOVE     UTIL-CTR TO COMPUTED-4V14.
094300     MOVE     9 TO CORRECT-4V14.
094400     PERFORM  FAIL.
094500 SORT-WRITE-8-3.
094600     MOVE     "SORT-TEST-8-3" TO PAR-NAME.
094700     PERFORM  PRINT-DETAIL.
094800     CLOSE    SORTIN-3G.
094900     GO TO    CCVS-EXIT.
095000 READ-SORTIN-3.
095100     READ     SORTIN-3G AT END GO TO READ-ERROR-3.
095200     ADD      1 TO UTIL-CTR.
095300 READ-ERROR-3.
095400     MOVE     "READ-ERROR-3" TO PAR-NAME.
095500     MOVE     "EOF PREMATURELY FOUND" TO RE-MARK.
095600     PERFORM  FAIL.
095700     PERFORM  PRINT-DETAIL.
095800 CCVS-EXIT SECTION.
095900 CCVS-999999.
096000     GO TO CLOSE-FILES.
