000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST124A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-02
001700*        X-55  - SYSTEM PRINTER NAME.                          *
001800*        X-69                                                  *
001900*        X-74                                                  *
002000*        X-76                                                  *
002100*        X-82  - SOURCE COMPUTER NAME.                         *
002200*        X-83  - OBJECT COMPUTER NAME.                         *
002300*                                                              *
002400****************************************************************
002500*                                                              *
002600*    PROGRAM ST124A TESTS THE CONTENTS OF THE FILE PRODUCED BY *
002700*    ST123A.   PROGRAMS ST122A, ST123A AND ST124A WILL BE USED *
002800*    ONLY IF LEVEL 2 OF THE SEQUENTIAL I-O MODULE IS SUPPORTED *
002900*    AS THE "RECORD IS VARYING IN SIZE" CLAUSE IS USED IN      *
003000*    ST123A.                                                   *
003100*                                                              *
003200****************************************************************
003300*    ST124A CHECKS THE OUTPUT FROM ST123A, WHICH IN TURN USED
003400*    INPUT FROM ST122A.
003500*    40 VARIABLE-LENGTH RECORDS HAVE BEEN SORTED
003600*    SORTED AND SHOULD APPEAR AS SHOWN
003700*        NON-KEY KEY-1       KEY-2               FILLER
003800*           X(2) X(10)       X(38)
003900*
004000*    FIRST 13 RECORDS ---
004100*            "CC""LOWEST TWO""MIDDLE TWO-SECOND" X(50) VALUE QUOTE
004200*    NEXT 14 RECORDS ---
004300*            "BB""LOWEST TWO""MIDDLE TWO-FIRST"  X(25) VALUE ZERO
004400*    LAST 13 RECORDS ---
004500*            "AA""LOWEST ONE""MIDDLE ONE-ONLY"         (NONE)
004600*
004700 ENVIRONMENT DIVISION.
004800 CONFIGURATION SECTION.
004900 SOURCE-COMPUTER.
005000     XXXXX082.
005100 OBJECT-COMPUTER.
005200     XXXXX083.
005300 INPUT-OUTPUT SECTION.
005400 FILE-CONTROL.
005500     SELECT PRINT-FILE ASSIGN TO
005600     XXXXX055.
005700     SELECT   SORTIN-1K ASSIGN TO
005800     XXXXP002.
005900 DATA DIVISION.
006000 FILE SECTION.
006100 FD  PRINT-FILE.
006200 01  PRINT-REC PICTURE X(120).
006300 01  DUMMY-RECORD PICTURE X(120).
006400 FD  SORTIN-1K
006500     LABEL RECORDS STANDARD
006600C    VALUE OF
006700C    XXXXX074
006800C    IS
006900C    XXXXX076
007000G    XXXXX069
007100     RECORD IS VARYING IN SIZE FROM 50 TO 100 CHARACTERS
007200     DATA RECORDS ARE SHORT-RECORD
007300                      MEDIUM-RECORD
007400                      LONG-RECORD.
007500 01  SHORT-RECORD       PICTURE X(50).
007600 01  MEDIUM-RECORD      PICTURE X(75).
007700 01  LONG-RECORD        PICTURE X(100).
007800 WORKING-STORAGE SECTION.
007900 77  UTIL-CTR           PICTURE S99999 VALUE ZERO.
008000 01  SHORT-WORK.
008100     02 FILLER          PICTURE XX VALUE "AA".
008200     02 FILLER          PICTURE X(10) VALUE "LOWEST ONE".
008300     02 FILLER          PICTURE X(38)
008400     VALUE "MIDDLE ONE-ONLY                       ".
008500 01  MEDIUM-WORK.
008600     02 FILLER          PICTURE XX VALUE "BB".
008700     02 FILLER          PICTURE X(10) VALUE "LOWEST TWO".
008800     02 FILLER          PICTURE X(38)
008900     VALUE "MIDDLE TWO-FIRST                      ".
009000     02 FILLER          PICTURE X(25) VALUE ZERO.
009100 01  LONG-WORK.
009200     02 FILLER         PICTURE XX VALUE "CC".
009300     02 FILLER         PICTURE X(10) VALUE "LOWEST TWO".
009400     02 FILLER          PICTURE X(38)
009500     VALUE "MIDDLE TWO-SECOND                     ".
009600     02  FILLER        PICTURE X(50) VALUE QUOTE.
009700 01  BREAKDOWN-LIMIT    PICTURE 999.
009800 01  COMPUTED-BREAKDOWN.
009900     02 FIRST-20-CM     PICTURE X(20).
010000     02 SECOND-20-CM    PICTURE X(20).
010100     02 THIRD-20-CM     PICTURE X(20).
010200     02 FOURTH-20-CM    PICTURE X(20).
010300     02 FIFTH-20-CM     PICTURE X(20).
010400 01  CORRECT-BREAKDOWN.
010500     02 FIRST-20-CR     PICTURE X(20).
010600     02 SECOND-20-CR    PICTURE X(20).
010700     02 THIRD-20-CR     PICTURE X(20).
010800     02 FOURTH-20-CR    PICTURE X(20).
010900     02 FIFTH-20-CR     PICTURE X(20).
011000 01  TEST-RESULTS.
011100     02 FILLER                   PIC X      VALUE SPACE.
011200     02 FEATURE                  PIC X(20)  VALUE SPACE.
011300     02 FILLER                   PIC X      VALUE SPACE.
011400     02 P-OR-F                   PIC X(5)   VALUE SPACE.
011500     02 FILLER                   PIC X      VALUE SPACE.
011600     02  PAR-NAME.
011700       03 FILLER                 PIC X(19)  VALUE SPACE.
011800       03  PARDOT-X              PIC X      VALUE SPACE.
011900       03 DOTVALUE               PIC 99     VALUE ZERO.
012000     02 FILLER                   PIC X(8)   VALUE SPACE.
012100     02 RE-MARK                  PIC X(61).
012200 01  TEST-COMPUTED.
012300     02 FILLER                   PIC X(30)  VALUE SPACE.
012400     02 FILLER                   PIC X(17)  VALUE
012500            "       COMPUTED=".
012600     02 COMPUTED-X.
012700     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
012800     03 COMPUTED-N               REDEFINES COMPUTED-A
012900                                 PIC -9(9).9(9).
013000     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
013100     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
013200     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
013300     03       CM-18V0 REDEFINES COMPUTED-A.
013400         04 COMPUTED-18V0                    PIC -9(18).
013500         04 FILLER                           PIC X.
013600     03 FILLER PIC X(50) VALUE SPACE.
013700 01  TEST-CORRECT.
013800     02 FILLER PIC X(30) VALUE SPACE.
013900     02 FILLER PIC X(17) VALUE "       CORRECT =".
014000     02 CORRECT-X.
014100     03 CORRECT-A                  PIC X(20) VALUE SPACE.
014200     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
014300     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
014400     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
014500     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
014600     03      CR-18V0 REDEFINES CORRECT-A.
014700         04 CORRECT-18V0                     PIC -9(18).
014800         04 FILLER                           PIC X.
014900     03 FILLER PIC X(2) VALUE SPACE.
015000     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
015100 01  CCVS-C-1.
015200     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
015300-    "SS  PARAGRAPH-NAME
015400-    "       REMARKS".
015500     02 FILLER                     PIC X(20)    VALUE SPACE.
015600 01  CCVS-C-2.
015700     02 FILLER                     PIC X        VALUE SPACE.
015800     02 FILLER                     PIC X(6)     VALUE "TESTED".
015900     02 FILLER                     PIC X(15)    VALUE SPACE.
016000     02 FILLER                     PIC X(4)     VALUE "FAIL".
016100     02 FILLER                     PIC X(94)    VALUE SPACE.
016200 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
016300 01  REC-CT                        PIC 99       VALUE ZERO.
016400 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
016500 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
016600 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
016700 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
016800 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
016900 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
017000 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
017100 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
017200 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
017300 01  CCVS-H-1.
017400     02  FILLER                    PIC X(39)    VALUE SPACES.
017500     02  FILLER                    PIC X(42)    VALUE
017600     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
017700     02  FILLER                    PIC X(39)    VALUE SPACES.
017800 01  CCVS-H-2A.
017900   02  FILLER                        PIC X(40)  VALUE SPACE.
018000   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
018100   02  FILLER                        PIC XXXX   VALUE
018200     "4.2 ".
018300   02  FILLER                        PIC X(28)  VALUE
018400            " COPY - NOT FOR DISTRIBUTION".
018500   02  FILLER                        PIC X(41)  VALUE SPACE.
018600
018700 01  CCVS-H-2B.
018800   02  FILLER                        PIC X(15)  VALUE
018900            "TEST RESULT OF ".
019000   02  TEST-ID                       PIC X(9).
019100   02  FILLER                        PIC X(4)   VALUE
019200            " IN ".
019300   02  FILLER                        PIC X(12)  VALUE
019400     " HIGH       ".
019500   02  FILLER                        PIC X(22)  VALUE
019600            " LEVEL VALIDATION FOR ".
019700   02  FILLER                        PIC X(58)  VALUE
019800     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
019900 01  CCVS-H-3.
020000     02  FILLER                      PIC X(34)  VALUE
020100            " FOR OFFICIAL USE ONLY    ".
020200     02  FILLER                      PIC X(58)  VALUE
020300     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
020400     02  FILLER                      PIC X(28)  VALUE
020500            "  COPYRIGHT   1985 ".
020600 01  CCVS-E-1.
020700     02 FILLER                       PIC X(52)  VALUE SPACE.
020800     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
020900     02 ID-AGAIN                     PIC X(9).
021000     02 FILLER                       PIC X(45)  VALUE SPACES.
021100 01  CCVS-E-2.
021200     02  FILLER                      PIC X(31)  VALUE SPACE.
021300     02  FILLER                      PIC X(21)  VALUE SPACE.
021400     02 CCVS-E-2-2.
021500         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
021600         03 FILLER                   PIC X      VALUE SPACE.
021700         03 ENDER-DESC               PIC X(44)  VALUE
021800            "ERRORS ENCOUNTERED".
021900 01  CCVS-E-3.
022000     02  FILLER                      PIC X(22)  VALUE
022100            " FOR OFFICIAL USE ONLY".
022200     02  FILLER                      PIC X(12)  VALUE SPACE.
022300     02  FILLER                      PIC X(58)  VALUE
022400     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
022500     02  FILLER                      PIC X(13)  VALUE SPACE.
022600     02 FILLER                       PIC X(15)  VALUE
022700             " COPYRIGHT 1985".
022800 01  CCVS-E-4.
022900     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
023000     02 FILLER                       PIC X(4)   VALUE " OF ".
023100     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
023200     02 FILLER                       PIC X(40)  VALUE
023300      "  TESTS WERE EXECUTED SUCCESSFULLY".
023400 01  XXINFO.
023500     02 FILLER                       PIC X(19)  VALUE
023600            "*** INFORMATION ***".
023700     02 INFO-TEXT.
023800       04 FILLER                     PIC X(8)   VALUE SPACE.
023900       04 XXCOMPUTED                 PIC X(20).
024000       04 FILLER                     PIC X(5)   VALUE SPACE.
024100       04 XXCORRECT                  PIC X(20).
024200     02 INF-ANSI-REFERENCE           PIC X(48).
024300 01  HYPHEN-LINE.
024400     02 FILLER  PIC IS X VALUE IS SPACE.
024500     02 FILLER  PIC IS X(65)    VALUE IS "************************
024600-    "*****************************************".
024700     02 FILLER  PIC IS X(54)    VALUE IS "************************
024800-    "******************************".
024900 01  CCVS-PGM-ID                     PIC X(9)   VALUE
025000     "ST124A".
025100 PROCEDURE DIVISION.
025200 CCVS1 SECTION.
025300 OPEN-FILES.
025400     OPEN     OUTPUT PRINT-FILE.
025500     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
025600     MOVE    SPACE TO TEST-RESULTS.
025700     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
025800     GO TO CCVS1-EXIT.
025900 CLOSE-FILES.
026000     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
026100 TERMINATE-CCVS.
026200S    EXIT PROGRAM.
026300STERMINATE-CALL.
026400     STOP     RUN.
026500 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
026600 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
026700 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
026800 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
026900     MOVE "****TEST DELETED****" TO RE-MARK.
027000 PRINT-DETAIL.
027100     IF REC-CT NOT EQUAL TO ZERO
027200             MOVE "." TO PARDOT-X
027300             MOVE REC-CT TO DOTVALUE.
027400     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
027500     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
027600        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
027700          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
027800     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
027900     MOVE SPACE TO CORRECT-X.
028000     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
028100     MOVE     SPACE TO RE-MARK.
028200 HEAD-ROUTINE.
028300     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028400     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
028500     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
028600     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
028700 COLUMN-NAMES-ROUTINE.
028800     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
028900     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029000     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
029100 END-ROUTINE.
029200     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
029300 END-RTN-EXIT.
029400     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
029500 END-ROUTINE-1.
029600      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
029700      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
029800      ADD PASS-COUNTER TO ERROR-HOLD.
029900*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
030000      MOVE PASS-COUNTER TO CCVS-E-4-1.
030100      MOVE ERROR-HOLD TO CCVS-E-4-2.
030200      MOVE CCVS-E-4 TO CCVS-E-2-2.
030300      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
030400  END-ROUTINE-12.
030500      MOVE "TEST(S) FAILED" TO ENDER-DESC.
030600     IF       ERROR-COUNTER IS EQUAL TO ZERO
030700         MOVE "NO " TO ERROR-TOTAL
030800         ELSE
030900         MOVE ERROR-COUNTER TO ERROR-TOTAL.
031000     MOVE     CCVS-E-2 TO DUMMY-RECORD.
031100     PERFORM WRITE-LINE.
031200 END-ROUTINE-13.
031300     IF DELETE-COUNTER IS EQUAL TO ZERO
031400         MOVE "NO " TO ERROR-TOTAL  ELSE
031500         MOVE DELETE-COUNTER TO ERROR-TOTAL.
031600     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
031700     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
031800      IF   INSPECT-COUNTER EQUAL TO ZERO
031900          MOVE "NO " TO ERROR-TOTAL
032000      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
032100      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
032200      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032300     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
032400 WRITE-LINE.
032500     ADD 1 TO RECORD-COUNT.
032600Y    IF RECORD-COUNT GREATER 42
032700Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
032800Y        MOVE SPACE TO DUMMY-RECORD
032900Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
033000Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
033100Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
033200Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
033300Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
033400Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
033500Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
033600Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
033700Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
033800Y        MOVE ZERO TO RECORD-COUNT.
033900     PERFORM WRT-LN.
034000 WRT-LN.
034100     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
034200     MOVE SPACE TO DUMMY-RECORD.
034300 BLANK-LINE-PRINT.
034400     PERFORM WRT-LN.
034500 FAIL-ROUTINE.
034600     IF     COMPUTED-X NOT EQUAL TO SPACE
034700            GO TO   FAIL-ROUTINE-WRITE.
034800     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
034900     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
035000     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
035100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035200     MOVE   SPACES TO INF-ANSI-REFERENCE.
035300     GO TO  FAIL-ROUTINE-EX.
035400 FAIL-ROUTINE-WRITE.
035500     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
035600     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
035700     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
035800     MOVE   SPACES TO COR-ANSI-REFERENCE.
035900 FAIL-ROUTINE-EX. EXIT.
036000 BAIL-OUT.
036100     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
036200     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
036300 BAIL-OUT-WRITE.
036400     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
036500     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
036600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036700     MOVE   SPACES TO INF-ANSI-REFERENCE.
036800 BAIL-OUT-EX. EXIT.
036900 CCVS1-EXIT.
037000     EXIT.
037100 SECT-ST111-0001 SECTION.
037200 ST124A-0001-01.
037300     OPEN     INPUT  SORTIN-1K.
037400     MOVE    " *****  ST123A DOES NOT PRODUCE A PRINTED REPORT
037500-    "*****"  TO TEST-RESULTS.
037600     PERFORM PRINT-DETAIL.
037700     MOVE    SPACE TO TEST-RESULTS.
037800     PERFORM END-ROUTINE.
037900     MOVE     "SORT VARIABLE RECORD" TO FEATURE.
038000 SORT-TEST-1.
038100     MOVE     "SORT-TEST-1" TO PAR-NAME.
038200     PERFORM  READ-SORTIN.
038300     IF       LONG-RECORD EQUAL TO LONG-WORK
038400              PERFORM PASS GO TO SORT-WRITE-1.
038500*        NOTE FIRST RECORD.
038600 SORT-FAIL-1.
038700     MOVE     100 TO BREAKDOWN-LIMIT.
038800     MOVE     LONG-RECORD TO COMPUTED-BREAKDOWN.
038900     MOVE     LONG-WORK TO CORRECT-BREAKDOWN.
039000     PERFORM  BREAKDOWN-PARA THRU BREAKDOWN-EXIT.
039100 SORT-WRITE-1.
039200     PERFORM  PRINT-DETAIL.
039300 SORT-TEST-2.
039400     MOVE     "SORT-TEST-2" TO PAR-NAME.
039500     PERFORM  READ-SORTIN 12 TIMES.
039600     IF       LONG-RECORD EQUAL TO LONG-WORK
039700              PERFORM PASS GO TO SORT-WRITE-2.
039800*        NOTE THIRTEENTH RECORD.
039900 SORT-FAIL-2.
040000     MOVE     100 TO BREAKDOWN-LIMIT.
040100     MOVE     LONG-RECORD TO COMPUTED-BREAKDOWN.
040200     MOVE     LONG-WORK TO CORRECT-BREAKDOWN.
040300     PERFORM  BREAKDOWN-PARA THRU BREAKDOWN-EXIT.
040400 SORT-WRITE-2.
040500     PERFORM  PRINT-DETAIL.
040600 SORT-TEST-3.
040700     MOVE     "SORT-TEST-3" TO PAR-NAME.
040800     PERFORM  READ-SORTIN.
040900     IF       MEDIUM-RECORD EQUAL TO MEDIUM-WORK
041000              PERFORM PASS GO TO SORT-WRITE-3.
041100*        NOTE FOURTEENTH RECORD.
041200 SORT-FAIL-3.
041300     MOVE     75 TO BREAKDOWN-LIMIT.
041400     MOVE     MEDIUM-RECORD TO COMPUTED-BREAKDOWN.
041500     MOVE     MEDIUM-WORK TO CORRECT-BREAKDOWN.
041600     PERFORM  BREAKDOWN-PARA THRU BREAKDOWN-EXIT.
041700 SORT-WRITE-3.
041800     PERFORM  PRINT-DETAIL.
041900 SORT-TEST-4.
042000     MOVE     "SORT-TEST-4" TO PAR-NAME.
042100     PERFORM  READ-SORTIN 13 TIMES.
042200     IF       MEDIUM-RECORD EQUAL TO MEDIUM-WORK
042300              PERFORM PASS GO TO SORT-WRITE-4.
042400*        NOTE TWENTY-SEVENTH RECORD.
042500 SORT-FAIL-4.
042600     MOVE     75 TO BREAKDOWN-LIMIT.
042700     MOVE     MEDIUM-RECORD TO COMPUTED-BREAKDOWN.
042800     MOVE     MEDIUM-WORK TO CORRECT-BREAKDOWN.
042900     PERFORM  BREAKDOWN-PARA THRU BREAKDOWN-EXIT.
043000 SORT-WRITE-4.
043100     PERFORM  PRINT-DETAIL.
043200 SORT-TEST-5.
043300     MOVE     "SORT-TEST-5" TO PAR-NAME.
043400     PERFORM  READ-SORTIN.
043500     IF       SHORT-RECORD EQUAL TO SHORT-WORK
043600              PERFORM PASS GO TO SORT-WRITE-5.
043700*        NOTE TWENTY-EIGHTH RECORD.
043800 SORT-FAIL-5.
043900     MOVE     50 TO BREAKDOWN-LIMIT.
044000     MOVE     SHORT-RECORD TO COMPUTED-BREAKDOWN.
044100     MOVE     SHORT-WORK TO CORRECT-BREAKDOWN.
044200     PERFORM  BREAKDOWN-PARA THRU BREAKDOWN-EXIT.
044300 SORT-WRITE-5.
044400     PERFORM  PRINT-DETAIL.
044500 SORT-TEST-6.
044600     MOVE     "SORT-TEST-6" TO PAR-NAME.
044700     PERFORM  READ-SORTIN 12 TIMES.
044800     IF       SHORT-RECORD EQUAL TO SHORT-WORK
044900              PERFORM PASS GO TO SORT-WRITE-6.
045000*        NOTE FORTIETH RECORD.
045100 SORT-FAIL-6.
045200     MOVE     50 TO BREAKDOWN-LIMIT.
045300     MOVE     SHORT-RECORD TO COMPUTED-BREAKDOWN.
045400     MOVE     SHORT-WORK TO CORRECT-BREAKDOWN.
045500     PERFORM  BREAKDOWN-PARA THRU BREAKDOWN-EXIT.
045600 SORT-WRITE-6.
045700     PERFORM  PRINT-DETAIL.
045800 SORT-TEST-7.
045900     MOVE     "SORT-TEST-7" TO PAR-NAME.
046000     READ     SORTIN-1K AT END
046100              PERFORM PASS GO TO SORT-WRITE-7.
046200 SORT-FAIL-7.
046300     MOVE     100 TO BREAKDOWN-LIMIT.
046400     MOVE     LONG-RECORD TO COMPUTED-BREAKDOWN.
046500     MOVE     SPACE TO CORRECT-BREAKDOWN.
046600     PERFORM  BREAKDOWN-PARA THRU BREAKDOWN-EXIT.
046700     PERFORM  PRINT-DETAIL.
046800     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
046900 SORT-WRITE-7.
047000     PERFORM  PRINT-DETAIL.
047100     CLOSE    SORTIN-1K.
047200     GO TO    CCVS-EXIT.
047300 BREAKDOWN-PARA.
047400     PERFORM  FAIL.
047500     MOVE     FIRST-20-CM TO COMPUTED-A.
047600     MOVE     FIRST-20-CR TO CORRECT-A.
047700     MOVE     "FIRST TWENTY CHARACTERS" TO RE-MARK.
047800     PERFORM  PRINT-DETAIL.
047900     MOVE     SECOND-20-CM TO COMPUTED-A.
048000     MOVE     SECOND-20-CR TO CORRECT-A.
048100     MOVE     "SECOND TWENTY CHARACTERS" TO RE-MARK.
048200     PERFORM  PRINT-DETAIL.
048300     MOVE     THIRD-20-CM TO COMPUTED-A.
048400     MOVE     THIRD-20-CR TO CORRECT-A.
048500     MOVE     "THIRD TWENTY CHARACTERS" TO RE-MARK.
048600     PERFORM  PRINT-DETAIL.
048700     IF       BREAKDOWN-LIMIT LESS THAN 61 GO TO BREAKDOWN-EXIT.
048800     MOVE     FOURTH-20-CM TO COMPUTED-A.
048900     MOVE     FOURTH-20-CR TO CORRECT-A.
049000     MOVE     "FOURTH TWENTY CHARACTERS" TO RE-MARK.
049100     PERFORM  PRINT-DETAIL.
049200     IF       BREAKDOWN-LIMIT LESS THAN 81 GO TO BREAKDOWN-EXIT.
049300     MOVE     FIFTH-20-CM TO COMPUTED-A.
049400     MOVE     FIFTH-20-CR TO CORRECT-A.
049500     MOVE     "FIFTH TWENTY CHARACTERS" TO RE-MARK.
049600 BREAKDOWN-EXIT.
049700     EXIT.
049800 READ-SORTIN.
049900     READ     SORTIN-1K AT END GO TO READ-ERROR.
050000     ADD      1 TO UTIL-CTR.
050100 READ-ERROR.
050200     MOVE     UTIL-CTR TO COMPUTED-N.
050300     MOVE     40 TO CORRECT-N.
050400     MOVE     "TOO FEW INPUT RECORDS" TO RE-MARK.
050500     MOVE     "READ-SORTIN" TO PAR-NAME.
050600     PERFORM  FAIL.
050700     PERFORM  PRINT-DETAIL.
050800 CCVS-EXIT SECTION.
050900 CCVS-999999.
051000     GO TO CLOSE-FILES.
