000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST133A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*                                                              *
001400*      X-CARDS USED BY THIS PROGRAM ARE :-                     *
001500*                                                              *
001600*        X-55  - SYSTEM PRINTER NAME.                          *
001700*        X-82  - SOURCE COMPUTER NAME.                         *
001800*        X-83  - OBJECT COMPUTER NAME.                         *
001900*                                                              *
002000****************************************************************
002100*
002200*    ST133 DOES TWO SORTS ON THE SAME SET OF 80-CHARACTER RECORDS.
002300*    THESE RECORDS ARE SHOWN BELOW. THE FIRST SORT EMPLOYS THE
002400*    COMBINATION INPUT PROCEDURE, GIVING. THE SECOND SORT EMPLOYS
002500*    USING, OUTPUT PROCEDURE. THE OUTPUT FILE FROM THE FIRST SORT
002600*    BECOMES THE INPUT FILE FOR THE SECOND SORT.
002700*
002800*    THE RESULTS OF BOTH SORTS ARE REFLECTED IN THE INPUT AND
002900*    OUTPUT FILES ASSOCIATED WITH THE SECOND SORT. BECAUSE OF
003000*    THIS, THE CONTENTS OF BOTH FILES ARE SPOT-CHECKED IN THE
003100*    OUTPUT PROCEDURE. TO DO THIS, IT IS NECESSARY TO REFER TO
003200*    BOTH FILES IN THE OUTPUT PROCEDURE. IN ADDITION, BOTH FILES
003300*    ARE REFERENCED IN THE MAINLINE BETWEEN THE SORTS.
003400*      BEFORE SORTS        AFTER FIRST SORT    AFTER SECOND SORT
003500*      NON-KEY KEY         NON-KEY KEY         NON-KEY KEY
003600*      X(72)   S9(8)       X(72)   S9(8)       X(72)   S9(8)
003700*
003800*      A        00000000   A       +00000099   A       -00000199
003900*      A       +00000001   A       +00000098   A       -00000198
004000*      A       +00000002   A       +00000097   A       -00000197
004100*        .         .         .         .         .         .
004200*        .         .         .         .         .         .
004300*        .         .         .         .         .         .
004400*      A       +00000098   A       +00000001   A       -00000101
004500*      A       +00000099   A        00000000   A       -00000100
004600*      A       -00000100   A       -00000100   A        00000000
004700*      A       -00000101   A       -00000101   A       +00000001
004800*        .         .         .         .         .         .
004900*        .         .         .         .         .         .
005000*        .         .         .         .         .         .
005100*      A       -00000199   A       -00000199   A       +00000099
005200*    THE NON-KEY ITEMS ARE ALL JUSTIFIED RIGHT.
005300*
005400*    THE SAME SORT AREA CLAUSE IS EXERCISED IN THIS PROGRAM.
005500*
005600 ENVIRONMENT DIVISION.
005700 CONFIGURATION SECTION.
005800 SOURCE-COMPUTER.
005900     XXXXX082.
006000 OBJECT-COMPUTER.
006100     XXXXX083.
006200 INPUT-OUTPUT SECTION.
006300 FILE-CONTROL.
006400     SELECT PRINT-FILE ASSIGN TO
006500     XXXXX055.
006600     SELECT   FIRST-SORTFILE ASSIGN  TO
006700     XXXXX027.
006800     SELECT   SECOND-SORTFILE ASSIGN TO
006900     XXXXX028.
007000     SELECT   SORTIN-2C ASSIGN TO
007100     XXXXX001.
007200     SELECT   SORTOUT-2C ASSIGN TO
007300     XXXXX002.
007400 I-O-CONTROL.
007500     SAME SORT AREA FOR FIRST-SORTFILE
007600                        SECOND-SORTFILE.
007700 DATA DIVISION.
007800 FILE SECTION.
007900 FD  PRINT-FILE.
008000 01  PRINT-REC PICTURE X(120).
008100 01  DUMMY-RECORD PICTURE X(120).
008200 FD  SORTIN-2C
008300     LABEL RECORDS STANDARD
008400C    VALUE OF
008500C    XXXXX074
008600C    IS
008700C    XXXXX075
008800G    XXXXX069
008900     DATA RECORD IS SORTIN-REC.
009000 01  SORTIN-REC.
009100     02 SORTIN-NON-KEY  PICTURE X(72) JUSTIFIED RIGHT.
009200     02 SORTIN-KEY      PICTURE S9(8) COMPUTATIONAL.
009300 FD  SORTOUT-2C
009400     LABEL RECORDS STANDARD
009500C    VALUE OF
009600C    XXXXX074
009700C    IS
009800C    XXXXX076
009900G    XXXXX069
010000     DATA RECORD IS SORTOUT-REC.
010100 01  SORTOUT-REC.
010200     02 SORTOUT-NON-KEY PICTURE X(72) JUSTIFIED RIGHT.
010300     02 SORTOUT-KEY     PICTURE S9(8) COMPUTATIONAL.
010400 SD  FIRST-SORTFILE
010500     DATA RECORD IS FIRST-SORTFILE-REC.
010600 01  FIRST-SORTFILE-REC.
010700     02 FIRST-NON-KEY   PICTURE X(72) JUSTIFIED RIGHT.
010800     02 FIRST-KEY       PICTURE S9(8) USAGE IS COMPUTATIONAL.
010900 SD  SECOND-SORTFILE.
011000 01  SECOND-SORTFILE-REC.
011100     02 SECOND-NON-KEY  PICTURE X(72) JUSTIFIED.
011200     02 SECOND-KEY      PICTURE S9(8) COMPUTATIONAL.
011300 WORKING-STORAGE SECTION.
011400 77  BREAKDOWN-SWITCH   PICTURE 9 VALUE ZERO.
011500 77  SP-ACE             PICTURE X(14) VALUE "      (SPACES)".
011600 77  UTIL-CTR           PICTURE S99999.
011700 77  JUSTIFIED-A        PICTURE X(72) VALUE "
011800-    "                                                  A".
011900 01  COMPUTED-BREAKDOWN.
012000     02 FIRST-20        PICTURE X(20).
012100     02 SECOND-20       PICTURE X(20).
012200     02 THIRD-20        PICTURE X(20).
012300     02 FOURTH-20       PICTURE X(20).
012400 01  FILE-RECORD-INFORMATION-REC.
012500     03 FILE-RECORD-INFO-SKELETON.
012600        05 FILLER                 PICTURE X(48)       VALUE
012700             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
012800        05 FILLER                 PICTURE X(46)       VALUE
012900             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
013000        05 FILLER                 PICTURE X(26)       VALUE
013100             ",LFIL=000000,ORG=  ,LBLR= ".
013200        05 FILLER                 PICTURE X(37)       VALUE
013300             ",RECKEY=                             ".
013400        05 FILLER                 PICTURE X(38)       VALUE
013500             ",ALTKEY1=                             ".
013600        05 FILLER                 PICTURE X(38)       VALUE
013700             ",ALTKEY2=                             ".
013800        05 FILLER                 PICTURE X(7)        VALUE SPACE.
013900     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
014000        05 FILE-RECORD-INFO-P1-120.
014100           07 FILLER              PIC X(5).
014200           07 XFILE-NAME           PIC X(6).
014300           07 FILLER              PIC X(8).
014400           07 XRECORD-NAME         PIC X(6).
014500           07 FILLER              PIC X(1).
014600           07 REELUNIT-NUMBER     PIC 9(1).
014700           07 FILLER              PIC X(7).
014800           07 XRECORD-NUMBER       PIC 9(6).
014900           07 FILLER              PIC X(6).
015000           07 UPDATE-NUMBER       PIC 9(2).
015100           07 FILLER              PIC X(5).
015200           07 ODO-NUMBER          PIC 9(4).
015300           07 FILLER              PIC X(5).
015400           07 XPROGRAM-NAME        PIC X(5).
015500           07 FILLER              PIC X(7).
015600           07 XRECORD-LENGTH       PIC 9(6).
015700           07 FILLER              PIC X(7).
015800           07 CHARS-OR-RECORDS    PIC X(2).
015900           07 FILLER              PIC X(1).
016000           07 XBLOCK-SIZE          PIC 9(4).
016100           07 FILLER              PIC X(6).
016200           07 RECORDS-IN-FILE     PIC 9(6).
016300           07 FILLER              PIC X(5).
016400           07 XFILE-ORGANIZATION   PIC X(2).
016500           07 FILLER              PIC X(6).
016600           07 XLABEL-TYPE          PIC X(1).
016700        05 FILE-RECORD-INFO-P121-240.
016800           07 FILLER              PIC X(8).
016900           07 XRECORD-KEY          PIC X(29).
017000           07 FILLER              PIC X(9).
017100           07 ALTERNATE-KEY1      PIC X(29).
017200           07 FILLER              PIC X(9).
017300           07 ALTERNATE-KEY2      PIC X(29).
017400           07 FILLER              PIC X(7).
017500 01  TEST-RESULTS.
017600     02 FILLER                   PIC X      VALUE SPACE.
017700     02 FEATURE                  PIC X(20)  VALUE SPACE.
017800     02 FILLER                   PIC X      VALUE SPACE.
017900     02 P-OR-F                   PIC X(5)   VALUE SPACE.
018000     02 FILLER                   PIC X      VALUE SPACE.
018100     02  PAR-NAME.
018200       03 FILLER                 PIC X(19)  VALUE SPACE.
018300       03  PARDOT-X              PIC X      VALUE SPACE.
018400       03 DOTVALUE               PIC 99     VALUE ZERO.
018500     02 FILLER                   PIC X(8)   VALUE SPACE.
018600     02 RE-MARK                  PIC X(61).
018700 01  TEST-COMPUTED.
018800     02 FILLER                   PIC X(30)  VALUE SPACE.
018900     02 FILLER                   PIC X(17)  VALUE
019000            "       COMPUTED=".
019100     02 COMPUTED-X.
019200     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
019300     03 COMPUTED-N               REDEFINES COMPUTED-A
019400                                 PIC -9(9).9(9).
019500     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
019600     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
019700     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
019800     03       CM-18V0 REDEFINES COMPUTED-A.
019900         04 COMPUTED-18V0                    PIC -9(18).
020000         04 FILLER                           PIC X.
020100     03 FILLER PIC X(50) VALUE SPACE.
020200 01  TEST-CORRECT.
020300     02 FILLER PIC X(30) VALUE SPACE.
020400     02 FILLER PIC X(17) VALUE "       CORRECT =".
020500     02 CORRECT-X.
020600     03 CORRECT-A                  PIC X(20) VALUE SPACE.
020700     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
020800     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
020900     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
021000     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
021100     03      CR-18V0 REDEFINES CORRECT-A.
021200         04 CORRECT-18V0                     PIC -9(18).
021300         04 FILLER                           PIC X.
021400     03 FILLER PIC X(2) VALUE SPACE.
021500     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
021600 01  CCVS-C-1.
021700     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
021800-    "SS  PARAGRAPH-NAME
021900-    "       REMARKS".
022000     02 FILLER                     PIC X(20)    VALUE SPACE.
022100 01  CCVS-C-2.
022200     02 FILLER                     PIC X        VALUE SPACE.
022300     02 FILLER                     PIC X(6)     VALUE "TESTED".
022400     02 FILLER                     PIC X(15)    VALUE SPACE.
022500     02 FILLER                     PIC X(4)     VALUE "FAIL".
022600     02 FILLER                     PIC X(94)    VALUE SPACE.
022700 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
022800 01  REC-CT                        PIC 99       VALUE ZERO.
022900 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
023000 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
023100 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
023200 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
023300 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
023400 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
023500 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
023600 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
023700 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
023800 01  CCVS-H-1.
023900     02  FILLER                    PIC X(39)    VALUE SPACES.
024000     02  FILLER                    PIC X(42)    VALUE
024100     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
024200     02  FILLER                    PIC X(39)    VALUE SPACES.
024300 01  CCVS-H-2A.
024400   02  FILLER                        PIC X(40)  VALUE SPACE.
024500   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
024600   02  FILLER                        PIC XXXX   VALUE
024700     "4.2 ".
024800   02  FILLER                        PIC X(28)  VALUE
024900            " COPY - NOT FOR DISTRIBUTION".
025000   02  FILLER                        PIC X(41)  VALUE SPACE.
025100
025200 01  CCVS-H-2B.
025300   02  FILLER                        PIC X(15)  VALUE
025400            "TEST RESULT OF ".
025500   02  TEST-ID                       PIC X(9).
025600   02  FILLER                        PIC X(4)   VALUE
025700            " IN ".
025800   02  FILLER                        PIC X(12)  VALUE
025900     " HIGH       ".
026000   02  FILLER                        PIC X(22)  VALUE
026100            " LEVEL VALIDATION FOR ".
026200   02  FILLER                        PIC X(58)  VALUE
026300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
026400 01  CCVS-H-3.
026500     02  FILLER                      PIC X(34)  VALUE
026600            " FOR OFFICIAL USE ONLY    ".
026700     02  FILLER                      PIC X(58)  VALUE
026800     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
026900     02  FILLER                      PIC X(28)  VALUE
027000            "  COPYRIGHT   1985 ".
027100 01  CCVS-E-1.
027200     02 FILLER                       PIC X(52)  VALUE SPACE.
027300     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
027400     02 ID-AGAIN                     PIC X(9).
027500     02 FILLER                       PIC X(45)  VALUE SPACES.
027600 01  CCVS-E-2.
027700     02  FILLER                      PIC X(31)  VALUE SPACE.
027800     02  FILLER                      PIC X(21)  VALUE SPACE.
027900     02 CCVS-E-2-2.
028000         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
028100         03 FILLER                   PIC X      VALUE SPACE.
028200         03 ENDER-DESC               PIC X(44)  VALUE
028300            "ERRORS ENCOUNTERED".
028400 01  CCVS-E-3.
028500     02  FILLER                      PIC X(22)  VALUE
028600            " FOR OFFICIAL USE ONLY".
028700     02  FILLER                      PIC X(12)  VALUE SPACE.
028800     02  FILLER                      PIC X(58)  VALUE
028900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
029000     02  FILLER                      PIC X(13)  VALUE SPACE.
029100     02 FILLER                       PIC X(15)  VALUE
029200             " COPYRIGHT 1985".
029300 01  CCVS-E-4.
029400     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
029500     02 FILLER                       PIC X(4)   VALUE " OF ".
029600     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
029700     02 FILLER                       PIC X(40)  VALUE
029800      "  TESTS WERE EXECUTED SUCCESSFULLY".
029900 01  XXINFO.
030000     02 FILLER                       PIC X(19)  VALUE
030100            "*** INFORMATION ***".
030200     02 INFO-TEXT.
030300       04 FILLER                     PIC X(8)   VALUE SPACE.
030400       04 XXCOMPUTED                 PIC X(20).
030500       04 FILLER                     PIC X(5)   VALUE SPACE.
030600       04 XXCORRECT                  PIC X(20).
030700     02 INF-ANSI-REFERENCE           PIC X(48).
030800 01  HYPHEN-LINE.
030900     02 FILLER  PIC IS X VALUE IS SPACE.
031000     02 FILLER  PIC IS X(65)    VALUE IS "************************
031100-    "*****************************************".
031200     02 FILLER  PIC IS X(54)    VALUE IS "************************
031300-    "******************************".
031400 01  CCVS-PGM-ID                     PIC X(9)   VALUE
031500     "ST133A".
031600 PROCEDURE DIVISION.
031700 CCVS1 SECTION.
031800 OPEN-FILES.
031900     OPEN     OUTPUT PRINT-FILE.
032000     MOVE CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
032100     MOVE    SPACE TO TEST-RESULTS.
032200     PERFORM  HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
032300     GO TO CCVS1-EXIT.
032400 CLOSE-FILES.
032500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
032600 TERMINATE-CCVS.
032700S    EXIT PROGRAM.
032800STERMINATE-CALL.
032900     STOP     RUN.
033000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
033100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
033200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
033300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
033400     MOVE "****TEST DELETED****" TO RE-MARK.
033500 PRINT-DETAIL.
033600     IF REC-CT NOT EQUAL TO ZERO
033700             MOVE "." TO PARDOT-X
033800             MOVE REC-CT TO DOTVALUE.
033900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
034000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
034100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
034200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
034300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
034400     MOVE SPACE TO CORRECT-X.
034500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
034600     MOVE     SPACE TO RE-MARK.
034700 HEAD-ROUTINE.
034800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
034900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
035200 COLUMN-NAMES-ROUTINE.
035300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
035400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
035500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
035600 END-ROUTINE.
035700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
035800 END-RTN-EXIT.
035900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
036000 END-ROUTINE-1.
036100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
036200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
036300      ADD PASS-COUNTER TO ERROR-HOLD.
036400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
036500      MOVE PASS-COUNTER TO CCVS-E-4-1.
036600      MOVE ERROR-HOLD TO CCVS-E-4-2.
036700      MOVE CCVS-E-4 TO CCVS-E-2-2.
036800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
036900  END-ROUTINE-12.
037000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
037100     IF       ERROR-COUNTER IS EQUAL TO ZERO
037200         MOVE "NO " TO ERROR-TOTAL
037300         ELSE
037400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
037500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
037600     PERFORM WRITE-LINE.
037700 END-ROUTINE-13.
037800     IF DELETE-COUNTER IS EQUAL TO ZERO
037900         MOVE "NO " TO ERROR-TOTAL  ELSE
038000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
038100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
038200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038300      IF   INSPECT-COUNTER EQUAL TO ZERO
038400          MOVE "NO " TO ERROR-TOTAL
038500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
038600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
038700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
038900 WRITE-LINE.
039000     ADD 1 TO RECORD-COUNT.
039100Y    IF RECORD-COUNT GREATER 42
039200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
039300Y        MOVE SPACE TO DUMMY-RECORD
039400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
039500Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
039600Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
039700Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
039800Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
039900Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
040000Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
040100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
040200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
040300Y        MOVE ZERO TO RECORD-COUNT.
040400     PERFORM WRT-LN.
040500 WRT-LN.
040600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
040700     MOVE SPACE TO DUMMY-RECORD.
040800 BLANK-LINE-PRINT.
040900     PERFORM WRT-LN.
041000 FAIL-ROUTINE.
041100     IF     COMPUTED-X NOT EQUAL TO SPACE
041200            GO TO   FAIL-ROUTINE-WRITE.
041300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
041400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
041500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
041600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
041700     MOVE   SPACES TO INF-ANSI-REFERENCE.
041800     GO TO  FAIL-ROUTINE-EX.
041900 FAIL-ROUTINE-WRITE.
042000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
042100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
042200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
042300     MOVE   SPACES TO COR-ANSI-REFERENCE.
042400 FAIL-ROUTINE-EX. EXIT.
042500 BAIL-OUT.
042600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
042700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
042800 BAIL-OUT-WRITE.
042900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
043000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
043100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
043200     MOVE   SPACES TO INF-ANSI-REFERENCE.
043300 BAIL-OUT-EX. EXIT.
043400 CCVS1-EXIT.
043500     EXIT.
043600 MAINLINE SECTION.
043700 FIRST-SORT-PARA.
043800     SORT     FIRST-SORTFILE  ON DESCENDING KEY
043900              FIRST-KEY
044000              INPUT PROCEDURE INPROC
044100              GIVING SORTOUT-2C.
044200     MOVE    "FIRST SORT DONE" TO FEATURE.
044300     PERFORM PRINT-DETAIL.
044400 TAPECOPY-OPEN.
044500     OPEN     INPUT SORTOUT-2C.
044600     OPEN     OUTPUT SORTIN-2C.
044700 TAPECOPY-LOOP.
044800     READ     SORTOUT-2C AT END GO TO TAPECOPY-CLOSE.
044900     MOVE     SORTOUT-REC TO SORTIN-REC.
045000     WRITE    SORTIN-REC.
045100     GO       TO TAPECOPY-LOOP.
045200 TAPECOPY-CLOSE.
045300     CLOSE    SORTIN-2C.
045400     CLOSE    SORTOUT-2C.
045500     MOVE    "TAPE COPY DONE" TO FEATURE.
045600     PERFORM PRINT-DETAIL.
045700*        NOTE THIS TAPECOPY ROUTINE HAS NO EFFECT ON THE SORTS ---
045800*             ITS ONLY FUNCTION IS TO EXERCISE THE OPEN, CLOSE,
045900*             READ, AND WRITE VERBS IN THE MAINLINE.
046000 SECOND-SORT-PARA.
046100     SORT     SECOND-SORTFILE ON ASCENDING KEY
046200              SECOND-KEY
046300              USING SORTOUT-2C
046400              OUTPUT PROCEDURE OUTPROC.
046500     MOVE    "SECOND SORT DONE" TO FEATURE.
046600     PERFORM PRINT-DETAIL.
046700     GO TO    CCVS-EXIT.
046800 INPROC SECTION.
046900 INPROC-INIT.
047000     MOVE     ZERO TO UTIL-CTR.
047100 INPROC-LOOP.
047200     IF       UTIL-CTR LESS THAN 100
047300              MOVE UTIL-CTR TO FIRST-KEY
047400              ELSE
047500              MULTIPLY UTIL-CTR BY -1 GIVING FIRST-KEY.
047600     MOVE     "A" TO FIRST-NON-KEY.
047700     RELEASE  FIRST-SORTFILE-REC.
047800     ADD      1 TO UTIL-CTR.
047900     IF       UTIL-CTR LESS THAN 200 GO TO INPROC-LOOP.
048000 INPROC-EXIT.
048100     EXIT.
048200 OUTPROC SECTION.
048300 SORT-INIT-1.
048400     MOVE     ZERO TO UTIL-CTR.
048500 SORT-TEST-1.
048600     MOVE    "NUMERIC KEY CHECKS" TO FEATURE.
048700     MOVE     "SORT-TEST-1 " TO PAR-NAME.
048800     PERFORM  RETURN-SORTFILE.
048900     IF       SECOND-KEY NOT EQUAL TO -199  GO TO SORT-FAIL-1.
049000     IF       SECOND-NON-KEY EQUAL TO JUSTIFIED-A
049100              PERFORM PASS-1 GO TO SORT-WRITE-1.
049200 SORT-FAIL-1.
049300     PERFORM  FAIL-1.
049400     MOVE     SECOND-KEY TO COMPUTED-N.
049500     MOVE     -199 TO CORRECT-N
049600     MOVE     "KEY AREA" TO RE-MARK.
049700     PERFORM  PRINT-DETAIL-1.
049800     MOVE     SECOND-NON-KEY TO COMPUTED-BREAKDOWN.
049900     PERFORM  NON-KEY-BREAKDOWN.
050000 SORT-WRITE-1.
050100     PERFORM  PRINT-DETAIL-1.
050200 SORT-TEST-2.
050300     MOVE     "SORT-TEST-2" TO PAR-NAME.
050400     PERFORM  RETURN-SORTFILE.
050500     IF       SECOND-KEY NOT EQUAL TO -198  GO TO SORT-FAIL-2.
050600     IF       SECOND-NON-KEY EQUAL TO JUSTIFIED-A
050700              PERFORM PASS-1 GO TO SORT-WRITE-2.
050800 SORT-FAIL-2.
050900     PERFORM  FAIL-1.
051000     MOVE     SECOND-KEY TO COMPUTED-N.
051100     MOVE     -198 TO CORRECT-N
051200     MOVE     "KEY AREA" TO RE-MARK.
051300     PERFORM  PRINT-DETAIL-1.
051400     MOVE     SECOND-NON-KEY TO COMPUTED-BREAKDOWN.
051500     PERFORM  NON-KEY-BREAKDOWN.
051600 SORT-WRITE-2.
051700     PERFORM  PRINT-DETAIL-1.
051800 SORT-TEST-3.
051900     MOVE     "SORT-TEST-3" TO PAR-NAME.
052000     PERFORM  RETURN-SORTFILE 98 TIMES.
052100     IF       SECOND-KEY NOT EQUAL TO -100  GO TO SORT-FAIL-3.
052200     IF       SECOND-NON-KEY EQUAL TO JUSTIFIED-A
052300              PERFORM PASS-1 GO TO SORT-WRITE-3.
052400 SORT-FAIL-3.
052500     PERFORM FAIL-1.
052600     MOVE     SECOND-KEY TO COMPUTED-N.
052700     MOVE     -100 TO CORRECT-N.
052800     MOVE     "KEY AREA" TO RE-MARK.
052900     PERFORM  PRINT-DETAIL-1.
053000     MOVE     SECOND-NON-KEY TO COMPUTED-BREAKDOWN.
053100     PERFORM  NON-KEY-BREAKDOWN.
053200 SORT-WRITE-3.
053300     PERFORM  PRINT-DETAIL-1.
053400 SORT-TEST-4.
053500     MOVE     "SORT-TEST-4" TO PAR-NAME.
053600     PERFORM  RETURN-SORTFILE.
053700     IF       SECOND-KEY NOT EQUAL TO ZERO GO TO SORT-FAIL-4.
053800     IF       SECOND-NON-KEY EQUAL TO JUSTIFIED-A
053900              PERFORM PASS-1 GO TO SORT-WRITE-4.
054000 SORT-FAIL-4.
054100     PERFORM  FAIL-1.
054200     MOVE     SECOND-KEY TO COMPUTED-N.
054300     MOVE     ZERO TO CORRECT-N.
054400     MOVE     "KEY AREA" TO RE-MARK.
054500     PERFORM  PRINT-DETAIL-1.
054600     MOVE     SECOND-NON-KEY TO COMPUTED-BREAKDOWN.
054700     PERFORM  NON-KEY-BREAKDOWN.
054800 SORT-WRITE-4.
054900     PERFORM  PRINT-DETAIL-1.
055000 SORT-TEST-5.
055100     MOVE     "SORT-TEST-5" TO PAR-NAME.
055200     PERFORM  RETURN-SORTFILE 99 TIMES.
055300     IF       SECOND-KEY NOT EQUAL TO 99 GO TO SORT-FAIL-5.
055400     IF       SECOND-NON-KEY EQUAL TO JUSTIFIED-A
055500              PERFORM PASS-1 GO TO SORT-WRITE-5.
055600 SORT-FAIL-5.
055700     PERFORM  FAIL-1.
055800     MOVE     SECOND-KEY TO COMPUTED-N.
055900     MOVE     +99  TO CORRECT-N
056000     MOVE     "KEY AREA" TO RE-MARK.
056100     PERFORM  PRINT-DETAIL-1.
056200     MOVE     SECOND-NON-KEY TO COMPUTED-BREAKDOWN.
056300     PERFORM  NON-KEY-BREAKDOWN.
056400 SORT-WRITE-5.
056500     PERFORM  PRINT-DETAIL-1.
056600 SORT-TEST-6.
056700     MOVE     "SORT-TEST-6 " TO PAR-NAME.
056800     RETURN   SECOND-SORTFILE AT END
056900              PERFORM PASS-1 GO TO SORT-WRITE-6.
057000 SORT-FAIL-6.
057100     PERFORM  FAIL-1.
057200     MOVE     UTIL-CTR TO COMPUTED-N.
057300     MOVE     201 TO CORRECT-N.
057400     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
057500     PERFORM  PRINT-DETAIL-1.
057600     MOVE     SECOND-KEY TO COMPUTED-N.
057700     MOVE     "KEY AREA" TO RE-MARK.
057800     PERFORM  PRINT-DETAIL-1.
057900     MOVE     SECOND-NON-KEY TO COMPUTED-BREAKDOWN.
058000     MOVE     1 TO BREAKDOWN-SWITCH.
058100     PERFORM  NON-KEY-BREAKDOWN.
058200     MOVE     ZERO TO BREAKDOWN-SWITCH.
058300 SORT-WRITE-6.
058400     PERFORM  PRINT-DETAIL-1.
058500 SORT-EXIT-A.
058600     EXIT.
058700 SORT-INIT-B.
058800     MOVE     ZERO TO UTIL-CTR.
058900     OPEN     INPUT SORTOUT-2C.
059000 SORT-TEST-7.
059100     MOVE     "SORT-TEST-7 " TO PAR-NAME.
059200     PERFORM  READ-SORTOUT.
059300     IF       SORTOUT-KEY NOT EQUAL TO +99   GO TO SORT-FAIL-7.
059400     IF       SORTOUT-NON-KEY EQUAL TO JUSTIFIED-A
059500              PERFORM PASS-1 GO TO SORT-WRITE-7.
059600 SORT-FAIL-7.
059700     PERFORM  FAIL-1.
059800     MOVE     SORTOUT-KEY TO COMPUTED-N.
059900     MOVE     +99  TO CORRECT-N
060000     MOVE     "KEY AREA" TO RE-MARK.
060100     PERFORM  PRINT-DETAIL-1.
060200     MOVE     SORTOUT-NON-KEY TO COMPUTED-BREAKDOWN.
060300     PERFORM  NON-KEY-BREAKDOWN.
060400 SORT-WRITE-7.
060500     PERFORM  PRINT-DETAIL-1.
060600 SORT-TEST-8.
060700     MOVE     "SORT-TEST-8 " TO PAR-NAME.
060800     PERFORM  READ-SORTOUT.
060900     IF       SORTOUT-KEY NOT EQUAL TO +98   GO TO SORT-FAIL-8.
061000     IF       SORTOUT-NON-KEY EQUAL TO JUSTIFIED-A
061100              PERFORM PASS-1 GO TO SORT-WRITE-8.
061200 SORT-FAIL-8.
061300     PERFORM  FAIL-1.
061400     MOVE     SORTOUT-KEY TO COMPUTED-N.
061500     MOVE     +98 TO CORRECT-N
061600     MOVE     "KEY AREA" TO RE-MARK.
061700     PERFORM  PRINT-DETAIL-1.
061800     MOVE     SORTOUT-NON-KEY TO COMPUTED-BREAKDOWN.
061900     PERFORM  NON-KEY-BREAKDOWN.
062000 SORT-WRITE-8.
062100     PERFORM  PRINT-DETAIL-1.
062200 SORT-TEST-9.
062300     MOVE     "SORT-TEST-9 " TO PAR-NAME.
062400     PERFORM  READ-SORTOUT 98 TIMES.
062500     IF       SORTOUT-KEY NOT EQUAL TO ZERO  GO TO SORT-FAIL-9.
062600     IF       SORTOUT-NON-KEY EQUAL TO JUSTIFIED-A
062700              PERFORM PASS-1 GO TO SORT-WRITE-9.
062800 SORT-FAIL-9.
062900     PERFORM  FAIL-1.
063000     MOVE     SORTOUT-KEY TO COMPUTED-N.
063100     MOVE     ZERO TO CORRECT-N
063200     MOVE     "KEY AREA" TO RE-MARK.
063300     PERFORM  PRINT-DETAIL-1.
063400     MOVE     SORTOUT-NON-KEY TO COMPUTED-BREAKDOWN.
063500     PERFORM  NON-KEY-BREAKDOWN.
063600 SORT-WRITE-9.
063700     PERFORM  PRINT-DETAIL-1.
063800 SORT-TEST-10.
063900     MOVE     "SORT-TEST-10 " TO PAR-NAME.
064000     PERFORM  READ-SORTOUT.
064100     IF       SORTOUT-KEY NOT EQUAL TO -100  GO TO SORT-FAIL-11.
064200     IF       SORTOUT-NON-KEY EQUAL TO JUSTIFIED-A
064300              PERFORM PASS-1 GO TO SORT-WRITE-10.
064400 SORT-FAIL-10.
064500     PERFORM  FAIL-1.
064600     MOVE     SORTOUT-KEY TO COMPUTED-N.
064700     MOVE     -100 TO CORRECT-N
064800     MOVE     "KEY AREA" TO RE-MARK.
064900     PERFORM  PRINT-DETAIL-1.
065000     MOVE     SORTOUT-NON-KEY TO COMPUTED-BREAKDOWN.
065100     PERFORM  NON-KEY-BREAKDOWN.
065200 SORT-WRITE-10.
065300     PERFORM  PRINT-DETAIL-1.
065400 SORT-TEST-11.
065500     MOVE     "SORT-TEST-11 " TO PAR-NAME.
065600     PERFORM  READ-SORTOUT 99 TIMES.
065700     IF       SORTOUT-KEY NOT EQUAL TO -199  GO TO SORT-FAIL-12.
065800     IF       SORTOUT-NON-KEY EQUAL TO JUSTIFIED-A
065900              PERFORM PASS-1 GO TO SORT-WRITE-11.
066000 SORT-FAIL-11.
066100     PERFORM  FAIL-1.
066200     MOVE     SORTOUT-KEY TO COMPUTED-N.
066300     MOVE     -199 TO CORRECT-N
066400     MOVE     "KEY AREA" TO RE-MARK.
066500     PERFORM  PRINT-DETAIL-1.
066600     MOVE     SORTOUT-NON-KEY TO COMPUTED-BREAKDOWN.
066700     PERFORM  NON-KEY-BREAKDOWN.
066800 SORT-WRITE-11.
066900     PERFORM  PRINT-DETAIL-1.
067000 SORT-TEST-12.
067100     MOVE     "SORT-TEST-12 " TO PAR-NAME.
067200     READ     SORTOUT-2C AT END
067300              PERFORM PASS-1 GO TO SORT-WRITE-12.
067400 SORT-FAIL-12.
067500     PERFORM  FAIL-1.
067600     MOVE     UTIL-CTR TO COMPUTED-N.
067700     MOVE     201 TO CORRECT-N.
067800     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
067900     PERFORM  PRINT-DETAIL-1.
068000     MOVE     SORTOUT-KEY TO COMPUTED-N.
068100     MOVE     "KEY AREA" TO RE-MARK.
068200     PERFORM  PRINT-DETAIL-1.
068300     MOVE     SORTOUT-NON-KEY TO COMPUTED-BREAKDOWN.
068400     MOVE     1 TO BREAKDOWN-SWITCH.
068500     PERFORM  NON-KEY-BREAKDOWN.
068600     MOVE     ZERO TO BREAKDOWN-SWITCH.
068700 SORT-WRITE-12.
068800     PERFORM  PRINT-DETAIL-1.
068900 SORT-EXIT-B.
069000     EXIT.
069100 SORT-INIT-C.
069200     OPEN     INPUT SORTIN-2C.
069300     MOVE     ZERO TO UTIL-CTR.
069400 SORT-TEST-13.
069500     MOVE     "SORT-TEST-13 " TO PAR-NAME.
069600     PERFORM  READ-SORTIN.
069700     IF       SORTIN-KEY NOT EQUAL TO +99    GO TO SORT-FAIL-13.
069800     IF       SORTIN-NON-KEY EQUAL TO JUSTIFIED-A
069900              PERFORM PASS-1 GO TO SORT-WRITE-13.
070000 SORT-FAIL-13.
070100     PERFORM  FAIL-1.
070200     MOVE     SORTIN-KEY TO COMPUTED-N.
070300     MOVE     +99  TO CORRECT-N
070400     MOVE     "KEY AREA" TO RE-MARK.
070500     PERFORM  PRINT-DETAIL-1.
070600     MOVE     SORTIN-NON-KEY TO COMPUTED-BREAKDOWN.
070700     PERFORM  NON-KEY-BREAKDOWN.
070800 SORT-WRITE-13.
070900     PERFORM  PRINT-DETAIL-1.
071000 SORT-TEST-14.
071100     MOVE     "SORT-TEST-14 " TO PAR-NAME.
071200     PERFORM  READ-SORTIN.
071300     IF       SORTIN-KEY NOT EQUAL TO +98 GO TO SORT-FAIL-14.
071400     IF       SORTIN-NON-KEY EQUAL TO JUSTIFIED-A
071500              PERFORM PASS-1 GO TO SORT-WRITE-14.
071600 SORT-FAIL-14.
071700     PERFORM  FAIL-1.
071800     MOVE     SORTIN-KEY TO COMPUTED-N.
071900     MOVE     +98  TO CORRECT-N
072000     MOVE     "KEY AREA" TO RE-MARK.
072100     PERFORM  PRINT-DETAIL-1.
072200     MOVE     SORTIN-NON-KEY TO COMPUTED-BREAKDOWN.
072300     PERFORM  NON-KEY-BREAKDOWN.
072400 SORT-WRITE-14.
072500     PERFORM  PRINT-DETAIL-1.
072600 SORT-TEST-15.
072700     MOVE     "SORT-TEST-15 " TO PAR-NAME.
072800     PERFORM  READ-SORTIN 98 TIMES.
072900     IF       SORTIN-KEY NOT EQUAL TO ZERO  GO TO SORT-FAIL-15.
073000     IF       SORTIN-NON-KEY EQUAL TO JUSTIFIED-A
073100              PERFORM PASS-1 GO TO SORT-WRITE-15.
073200 SORT-FAIL-15.
073300     PERFORM  FAIL-1.
073400     MOVE     SORTIN-KEY TO COMPUTED-N.
073500     MOVE     ZERO TO CORRECT-N
073600     MOVE     "KEY AREA" TO RE-MARK.
073700     PERFORM  PRINT-DETAIL-1.
073800     MOVE     SORTIN-NON-KEY TO COMPUTED-BREAKDOWN.
073900     PERFORM  NON-KEY-BREAKDOWN.
074000 SORT-WRITE-15.
074100     PERFORM  PRINT-DETAIL-1.
074200 SORT-TEST-16.
074300     MOVE     "SORT-TEST-16 " TO PAR-NAME.
074400     PERFORM  READ-SORTIN.
074500     IF       SORTIN-KEY NOT EQUAL TO -100  GO TO SORT-FAIL-16.
074600     IF       SORTIN-NON-KEY EQUAL TO JUSTIFIED-A
074700              PERFORM PASS-1 GO TO SORT-WRITE-16.
074800 SORT-FAIL-16.
074900     PERFORM  FAIL-1.
075000     MOVE     SORTIN-KEY TO COMPUTED-N.
075100     MOVE     -100 TO CORRECT-N
075200     MOVE     "KEY AREA" TO RE-MARK.
075300     PERFORM  PRINT-DETAIL-1.
075400     MOVE     SORTIN-NON-KEY TO COMPUTED-BREAKDOWN.
075500     PERFORM  NON-KEY-BREAKDOWN.
075600 SORT-WRITE-16.
075700     PERFORM  PRINT-DETAIL-1.
075800 SORT-TEST-17.
075900     MOVE     "SORT-TEST-17 " TO PAR-NAME.
076000     PERFORM  READ-SORTIN 99 TIMES.
076100     IF       SORTIN-KEY NOT EQUAL TO -199  GO TO SORT-FAIL-17.
076200     IF       SORTIN-NON-KEY EQUAL TO JUSTIFIED-A
076300              PERFORM PASS-1 GO TO SORT-WRITE-17.
076400 SORT-FAIL-17.
076500     PERFORM  FAIL-1.
076600     MOVE     SORTIN-KEY TO COMPUTED-N.
076700     MOVE     -199 TO CORRECT-N
076800     MOVE     "KEY AREA" TO RE-MARK.
076900     PERFORM  PRINT-DETAIL-1.
077000     MOVE     SORTIN-NON-KEY TO COMPUTED-BREAKDOWN.
077100     PERFORM  NON-KEY-BREAKDOWN.
077200 SORT-WRITE-17.
077300     PERFORM  PRINT-DETAIL-1.
077400 SORT-TEST-18.
077500     MOVE     "SORT-TEST-18" TO PAR-NAME.
077600     READ     SORTIN-2C AT END
077700              PERFORM PASS-1 GO TO SORT-WRITE-18.
077800 SORT-FAIL-18.
077900     PERFORM  FAIL-1.
078000     MOVE     UTIL-CTR TO COMPUTED-N.
078100     MOVE     201 TO CORRECT-N.
078200     MOVE     "END OF FILE NOT FOUND" TO RE-MARK.
078300     PERFORM  PRINT-DETAIL-1.
078400     MOVE     SORTIN-KEY TO COMPUTED-N.
078500     MOVE     "KEY AREA" TO RE-MARK.
078600     PERFORM  PRINT-DETAIL-1.
078700     MOVE     SORTIN-NON-KEY TO COMPUTED-BREAKDOWN.
078800     MOVE     1 TO BREAKDOWN-SWITCH.
078900     PERFORM  NON-KEY-BREAKDOWN.
079000     MOVE     ZERO TO BREAKDOWN-SWITCH.
079100 SORT-WRITE-18.
079200     PERFORM  PRINT-DETAIL-1.
079300 SORT-CLOSE-19.
079400     CLOSE    SORTIN-2C.
079500     CLOSE    SORTOUT-2C.
079600     GO       TO OUTPROC-EXIT.
079700 NON-KEY-BREAKDOWN.
079800     MOVE     FIRST-20 TO COMPUTED-A.
079900     IF       BREAKDOWN-SWITCH EQUAL TO ZERO
080000              MOVE SP-ACE TO CORRECT-A.
080100     MOVE     "FIRST 20 OF 72-CHAR FIELD" TO RE-MARK.
080200     PERFORM  PRINT-DETAIL-1.
080300     MOVE     SECOND-20 TO COMPUTED-A.
080400     IF       BREAKDOWN-SWITCH EQUAL TO ZERO
080500              MOVE SP-ACE TO CORRECT-A.
080600     MOVE     "SECOND 20 OF 72-CHAR FIELD" TO RE-MARK.
080700     PERFORM  PRINT-DETAIL-1.
080800     MOVE     THIRD-20 TO COMPUTED-A.
080900     IF       BREAKDOWN-SWITCH EQUAL TO ZERO
081000     MOVE SP-ACE TO CORRECT-A.
081100     MOVE     "THIRD 20 OF 72-CHAR FIELD" TO RE-MARK.
081200     PERFORM  PRINT-DETAIL-1.
081300     MOVE     FOURTH-20 TO COMPUTED-A.
081400     IF       BREAKDOWN-SWITCH EQUAL TO ZERO
081500              MOVE "           A" TO CORRECT-A.
081600     MOVE     "LAST 12 OF 72-CHAR FIELD" TO RE-MARK.
081700 RETURN-SORTFILE.
081800     ADD      1 TO UTIL-CTR.
081900     RETURN   SECOND-SORTFILE AT END GO TO RETURN-ERROR.
082000 RETURN-ERROR.
082100     MOVE     "RETURN-ERROR" TO PAR-NAME.
082200     PERFORM  FAIL-1.
082300     MOVE     UTIL-CTR TO COMPUTED-N.
082400     MOVE     201 TO CORRECT-N.
082500     MOVE     "END OF SORT FILE PREMATURE" TO RE-MARK.
082600     PERFORM  PRINT-DETAIL-1.
082700     GO       TO SORT-EXIT-A.
082800 READ-SORTOUT.
082900     ADD      1 TO UTIL-CTR.
083000     READ     SORTOUT-2C AT END GO TO READ-SORTOUT-ERROR.
083100 READ-SORTOUT-ERROR.
083200     MOVE     "READ-SORTOUT-ERROR" TO PAR-NAME.
083300     PERFORM  FAIL-1.
083400     MOVE     UTIL-CTR TO COMPUTED-N.
083500     MOVE     201 TO CORRECT-N.
083600     MOVE     "EOF PREMATURELY FOUND" TO RE-MARK.
083700     PERFORM  PRINT-DETAIL-1.
083800     GO       TO SORT-EXIT-B.
083900 READ-SORTIN.
084000     ADD      1 TO UTIL-CTR.
084100     READ     SORTIN-2C AT END GO TO READ-SORTIN-ERROR.
084200 READ-SORTIN-ERROR.
084300     MOVE     "READ-SORTIN-ERROR" TO PAR-NAME.
084400     PERFORM  FAIL-1.
084500     MOVE     UTIL-CTR TO COMPUTED-N.
084600     MOVE     201 TO CORRECT-N.
084700     MOVE     "EOF PREMATURELY FOUND" TO RE-MARK.
084800     PERFORM  PRINT-DETAIL-1.
084900     GO TO    SORT-CLOSE-19.
085000 INSPT-1. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
085100 PASS-1.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
085200 FAIL-1.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
085300 DE-LETE-1.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
085400     MOVE "****TEST DELETED****" TO RE-MARK.
085500 PRINT-DETAIL-1.
085600     IF REC-CT NOT EQUAL TO ZERO
085700             MOVE "." TO PARDOT-X
085800             MOVE REC-CT TO DOTVALUE.
085900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE-1.
086000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE-1
086100        PERFORM FAIL-ROUTINE-1 THRU FAIL-ROUTINE-EX-1
086200          ELSE PERFORM BAIL-OUT-1 THRU BAIL-OUT-EX-1.
086300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
086400     MOVE SPACE TO CORRECT-X.
086500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
086600     MOVE     SPACE TO RE-MARK.
086700 WRITE-LINE-1.
086800     ADD 1 TO RECORD-COUNT.
086900Y    IF RECORD-COUNT GREATER 50
087000Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
087100Y        MOVE SPACE TO DUMMY-RECORD
087200Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
087300Y        MOVE CCVS-C-1 TO DUMMY-RECORD PERFORM WRT-LN-1
087400Y        MOVE CCVS-C-2 TO DUMMY-RECORD PERFORM WRT-LN-1 2 TIMES
087500Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN-1
087600Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
087700Y        MOVE ZERO TO RECORD-COUNT.
087800     PERFORM WRT-LN-1.
087900 WRT-LN-1.
088000     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
088100     MOVE SPACE TO DUMMY-RECORD.
088200 BLANK-LINE-PRINT-1.
088300     PERFORM WRT-LN-1.
088400 FAIL-ROUTINE-1.
088500     IF COMPUTED-X NOT EQUAL TO SPACE GO TO FAIL-RTN-WRITE-1.
088600     IF CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-RTN-WRITE-1.
088700     MOVE "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
088800     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE-1 2 TIMES.
088900     GO TO FAIL-ROUTINE-EX-1.
089000 FAIL-RTN-WRITE-1.
089100     MOVE TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE-1
089200     MOVE TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE-1 2 TIMES.
089300 FAIL-ROUTINE-EX-1. EXIT.
089400 BAIL-OUT-1.
089500     IF COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE-1.
089600     IF CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX-1.
089700 BAIL-OUT-WRITE-1.
089800     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
089900     MOVE XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE-1 2 TIMES.
090000 BAIL-OUT-EX-1. EXIT.
090100 OUTPROC-EXIT.
090200     EXIT.
090300 CCVS-EXIT SECTION.
090400 CCVS-999999.
090500     GO TO CLOSE-FILES.
