000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST139A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    OBJECTIVE -
001500*        ROUTINE ST209 IS A TEST OF THE MERGE STATEMENT USING
001600*    THE ASCII COLLATING SEQUENCE AND FIXED LENGTH RECORDS.
001700*
001800*        TWO FILES ARE FIRST CREATED BY THE ROUTINE IN ASCENDING
001900*    ASCII ORDER.  THE ALPHABET NAME CLAUSE AND MERGE STATEMENT
002000*    WITH THE COLLATING SEQUENCE PHRASE ARE USED TO TEST THE
002100*    ABILITY OF THE COMPILER TO MERGE THE TWO FILES INTO A THIRD
002200*    FILE IN ASCENDING ASCII ORDER.
002300*
002400*
002500*    FEATURES TESTED -
002600*    *   ALPHABET-NAME IS STANDARD-1 (THE ASCII COLLATING SEQ.)
002700*    *   COLLATING SEQUENCE IS ALPHABET-NAME
002800*    *   FIXED LENGTH RECORDS
002900*    *   SAME SORT-MERGE AREA IN THE I-O-CONTROL PARAGRAPH
003000*    *   QUALIFIED ALPHANUMERIC AND NUMERIC SORT KEYS
003100*    *   USING FILE-NAME SERIES
003200*
003300*    *   MERGE MERGE-FILE-NAME
003400*        ASCENDING KEY-1 OF DATA-NAME-1
003500*        ON ASCENDING KEY KEY-2 OF DATA-NAME-2
003600*        SEQUENCE ALPHABET-ASCII-NAME
003700*        USING FILE-NAME-2 FILE-NAME-1
003800*        GIVING FILE-NAME-3.
003900*
004000*
004100*    FILES USED -
004200*    *   FILES SQ-FS1 AND SQ-FS2 ON MAGNETIC TAPE OR MASS-STORAGE
004300*    ARE FIRST CREATED BY ROUTINE ST209.  THE MERGE STATEMENT
004400*    USES BOTH OF THE FILES AND CREATES A THIRD FILE SQ-FS3.
004500*
004600*        SQ-FS1
004700*    51 RECORDS
004800*    FIXED LENGTH RECORDS 132 CHARACTERS
004900*    BLOCKED 1
005000*    RESERVE 2 AREAS
005100*
005200*        SQ-FS2
005300*    51 RECORDS
005400*    FIXED LENGTH RECORDS 132 CHARACTERS
005500*    BLOCKED 2
005600*    RESERVE 4 AREAS
005700*
005800*        SQ-FS3
005900*    FINAL TOTAL OF 102 RECORDS
006000*    FIXED LENGTH RECORDS 132 CHARACTERS
006100*    BLOCKED 3
006200*    RESERVE 4 AREAS
006300*
006400*        NOTE THAT SQ-FS3 IS THE RESULT OF MERGING SQ-FS1 AND
006500*    SQ-FS2.  THE RECORDS IN SQ-FS3 SHOULD ALTERNATE BETWEEN
006600*    SQ-FS1 AND SQ-FS2 BECAUSE THE ALPHANUMERIC KEYS ARE THE SAME
006700*    FOR BOTH FILES AND THE NUMERIC KEYS WERE MERGED INTO
006800*    ASCENDING ORDER.
006900*
007000*
007100*    X-CARDS USED  -
007200*    X-XXX014     SQ-FS1
007300*    X-XXX015     SQ-FS2
007400*    X-XXX016     SQ-FS3
007500*    X-XXX060     SQ-FS4
007600*    X-XXX027     MERGE FILE ST-FS1
007700*    X-55         SYSTEM PRINTER NAME.
007800*    X-82         SOURCE COMPUTER NAME.
007900*    X-83         OBJECT COMPUTER NAME.
008000*
008100*
008200*    OPTIONS RECOMMENDED -
008300*    *   *OPT8  X  TO BE USED IF NECESSARY TO DUMP THE
008400*                  FILES AS THEY ARE CREATED AND READ DURING
008500*                  TESTS 3 THRU 8.
008600*
008700*
008800*    TEST DESCRIPTIONS -
008900*    MRG-TEST-001     CHECKS THE CREATION OF SQ-FS1
009000*    MRG-TEST-002     CHECKS THE CREATION OF SQ-FS2
009100*    MRG-TEST-003     TESTS RECORDS 1-20 ON MERGE RESULT SQ-FS3
009200*    MRG-TEST-004     TESTS RECORDS 21-40 ON MERGE RESULT SQ-FS3
009300*    MRG-TEST-005     TESTS RECORDS 41-60 ON MERGE RESULT SQ-FS3
009400*    MRG-TEST-006     TESTS RECORDS 61-80 ON MERGE RESULT SQ-FS3
009500*    MRG-TEST-007     TESTS RECORDS 81-100 ON MERGE RESULT SQ-FS3
009600*    MRG-TEST-008     TESTS RECORDS 101-102 ON MERGE RESULT SQ-FS3
009700*    MRG-TEST-009     AN EOF CHECK ON SQ-FS3
009800*    MRG-TEST-010     CHECK THAT THE NUMERIC KEY ON THE LAST
009900*                     RECORD ON SQ-FS3 EQUALS 102
010000*
010100*
010200*    ************************************************************
010300 ENVIRONMENT DIVISION.
010400 CONFIGURATION SECTION.
010500 SOURCE-COMPUTER.
010600     XXXXX082.
010700 OBJECT-COMPUTER.
010800     XXXXX083.
010900 SPECIAL-NAMES.
011000     ALPHABET MY-FAVORITE-ALPHABET IS STANDARD-1.
011100 INPUT-OUTPUT SECTION.
011200 FILE-CONTROL.
011300     SELECT PRINT-FILE ASSIGN TO
011400     XXXXX055.
011500     SELECT SQ-FS1 ASSIGN
011600     XXXXX014
011700     ; ORGANIZATION IS SEQUENTIAL
011800     ; ACCESS MODE SEQUENTIAL
011900     ; RESERVE 2 AREAS.
012000     SELECT SQ-FS2 ASSIGN TO
012100     XXXXX015
012200     ORGANIZATION IS SEQUENTIAL
012300     ACCESS MODE IS SEQUENTIAL
012400     RESERVE 4 AREAS.
012500     SELECT SQ-FS3 ASSIGN TO
012600     XXXXX016
012700     ORGANIZATION IS SEQUENTIAL
012800     ; ACCESS MODE IS SEQUENTIAL
012900     RESERVE 4 AREAS.
013000     SELECT SQ-FS4 ASSIGN
013100     XXXXX060.
013200     SELECT ST-FS1 ASSIGN TO
013300     XXXXX027.
013400 I-O-CONTROL.
013500     SAME SORT-MERGE AREA FOR SQ-FS4, ST-FS1.
013600 DATA DIVISION.
013700 FILE SECTION.
013800 FD  PRINT-FILE.
013900 01  PRINT-REC PICTURE X(120).
014000 01  DUMMY-RECORD PICTURE X(120).
014100 FD  SQ-FS1
014200     LABEL RECORDS STANDARD
014300C    VALUE OF
014400C    XXXXX074
014500C    XXXXX075
014600C    BLOCK CONTAINS 1 RECORDS
014700G    XXXXX069
014800     RECORD CONTAINS 132 CHARACTERS.
014900 01  SQ-FS1R1-F-G-132.
015000     10 REC-PREAMBLE PIC X(120).
015100     10 REST-OF-1.
015200     20 KEY-1.
015300         30 ALPHAN-KEY PIC X.
015400         30 NUM-KEY PIC 999.
015500     20 KEY-2.
015600         30 ALPHAN-KEY PIC X.
015700         30 NUM-KEY PIC 999.
015800     20 KEY-3.
015900         30 ALPHAN-KEY PIC X.
016000         30 NUM-KEY PIC 999.
016100 FD  SQ-FS2
016200     LABEL RECORD IS STANDARD
016300C    ; VALUE OF
016400C    XXXXX074
016500C    IS
016600C    XXXXX076
016700G    XXXXX069
016800     ; BLOCK CONTAINS 2 RECORDS
016900     ; RECORD CONTAINS 132 CHARACTERS
017000     DATA RECORD SQ-FS2R1-F-G-132.
017100 01  SQ-FS2R1-F-G-132.
017200     10 REC-PRE-2 PIC X(120).
017300     10 REST-OF-2.
017400     20 KEY-4.
017500         30 ALPHAN-KEY PIC X.
017600         30 NUM-KEY PIC 999.
017700     20 KEY-5.
017800         30 ALPHAN-KEY PIC X.
017900         30 NUM-KEY PIC 999.
018000     20 KEY-6.
018100         30 ALPHAN-KEY PIC X.
018200         30 NUM-KEY PIC 999.
018300 FD  SQ-FS3
018400     LABEL RECORD IS STANDARD
018500C    ; VALUE OF
018600C    XXXXX074
018700C    IS
018800C    XXXXX077
018900G    XXXXX069
019000     ; BLOCK CONTAINS 3 RECORDS
019100     RECORD CONTAINS 132 CHARACTERS
019200     DATA RECORD SQ-FS3R1-F-G-132.
019300 01  SQ-FS3R1-F-G-132.
019400     10  REC-PRE-3 PIC X(120).
019500     10  REST-OF-3.
019600     20  KEY-7.
019700          30  ALPHAN-KEY PIC X.
019800          30  NUM-KEY PIC 999.
019900     20  KEY-8.
020000          30  ALPHAN-KEY PIC X.
020100          30  NUM-KEY PIC 999.
020200     20 KEY-9.
020300          30  ALPHAN-KEY PIC X.
020400          30  NUM-KEY PIC 999.
020500 FD  SQ-FS4.
020600 01  SQ-FS4R1-F-6-132.
020700     02  REC-2  PIC X(132).
020800 SD  ST-FS1
020900     RECORD CONTAINS 132 CHARACTERS
021000     DATA RECORD IS ST-FS1R1-F-G-132.
021100 01  ST-FS1R1-F-G-132.
021200     02 FILLER PIC X(120).
021300     02 NON-KEY-1.
021400         03 A-KEY PIC X.
021500         03 N-KEY PIC 999.
021600     02 SORT-KEY.
021700         03 A-KEY PIC X.
021800         03 N-KEY PIC 999.
021900     02 NON-KEY-2.
022000         03 A-KEY PIC X.
022100         03 N-KEY PIC 999.
022200 WORKING-STORAGE SECTION.
022300 77  WRK-DU-9-0001 PIC 9 VALUE 0.
022400 77  WRK-DU-999-0001 PIC 999.
022500 77  WRK-DU-999-2 PIC 999 VALUE 001.
022600 77  LAST-REC-NUM  PIC 999 VALUE ZERO.
022700 01  WRK-XN-0001 PIC X(51) VALUE
022800     " $$()*+,-./0123456789;<=>ABCDEFGHIJKLMNOPQRSTUVWXYZ".
022900 01  WRK-XN-O051F-X-0001 REDEFINES WRK-XN-0001.
023000     02 CHAR PIC X OCCURS 51 TIMES.
023100 01  WRK-XN-2    PIC X(51) VALUE
023200     " $$()*+,-./0123456789;<=>ABCDEFGHIJKLMNOPQRSTUVWXYZ".
023300 01  WRK-XN-0051F-X-0002 REDEFINES WRK-XN-2.
023400     02 ASCIIS PIC X OCCURS 51 TIMES.
023500 01  WRK-XN-O020F-0001.
023600     02 COMPU PIC X OCCURS 20 TIMES.
023700 01  WRK-XN-X-0001 REDEFINES WRK-XN-O020F-0001.
023800     02 FILLER PIC X(20).
023900 01  WRK-XN-O120F-1.
024000     02 COLLS PIC X OCCURS 120 TIMES.
024100 01  WRK-XN-X-2 REDEFINES WRK-XN-O120F-1.
024200     02 WRK-XN-0002 PIC X(20).
024300     02 WRK-XN-0003 PIC X(20).
024400     02 WRK-XN-0004 PIC X(20).
024500     02 WRK-XN-0005 PIC X(20).
024600     02 WRK-XN-0006 PIC X(20).
024700     02 WRK-XN-0007 PIC X(20).
024800 01  FILE-RECORD-INFORMATION-REC.
024900     03 FILE-RECORD-INFO-SKELETON.
025000        05 FILLER                 PICTURE X(48)       VALUE
025100             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
025200        05 FILLER                 PICTURE X(46)       VALUE
025300             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
025400        05 FILLER                 PICTURE X(26)       VALUE
025500             ",LFIL=000000,ORG=  ,LBLR= ".
025600        05 FILLER                 PICTURE X(37)       VALUE
025700             ",RECKEY=                             ".
025800        05 FILLER                 PICTURE X(38)       VALUE
025900             ",ALTKEY1=                             ".
026000        05 FILLER                 PICTURE X(38)       VALUE
026100             ",ALTKEY2=                             ".
026200        05 FILLER                 PICTURE X(7)        VALUE SPACE.
026300     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
026400        05 FILE-RECORD-INFO-P1-120.
026500           07 FILLER              PIC X(5).
026600           07 XFILE-NAME           PIC X(6).
026700           07 FILLER              PIC X(8).
026800           07 XRECORD-NAME         PIC X(6).
026900           07 FILLER              PIC X(1).
027000           07 REELUNIT-NUMBER     PIC 9(1).
027100           07 FILLER              PIC X(7).
027200           07 XRECORD-NUMBER       PIC 9(6).
027300           07 FILLER              PIC X(6).
027400           07 UPDATE-NUMBER       PIC 9(2).
027500           07 FILLER              PIC X(5).
027600           07 ODO-NUMBER          PIC 9(4).
027700           07 FILLER              PIC X(5).
027800           07 XPROGRAM-NAME        PIC X(5).
027900           07 FILLER              PIC X(7).
028000           07 XRECORD-LENGTH       PIC 9(6).
028100           07 FILLER              PIC X(7).
028200           07 CHARS-OR-RECORDS    PIC X(2).
028300           07 FILLER              PIC X(1).
028400           07 XBLOCK-SIZE          PIC 9(4).
028500           07 FILLER              PIC X(6).
028600           07 RECORDS-IN-FILE     PIC 9(6).
028700           07 FILLER              PIC X(5).
028800           07 XFILE-ORGANIZATION   PIC X(2).
028900           07 FILLER              PIC X(6).
029000           07 XLABEL-TYPE          PIC X(1).
029100        05 FILE-RECORD-INFO-P121-240.
029200           07 FILLER              PIC X(8).
029300           07 XRECORD-KEY          PIC X(29).
029400           07 FILLER              PIC X(9).
029500           07 ALTERNATE-KEY1      PIC X(29).
029600           07 FILLER              PIC X(9).
029700           07 ALTERNATE-KEY2      PIC X(29).
029800           07 FILLER              PIC X(7).
029900 01  TEST-RESULTS.
030000     02 FILLER                   PIC X      VALUE SPACE.
030100     02 FEATURE                  PIC X(20)  VALUE SPACE.
030200     02 FILLER                   PIC X      VALUE SPACE.
030300     02 P-OR-F                   PIC X(5)   VALUE SPACE.
030400     02 FILLER                   PIC X      VALUE SPACE.
030500     02  PAR-NAME.
030600       03 FILLER                 PIC X(19)  VALUE SPACE.
030700       03  PARDOT-X              PIC X      VALUE SPACE.
030800       03 DOTVALUE               PIC 99     VALUE ZERO.
030900     02 FILLER                   PIC X(8)   VALUE SPACE.
031000     02 RE-MARK                  PIC X(61).
031100 01  TEST-COMPUTED.
031200     02 FILLER                   PIC X(30)  VALUE SPACE.
031300     02 FILLER                   PIC X(17)  VALUE
031400            "       COMPUTED=".
031500     02 COMPUTED-X.
031600     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
031700     03 COMPUTED-N               REDEFINES COMPUTED-A
031800                                 PIC -9(9).9(9).
031900     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
032000     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
032100     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
032200     03       CM-18V0 REDEFINES COMPUTED-A.
032300         04 COMPUTED-18V0                    PIC -9(18).
032400         04 FILLER                           PIC X.
032500     03 FILLER PIC X(50) VALUE SPACE.
032600 01  TEST-CORRECT.
032700     02 FILLER PIC X(30) VALUE SPACE.
032800     02 FILLER PIC X(17) VALUE "       CORRECT =".
032900     02 CORRECT-X.
033000     03 CORRECT-A                  PIC X(20) VALUE SPACE.
033100     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
033200     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
033300     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
033400     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
033500     03      CR-18V0 REDEFINES CORRECT-A.
033600         04 CORRECT-18V0                     PIC -9(18).
033700         04 FILLER                           PIC X.
033800     03 FILLER PIC X(2) VALUE SPACE.
033900     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
034000 01  CCVS-C-1.
034100     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
034200-    "SS  PARAGRAPH-NAME
034300-    "       REMARKS".
034400     02 FILLER                     PIC X(20)    VALUE SPACE.
034500 01  CCVS-C-2.
034600     02 FILLER                     PIC X        VALUE SPACE.
034700     02 FILLER                     PIC X(6)     VALUE "TESTED".
034800     02 FILLER                     PIC X(15)    VALUE SPACE.
034900     02 FILLER                     PIC X(4)     VALUE "FAIL".
035000     02 FILLER                     PIC X(94)    VALUE SPACE.
035100 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
035200 01  REC-CT                        PIC 99       VALUE ZERO.
035300 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
035400 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
035500 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
035600 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
035700 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
035800 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
035900 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
036000 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
036100 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
036200 01  CCVS-H-1.
036300     02  FILLER                    PIC X(39)    VALUE SPACES.
036400     02  FILLER                    PIC X(42)    VALUE
036500     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
036600     02  FILLER                    PIC X(39)    VALUE SPACES.
036700 01  CCVS-H-2A.
036800   02  FILLER                        PIC X(40)  VALUE SPACE.
036900   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
037000   02  FILLER                        PIC XXXX   VALUE
037100     "4.2 ".
037200   02  FILLER                        PIC X(28)  VALUE
037300            " COPY - NOT FOR DISTRIBUTION".
037400   02  FILLER                        PIC X(41)  VALUE SPACE.
037500
037600 01  CCVS-H-2B.
037700   02  FILLER                        PIC X(15)  VALUE
037800            "TEST RESULT OF ".
037900   02  TEST-ID                       PIC X(9).
038000   02  FILLER                        PIC X(4)   VALUE
038100            " IN ".
038200   02  FILLER                        PIC X(12)  VALUE
038300     " HIGH       ".
038400   02  FILLER                        PIC X(22)  VALUE
038500            " LEVEL VALIDATION FOR ".
038600   02  FILLER                        PIC X(58)  VALUE
038700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
038800 01  CCVS-H-3.
038900     02  FILLER                      PIC X(34)  VALUE
039000            " FOR OFFICIAL USE ONLY    ".
039100     02  FILLER                      PIC X(58)  VALUE
039200     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
039300     02  FILLER                      PIC X(28)  VALUE
039400            "  COPYRIGHT   1985 ".
039500 01  CCVS-E-1.
039600     02 FILLER                       PIC X(52)  VALUE SPACE.
039700     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
039800     02 ID-AGAIN                     PIC X(9).
039900     02 FILLER                       PIC X(45)  VALUE SPACES.
040000 01  CCVS-E-2.
040100     02  FILLER                      PIC X(31)  VALUE SPACE.
040200     02  FILLER                      PIC X(21)  VALUE SPACE.
040300     02 CCVS-E-2-2.
040400         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
040500         03 FILLER                   PIC X      VALUE SPACE.
040600         03 ENDER-DESC               PIC X(44)  VALUE
040700            "ERRORS ENCOUNTERED".
040800 01  CCVS-E-3.
040900     02  FILLER                      PIC X(22)  VALUE
041000            " FOR OFFICIAL USE ONLY".
041100     02  FILLER                      PIC X(12)  VALUE SPACE.
041200     02  FILLER                      PIC X(58)  VALUE
041300     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
041400     02  FILLER                      PIC X(13)  VALUE SPACE.
041500     02 FILLER                       PIC X(15)  VALUE
041600             " COPYRIGHT 1985".
041700 01  CCVS-E-4.
041800     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
041900     02 FILLER                       PIC X(4)   VALUE " OF ".
042000     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
042100     02 FILLER                       PIC X(40)  VALUE
042200      "  TESTS WERE EXECUTED SUCCESSFULLY".
042300 01  XXINFO.
042400     02 FILLER                       PIC X(19)  VALUE
042500            "*** INFORMATION ***".
042600     02 INFO-TEXT.
042700       04 FILLER                     PIC X(8)   VALUE SPACE.
042800       04 XXCOMPUTED                 PIC X(20).
042900       04 FILLER                     PIC X(5)   VALUE SPACE.
043000       04 XXCORRECT                  PIC X(20).
043100     02 INF-ANSI-REFERENCE           PIC X(48).
043200 01  HYPHEN-LINE.
043300     02 FILLER  PIC IS X VALUE IS SPACE.
043400     02 FILLER  PIC IS X(65)    VALUE IS "************************
043500-    "*****************************************".
043600     02 FILLER  PIC IS X(54)    VALUE IS "************************
043700-    "******************************".
043800 01  CCVS-PGM-ID                     PIC X(9)   VALUE
043900     "ST139A".
044000 PROCEDURE DIVISION.
044100 DECLARATIVES.
044200 SECT-ST209-DEC SECTION.
044300     USE AFTER STANDARD ERROR PROCEDURE ON OUTPUT.
044400 MRG-WRITE-DEC.
044500     MOVE "ERROR ON OUTPUT DECL." TO FEATURE.
044600     MOVE "MRG-TEST-DEC" TO PAR-NAME.
044700     WRITE   PRINT-REC FROM TEST-RESULTS AFTER ADVANCING 2 LINES.
044800     STOP RUN.
044900 END DECLARATIVES.
045000 CCVS1 SECTION.
045100 OPEN-FILES.
045200     OPEN    OUTPUT PRINT-FILE.
045300     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
045400     MOVE    SPACE TO TEST-RESULTS.
045500     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
045600     MOVE    ZERO TO REC-SKL-SUB.
045700     PERFORM CCVS-INIT-FILE 9 TIMES.
045800 CCVS-INIT-FILE.
045900     ADD     1 TO REC-SKL-SUB.
046000     MOVE    FILE-RECORD-INFO-SKELETON
046100          TO FILE-RECORD-INFO (REC-SKL-SUB).
046200 CCVS-INIT-EXIT.
046300     GO TO CCVS1-EXIT.
046400 CLOSE-FILES.
046500     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
046600 TERMINATE-CCVS.
046700S    EXIT PROGRAM.
046800STERMINATE-CALL.
046900     STOP     RUN.
047000 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
047100 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
047200 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
047300 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
047400     MOVE "****TEST DELETED****" TO RE-MARK.
047500 PRINT-DETAIL.
047600     IF REC-CT NOT EQUAL TO ZERO
047700             MOVE "." TO PARDOT-X
047800             MOVE REC-CT TO DOTVALUE.
047900     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
048000     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
048100        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
048200          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
048300     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
048400     MOVE SPACE TO CORRECT-X.
048500     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
048600     MOVE     SPACE TO RE-MARK.
048700 HEAD-ROUTINE.
048800     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
048900     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049000     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
049100     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
049200 COLUMN-NAMES-ROUTINE.
049300     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049400     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
049500     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
049600 END-ROUTINE.
049700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
049800 END-RTN-EXIT.
049900     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
050000 END-ROUTINE-1.
050100      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
050200      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
050300      ADD PASS-COUNTER TO ERROR-HOLD.
050400*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
050500      MOVE PASS-COUNTER TO CCVS-E-4-1.
050600      MOVE ERROR-HOLD TO CCVS-E-4-2.
050700      MOVE CCVS-E-4 TO CCVS-E-2-2.
050800      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
050900  END-ROUTINE-12.
051000      MOVE "TEST(S) FAILED" TO ENDER-DESC.
051100     IF       ERROR-COUNTER IS EQUAL TO ZERO
051200         MOVE "NO " TO ERROR-TOTAL
051300         ELSE
051400         MOVE ERROR-COUNTER TO ERROR-TOTAL.
051500     MOVE     CCVS-E-2 TO DUMMY-RECORD.
051600     PERFORM WRITE-LINE.
051700 END-ROUTINE-13.
051800     IF DELETE-COUNTER IS EQUAL TO ZERO
051900         MOVE "NO " TO ERROR-TOTAL  ELSE
052000         MOVE DELETE-COUNTER TO ERROR-TOTAL.
052100     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
052200     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
052300      IF   INSPECT-COUNTER EQUAL TO ZERO
052400          MOVE "NO " TO ERROR-TOTAL
052500      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
052600      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
052700      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
052800     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
052900 WRITE-LINE.
053000     ADD 1 TO RECORD-COUNT.
053100Y    IF RECORD-COUNT GREATER 42
053200Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
053300Y        MOVE SPACE TO DUMMY-RECORD
053400Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
053500Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
053600Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
053700Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
053800Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
053900Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
054000Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
054100Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
054200Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
054300Y        MOVE ZERO TO RECORD-COUNT.
054400     PERFORM WRT-LN.
054500 WRT-LN.
054600     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
054700     MOVE SPACE TO DUMMY-RECORD.
054800 BLANK-LINE-PRINT.
054900     PERFORM WRT-LN.
055000 FAIL-ROUTINE.
055100     IF     COMPUTED-X NOT EQUAL TO SPACE
055200            GO TO   FAIL-ROUTINE-WRITE.
055300     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
055400     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
055500     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
055600     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055700     MOVE   SPACES TO INF-ANSI-REFERENCE.
055800     GO TO  FAIL-ROUTINE-EX.
055900 FAIL-ROUTINE-WRITE.
056000     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
056100     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
056200     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
056300     MOVE   SPACES TO COR-ANSI-REFERENCE.
056400 FAIL-ROUTINE-EX. EXIT.
056500 BAIL-OUT.
056600     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
056700     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
056800 BAIL-OUT-WRITE.
056900     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
057000     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
057100     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
057200     MOVE   SPACES TO INF-ANSI-REFERENCE.
057300 BAIL-OUT-EX. EXIT.
057400 CCVS1-EXIT.
057500     EXIT.
057600 SECT-ST209-0001 SECTION.
057700 MRG-INIT-001.
057800     MOVE "CREATE FILE SQ-FS1" TO FEATURE.
057900     OPEN OUTPUT SQ-FS1.
058000     MOVE "SQ-FS1" TO XFILE-NAME (1).
058100     MOVE "R1-F-G" TO XRECORD-NAME (1).
058200     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
058300     MOVE 000132 TO XRECORD-LENGTH (1).
058400     MOVE "RC" TO CHARS-OR-RECORDS (1).
058500     MOVE 0001 TO XBLOCK-SIZE (1).
058600     MOVE 000051 TO RECORDS-IN-FILE (1).
058700     MOVE "SQ" TO XFILE-ORGANIZATION (1).
058800     MOVE "S" TO XLABEL-TYPE (1).
058900     MOVE 000001 TO XRECORD-NUMBER (1).
059000             MOVE SPACES TO WRK-XN-O120F-1.
059100 MRG-TEST-001.
059200     PERFORM MRG-TEST-001-BUILD VARYING WRK-DU-999-0001
059300         FROM 1 BY 1 UNTIL WRK-DU-999-0001 IS GREATER THAN 51.
059400X    MOVE    SPACES TO PRINT-REC.
059500X    WRITE   PRINT-REC.
059600     IF XRECORD-NUMBER (1) IS NOT EQUAL TO 000052
059700         PERFORM FAIL MOVE "INCORR. NO. OF RECS." TO RE-MARK
059800         ELSE
059900         PERFORM PASS.
060000     GO TO MRG-WRITE-001.
060100 MRG-TEST-001-BUILD.
060200     MOVE CHAR (WRK-DU-999-0001) TO ALPHAN-KEY OF KEY-1
060300         ALPHAN-KEY OF KEY-2 ALPHAN-KEY OF KEY-3.
060400     MOVE WRK-DU-999-0001 TO NUM-KEY OF KEY-1 NUM-KEY OF KEY-2
060500         NUM-KEY OF KEY-3.
060600     MOVE FILE-RECORD-INFO-P1-120 (1) TO REC-PREAMBLE.
060700     ADD 1 TO XRECORD-NUMBER (1).
060800     MOVE ASCIIS (WRK-DU-999-0001) TO COLLS (WRK-DU-999-2).
060900     ADD 1 TO WRK-DU-999-2.
061000     MOVE ASCIIS (WRK-DU-999-0001) TO COLLS (WRK-DU-999-2).
061100     ADD 1 TO WRK-DU-999-2.
061200X    WRITE PRINT-REC FROM SQ-FS1R1-F-G-132.
061300X    WRITE PRINT-REC FROM REST-OF-1.
061400X    MOVE SPACES TO PRINT-REC.
061500     WRITE   SQ-FS1R1-F-G-132.
061600 MRG-DELETE-001.
061700     PERFORM DE-LETE.
061800 MRG-WRITE-001.
061900     MOVE "MRG-TEST-001" TO PAR-NAME.
062000     MOVE "FIRST FILE CREATED" TO COMPUTED-A.
062100     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
062200     PERFORM PRINT-DETAIL.
062300X    MOVE    SPACES TO PRINT-REC.
062400X    WRITE   PRINT-REC.
062500     CLOSE SQ-FS1.
062600 MRG-INIT-002.
062700     MOVE "CREATE FILE SQ-FS2" TO FEATURE.
062800     OPEN OUTPUT SQ-FS2.
062900     MOVE  "SQ-FS2" TO XFILE-NAME (1).
063000     MOVE 000001 TO XRECORD-NUMBER (1).
063100     MOVE 0002 TO XBLOCK-SIZE (1).
063200 MRG-TEST-002.
063300     PERFORM MRG-TEST-002-BUILD VARYING WRK-DU-999-0001
063400         FROM 1 BY 1 UNTIL WRK-DU-999-0001 IS GREATER THAN 51.
063500X    MOVE    SPACES TO PRINT-REC.
063600X    WRITE   PRINT-REC.
063700     IF XRECORD-NUMBER (1) IS NOT EQUAL TO 52
063800         PERFORM FAIL MOVE "INCORR. NO. OF RECS." TO RE-MARK
063900         ELSE
064000         PERFORM PASS.
064100     GO TO MRG-WRITE-002.
064200 MRG-TEST-002-BUILD.
064300     MOVE CHAR (WRK-DU-999-0001) TO ALPHAN-KEY OF KEY-4
064400         ALPHAN-KEY OF KEY-5 ALPHAN-KEY OF KEY-6.
064500     ADD 51 WRK-DU-999-0001 GIVING NUM-KEY OF KEY-4
064600         NUM-KEY OF KEY-5 NUM-KEY OF KEY-6.
064700     MOVE FILE-RECORD-INFO-P1-120 (1) TO REC-PRE-2.
064800     ADD 000001 TO XRECORD-NUMBER (1).
064900X    WRITE PRINT-REC FROM SQ-FS2R1-F-G-132.
065000X    WRITE PRINT-REC FROM REST-OF-2.
065100X    MOVE SPACES TO PRINT-REC.
065200     WRITE   SQ-FS2R1-F-G-132.
065300 MRG-DELETE-002.
065400     PERFORM DE-LETE.
065500 MRG-WRITE-002.
065600     MOVE "MRG-TEST-002" TO PAR-NAME.
065700     MOVE "2ND FILE CREATED" TO COMPUTED-A.
065800     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
065900     PERFORM PRINT-DETAIL.
066000X    MOVE    SPACES TO PRINT-REC.
066100X    WRITE   PRINT-REC.
066200     CLOSE SQ-FS2.
066300 MRG-INIT-003.
066400     MOVE SPACES TO WRK-XN-X-0001.
066500     MERGE ST-FS1
066600         ASCENDING A-KEY OF SORT-KEY
066700         ON ASCENDING KEY N-KEY OF NON-KEY-1
066800         SEQUENCE MY-FAVORITE-ALPHABET
066900         USING SQ-FS2 SQ-FS1
067000         GIVING SQ-FS3.
067100 MRG-TEST-003.
067200     OPEN INPUT SQ-FS3.
067300     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
067400         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
067500X    MOVE    SPACES TO PRINT-REC.
067600X    WRITE   PRINT-REC.
067700     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0002
067800         PERFORM FAIL GO TO MRG-FAIL-003
067900         ELSE
068000         PERFORM PASS.
068100     GO TO MRG-WRITE-003.
068200 MRG-DELETE-003.
068300     PERFORM DE-LETE.
068400     GO TO MRG-WRITE-003.
068500 MRG-FAIL-003.
068600     MOVE WRK-XN-X-0001 TO COMPUTED-A.
068700     MOVE WRK-XN-0002 TO CORRECT-A.
068800 MRG-WRITE-003.
068900     MOVE "MRG-TEST-003" TO PAR-NAME.
069000     MOVE "STAND. COLLATING SEQ." TO FEATURE.
069100     PERFORM PRINT-DETAIL.
069200X    MOVE    SPACES TO PRINT-REC.
069300X    WRITE   PRINT-REC.
069400 MRG-INIT-004.
069500     MOVE SPACES TO WRK-XN-X-0001.
069600 MRG-TEST-004.
069700     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
069800         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
069900X    MOVE    SPACES TO PRINT-REC.
070000X    WRITE   PRINT-REC.
070100     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0003
070200         PERFORM FAIL GO TO MRG-FAIL-004
070300         ELSE
070400         PERFORM PASS.
070500     GO TO MRG-WRITE-004.
070600 MRG-DELETE-004.
070700     PERFORM DE-LETE.
070800     GO TO MRG-WRITE-004.
070900 MRG-FAIL-004.
071000     MOVE WRK-XN-X-0001 TO COMPUTED-A.
071100     MOVE WRK-XN-0003 TO CORRECT-A.
071200 MRG-WRITE-004.
071300     MOVE "MRG-TEST-004" TO PAR-NAME.
071400     MOVE "STAND. COLLATING SEQ." TO FEATURE.
071500     PERFORM PRINT-DETAIL.
071600X    MOVE    SPACES TO PRINT-REC.
071700X    WRITE   PRINT-REC.
071800 MRG-INIT-005.
071900     MOVE SPACES TO WRK-XN-X-0001.
072000 MRG-TEST-005.
072100     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
072200         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
072300X    MOVE    SPACES TO PRINT-REC.
072400X    WRITE   PRINT-REC.
072500     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0004
072600         PERFORM FAIL GO TO MRG-FAIL-005
072700         ELSE
072800         PERFORM PASS.
072900     GO TO MRG-WRITE-005.
073000 MRG-DELETE-005.
073100     PERFORM DE-LETE.
073200     GO TO MRG-WRITE-005.
073300 MRG-FAIL-005.
073400     MOVE WRK-XN-X-0001 TO COMPUTED-A.
073500     MOVE WRK-XN-0004 TO CORRECT-A.
073600 MRG-WRITE-005.
073700     MOVE "MRG-TEST-005" TO PAR-NAME.
073800     MOVE "STAND. COLLATING SEQ." TO FEATURE.
073900     PERFORM PRINT-DETAIL.
074000X    MOVE    SPACES TO PRINT-REC.
074100X    WRITE   PRINT-REC.
074200 MRG-INIT-006.
074300     MOVE SPACES TO WRK-XN-X-0001.
074400 MRG-TEST-006.
074500     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
074600         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
074700X    MOVE    SPACES TO PRINT-REC.
074800X    WRITE   PRINT-REC.
074900     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0005
075000         PERFORM FAIL GO TO MRG-FAIL-006
075100         ELSE
075200         PERFORM PASS.
075300     GO TO MRG-WRITE-006.
075400 MRG-DELETE-006.
075500     PERFORM DE-LETE.
075600     GO TO MRG-WRITE-006.
075700 MRG-FAIL-006.
075800     MOVE WRK-XN-X-0001 TO COMPUTED-A.
075900     MOVE WRK-XN-0005 TO CORRECT-A.
076000 MRG-WRITE-006.
076100     MOVE "MRG-TEST-006" TO PAR-NAME.
076200     MOVE "STAND. COLLATING SEQ." TO FEATURE.
076300     PERFORM PRINT-DETAIL.
076400X    MOVE    SPACES TO PRINT-REC.
076500X    WRITE   PRINT-REC.
076600 MRG-INIT-007.
076700     MOVE SPACES TO WRK-XN-X-0001.
076800 MRG-TEST-007.
076900     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
077000         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
077100X    MOVE    SPACES TO PRINT-REC.
077200X    WRITE   PRINT-REC.
077300     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0006
077400         PERFORM FAIL GO TO MRG-FAIL-007
077500         ELSE
077600         PERFORM PASS.
077700     GO TO MRG-WRITE-007.
077800 MRG-DELETE-007.
077900     PERFORM DE-LETE.
078000     GO TO MRG-WRITE-007.
078100 MRG-FAIL-007.
078200     MOVE WRK-XN-X-0001 TO COMPUTED-A.
078300     MOVE WRK-XN-0006 TO CORRECT-A.
078400 MRG-WRITE-007.
078500     MOVE "MRG-TEST-007" TO PAR-NAME.
078600     MOVE "STAND. COLLATING SEQ." TO FEATURE.
078700     PERFORM PRINT-DETAIL.
078800X    MOVE    SPACES TO PRINT-REC.
078900X    WRITE   PRINT-REC.
079000 MRG-INIT-008.
079100     MOVE SPACES TO WRK-XN-X-0001.
079200 MRG-TEST-008.
079300     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
079400         UNTIL WRK-DU-999-0001 IS GREATER THAN 2.
079500X    MOVE    SPACES TO PRINT-REC.
079600X    WRITE   PRINT-REC.
079700     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0007
079800         PERFORM FAIL GO TO MRG-FAIL-008
079900         ELSE
080000         PERFORM PASS.
080100     GO TO MRG-WRITE-008.
080200 MRG-DELETE-008.
080300     PERFORM DE-LETE.
080400     GO TO MRG-WRITE-008.
080500 MRG-FAIL-008.
080600     MOVE WRK-XN-X-0001 TO COMPUTED-A.
080700     MOVE WRK-XN-0007 TO CORRECT-A.
080800 MRG-WRITE-008.
080900     MOVE "MRG-TEST-008" TO PAR-NAME.
081000     MOVE "STAND. COLLATING SEQ." TO FEATURE.
081100     PERFORM PRINT-DETAIL.
081200     MOVE    NUM-KEY OF KEY-7 TO LAST-REC-NUM.
081300 MRG-TEST-009.
081400     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
081500         GO TO MRG-FAIL-009.
081600     READ SQ-FS3 END PERFORM PASS
081700         GO TO MRG-WRITE-009.
081800     GO TO MRG-FAIL-009.
081900 MRG-DELETE-009.
082000     PERFORM DE-LETE.
082100     GO TO MRG-WRITE-009.
082200 MRG-FAIL-009.
082300     MOVE "EOF NOT FOUND" TO RE-MARK.
082400     PERFORM FAIL .
082500 MRG-WRITE-009.
082600     MOVE "EOF CHECK SQ-FS3" TO FEATURE.
082700     MOVE "MRG-TEST-009" TO PAR-NAME.
082800     PERFORM PRINT-DETAIL.
082900 MRG-TEST-010.
083000     IF LAST-REC-NUM IS NOT EQUAL TO 102
083100         PERFORM FAIL GO TO MRG-FAIL-010
083200         ELSE
083300         PERFORM PASS.
083400     GO TO MRG-WRITE-010.
083500 MRG-DELETE-010.
083600     PERFORM DE-LETE.
083700     GO TO MRG-WRITE-010.
083800 MRG-FAIL-010.
083900     MOVE LAST-REC-NUM TO COMPUTED-18V0.
084000     MOVE 102 TO CR-18V0.
084100 MRG-WRITE-010.
084200     MOVE "NUMER. SEQ. CHECK" TO FEATURE.
084300     MOVE "MRG-TEST-010" TO PAR-NAME.
084400     PERFORM PRINT-DETAIL.
084500     CLOSE   SQ-FS3.
084600     GO TO CCVS-999999.
084700 READ-SQ-FS1 SECTION.
084800 RD-1.
084900     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
085000         GO TO R1-EXIT.
085100     READ SQ-FS3 AT END GO TO PREMATURE-EOF.
085200X    WRITE PRINT-REC FROM SQ-FS3R1-F-G-132.
085300X    WRITE PRINT-REC FROM REST-OF-3.
085400X    MOVE SPACES TO PRINT-REC.
085500     MOVE ALPHAN-KEY OF KEY-8 TO COMPU (WRK-DU-999-0001).
085600     GO TO R1-EXIT.
085700 PREMATURE-EOF.
085800     MOVE 1 TO WRK-DU-9-0001.
085900     MOVE "PREMATURE EOF FOUND" TO RE-MARK.
086000 R1-EXIT.
086100     EXIT.
086200 CCVS-EXIT SECTION.
086300 CCVS-999999.
086400     GO TO CLOSE-FILES.
