000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST137A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*    OBJECTIVE -
001400*        ROUTINE ST207 IS A TEST OF THE SORT STATEMENT USING
001500*    VARIABLE LENGTH RECORDS WHICH CONTAIN ODO (OCCURS DEPENDING
001600*    ON) CLAUSES IN THEIR RECORD DESCRIPTIONS.
001700*
001800*
001900*    FEATURES TESTED -
002000*    *   COLLATING SEQUENCE IS NATIVE.  NO COLLATING SEQUENCE
002100*            STATEMENT IS USED IN THE ACTUAL SORT STATEMENT.
002200*    *   VARIABLE LENGTH RECORDS
002300*    *   OCCURS DEPENDING ON CLAUSES
002400*    *   QUALIFIED ALPHANUMERIC AND NUMERIC SORT KEYS
002500*
002600*    *   SORT  SORT-FILE-NAME
002700*        ON ASCENDING KEY KEY-1 OF DATA-NAME-1
002800*        ASCENDING KEY-2 OF DATA-NAME-2
002900*        USING FILE-NAME-1
003000*        GIVING FILE-NAME-2.
003100*
003200*
003300*    ANSI X3.23-1974 REFERENCES -
003400*    *   SECTION 2.1  OCCURS DEPENDING ON  PAGE III-2
003500*    *   SECTION 4.4  THE SORT STATEMENT  PAGE VII-14
003600*
003700*
003800*    FILES USED -
003900*    *   FILES SQ-FS1 AND SQ-FS2 ON MAGNETIC TAPE OR MASS-STORAGE
004000*    ARE FIRST CREATED BY ROUTINE ST207.  THE FIRST FILE (SQ-FS1)
004100*    IS THEN SORTED GIVING THE SECOND FILE (SQ-FS2).
004200*
004300*        SQ-FS1 -
004400*    51 RECORDS
004500*    VARIABLE LENGTH RECORDS (148 TO 1435 CHARACTERS) USING ODO
004600*    BLOCKED 1
004700*    RESERVE 2 AREAS
004800*
004900*        SQ-FS2 -
005000*    51 RECORDS
005100*    VARIABLE LENGTH RECORDS FORMAT WITH ODO BUT ACTUALLY ALL
005200*        RECORDS ARE FIXED LENGTH 148 CHARACTERS.
005300*    BLOCKED 2
005400*    RESERVE 4 AREAS
005500*
005600*        NOTE THAT SQ-FS2 IS OVERWRITTEN AS A RESULT OF THE SORT
005700*    AND SHOULD CONTAIN A FINAL TOTAL OF 51 RECORDS.
005800*
005900*
006000*    X-CARDS USED  -
006100*    X-XXX014     SQ-FS1
006200*    X-XXX015     SQ-FS2
006300*    X-XXX027     SORT FILE ST-FS1
006400*    X-XXX063     NATIVE COLLATING SEQUENCE ASCENDING ORDER (NOTE
006500*        THAT THE QUOTE CHARACTER IS NOT TO APPEAR IN THE X-63
006600*        CARD AND THE DOLLAR SIGN $ IS TO APPEAR TWICE WHEREVER
006700*        THE $ BELONGS IN THE NATIVE COLLATING SEQUENCE).  IF
006800*        THE NATIVE COLLATING SEQUENCE IS ACTUALLY THE ASCII
006900*        COLLATING SEQUENCE SEE BELOW FOR A SAMPLE X-63 CARD.....
007000*
007100*    X-63  " $$()*+,-./0123456789;<=>ABCDEFGHIJKLMNOPQRSTUVWXYZ".
007200*
007300*
007400*    OPTIONS RECOMMENDED -
007500*    *   *OPT8  X  TO BE USED IF NECESSARY TO DUMP THE
007600*                  FILES AS THEY ARE CREATED AND READ DURING
007700*                  TESTS 3 THRU 6.
007800*
007900*
008000*    TEST DESCRIPTIONS -
008100*    SRT-TEST-001     CHECKS THE CREATION OF SQ-FS1
008200*    SRT-TEST-002     CHECKS THE CREATION OF SQ-FS2
008300*    SRT-TEST-003     TESTS RECORDS 1-20 ON SORTED SQ-FS2
008400*    SRT-TEST-004     TESTS RECORDS 21-40 ON SORTED SQ-FS2
008500*    SRT-TEST-005     TESTS RECORDS 41-51 ON SORTED SQ-FS2
008600*    SRT-TEST-006     AN EOF CHECK ON SQ-FS2
008700*
008800*
008900*    ************************************************************
009000 ENVIRONMENT DIVISION.
009100 CONFIGURATION SECTION.
009200 SOURCE-COMPUTER.
009300     XXXXX082.
009400 OBJECT-COMPUTER.
009500     XXXXX083.
009600 INPUT-OUTPUT SECTION.
009700 FILE-CONTROL.
009800     SELECT PRINT-FILE ASSIGN TO
009900     XXXXX055.
010000     SELECT SQ-FS1 ASSIGN TO
010100     XXXXX014
010200     ORGANIZATION IS SEQUENTIAL
010300     ACCESS MODE IS SEQUENTIAL
010400     RESERVE 2 AREAS.
010500     SELECT SQ-FS2 ASSIGN TO
010600     XXXXX015
010700     ORGANIZATION IS SEQUENTIAL
010800     ACCESS MODE IS SEQUENTIAL
010900     RESERVE 4 AREAS.
011000     SELECT ST-FS1 ASSIGN TO
011100     XXXXX027.
011200 DATA DIVISION.
011300 FILE SECTION.
011400 FD  PRINT-FILE.
011500 01  PRINT-REC PICTURE X(120).
011600 01  DUMMY-RECORD PICTURE X(120).
011700 FD  SQ-FS1
011800     LABEL RECORDS STANDARD
011900C    VALUE OF
012000C    XXXXX074
012100C    IS
012200C    XXXXX075
012300G    XXXXX069
012400     BLOCK CONTAINS 1 RECORDS
012500     RECORD CONTAINS 148 TO 1435 CHARACTERS.
012600 01  SQ-FS1R1-F-G-132.
012700     10 REC-PREAMBLE PIC X(120).
012800     10 REST-OF-1.
012900     20  LENGTH-1 PIC 999.
013000     20 KEY-1.
013100         30 ALPHAN-KEY PIC X.
013200         30 NUM-KEY PIC 999.
013300     20 KEY-2.
013400         30 ALPHAN-KEY PIC X.
013500         30 NUM-KEY PIC 999.
013600     20 KEY-3.
013700         30 ALPHAN-KEY PIC X.
013800         30 NUM-KEY PIC 999.
013900     20  STUFF-1 OCCURS 1 TO 100 TIMES DEPENDING ON LENGTH-1.
014000         30 FILLER PIC X(13).
014100 FD  SQ-FS2
014200     LABEL RECORDS STANDARD
014300C    VALUE OF
014400C    XXXXX074
014500C    IS
014600C    XXXXX076
014700G    XXXXX069
014800     BLOCK CONTAINS 2 RECORDS
014900     RECORD CONTAINS 148 TO 1435 CHARACTERS
015000     DATA RECORD SQ-FS2R1-F-G-132.
015100 01  SQ-FS2R1-F-G-132.
015200     10 REC-PRE-2 PIC X(120).
015300     10  REST-OF-2.
015400     20  LENGTH-2 PIC 999.
015500     20 KEY-4.
015600         30 ALPHAN-KEY PIC X.
015700         30 NUM-KEY PIC 999.
015800     20 KEY-5.
015900         30 ALPHAN-KEY PIC X.
016000         30 NUM-KEY PIC 999.
016100     20 KEY-6.
016200         30 ALPHAN-KEY PIC X.
016300         30 NUM-KEY PIC 999.
016400     20 STUFF-2 OCCURS 1 TO 100 TIMES DEPENDING ON LENGTH-100.
016500         30 FILLER PIC X(13).
016600 SD  ST-FS1
016700     RECORD CONTAINS 148 TO 1435 CHARACTERS
016800     DATA RECORD IS ST-FS1R1-F-G-132.
016900 01  ST-FS1R1-F-G-132.
017000     02 FILLER PIC X(120).
017100     02 LENGTH-3 PIC 999.
017200     02 NON-KEY-1.
017300         03 A-KEY PIC X.
017400         03 N-KEY PIC 999.
017500     02 SORT-KEY.
017600         03 A-KEY PIC X.
017700         03 N-KEY PIC 999.
017800     02 NON-KEY-2.
017900         03 A-KEY PIC X.
018000         03 N-KEY PIC 999.
018100     02 STUFF-3 OCCURS 1 TO 100 TIMES DEPENDING ON LENGTH-100.
018200         03 FILLER PIC X(13).
018300 WORKING-STORAGE SECTION.
018400 77  WRK-DU-9-0001 PIC 9 VALUE 0.
018500 77  WRK-DU-999-0001 PIC 999.
018600 77  WRK-DU-999-2 PIC 999 VALUE 001.
018700 77  WRK-DU-999-0002 PIC 999 VALUE 0.
018800 77  LENGTH-100 PIC 999 VALUE 100.
018900 01  WRK-XN-0001 PIC X(51) VALUE
019000     "/A.Z-B,Y+C*X)D(W$E$V F0U1G2T3H4S5I6R7J8Q9K;P<L=O>MN".
019100 01  WRK-XN-O051F-X-0001 REDEFINES WRK-XN-0001.
019200     02 CHAR PIC X OCCURS 51 TIMES.
019300 01  WRK-XN-2    PIC X(51) VALUE
019400     XXXXX063.
019500 01  WRK-XN-0051F-X-0002 REDEFINES WRK-XN-2.
019600     02 ASCIIS PIC X OCCURS 51 TIMES.
019700 01  WRK-XN-O020F-0001.
019800     02 COMPU PIC X OCCURS 20 TIMES.
019900 01  WRK-XN-X-0001 REDEFINES WRK-XN-O020F-0001.
020000     02 FILLER PIC X(20).
020100 01  WRK-XN-O120F-1.
020200     02 COLLS PIC X OCCURS 120 TIMES.
020300 01  WRK-XN-X-2 REDEFINES WRK-XN-O120F-1.
020400     02 WRK-XN-0002 PIC X(20).
020500     02 WRK-XN-0003 PIC X(20).
020600     02 WRK-XN-0004 PIC X(20).
020700     02 WRK-XN-0005 PIC X(20).
020800     02 WRK-XN-0006 PIC X(20).
020900     02 WRK-XN-0007 PIC X(20).
021000 01  FILE-RECORD-INFORMATION-REC.
021100     03 FILE-RECORD-INFO-SKELETON.
021200        05 FILLER                 PICTURE X(48)       VALUE
021300             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
021400        05 FILLER                 PICTURE X(46)       VALUE
021500             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
021600        05 FILLER                 PICTURE X(26)       VALUE
021700             ",LFIL=000000,ORG=  ,LBLR= ".
021800        05 FILLER                 PICTURE X(37)       VALUE
021900             ",RECKEY=                             ".
022000        05 FILLER                 PICTURE X(38)       VALUE
022100             ",ALTKEY1=                             ".
022200        05 FILLER                 PICTURE X(38)       VALUE
022300             ",ALTKEY2=                             ".
022400        05 FILLER                 PICTURE X(7)        VALUE SPACE.
022500     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
022600        05 FILE-RECORD-INFO-P1-120.
022700           07 FILLER              PIC X(5).
022800           07 XFILE-NAME           PIC X(6).
022900           07 FILLER              PIC X(8).
023000           07 XRECORD-NAME         PIC X(6).
023100           07 FILLER              PIC X(1).
023200           07 REELUNIT-NUMBER     PIC 9(1).
023300           07 FILLER              PIC X(7).
023400           07 XRECORD-NUMBER       PIC 9(6).
023500           07 FILLER              PIC X(6).
023600           07 UPDATE-NUMBER       PIC 9(2).
023700           07 FILLER              PIC X(5).
023800           07 ODO-NUMBER          PIC 9(4).
023900           07 FILLER              PIC X(5).
024000           07 XPROGRAM-NAME        PIC X(5).
024100           07 FILLER              PIC X(7).
024200           07 XRECORD-LENGTH       PIC 9(6).
024300           07 FILLER              PIC X(7).
024400           07 CHARS-OR-RECORDS    PIC X(2).
024500           07 FILLER              PIC X(1).
024600           07 XBLOCK-SIZE          PIC 9(4).
024700           07 FILLER              PIC X(6).
024800           07 RECORDS-IN-FILE     PIC 9(6).
024900           07 FILLER              PIC X(5).
025000           07 XFILE-ORGANIZATION   PIC X(2).
025100           07 FILLER              PIC X(6).
025200           07 XLABEL-TYPE          PIC X(1).
025300        05 FILE-RECORD-INFO-P121-240.
025400           07 FILLER              PIC X(8).
025500           07 XRECORD-KEY          PIC X(29).
025600           07 FILLER              PIC X(9).
025700           07 ALTERNATE-KEY1      PIC X(29).
025800           07 FILLER              PIC X(9).
025900           07 ALTERNATE-KEY2      PIC X(29).
026000           07 FILLER              PIC X(7).
026100 01  TEST-RESULTS.
026200     02 FILLER                   PIC X      VALUE SPACE.
026300     02 FEATURE                  PIC X(20)  VALUE SPACE.
026400     02 FILLER                   PIC X      VALUE SPACE.
026500     02 P-OR-F                   PIC X(5)   VALUE SPACE.
026600     02 FILLER                   PIC X      VALUE SPACE.
026700     02  PAR-NAME.
026800       03 FILLER                 PIC X(19)  VALUE SPACE.
026900       03  PARDOT-X              PIC X      VALUE SPACE.
027000       03 DOTVALUE               PIC 99     VALUE ZERO.
027100     02 FILLER                   PIC X(8)   VALUE SPACE.
027200     02 RE-MARK                  PIC X(61).
027300 01  TEST-COMPUTED.
027400     02 FILLER                   PIC X(30)  VALUE SPACE.
027500     02 FILLER                   PIC X(17)  VALUE
027600            "       COMPUTED=".
027700     02 COMPUTED-X.
027800     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
027900     03 COMPUTED-N               REDEFINES COMPUTED-A
028000                                 PIC -9(9).9(9).
028100     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
028200     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
028300     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
028400     03       CM-18V0 REDEFINES COMPUTED-A.
028500         04 COMPUTED-18V0                    PIC -9(18).
028600         04 FILLER                           PIC X.
028700     03 FILLER PIC X(50) VALUE SPACE.
028800 01  TEST-CORRECT.
028900     02 FILLER PIC X(30) VALUE SPACE.
029000     02 FILLER PIC X(17) VALUE "       CORRECT =".
029100     02 CORRECT-X.
029200     03 CORRECT-A                  PIC X(20) VALUE SPACE.
029300     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
029400     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
029500     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
029600     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
029700     03      CR-18V0 REDEFINES CORRECT-A.
029800         04 CORRECT-18V0                     PIC -9(18).
029900         04 FILLER                           PIC X.
030000     03 FILLER PIC X(2) VALUE SPACE.
030100     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
030200 01  CCVS-C-1.
030300     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
030400-    "SS  PARAGRAPH-NAME
030500-    "       REMARKS".
030600     02 FILLER                     PIC X(20)    VALUE SPACE.
030700 01  CCVS-C-2.
030800     02 FILLER                     PIC X        VALUE SPACE.
030900     02 FILLER                     PIC X(6)     VALUE "TESTED".
031000     02 FILLER                     PIC X(15)    VALUE SPACE.
031100     02 FILLER                     PIC X(4)     VALUE "FAIL".
031200     02 FILLER                     PIC X(94)    VALUE SPACE.
031300 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
031400 01  REC-CT                        PIC 99       VALUE ZERO.
031500 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
031600 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
031700 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
031800 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
031900 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
032000 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
032100 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
032200 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
032300 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
032400 01  CCVS-H-1.
032500     02  FILLER                    PIC X(39)    VALUE SPACES.
032600     02  FILLER                    PIC X(42)    VALUE
032700     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
032800     02  FILLER                    PIC X(39)    VALUE SPACES.
032900 01  CCVS-H-2A.
033000   02  FILLER                        PIC X(40)  VALUE SPACE.
033100   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
033200   02  FILLER                        PIC XXXX   VALUE
033300     "4.2 ".
033400   02  FILLER                        PIC X(28)  VALUE
033500            " COPY - NOT FOR DISTRIBUTION".
033600   02  FILLER                        PIC X(41)  VALUE SPACE.
033700
033800 01  CCVS-H-2B.
033900   02  FILLER                        PIC X(15)  VALUE
034000            "TEST RESULT OF ".
034100   02  TEST-ID                       PIC X(9).
034200   02  FILLER                        PIC X(4)   VALUE
034300            " IN ".
034400   02  FILLER                        PIC X(12)  VALUE
034500     " HIGH       ".
034600   02  FILLER                        PIC X(22)  VALUE
034700            " LEVEL VALIDATION FOR ".
034800   02  FILLER                        PIC X(58)  VALUE
034900     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
035000 01  CCVS-H-3.
035100     02  FILLER                      PIC X(34)  VALUE
035200            " FOR OFFICIAL USE ONLY    ".
035300     02  FILLER                      PIC X(58)  VALUE
035400     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
035500     02  FILLER                      PIC X(28)  VALUE
035600            "  COPYRIGHT   1985 ".
035700 01  CCVS-E-1.
035800     02 FILLER                       PIC X(52)  VALUE SPACE.
035900     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
036000     02 ID-AGAIN                     PIC X(9).
036100     02 FILLER                       PIC X(45)  VALUE SPACES.
036200 01  CCVS-E-2.
036300     02  FILLER                      PIC X(31)  VALUE SPACE.
036400     02  FILLER                      PIC X(21)  VALUE SPACE.
036500     02 CCVS-E-2-2.
036600         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
036700         03 FILLER                   PIC X      VALUE SPACE.
036800         03 ENDER-DESC               PIC X(44)  VALUE
036900            "ERRORS ENCOUNTERED".
037000 01  CCVS-E-3.
037100     02  FILLER                      PIC X(22)  VALUE
037200            " FOR OFFICIAL USE ONLY".
037300     02  FILLER                      PIC X(12)  VALUE SPACE.
037400     02  FILLER                      PIC X(58)  VALUE
037500     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
037600     02  FILLER                      PIC X(13)  VALUE SPACE.
037700     02 FILLER                       PIC X(15)  VALUE
037800             " COPYRIGHT 1985".
037900 01  CCVS-E-4.
038000     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
038100     02 FILLER                       PIC X(4)   VALUE " OF ".
038200     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
038300     02 FILLER                       PIC X(40)  VALUE
038400      "  TESTS WERE EXECUTED SUCCESSFULLY".
038500 01  XXINFO.
038600     02 FILLER                       PIC X(19)  VALUE
038700            "*** INFORMATION ***".
038800     02 INFO-TEXT.
038900       04 FILLER                     PIC X(8)   VALUE SPACE.
039000       04 XXCOMPUTED                 PIC X(20).
039100       04 FILLER                     PIC X(5)   VALUE SPACE.
039200       04 XXCORRECT                  PIC X(20).
039300     02 INF-ANSI-REFERENCE           PIC X(48).
039400 01  HYPHEN-LINE.
039500     02 FILLER  PIC IS X VALUE IS SPACE.
039600     02 FILLER  PIC IS X(65)    VALUE IS "************************
039700-    "*****************************************".
039800     02 FILLER  PIC IS X(54)    VALUE IS "************************
039900-    "******************************".
040000 01  CCVS-PGM-ID                     PIC X(9)   VALUE
040100     "ST137A".
040200 PROCEDURE DIVISION.
040300 DECLARATIVES.
040400 SECT-ST216-DEC SECTION.
040500     USE AFTER STANDARD ERROR PROCEDURE ON OUTPUT.
040600 SRT-WRITE-DEC.
040700     MOVE "ERROR ON OUTPUT DECL." TO FEATURE.
040800     MOVE "SRT-TEST-DEC" TO PAR-NAME.
040900     WRITE   PRINT-REC FROM TEST-RESULTS AFTER ADVANCING 2 LINES.
041000     STOP RUN.
041100 END DECLARATIVES.
041200 CCVS1 SECTION.
041300 OPEN-FILES.
041400     OPEN    OUTPUT PRINT-FILE.
041500     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
041600     MOVE    SPACE TO TEST-RESULTS.
041700     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
041800     MOVE    ZERO TO REC-SKL-SUB.
041900     PERFORM CCVS-INIT-FILE 9 TIMES.
042000 CCVS-INIT-FILE.
042100     ADD     1 TO REC-SKL-SUB.
042200     MOVE    FILE-RECORD-INFO-SKELETON
042300          TO FILE-RECORD-INFO (REC-SKL-SUB).
042400 CCVS-INIT-EXIT.
042500     GO TO CCVS1-EXIT.
042600 CLOSE-FILES.
042700     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
042800 TERMINATE-CCVS.
042900S    EXIT PROGRAM.
043000STERMINATE-CALL.
043100     STOP     RUN.
043200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
043300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
043400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
043500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
043600     MOVE "****TEST DELETED****" TO RE-MARK.
043700 PRINT-DETAIL.
043800     IF REC-CT NOT EQUAL TO ZERO
043900             MOVE "." TO PARDOT-X
044000             MOVE REC-CT TO DOTVALUE.
044100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
044200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
044300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
044400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
044500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
044600     MOVE SPACE TO CORRECT-X.
044700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
044800     MOVE     SPACE TO RE-MARK.
044900 HEAD-ROUTINE.
045000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
045300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
045400 COLUMN-NAMES-ROUTINE.
045500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
045600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
045700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
045800 END-ROUTINE.
045900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
046000 END-RTN-EXIT.
046100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
046200 END-ROUTINE-1.
046300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
046400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
046500      ADD PASS-COUNTER TO ERROR-HOLD.
046600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
046700      MOVE PASS-COUNTER TO CCVS-E-4-1.
046800      MOVE ERROR-HOLD TO CCVS-E-4-2.
046900      MOVE CCVS-E-4 TO CCVS-E-2-2.
047000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
047100  END-ROUTINE-12.
047200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
047300     IF       ERROR-COUNTER IS EQUAL TO ZERO
047400         MOVE "NO " TO ERROR-TOTAL
047500         ELSE
047600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
047700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
047800     PERFORM WRITE-LINE.
047900 END-ROUTINE-13.
048000     IF DELETE-COUNTER IS EQUAL TO ZERO
048100         MOVE "NO " TO ERROR-TOTAL  ELSE
048200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
048300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
048400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
048500      IF   INSPECT-COUNTER EQUAL TO ZERO
048600          MOVE "NO " TO ERROR-TOTAL
048700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
048800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
048900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
049100 WRITE-LINE.
049200     ADD 1 TO RECORD-COUNT.
049300Y    IF RECORD-COUNT GREATER 42
049400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
049500Y        MOVE SPACE TO DUMMY-RECORD
049600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
049700Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
049800Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
049900Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
050000Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
050100Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
050200Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
050300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
050400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
050500Y        MOVE ZERO TO RECORD-COUNT.
050600     PERFORM WRT-LN.
050700 WRT-LN.
050800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
050900     MOVE SPACE TO DUMMY-RECORD.
051000 BLANK-LINE-PRINT.
051100     PERFORM WRT-LN.
051200 FAIL-ROUTINE.
051300     IF     COMPUTED-X NOT EQUAL TO SPACE
051400            GO TO   FAIL-ROUTINE-WRITE.
051500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
051600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
051700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
051800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
051900     MOVE   SPACES TO INF-ANSI-REFERENCE.
052000     GO TO  FAIL-ROUTINE-EX.
052100 FAIL-ROUTINE-WRITE.
052200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
052300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
052400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
052500     MOVE   SPACES TO COR-ANSI-REFERENCE.
052600 FAIL-ROUTINE-EX. EXIT.
052700 BAIL-OUT.
052800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
052900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
053000 BAIL-OUT-WRITE.
053100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
053200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
053300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
053400     MOVE   SPACES TO INF-ANSI-REFERENCE.
053500 BAIL-OUT-EX. EXIT.
053600 CCVS1-EXIT.
053700     EXIT.
053800 SECT-ST216-0001 SECTION.
053900 SRT-INIT-001.
054000     MOVE "CREATE FILE SQ-FS1" TO FEATURE.
054100     OPEN OUTPUT SQ-FS1.
054200     MOVE "SQ-FS1" TO XFILE-NAME (1).
054300     MOVE "R1-F-G" TO XRECORD-NAME (1).
054400     MOVE ".XXX." TO XPROGRAM-NAME (1).
054500     MOVE "RC" TO CHARS-OR-RECORDS (1).
054600     MOVE 0001 TO XBLOCK-SIZE (1).
054700     MOVE 000051 TO RECORDS-IN-FILE (1).
054800     MOVE "SQ" TO XFILE-ORGANIZATION (1).
054900     MOVE "S" TO XLABEL-TYPE (1).
055000     MOVE 000001 TO XRECORD-NUMBER (1).
055100             MOVE SPACES TO WRK-XN-O120F-1.
055200 SRT-TEST-001.
055300     PERFORM SRT-TEST-001-BUILD VARYING WRK-DU-999-0001
055400         FROM 1 BY 1 UNTIL WRK-DU-999-0001 IS GREATER THAN 51.
055500X    MOVE    SPACES TO PRINT-REC.
055600X    WRITE   PRINT-REC.
055700     IF XRECORD-NUMBER (1) IS NOT EQUAL TO 000052
055800         PERFORM FAIL MOVE "INCORR. NO. OF RECS." TO RE-MARK
055900         ELSE
056000         PERFORM PASS.
056100     GO TO SRT-WRITE-001.
056200 SRT-TEST-001-BUILD.
056300     MOVE CHAR (WRK-DU-999-0001) TO ALPHAN-KEY OF KEY-1
056400         ALPHAN-KEY OF KEY-2 ALPHAN-KEY OF KEY-3.
056500     MOVE WRK-DU-999-0001 TO NUM-KEY OF KEY-1 NUM-KEY OF KEY-2
056600         NUM-KEY OF KEY-3.
056700     MULTIPLY  WRK-DU-999-0001 BY 13
056800             GIVING XRECORD-LENGTH (1) ROUNDED.
056900     ADD     135 TO XRECORD-LENGTH (1).
057000     MOVE WRK-DU-999-0001 TO LENGTH-1.
057100     PERFORM STUFF-IT VARYING WRK-DU-999-0002
057200         FROM 1 BY 1 UNTIL WRK-DU-999-0002 IS GREATER THAN
057300             WRK-DU-999-0001.
057400     MOVE FILE-RECORD-INFO-P1-120 (1) TO REC-PREAMBLE.
057500     ADD 1 TO XRECORD-NUMBER (1).
057600     MOVE ASCIIS (WRK-DU-999-0001) TO COLLS (WRK-DU-999-2).
057700     ADD 1 TO WRK-DU-999-2.
057800X    WRITE PRINT-REC FROM SQ-FS1R1-F-G-132.
057900X    WRITE PRINT-REC FROM REST-OF-1.
058000X    MOVE SPACES TO PRINT-REC.
058100     WRITE   SQ-FS1R1-F-G-132.
058200 STUFF-IT.
058300     MOVE WRK-DU-999-0002 TO STUFF-1 (WRK-DU-999-0002).
058400 SRT-DELETE-001.
058500     PERFORM DE-LETE.
058600 SRT-WRITE-001.
058700     MOVE "SRT-TEST-001" TO PAR-NAME.
058800     MOVE "FIRST FILE CREATED" TO COMPUTED-A.
058900     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
059000     PERFORM PRINT-DETAIL.
059100X    MOVE    SPACES TO PRINT-REC.
059200X    WRITE   PRINT-REC.
059300     CLOSE SQ-FS1.
059400 SRT-INIT-002.
059500     MOVE "CREATE FILE SQ-FS2" TO FEATURE.
059600     OPEN OUTPUT SQ-FS2.
059700     MOVE  "SQ-FS2" TO XFILE-NAME (1).
059800     MOVE 000001 TO XRECORD-NUMBER (1).
059900     MOVE    000148 TO XRECORD-LENGTH (1).
060000     MOVE 0002 TO XBLOCK-SIZE (1).
060100 SRT-TEST-002.
060200     PERFORM SRT-TEST-002-BUILD VARYING WRK-DU-999-0001
060300         FROM 1 BY 1 UNTIL WRK-DU-999-0001 IS GREATER THAN 51.
060400X    MOVE    SPACES TO PRINT-REC.
060500X    WRITE   PRINT-REC.
060600     IF XRECORD-NUMBER (1) IS NOT EQUAL TO 000052
060700         PERFORM FAIL MOVE "INCORR. NO. OF RECS." TO RE-MARK
060800         ELSE
060900         PERFORM PASS.
061000     GO TO SRT-WRITE-002.
061100 SRT-TEST-002-BUILD.
061200     MOVE  100 TO LENGTH-2.
061300     MOVE    SPACES TO STUFF-2 (1).
061400     MOVE CHAR (WRK-DU-999-0001) TO ALPHAN-KEY OF KEY-4
061500         ALPHAN-KEY OF KEY-5 ALPHAN-KEY OF KEY-6.
061600     ADD 51 WRK-DU-999-0001 GIVING NUM-KEY OF KEY-4
061700         NUM-KEY OF KEY-5 NUM-KEY OF KEY-6.
061800     MOVE FILE-RECORD-INFO-P1-120 (1) TO REC-PRE-2.
061900     ADD 000001 TO XRECORD-NUMBER (1).
062000X    WRITE PRINT-REC FROM SQ-FS2R1-F-G-132.
062100X    WRITE PRINT-REC FROM REST-OF-2.
062200X    MOVE SPACES TO PRINT-REC.
062300     WRITE   SQ-FS2R1-F-G-132.
062400 SRT-DELETE-002.
062500     PERFORM DE-LETE.
062600 SRT-WRITE-002.
062700     MOVE "SRT-TEST-002" TO PAR-NAME.
062800     MOVE "2ND FILE CREATED" TO COMPUTED-A.
062900     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
063000     PERFORM PRINT-DETAIL.
063100X    MOVE    SPACES TO PRINT-REC.
063200X    WRITE   PRINT-REC.
063300     CLOSE SQ-FS2.
063400 SRT-INIT-003.
063500     MOVE 100 TO LENGTH-100.
063600     SORT ST-FS1
063700         ON ASCENDING KEY A-KEY OF SORT-KEY
063800         ASCENDING N-KEY OF NON-KEY-2
063900         USING SQ-FS1
064000         GIVING SQ-FS2.
064100 SRT-TEST-003.
064200     MOVE SPACES TO WRK-XN-X-0001.
064300     OPEN INPUT SQ-FS2.
064400     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
064500         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
064600X    MOVE    SPACES TO PRINT-REC.
064700X    WRITE   PRINT-REC.
064800     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0002
064900         PERFORM FAIL GO TO SRT-FAIL-003
065000         ELSE
065100         PERFORM PASS.
065200     GO TO SRT-WRITE-003.
065300 SRT-DELETE-003.
065400     PERFORM DE-LETE.
065500     GO TO SRT-WRITE-003.
065600 SRT-FAIL-003.
065700     MOVE WRK-XN-X-0001 TO COMPUTED-A.
065800     MOVE WRK-XN-0002 TO CORRECT-A.
065900 SRT-WRITE-003.
066000     MOVE "SRT-TEST-003" TO PAR-NAME.
066100     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
066200     PERFORM PRINT-DETAIL.
066300X    MOVE    SPACES TO PRINT-REC.
066400X    WRITE   PRINT-REC.
066500 SRT-INIT-004.
066600     MOVE SPACES TO WRK-XN-X-0001.
066700 SRT-TEST-004.
066800     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
066900         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
067000X    MOVE    SPACES TO PRINT-REC.
067100X    WRITE   PRINT-REC.
067200     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0003
067300         PERFORM FAIL GO TO SRT-FAIL-004
067400         ELSE
067500         PERFORM PASS.
067600     GO TO SRT-WRITE-004.
067700 SRT-DELETE-004.
067800     PERFORM DE-LETE.
067900     GO TO SRT-WRITE-004.
068000 SRT-FAIL-004.
068100     MOVE WRK-XN-X-0001 TO COMPUTED-A.
068200     MOVE WRK-XN-0003 TO CORRECT-A.
068300 SRT-WRITE-004.
068400     MOVE "SRT-TEST-004" TO PAR-NAME.
068500     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
068600     PERFORM PRINT-DETAIL.
068700X    MOVE    SPACES TO PRINT-REC.
068800X    WRITE   PRINT-REC.
068900 SRT-INIT-005.
069000     MOVE SPACES TO WRK-XN-X-0001.
069100 SRT-TEST-005.
069200     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
069300         UNTIL WRK-DU-999-0001 IS GREATER THAN 11.
069400X    MOVE    SPACES TO PRINT-REC.
069500X    WRITE   PRINT-REC.
069600     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0004
069700         PERFORM FAIL GO TO SRT-FAIL-005
069800         ELSE
069900         PERFORM PASS.
070000     GO TO SRT-WRITE-005.
070100 SRT-DELETE-005.
070200     PERFORM DE-LETE.
070300     GO TO SRT-WRITE-005.
070400 SRT-FAIL-005.
070500     MOVE WRK-XN-X-0001 TO COMPUTED-A.
070600     MOVE WRK-XN-0004 TO CORRECT-A.
070700 SRT-WRITE-005.
070800     MOVE "SRT-TEST-005" TO PAR-NAME.
070900     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
071000     PERFORM PRINT-DETAIL.
071100 SRT-TEST-006.
071200     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
071300         GO TO SRT-FAIL-006.
071400     READ SQ-FS2 AT END PERFORM PASS
071500     GO TO SRT-WRITE-006.
071600     GO TO SRT-FAIL-006.
071700 SRT-DELETE-006.
071800     PERFORM DE-LETE.
071900 SRT-FAIL-006.
072000     MOVE "EOF NOT FOUND" TO RE-MARK.
072100     PERFORM FAIL .
072200 SRT-WRITE-006.
072300     MOVE "EOF CHECK SQ-FS2" TO FEATURE.
072400     MOVE "SRT-TEST-006" TO PAR-NAME.
072500     PERFORM PRINT-DETAIL.
072600     CLOSE   SQ-FS2.
072700     GO TO CCVS-999999.
072800 READ-SQ-FS1 SECTION.
072900 RD-1.
073000     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
073100         GO TO R1-EXIT.
073200     READ SQ-FS2 AT END GO TO PREMATURE-EOF.
073300X    MOVE LENGTH-2 TO LENGTH-100.
073400X    WRITE PRINT-REC FROM SQ-FS2R1-F-G-132.
073500X    WRITE PRINT-REC FROM REST-OF-2.
073600X    MOVE 100 TO LENGTH-100.
073700X    MOVE SPACES TO PRINT-REC.
073800     MOVE ALPHAN-KEY OF KEY-6 TO COMPU (WRK-DU-999-0001).
073900     GO TO R1-EXIT.
074000 PREMATURE-EOF.
074100     MOVE 1 TO WRK-DU-9-0001.
074200     MOVE "PREMATURE EOF FOUND" TO RE-MARK.
074300 R1-EXIT.
074400     EXIT.
074500 CCVS-EXIT SECTION.
074600 CCVS-999999.
074700     GO TO CLOSE-FILES.
