000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300     ST147A.
000400****************************************************************
000500*                                                              *
000600*    VALIDATION FOR:-                                          *
000700*                                                              *
000800*    "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
000900*                                                              *
001000*    "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
001100*                                                              *
001200****************************************************************
001300*
001400*    OBJECTIVE -
001500*        ROUTINE ST147A IS A TEST OF THE MERGE STATEMENT USING
001600*    A NATIVE  COLLATING SEQUENCE AND FIXED LENGTH RECORDS.
001700*
001800*        TWO FILES ARE FIRST CREATED BY THE ROUTINE IN DESCENDING
001900*    NATIVE ORDER.  THE MERGE STATEMENT IS USED TO MERGE THE TWO
002000*    FILES AND PRODUCE, IN DESCENDING NATIVE COLLATING
002100*    SEQUENCE ORDER, 3 OUTPUT FILES FROM A SINGLE "MERGE"
002200*    STATEMENT.
002300*
002400*    FEATURES TESTED -
002500*    *   FIXED LENGTH RECORDS
002600*    *   SAME SORT-MERGE AREA IN THE I-O-CONTROL PARAGRAPH
002700*    *   QUALIFIED ALPHANUMERIC AND NUMERIC SORT KEYS
002800*    *   USING FILE-NAME SERIES
002900*
003000*    *   MERGE MERGE-FILE-NAME
003100*        DESCENDING KEY-1 OF DATA-NAME-1
003200*        ON DESCENDING KEY KEY-2 OF DATA-NAME-2
003300*        USING FILE-NAME-2 FILE-NAME-1
003400*        GIVING FILE-NAME-3, FILE-NAME-4, FILE-NAME-5.
003500*
003600*    FILES USED -
003700*    *   FILES SQ-FS1 AND SQ-FS2 ON MAGNETIC TAPE OR MASS-STORAGE
003800*    ARE FIRST CREATED.  THE MERGE STATEMENT
003900*    USES BOTH OF THESE FILES AND CREATES OUTPUT FILES
004000*    SQ-FS3, SQ-FS4 AND SQ-FS5.
004100*
004200*        SQ-FS1
004300*    51 RECORDS
004400*    FIXED LENGTH RECORDS 132 CHARACTERS
004500*    BLOCKED 1
004600*    RESERVE 2 AREAS
004700*
004800*        SQ-FS2
004900*    51 RECORDS
005000*    FIXED LENGTH RECORDS 132 CHARACTERS
005100*    BLOCKED 2
005200*    RESERVE 4 AREAS
005300*
005400*        SQ-FS3, SQ-FS4 AND SQ-FS5
005500*    FINAL TOTAL OF 102 RECORDS
005600*    FIXED LENGTH RECORDS 132 CHARACTERS
005700*    BLOCKED 3
005800*    RESERVE 4 AREAS
005900*
006000*        NOTE THAT SQ-FS3 IS THE RESULT OF MERGING SQ-FS1 AND
006100*    SQ-FS2.  THE RECORDS IN SQ-FS3 SHOULD ALTERNATE BETWEEN
006200*    SQ-FS1 AND SQ-FS2 BECAUSE THE ALPHANUMERIC KEYS ARE THE SAME
006300*    FOR BOTH FILES AND THE NUMERIC KEYS WERE MERGED INTO
006400*    DESCENDING ORDER.  FILES SQ-FS4 AND SQ-FS5 ARE
006500*    IDENTICAL TO SQ-FS3.
006600*
006700*    X-CARDS USED  -
006800*    X-XXX014     SQ-FS1
006900*    X-XXX015     SQ-FS2
007000*    X-XXX016     SQ-FS3
007100*    X-XXX018     SQ-FS5
007200*    X-XXX027     MERGE FILE ST-FS1
007300*    X-55         SYSTEM PRINTER NAME.
007400*    X-60         SQ-FS4
007500*    X-XXX063     NATIVE COLLATING SEQUENCE ASCENDING ORDER-NOTE
007600*        THAT THE QUOTE CHARACTER IS NOT TO APPEAR IN THE X-64
007700*        CARD AND THE DOLLAR SIGN $ IS TO APPEAR TWICE WHEREVER
007800*        THE $ BELONGS IN THE NATIVE COLLATING SEQUENCE).  IF
007900*        THE NATIVE COLLATING SEQUENCE IS ACTUALLY THE ASCII
008000*        COLLATING SEQUENCE SEE BELOW FOR A SAMPLE X-64 CARD.....
008100*
008200*    X-63  " $$()*+,./0123456789;<=>ABCDEFGHIJKLMNOPQRSTUVWXYZ".
008300*    X-69         OPTIONAL VALUE OF CLAUSE
008400*    X-74         VALUE OF CLAUSE NAME PHRASES
008500*    X-75         VALUE OF CLAUSE NAME PHRASES
008600*    X-76         VALUE OF CLAUSE NAME PHRASES
008700*    X-77         VALUE OF CLAUSE NAME PHRASES
008800*    X-78         VALUE OF CLAUSE NAME PHRASES
008900*    X-79         VALUE OF CLAUSE NAME PHRASES
009000*    X-82         SOURCE COMPUTER NAME.
009100*    X-83         OBJECT COMPUTER NAME.
009200*
009300*
009400*    OPTIONS RECOMMENDED -
009500*    *   OPT SW6 - X   TO BE USED IF NECESSARY TO DUMP THE
009600*                      FILES AS THEY ARE CREATED AND READ
009700*                      DURING TESTS 3 THRU 8, 11 THRU 16,
009800*                      AND 19 THRU 24.
009900*
010000*    TEST DESCRIPTIONS -
010100*    MRG-TEST-001     CHECKS THE CREATION OF SQ-FS1
010200*    MRG-TEST-002     CHECKS THE CREATION OF SQ-FS2
010300*    MRG-TEST-003     TESTS RECORDS 1-20 ON MERGE RESULT SQ-FS3
010400*    MRG-TEST-004     TESTS RECORDS 21-40 ON MERGE RESULT SQ-FS3
010500*    MRG-TEST-005     TESTS RECORDS 41-60 ON MERGE RESULT SQ-FS3
010600*    MRG-TEST-006     TESTS RECORDS 61-80 ON MERGE RESULT SQ-FS3
010700*    MRG-TEST-007     TESTS RECORDS 81-100 ON MERGE RESULT SQ-FS3
010800*    MRG-TEST-008     TESTS RECORDS 101-102 ON MERGE RESULT SQ-FS3
010900*    MRG-TEST-009     AN EOF CHECK ON SQ-FS3
011000*    MRG-TEST-010     CHECK THAT THE NUMERIC KEY ON THE LAST
011100*                     RECORD ON SQ-FS3 EQUALS 51
011200*    MRG-TEST-011
011300*    TO
011400*    MRG-TEST-018     SAME TESTS ON SQ-FS4
011500*    MRG-TEST-019
011600*    TO
011700*    MRG-TEST-026     SAME TESTS ON SQ-FS5
011800*
011900*    ************************************************************
012000 ENVIRONMENT DIVISION.
012100 CONFIGURATION SECTION.
012200 SOURCE-COMPUTER.
012300     XXXXX082.
012400 OBJECT-COMPUTER.
012500     XXXXX083.
012600 INPUT-OUTPUT SECTION.
012700 FILE-CONTROL.
012800     SELECT PRINT-FILE ASSIGN TO
012900     XXXXX055.
013000     SELECT SQ-FS1 ASSIGN
013100     XXXXX014
013200     ; ORGANIZATION IS SEQUENTIAL
013300     ; ACCESS MODE SEQUENTIAL
013400     ; RESERVE 2 AREAS.
013500     SELECT SQ-FS2 ASSIGN TO
013600     XXXXX015
013700     ORGANIZATION IS SEQUENTIAL
013800     ACCESS MODE IS SEQUENTIAL
013900     RESERVE 4 AREAS.
014000     SELECT SQ-FS3 ASSIGN TO
014100     XXXXX016
014200     ORGANIZATION IS SEQUENTIAL
014300     ; ACCESS MODE IS SEQUENTIAL
014400     RESERVE 4 AREAS.
014500     SELECT SQ-FS4 ASSIGN TO
014600     XXXXX060
014700     ORGANIZATION IS SEQUENTIAL
014800     ; ACCESS MODE IS SEQUENTIAL
014900     RESERVE 4 AREAS.
015000     SELECT SQ-FS5 ASSIGN TO
015100     XXXXX018
015200     ORGANIZATION IS SEQUENTIAL
015300     ; ACCESS MODE IS SEQUENTIAL
015400     RESERVE 4 AREAS.
015500     SELECT ST-FS1 ASSIGN TO
015600     XXXXX027.
015700 I-O-CONTROL.
015800*    SAME SORT-MERGE AREA FOR SQ-FS1, ST-FS1.
015900 DATA DIVISION.
016000 FILE SECTION.
016100 FD  PRINT-FILE.
016200 01  PRINT-REC PICTURE X(120).
016300 01  DUMMY-RECORD PICTURE X(120).
016400 FD  SQ-FS1
016500     LABEL RECORDS STANDARD
016600C    VALUE OF
016700C    XXXXX074
016800C    XXXXX075
016900C    BLOCK CONTAINS 1 RECORDS
017000G    XXXXX069
017100     RECORD CONTAINS 132 CHARACTERS.
017200 01  SQ-FS1R1-F-G-132.
017300     10 REC-PREAMBLE PIC X(120).
017400     10 REST-OF-1.
017500     20 KEY-1.
017600         30 ALPHAN-KEY PIC X.
017700         30 NUM-KEY PIC 999.
017800     20 KEY-2.
017900         30 ALPHAN-KEY PIC X.
018000         30 NUM-KEY PIC 999.
018100     20 KEY-3.
018200         30 ALPHAN-KEY PIC X.
018300         30 NUM-KEY PIC 999.
018400 FD  SQ-FS2
018500     LABEL RECORD IS STANDARD
018600C    ; VALUE OF
018700C    XXXXX074
018800C    IS
018900C    XXXXX076
019000G    XXXXX069
019100     ; BLOCK CONTAINS 2 RECORDS
019200     ; RECORD CONTAINS 132 CHARACTERS
019300     DATA RECORD SQ-FS2R1-F-G-132.
019400 01  SQ-FS2R1-F-G-132.
019500     10 REC-PRE-2 PIC X(120).
019600     10 REST-OF-2.
019700     20 KEY-4.
019800         30 ALPHAN-KEY PIC X.
019900         30 NUM-KEY PIC 999.
020000     20 KEY-5.
020100         30 ALPHAN-KEY PIC X.
020200         30 NUM-KEY PIC 999.
020300     20 KEY-6.
020400         30 ALPHAN-KEY PIC X.
020500         30 NUM-KEY PIC 999.
020600 FD  SQ-FS3
020700     LABEL RECORD IS STANDARD
020800C    ; VALUE OF
020900C    XXXXX074
021000C    IS
021100C    XXXXX077
021200G    XXXXX069
021300     ; BLOCK CONTAINS 3 RECORDS
021400     RECORD CONTAINS 132 CHARACTERS
021500     DATA RECORD SQ-FS3R1-F-G-132.
021600 01  SQ-FS3R1-F-G-132.
021700     10  REC-PRE-3 PIC X(120).
021800     10  REST-OF-3.
021900     20  KEY-7.
022000          30  ALPHAN-KEY PIC X.
022100          30  NUM-KEY PIC 999.
022200     20  KEY-8.
022300          30  ALPHAN-KEY PIC X.
022400          30  NUM-KEY PIC 999.
022500     20  KEY-9.
022600          30  ALPHAN-KEY PIC X.
022700          30  NUM-KEY PIC 999.
022800 FD  SQ-FS4
022900     LABEL RECORD IS STANDARD
023000C    ; VALUE OF
023100C    XXXXX074
023200C    IS
023300C    XXXXX078
023400G    XXXXX069
023500     ; BLOCK CONTAINS 3 RECORDS
023600     RECORD CONTAINS 132 CHARACTERS
023700     DATA RECORD SQ-FS4R1-F-G-132.
023800 01  SQ-FS4R1-F-G-132.
023900     10  REC-PRE-4 PIC X(120).
024000     10  REST-OF-4.
024100     20  KEY-10.
024200          30  ALPHAN-KEY PIC X.
024300          30  NUM-KEY PIC 999.
024400     20  KEY-11.
024500          30  ALPHAN-KEY PIC X.
024600          30  NUM-KEY PIC 999.
024700     20  KEY-12.
024800          30  ALPHAN-KEY PIC X.
024900          30  NUM-KEY PIC 999.
025000 FD  SQ-FS5
025100     LABEL RECORD IS STANDARD
025200C    ; VALUE OF
025300C    XXXXX074
025400C    IS
025500C    XXXXX079
025600G    XXXXX069
025700     ; BLOCK CONTAINS 3 RECORDS
025800     RECORD CONTAINS 132 CHARACTERS
025900     DATA RECORD SQ-FS5R1-F-G-132.
026000 01  SQ-FS5R1-F-G-132.
026100     10  REC-PRE-5 PIC X(120).
026200     10  REST-OF-5.
026300     20  KEY-13.
026400          30  ALPHAN-KEY PIC X.
026500          30  NUM-KEY PIC 999.
026600     20  KEY-14.
026700          30  ALPHAN-KEY PIC X.
026800          30  NUM-KEY PIC 999.
026900     20  KEY-15.
027000          30  ALPHAN-KEY PIC X.
027100          30  NUM-KEY PIC 999.
027200 SD  ST-FS1
027300     RECORD CONTAINS 132 CHARACTERS
027400     DATA RECORD IS ST-FS1R1-F-G-132.
027500 01  ST-FS1R1-F-G-132.
027600     02 FILLER PIC X(120).
027700     02 NON-KEY-1.
027800         03 A-KEY PIC X.
027900         03 N-KEY PIC 999.
028000     02 SORT-KEY.
028100         03 A-KEY PIC X.
028200         03 N-KEY PIC 999.
028300     02 NON-KEY-2.
028400         03 A-KEY PIC X.
028500         03 N-KEY PIC 999.
028600 WORKING-STORAGE SECTION.
028700 77  WRK-DU-9-0001 PIC 9 VALUE 0.
028800 77  WRK-DU-999-0001 PIC 999.
028900 77  WRK-DU-999-2 PIC 999 VALUE 001.
029000 77  LAST-REC-NUM  PIC 999 VALUE ZERO.
029100 01  WRK-XN-0001 PIC X(51) VALUE
029200     XXXXX063.
029300 01  WRK-XN-O051F-X-0001 REDEFINES WRK-XN-0001.
029400     02 CHAR PIC X OCCURS 51 TIMES.
029500 01  WRK-XN-2    PIC X(51) VALUE
029600     XXXXX063.
029700 01  WRK-XN-0051F-X-0002 REDEFINES WRK-XN-2.
029800     02 ASCIIS PIC X OCCURS 51 TIMES.
029900 01  WRK-XN-O020F-0001.
030000     02 COMPU PIC X OCCURS 20 TIMES.
030100 01  WRK-XN-X-0001 REDEFINES WRK-XN-O020F-0001.
030200     02 FILLER PIC X(20).
030300 01  WRK-XN-O120F-1.
030400     02 COLLS PIC X OCCURS 120 TIMES.
030500 01  WRK-XN-X-2 REDEFINES WRK-XN-O120F-1.
030600     02 WRK-XN-0002 PIC X(20).
030700     02 WRK-XN-0003 PIC X(20).
030800     02 WRK-XN-0004 PIC X(20).
030900     02 WRK-XN-0005 PIC X(20).
031000     02 WRK-XN-0006 PIC X(20).
031100     02 WRK-XN-0007 PIC X(20).
031200 01  FILE-RECORD-INFORMATION-REC.
031300     03 FILE-RECORD-INFO-SKELETON.
031400        05 FILLER                 PICTURE X(48)       VALUE
031500             "FILE=      ,RECORD=      /0,RECNO=000000,UPDT=00".
031600        05 FILLER                 PICTURE X(46)       VALUE
031700             ",ODO=0000,PGM=     ,LRECL=000000,BLKSIZ  =0000".
031800        05 FILLER                 PICTURE X(26)       VALUE
031900             ",LFIL=000000,ORG=  ,LBLR= ".
032000        05 FILLER                 PICTURE X(37)       VALUE
032100             ",RECKEY=                             ".
032200        05 FILLER                 PICTURE X(38)       VALUE
032300             ",ALTKEY1=                             ".
032400        05 FILLER                 PICTURE X(38)       VALUE
032500             ",ALTKEY2=                             ".
032600        05 FILLER                 PICTURE X(7)        VALUE SPACE.
032700     03 FILE-RECORD-INFO          OCCURS  10  TIMES.
032800        05 FILE-RECORD-INFO-P1-120.
032900           07 FILLER              PIC X(5).
033000           07 XFILE-NAME           PIC X(6).
033100           07 FILLER              PIC X(8).
033200           07 XRECORD-NAME         PIC X(6).
033300           07 FILLER              PIC X(1).
033400           07 REELUNIT-NUMBER     PIC 9(1).
033500           07 FILLER              PIC X(7).
033600           07 XRECORD-NUMBER       PIC 9(6).
033700           07 FILLER              PIC X(6).
033800           07 UPDATE-NUMBER       PIC 9(2).
033900           07 FILLER              PIC X(5).
034000           07 ODO-NUMBER          PIC 9(4).
034100           07 FILLER              PIC X(5).
034200           07 XPROGRAM-NAME        PIC X(5).
034300           07 FILLER              PIC X(7).
034400           07 XRECORD-LENGTH       PIC 9(6).
034500           07 FILLER              PIC X(7).
034600           07 CHARS-OR-RECORDS    PIC X(2).
034700           07 FILLER              PIC X(1).
034800           07 XBLOCK-SIZE          PIC 9(4).
034900           07 FILLER              PIC X(6).
035000           07 RECORDS-IN-FILE     PIC 9(6).
035100           07 FILLER              PIC X(5).
035200           07 XFILE-ORGANIZATION   PIC X(2).
035300           07 FILLER              PIC X(6).
035400           07 XLABEL-TYPE          PIC X(1).
035500        05 FILE-RECORD-INFO-P121-240.
035600           07 FILLER              PIC X(8).
035700           07 XRECORD-KEY          PIC X(29).
035800           07 FILLER              PIC X(9).
035900           07 ALTERNATE-KEY1      PIC X(29).
036000           07 FILLER              PIC X(9).
036100           07 ALTERNATE-KEY2      PIC X(29).
036200           07 FILLER              PIC X(7).
036300 01  TEST-RESULTS.
036400     02 FILLER                   PIC X      VALUE SPACE.
036500     02 FEATURE                  PIC X(20)  VALUE SPACE.
036600     02 FILLER                   PIC X      VALUE SPACE.
036700     02 P-OR-F                   PIC X(5)   VALUE SPACE.
036800     02 FILLER                   PIC X      VALUE SPACE.
036900     02  PAR-NAME.
037000       03 FILLER                 PIC X(19)  VALUE SPACE.
037100       03  PARDOT-X              PIC X      VALUE SPACE.
037200       03 DOTVALUE               PIC 99     VALUE ZERO.
037300     02 FILLER                   PIC X(8)   VALUE SPACE.
037400     02 RE-MARK                  PIC X(61).
037500 01  TEST-COMPUTED.
037600     02 FILLER                   PIC X(30)  VALUE SPACE.
037700     02 FILLER                   PIC X(17)  VALUE
037800            "       COMPUTED=".
037900     02 COMPUTED-X.
038000     03 COMPUTED-A               PIC X(20)  VALUE SPACE.
038100     03 COMPUTED-N               REDEFINES COMPUTED-A
038200                                 PIC -9(9).9(9).
038300     03 COMPUTED-0V18 REDEFINES COMPUTED-A   PIC -.9(18).
038400     03 COMPUTED-4V14 REDEFINES COMPUTED-A   PIC -9(4).9(14).
038500     03 COMPUTED-14V4 REDEFINES COMPUTED-A   PIC -9(14).9(4).
038600     03       CM-18V0 REDEFINES COMPUTED-A.
038700         04 COMPUTED-18V0                    PIC -9(18).
038800         04 FILLER                           PIC X.
038900     03 FILLER PIC X(50) VALUE SPACE.
039000 01  TEST-CORRECT.
039100     02 FILLER PIC X(30) VALUE SPACE.
039200     02 FILLER PIC X(17) VALUE "       CORRECT =".
039300     02 CORRECT-X.
039400     03 CORRECT-A                  PIC X(20) VALUE SPACE.
039500     03 CORRECT-N    REDEFINES CORRECT-A     PIC -9(9).9(9).
039600     03 CORRECT-0V18 REDEFINES CORRECT-A     PIC -.9(18).
039700     03 CORRECT-4V14 REDEFINES CORRECT-A     PIC -9(4).9(14).
039800     03 CORRECT-14V4 REDEFINES CORRECT-A     PIC -9(14).9(4).
039900     03      CR-18V0 REDEFINES CORRECT-A.
040000         04 CORRECT-18V0                     PIC -9(18).
040100         04 FILLER                           PIC X.
040200     03 FILLER PIC X(2) VALUE SPACE.
040300     03 COR-ANSI-REFERENCE             PIC X(48) VALUE SPACE.
040400 01  CCVS-C-1.
040500     02 FILLER  PIC IS X(99)    VALUE IS " FEATURE              PA
040600-    "SS  PARAGRAPH-NAME
040700-    "       REMARKS".
040800     02 FILLER                     PIC X(20)    VALUE SPACE.
040900 01  CCVS-C-2.
041000     02 FILLER                     PIC X        VALUE SPACE.
041100     02 FILLER                     PIC X(6)     VALUE "TESTED".
041200     02 FILLER                     PIC X(15)    VALUE SPACE.
041300     02 FILLER                     PIC X(4)     VALUE "FAIL".
041400     02 FILLER                     PIC X(94)    VALUE SPACE.
041500 01  REC-SKL-SUB                   PIC 9(2)     VALUE ZERO.
041600 01  REC-CT                        PIC 99       VALUE ZERO.
041700 01  DELETE-COUNTER                PIC 999      VALUE ZERO.
041800 01  ERROR-COUNTER                 PIC 999      VALUE ZERO.
041900 01  INSPECT-COUNTER               PIC 999      VALUE ZERO.
042000 01  PASS-COUNTER                  PIC 999      VALUE ZERO.
042100 01  TOTAL-ERROR                   PIC 999      VALUE ZERO.
042200 01  ERROR-HOLD                    PIC 999      VALUE ZERO.
042300 01  DUMMY-HOLD                    PIC X(120)   VALUE SPACE.
042400 01  RECORD-COUNT                  PIC 9(5)     VALUE ZERO.
042500 01  ANSI-REFERENCE                PIC X(48)    VALUE SPACES.
042600 01  CCVS-H-1.
042700     02  FILLER                    PIC X(39)    VALUE SPACES.
042800     02  FILLER                    PIC X(42)    VALUE
042900     "OFFICIAL COBOL COMPILER VALIDATION SYSTEM".
043000     02  FILLER                    PIC X(39)    VALUE SPACES.
043100 01  CCVS-H-2A.
043200   02  FILLER                        PIC X(40)  VALUE SPACE.
043300   02  FILLER                        PIC X(7)   VALUE "CCVS85 ".
043400   02  FILLER                        PIC XXXX   VALUE
043500     "4.2 ".
043600   02  FILLER                        PIC X(28)  VALUE
043700            " COPY - NOT FOR DISTRIBUTION".
043800   02  FILLER                        PIC X(41)  VALUE SPACE.
043900
044000 01  CCVS-H-2B.
044100   02  FILLER                        PIC X(15)  VALUE
044200            "TEST RESULT OF ".
044300   02  TEST-ID                       PIC X(9).
044400   02  FILLER                        PIC X(4)   VALUE
044500            " IN ".
044600   02  FILLER                        PIC X(12)  VALUE
044700     " HIGH       ".
044800   02  FILLER                        PIC X(22)  VALUE
044900            " LEVEL VALIDATION FOR ".
045000   02  FILLER                        PIC X(58)  VALUE
045100     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
045200 01  CCVS-H-3.
045300     02  FILLER                      PIC X(34)  VALUE
045400            " FOR OFFICIAL USE ONLY    ".
045500     02  FILLER                      PIC X(58)  VALUE
045600     "COBOL 85 VERSION 4.2, Apr  1993 SSVG                      ".
045700     02  FILLER                      PIC X(28)  VALUE
045800            "  COPYRIGHT   1985 ".
045900 01  CCVS-E-1.
046000     02 FILLER                       PIC X(52)  VALUE SPACE.
046100     02 FILLER  PIC X(14) VALUE IS "END OF TEST-  ".
046200     02 ID-AGAIN                     PIC X(9).
046300     02 FILLER                       PIC X(45)  VALUE SPACES.
046400 01  CCVS-E-2.
046500     02  FILLER                      PIC X(31)  VALUE SPACE.
046600     02  FILLER                      PIC X(21)  VALUE SPACE.
046700     02 CCVS-E-2-2.
046800         03 ERROR-TOTAL              PIC XXX    VALUE SPACE.
046900         03 FILLER                   PIC X      VALUE SPACE.
047000         03 ENDER-DESC               PIC X(44)  VALUE
047100            "ERRORS ENCOUNTERED".
047200 01  CCVS-E-3.
047300     02  FILLER                      PIC X(22)  VALUE
047400            " FOR OFFICIAL USE ONLY".
047500     02  FILLER                      PIC X(12)  VALUE SPACE.
047600     02  FILLER                      PIC X(58)  VALUE
047700     "ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.     ".
047800     02  FILLER                      PIC X(13)  VALUE SPACE.
047900     02 FILLER                       PIC X(15)  VALUE
048000             " COPYRIGHT 1985".
048100 01  CCVS-E-4.
048200     02 CCVS-E-4-1                   PIC XXX    VALUE SPACE.
048300     02 FILLER                       PIC X(4)   VALUE " OF ".
048400     02 CCVS-E-4-2                   PIC XXX    VALUE SPACE.
048500     02 FILLER                       PIC X(40)  VALUE
048600      "  TESTS WERE EXECUTED SUCCESSFULLY".
048700 01  XXINFO.
048800     02 FILLER                       PIC X(19)  VALUE
048900            "*** INFORMATION ***".
049000     02 INFO-TEXT.
049100       04 FILLER                     PIC X(8)   VALUE SPACE.
049200       04 XXCOMPUTED                 PIC X(20).
049300       04 FILLER                     PIC X(5)   VALUE SPACE.
049400       04 XXCORRECT                  PIC X(20).
049500     02 INF-ANSI-REFERENCE           PIC X(48).
049600 01  HYPHEN-LINE.
049700     02 FILLER  PIC IS X VALUE IS SPACE.
049800     02 FILLER  PIC IS X(65)    VALUE IS "************************
049900-    "*****************************************".
050000     02 FILLER  PIC IS X(54)    VALUE IS "************************
050100-    "******************************".
050200 01  CCVS-PGM-ID                     PIC X(9)   VALUE
050300     "ST147A".
050400 PROCEDURE DIVISION.
050500 DECLARATIVES.
050600 SECT-ST209-DEC SECTION.
050700     USE AFTER STANDARD ERROR PROCEDURE ON OUTPUT.
050800 MRG-WRITE-DEC.
050900     MOVE "ERROR ON OUTPUT DECL." TO FEATURE.
051000     MOVE "MRG-TEST-DEC" TO PAR-NAME.
051100     WRITE   PRINT-REC FROM TEST-RESULTS AFTER ADVANCING 2 LINES.
051200     STOP RUN.
051300 END DECLARATIVES.
051400 CCVS1 SECTION.
051500 OPEN-FILES.
051600     OPEN    OUTPUT PRINT-FILE.
051700     MOVE  CCVS-PGM-ID TO TEST-ID. MOVE CCVS-PGM-ID TO ID-AGAIN.
051800     MOVE    SPACE TO TEST-RESULTS.
051900     PERFORM HEAD-ROUTINE THRU COLUMN-NAMES-ROUTINE.
052000     MOVE    ZERO TO REC-SKL-SUB.
052100     PERFORM CCVS-INIT-FILE 9 TIMES.
052200 CCVS-INIT-FILE.
052300     ADD     1 TO REC-SKL-SUB.
052400     MOVE    FILE-RECORD-INFO-SKELETON
052500          TO FILE-RECORD-INFO (REC-SKL-SUB).
052600 CCVS-INIT-EXIT.
052700     GO TO CCVS1-EXIT.
052800 CLOSE-FILES.
052900     PERFORM END-ROUTINE THRU END-ROUTINE-13. CLOSE PRINT-FILE.
053000 TERMINATE-CCVS.
053100     STOP     RUN.
053200 INSPT. MOVE "INSPT" TO P-OR-F. ADD 1 TO INSPECT-COUNTER.
053300 PASS.  MOVE "PASS " TO P-OR-F.  ADD 1 TO PASS-COUNTER.
053400 FAIL.  MOVE "FAIL*" TO P-OR-F.  ADD 1 TO ERROR-COUNTER.
053500 DE-LETE.  MOVE "*****" TO P-OR-F.  ADD 1 TO DELETE-COUNTER.
053600     MOVE "****TEST DELETED****" TO RE-MARK.
053700 PRINT-DETAIL.
053800     IF REC-CT NOT EQUAL TO ZERO
053900             MOVE "." TO PARDOT-X
054000             MOVE REC-CT TO DOTVALUE.
054100     MOVE     TEST-RESULTS TO PRINT-REC. PERFORM WRITE-LINE.
054200     IF P-OR-F EQUAL TO "FAIL*"  PERFORM WRITE-LINE
054300        PERFORM FAIL-ROUTINE THRU FAIL-ROUTINE-EX
054400          ELSE PERFORM BAIL-OUT THRU BAIL-OUT-EX.
054500     MOVE SPACE TO P-OR-F. MOVE SPACE TO COMPUTED-X.
054600     MOVE SPACE TO CORRECT-X.
054700     IF     REC-CT EQUAL TO ZERO  MOVE SPACE TO PAR-NAME.
054800     MOVE     SPACE TO RE-MARK.
054900 HEAD-ROUTINE.
055000     MOVE CCVS-H-1  TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055100     MOVE CCVS-H-2A TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055200     MOVE CCVS-H-2B TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
055300     MOVE CCVS-H-3  TO DUMMY-RECORD. PERFORM WRITE-LINE 3 TIMES.
055400 COLUMN-NAMES-ROUTINE.
055500     MOVE CCVS-C-1 TO DUMMY-RECORD. PERFORM WRITE-LINE.
055600     MOVE CCVS-C-2 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
055700     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE.
055800 END-ROUTINE.
055900     MOVE HYPHEN-LINE TO DUMMY-RECORD. PERFORM WRITE-LINE 5 TIMES.
056000 END-RTN-EXIT.
056100     MOVE CCVS-E-1 TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
056200 END-ROUTINE-1.
056300      ADD ERROR-COUNTER TO ERROR-HOLD ADD INSPECT-COUNTER TO
056400      ERROR-HOLD. ADD DELETE-COUNTER TO ERROR-HOLD.
056500      ADD PASS-COUNTER TO ERROR-HOLD.
056600*     IF PASS-COUNTER EQUAL TO ERROR-HOLD GO TO END-ROUTINE-12.
056700      MOVE PASS-COUNTER TO CCVS-E-4-1.
056800      MOVE ERROR-HOLD TO CCVS-E-4-2.
056900      MOVE CCVS-E-4 TO CCVS-E-2-2.
057000      MOVE CCVS-E-2 TO DUMMY-RECORD PERFORM WRITE-LINE.
057100  END-ROUTINE-12.
057200      MOVE "TEST(S) FAILED" TO ENDER-DESC.
057300     IF       ERROR-COUNTER IS EQUAL TO ZERO
057400         MOVE "NO " TO ERROR-TOTAL
057500         ELSE
057600         MOVE ERROR-COUNTER TO ERROR-TOTAL.
057700     MOVE     CCVS-E-2 TO DUMMY-RECORD.
057800     PERFORM WRITE-LINE.
057900 END-ROUTINE-13.
058000     IF DELETE-COUNTER IS EQUAL TO ZERO
058100         MOVE "NO " TO ERROR-TOTAL  ELSE
058200         MOVE DELETE-COUNTER TO ERROR-TOTAL.
058300     MOVE "TEST(S) DELETED     " TO ENDER-DESC.
058400     MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
058500      IF   INSPECT-COUNTER EQUAL TO ZERO
058600          MOVE "NO " TO ERROR-TOTAL
058700      ELSE MOVE INSPECT-COUNTER TO ERROR-TOTAL.
058800      MOVE "TEST(S) REQUIRE INSPECTION" TO ENDER-DESC.
058900      MOVE CCVS-E-2 TO DUMMY-RECORD. PERFORM WRITE-LINE.
059000     MOVE CCVS-E-3 TO DUMMY-RECORD. PERFORM WRITE-LINE.
059100 WRITE-LINE.
059200     ADD 1 TO RECORD-COUNT.
059300Y    IF RECORD-COUNT GREATER 42
059400Y        MOVE DUMMY-RECORD TO DUMMY-HOLD
059500Y        MOVE SPACE TO DUMMY-RECORD
059600Y        WRITE DUMMY-RECORD AFTER ADVANCING PAGE
059700Y        MOVE CCVS-H-1  TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
059800Y        MOVE CCVS-H-2A TO DUMMY-RECORD PERFORM WRT-LN 2 TIMES
059900Y        MOVE CCVS-H-2B TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
060000Y        MOVE CCVS-H-3  TO DUMMY-RECORD PERFORM WRT-LN 3 TIMES
060100Y        MOVE CCVS-C-1  TO DUMMY-RECORD PERFORM WRT-LN
060200Y        MOVE CCVS-C-2  TO DUMMY-RECORD PERFORM WRT-LN
060300Y        MOVE HYPHEN-LINE TO DUMMY-RECORD PERFORM WRT-LN
060400Y        MOVE DUMMY-HOLD TO DUMMY-RECORD
060500Y        MOVE ZERO TO RECORD-COUNT.
060600     PERFORM WRT-LN.
060700 WRT-LN.
060800     WRITE    DUMMY-RECORD AFTER ADVANCING 1 LINES.
060900     MOVE SPACE TO DUMMY-RECORD.
061000 BLANK-LINE-PRINT.
061100     PERFORM WRT-LN.
061200 FAIL-ROUTINE.
061300     IF     COMPUTED-X NOT EQUAL TO SPACE
061400            GO TO   FAIL-ROUTINE-WRITE.
061500     IF     CORRECT-X NOT EQUAL TO SPACE GO TO FAIL-ROUTINE-WRITE.
061600     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
061700     MOVE  "NO FURTHER INFORMATION, SEE PROGRAM." TO INFO-TEXT.
061800     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
061900     MOVE   SPACES TO INF-ANSI-REFERENCE.
062000     GO TO  FAIL-ROUTINE-EX.
062100 FAIL-ROUTINE-WRITE.
062200     MOVE   TEST-COMPUTED TO PRINT-REC PERFORM WRITE-LINE
062300     MOVE   ANSI-REFERENCE TO COR-ANSI-REFERENCE.
062400     MOVE   TEST-CORRECT TO PRINT-REC PERFORM WRITE-LINE 2 TIMES.
062500     MOVE   SPACES TO COR-ANSI-REFERENCE.
062600 FAIL-ROUTINE-EX. EXIT.
062700 BAIL-OUT.
062800     IF     COMPUTED-A NOT EQUAL TO SPACE GO TO BAIL-OUT-WRITE.
062900     IF     CORRECT-A EQUAL TO SPACE GO TO BAIL-OUT-EX.
063000 BAIL-OUT-WRITE.
063100     MOVE CORRECT-A TO XXCORRECT. MOVE COMPUTED-A TO XXCOMPUTED.
063200     MOVE   ANSI-REFERENCE TO INF-ANSI-REFERENCE.
063300     MOVE   XXINFO TO DUMMY-RECORD. PERFORM WRITE-LINE 2 TIMES.
063400     MOVE   SPACES TO INF-ANSI-REFERENCE.
063500 BAIL-OUT-EX. EXIT.
063600 CCVS1-EXIT.
063700     EXIT.
063800 SECT-ST417-001 SECTION.
063900 MRG-INIT-001.
064000     MOVE "CREATE FILE SQ-FS1" TO FEATURE.
064100     OPEN OUTPUT SQ-FS1.
064200     MOVE "SQ-FS1" TO XFILE-NAME (1).
064300     MOVE "R1-F-G" TO XRECORD-NAME (1).
064400     MOVE CCVS-PGM-ID TO XPROGRAM-NAME (1).
064500     MOVE 000132 TO XRECORD-LENGTH (1).
064600     MOVE "RC" TO CHARS-OR-RECORDS (1).
064700     MOVE 0001 TO XBLOCK-SIZE (1).
064800     MOVE 000051 TO RECORDS-IN-FILE (1).
064900     MOVE "SQ" TO XFILE-ORGANIZATION (1).
065000     MOVE "S" TO XLABEL-TYPE (1).
065100     MOVE 000001 TO XRECORD-NUMBER (1).
065200             MOVE SPACES TO WRK-XN-O120F-1.
065300 MRG-TEST-001.
065400     PERFORM MRG-TEST-001-BUILD VARYING WRK-DU-999-0001
065500         FROM 51 BY -1 UNTIL WRK-DU-999-0001 IS LESS THAN 1.
065600X    MOVE    SPACES TO PRINT-REC.
065700X    WRITE   PRINT-REC.
065800     IF XRECORD-NUMBER (1) IS NOT EQUAL TO 000052
065900         PERFORM FAIL MOVE "INCORR. NO. OF RECS." TO RE-MARK
066000         ELSE
066100         PERFORM PASS.
066200     GO TO MRG-WRITE-001.
066300 MRG-TEST-001-BUILD.
066400     MOVE CHAR (WRK-DU-999-0001) TO ALPHAN-KEY OF KEY-1
066500         ALPHAN-KEY OF KEY-2 ALPHAN-KEY OF KEY-3.
066600     MOVE WRK-DU-999-0001 TO NUM-KEY OF KEY-1 NUM-KEY OF KEY-2
066700         NUM-KEY OF KEY-3.
066800     MOVE FILE-RECORD-INFO-P1-120 (1) TO REC-PREAMBLE.
066900     ADD 1 TO XRECORD-NUMBER (1).
067000     MOVE ASCIIS (WRK-DU-999-0001) TO COLLS (WRK-DU-999-2).
067100     ADD 1 TO WRK-DU-999-2.
067200     MOVE ASCIIS (WRK-DU-999-0001) TO COLLS (WRK-DU-999-2).
067300     ADD 1 TO WRK-DU-999-2.
067400X    WRITE PRINT-REC FROM SQ-FS1R1-F-G-132.
067500X    WRITE PRINT-REC FROM REST-OF-1.
067600X    MOVE SPACES TO PRINT-REC.
067700     WRITE   SQ-FS1R1-F-G-132.
067800 MRG-DELETE-001.
067900     PERFORM DE-LETE.
068000 MRG-WRITE-001.
068100     MOVE "MRG-TEST-001" TO PAR-NAME.
068200     MOVE "FIRST FILE CREATED" TO COMPUTED-A.
068300     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
068400     PERFORM PRINT-DETAIL.
068500X    MOVE    SPACES TO PRINT-REC.
068600X    WRITE   PRINT-REC.
068700     CLOSE SQ-FS1.
068800 MRG-INIT-002.
068900     MOVE "CREATE FILE SQ-FS2" TO FEATURE.
069000     OPEN OUTPUT SQ-FS2.
069100     MOVE  "SQ-FS2" TO XFILE-NAME (1).
069200     MOVE 000001 TO XRECORD-NUMBER (1).
069300     MOVE 0002 TO XBLOCK-SIZE (1).
069400 MRG-TEST-002.
069500     PERFORM MRG-TEST-002-BUILD VARYING WRK-DU-999-0001
069600         FROM 51 BY -1 UNTIL WRK-DU-999-0001 IS LESS THAN 1.
069700X    MOVE    SPACES TO PRINT-REC.
069800X    WRITE   PRINT-REC.
069900     IF XRECORD-NUMBER (1) IS NOT EQUAL TO 52
070000         PERFORM FAIL MOVE "INCORR. NO. OF RECS." TO RE-MARK
070100         ELSE
070200         PERFORM PASS.
070300     GO TO MRG-WRITE-002.
070400 MRG-TEST-002-BUILD.
070500     MOVE CHAR (WRK-DU-999-0001) TO ALPHAN-KEY OF KEY-4
070600         ALPHAN-KEY OF KEY-5 ALPHAN-KEY OF KEY-6.
070700     ADD 51 WRK-DU-999-0001 GIVING NUM-KEY OF KEY-4
070800         NUM-KEY OF KEY-5 NUM-KEY OF KEY-6.
070900     MOVE FILE-RECORD-INFO-P1-120 (1) TO REC-PRE-2.
071000     ADD 000001 TO XRECORD-NUMBER (1).
071100X    WRITE PRINT-REC FROM SQ-FS2R1-F-G-132.
071200X    WRITE PRINT-REC FROM REST-OF-2.
071300X    MOVE SPACES TO PRINT-REC.
071400     WRITE   SQ-FS2R1-F-G-132.
071500 MRG-DELETE-002.
071600     PERFORM DE-LETE.
071700 MRG-WRITE-002.
071800     MOVE "MRG-TEST-002" TO PAR-NAME.
071900     MOVE "2ND FILE CREATED" TO COMPUTED-A.
072000     MOVE XRECORD-NUMBER (1) TO CORRECT-18V0.
072100     PERFORM PRINT-DETAIL.
072200X    MOVE    SPACES TO PRINT-REC.
072300X    WRITE   PRINT-REC.
072400     CLOSE SQ-FS2.
072500 MRG-INIT-003.
072600*    ==-->  MULTIPLE "GIVING" FILES  <--==
072700     MOVE   "XI-11 4.1.4 GR (11)" TO ANSI-REFERENCE.
072800     MOVE SPACES TO WRK-XN-X-0001.
072900     MERGE ST-FS1
073000         DESCENDING A-KEY OF SORT-KEY
073100         ON DESCENDING KEY N-KEY OF NON-KEY-1
073200         USING  SQ-FS2 SQ-FS1
073300         GIVING SQ-FS3 SQ-FS4 SQ-FS5.
073400 MRG-TEST-003.
073500     OPEN INPUT SQ-FS3.
073600     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
073700         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
073800X    MOVE    SPACES TO PRINT-REC.
073900X    WRITE   PRINT-REC.
074000     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0002
074100         PERFORM FAIL GO TO MRG-FAIL-003
074200         ELSE
074300         PERFORM PASS.
074400     GO TO MRG-WRITE-003.
074500 MRG-DELETE-003.
074600     PERFORM DE-LETE.
074700     GO TO MRG-WRITE-003.
074800 MRG-FAIL-003.
074900     MOVE WRK-XN-X-0001 TO COMPUTED-A.
075000     MOVE WRK-XN-0002 TO CORRECT-A.
075100 MRG-WRITE-003.
075200     MOVE "MRG-TEST-003" TO PAR-NAME.
075300     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
075400     PERFORM PRINT-DETAIL.
075500X    MOVE    SPACES TO PRINT-REC.
075600X    WRITE   PRINT-REC.
075700 MRG-INIT-004.
075800     MOVE SPACES TO WRK-XN-X-0001.
075900 MRG-TEST-004.
076000     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
076100         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
076200X    MOVE    SPACES TO PRINT-REC.
076300X    WRITE   PRINT-REC.
076400     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0003
076500         PERFORM FAIL GO TO MRG-FAIL-004
076600         ELSE
076700         PERFORM PASS.
076800     GO TO MRG-WRITE-004.
076900 MRG-DELETE-004.
077000     PERFORM DE-LETE.
077100     GO TO MRG-WRITE-004.
077200 MRG-FAIL-004.
077300     MOVE WRK-XN-X-0001 TO COMPUTED-A.
077400     MOVE WRK-XN-0003 TO CORRECT-A.
077500 MRG-WRITE-004.
077600     MOVE "MRG-TEST-004" TO PAR-NAME.
077700     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
077800     PERFORM PRINT-DETAIL.
077900X    MOVE    SPACES TO PRINT-REC.
078000X    WRITE   PRINT-REC.
078100 MRG-INIT-005.
078200     MOVE SPACES TO WRK-XN-X-0001.
078300 MRG-TEST-005.
078400     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
078500         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
078600X    MOVE    SPACES TO PRINT-REC.
078700X    WRITE   PRINT-REC.
078800     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0004
078900         PERFORM FAIL GO TO MRG-FAIL-005
079000         ELSE
079100         PERFORM PASS.
079200     GO TO MRG-WRITE-005.
079300 MRG-DELETE-005.
079400     PERFORM DE-LETE.
079500     GO TO MRG-WRITE-005.
079600 MRG-FAIL-005.
079700     MOVE WRK-XN-X-0001 TO COMPUTED-A.
079800     MOVE WRK-XN-0004 TO CORRECT-A.
079900 MRG-WRITE-005.
080000     MOVE "MRG-TEST-005" TO PAR-NAME.
080100     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
080200     PERFORM PRINT-DETAIL.
080300X    MOVE    SPACES TO PRINT-REC.
080400X    WRITE   PRINT-REC.
080500 MRG-INIT-006.
080600     MOVE SPACES TO WRK-XN-X-0001.
080700 MRG-TEST-006.
080800     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
080900         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
081000X    MOVE    SPACES TO PRINT-REC.
081100X    WRITE   PRINT-REC.
081200     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0005
081300         PERFORM FAIL GO TO MRG-FAIL-006
081400         ELSE
081500         PERFORM PASS.
081600     GO TO MRG-WRITE-006.
081700 MRG-DELETE-006.
081800     PERFORM DE-LETE.
081900     GO TO MRG-WRITE-006.
082000 MRG-FAIL-006.
082100     MOVE WRK-XN-X-0001 TO COMPUTED-A.
082200     MOVE WRK-XN-0005 TO CORRECT-A.
082300 MRG-WRITE-006.
082400     MOVE "MRG-TEST-006" TO PAR-NAME.
082500     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
082600     PERFORM PRINT-DETAIL.
082700X    MOVE    SPACES TO PRINT-REC.
082800X    WRITE   PRINT-REC.
082900 MRG-INIT-007.
083000     MOVE SPACES TO WRK-XN-X-0001.
083100 MRG-TEST-007.
083200     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
083300         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
083400X    MOVE    SPACES TO PRINT-REC.
083500X    WRITE   PRINT-REC.
083600     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0006
083700         PERFORM FAIL GO TO MRG-FAIL-007
083800         ELSE
083900         PERFORM PASS.
084000     GO TO MRG-WRITE-007.
084100 MRG-DELETE-007.
084200     PERFORM DE-LETE.
084300     GO TO MRG-WRITE-007.
084400 MRG-FAIL-007.
084500     MOVE WRK-XN-X-0001 TO COMPUTED-A.
084600     MOVE WRK-XN-0006 TO CORRECT-A.
084700 MRG-WRITE-007.
084800     MOVE "MRG-TEST-007" TO PAR-NAME.
084900     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
085000     PERFORM PRINT-DETAIL.
085100X    MOVE    SPACES TO PRINT-REC.
085200X    WRITE   PRINT-REC.
085300 MRG-INIT-008.
085400     MOVE SPACES TO WRK-XN-X-0001.
085500 MRG-TEST-008.
085600     PERFORM RD-1 THRU R1-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
085700         UNTIL WRK-DU-999-0001 IS GREATER THAN 2.
085800X    MOVE    SPACES TO PRINT-REC.
085900X    WRITE   PRINT-REC.
086000     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0007
086100         PERFORM FAIL GO TO MRG-FAIL-008
086200         ELSE
086300         PERFORM PASS.
086400     GO TO MRG-WRITE-008.
086500 MRG-DELETE-008.
086600     PERFORM DE-LETE.
086700     GO TO MRG-WRITE-008.
086800 MRG-FAIL-008.
086900     MOVE WRK-XN-X-0001 TO COMPUTED-A.
087000     MOVE WRK-XN-0007 TO CORRECT-A.
087100 MRG-WRITE-008.
087200     MOVE "MRG-TEST-008" TO PAR-NAME.
087300     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
087400     PERFORM PRINT-DETAIL.
087500     MOVE    NUM-KEY OF KEY-7 TO LAST-REC-NUM.
087600 MRG-TEST-009.
087700     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
087800         GO TO MRG-FAIL-009.
087900     READ SQ-FS3 END PERFORM PASS
088000         GO TO MRG-WRITE-009.
088100     GO TO MRG-FAIL-009.
088200 MRG-DELETE-009.
088300     PERFORM DE-LETE.
088400     GO TO MRG-WRITE-009.
088500 MRG-FAIL-009.
088600     MOVE "EOF NOT FOUND" TO RE-MARK.
088700     PERFORM FAIL .
088800 MRG-WRITE-009.
088900     MOVE "MRG-TEST-009" TO PAR-NAME.
089000     MOVE "EOF CHECK SQ-FS3" TO FEATURE.
089100     PERFORM PRINT-DETAIL.
089200 MRG-TEST-010.
089300     IF LAST-REC-NUM IS NOT EQUAL TO 1
089400         PERFORM FAIL GO TO MRG-FAIL-010
089500         ELSE
089600         PERFORM PASS.
089700     GO TO MRG-WRITE-010.
089800 MRG-DELETE-010.
089900     PERFORM DE-LETE.
090000     GO TO MRG-WRITE-010.
090100 MRG-FAIL-010.
090200     MOVE LAST-REC-NUM TO COMPUTED-18V0.
090300     MOVE 1 TO CR-18V0.
090400 MRG-WRITE-010.
090500     MOVE "NUMER. SEQ. CHECK" TO FEATURE.
090600     MOVE "MRG-TEST-010" TO PAR-NAME.
090700     PERFORM PRINT-DETAIL.
090800     CLOSE   SQ-FS3.
090900     GO TO   MRG-TEST-011.
091000 READ-SQ-FS3 SECTION.
091100 RD-1.
091200     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
091300         GO TO R1-EXIT.
091400     READ SQ-FS3 AT END GO TO PREMATURE-EOF-1.
091500X    WRITE PRINT-REC FROM SQ-FS3R1-F-G-132.
091600X    WRITE PRINT-REC FROM REST-OF-3.
091700X    MOVE SPACES TO PRINT-REC.
091800     MOVE ALPHAN-KEY OF KEY-8 TO COMPU (WRK-DU-999-0001).
091900     GO TO R1-EXIT.
092000 PREMATURE-EOF-1.
092100     MOVE 1 TO WRK-DU-9-0001.
092200     MOVE "PREMATURE EOF FOUND" TO RE-MARK.
092300 R1-EXIT.
092400     EXIT.
092500*
092600*
092700 MRG-TEST-011.
092800     OPEN INPUT SQ-FS4.
092900     PERFORM RD-2 THRU R2-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
093000         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
093100X    MOVE    SPACES TO PRINT-REC.
093200X    WRITE   PRINT-REC.
093300     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0002
093400         PERFORM FAIL GO TO MRG-FAIL-011
093500         ELSE
093600         PERFORM PASS.
093700     GO TO MRG-WRITE-011.
093800 MRG-DELETE-011.
093900     PERFORM DE-LETE.
094000     GO TO MRG-WRITE-011.
094100 MRG-FAIL-011.
094200     MOVE WRK-XN-X-0001 TO COMPUTED-A.
094300     MOVE WRK-XN-0002 TO CORRECT-A.
094400 MRG-WRITE-011.
094500     MOVE "MRG-TEST-011" TO PAR-NAME.
094600     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
094700     PERFORM PRINT-DETAIL.
094800X    MOVE    SPACES TO PRINT-REC.
094900X    WRITE   PRINT-REC.
095000 MRG-INIT-012.
095100     MOVE SPACES TO WRK-XN-X-0001.
095200 MRG-TEST-012.
095300     PERFORM RD-2 THRU R2-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
095400         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
095500X    MOVE    SPACES TO PRINT-REC.
095600X    WRITE   PRINT-REC.
095700     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0003
095800         PERFORM FAIL GO TO MRG-FAIL-012
095900         ELSE
096000         PERFORM PASS.
096100     GO TO MRG-WRITE-012.
096200 MRG-DELETE-012.
096300     PERFORM DE-LETE.
096400     GO TO MRG-WRITE-012.
096500 MRG-FAIL-012.
096600     MOVE WRK-XN-X-0001 TO COMPUTED-A.
096700     MOVE WRK-XN-0003 TO CORRECT-A.
096800 MRG-WRITE-012.
096900     MOVE "MRG-TEST-012" TO PAR-NAME.
097000     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
097100     PERFORM PRINT-DETAIL.
097200X    MOVE    SPACES TO PRINT-REC.
097300X    WRITE   PRINT-REC.
097400 MRG-INIT-013.
097500     MOVE SPACES TO WRK-XN-X-0001.
097600 MRG-TEST-013.
097700     PERFORM RD-2 THRU R2-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
097800         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
097900X    MOVE    SPACES TO PRINT-REC.
098000X    WRITE   PRINT-REC.
098100     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0004
098200         PERFORM FAIL GO TO MRG-FAIL-013
098300         ELSE
098400         PERFORM PASS.
098500     GO TO MRG-WRITE-013.
098600 MRG-DELETE-013.
098700     PERFORM DE-LETE.
098800     GO TO MRG-WRITE-013.
098900 MRG-FAIL-013.
099000     MOVE WRK-XN-X-0001 TO COMPUTED-A.
099100     MOVE WRK-XN-0004 TO CORRECT-A.
099200 MRG-WRITE-013.
099300     MOVE "MRG-TEST-013" TO PAR-NAME.
099400     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
099500     PERFORM PRINT-DETAIL.
099600X    MOVE    SPACES TO PRINT-REC.
099700X    WRITE   PRINT-REC.
099800 MRG-INIT-014.
099900     MOVE SPACES TO WRK-XN-X-0001.
100000 MRG-TEST-014.
100100     PERFORM RD-2 THRU R2-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
100200         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
100300X    MOVE    SPACES TO PRINT-REC.
100400X    WRITE   PRINT-REC.
100500     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0005
100600         PERFORM FAIL GO TO MRG-FAIL-014
100700         ELSE
100800         PERFORM PASS.
100900     GO TO MRG-WRITE-014.
101000 MRG-DELETE-014.
101100     PERFORM DE-LETE.
101200     GO TO MRG-WRITE-014.
101300 MRG-FAIL-014.
101400     MOVE WRK-XN-X-0001 TO COMPUTED-A.
101500     MOVE WRK-XN-0005 TO CORRECT-A.
101600 MRG-WRITE-014.
101700     MOVE "MRG-TEST-014" TO PAR-NAME.
101800     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
101900     PERFORM PRINT-DETAIL.
102000X    MOVE    SPACES TO PRINT-REC.
102100X    WRITE   PRINT-REC.
102200 MRG-INIT-015.
102300     MOVE SPACES TO WRK-XN-X-0001.
102400 MRG-TEST-015.
102500     PERFORM RD-2 THRU R2-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
102600         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
102700X    MOVE    SPACES TO PRINT-REC.
102800X    WRITE   PRINT-REC.
102900     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0006
103000         PERFORM FAIL GO TO MRG-FAIL-015
103100         ELSE
103200         PERFORM PASS.
103300     GO TO MRG-WRITE-015.
103400 MRG-DELETE-015.
103500     PERFORM DE-LETE.
103600     GO TO MRG-WRITE-015.
103700 MRG-FAIL-015.
103800     MOVE WRK-XN-X-0001 TO COMPUTED-A.
103900     MOVE WRK-XN-0006 TO CORRECT-A.
104000 MRG-WRITE-015.
104100     MOVE "MRG-TEST-015" TO PAR-NAME.
104200     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
104300     PERFORM PRINT-DETAIL.
104400X    MOVE    SPACES TO PRINT-REC.
104500X    WRITE   PRINT-REC.
104600 MRG-INIT-016.
104700     MOVE SPACES TO WRK-XN-X-0001.
104800 MRG-TEST-016.
104900     PERFORM RD-2 THRU R2-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
105000         UNTIL WRK-DU-999-0001 IS GREATER THAN 2.
105100X    MOVE    SPACES TO PRINT-REC.
105200X    WRITE   PRINT-REC.
105300     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0007
105400         PERFORM FAIL GO TO MRG-FAIL-016
105500         ELSE
105600         PERFORM PASS.
105700     GO TO MRG-WRITE-016.
105800 MRG-DELETE-016.
105900     PERFORM DE-LETE.
106000     GO TO MRG-WRITE-016.
106100 MRG-FAIL-016.
106200     MOVE WRK-XN-X-0001 TO COMPUTED-A.
106300     MOVE WRK-XN-0007 TO CORRECT-A.
106400 MRG-WRITE-016.
106500     MOVE "MRG-TEST-016" TO PAR-NAME.
106600     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
106700     PERFORM PRINT-DETAIL.
106800     MOVE    NUM-KEY OF KEY-10 TO LAST-REC-NUM.
106900 MRG-TEST-017.
107000     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
107100         GO TO MRG-FAIL-017.
107200     READ SQ-FS4 END PERFORM PASS
107300         GO TO MRG-WRITE-017.
107400     GO TO MRG-FAIL-017.
107500 MRG-DELETE-017.
107600     PERFORM DE-LETE.
107700     GO TO MRG-WRITE-017.
107800 MRG-FAIL-017.
107900     MOVE "EOF NOT FOUND" TO RE-MARK.
108000     PERFORM FAIL .
108100 MRG-WRITE-017.
108200     MOVE "MRG-TEST-017" TO PAR-NAME.
108300     MOVE "EOF CHECK SQ-FS4" TO FEATURE.
108400     PERFORM PRINT-DETAIL.
108500 MRG-TEST-018.
108600     IF LAST-REC-NUM IS NOT EQUAL TO 1
108700         PERFORM FAIL GO TO MRG-FAIL-018
108800         ELSE
108900         PERFORM PASS.
109000     GO TO MRG-WRITE-018.
109100 MRG-DELETE-018.
109200     PERFORM DE-LETE.
109300     GO TO MRG-WRITE-018.
109400 MRG-FAIL-018.
109500     MOVE LAST-REC-NUM TO COMPUTED-18V0.
109600     MOVE 1 TO CR-18V0.
109700 MRG-WRITE-018.
109800     MOVE "NUMER. SEQ. CHECK" TO FEATURE.
109900     MOVE "MRG-TEST-018" TO PAR-NAME.
110000     PERFORM PRINT-DETAIL.
110100     CLOSE   SQ-FS4.
110200     GO TO MRG-TEST-019.
110300 READ-SQ-FS4 SECTION.
110400 RD-2.
110500     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
110600         GO TO R2-EXIT.
110700     READ SQ-FS4 AT END GO TO PREMATURE-EOF-2.
110800X    WRITE PRINT-REC FROM SQ-FS4R1-F-G-132.
110900X    WRITE PRINT-REC FROM REST-OF-4.
111000X    MOVE SPACES TO PRINT-REC.
111100     MOVE ALPHAN-KEY OF KEY-11 TO COMPU (WRK-DU-999-0001).
111200     GO TO R2-EXIT.
111300 PREMATURE-EOF-2.
111400     MOVE 1 TO WRK-DU-9-0001.
111500     MOVE "PREMATURE EOF FOUND" TO RE-MARK.
111600 R2-EXIT.
111700     EXIT.
111800*
111900*
112000 MRG-TEST-019.
112100     OPEN INPUT SQ-FS5.
112200     PERFORM RD-3 THRU R3-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
112300         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
112400X    MOVE    SPACES TO PRINT-REC.
112500X    WRITE   PRINT-REC.
112600     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0002
112700         PERFORM FAIL GO TO MRG-FAIL-019
112800         ELSE
112900         PERFORM PASS.
113000     GO TO MRG-WRITE-019.
113100 MRG-DELETE-019.
113200     PERFORM DE-LETE.
113300     GO TO MRG-WRITE-019.
113400 MRG-FAIL-019.
113500     MOVE WRK-XN-X-0001 TO COMPUTED-A.
113600     MOVE WRK-XN-0002 TO CORRECT-A.
113700 MRG-WRITE-019.
113800     MOVE "MRG-TEST-019" TO PAR-NAME.
113900     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
114000     PERFORM PRINT-DETAIL.
114100X    MOVE    SPACES TO PRINT-REC.
114200X    WRITE   PRINT-REC.
114300 MRG-INIT-020.
114400     MOVE SPACES TO WRK-XN-X-0001.
114500 MRG-TEST-020.
114600     PERFORM RD-3 THRU R3-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
114700         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
114800X    MOVE    SPACES TO PRINT-REC.
114900X    WRITE   PRINT-REC.
115000     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0003
115100         PERFORM FAIL GO TO MRG-FAIL-020
115200         ELSE
115300         PERFORM PASS.
115400     GO TO MRG-WRITE-020.
115500 MRG-DELETE-020.
115600     PERFORM DE-LETE.
115700     GO TO MRG-WRITE-020.
115800 MRG-FAIL-020.
115900     MOVE WRK-XN-X-0001 TO COMPUTED-A.
116000     MOVE WRK-XN-0003 TO CORRECT-A.
116100 MRG-WRITE-020.
116200     MOVE "MRG-TEST-020" TO PAR-NAME.
116300     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
116400     PERFORM PRINT-DETAIL.
116500X    MOVE    SPACES TO PRINT-REC.
116600X    WRITE   PRINT-REC.
116700 MRG-INIT-021.
116800     MOVE SPACES TO WRK-XN-X-0001.
116900 MRG-TEST-021.
117000     PERFORM RD-3 THRU R3-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
117100         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
117200X    MOVE    SPACES TO PRINT-REC.
117300X    WRITE   PRINT-REC.
117400     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0004
117500         PERFORM FAIL GO TO MRG-FAIL-021
117600         ELSE
117700         PERFORM PASS.
117800     GO TO MRG-WRITE-021.
117900 MRG-DELETE-021.
118000     PERFORM DE-LETE.
118100     GO TO MRG-WRITE-021.
118200 MRG-FAIL-021.
118300     MOVE WRK-XN-X-0001 TO COMPUTED-A.
118400     MOVE WRK-XN-0004 TO CORRECT-A.
118500 MRG-WRITE-021.
118600     MOVE "MRG-TEST-021" TO PAR-NAME.
118700     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
118800     PERFORM PRINT-DETAIL.
118900X    MOVE    SPACES TO PRINT-REC.
119000X    WRITE   PRINT-REC.
119100 MRG-INIT-022.
119200     MOVE SPACES TO WRK-XN-X-0001.
119300 MRG-TEST-022.
119400     PERFORM RD-3 THRU R3-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
119500         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
119600X    MOVE    SPACES TO PRINT-REC.
119700X    WRITE   PRINT-REC.
119800     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0005
119900         PERFORM FAIL GO TO MRG-FAIL-022
120000         ELSE
120100         PERFORM PASS.
120200     GO TO MRG-WRITE-022.
120300 MRG-DELETE-022.
120400     PERFORM DE-LETE.
120500     GO TO MRG-WRITE-022.
120600 MRG-FAIL-022.
120700     MOVE WRK-XN-X-0001 TO COMPUTED-A.
120800     MOVE WRK-XN-0005 TO CORRECT-A.
120900 MRG-WRITE-022.
121000     MOVE "MRG-TEST-022" TO PAR-NAME.
121100     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
121200     PERFORM PRINT-DETAIL.
121300X    MOVE    SPACES TO PRINT-REC.
121400X    WRITE   PRINT-REC.
121500 MRG-INIT-023.
121600     MOVE SPACES TO WRK-XN-X-0001.
121700 MRG-TEST-023.
121800     PERFORM RD-3 THRU R3-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
121900         UNTIL WRK-DU-999-0001 IS GREATER THAN 20.
122000X    MOVE    SPACES TO PRINT-REC.
122100X    WRITE   PRINT-REC.
122200     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0006
122300         PERFORM FAIL GO TO MRG-FAIL-023
122400         ELSE
122500         PERFORM PASS.
122600     GO TO MRG-WRITE-023.
122700 MRG-DELETE-023.
122800     PERFORM DE-LETE.
122900     GO TO MRG-WRITE-023.
123000 MRG-FAIL-023.
123100     MOVE WRK-XN-X-0001 TO COMPUTED-A.
123200     MOVE WRK-XN-0006 TO CORRECT-A.
123300 MRG-WRITE-023.
123400     MOVE "MRG-TEST-023" TO PAR-NAME.
123500     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
123600     PERFORM PRINT-DETAIL.
123700X    MOVE    SPACES TO PRINT-REC.
123800X    WRITE   PRINT-REC.
123900 MRG-INIT-024.
124000     MOVE SPACES TO WRK-XN-X-0001.
124100 MRG-TEST-024.
124200     PERFORM RD-3 THRU R3-EXIT VARYING WRK-DU-999-0001 FROM 1 BY 1
124300         UNTIL WRK-DU-999-0001 IS GREATER THAN 2.
124400X    MOVE    SPACES TO PRINT-REC.
124500X    WRITE   PRINT-REC.
124600     IF WRK-XN-X-0001 IS NOT EQUAL TO WRK-XN-0007
124700         PERFORM FAIL GO TO MRG-FAIL-024
124800         ELSE
124900         PERFORM PASS.
125000     GO TO MRG-WRITE-024.
125100 MRG-DELETE-024.
125200     PERFORM DE-LETE.
125300     GO TO MRG-WRITE-024.
125400 MRG-FAIL-024.
125500     MOVE WRK-XN-X-0001 TO COMPUTED-A.
125600     MOVE WRK-XN-0007 TO CORRECT-A.
125700 MRG-WRITE-024.
125800     MOVE "MRG-TEST-024" TO PAR-NAME.
125900     MOVE "NATIVE COLL.SEQUENCE " TO FEATURE.
126000     PERFORM PRINT-DETAIL.
126100     MOVE    NUM-KEY OF KEY-13 TO LAST-REC-NUM.
126200 MRG-TEST-025.
126300     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
126400         GO TO MRG-FAIL-025.
126500     READ SQ-FS5 END PERFORM PASS
126600         GO TO MRG-WRITE-025.
126700     GO TO MRG-FAIL-025.
126800 MRG-DELETE-025.
126900     PERFORM DE-LETE.
127000     GO TO MRG-WRITE-025.
127100 MRG-FAIL-025.
127200     MOVE "EOF NOT FOUND" TO RE-MARK.
127300     PERFORM FAIL .
127400 MRG-WRITE-025.
127500     MOVE "MRG-TEST-025" TO PAR-NAME.
127600     MOVE "EOF CHECK SQ-FS5" TO FEATURE.
127700     PERFORM PRINT-DETAIL.
127800 MRG-TEST-026.
127900     IF LAST-REC-NUM IS NOT EQUAL TO 1
128000         PERFORM FAIL GO TO MRG-FAIL-026
128100         ELSE
128200         PERFORM PASS.
128300     GO TO MRG-WRITE-026.
128400 MRG-DELETE-026.
128500     PERFORM DE-LETE.
128600     GO TO MRG-WRITE-026.
128700 MRG-FAIL-026.
128800     MOVE LAST-REC-NUM TO COMPUTED-18V0.
128900     MOVE 1 TO CR-18V0.
129000 MRG-WRITE-026.
129100     MOVE "NUMER. SEQ. CHECK" TO FEATURE.
129200     MOVE "MRG-TEST-026" TO PAR-NAME.
129300     PERFORM PRINT-DETAIL.
129400     CLOSE   SQ-FS5.
129500     GO TO CLOSE-FILES.
129600
129700 READ-SQ-FS5 SECTION.
129800 RD-3.
129900     IF WRK-DU-9-0001 IS NOT EQUAL TO ZERO
130000         GO TO R3-EXIT.
130100     READ SQ-FS5 AT END GO TO PREMATURE-EOF-3.
130200X    WRITE PRINT-REC FROM SQ-FS5R1-F-G-132.
130300X    WRITE PRINT-REC FROM REST-OF-5.
130400X    MOVE SPACES TO PRINT-REC.
130500     MOVE ALPHAN-KEY OF KEY-14 TO COMPU (WRK-DU-999-0001).
130600     GO TO R3-EXIT.
130700 PREMATURE-EOF-3.
130800     MOVE 1 TO WRK-DU-9-0001.
130900     MOVE "PREMATURE EOF FOUND" TO RE-MARK.
131000 R3-EXIT.
131100     EXIT.
131200*
131300 CCVS-EXIT SECTION.
131400 CCVS-999999.
131500     GO TO CLOSE-FILES.
