       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           NC106A01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-CS-02V02                 PICTURE S99V99 COMPUTATIONAL.
       PROCEDURE DIVISION.
       CCVS1 SECTION.
       SUB-TEST-F1-14-1.
           MOVE     99 TO WRK-CS-02V02.
           SUBTRACT -99 FROM WRK-CS-02V02 ON SIZE ERROR
                    DISPLAY "OVERFLOW ERROR DETECTED"
                    GO TO CONTINUE-AND-STOP.
           DISPLAY "OVERFLOW ERROR NOT DETECTED".
       CONTINUE-AND-STOP.
           STOP RUN.
