       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTINT1.
       AUTHOR.        DON HIGGINS.
      * TEST INTEGER TYPES H,F,G,Q AND P,Z
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 HW1     COMP PIC S9(4)   VALUE 1234.
       77 FW1     COMP PIC S9(9)   VALUE 123456789.
       77 GW1     COMP PIC S9(18)  VALUE 123456789012345678.
       77 QW1     COMP PIC S9(39) 
                  VALUE 123456789012345678901234567890123456789.
       77 PD1     COMP-3 PIC S9(31) 
                  VALUE 1234567890123456789012345678901.        
       77 ZD1     PIC S9(31) 
                  VALUE 1234567890123456789012345678901.
       77 HW2     COMP PIC S9(4).  
       77 FW2     COMP PIC S9(9).  
       77 GW2     COMP PIC S9(18). 
       77 QW2     COMP PIC S9(39).
       77 QW3     COMP PIC S9(39).
       77 PD2     COMP-3 PIC S9(31).
       77 ZD2     PIC S9(31).
       77 GOOD    COMP-3 PIC S9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAINLINE.
      * TEST WS VALUES
           IF HW1     = 1234
              PERFORM GOOD ELSE PERFORM BAD.
           IF FW1     = 123456789
              PERFORM GOOD ELSE PERFORM BAD.
           IF GW1     = 123456789012345678
              PERFORM GOOD ELSE PERFORM BAD.
           IF QW1     = 123456789012345678901234567890123456789
              PERFORM GOOD ELSE PERFORM BAD.
           IF PD1     = 1234567890123456789012345678901
              PERFORM GOOD ELSE PERFORM BAD.
           IF ZD1     = 1234567890123456789012345678901
              PERFORM GOOD ELSE PERFORM BAD.
      * TEST HW
           MOVE 0 TO HW2
           ADD  1 TO HW2
           IF HW2     = 1   
              PERFORM GOOD ELSE PERFORM BAD.
           SUBTRACT 2 FROM HW2
           IF HW2     = -1   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -6 BY HW2
           IF HW2     = 6   
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE HW2 BY 3
           IF HW2     = 2   
              PERFORM GOOD ELSE PERFORM BAD.
      * TEST FW
           MOVE 0 TO FW2
           ADD  1 TO FW2
           IF FW2     = 1   
              PERFORM GOOD ELSE PERFORM BAD.
           SUBTRACT 2 FROM FW2
           IF FW2     = -1   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -6 BY FW2
           IF FW2     = 6   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY 1000 BY 100000 GIVING FW2
           IF FW2     = 100000000   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -1000 BY -100000 GIVING FW2
           IF FW2     = 100000000   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -1000 BY 100000 GIVING FW2
           IF FW2     = -100000000   
              PERFORM GOOD ELSE PERFORM BAD.
           MOVE 7 TO FW2
           DIVIDE FW2 BY 3
           IF FW2     = 2   
              PERFORM GOOD ELSE PERFORM BAD.
           MOVE 123456789 TO FW2
           DIVIDE FW2 BY 10000000
           IF FW2     = 12   
              PERFORM GOOD ELSE PERFORM BAD.
      * TEST GW
           MOVE 0 TO GW2
           ADD  1 TO GW2
           IF GW2     = 1   
              PERFORM GOOD ELSE PERFORM BAD.
           SUBTRACT 2 FROM GW2
           IF GW2     = -1   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -6 BY GW2
           IF GW2     = 6   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY 123456789 BY 1000000000 GIVING GW2
           IF GW2     = 123456789000000000
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -123456789 BY 1000000000 GIVING GW2
           IF GW2     = -123456789000000000
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -123456789 BY -1000000000 GIVING GW2
           IF GW2     = 123456789000000000
              PERFORM GOOD ELSE PERFORM BAD.
           MOVE 6 TO GW2
           DIVIDE GW2 BY 3
           IF GW2     = 2            
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 123456789012345678 BY 10000000000 GIVING GW2
           IF GW2     = 12345678
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -123456789012345678 BY 10000000000 GIVING GW2
           IF GW2     = -12345678
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 123456789012345678 BY -10000000000 GIVING GW2
           IF GW2     = -12345678
              PERFORM GOOD ELSE PERFORM BAD.
      * TEST QW
           MOVE 0 TO QW2
           ADD  1 TO QW2
           IF QW2     = 1   
              PERFORM GOOD ELSE PERFORM BAD.
           SUBTRACT 2 FROM QW2
           IF QW2     = -1   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -6 BY QW2
           IF QW2     = 6   
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY 12345678901234567890123456789012345678 
                    BY 10 GIVING QW2
           IF QW2     = 123456789012345678901234567890123456780
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -12345678901234567890123456789012345678 
                    BY 10 GIVING QW2
           IF QW2     = -123456789012345678901234567890123456780
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY 12345678901234567890123456789012345678 
                    BY -10 GIVING QW2
           IF QW2     = -123456789012345678901234567890123456780
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -12345678901234567890123456789012345678 
                    BY -10 GIVING QW2
           IF QW2     = 123456789012345678901234567890123456780
              PERFORM GOOD ELSE PERFORM BAD.
           MOVE 6 TO QW2
           DIVIDE QW2 BY 3
           IF QW2     = 2   
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 123456789012345678901234567890123456789
                  BY 10 GIVING QW2
           IF QW2     =    
                  12345678901234567890123456789012345678
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -123456789012345678901234567890123456789
                  BY 10 GIVING QW2
           IF QW2     =    
                 -12345678901234567890123456789012345678
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 123456789012345678901234567890123456789
                  BY -10 GIVING QW2
           IF QW2     =    
                 -12345678901234567890123456789012345678
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -123456789012345678901234567890123456789
                  BY -10 GIVING QW2
           IF QW2     =    
                 12345678901234567890123456789012345678
              PERFORM GOOD ELSE PERFORM BAD.
           MOVE   123456789012345678901234567890123456789 TO QW1
           DIVIDE QW1 BY 12345678901234567890123456789012345678
              GIVING QW2 REMAINDER QW3
           IF QW2 = 10 AND QW3 = 9
              PERFORM GOOD ELSE PERFORM BAD.
           MOVE   123456789012345678901234567890123456789 TO QW1
           DIVIDE QW1 BY 1234567890123456789012345678901234567
              GIVING QW2 REMAINDER QW3
           IF QW2 = 100 AND QW3 = 89
              PERFORM GOOD ELSE PERFORM BAD.
      * TEST PD
           ADD 1 TO PD1
           IF PD1     = 1234567890123456789012345678902
              PERFORM GOOD ELSE PERFORM BAD.
           SUBTRACT 1 FROM PD1
           IF PD1     = 1234567890123456789012345678901
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY 123456789012345678901234567890 BY 10 GIVING PD1
           IF PD1     = 1234567890123456789012345678900
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -123456789012345678901234567890 BY 10 GIVING PD1
           IF PD1     = -1234567890123456789012345678900
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY 123456789012345678901234567890 BY -10 GIVING PD1
           IF PD1     = -1234567890123456789012345678900
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -123456789012345678901234567890 BY -10 GIVING PD1
           IF PD1     = 1234567890123456789012345678900
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 123456789012345678901234567 BY 10 GIVING PD1
           IF PD1     = 12345678901234567890123456
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -123456789012345678901234567 BY 10 GIVING PD1
           IF PD1     = -12345678901234567890123456
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 123456789012345678901234567 BY -10 GIVING PD1
           IF PD1     = -12345678901234567890123456
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -123456789012345678901234567 BY -10 GIVING PD1
           IF PD1     = 12345678901234567890123456
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 1234567890123456789012345678901 BY 10 GIVING PD1
           IF PD1     = 123456789012345678901234567890
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -1234567890123456789012345678901 BY 10 GIVING PD1
           IF PD1     = -123456789012345678901234567890
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 1234567890123456789012345678901 BY -10 GIVING PD1
           IF PD1     = -123456789012345678901234567890
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -1234567890123456789012345678901 BY -10 GIVING PD1
           IF PD1     = 123456789012345678901234567890
              PERFORM GOOD ELSE PERFORM BAD.
      * TEST ZD
           ADD 1 TO ZD1
           IF ZD1     = 1234567890123456789012345678902
              PERFORM GOOD ELSE PERFORM BAD.
           SUBTRACT 1 FROM ZD1
           IF ZD1     = 1234567890123456789012345678901
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY 123456789012345678901234567890 BY 10 GIVING ZD1
           IF ZD1     = 1234567890123456789012345678900
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -123456789012345678901234567890 BY 10 GIVING ZD1
           IF ZD1     = -1234567890123456789012345678900
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY 123456789012345678901234567890 BY -10 GIVING ZD1
           IF ZD1     = -1234567890123456789012345678900
              PERFORM GOOD ELSE PERFORM BAD.
           MULTIPLY -123456789012345678901234567890 BY -10 GIVING ZD1
           IF ZD1     = 1234567890123456789012345678900
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 12345678901234567890123456 BY 10 GIVING ZD1
           IF ZD1     = 1234567890123456789012345
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -12345678901234567890123456 BY 10 GIVING ZD1
           IF ZD1     = -1234567890123456789012345
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 12345678901234567890123456 BY -10 GIVING ZD1
           IF ZD1     = -1234567890123456789012345
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -12345678901234567890123456 BY -10 GIVING ZD1
           IF ZD1     = 1234567890123456789012345
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 1234567890123456789012345678901 BY 10 GIVING ZD1
           IF ZD1     = 123456789012345678901234567890
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -1234567890123456789012345678901 BY 10 GIVING ZD1
           IF ZD1     = -123456789012345678901234567890
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE 1234567890123456789012345678901 BY -10 GIVING ZD1
           IF ZD1     = -123456789012345678901234567890
              PERFORM GOOD ELSE PERFORM BAD.
           DIVIDE -1234567890123456789012345678901 BY -10 GIVING ZD1
           IF ZD1     = 123456789012345678901234567890
              PERFORM GOOD ELSE PERFORM BAD.
           DISPLAY 'GOOD TESTS = ' GOOD
           STOP RUN.
       GOOD.
           ADD 1 TO GOOD.
       BAD.
           MOVE 16 TO RETURN-CODE 
           STOP RUN.
