       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTMOV3.
       AUTHOR.        DON HIGGINS.
       DATE-WRITTEN.  04/21/12.
      * TEST MOVE WITH SCALING FOR IMPLIED DECIMAL                              
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 EH1 FLOAT-HEX-7       VALUE 1.5.
       77 DH1 FLOAT-HEX-15      VALUE 1.5.
       77 LH1 FLOAT-HEX-30      VALUE 1.5.
       77 EB1 FLOAT-BINARY-7    VALUE 1.5.
       77 DB1 FLOAT-BINARY-16   VALUE 1.5.
       77 LB1 FLOAT-BINARY-34   VALUE 1.5.
       77 ED1 FLOAT-DECIMAL-7   VALUE 1.5.
       77 DD1 FLOAT-DECIMAL-16  VALUE 1.5.
       77 LD1 FLOAT-DECIMAL-34  VALUE 1.5.
       77 H1      COMP PIC S9(3)V9    VALUE 1.5.
       77 F1      COMP PIC S9(8)V9    VALUE 1.5.
       77 G1      COMP PIC S9(17)V9   VALUE 1.5.
       77 Q1      COMP PIC S9(38)V9   VALUE 1.5.
       77 P1      COMP-3 PIC S9(30)V9 VALUE 1.5.
       77 Z1             PIC S9(30)V9 VALUE 1.5.
       77 EH2 FLOAT-HEX-7       VALUE 1.50.
       77 DH2 FLOAT-HEX-15      VALUE 1.50.
       77 LH2 FLOAT-HEX-30      VALUE 1.50.
       77 EB2 FLOAT-BINARY-7    VALUE 1.50.
       77 DB2 FLOAT-BINARY-16   VALUE 1.50.
       77 LB2 FLOAT-BINARY-34   VALUE 1.50.
       77 ED2 FLOAT-DECIMAL-7   VALUE 1.50.
       77 DD2 FLOAT-DECIMAL-16  VALUE 1.50.
       77 LD2 FLOAT-DECIMAL-34  VALUE 1.50.
       77 H2      COMP PIC S9(2)V99         VALUE 1.50.
       77 F2      COMP PIC S9(6)V999        VALUE 1.50.
       77 G2      COMP PIC S9(14)V9999      VALUE 1.50.
       77 Q2      COMP PIC S9(34)V99999     VALUE 1.50.
       77 P2      COMP-3 PIC S9(25)V999999  VALUE 1.50.
       77 Z2             PIC S9(24)V9999999 VALUE 1.50.
       77 GOOD    COMP-3 PIC 9(4)   VALUE 0.
       77 BAD     COMP-3 PIC 9(4)   VALUE 0.
       PROCEDURE DIVISION.
       MAINLINE.
           DISPLAY 'TESTMOV3 TEST SCALED MOVES'
           MOVE EH2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EH2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE DH2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DH2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE LH2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LH2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE EB2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE EB2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE DB2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DB2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE LB2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LB2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE ED2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE ED2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE DD2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE DD2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE LD2 TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE LD2 TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE F2  TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE F2  TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE G2  TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE G2  TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE H2  TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE H2  TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE P2  TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE P2  TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE Q2  TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Q2  TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           MOVE Z2  TO EH1 IF EH1 = EH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO DH1 IF EH1 = DH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO LH1 IF EH1 = LH1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO EB1 IF EH1 = EB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO DB1 IF EH1 = DB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO LB1 IF EH1 = LB1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO ED1 IF EH1 = ED1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO DD1 IF EH1 = DD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO LD1 IF EH1 = LD1 PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO F1  IF EH1 = F1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO G1  IF EH1 = G1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO H1  IF EH1 = H1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO P1  IF EH1 = P1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO Q1  IF EH1 = Q1  PERFORM GOOD ELSE PERFORM BAD.
           MOVE Z2  TO Z1  IF EH1 = Z1  PERFORM GOOD ELSE PERFORM BAD.          
           DISPLAY 'TOTAL GOOD = ' GOOD ' TOTAL BAD = ' BAD
           STOP RUN.
       GOOD.
           ADD 1 TO GOOD.
       BAD.
           ADD 1 TO BAD
           MOVE 16 TO RETURN-CODE
           DISPLAY 'BAD'.