       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTDSP1.
       AUTHOR.        DON HIGGINS.
       DATE-WRITTEN.  11/28/08.
      * TEST DISPLAY OF LITERLS AND ALL FIELD TYPES                         
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 TA USAGE POINTER VALUE 1.
       77 TD COMP-1 VALUE 1.234567.  
       77 TE COMP-2 VALUE 1.23456789012345.             
       77 TF COMP   PIC S9(9)  VALUE 123456789.       
       77 TG COMP   PIC S9(18) VALUE 123456789012345678.
       77 TH COMP   PIC S9(4)  VALUE 1234.
       77 TQ COMP   PIC S9(39) 
                    VALUE 123456789012345678901234567890123456789.
       77 TP COMP-3 PIC S9(31) VALUE 1234567890123456789012345678901.
       77 TP3 COMP-3 PIC S9(3) VALUE 123.
       77 TP4 COMP-3 PIC S9(4) VALUE 1234.
       77 TX        PIC X(5)   VALUE 'ABCDE'
       77 TZ        PIC S9(31) VALUE 1234567890123456789012345678901.
       77 TZ3       PIC S9(3)  VALUE 123.
       77 TZ4       PIC S9(4)  VALUE 1234.
       77 I  COMP   PIC S9(4).
      * EXPLICIT HFP, BFP, AND DFP USAGE TYPES
       77 HFP-SRT FLOAT-HEX-7      VALUE 1234567.
       77 HFP-LNG FLOAT-HEX-15     VALUE 123456789012345.
       77 HFP-EXT FLOAT-HEX-30 
                  VALUE 123456789012345678901234567890.
       77 BFP-SRT FLOAT-BINARY-7   VALUE 1234567.
       77 BFP-LNG FLOAT-BINARY-16  VALUE 1234567890123456.
       77 BFP-EXT FLOAT-BINARY-34
                  VALUE 1234567890123456789012345678901234.
       77 DFP-SRT FLOAT-DECIMAL-7  VALUE 1234567.
       77 DFP-LNG FLOAT-DECIMAL-16 VALUE 1234567890123456.
       77 DFP-EXT FLOAT-DECIMAL-34
                  VALUE 1234567890123456789012345678901234.
      * GENERIC FLOATING TYPES DEFAULT TO DFP 
      * ZCOBOL OPTION FLOAT(HEX/BINARY/DECIMAL) WILL ASSIGN AS REQ'D
       77 FLT-SRT FLOAT-SHORT      VALUE 1234567.
       77 FLT-LNG FLOAT-LONG       VALUE 1234567890123456.
       77 FLT-EXT FLOAT-EXTENDED   
                  VALUE 1234567890123456789012345678901234.
       PROCEDURE DIVISION.
       MAINLINE.
           DISPLAY 'TESTDSP1 DISPLAY LITERALS AND ALL FIELD TYPES'
           DISPLAY 'TA =' TA
           DISPLAY 'TD =' TD
           DISPLAY 'TE =' TE
           DISPLAY 'TF =' TF
           DISPLAY 'TG =' TG
           DISPLAY 'TH =' TH
      *     DISPLAY 'TL=' TL
           DISPLAY 'TQ =' TQ
           DISPLAY 'TP =' TP
           DISPLAY 'TP3=' TP3
           DISPLAY 'TP4=' TP4
           DISPLAY 'TX =' TX
           DISPLAY 'TZ =' TZ
           DISPLAY 'TZ =' TZ3
           DISPLAY 'TZ4=' TZ4
           DISPLAY 'HFP-SRT=' HFP-SRT
           DISPLAY 'HFP-LNG=' HFP-LNG
           DISPLAY 'HFP-EXT=' HFP-EXT
           DISPLAY 'BFP-SRT=' BFP-SRT
           DISPLAY 'BFP-LNG=' BFP-LNG
           DISPLAY 'BFP-EXT=' BFP-EXT
           DISPLAY 'DFP-SRT=' DFP-SRT
           DISPLAY 'DFP-LNG=' DFP-LNG
           DISPLAY 'DFP-EXT=' DFP-EXT
           DISPLAY 'FLT-SRT=' FLT-SRT
           DISPLAY 'FLT-LNG=' FLT-LNG
           DISPLAY 'FLT-EXT=' FLT-EXT
           DISPLAY '  TH' '  TH' '  TH'
           DISPLAY TH TH TH
           MOVE    -1 TO TA
           MOVE    -1 TO TD
           MOVE    -1 TO TE
           MOVE    -1 TO TF
           MOVE    -1 TO TG
           MOVE    -1 TO TH
      *     MOVE    -1 TP TL
           MOVE    -1 TO TP
           MOVE    -1 TO TZ
           DISPLAY 'DISPLAY -1 FOR EACH TYPE'
           DISPLAY 'TA=' TA
           DISPLAY 'TD=' TD
           DISPLAY 'TE=' TE
           DISPLAY 'TF=' TF
           DISPLAY 'TG=' TG
           DISPLAY 'TH=' TH
      *     DISPLAY 'TH=' TL
           DISPLAY 'TP=' TP
           DISPLAY 'TX=' TX
           DISPLAY 'TZ=' TZ
           DISPLAY 'TESTDSP1 ENDED OK'
           STOP RUN.
          
