       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTISP1.
       AUTHOR.        DON HIGGINS.
      * TEST INSPECT TALLYING, REPLACING, CONVERTING.
      * 03/17/09 DSH INITIAL CODING
      * 01/25/12 DSH RPI 1181 ADD TEST 22 INSPECT REPLACING ALL LOW-VALUES BY SPACES
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01  RECORD PIC X(80) VALUE 'AACDDGGGA'.
        77  COUNT  COMP PIC S9(9).
        77  GOOD   COMP PIC S9(9) VALUE 0.
       PROCEDURE DIVISION.
       MAINLINE.
           MOVE 0 TO COUNT
     1     INSPECT RECORD TALLYING COUNT FOR CHARACTERS BEFORE 'D'
           IF COUNT NOT = 3 PERFORM BAD ELSE PERFORM GOOD.
           MOVE 0 TO COUNT
     2     INSPECT RECORD TALLYING COUNT FOR CHARACTERS AFTER 'C'
           IF COUNT NOT = 77 PERFORM BAD ELSE PERFORM GOOD.
           MOVE 0 TO COUNT
     3     INSPECT RECORD TALLYING COUNT FOR ALL 'A' 
           IF COUNT NOT = 3 PERFORM BAD ELSE PERFORM GOOD.
           MOVE 0 TO COUNT
     4     INSPECT RECORD TALLYING COUNT FOR ALL 'A' BEFORE 'D'
           IF COUNT NOT = 2 PERFORM BAD ELSE PERFORM GOOD.
           MOVE 0 TO COUNT
     5     INSPECT RECORD TALLYING COUNT FOR ALL 'A' AFTER 'C'
           IF COUNT NOT = 1 PERFORM BAD ELSE PERFORM GOOD.
           MOVE 0 TO COUNT
     6     INSPECT RECORD TALLYING COUNT FOR LEADING 'A' 
           IF COUNT NOT = 2 PERFORM BAD ELSE PERFORM GOOD.
           MOVE 0 TO COUNT
     7     INSPECT RECORD TALLYING COUNT FOR LEADING 'B' 
           IF COUNT NOT = 0 PERFORM BAD ELSE PERFORM GOOD.
           MOVE 0 TO COUNT
     8     INSPECT RECORD TALLYING COUNT FOR LEADING 'D' AFTER 'C'
           IF COUNT NOT = 2 PERFORM BAD ELSE PERFORM GOOD.
           MOVE 0 TO COUNT
     9     INSPECT RECORD TALLYING COUNT FOR LEADING 'E' AFTER 'C'
           IF COUNT NOT = 0 PERFORM BAD ELSE PERFORM GOOD.
    10     INSPECT RECORD REPLACING CHARACTERS BY 'X' BEFORE 'C'
           IF RECORD NOT = 'XXCDDGGGA' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    11     INSPECT RECORD REPLACING CHARACTERS BY ' ' AFTER 'C'
           IF RECORD NOT = 'AAC'       PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    12     INSPECT RECORD REPLACING ALL 'A' BY 'X' BEFORE 'C'
           IF RECORD NOT = 'XXCDDGGGA' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    13     INSPECT RECORD REPLACING ALL 'A' BY 'X' AFTER 'C'
           IF RECORD NOT = 'AACDDGGGX' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    14     INSPECT RECORD REPLACING LEADING 'A' BY 'X' BEFORE 'C'
           IF RECORD NOT = 'XXCDDGGGA' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    15     INSPECT RECORD REPLACING LEADING 'D' BY 'X' AFTER 'C'
           IF RECORD NOT = 'AACXXGGGA' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    16     INSPECT RECORD REPLACING FIRST 'A' BY 'X' BEFORE 'C'
           IF RECORD NOT = 'XACDDGGGA' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    17     INSPECT RECORD REPLACING FIRST 'G' BY 'X' AFTER 'C'
           IF RECORD NOT = 'AACDDXGGA' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    18     INSPECT RECORD CONVERTING 'AC' TO '12' BEFORE 'D'
           IF RECORD NOT = '112DDGGGA' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    19     INSPECT RECORD CONVERTING 'AD' TO '12' AFTER 'C'
           IF RECORD NOT = 'AAC22GGG1' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    20     INSPECT RECORD CONVERTING 'AD' TO '12' 
           IF RECORD NOT = '11C22GGG1' PERFORM BAD ELSE PERFORM GOOD.
           MOVE 'AACDDGGGA' TO RECORD
    21     TRANSFORM RECORD CHARACTERS FROM 'AD' TO '12' 
           IF RECORD NOT = '11C22GGG1' PERFORM BAD ELSE PERFORM GOOD.
           MOVE LOW-VALUES TO RECORD
    22     INSPECT RECORD REPLACING ALL LOW-VALUES BY SPACES 
           IF RECORD NOT = SPACES PERFORM BAD ELSE PERFORM GOOD.
           DISPLAY 'TESTISP1 GOOD TESTS =' GOOD 
           STOP RUN.
       GOOD.
           ADD 1 TO GOOD
       BAD.
           MOVE 16 TO RETURN-CODE
           STOP RUN.
