.* COPYRIGHT (C) 1988, PAUL A. SCOTT, ALL RIGHTS RESERVED               00010000
         MACRO                                                          00020000
&LABEL   PSMROPS                                                        00030000
.*                                                                      00040000
         COPY  PSMGBL02                                                 00050000
         LCLA  &I,&K                                                    00060000
         LCLC  &C,&R1,&R2                                               00070000
.*                                                                      00080000
.A010    ANOP                                                           00090000
.*                                                                      00100000
&C       SETC  '&SYSLIST(1,1)'                                          00110000
         AIF   ('&C'(1,1) NE '(').A020                                  00120000
&C       SETC  '&C'(2,K'&C-2)                                           00130000
.*                                                                      00140000
.A020    ANOP                                                           00150000
&I       SETA  1                                                        00160000
&K       SETA  K'&C                                                     00170000
.*                                                                      00180000
.A030    ANOP                                                           00190000
         AIF   (&I GT &K).A040                                          00200000
         AIF   ('&C'(&I,1) EQ ',').A040                                 00210000
&I       SETA  &I+1                                                     00220000
         AGO   .A030                                                    00230000
.*                                                                      00240000
.A040    ANOP                                                           00250000
&R1      SETC  '0'                                                      00260000
&R2      SETC  '0'                                                      00270000
.*                                                                      00280000
         AIF   ('&C'(1,1) EQ ',').A050                                  00290000
&R1      SETC  '&C'(1,&I-1)                                             00300000
.*                                                                      00310000
.A050    ANOP                                                           00320000
         AIF   (&I GE &K).A060                                          00330000
&R2      SETC  '&C'(&I+1,&K-&I)                                         00340000
.*                                                                      00350000
.A060    ANOP                                                           00360000
         PSMROP  (&R1,&R2)                                              00370000
.*                                                                      00380000
         MEND                                                           00390000
