         MACRO
         ARCHLVL 
         GBLA  &ARCHLVL
.* &ARCHLVL SETA     2 OS   32 BIT LINKAGE 
.* &ARCHLVL SETA  5 Z/OS 64 BIT LINKAGE AND Z9-109 INSTRUCTIONS
&ARCHLVL SETA  7 Z/OS 64 BIT LINKAGE AND Z10 INSTRUCTIONS
         GBLC  &ARCHSFX
         AIF   (&ARCHLVL LE 2).SKIPG
&ARCHSFX SETC  'G'
.SKIPG   ANOP
         MNOTE 'ARCHLVL=&ARCHLVL ARCHSFX=&ARCHSFX'
.*
.* THIS GLOBAL VARIABLE REQUIRED BY FPCONVRT.MLC AND FPCONMFC.MLC
.*
         MEND
