*********************************************************************
* Copyright 2007 Automated Software Tools Corporation               *
* This source code is part of z390 assembler/emulator package       *
* The z390 package is distributed under GNU general public license  *
* Author - Don Higgins                                              *
* Date   - 04/23/07                                                 *
*********************************************************************
* 08/31/07 INITIAL CODING OF RRDS VARIABLE LENGTH RECORD TESTS           
* 09/21/07 RPI 702 CHANGE DIR TO KEY FOR ACCESS BY REC#                  
* 10/24/07 RPI 724 CHANGE FOR RRN STARTING AT 1                       
*********************************************************************
RRV1TEST RT1   MAIN 
VACBOUT  ACB   DDNAME=VFILE,MACRF=(KEY,OUT)
VACBIN   ACB   DDNAME=VFILE,MACRF=(KEY,IN)
VRPLOUT  RPL   ACB=VACBOUT,AREA=RECORD,OPTCD=(KEY),ARG=REC#
VRPLIN   RPL   ACB=VACBIN,AREA=RECORD,OPTCD=(KEY),ARG=REC#
RECORD   DC    CL500' '
REC#     DC    F'0'
         LTORG
         EQUREGS
         RT1   START
*
* BUILD VSAM RRDS VARIABLE LENGTH FILE WITH 3 RECORDS
*
         WTO   'RRV1TEST CREATE RRDS VFILE WITH 3 RECORDS'
         OPEN  (VACBOUT,(OUTPUT))
         LTR   R15,R15
         RT1   CC0
         MVC   RECORD(100),=100C'1'
         MVC   REC#,=F'1'
         MODCB RPL=VRPLOUT,RECLEN=100
         LTR   R15,R15
         RT1   CC0
         PUT   RPL=VRPLOUT
         LTR   R15,R15
         RT1   CC0
         MVC   RECORD(250),=250C'5'
         MVC   RECORD+250(250),=250C'5'
         MVC   REC#,=F'5'
         MODCB RPL=VRPLOUT,RECLEN=500
         LTR   R15,R15
         RT1   CC0
         PUT   RPL=VRPLOUT
         LTR   R15,R15
         RT1   CC0
         MVC   RECORD(200),=200C'3'
         MVC   RECORD+200(100),=100C'3'
         MVC   REC#,=F'3'
         MODCB RPL=VRPLOUT,RECLEN=300
         LTR   R15,R15
         RT1   CC0
         PUT   RPL=VRPLOUT
         LTR   R15,R15
         RT1   CC0
         CLOSE (VACBOUT)
         LTR   R15,R15
         RT1   CC0
*
* READ AND VERIFY 3 VSAM RRDS VARIABLE LENGTH RECORDS 
*
         WTO   'RRV1TEST READ AND VERIFY VFILE RECORDS'
         OPEN  (VACBIN)
         LTR   R15,R15
         RT1   CC0
         MVC   REC#,=F'1'
         GET   RPL=VRPLIN
         LTR   R15,R15
         RT1   CC0
         TESTCB RPL=VRPLIN,RECLEN=100
         RT1   CC0
         CLC   RECORD(100),=100C'1'
         RT1   CC0
         MVC   REC#,=F'3'
         GET   RPL=VRPLIN
         LTR   R15,R15
         RT1   CC0
         TESTCB RPL=VRPLIN,RECLEN=300
         RT1   CC0
         CLC   RECORD(200),=200C'3'
         RT1   CC0
         CLC   RECORD+200(100),=100C'3'
         RT1   CC0
         MVC   REC#,=F'5'
         GET   RPL=VRPLIN
         LTR   R15,R15
         RT1   CC0
         TESTCB RPL=VRPLIN,RECLEN=500
         RT1   CC0
         CLC   RECORD(250),=250C'5'
         RT1   CC0
         CLC   RECORD+250(250),=250C'5'
         RT1   CC0
         CLOSE (VACBIN)
         LTR   R15,R15
         RT1   CC0
*
* REWRITE RECORD 3 WITH LENGTH OF 350 FILLED WITH C'T'
*
         WTO   'RRV1TEST REWRITE RECORD 3 WITH LENGTH 350'  
         OPEN  (VACBOUT,(OUTPUT))
         LTR   R15,R15
         RT1   CC0
         MVC   RECORD(200),=200C'T'
         MVC   RECORD+200(150),=150C'T'
         MVC   REC#,=F'3'
         MODCB RPL=VRPLOUT,RECLEN=350
         LTR   R15,R15
         RT1   CC0
         PUT   RPL=VRPLOUT
         LTR   R15,R15
         RT1   CC0
         MVC   REC#,=F'3'
         GET   RPL=VRPLOUT
         LTR   R15,R15
         RT1   CC0
         TESTCB RPL=VRPLOUT,RECLEN=350
         RT1   CC0
         CLC   RECORD(200),=200C'T'
         RT1   CC0
         CLC   RECORD+200(150),=150C'T'
         RT1   CC0
         CLOSE (VACBOUT)
         LTR   R15,R15
         RT1   CC0
         RT1   END
         END
